				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "4-Ingredient Keto Peanut Butter Cookies"
,"datePublished": "2019-10-08T00:22:15.000-04:00"
,"dateModified": "2022-05-16T10:35:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Fioa"
,"url": "https://www.allrecipes.com/cook/fiorellasrecipes"
}
]
,"description": "These keto peanut butter cookies are made with 4 ingredients: peanut butter, vanilla, egg, and natural sweetener for a soft and chewy, low-carb treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eo_RfHt5NYkRLeRntPmXb_eTm6g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6723979-443b4589ccc147989edb4fa775d1b7be.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "4-Ingredient Keto Peanut Butter Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "113"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "133 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "105 mg"
,"sugarContent": "2 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup peanut butter",
"0.5 cup low-calorie natural sweetener (such as Swerve®)",
"1 egg",
"1 teaspoon sugar-free vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Combine peanut butter, sweetener, egg, and vanilla extract in a bowl; mix well until a dough is formed."
} ,{
"@type": "HowToStep"
,"text": "Roll dough into 12 (1-inch) balls. Place on the prepared baking sheet and press down twice with a fork in a criss-cross pattern."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until edges are golden, 12 to 15 minutes. Cool for 1 minute before transferring to a wire rack to cool completely."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy, excellent and a simple recipe to follow for anybody! I use 12 packages of Splenda…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used crunchy peanut butter instead of smooth..like other people I found them a but dry so I used two medium eggs and found they wasn't as dry and a nice crunch to them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Zaire Goulet"
},
"reviewBody": "Whenever making a recipe for the first time it's always good to look at the reviews first to see how many other people feel about the recipe in front of you. Only 4 ingredients- what could go that wrong? I jumped to the 1 star reviews first to get an idea of that possibility and many mentioned how crumbly and how easily the cookie fell apart. Some suggested using 1 Tablespoon of butter to hold it together better. I tried that method. So with a slightly modified recipe, this with a Truvia sweetener instead of Swerve, plus 1 Tablespoon of butter I give it 3/5 stars. Right out of the oven it falls apart. You have to let it cool completely for the cookie to hold together. However as soon as you take a bite out of it, the cookie crumbles in your hand. The flavor isn't the same as sugar based peanut butter cookies, you still can notice the sweetener flavor.(maybe next time i'll try to remember to cut the sweetener down like I normally do with sugar based recipes as usually its always way too much sugar.) Though I guess that's something people have to get use to... the sweetener taste, but also all sweeteners aren't the same and some are much, much worse then Truvia. I'm beginning to think cookies with sweeteners might not be the best route. I've made cheesecakes with Truvia sweeteners and they tasted great! So I'm not sure if its the formula of this specific recipe or just cookies with sugar substitutes in general aren't that great, but it's something i'll have to test more. Also to note the type of peanut butter used is probably VERY important for this recipe. The author doesn't specify but if you're using a peanut butter spread like Jiffy or something with vegetable oils or fats, it will probably turn out different then if its made with more healthier ingredients like just roasted peanuts and salt.(which is what I used- a generic Kroger(midwest store)brand \"Glutten Free Natural Creamy Peanut Butter\") The initial taste of this cookie (tip of the tongue) is somewhat sweet, but it's not a peanut butter flavor. Only when chewing the cookie and on the back of the tongue or aftertaste you notice hints of the peanut butter flavor. These were okay cookies. They had a mild peanut butter flavor and a sweet flavor, but weren't wonderfully delicious and issues with the crumble factor, gave it a lower rating then I would have liked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Cookie is definetly dry and crumbly. Good flavor. Carb value is incorrect. Should be 4G per cookie. Wish I would have read some of the reviews. I will definitely add butter next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Lurk"
},
"reviewBody": "Definitely crumbly, though not dry. I put them in the freezer to cool and they were fantastic. Great flavour. I used a monk fruit/erythritol sugar substitute. I also didn't roll them in to balls because the dough seemed too sticky for that. I also used crunchy peanut butter. So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy to make and tastes great for being sugar free. I doubled the recipe and added 4 tbs of real butter to prevent drying out. I baked for 20 minutes and they held together nicely. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debrabentlage"
},
"reviewBody": "Making these keto cookies for. Friend celebrating a three year anniversary with his pup. The pup is getting special treats too! The last time I made this I fell apart. This time, I put a little bit of almond butter with the peanut butter to see if I can get a different consistency. They’re always good - crumbs or no crumbs. Low/no sugar too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Incredibly simple and quick to make. My only feedback is that the sugar-free sweetener we used has ended up having an overpoweringly metallic/fake-sugar taste in the end result. I think next time I might try with Monk Fruit or a similar natural low-cal sweetener."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Izzy"
},
"reviewBody": "This is the BEST keto cookie recipe by far!!!! My kids and husband loved them even if you aren't on a keto diet you should try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added tru nut peanut butter powder -1 T And one T cooking oil And rolled into balls and out in fridge before baking Came out good for not having any flour or sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LisaMarie"
},
"reviewBody": "This is the second time making these cookies and they just crumble even after letting them cool to set up. Not sure how to eat maybe in a bowl with milk!???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aizausa10"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aizausa13"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bastett35"
},
"reviewBody": "Tasted ok but crumbed after cooling when trying to gently pick one up to try. I added a tablespoon of butter to the original recipe reading some reviews before baking but didn’t seem to help unfortunately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy Simmons"
},
"reviewBody": "Loved them! Next time I will make them each smaller to minimize carbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Eric Bewley"
},
"reviewBody": "This must be specific to the peanut butter used. I used Organic Pfit B peanut butter powder, and they never got thick enough to roll, they do not taste good at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke Pearson"
},
"reviewBody": "Absolutely delish. Great keto snack for sure . One question tho has anyone frozen these after baked? I want to make a larger batch to have on hand when I need a sweet treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bperdue3215"
},
"reviewBody": "I have made these several times and these are a go to snack for me. Was very disappointed the recipe didn't yield many cookies. Was looking at the store and found coconut flour (low carb) and added some to see what would happen. For sure it yielded more cookies and also layers of flavor. I don't know how this affects the Keto benefit of these? Maybe someone could comment on that.? Good cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa Dickerson"
},
"reviewBody": "A little dry, husband loves them. May try to add some butter for a less dry cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GhaVO"
},
"reviewBody": "Needs modification.\n\nTaste: Good. I used Stevia and it has a distinct taste to it. It is still very peanut buttery.\n\nTexture: Meh. Like a lot of complaints, it is very crumbly and dry. The Philippines has a similar textured sweet snack called Polvoron, so I'm used to it. It definitely does NOT have your typical cookie consistency.\n\nPrep: Easy. Takes longer to get the ingredients than to bake.\n\nConclusion: It needs a stronger binding agent than eggs. I just got some Almond flour so I may modify the recipe to incorporate it to have more of a cookie like experience."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "I added a little butter and almond flour cuz I didn’t want to get the “crumbles” that many have talked about and it came out fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Abbott"
},
"reviewBody": "No changes this time around but maybe in the future I may add raisins or oatmeal. I did use stevia instead of suggestion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Ervin"
},
"reviewBody": "I adjusted the recipe by making 2 inch balls and baking 8-10 minutes. After cooling, gently transfer to individual snack bags and out in the freezer. They hold together much better but will try some of the tips offered in other reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kay B"
},
"reviewBody": "I don't really like peanut butter cookies so I used unsweetened all nature almond butter instead. For my sweetener, I used Swerve (the confectioner one). I added a bit of cinnamon and baked for about 12 minutes. SO GOOD It's important to let these cookies cool so they don't crumble!!! Next time, I might cut back on the sweetener as these were a bit too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Buckanear Bill"
},
"reviewBody": "I used brown coconut sugar. The last time I made it I used Monk Fruit, and they had an odd taste. I also added a tsp of molasses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tyler"
},
"reviewBody": "Definitely a little dry, but overall the taste was extremely satisfying. Maybe add some butter to combat the dryness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenbshaneb"
},
"reviewBody": "I love this recipe! I have made it 4x. The 1st was with swerve and a 1/2 cup was a little overwhelming. The 2nd I used swerve but a 1/4 cup I liked it better. The 3rd I used King Arthur's sugar alternative 1/4 cup, it could have used a little more but it was good. That brand makes awesome baked goods. The 4th time I used monk fruit 1/4 cup and added a few chocolate chips, I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Turchin"
},
"reviewBody": "I added in a tbs of butter. These cookies are flaky and crunchy and delicious with a glass of almond milk. Also super easy to make !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celia Cook"
},
"reviewBody": "This recipe was given to me by a friend, as I have a serious sweet tooth and a raging case of the 'betes. SO, here is my diabetic 2 cents. \nBY FAR these are the best sweets I have made while trying to keep my carb counts low. \n\nHowever, the listed nutrition facts cannot be possible. \nIf there are 8g of carbs in 2tbl of peanut butter and cup has 16 tablespoons in it. 16tbl/2tbl=8servings per cup \nthus: 8*8=64g. 64g/12(servings)=5.34g per cookie. Basically, by the numbers, these rock. \nNow, I did personally add about a 1/4c of almond flour to mine to sort of pull it together a bit. That adds another 5g to the whole batch. . which still keeps each cookie under 6g per cookie. And none of this math takes into account dietary fiber, which is a huge chunk of the carb count- netting you a better number. \n\nps. I failed maths in college, so I do not claim perfection with my calculations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I looked at some of the reviews first, and tried suggestions. I used Swerve confectioners sweetener and added 1 Tbsp. of butter. The dough was very dry and crumbly. So I added a little water (1-2 Tbsps.) until the dough was easy to stir. They are okay. I might try them again with monk fruit sweetener and some coconut flour to improve the taste and texture. I will review again if I try them with other modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "McKenzie Click"
},
"reviewBody": "I liked this recipe very well,but the cookies were very dry and crumbly; as soon as I picked one up it broke off a piece of it I put mine in the refrigerator for 5 mins. and they were a little less crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn Elder"
},
"reviewBody": "My very 1st KETO Recipe was Great!! \nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Vulture 061"
},
"reviewBody": "I used the Jif no added sugar peanut butter but it’s very good, it doesn’t fall apart that bad, a little bland but a very tasty change from pepperoni slices and pork rinds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joanne"
},
"reviewBody": "Love these cookies! Easy and quick to make and don't taste like diet cookies. Just enough sweetness to satisfy my late night sugar craving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Raine"
},
"reviewBody": "My boyfriend loves peanut butter cookies and I made these for him. He has requested them again, if someone can come up with a way to make them not so dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keitha Roth"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathy Taylor"
},
"reviewBody": "I really liked this. I used 2/3 cup of monk fruit sweetner. I should have taken it down to maybe half a cup. I also used reg jif crunchy. I love jif but next time creamy should be used. The nuts separated. I made only 4 and then freezed the batter. My husband really liked it and it satisfies a craving easily"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwillvbullock2021"
},
"reviewBody": "Super easy and smell so amazing! These are going to definitely help with the cravings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "willbullock"
},
"reviewBody": "Super easy and smell so amazing! These are going to definitely help with the cravings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvcookin"
},
"reviewBody": "I thought the recipe was super easy to make and the cookies taste super, So glad to be able to eat peanut butter cookies again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emily edwards"
},
"reviewBody": "DELICIOUS. These are dangerous haha I can only make these when I really have a sweet tooth or I’ll eat all of them. I used granulated monk fruit sweetener and it elevated them so much. I strongly recommend these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Charis Murray"
},
"reviewBody": "I’m not A pro baker but I’m also no slouch. \n I re-read the directions about 4 times after I made them to figure out what I did wrong. They turned out so dry and tasteless it was not good. \nI wanted to like them but they were pretty awful , I’m so sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dodie"
},
"reviewBody": "It tasted bland but OK, but the biggest problem was that they crumbled, totally. All cookies became crumbs. I hope to use it as a base for a cheesecake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ash d"
},
"reviewBody": "Soooo good!! Baked for 9 minutes. I also added walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pepper's Momma"
},
"reviewBody": "The weirdest texture for a cookie ever. The taste is okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Love these. No did it exactly like recipe.. Might afd stuff next time. But great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Greg Douglas"
},
"reviewBody": "Was nowhere near as sweet as I was expecting. Then I figured it out. The recipe shows 12.3 grams of carbs per cookie. Well, 1 cup of my “all natural peanut butter” is 3 grams of carbs per tablespoon, and simple math says that 1 cup would be 48 grams. Divided by 12 cookies is about 4 grams per cookie, not 12. So the recipe calls for sweetened peanut butter. (I thought this was a “keto recipe”????) It should probably specify that since the same people who would have “Swerve” would also probably have unsweetened “peanuts only” peanut butter as well. \n\nAnyway, they tasted okay. Never really formed a “dough” just lots of little balls. They squished together just fine tho. \n\nSince the very next recipe was for the chocolate version of these and since I love peanut butter cups, I figured I would make half peanut butter, half chocolate and then cut some of the dough balls in half and Frankenstein them together to make yin-yan kind of cookies. Worked out just fine. Would probably opt for more sweetener next time, and continue with unsweetened peanut butter for “keto cookies”\n\nOr just go with another recipe. Honestly I wouldn’t make these again. They taste mildly of peanut butter (even the “peanut butter only” ones I made) and a strong taste of artificial sweetener. Too much compromise. Nice idea, but wouldn’t make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Steeves"
},
"reviewBody": "They turned out great! I would have given them five stars but I found them a bit on the sweeter side so I’ll cut back next time. I didn’t have dryness issues at all, baked them for 9 minutes. I also used all natural PB so maybe the oil helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamieka Taylor"
},
"reviewBody": "I made them and they came out perfect and they were very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crispn22"
},
"reviewBody": "Made just as the recipe said and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Blafield"
},
"reviewBody": "I tweaked this recipe and it was perfect, I made just as it states the first time - they were terrible ! Harder than a rock ! The second time I added a tablespoon of butter, less than a quarter cup of almond flour, and used natural pb. I think the oils in the natural pb also helped. I baked for exactly 11 minutes, came out awesome, will def make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Augustitus"
},
"reviewBody": "I baked my cookies at 325 for 10 minutes. Cooled for a few minutes on parchment then carefully moved them to a cooling rack. Once fully cooled they were not crumbly at all. I used 1 1/2 c. homemade nut butter and added Lilys chocolate chips. Next time I will use a little less sweetener. It was a bit too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bootsie Ardito"
},
"reviewBody": "7 minutes in convection oven worked well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Eileen Morrow"
},
"reviewBody": "Very dry!! Feels like dust in your mouth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Cowart Brady"
},
"reviewBody": "I made these using the instructions as above once and enjoyed them , even crumbled some into Rebel vanilla icecream\nThe second batch I made using 1 cup of swerve brown sugar substitute and they were even better I also added Libby’s dark chocolate chips"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staceyRN"
},
"reviewBody": "I made these cookies yesterday and am so pleased with how they turned out. They are delicious! I did make a few modifications to the recipe based on the reviews that I read. I added about a 1/4 cup of almond flour as well as 2 tablespoons of butter. I also added one tablespoon of coconut oil to help combat the dryness that some reviews described. I baked them for 9 minutes. Recipe made 2 dozen cookies. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mike Lloyd-Hayes"
},
"reviewBody": "As other have said, watch the bake time.\nAlso, make sure you use and unsweetened peanut butter. Many brands out there are practically peanut flavoured icing. \nAlso, add some unsalted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacy Kinser"
},
"reviewBody": "They are ok, I read all the reviews and added more peanut butter and 1 tablespoon of butter and used monkfruit, They have a good flavor but are a frail cookie, not sure what to do to make them better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chara Caponigro"
},
"reviewBody": "I followed the recipe but added 1.5 tablespoons of butter. Cooked for 9-10 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert"
},
"reviewBody": "Not sure why so many people are having an issue with dryness. My guess would be the peanut butter. I make my own, and it's moist and creamy - as a result, so are the cookies. I added 1/4 Cup Coconut Flour, 1/2 teaspoon baking soda and 1/4 Cup of White Chocolate Chips (keto, of course) and the cookies came out amazing. It really improved the texture. I may also add a touch of Almond Flour on the next round. If your peanut butter is dry and hard to stir, I am sure your cookies will suffer as a result. Take the time (10 minutes) and make your own. 2 cups of peanuts, 2 tablespoons of peanut oil, 2 Tablespoons of sweetener, dash of salt, and you're off to the races. Just be sure to blend the peanuts by themselves for about a minute.. add half the oil, blend another minute, then the remaining oil, salt and sweetener. Blend until you have your desired consistency. Well worth the time and effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juschas"
},
"reviewBody": "Can’t believe how simple it was to make and they are really delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stephen Pierson"
},
"reviewBody": "I made an account just to let people know these went from oven to trash can in record time. Literally turn to dust in the hand, and concrete in the mouth. I'd rather eat carbs than these cookies. Hard skip on this recipe. Made it twice, with different PB and sweetener. One time cooked for 15 min, the other for 12. Just awful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rick Brand"
},
"reviewBody": "tastes awful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kokosmom2"
},
"reviewBody": "I used a small cookie scoop and got 24 cookies. I cooked them 12 min and they turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "G-man"
},
"reviewBody": "I didn't make any changes. Just a bit to dry for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I made these as directed using a monk fruit granulated sweetener. It mixed well and did not have any grit in the baked cookie. They key for success is letting the cookie cook adequately. Once cooled it holds together nicely. Very tasty! This is the first keto cookie I've made. I'm glad it was a success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sybil Rosado"
},
"reviewBody": "These were great! I added a little MCT oil and they taste just like the real thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tasteotexasmusic"
},
"reviewBody": "This is a really good recipe.. super easy to make. I used 1/2 Swerve confectioners and 1/2 monkfruit sweetener. It didn't turn out as sweet as I had hoped, but that's my fault as I was tasting the batter and misjudged it... but it still was tasty enough to satisfy the 'sweet tooth'... I will simply add a little more next time. I also added 1 tablespoon of almond flour as the peanut butter I used had quite a bit of oil in it and was not as 'thick' as others, so the almond flour helped thicken it up. This will be a recipe that I use again.. In fact, I'll probably make a batch for Christmas so that we can enjoy a 'sweet treat' and still not blow our keto diet :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a really good recipe.. super easy to make. I used 1/2 Swerve confectioners and 1/2 monkfruit sweetener. It didn't turn out as sweet as I had hoped, but that's my fault as I was tasting the batter and misjudged it... but it still was tasty enough to satisfy the 'sweet tooth'... I will simply add a little more next time. I also added 1 tablespoon of almond flour as the peanut butter I used had quite a bit of oil in it and was not as 'thick' as others, so the almond flour helped thicken it up. This will be a recipe that I use again.. In fact, I'll probably make a batch for Christmas so that we can enjoy a 'sweet treat' and still not blow our keto diet :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HealthChef"
},
"reviewBody": "This recipe is a nice start. It came out a little crumbly the first time but I reduced my baking time to 9-10mins at 375f. I used almond butter the second time, swerve instead of sugar, added 4 Tbsp butter, 1/8 cup almond flour, 1/2 tsp baking powder. I let it cool thoroughly and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "Didn’t want to over bake. Checked them at 12 minutes. Goo. 3 minutes more. Still goo. 3 more minutes. Decided to just let them sit the put on cooling rack. Had to gingerly transfer to cooling rack. Most separated. The taste is great. Just never achieved the “golden brown” edges. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Athena Begay"
},
"reviewBody": "It’s a good recipe I should have read the reviews. I cooked mine for 14 minutes and they crumbled when I picked it up :( but still tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shenika"
},
"reviewBody": "Thanks for the recipe. Just starting my keto journey and I'm thankful for these recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "valerie dixon"
},
"reviewBody": "I have made these several times and each time they come out different. I think the key is to get the timing right and I also noticed a difference using different brands of peanut butter. I have found that 12 minutes works well for me ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harvest Carpenter"
},
"reviewBody": "I followed the recipe exactly (ingredients, bake time and temp) and they turned out perfectly. You have to allow them to cool properly before trying to move them or they will crumble, as most cookies will."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra S Martin"
},
"reviewBody": "I use almond butter for these. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne Sands Aston"
},
"reviewBody": "Quick and easy, moist and tasty.\n\nThis is my go to recipe for cookies.\nSometimes I add a handful of raisins too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Annette Lang"
},
"reviewBody": "Taste very good, looks great but falls appart too easy ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MikeandMichelle Nixon"
},
"reviewBody": "Very sweet and not peanut buttery enough. The texture is very cookie like and I will probably try again with less sweetener. I used Swerve, but changed out 2 tbsp of Swerve for Swerve brown. I also added a tbsp of butter like the reviews suggested and only baked for 10 minutes. Used fresh ground peanut butter instead of a creamier type. Next time, I will try with creamy pb. For the person who said that you subtract all of the carbs from the sweetener, you have this backwards. you take the total carbs and subtract sugar alcohols and fiber to get net carbs. If you make these with fresh peanut butter and swerve, they are about 1 carb per cookie. I got 18 cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WendyS"
},
"reviewBody": "I'll make these again, they are pretty good for the keto diet I am on. Definitely more dense than a traditional peanut butter cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjtorrespalmer"
},
"reviewBody": "Made it and turned out really good! It was just hard to make it look nice with the fork when molding it coz it's sticking but overall pretty good fat bomb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lora"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jamie Bowen"
},
"reviewBody": "Made it as described. Fell apart when trying to get off baking sheet. Dry and tastes just like dried PB. Save yourself some steps. Eat plain PB off spoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennifer deneault"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Pasquale"
},
"reviewBody": "I made these, but without the vanilla extract. Get Taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kaci Guisinger-Harrison"
},
"reviewBody": "Did not turn out well. Taste is not great either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whistle"
},
"reviewBody": "Added one T of butter and baked for 8 minutes. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Vonburg"
},
"reviewBody": "Very delicious. To combat dryness I recommend adding 1 tablespoon of butter. My cookies came out delicious and I used Swerve confectioners sweetener."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve S"
},
"reviewBody": "What a nice treat. I cooked them for 10 minutes and they were moist and not at all dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ce Ly"
},
"reviewBody": "These cookies are delicious! Great diet option!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alissah Shadid"
},
"reviewBody": "I made these peanut butter cookies with stevia and found them to be way too sweet. My non-low carb family members actually liked them, though. Maybe it's just my taste buds, but I'll be cutting back on the sweetener next time. I will say that the texture was just right; didn't crumble or fall apart! I rolled them into 1 inch balls before pressing with a fork, then baked for 9 minutes. Nice consistency, just too sweet for my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MBadr"
},
"reviewBody": "It was really good. Always wanted to find some good Keto snacks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda T"
},
"reviewBody": "I followed this recipe exactly as written, but they turned out like sand, dry and crumbles to the touch. I should've read other reviews first, and I would've seen others say the baking time is off. I'll try again with less baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April D"
},
"reviewBody": "Okay 2nd time making these, and I added 1/2 cup more of peanut butter and changed the sweetner to Lakanto Monk Fruit Sweetner 1:1.. I also cooked them for only 10-11 minutes to not dry them out and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gracie Krohne"
},
"reviewBody": "Loved this recipe....i did add a little almond flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darmstro67"
},
"reviewBody": "Everyone is asking for the recipe ... brought them to work. I baked them for 10 minutes because the other Review said not to do 12 but they were too gooey at 8.... and they are perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ebc88"
},
"reviewBody": "For keto cookies they were good. They are alittle on the dry side, but nothing to terrible"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denver Grayson"
},
"reviewBody": "To the person that claims these aren't keto you must be new to this woe. You get to deduct all carbs from the sweetner you use so long as it is a keto sweetner. I would estimate the net carbs around 2-3 per cookie \n\nThese cookies are great. Watch the bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leelee123"
},
"reviewBody": "The trick to these cookies is the baking time; do not overbake or they will dry out. I baked mine for about 8 minutes, or until the edges were lightly browned and the centers were still soft. Because the recipe calls for a sugar substitute, the cookies will not have the same texture as the real sugar version; but for keto cookies, they are quite good. Happy low carb eating!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/261181/4-ingredient-keto-peanut-butter-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/852/desserts/cookies/peanut-butter-cookies/",
"name": "Peanut Butter Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/261181/4-ingredient-keto-peanut-butter-cookies/",
"name": "4-Ingredient Keto Peanut Butter Cookies"
}
}
]
}
}
, "about": [
]
}
]