				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Adobo Chicken with Ginger"
,"datePublished": "2019-04-02T02:43:54.000-04:00"
,"dateModified": "2022-09-24T20:25:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Liza Cranis"
,"url": "https://www.allrecipes.com/cook/556942"
}
]
,"description": "Chicken adobo is considered the Philippine national dish. The combination of soy sauce, vinegar, garlic, ginger and peppercorns is delicious and actually preserves the chicken! Great for picnics. My mother taught me how to cook this, using her variation from the original recipe. A delicious, cheap and easy dish! Serve it hot with hot steamed Jasmine rice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Tr4kmcbNtOtTZizxYEfhC9ZI7EI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/699806-d9b8b643dfec45d4bb49eabd2d3cdc54.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Adobo Chicken with Ginger"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "365"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "517 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "170 mg"
,"fiberContent": "1 g"
,"proteinContent": "44 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1364 mg"
,"sugarContent": "1 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (3 pound) whole chicken, cut into 8 pieces",
"0.75 cup distilled white vinegar",
"0.5 cup soy sauce",
"2 tablespoons thinly sliced fresh ginger root",
"0.5 tablespoon black peppercorns",
"1 bulb garlic, peeled and crushed",
"2 bay leaves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine chicken, vinegar, soy sauce, ginger, peppercorns, garlic, and bay leaves in a Dutch oven; bring to a boil over medium heat. Reduce heat, cover, and simmer for 30 minutes, basting chicken occasionally with the sauce."
} ,{
"@type": "HowToStep"
,"text": "Remove the lid and continue to simmer until liquid has reduced by half, 5 to 10 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Transfer chicken to a serving plate. Strain liquid from the pot to remove bay leaves and other solids."
} ,{
"@type": "HowToStep"
,"text": "Serve chicken hot and drizzle with strained sauce."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bfreeborn"
},
"reviewBody": "Great recipe, great flavor! I used chicken thighs and added several links of hot Italian sausage. For the vinegar, I used Nakano Seasoned Mild &amp; Sweet Rice Vinegar along with low sodium soy sauce. Also added Melinda’s Habanero Honey Mustard sauce for a little kick. Outstanding! No additional seasoning needed and served on a bed of arugula and Jasmine rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ajkcook"
},
"reviewBody": "It was easy to make and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George W Iliffe Jr"
},
"reviewBody": "My asawa and I free poured vinegar and soy sauce in our version but yours is still cooking but smells sarap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ascean"
},
"reviewBody": "Better Than I remember! And very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jus T. Smoakman"
},
"reviewBody": "Great! I removed chicken skin And portion of the simmered sauce After putting it on a plate. I placed sauce into sauce pan and brought to a glaze, meanwhile placing skins in a personal fryer. After skins became crispy I placed glaze on them a then placed them and placed around legs, thighs and brrast.of the other chicken. Great recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tjaniselliot"
},
"reviewBody": "Tried some similar chicken recipes and this is one of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YumYum20"
},
"reviewBody": "Great recipe with a few modifications. I used 8 boneless skinless chicken thighs, low sodium soy sauce, teaspoon of regular pepper instead of peppercorns, 2 cloves of garlic instead of a whole bulb and a teaspoon of basil instead of bay leaves. I used the same amount of ginger and vinegar in the recipe. Turned out great! The picky eater kids loved it so I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rob OHarrow"
},
"reviewBody": "It was really good. One of my favorite Filipino foods. Based on my observations of restaurants and street cantinas in central Luzon i usually go equal parts vinegar and soy. Also i add a chopped onion and saute it with the garlic in a few tbs of oil before adding the chicken and other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Nollner"
},
"reviewBody": "This got me too tell mysellf' \" I am done eating USA. food's from this point on!! \" So now I ONLEY eat internashanel food's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rsteve"
},
"reviewBody": "Rescind my last review haha. This recipe has even my “vegetarian” seven year old eating it. I’ve made the recipe as written and with my own tweaks, based on my preferences. I use thighs as opposed to the whole bird, and I brown them in olive oil first. I like it much better. I also blend all the ingredients together, and add them after I’ve got a good caramel color on my thighs. I don’t find that I care for low sodium over regular, so I’ll switch between the two as I have them in my pantry. This is a very good recipe, enjoyed by all I know"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowbuddy"
},
"reviewBody": "I added a yellow onion which I sautéd in the Dutch oven first, then added the garlic and chicken and browned. Topped with green onions and served on coconut rice. Amazing flavour. I think next time I’ll use cider vinegar and try marinating the chicken in the vinegar and soy, as another reviewer suggested. I much prefer Adobo with ginger so I was happy to find this recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This is a very good recipe. I loved that it wasn't too sweet. I will be making this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This is a very good recipe. I loved that it wasn't too sweet. I will be making this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "'D'"
},
"reviewBody": "Made it last week and was asked to make it again this week. I'd say that was a success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Curtis Larmon"
},
"reviewBody": "I hesitated attempting this for years because I thought it would be complicated but this was soooo easy - just throw all the ingredients in a pan and turn the chicken pieces a couple times while it cooks! Since my grandchildren would be eating this, I did add a couple of tablespoons of honey. Everyone loved it - even the grandkids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond Gravel"
},
"reviewBody": "Excellent dish great flavor too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This was super flavorful and tender. We loved this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lise Rod"
},
"reviewBody": "I had a large pack of chicken thighs on hand so used that. I lightly sautéed a little chopped onion in sesame and olive oils, then added as many thighs as would fit in the pan to brown. I put that aside and sautéed another pan of onions and chicken. When almost done, I added some chopped garlic from a jar and finished sautéing. For the sauce, I added a shake of adobo seasoning, coarsely ground pepper, ¼ cup red wine vinegar, ½ cup soy sauce (or less), about a cup of water, 2 bay leaves, and a large spoonful of minced ginger from the jar. I combined the sauce and browned chicken parts in a large covered Dutch oven and cooked on the lowest simmer flame for about 1 ½ hours. The family LOVED it! The flavor was out of this world!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danell Linnebur Underwood"
},
"reviewBody": "Based upon other reviewers suggestions , here are the adjustments I made. I browned the chicken with onion first, then marinated it for several hours in the vinegar and soy mixture. I used 1 cup of light soy sauce, 1/2 cup apple cider vinegar and 2 cups water along with the ginger, peppercorns, etc. After cooking the chicken, I removed it from the pan and removed the meat from the bones. I strained all the stuff out of the juice in the pan and then returned the chicken meat to the the pan to reheat to boiling. I added a little cornstarch/water mixture to thicken it just slightly and served it over white rice. \nIt could have been even a little more vinegary, but it was delicious as it was. All of us really liked it.\n\nEdited: I've now made this several times. We like both the chicken and pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Natalie Tarnopolsky"
},
"reviewBody": "I made it with boneless, skinless chicken breasts but otherwise as the recipe describes. I could smell the strong vinegar scent, so I read ratings and comments as the chicken was in the Dutch oven. As a result of reading the comments, I made pretty substantial changes while the chicken was braising. These changes included: (1) adding 1/2 cup of white granulated sugar, (2) adding 1 + cups of water, (3) adding 1/3 cup of soy sauce and (4) adding a 1/2 cup of sherry. In addition, I sauteed a round onion and added that and added chopped green onions/chives at the end. The chicken turned out pretty good with the chicken breasts sufficiently tender and moist after 30 minutes simmering in the Dutch oven. I gave the recipe two stars because I'm pretty certain it would have been way too vinegary if I hadn't made substantial changes to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fishinfool"
},
"reviewBody": "I followed this recipe to a t and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I'm part Filipino. I was a bit skeptical to make this only because I've never made Adobo on my own before. I mean, my mom makes THE best Adobo ever (I'm sure every Filipino can say the same about their own mom). So, I tried it. And I have to say, it was pretty close to my mom's. I was so happy. And now, I don't have to go to my mom's for Adobo lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coralynn"
},
"reviewBody": "Great recipe. I browned red onion, skinless thighs on stovetop. Then used recipes ratios exactly. I did use cider vinegar and low sodium soy sauce. Tasted at that point but felt it lacked something, so then I also added 1/4 cup white sugar as well as a teaspoon of chili garlic sauce per recipe. I felt the addition of the sugar cut the vinegar taste, you will end up with sweet, hot, salty, tangy taste. \n\nSimmered until very tender. The flavor was fantastic. Recipe was doubled and this is the best Chicken Adobo I have ever eaten. Rave Reviews from sons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn & Brad"
},
"reviewBody": "Tastes very similar to \nHawaiian huli huli chicken! Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LLMHerb"
},
"reviewBody": "Love the ginger/garlic flavor. I will definitely make this again! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHEENA"
},
"reviewBody": "This is a great dish, I used apple cider vinegar instead of white and used less-1/2 cup. Turned out wonderfully! Also used 3 cloves of garlic. The apple cider vinegar is less overpowering than the white and gave it a slightly sweet flavor to accompany the spicy taste of the ginger and peppercorns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amberlyf"
},
"reviewBody": "I left out the bay and peppercorns since I didn't have them. I used ginger paste which was a bit strong so I added an extra 1/4 cup soy sauce and a couple tsp sugar. I used 4 tbsp garlic powder instead of fresh since that was on hand. I cooked the chicken and cut it up after since I started from frozen. Next time it will thaw and cut the chicken first. It is delicious and the sauce with rice reminds me a little of my friend's Filipino restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina"
},
"reviewBody": "I didn't make any changes. It was delicious. Some recipes tell you to add water to the vinegar and soy sauce. This one doesn't and it is much better this way. The flavoring is perfect and this is something I can make quickly when I get home from work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phoreal"
},
"reviewBody": "I love this recipe. I followed the recipe, then made it according to my liking. The vinegar was too overpowering for my taste. I used a ratio of about 1:4 (1 part vinegar to 4 parts soy) or 1:3 and about a cup of water (more or less a cup). I find the best part to use are chicken legs. It's a little bit more work to chop, but it's very affordable and flavor/texture is great. I first cook the chicken skin side down in a hot pan (NO oil). I watch the pan and reduce heat if needed. I let it carmelize then use a spoon to scoop out the excess fatty liquid. Then I add the ginger, onion, extra garlic and stir around bottom of pan to cook and add flavor. After about a min or two, I continue with the rest of the ingredients and cook per instructions with the addition of sugar to bring out the flavor. I let it simmer until the liquid reduces. If it reduces too much I add back in a little water. The sauce is awesome to eat with rice. Sometimes, I add slices of jalapeño towards the end. After tasting, if it's getting too spicy, I take it out when needed. I'll add it back on top of the chicken platter for presentation. Before serving, I remove the bay leaves but leave everything else. It saves me time from cleaning. Thank you for sharing!! Salamat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mroger82"
},
"reviewBody": "I made this recipe for my mother on her birthday, who is Filipino, but doesn't cook anymore because of age. I didn't deviate at all from the recipe and it turned out perfectly. Just like I remember eating it when I was a kid growing up. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Johnson"
},
"reviewBody": "Made for a large group of university students &amp; volunteers and they loved it!! I did add a very large, roughly chopped onion and cooked in a slow cooker. It was served over Basmati rice. One of the guests even asked for the recipe. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon King"
},
"reviewBody": "very simple, flavorful, and cheap to make. I didn't think that was enough fluid so I added 1/4 of water.\nturned out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PrismLove"
},
"reviewBody": "Taste great. Even my husband and son thought so, and they are picky eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Serena"
},
"reviewBody": "Family loved it! It goes on the dinner rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redheaded_gardener"
},
"reviewBody": "This has been one of my families \"go to\" recipes for years now. We all absolutely love it, and so does everyone we feed it too. Occasionally I add more pepper, or more ginger, but otherwise we make it the same every time. After my daughters have moved out 1 by 1, this is always a recipe they call home about, and ask for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Loria Torrence"
},
"reviewBody": "It tasted good, but mine looked like it had soy sauce on it and not like all the other pictures."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "plaidgiraffe29"
},
"reviewBody": "I found the vinegar to be overpowering. I already cut down on the vinegar to around 1/3 cup, based on others' suggestions, but still found the dish to be way too sour. Ended up having to add some sugar and 1/2 cup water to balance it out. The chicken turned out very tender and juicy, but I think the braising sauce needs some adjustment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Astrialite"
},
"reviewBody": "I was looking for something different to make with chicken. This certainly was different. I used red wine vinegar and I will certainly try other types. Great dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dewy"
},
"reviewBody": "Not a bad recipe. Somehow, it is quite difficult to balance the soy/vinegar ratio. I did marinate it with all the ingredients for 3 hours. Cooked it as instructed and used more soy ratio than vinegar. I browned the thighs after it was cooked. It was ok, but not a real wow factor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "This was good. I would probably give it a 3/12 star if that was available but went with four cause I can't say anything bad...it just didn't knock my socks off. Very Easy, quick and I have most items on hand at all times. Must serve with rice it adds to the meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca A Bachmann Ross"
},
"reviewBody": "My family loved this recipe; they thought it was very flavorsome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanciemartin"
},
"reviewBody": "So delish! I did brown chicken with onion first and then added all ingredients in electric skillet turned out amazing! Served with sushi rice from site (Mom's sushi rice) perfect the whole family loved it ... I used chicken thighs without skin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsJordan07"
},
"reviewBody": "I make this all the time. I am only giving it a 4 star because after using the recipe exactly as is, I have changed it, and use half apple cider vinger"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cinny28"
},
"reviewBody": "One of my faves and so easy to make. As others have mentioned, you have to play with the soy sauce/vinegar ratio to suit your taste (I like it 1:1 and use low-sodium soy sauce). Also, I marinate my chicken thighs in the sauce/aromatics mixture a few hours before cooking.\n\nServe with garlic fried rice (another allrecipes recipe)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "shimmy"
},
"reviewBody": "a bit bland for my taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie F."
},
"reviewBody": "This is the best Adobo Chicken recipe I have tried. My kids agree! Reading the reviews helps too to choose what to tweak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Senica Gonzalez"
},
"reviewBody": "Awesome. Had a craving for adobe chicken at 11 at night...so I got up and made some. For those that thought the vinegar was too much, I would suspect that you did not let enough liquid content evaporate. It takes a good hour if not a slight longer to get the desired taste. I tasted it before it was ready and the vinegar was very strong. After a while though, all the flavor blended perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ypoitras"
},
"reviewBody": "I liked a lot. All the family liked enough to eat everything, only that, is enough to deserve at least 4 stars because it's rare! My wife thinks that the vinegar taste is too present. I agree a little bit, but I liked as it was. I overcooked the chicken a little bit, I don't cook it that way, usually, and to me, it looked uncooked. Next time, I will listen better to the directions! I realize, looking at others photos, that maybe I should have cut bigger pieces of chicken.\n\nI will do it again, it deserves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan"
},
"reviewBody": "Staple crowd pleaser"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Klingbeil"
},
"reviewBody": "family favorite. I like to take out the chicken after it is done cooking and fry in heated oil to crisp the skin. Then we like a little thicker sauce for your rice, and add a tablespoon corn sauce to 1/4 cup water and stir in simmering sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilorchid82"
},
"reviewBody": "I tried to take too many reviewer suggestions. I did marinate my chicken thighs, but then I tried to brown it, and that did not work. I may try it next time the alternative way, but the marination without browning still tasted darn good. If I had cooked the chicken for the full 30 min (since I did not use the whole chicken), it would have been overcooked. I used the condensed sauce to sautee some long beans to really good results too. This recipe is definitely a repeat!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rdsxlolo"
},
"reviewBody": "Yum-o. Served with couscous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OhioMom"
},
"reviewBody": "We love this! My only changes were to cook in a slow cooker for 8 -10 hours, used 1/4 cup vinegar, and added 1/2 cup of water. Also, I was too busy to peel and chopped garlic, so I used 2 heaping teaspoons of jarred minced garlic. Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BellaByrdie"
},
"reviewBody": "I was looking for a dish to make for girl scout international Night (we did the Philippines). And I found this. WOW this went over fantastically. I did 10 lbs and came home with less than a cup.\n\nI did follow the recomended changes. (used 1/4 cup Apple Cider Vinegar added 1 cup water. Used ground ginger). This has been added to our main dishes to cook. WOW amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "malycious"
},
"reviewBody": "I used my own variation and it turned out delicious!\nI don't like cooking twice so i just boiled everything on medium heat for about 35 minutes with the lid on.\n\nI used chicken thighs which always seem to pick up the marinade well. I didn't even have to let it sit in the marinade! \n\nI used the Braggs amino acids since I was on some diet earlier. I used about 1/4 cup braggs amino acids, 1 cup water, more if the juices are drying out too much (the juices will dry out even with the lid on), garlic powder, black pepper, and about 1-2 tablespoons of rice vinegar. I'm not a fan of vinegar, so less is better for me. I then put them all in the pot, pierced the skinless chicken thighs with a fork, and let it simmer on medium heat. then ate it with rice, now i'm addicted to it! yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia"
},
"reviewBody": "This is a great recipe, but I did make a few changes to suit my family's tastes. I used white wine vinegar, instead of the distilled white. I also used only skinless chicken leg quarters, since breast meat can be rather dry if braised too long. And, I browned the chicken in a little canola oil before adding the soy-vinegar mixture. Finally, after the meat was cooked, I skimmed the fat off the top before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caliente-Mami"
},
"reviewBody": "I used boneless skinless chicken and left out the ginger since I didn't have any. Browned the chicken. Then I started off with 1 cup low sodium soy sauce &amp; 3/4 cup white vinegar it was to tart to me and keep mixing the soy &amp;vinegar to my liking it was still a little tart so I added 3tsp brown sugar &amp; 1 cup water. Brought it to a boil &amp; let it simmer for about 3 hrs adding a little water to keep chicken covered. I still gave this recipe 5 stars because it is a great starting point and it was delicious my whole family loved it! As others reviewers have stated I think the key to this recipe is finding the right balance between the soy &amp; vinegar and adjusting it to your tastes=) Next time I will try it with the ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ruby_cube"
},
"reviewBody": "I've never had Adobo chicken before so I can't comment on authenticity as other reviewers have, but I thorough enjoyed it. I loved the tangy flavour and the sauce was amazing over rice and veggies. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Stunner North"
},
"reviewBody": "This was great! My husband and kids loved it! Will make again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bambi"
},
"reviewBody": "Very tasty and definitely a keeper. I make adobo all the time. Ginger adds a nice touch. I browned my chicken first in garlic and not too much oil. Then cooked all for about 4 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Castillo"
},
"reviewBody": "Thank you for this perfect adobo recipe! Yeah I'm filipino and I love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Boni Fasho"
},
"reviewBody": "this recipe is great. this is very similar to how my filipino mother cooks adobo except she puts more soy sauce then vinegar. A tip to reducing the tanginess flavor is by adding a pinch of baking soda until u reach your desired flavor of tanginess. works like a charm :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MeloVlog"
},
"reviewBody": "Too much vinegar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Ashby"
},
"reviewBody": "This recipe is SO good! Even my Filipino friends flip for it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ChristyCookies"
},
"reviewBody": "The vinegar was way too overpowering.\n\nI'm filipino and this is NOT how it should taste. Its not clear to me how this got such a high rating. Why doesn't allrecipes have the option for me to rate 0 stars??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erinc"
},
"reviewBody": "marinate for awhile"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mr_meg"
},
"reviewBody": "I love adobo and this is a great recipe. For those non-filipinos who think the soy sauce-vinegar is too heavy here is my solution: put 1 TBS soy sauce and 1 TBS apple cider vinegar in 1/2 cup and fill the rest with water. Use this mixture for 2 boneless skinlless chicken drumsticks (abour 1/2 pound). Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OkinawanPrincess"
},
"reviewBody": "Absolutely delicious! I love Chicken Adobo and I normally add a little water to the vinegar and low-sodium soy sauce. I did add a little pinch of white sugar. I grated fresh ginger instead of slicing it and used a few garlic cloves, not a whole garlic bulb. I added the bay leaves and lots of fresh ground black peppercorn to the sauce. I let the sauce come up to a full boil then added the chicken thighs, covered the pot and let it cook for 30 minutes, occasionally stirring and checking the chicken. I uncovered the pot and let the sauce simmer until some of the liquid reduced a bit, 5 minutes or so. I can't tell you how wonderful the soy sauce, garlic, ginger and vinegar smells in my house..Mmm...MMM!! The chicken is so juicy, tender and seasoned just perfectly! The flavors all balanced out in the sauce, each standing on it own, but not overpowering each other. The ginger is a nice touch to the sauce and flavored the chicken wonderfully. I poured extra sauce over my rice. This is a sauce you will have to adjust according to your tastes because while others like it more \"vinegary\", I prefer mine a little less which is why I always have to add a pinch of sugar with water. You can also use pork in place of chicken, which also tastes great. This paired perfectly with, \"Roasted Corn with Garlic Rice, \" and \"Baby Bok Choy with Garlic,\" from this website."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sorrowsmiles"
},
"reviewBody": "Super yummy! My dad makes an adobo that doesn't require the bay leaves, though, and honestly I couldn't tell the difference. Thankyou for a recipe I feel I can build on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "naby33"
},
"reviewBody": "didnt taste good at all unfortunately..inspite of adding more garlic, more pepper still tasted like soy sauce and too salty.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ymchen78"
},
"reviewBody": "Turned out delicious. Changed it a little, reduced the vinegar to 1/2 cup (used the 3/4 cup per the recipe the first time and it was way too strong for my taste) and left out ginger since I didn't have any."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "laiza"
},
"reviewBody": "Followed the recipe to the T and I think its decent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mammabear"
},
"reviewBody": "My Mom is filipina too and this almost tasted like what she used to make. I called her before I made this and she told me to add a 1/4cup of water so that the chicken would be more tender. I had to also add a 1/4 of soy sauce because the vinegar was too strong. My mom never browned hers like some of the other reviewers suggested. She also only used thighs and drumsticks and she never used ginger. Next time I won't use white meat because the breasts didn't come out as tender as I hoped. The dark meat was good and it was falling off the bones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "benanna"
},
"reviewBody": "This recipe is pretty spot on. Being Filipina, you learn about dishes from the kitchen and not from recipes. However being away from the Philippines sometimes makes you forget, and measurements are really helpful. \n\nI think what this recipe doesn't discuss which is a very important step in making Chicken Adobo, is that before you turn on the heat, you need to let all of the ingredients sit for an hour. This lets the vinegar cook on its own. That way the dish never turns out vinegar-y. Instead, it has this awesome tangy taste. \n\nAlso, if you add pork, the flavors are amazing. Chicken is good in itself though, if you don't eat pork. \n\nLastly, if you can get a hold of \"pandan leaves\" Try stewing a leaf or two with this. \n\nYour guests will never be able to get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne Kisela"
},
"reviewBody": "I made this for my family, (Parents, Nephews, and Nieces, Kids and Wife). The Wife is Philippino, she told me it tasted like being back home. The rest of us Americans loved it too. Of course I had to change the number of servings. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "firemandale"
},
"reviewBody": "Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily McCann"
},
"reviewBody": "easy and delicious!! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti T."
},
"reviewBody": "Sooo delicious! I think I outdid my Philippino friends with this recipe! My daughter asks me to make this all the time! It's really easy, too! I added diced onions one time and it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Novelist Lisa Logan"
},
"reviewBody": "I've been making adobo since my husband got the recipe from his Filipino grandmother. He loved this dish growing up, and I've tried a few variations. His grandmother boiled the ingredients in water to cover, so that there would be plenty of that delicious juice to soak into the bowl of rice, and that's how the family likes it. For this version, I did add some water and used an equal ratio of soy to vinegar. The fresh ginger was something I'd never used before, and it added a subtle, delicious layer to that sauce. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Athena"
},
"reviewBody": "This recipe is simply amazing. I could eat this chicken every week and never tire of it. That said, I did feel that it was a little salty for my taste.. even with low sodium soy sauce. So I added about 1/4 cup of water and it is now perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lewarner"
},
"reviewBody": "This is a good recipe but I prefer the vinegar/soy ratio more even and I add water, like others have mentioned. I like to make this in the oven or slow cooker so I can go off and leave it. By the way, potatoes cut in large chunks are amazing. No butter needed when you eat them! Just add a vegetable or salad. Great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkpigeon"
},
"reviewBody": "Very good recipe -- the measurments seem to work well together. My boyfriend had never had chicken adobo but he really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cummings0605"
},
"reviewBody": "I used equal parts vinegar and soy sauce and diluted my soy sauce with a little water I also browned chicken 1st with some onion then marinated it all over night. The next day I put it all in the slow cooker. I would really recommend marinating the chicken if you have the time. Also I added some sugar to cut down on the sourness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mason Mama"
},
"reviewBody": "This was just ok for us. My husband has been raving about the chicken adobo he had while deployed in Iraq so i searched around to find out how to make it. I tried his but he said what he had was more spicy sooo I just have to tweak or search again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "allrecipesrocks"
},
"reviewBody": "Took the advice of another and used 1/3 c. vinegar and 2/3 cup soy. Also used less chicken and dried pepper and ginger to guess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dranoel"
},
"reviewBody": "Doubled the sauce... othewise it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "houdini"
},
"reviewBody": "Very easy and yummy recipe. The only thing I didn't care for was the lack of sauce afterward. All the chicken adobo I've had in the past has a thicker sauce. Maybe I'll had a bit of flower to the leftover sauce next time. Besides that one thing it was great. (Oh, and if you're not okay with vinegar tastes you won't care for chicken adobo, so just don't try it.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Note: I added 1 cup of water to barely cover the chicken. Outstanding. Made it for our Phillipine friend at Christmas dinner and she said it tasted like home. Good for everyone as it isn't very spicy but could take spice well if that is your thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "epicurious"
},
"reviewBody": "liked it alot. have never had authentic adobo before so i didn't know what to expect. served it at a family gathering it was nice and easy to prepare. i think it's better if cooked longer than the recipe suggests. i cooked it in my dutch oven on low for four hours. i tasted it after the suggested cooking time and the vinegar was a bit overpowering but after a couple more hours it mellowed out alot. needs a little more spice i think. we sprinkled red pepper on it after plating. also i tossed in fresh whole mushrooms for the last hour they added a nice flavor to the broth and were a really tasty accompaniment. four stars because everyone was eating it for the first time and liked it and ate a lot of it but nobody was raving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aniheartsjapan"
},
"reviewBody": "Tastes just like Adobo should. Recipe is so good! Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "casey"
},
"reviewBody": "Sooo yummy! I did not use a whole chicken -- used a pack of boneless, skinless breast and a pack of boneless, skinless thighs. Also, after reading reviews I adjusted the amount of vinegar and added a cup of water. Everybody loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beautiful"
},
"reviewBody": "Sooo good! I used a crock pot on low for a few hours and then deboned and skinned the chicken and put the meat back in on warm until dinner time. I also used another reviewers suggestions and did 1 c water, 1/4 c soy and 1/2 c red wine vinegar then all of the seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmy"
},
"reviewBody": "This was delicious. I added 2 cups of shredded carrots and used apple cider vinegar instead of regular. I used chicken breasts cut into strips and crock potted it for about 3 hours. Served it over basmati rice and it was just delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "elise w"
},
"reviewBody": "super easy to make and tasty :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roni J"
},
"reviewBody": "My husband, who swears that adobo is his favorite food ever, LOVED this recipe!! It had a wonderful flavor and the meat was so tender. Highly recommend! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelbrandi"
},
"reviewBody": "This was fantastic! I had adobo once when a co worker brought in huge pans full, and I forgot to ask her for the recipe. I used chicken drumsticks but followed everything else to the T. Picky daughter loved this and there were no leftovers. thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marj Mariano"
},
"reviewBody": "Delicious! tastes just like my mom used to make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie B."
},
"reviewBody": "This is delicious! It came out tender with just the right spice- plus perfect ingredients for if you are sick like ginger and garlic (great for the immune system). I used crushed black pepper since I didn't have peppercorns. Great over white long grain rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paddi"
},
"reviewBody": "This really is as good as everyone says it is! I tweeked it like many said to. I used red wine vinegar, added some sugar, chili powder, cumin and added sauted mushrooms, onions, add a few other veggies to the mix after it cooked. I served it over jasmine rice and WOW it was fantastic. My hubby loved it and I just shared this recipe with two co -workers. Thanks"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/28363/adobo-chicken-with-ginger/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
"name": "Filipino"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/28363/adobo-chicken-with-ginger/",
"name": "Adobo Chicken with Ginger"
}
}
]
}
}
, "about": [
]
}
]