				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Afghan Beef Raviolis (Mantwo)"
,"datePublished": "2020-02-08T03:35:36.000-05:00"
,"dateModified": "2022-12-24T23:14:18.000-05:00"
,"author": [
{"@type": "Person"
,"name": "amanda1432"
,"url": "https://www.allrecipes.com/cook/905505"
}
]
,"description": "Popular at a well-known Afghan restaurant, this dish uses wontons to create delicious beef dumplings served with minted yogurt and yellow split peas."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BEFF1jFI7tR33V5kxFMB_Y7JTig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2383724-afghan-beef-raviolis-mantwo-elly-4x3-1-7f2d3d5bcc6c4d689a9991d59dd36b0e.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Afghan Beef Raviolis (Mantwo)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "47"
}
,"cookTime": "PT85M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "506 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "76 mg"
,"fiberContent": "9 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "1173 mg"
,"sugarContent": "9 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"0.75 cup plain yogurt",
"1 teaspoon chopped fresh mint leaves",
"2 cloves garlic, crushed",
"1 pound ground beef",
"1.5 cups chopped onion",
"1 cup water",
"1 carrot, grated",
"0.75 teaspoon salt",
"1 teaspoon ground black pepper",
"1.5 teaspoons ground coriander",
"0.5 teaspoon ground cumin",
"26 wonton wrappers",
"1 tablespoon tomato paste",
"0.125 teaspoon red pepper flakes",
"2 tablespoons water",
"0.5 cup dried yellow split peas",
"0.125 teaspoon red pepper flakes",
"1 teaspoon ground coriander",
"0.25 teaspoon ground cumin",
"1 cube chicken bouillon",
"1.5 cups water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a small bowl, stir together yogurt, mint, and garlic. Refrigerate."
} ,{
"@type": "HowToStep"
,"text": "In a large skillet over medium heat, cook ground beef and onions until meat is browned, stirring occasionally to crumble; drain fat. Stir in 1 cup water, carrot, salt, black pepper, 1 1/2 teaspoons coriander, and 1/2 teaspoon cumin; simmer uncovered for 30 minutes or until water evaporates."
} ,{
"@type": "HowToStep"
,"text": "Lay out wonton wrappers on aluminum foil. Mound two large spoonfuls of beef mixture in the center of one wrapper. Dip a finger in water and trace it around all four edges. Lay a second wonton wrapper on top of the first, and press on all edges to seal. Roll up the edges to create a round, hat-shaped ravioli. Repeat, making 13 ravioli."
} ,{
"@type": "HowToStep"
,"text": "Place ravioli in steamer and steam 40 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, mix together the yellow split peas, 1/8 teaspoon red pepper flakes, 1 teaspoon coriander, 1/4 teaspoon cumin, chicken bouillon, and 1 1/2 cups of water in a saucepan. Bring to a boil, then simmer over medium-low heat for about 45 minutes, or until it reaches a thick slurry-like consistency."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, in the large skillet, mix remaining beef mixture with 2 tablespoons water, tomato paste, and 1/8 teaspoon red pepper flakes. Simmer over low heat until liquid has evaporated, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "To serve, spread yogurt on a serving plate. Top with ravioli, and top again with split pea mixture. Finally, top with tomato and beef mixture. Serve immediately."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cook"
},
"reviewBody": "It was mushy and the ingredients blended together into a mash. Yuck"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i donot like this reciepe very bad and sorry very bad grammar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Holbrook"
},
"reviewBody": "I love the flavors of this recipe. The first time I made it, years ago, I made the recipe as the directions state. It’s a time consuming process, and I wanted the flavors without the work, so now I make everything as stated in the recipe, except I put it in pitas. I put a layer of the yogurt on one side of the pita, a layer of the pea mixture on the other side and then stuff the meat/carrot mix in the middle. I top it with just a tiny bit more yogurt, because it is so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ken Rau"
},
"reviewBody": "I made it and everyone loved it. It reminds me somewhat of Turkish Manti. We did find that steaming the dumplings made them a bit dry and rubbery so we boiled the second batch and those were much more moist. I also think that I will use ground lamb next time instead of ground beef. More authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "I made this using the exact ingredients. You need to cook the lentils covered or they will be too dry. I wish I had made extra yogurt. I topped the raviolis with it. Then layered the lentils and extra meat. I also took the advice of those who boiled the raviolis for a couple of minutes. They turned out great doing this! Overall it was very tasty and I really liked the mint in it. I only gave this recipe a 4 because although it was tasty, it was a little too time consuming for the end result. Would be good to just layer the meat and lentils with a dollop of the yogurt mixture on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liz"
},
"reviewBody": "Made these tonight for dinner. The first time I’ve ever had mantu was at a friends afghan restaurant that closed. We visited them recently and started craving this dish so I googled a recipe. This didn’t taste exactly as I remembered but it was still very good. Even better was the fact all my kids gobbled it up, even my pickiest eater. For larger families (we are a family of six) I would double the recipe. I found it easier to get the edges of the won ton wrappers wet, load it up with meat and folding opposite corner to opposite corner and pinching the seams closed rather than using two won ton wrappers ravioli style. It makes them more bite sized and easier to eat. I didn’t need to steam them 40 minutes. After about 10-15 they were done. I am definitely saving this recipe to make another day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "emersonreturn"
},
"reviewBody": "it's good...but won ton wrappers do not cut it. i used 2 sheets of fresh lasagna, cut each into 1'' squares, filled them with a mixture of ground beef/lamb/pork spiced with nutmeg, a pinch of cinnamon, allspice, turmeric, cumin, garlic &amp; curry paste, fresh parsley &amp; cilantro, then pressed the squares together well to seal &amp; boiled them. i started the lentils while the meat was cooking. the recipe is good to go, but purchased won ton wrappers are flimsy, tear easily &amp; a pain to work with. if you make your own, well, that's another story &amp; more power to you...mine always suck. but this recipe would be closer to dumplings than won tons...in my estimation. &amp; the art of making good dumpling dough is another thing i haven't mastered so i fudge with fresh pasta. it's close enough. the yogurt sauce is great &amp; really works with the dumplings. thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cora"
},
"reviewBody": "Yummy and authentic! My husband was born in Kabul and loves some home Afghan cooking. Being a fine Scottish-American woman, I can't say that my Afghan cooking skills are deep but when I find an Afghan recipe, I give it a shot. This is Afghan approved! Cooking time took about 2 hours total (prep and cooking). I followed the recipe pretty closely. The only change I would make in the future is to put a little oil on the raviolis before steaming because they stuck together a bit. I would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RiddlerontheFoof"
},
"reviewBody": "outstanding balance of flavours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shana"
},
"reviewBody": "I thought this tasted good, but will not be making it again. The recipe is very time consuming without excellent rewards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicholas Castellon"
},
"reviewBody": "It was such a great meal. I made it for 6 servings and everything came out well. One thing I wish I did was read comments before starting I would know to make the split pea mixture first that seemed to take a long time. I would have also known to cover it. I was constantly adding water. In the end I just masshed them up with a fork. Still great taste. The mint yogurt seemed to mend the dish together perfectly. Everything alone seemed to miss something and put me off, but together it came out awesome. Can not wait to make it again but next time with lamb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott K"
},
"reviewBody": "Restaurant quality! An excellent dish that was a LOT of fun to make. I added finely chopped red peppers and green onions to the beef mixture for color and because I had them. I also had to use green peas instead of yellow based on what was available. I steamed the raviolis and also had some trouble with them sticking together. I might try brushing them with olive oil next time. I highly recommend this dish. If I could give it 6 stars, I would!\n\n2/9/15 update - I've made this many times now and while I love the recipe as written, I've found that I prefer to use Basil in place of Mint. Just a personal preference, but the whole family agrees. Also, the instructions do not say to cover the split peas while cooking, but I've found this is the only way to get the slurry texture. When not covered, I was adding water every 5-10 minutes and just didn't get the right texture. Covering the pot solved this problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aadina"
},
"reviewBody": "One of my favorite Afghani appetizers! I used ground turkey instead of ground beef and it was still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mblahblah"
},
"reviewBody": "I made these last night and they were delicious! I loved them. My roommate was on his way out the door and didn't want to leave because he wanted to try them. He stayed and tried them and even took some to his friends house to share! They were really easy but took some time. I love the yogurt at the bottom, it really helps with the spicy parts (red pepper). This was very enjoyable! I had to use green split peas because I could not find yellow ones and I substituted the fresh mint for mint extract. It came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrew Scott"
},
"reviewBody": "One of the most technical dishes I have ever done. Tastes great but you better be marriage material before you convince me to make this again. Took the better part of a day to make, the rest of the day was clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "I wasnt sure if i should give this 5 stars or 4...so I went with 5 because the flavor is nice in this dish. I would probably go with a 4 because it is too much work for not enough reward. I will probably never make this again because its too much work, but we all enjoyed it this time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "Great taste! Wonderful presentation! I folded the wonton wrappers in half over the meat mixture, then baked at 350 for a few minutes (too long in my case, as they started to turn brown!). I used green split peas since the yellow ones weren't available. All of the tastes complimented each other. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bsp09"
},
"reviewBody": "Loved this recipe! It was very similar to an Afghan place we like in Baltimore! It took just over an hour to prepare (boiled the raviolis for about 4 minutes). I felt that it could have used more salt/cumin/coriander, but I like really flavorful foods! Like others, I couldn't find yellow split peas and used green instead. Made 16 ravioli and two of us could only eat 4 per serving, so had leftovers for the next night too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cyffermoon"
},
"reviewBody": "This is delicious. The only change I made was to use ground lamb instead of beef. Hubby and I both loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "I was confident in trying a new recipe. This looks yummy I thought. Well, I made it with some friends. More and more people kept coming (for dinner) and I began to think this looks weird. I told everyon what it was and they could try what they wanted. We found that if you eat all the layers together like the recipe it's so yummy. The Mantwo vanished. Our neighbor girl, who is a picky eater asked if she could bring a plate home for her brother ... But it was gone. We were able to prepare the meal much quick then the recipe said. We found stuffing the Raviolis to be the most difficult part in preparation.We found that they stuck togather in our steamer once stuffed. We found out doing less at a time and spraying oil on them made it work much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Darryl"
},
"reviewBody": "My split peas also never formed into a \"slurry\" but more like a rather thick paste. Tasty meal nonetheless! I really think these ought to be steamed if you have the time as the taste is just so much lighter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEDFORD63"
},
"reviewBody": "Yummy! I was skeptical of how the textures would work together, but they melded together wonderfully. It was a bit of work, but not as much as I thought it would be. Stuffing the dumplings took the longest - everything else just had to simmer for a while. I omitted the carrot, mint and garlic because I didn't have any. I also boiled the dumplings for 2-3 min instead of steaming them, and they turned out fine. My split peas never ended up as a \"slurry,\" maybe because I used green instead of yellow? I didn't think it would make a difference, so I just bought what was available at the store. If you make it 4 servings, it's definitely a little lighter than most Americans are used to. I had two servings and nothing else and was stuffed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marljong"
},
"reviewBody": "Very good, but not as good as I've experienced it at an Afghanistan restaurant. Worth a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OCEANAVE"
},
"reviewBody": "I really liked this dish. It was quite different. It only took me about 50 minutes to make everything: I started the split peas while the beef was browning, I took out about a cup of the browned beef for the dumplings and started the meat sauce before I filled the dumplings,I cooked the dumplings in simmering water for about a minute per batch. I served it with roasted vegetables: eggplant, peppers, and tomatoes tossed with chopped garlic and olive oil. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "I was ok about this recipe, but it just seemed like too much work for the reward. I boiled the raviolis as well. Just wasn't my thing I guess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StanV"
},
"reviewBody": "Love the tastes, textures and colours. I, too, boiled the raviolis for 4 minutes, steaming 2 for comparison, and as long as you drain them well it's fine. Next time will try lamb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrancesC"
},
"reviewBody": "I love, love, love this recipe--it's my new favorite. I'd printed it out weeks ago, and talked about making it--but my husband surprised me with the meal on Valentine's Day. He made it with lamb instead of beef, which I think made it even better. He also made the pasta dough for the ravioli. It's such a gorgeous dish, with its layers of different flavors and textures. I want one of us to make it again soon (and take a picture this time!). I guess it probably would serve four, if you're not ravenous (or if you have a starter and a salad). But when I make a labor-intensive recipe like this, I want it to last--so next time I'll double it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kami"
},
"reviewBody": "Very flavorful-I enjoyed making this recipe. Next time I will double the amount of yogurt sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy B."
},
"reviewBody": "I just made this recipe this evening and my husband raved about it. It was an interesting recipe to make (lots of fun) and very flavorful. We're partial to Middle Eastern food and this was an excellent dish. I made the recipe exactly as specified with no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catfish"
},
"reviewBody": "I thought that this was really good, and my husband agreed. It was easy, alot of ingredients, but not alot of prep work. I used green split peas and dried mint, and I boiled the ravioli for about 4 minutes instead of steaming (a time consideration). I used very lean ground beef, and it felt like a light meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "concretejungleprincess"
},
"reviewBody": "Not nearly as difficult to make as I first thought when I looked at the recipe. The most difficult part was trying to make the 'raviolis' look pretty! Interesting and different flavour and texture that me and hubby decided we rather enjoyed. You must like garlic and not be a \"meat and 3 veg\" person to enjoy this, though. While it will not go into rotation, this is a meal I will make again for a special occasion."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/81568/afghan-beef-raviolis-mantwo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/81568/afghan-beef-raviolis-mantwo/",
"name": "Afghan Beef Raviolis (Mantwo)"
}
}
]
}
}
, "about": [
]
}
]