				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "African Curry"
,"datePublished": "2018-06-08T09:20:18.000-04:00"
,"dateModified": "2022-07-14T18:12:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Valeriekooka"
,"url": "https://www.allrecipes.com/cook/594492"
}
]
,"description": "This simple, spicy dish is a delicious way to enjoy international flavors with easily obtained ingredients. It&#39;s great with rice!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Lro9ZsegkNEKMYduYQTrUfQWzZ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9285065-c200cbaccfc64d049bce84e9e2c34f0c.jpg",
"height": 1340,
"width": 1080
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "African Curry"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "355"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "600 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "199 mg"
,"fiberContent": "4 g"
,"proteinContent": "64 g"
,"saturatedFatContent": "21 g"
,"sodiumContent": "452 mg"
,"sugarContent": "4 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 tablespoon olive oil",
"1 onion, chopped",
"2 cloves garlic, peeled and chopped",
"1 bay leaf",
"1 (14.5 ounce) can whole peeled tomatoes, drained",
"2 teaspoons curry powder",
"0.125 teaspoon salt",
"1 (2 to 3 pound) whole chicken, bones and skin removed, cut into pieces",
"1 (14 ounce) can unsweetened coconut milk",
"1 lemon, juiced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat olive oil in a large, heavy skillet over medium heat. Stir in the onion, garlic, and bay leaf, and saute until onion is lightly browned. Mix tomatoes, curry powder, and salt into the skillet, and continue cooking about 5 minutes. Mix in the chicken, and cook 15 to 20 minutes, until no longer pink and juices run clear."
} ,{
"@type": "HowToStep"
,"text": "Reduce skillet heat to low. Stirring constantly, gradually blend in the coconut milk over a period of about 10 minutes. Mix in lemon juice just before serving."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpage85"
},
"reviewBody": "Excellent recipe! I served it over rice and it was loved by all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookingWithShelia"
},
"reviewBody": "I really liked this recipe....it was simple ingredients and easy to follow. The only think I did differently was use more curry. The 2 tbls didnt provide the level of curry that I personally like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Allums-Vaca"
},
"reviewBody": "Delicious! I seasoned boneless skinless thighs with Slap Ya Mama and added a bit of vmcayene"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathryn"
},
"reviewBody": "Delicious! I incorporated some of Cheryl Linarelli’s modifications, and also some of my own. I marinated the chicken in yogurt, turmeric, and pepper as she had. The chicken came out perfectly moist. I used thigh meat which helped, too. I also used extra garlic (minced). I used leaks instead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Schneider"
},
"reviewBody": "My son was worried when I said I'd made curry because he was worried it would be too spicy. Nope, this is perfect for those of us who love the flavor without the heat. I have made it as written, and also with roasted cauliflower added in. I am so glad to have come across this recipe! I will be making it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Windsor42"
},
"reviewBody": "Love it. Used sweetened condensed coconut milk instead of regular coconut milk and it turned out really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Melnychuk"
},
"reviewBody": "this was so delicious I think i will make it again in the future. The only modification I made was I used a can of crushed tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luke Ryan Peet"
},
"reviewBody": "It was really good! I wish I would have added more spices, but other than that 10/10!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bayougirl"
},
"reviewBody": "Next time the chicken gets fully cooked before adding the tomatoes so I can see if the chicken is getting fully done. The sauce does not look yellow, it's orange. I used yellow curry powder. When do you take out the bay leaf? It was too much for the skillet and I had to transfer it to a larger/Dutch oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "männlicheDamme"
},
"reviewBody": "Delicious. I followed Carrie H's traditional spice recommendation and highly advise that. This would be awesome with shrimp over rice. Will make again! ...I just made this for the third time - this time I added cauliflower and some spinach and it was great! I also used tomato sauce in place of the diced tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bjorn"
},
"reviewBody": "My family loved it and I'll definitely be making it again!! I followed one of the reviewers advice and added additional garlic, a little brown sugar, only half the can of coconut milk, and some Anaheim chili powder to give it a little kick. In addition, I blended the sauce so it was nice and smooth. Instead of chicken I used tilapia filets from Costco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alex"
},
"reviewBody": "I added a lot more curry, and seasoned the chicken with cumin and turmeric powder before cooking. I also added a cooked potato, no skin, because we love potatoes. It still needed a little something but this is a great base recipe and i will be experimenting more with it. Will probably add more spice next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon W."
},
"reviewBody": "This was quite good. I felt it needed a little something more, so I took the advice of another cook and added about a 1/4 t of cumin. That really brought out the flavors. I think the dark meat works best so next time will use 5-6 boneless, skinless thighs. I also like veggies in it so added a couple of sliced carrots and about a 1/2 c of frozen peas. \n\nI will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda C."
},
"reviewBody": "Very tasty! I added a little extra salt and served the curry over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Very tasty! I subbed tomato sauce a cut up tomatoes since I didn't have canned. I added pepper and used crabmeat. I think it would be tastier with some coconut as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaynie Murdock"
},
"reviewBody": "I used evaporated milk instead of coconut milk,it turned out thinner but still delicous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busymom"
},
"reviewBody": "Thought this was a good easy chicken dish. Kept the recipe as written except I used a can of diced tomatoes and added extra garlic and omitted the lemon juice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Reber"
},
"reviewBody": "I used rotisserie chicken, and added broccoli, green beans, and mushrooms. I only had diced canned tomatoes (with jalapeno) on hand and used in place of canned whole tomatoes.\n\nNext time, I would cut the lemon juice in half... a little tart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley"
},
"reviewBody": "I added 1t. cumin, doubled the garlic, and increased the curry to 2 T.. AWESOME............"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leo2002"
},
"reviewBody": "I LOVE this curry! I have tried tons of curry and this one is beyond perfection! I definitely will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Devin Nathan-Turner"
},
"reviewBody": "Really good. Couple tips:\n\n1. Slightly bland without chilli.\n2. Make sure to use a heavy coconut milk (not the light stuff).\n3. Jalapeños will add a nice kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D.G. Pruetz"
},
"reviewBody": "We love all varieties of cooking, I've never used curry much in my cooking, but I've always loved the flavor and scent of curry and this receipt is really good, I loved it the first time I made it and I make it atleast once a month or so, the only change I made was just a bit more curry powder (1 more tsp so instead of 2 tsp I use 3 tsp) it's a wonderful receipt and I will continue to cook this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SEBC"
},
"reviewBody": "Even though the taste is pretty good, I am puzzled by the lack of sauce. I served it with rice and there was hardly any sauce. Maybe I used too much chicken. I used 2 cups of cooked breast meat and halved the rest since the entire recipe called for an entire chicken. I really needed the entire sauce amount for the 2 cups of chopped chicken. The picture seems to show a lot more sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I made this as is and it was alright. My children liked it, it just didn't satisfy the curry craving I was having. If I make this again I will make some of the adjustments others have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Saufert Gass"
},
"reviewBody": "This was so delicious, I used a stalk of lemon grass instead of lemon juice, 3 garlic cloves, one tbsp brown sugar, 3 tbsp curry and cooked chicken breasts. Had a girlfriend over for our curry fix and she loved it.\n Thanks for this recipe, I've tagged it shared it and will make it again and again.\nHere’s the review I followed...\nNote:\nThis recipe is awesome! The only recommendation I would make (my mother was raised in India, so she taught me): the difference between a good curry &amp; a great curry is what my aunt called the broth. The broth is what is made with the spices &amp; the onion. The curry powder (paste is even better) should be cooked in the oil until it is ready - usually about 5 minutes. Then add the onion &amp; spice - cook until the onion is translucent. This will take about 10 minutes, but it makes all the difference in the world. Add more oil as the onion is cooking, if necessary. Then add the tomato (fresh is even better - strained) and cook it for a little while. NOW you're ready to make the curry. This recipe was a HUGE hit with my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shutchison6180"
},
"reviewBody": "I like it but 1 lemon was way too much. Half a lemon would be better and I think I will add some cayenne pepper next time to spice it up. Good base recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "berkas"
},
"reviewBody": "Liked it a lot. My picky child even ate it! Made with carrots, bell peppers and potatoes because I wanted a meat free dish. 1 T garlic, 1 T cumin, 1T brown sugar as suggested in other posts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aimeelynn"
},
"reviewBody": "Delicious! Added some extra veggies and spices. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "I upped the curry powder to about a tablespoon and added a few dashes of cayenne, and the seasoning was pretty spot on. I kind of wish I'd left out the lemon juice at the end though - it tasted better before I added it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirty"
},
"reviewBody": "Super good! A nice, versatile stew. I made some changes for what I was in the mood for. I added sweet peppers, whole habanero with holes poked in it, curry powder, chicken instead of garbanzo beans (dietary issue otherwise I would have kept the garbanzos), and added some brown sugar and coconut. Kept all other ingredients and seasoning the same. This will stay in regular rotation due to ease, taste, versatility, and healthiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Safika Erselcuk"
},
"reviewBody": "I added extra curry and brown sugar. I also marinated the chicken in yogurt and tumeric. I forgot about the lemon juice and ate it without and really liked the flavor. Next time I heated it up I added lemon juice and I didn't like it as much so next time, I'll just skip this step. I also added green beans and sweet potato to the mix while cooking. I'll definitely make it again, without lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lilcat"
},
"reviewBody": "I think that if I make this again I would add more curry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JLeo"
},
"reviewBody": "even with a supermarket bought curry powder, the dish is great. i added in mushrooms and broccoli to make it more filling and also added brown sugar (as others recommended) and my personal favorite, siracha sauce! it adds a perfect amount of heat and gives it a small taste of garlic. also, as advice i would increase the amount of curry powder by A LOT and add in more salt and brown sugar if your curry powder is like mine and is suited for people that cant handle the flavor of real curry. next time i will purchase curry from an ethnic foods store. :) :) :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Our new favorite curry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "Really liked this and the aroma is amazing. Followed the advice of several reviewers by tripling the garlic and more than doubling the curry. Used lite Thai coconut milk to save fat and calories and a can of garlic seasoned petite diced tomatoes as substitutes. Also added a Tbsp of light brown sugar to the coconut milk stage. Served over brown rice. Not spicy at all but that's easy to adjust. My family enjoyed, husband said \"great restaurant quality\". Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UMKATIBA"
},
"reviewBody": "I have a VERY large family and there is no way to make a recipe like this (even doubled) without them coming to make sandwiches 30 minutes later. SO....I used this as my base recipe and just after the onions had browned, I added peeled, washed and chopped carrots, potatoes and sweet potatoes and allowed them to cook for about 10 minutes before adding the curry, etc. Because of how much room it took in the pan, I transferred these ingredients to a crockpot and then browned the chicken in olive oil with the remnants of the earlier mixture still in the pan. Once slightly browned I added the chicken to the vegetable and curry mixture already in the crock pot, added a little hot water and then covered and cooked on high for 4 hours. All I had to do following my errands was make rice to serve with it. \n(Half the family ate it with Basmati rice and the other half ate it with long grain brown rice!) \nEVERYONE was licking their plates clean. TOTALLY making this again! The chicken doesn't make or break it. We have Hindu guests coming for dinner and I'm making it the same way....only without the chicken. THANK YOU FOR SUCH A GREAT RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "geniphre"
},
"reviewBody": "Looks like it would be good, but it's not. I even doctored it up. Bottom line too much work and no reward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fleur de Lirious"
},
"reviewBody": "This was quite good! I added more onion and garlic, also some coarsely chopped bell pepper, carrots cut into large matchstick pieces, and chopped celery.Used a spicy curry powder, but \u0010I also added a bit of cayenne for extra kick. Thanks for this keeper, Valerie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyn Coriell"
},
"reviewBody": "I closely followed the recipe but also used some of the suggestions. It was one of the best things I have ever cooked and I'm a pretty good cook. I used Trader Joes chickens curry cutlets and I think that made a significant difference. I can't wait to make this again. Served with basmati brown rice and sautéed spinach. AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny Perrault Duff"
},
"reviewBody": "This instantly became one of my favorites. The temptation is to cook it too often and thus get tired of it. Changes I made: I used diced tomatoes. Also, a lot more curry powder. I used a TB for 2 servings, so 2-3 TB for a full recipe. Also, 1 TB brown sugar (2-3 for full recipe) and 1/2 tsp. ground chili pepper (again, 1/2-3/4 for full recipe). Also used extra coconut milk. This recipe is fast to make and heaven to eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brytness"
},
"reviewBody": "A little more liquid-y than I expected but still great flavors"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "It was good, but lacking pizzaz. Too bland for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Kronmueller Twenge"
},
"reviewBody": "Shared it around the RV park and got raves. Froze some and hope it turns out just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Celeste"
},
"reviewBody": "I really enjoyed this dish! I followed other's suggestions &amp; added cayenne pepper &amp; brown sugar because I like my curry spicy &amp; a bit sweet. Next time I will make this with scallops or shrimp because the chicken didn't absorb the sauce as well as I hoped. Can't wait to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian Shaw"
},
"reviewBody": "This is great! Followed other user's suggestions and marinated the chicken first in plain yogurt mixed with some turmeric for about 30 mins, and added in a tablespoon of brown sugar when I added the tomatoes. ******* READ THIS *****IN A FLASH OF GENIUS, I HAD THE IDEA TO ADD SOME LEFTOVER PUMPKIN I HAD IN THE PANTRY (IT IS NOVEMBER). I ADDED ABOUT 1/2 CUP IN WITH THE COCONUT MILK AND LET IT SIMMER TOGETHER UNTIL REDUCED. THE PUMPKIN MADE IT EVEN CREAMIER AND HEARTIER. GAVE IT A LITTLE SOMETHIN SOMETHIN. I HIGHLY RECOMMEND DOING THIS!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Miles"
},
"reviewBody": "This was delicious! I did add a little bit of sugar, as suggested by a previous review. I would like to add some cayenne pepper, but my kids are sensitive to spice. But on the bright side, they are devouring it as a type! I also made garlic naan bread to dip in it. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peanutty"
},
"reviewBody": "This was great! I have made this twice. The first time I made this as written and the second time using fresh tomatoes instead of stewed tomatoes. Both times resulted in very tasty curry. The second time I added a little more garlic about 2-3 cloves more, adjusted seasoning to taste (curry powder, salt, pepper), and served with extra lemon wedges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzybaker"
},
"reviewBody": "Holy smoke. This is some amazing curry that is SUPER simple to make! My family (and I) went nuts for this when I made it!\nIt really IS comparable to a restaurant dish. \nI used chicken breast but other than that made this exactly as directed... And I will be making this dish again! Thanks for an excellent recipe Valleriekooka!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maggie"
},
"reviewBody": "I mistakenly bought sweetened coconut cream, I just put 3T of that with whipping cream to make up for the unsweetened coconut milk- tasted great. I added extra curry and red pepper to perk it up a bit. Very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "The flavor is not as strong as the smell, try adding a little extra spice. Although, it is more flavorful the day after"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilorchid82"
},
"reviewBody": "Husband loved it. I don't eat much meat, so we'll take his word. I will definitely repeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "edisonf"
},
"reviewBody": "It's been quite some time since I had a curry dish and I decided to give this one a try, mainly due to the fact that it looked easy and only had 10 ingredients. It was delicious and I will definitely have this again soon! I did take the advice in the CCOTTINO review below of marinating chicken in yogurt and turmeric, extra onion and garlic, more curry, 1/2 of the coconut milk and 1/2 lemon juiced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ardys"
},
"reviewBody": "Made this using chicken. I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mery Pibon"
},
"reviewBody": "This recipe is worth every star, it's fast, easy and delicious. It's not as hot as other curries but it's easy enough to adjust if you want it hotter. I usually make it with a pound of shrimp. I added 1/2 tsp chili powder, 1/2 tsp turmeric and 1/4 tsp cumin. I also cut the coconut milk to half a can to get a thicker sauce and to cut back on the fat intake. I followed the cooking directions as written. Thanks Valerie for the great curry recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CoffeeAddict"
},
"reviewBody": "This was just okay. The coconut milk was nice idea in theory, but a whole can is terribly fattening and if you eat this the same day you make it all you taste is coconut milk. It was, however, much better leftover the next day but I wouldn't make this again when there are so many better curry recipes out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alexis"
},
"reviewBody": "I decided to try this recipe because my sister in law who is from Nigeria made something similar a few weeks ago but she had no real exact measurements to tell she just goes by taste... so i used this recipe as a guide and we made the following alterations used 10 drum sticks less the skin used 2 cans of coconut milk added 2 small potatoes and 2 medium carrots we used 2 medium onions, one fresh tomato, one bell pepper and 4 cloves of garlic we also added at least 1.5 table spoons of hot curry powder and some ground cayenne pepper also a knorr cube...\nit came out awesome and very flavorful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ccb296"
},
"reviewBody": "This was absolutely delicious! Instead of a whole chicken, I used 2 lbs of boneless skinless chicken breast cut into chunks. Then I served it over brown rice and shredded cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Joel"
},
"reviewBody": "To tenderize the chicken I marinated it in fat free plain yogurt with tumeric and garlic stirred in for a couple hours, then I browned it before adding to the onion mix.\nI was out of curry, so I mixed my own African curry powder: 1 1/2 teaspoons ground ginger 1 1/2 teaspoons dried garlic 1 tablespoon ground coriander 1 tablespoon ground cumin 1 tablespoon ground turmeric 1/2 teaspoon cayenne 1/2 teaspoon hot chili powder.\nI doubled the recipe and only used 1 can of coconut, kicked the curry to at least double, added a bit more cayenne pepper and cumin. YUM!\n*I added thin sliced red potato, red pepper and green peas to the onion at the end, too. Forget about the lemon, you don't need it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colleen Brown Bellows"
},
"reviewBody": "I used cut up whole chicken. It was good but more runny than I'd like. I thought about thickening it a little. I upped the salt a little and used fresh roma tomatoes and sauted that down a good while. I still thought it should be thicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Barila"
},
"reviewBody": "I loved this, and of course, tweaked it just a bit. I added 2 big tablespoons of a very spicy Vindaloo curry paste (you can find it in your local grocery store w the Indian foods, usually), cooked cubed potatoes, and peas. \r\nI also lightly sauteed some shrimp until barely done, and added in the last 5 minutes of the simmering time near the end. \r\nUsed the whole can of coconut milk, no problems with the sauce being runny at all. \r\nReally good, restaurant quality dish. Now I can have curry whenever I want!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Jakubowski Matteson"
},
"reviewBody": "I loved this. I used skinned chicken thighs with bone left in and added 1/2 cup of fresh peas from the farmer's market. I kept it mild and sweet and completely forgot about the lemon juice at the end. It didn't need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abchstylist"
},
"reviewBody": "i left out the tomatoe and it was AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Not having ever tasted African Curry before, I assumed (perhaps wrongly) that there would be a bit more zing to this recipe. I found it to be awfully bland. After sitting in the frig over night, it definitely tastes better as the chicken was allowed to marinate in the curry sauce, but still a so-so recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CORILITA"
},
"reviewBody": "I liked it, it was easy to make and tasted pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky Rusmisel Williamson"
},
"reviewBody": "This was really good! We had it over brown rice and everybody loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisa Mari Kuppe"
},
"reviewBody": "DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "yum-me"
},
"reviewBody": "This was ok. I love curries and was excited to try this. Too much cocont milk and not enough flavor to rival a restaurant dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paddi"
},
"reviewBody": "I like it but it was nothing special. My husband said he like it too but next time I will add more veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Strange"
},
"reviewBody": "As written I found it to be too bland. I also do not understand the need to take 10 minutes to pour in a can of coconut milk. After I added curry paste and salt and we enjoyed it more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyBeeTami"
},
"reviewBody": "This curry was really nice. My spouse really loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is a GREAT basic curry dish...i added cauliflower and potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimi Sturgess"
},
"reviewBody": "this is a GREAT basic curry dish...i added cauliflower and potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SilverNBlack"
},
"reviewBody": "Wow, good base recipe. This was delicious and I'll be making it regularly, but I made many changes for the sake of adding flavor and a bit of heat: I used much more curry, only a half can of coconut milk, a teaspoon brown sugar, no bay leaf, a can of diced tomatoes with the liquid, much more salt (coarse salt), pepper, cayenne, pepper flakes, and sliced boneless-skinless chicken thighs- the dark meat has more flavor and stays more tender (plus it's cheaper). I sauteed the onion about 5 minutes, added the chicken (which I seasoned), then the garlic after about 5 minutes. Once the chicken was cooked, I added the tomatoes and rest of the spices and brown sugar. Then, I let that simmer for 5 minutes, slowly added half a can of unsweetened coconut milk, let it come to a simmer, then served over brown rice. This was the first time I made curry, but I'm no cooking novice so I knew better than to follow the recipe verbatim- you can tell it would turn out bland that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annabel Eyrick"
},
"reviewBody": "This is very good curry. Not too spicy yet full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kris Munson"
},
"reviewBody": "I really liked this dish. It's a good one for people who aren't too sure about curry, because it wasn't too spicy (I think in the future I'll make it a little spicier). The coconut milk adds a little sweetness that is pleasant. I'll return to this recipe often, I'm sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Heineke"
},
"reviewBody": "My husband and I love this dish. I use 2 whole chicken breasts instead of the whole chicken, and I add 1 Tbs sugar and a dash of cayenne. This is great served over white rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "courtney"
},
"reviewBody": "This is great! I'm eating it as I write! I did make quite a few changes though: I sauteed the onion, garlic (I used five cloves), and bay leaf (I only had crushed bay leaves in a shaker so I used 1/2 tsp.) in chicken broth instead of oil to cut down on the fat. Along with it I also chopped up an individual size snack pack (65g.) of mini carrots. I used 3 tsp. green curry paste instead of the powder (next time I'll use more), I only had diced tomatoes on hand so I used those, I threw in a dash of red pepper flakes and a tablesppon of brown sugar along with the coconut and a few squirts of bottled lemon juice. I'm happy with the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SP"
},
"reviewBody": "Delicious! I didn't have whole canned tomatoes so, I mixed up canned crushed and 1 ripe fresh tomato. Added 1 tsp garam masala (for *kick*), and halved the entire recipe. Was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gem05"
},
"reviewBody": "I first tried this recipe as is (except for using boneless, skinless chicken breasts chopped into pieces) and found it to be too bland. I added seassoned salt(McCormick only!), garlic and onion powders, red (cayenne) and black peppers, and probably 1.5-2x more curry powder and it came out great. When I am in the mood for really spicy, I add in chopped serrano peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MONICA397"
},
"reviewBody": "Very creamy, easy recipe. Not spicy at all. Still enjoyed. My curry was not spicy but will buy spicier curry next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melanie b"
},
"reviewBody": "Good to Joe and me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMICHE1"
},
"reviewBody": "I gave this five stars because I substituted several ingredients/made alterations and it still came out fantastic. When I went to add the coconut milk, I found that it had gone out of date. The closest substitute I had on hand was cream of coconut. I used all I had left in the bottle (about 8 oz) and added regular milk to make 14 ounces. I used some leftover roasted pork loin as the meat, added two potatoes cut into cubes, an extra tablespoon of curry, 1/4 tsp cayenne and a couple of fresh Roma tomatoes in addition to the canned. I thought for sure it would come out terrible due to substituting the coconut milk, but like I said, still fantastic. I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kylie"
},
"reviewBody": "I changed the recipe a little -- I used vegetarian chicken pieces, vindaloo seasoning instead of curry, and added tomatillos. I thought it was good, but not nearly as spicy as I expected since the vindaloo seasoning is quite hot without coconut milk. I added more salt than indicated as well, and,as others suggested, added brown sugar. Overall, a good dish. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "allrecipesrocks"
},
"reviewBody": "Ok, I'm not a knowledgeable curry cook so maybe that is why I had trouble? It seemed that many people had great success with a few modifications, but mine turned out to be very watery. I think I need a step-by-step guide on curry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Beer"
},
"reviewBody": "Excellent template curry dish. You will probably have to make it a few times to get the right flavor and spiciness for you but when you find the perfect mix, you will keep coming back for more. I have made a few adjustments that I would like to share. First, I cooked the chicken separately and set aside for adding later. Also, I personally like vegetables in my curry dishes so I added a halved then sliced small zucchini and a halved then sliced green pepper (will add more next time.) I am a tomato lover and added a 28 oz can of whole peeled tomatoes instead of the 14.5 oz can. I also went nuts with the garlic and curry. 6 cloves of garlic and 2+ tsps of spicy curry powder and 1+ tblsps of red curry paste. To top it off, I added a generous amount of crushed habenero flakes. Most will not tolerate this but I do recommend adding some sort of heat to this dish. I also added a tbsp of cornstarch to the coconut milk to thicken it up. In the end, an excellent restaurant style curry dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "decoratorlady"
},
"reviewBody": "I thought this was a very simple and tasty recipe. I added a bit more curry that it called for, as well as extra salt. Next time I use this recipe I plan to try using even more curry and an additional clove of garlic for extra zing. This will definitely be a recipe I visit again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melanie Booth"
},
"reviewBody": "The end result i got from this curry was delicious, but i ended up needing to make many adaptions. 1. I use diced chicken breast instead of a whole chicken 2. I used the 2 tbsp of sugar like everyone reccomends 3. I used 2 tbsp of mild curry paste instead of curry powder 4. And i added a chopped red bell pepper. Very tasty with my adaptions i think"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wvcookwv"
},
"reviewBody": "I wasn't terribly impressed. It was ok but missing something that I can't put my finger on. I probably will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ted Burfield"
},
"reviewBody": "Abso-flippin-lutely fantastic. My girlfriend and I love this recipe. We follow it to the letter, put it over rice, and serve in a bowl. The only thing we do different is use boneless/skinless chicken cut into cubes and brown them before adding them to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peace Frog"
},
"reviewBody": "Great for the 2 of us with conflicting palates - I love exotic foods, my hubby prefers traditional American. I didn't have enough chicken so I used a couple whole skin-on bone-in chicken parts and hot Italian turkey sausage, browning before adding the onions, rmeoving and re-adding. Also added a touch of collards and okra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "Delicious! Especially over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Eller Richmond"
},
"reviewBody": "I loved this dish. Could easily be made with chicken tenders or breast. I didn't bone the thighs, legs or wings and cut up the breast into chunks. Following some of the other comments, I marinaded the skinned chicken in yogurt, turmeric and pepper. I used canned tomatoes, 6 cloves of garlic and 1 purple onion and 1 white onion since I had both types. I made my own curry powder using the recipe another reviewer had posted. My Dad grew up in India and he told us they always made fresh curry powder. I reduced the cayenne pepper to 1 teas so my son would eat it. This amount gave no kick. I served it with Mediterranean Quinoa, (allrecipe.com) instead of rice as I try to stay with low glycemic foods. The two dishes blended very well. The following day, I mixed the leftovers together and added fresh chopped plum tomatoes, more of the fresh curry powder and more cayenne pepper so that it had some kick. Was even better the 2nd time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annzee"
},
"reviewBody": "OK - I'm giving this one 4 stars provided that you first check out the the excellent suggestions in the reviews. I made the African curry that one of the reviewers provided since I didn't have curry powder (&amp; didn't feel like running to the store :). I also marinated cut up chicken breasts in yogurt mixed with turmeric and black pepper as suggested by another reviewer (but I wiped off most of it before adding to the skillet). I also added 2 T butter to the sauce along with some brown sugar before adding light unsweetened coconut milk (all I had on hand). I think it needed the regular coconut milk as the sauce seemed a bit thin. I didn't care for the fresh lemon juice and am glad I only added a small amount. I had to add a bit of fine sea salt at the end too. So, this is a good recipe with some additions and I'll make it again. I'm amazed at all the reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookiemommie"
},
"reviewBody": "Yummy! I did make a few changes per other reviews - double curry and garlic. I used 2 chicken breasts and 1 package 21-25 count jumbo shrimp. Excellent combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sixkyej"
},
"reviewBody": "I used chicken breasts and fresh tomatoes. We loved this! Quick and easy meal. Will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elisabeth"
},
"reviewBody": "This was an interesting and flavorful dish! Instead of using a whole chicken i just used boneless, skinless chicken breast. I also omited the bay leaf. My husband commented that maybe next time i should add something to make it a little spicy, and i agree. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leslieebony"
},
"reviewBody": "Made it at least twice - always good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary K. Lyskawa"
},
"reviewBody": "We thought this was good although I did triple the garlic and curry and I also added 2 Serrano peppers and a heavy shake of cayenne. We like it a bit spicy. Served over Jasmine rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome! Used Red Curry."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/47439/african-curry/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
"name": "Cuisine"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/226/world-cuisine/african/",
"name": "African"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/47439/african-curry/",
"name": "African Curry"
}
}
]
}
}
, "about": [
]
}
]