				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "African Peanut Soup"
,"datePublished": "2004-06-10T12:43:16.000-04:00"
,"dateModified": "2022-11-10T13:18:10.000-05:00"
,"author": [
{"@type": "Person"
,"name": "PIETOGO"
,"url": "https://www.allrecipes.com/cook/511389"
}
]
,"description": "This African peanut soup is a wonderful combination of tomatoes, onion, peanut butter, and brown rice that makes a surprsingly satisfying soup."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EYug_wwO40YI8hYjKwDPaWdi5Kw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9440150-3002fa61a6904889a489e7f0db2549c2.jpg",
"height": 1441,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "African Peanut Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "475"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "222 kcal"
,"carbohydrateContent": "24 g"
,"fiberContent": "5 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "559 mg"
,"sugarContent": "6 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons olive oil",
"2 medium onions, chopped",
"2 large red bell peppers, chopped",
"4 cloves garlic, minced",
"8 cups vegetable broth or stock",
"1 (28 ounce) can crushed tomatoes, with liquid",
"0.25 teaspoon freshly ground black pepper",
"0.25 teaspoon chili powder",
"0.66666698455811 cup extra crunchy peanut butter",
"0.5 cup uncooked brown rice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a large stock pot over medium-high heat. Add onions and bell peppers; cook and stir until tender. Stir in garlic and cook until fragrant, about 1 minute. Stir in vegetable stock, tomatoes, pepper, and chili powder. Reduce heat to low and simmer, uncovered, for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in rice; cover and simmer until rice is tender, about 15 minutes. Stir in peanut butter until well blended; serve."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KellyS1015"
},
"reviewBody": "Amazing! I have been making this soup every winter since 2009. I make it a few times each winter, and I love it! It’s an exciting mix of flavors, and my friends and family love it. Let it simmer for at least 45 minutes, and do add the chili powder - it’s not a spicy taste by any means, but it adds a necessary taste. I often make a half batch just for myself! Try it. You will not be disappointed! Personally, I add fresh chopped peanuts, and I use chicken broth sometimes. But, it’s great as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xkzmnkrhkb"
},
"reviewBody": "I’ve been making this soup for over a decade – easy-peasy and always a hit! \n\nDepending on the ingredients I happen to have on hand, I often increase the onion, red peppers, tomatoes, and/or garlic by up to 50% and it always turns out fine thanks to the versatility of this recipe. \n\nI also like to give the soup a couple of quick zaps with the immersion blender (puréing no more than ¼ of the soup) and then add a dash of salt and a few drops of fresh lime juice upon serving, to taste.\n\nSuperb! Thank you very much for this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cliff57"
},
"reviewBody": "1st time I made it was ok...\nThe 2nd time I added celery, carrots, peas and bumped up the chilli powder to a heaping 1 1/2 teaspoons.. much better with the extras the second time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vmasminster"
},
"reviewBody": "Delicious. The first soup I made on my journey to become vegan. I didn't know vegan could taste so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. T"
},
"reviewBody": "Love it! So good with Naan bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aubrey Eshelman"
},
"reviewBody": "Needs a little more spice. Some cayenne drastically improves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Duke"
},
"reviewBody": "Thank you!\n\nIt gets five stars because my kids all had seconds. My pickiest, health-conscious daughter had four bowls. \nI used the optional chili powder. \n\nI added salt because I used all-natural peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bart Lawless"
},
"reviewBody": "Very tasty, would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MJR"
},
"reviewBody": "I'm not sure what I expected with this recipe. The concept was relatively unique and new to me, so I thought I'd try it. The biggest (maybe only) strike against it was that I found it bland. I found the spice/seasoning profile was far too light and there was no discernable peanut flavor. Making it again, I think I would triple the peanut butter and quadruple the spices. I would also experiment with basil or something similar to lift it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndy Beer"
},
"reviewBody": "Wow! This is a delicious soup! Wasn't sure how I would like it but figured I would since I love peanut butter! I did increase the amounts of chili powder and pepper and also added a couple of cubed sweet potatoes I had on hand. I used basmati rice which cooks in 15 minutes vs closer to 45 minutes for brown rice. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WendyB"
},
"reviewBody": "So i used poblano peppers and a fair amount of ancho chilis. Used extra crunchy Jiff. It was awesome. Topped with cilantro and green onions. Only other item i changed was to use fire roasted whole tomatoes. I drained them and cut them up, and then sautéd with the onions. Added the tomato juice with the stock. I let it sit for a few hours as i always do with soup. \n\nI didn’t have brown rice so used white. Think brown would have been better, but it was still a success.\n\ni will for sure be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Beckwith Kimble"
},
"reviewBody": "I added the rice at the beginning of the simmer process to make it less al dente."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "f00die"
},
"reviewBody": "This was very good! I made it last night at half the servings with a few changes and had it again today for lunch. Like many soups it tasted much better the next day.\n\nThe changes I made are that I took other reviewers advice and added cilantro and fresh lime juice during cooking and topped each bowl of soup with some roasted peanuts and sour cream. I also added some chile and lime salt spice. I cut the rice out (I try not to carb it up too often). The BIGGEST change I made was to the peanut butter, but hear me out!\n\nI realized I only had honey roasted peanut butter on hand, then remembered I had PB Fit powder. I used about 3 large spoonfuls. I really liked that it added the peanut butter flavor without making the soup too thick or heavy. \n\nDelicious starter recipe, next time adding chicken for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhoebePooky"
},
"reviewBody": "I love it! I followed the recipe as is but also added 1 sweet potato. More chili powder and 1 teaspoon of Cumin, or more. lots more pepper! I used natural peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Rose"
},
"reviewBody": "Very good! Unique yet familiar. \n\nChanges I made:\n\n-added a block of tofu: adds protein &amp; volume without changing flavor much lol\n\n-added 1/2 sweet potato per other reviewer's suggestions. worked very well\n\n-I made a 1/2 recipe, but kept the full amount of PB!!! Why not. It was decadent. Probably still good with the \"correct\" amount but delicious with double ;P\n\n-I don't feel that the rice added much. maybe if I hadn't added the sweet potato would have noticed it more. I think you can skip the carbs &amp; leave the rice out, OR, maybe serve over rice instead. \n\nIf I make again, I'll add some chopped peanuts on top, &amp; serve over basmati rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "csdo01"
},
"reviewBody": "Bland and flavorless..... Even with Chili powder added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This works very well, but I agree with the other reviews that it needs a lot more spice/heat than as written. I'm still giving it 5 stars because it's easy enough to increase the spice level to your taste. I added red pepper flakes in addition to doubling the chili powder. I also added in some canned chickpeas along with the rice and that was good, but it's good as written, too. Thanks for this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "john payne"
},
"reviewBody": "Followed to the T and it tasted soooooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "merrygail"
},
"reviewBody": "Heavenly flavors and so easy to up spice if you want. Best soup I've made in ages!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy DeLauter Fletcher"
},
"reviewBody": "Love it. I can't eat dairy and thought peanut soup was lost to me. Not so. This is a rich soup with veggies. I did put in 2 T of grated ginger as I had read it in similiar recipes. Very good, plan on sharing at next potluck as it goes together easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoNell"
},
"reviewBody": "Delicious soup!!! I upped the spices a bit to suit our tastes and added cooked brown rice to bowls individually."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinar"
},
"reviewBody": "This is one of my boss's favorite dishes that I make. I sometimes add chopped or shredded chicken to it. It is YUMMYlicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Holman"
},
"reviewBody": "This soup is simple and amazing. I like it more spicy, so I add more cayenne / jalapeno. I recommend having a healthy amount of crusty bread because it's great for dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaxdakota"
},
"reviewBody": "We really enjoyed this soup. The flavor was great and I did add more chili powder like other folks have suggested. It came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aftqueen"
},
"reviewBody": "Great base, but needs tweaking to reach full potential.\nThe spices are completely unnoticeable in such a large volume of liquid. I added 4x the black pepper and double the chili. Also added paprika. \n\nWith those minor additions, it was hands down the best African peanut soup I've made, and I've tried a dozen different recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Palmer"
},
"reviewBody": "I loved it! I made it twice but the second time I upped the peanut butter to all of a small jar of all natural peanut butter. I'm guessing 28 oz. The extra peanut flavor really made the soup better.\n\n--YosemiteSuz"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "We really liked this. The only change I made was to add the brown rice when the liquids went in, because it seemed like it would need that whole time to cook. Served with a green salad and some take &amp; bake bread for a nice light dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina Grant"
},
"reviewBody": "delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwalden32"
},
"reviewBody": "This was excellent. We put the veggies in the vita-mix because I don’t like veggie texture—and this was ridiculously good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leila Schetz-Rollins"
},
"reviewBody": "Odd combo. Amazing soup!!! And vegan! Great change from the regular cabbage or chicken tortilla. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Elsesser"
},
"reviewBody": "A seemly odd combo that works really well! I doubled the rice which ended up being a mistake and it was super thick lol. Best to leave that bit as is probably."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geoff Hill"
},
"reviewBody": "Made it as posted. Great. Tried it again with creamy peanut butter and liked it better, wife preferred it with the crunchy. Will make again real soon. Neighbors liked it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "this was a great soup, i used salsa and added my brown rice that was pre cooked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Jo"
},
"reviewBody": "This was delicious! We loved how all the flavors worked together and the rice gave it a stew-like consistency. The only change I made was to add some shredded chicken I had on hand. Next time I'll add a diced sweet potato and bump the heat a little by adding a can of diced tomatoes and green chilies. This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joycan"
},
"reviewBody": "Love this soup! It's my \"go to\" for lunch. I just add additional chilli powder, some cumin &amp; cinnamon. Occasionally I'll add red pepper flakes to spice it up. If I don't have crunchy peanut butter I crush some peanuts. YUM!! For a vegetarian I substitute chicken bouillon for the veggie bouillon. Both are great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I have made this soup as is and it's very good, especially with some crusty bread and a dollop of sour cream mixed in. I add a sprinkling of cayenne towards the end and it moved it up to 5 stars for me and mine. It lasts surprisingly long for a vegetarian soup, what with the peanuts. Thank you for a great and unusual recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nbkxp97"
},
"reviewBody": "Thought this was really tasty! I added an extra 1/4 cup of rice and used white rice because I didn't have any brown rice. I also added 1/4 cup of chopped cilantro, shredded cooked chicken and 1/4 tsp. of cumin when I added the peanut butter. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brigette Davitt"
},
"reviewBody": "Substituted 1/3 of the crushed tomatoes with puréed squash, added 30% more extra crunchy peanut butter, and added smoked paprika, red curry powder and ground cayenne pepper to kick up the spice a bit.\n\nWinner of the Fineview 2016 Soupapalousa!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nooran Mazen"
},
"reviewBody": "Made this recipe in bulk for a multicultural food fest, smelled and looked amazing and completely sold out! Very simple to make yet so good! I would also suggest mixing part crushed tomato part mild salsa in place of just the crushed tomatoes. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martijn"
},
"reviewBody": "Awesome, made this a number of times now. Some hints and tips: First of all, I was tempted to try canned diced instead of crushed tomatoes; don't recommend it, it's worse.\n\nHowever some changes that I found are worth it:\n* For the quantity I had, I used about 5-6 cups instead of 8 cups of broth since the pan was too small. Leaving the other ingredients the same amount. So it's more dense, which is nice!\n* Add a handful of crushed peanuts for even more crunchy nutiness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlyn"
},
"reviewBody": "This is delicious if you like peanuts which I do. The soup had a great texture and flavor. I added a cup of precooked brown rice and reduced the vegetable broth to 7 cups. I also added 1 tsp of chili powder rather than a half. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crissy"
},
"reviewBody": "This is one of our family's favourite soup! I make it a bit heartier by adding chicken breasts to it at the beginning and boiling them, and then I remove them and shred them once cooked and add it back into the soup once done. I also add crushed peanuts because I use smooth peanut butter. Love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "orla o callaghan"
},
"reviewBody": "Just made it for the first time today and I absolutely love it! I added fresh chilli instead of powdered and some ketchup for a little sweetness as I made it quite spicy. Will definitely be making this a lot more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Boy R Drew"
},
"reviewBody": "Delicious and different"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melonie"
},
"reviewBody": "Rated it 4 stars because I am rating this recipe. Followed advice of others and made some changes...more chili powder, cumin....used jar of fire roasted peppers and smooth peanut butter - it was fantastic! A keeper...5 stars with changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole"
},
"reviewBody": "I made this soup for the first time for a dinner parry. I took the advice of other reviewers and substituted mild salsa for 1/2 of the tomatoes. It was so good that several people asked if they could take some of the leftover soup home. I used chunky natural peanut butter and brown rice. I just let the soup simmer while making other dishes so that the rice would be done. Topped with sour cream and cilantro, this soup made a pretty presentation in glass soup bowls. I do plan to make this again. It's so quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whitley Alizabeth"
},
"reviewBody": "I loved it! But I did make it a little bit differently. I doubled the garlic cloves, doubled the powder, and used chicken stock as opposed to vegetable stock. I also didn't add the full 8 cups of broth as I like my soups thick, I only did about six. I did a full up of rice as opposed to 1/2, and I only used one large onion since I chose to substitute the can of tomatoes with chunky salsa. I sautéed half of a sweet potato (diced) in olive oil, a little butter, and some cinnamon then added it to the mixture before adding the peanut butter. I also added a little more peanut butter than called for which was PERFECT! I ended up realizing I didn't need to add any additional peanuts in the end because of this (which was awesome seeing how I forgot to buy extra peanuts!). After the soup was finished, I found myself adding a bit of chilli powder, onion powder, and seasoning salt to my bowl. It was DELICIOUS! Soooo.... time I will add a little more garlic and chilli powder. I will also throw in a little onion powder ?? Try the recipe! Make it your own!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig1962"
},
"reviewBody": "I used medium or hot salsa and added twice the peanut butter. It's a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "I had this in Africa. It is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved it.I used creamy peanut butter,&amp; had to add mixed veggies to make it filling because I didn't use the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missing_mish"
},
"reviewBody": "This soup is amazing. I made some changes. I used a jar of salsa and a 10 oz can of diced tomatoes with cilantro &amp; lime juice in place of the can of tomatoes. I added 1/2 t of Cumin and 1/4 t of cayenne pepper. I used creamy natural peanut butter. I used one red and one orange bell pepper. The result was excellent. Thank you so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Duffy Johns"
},
"reviewBody": "I utilize this site a lot for recipes, but this is my first time reviewing -- that's how awesome this soup is! It was so easy to make, and I froze a portion of it a couple weeks ago and just thawed it out and it's still fantastic! I pretty much followed the recipe except I added like a quarter cup of roasted peanuts in addition to the crunchy peanut butter because I wanted it to be pretty chunky. If you are hesitant because you think this is a strange flavor combo -- just try it, it somehow just works!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Giddilee"
},
"reviewBody": "This soup was delicious! Even my brother, who rarely rates food better than \"ok,\" said that this soup is amazing. I followed the directions exactly, but I ended up simmering the brown rice for about 45 minutes before it was tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MuskokaJac"
},
"reviewBody": "My 7yo didn't care for it but we loved it. It is so tasty! I followed other reviewers and tweeked a few things as well such as peeled chopped potato, 1/2 cup salsa and I had an African blend spice which has cinnamon and fennel in it..yum. I used brown basmati rice, fresh roma tomatoes, sliced carrots and put a full cup of Kraft creamy peanut butter. You really can't go wrong. Definitely be making this again and again. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christic P."
},
"reviewBody": "Tried it didn't like this recipe because it tasted nothing like the first time I ate peanut butter soup. Will try another to try and get that authentic taste...It was tasty though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisajoy"
},
"reviewBody": "Another meatless Monday hit. Changes I made, using vegetable stock instead of chicken, creamy peanut butter instead of crunchy and a little cayenne pepper instead of chili powder because it is what I had on hand .. Served with garlic bread .. will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OCHUMGACHESH"
},
"reviewBody": "I've made this a few times now. If I don't add chicken, I like to double the rice. I also like a dash of cayenne in addition to the chili powder. I only use one red pepper to appease my veggie-phobic children. (I chopped the one up so fine that they didn't know it was there--bwa ha ha!) Great low-cost, high-taste recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Moyer"
},
"reviewBody": "I have made this soup at least 10 times since I found the recipe. It is a favorite! It's so easy and quick to make. ???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elle"
},
"reviewBody": "Overall not a bad recipe. DELICIOUS the first bowl but after that it gets a bit boring. I made a big batch then froze smaller batches instead of wasting a big pot full. Be careful with others' suggestions - I may have added too much salsa based on another review and it made it taste slightly acidic. I added cinnamon, shredded carrot &amp; celery which turned out beautifully. Give it a try! Definitely taste as you go along to make sure that it tastes the way you want it to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "habisabi"
},
"reviewBody": "I am African but born in america I don't like it when people call me African American my dads from west Africa aka Ghana and my mom makes this all the time she says she doesn't how to make it she just throws it together so I went on here and looked and amazing aka my step mom is from Kenya.\nBut it was delicious my grandma is Southern and she even likes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C. Waite"
},
"reviewBody": "We really enjoyed this soup. I did add some cayenne powder, cumin, and crushed red pepper. Used sesame oil along with olive oil for sauteing. Loved the crunchy p-nut butter in it. Definitely add salt. Did use one 14/15 oz. can of crushed tomatoes and one can of Rotel with green chiles. Also used chicken broth in place of vege broth. This may seem like a lot of changes for a five star recipe. But they were changes made to my taste. It had nothing to do with the original recipe. I often, if not always will add a little extra here, or less there to most of my recipes, as I'm sure most of you do. The salt was the only thing, in my opinion, that should have been in the original recipe. But this comes from someone who nearly always has to add extra salt. Anywho, give it a try. It really is a unique and delicious recipe that my whole family loved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kewpiechan"
},
"reviewBody": "More garlic, more chili, less onion, and pre-cook the rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker_Laura"
},
"reviewBody": "love! I added sliced carrots and celery for more veggie content, and used smooth peanut butter - delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurafauna"
},
"reviewBody": "This is a wonderful soup. I followed Liz E.'s slight modifications to make it more authentic, though I think it would have been just as good had I followed the recipe exactly. Thanks for this wonderful African soup!\n\nUsed 365 brand crunchy peanut butter, used Lotus brand pink Madagascar rice, which cooked pretty quickly and had just the right texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Amstutz"
},
"reviewBody": "Very good! Traditionally, instead of rice, would be yam / sweet potato, which my family doesn't like so I used boiling potatoes instead of rice. Served with roast chicken and carrots - which I thought was good also mixed into into my bowl :-) anyway, I'll make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CP-D"
},
"reviewBody": "Wasn't good. Next time I would use less garlic (half),more peanut butter and more rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dottington"
},
"reviewBody": "Mmmmm! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jnapen"
},
"reviewBody": "Delish! I put my rice in with the broth and tomatoes, which had my basimati rice perfect after 30 min. Also added an extra 1/4 tsp of chipotle chile pepper for more heat, a pinch of cumin and some lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "js"
},
"reviewBody": "I think that those of us who use tomatoes, peanut butter, and broth without added salt, sugar, or other additives need to make alterations to this recipe. Here's what I did.\nThis was a hit after I altered it.\nTo start,I used less veggie broth. And I partially cooked the brown rice before I added it.\n\nAdditions after it turned out bland:\nMaple syrup (approx 1/4 cup),\nLakewood OG Pure Lime juice (approx 1/4 cup),\nmore pepper, \nmore chili powder, \nfresh cilantro,\nmore garlic (about 6 cloves total)\nmore peanut butter (I used Woodstock OG crunchy), \n2 med cans diced tomatoes.\nAnd chopped peanuts and fresh cilantro for sprinkling on top of each serving.\nYummm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn W"
},
"reviewBody": "I made this for the first time last week. I love it because all the ingredients were in my pantry or frig. I read all the reviews and tips and followed a few of them. I added frozen butternut squash, chopped fresh zuchini and crook neck squash because I had them. We were eating this as a main dish with salad so I wanted a hearty soup. I doubled the rice but would probably only add 25% more when making it again. I also added 1/4 tsp. red pepper flakes because we are addicted to spicey foods, some cummin and by mistake cinnamon because I thought it was cummin (same size container), increased garlic also. The cinnamon was delightful in the soup as a background surprise flavor. This soup was a hit by all who ate it and yes, it was better when we heated it up while watching football on Saturday afternoon. It is a keeper recipe for anyone vegan or not and makes a generous amount, enough to freeze. Thank you for submitting this delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "90-2sexxi"
},
"reviewBody": "I made this the other day and it tasted great! I used whatever ingredients I had on hand; can fire roasted tomatoes, chipotle pepper in Adobo sauce and a box of College Inn Thai Ginger broth. Added the peanut butter (super chunky) during the last 30 minute And let it do it's thing in the crockpot! Easy no must no fuss recipe! Freezes nicely, will be making again but not too soon! This isn't exactly waistline friendly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenny davis"
},
"reviewBody": "An excellent soup. I tried to adhere strictly to the recipe, but did follow the advice of others and replace 1/2 of the tomatoes with salsa. Used chicken broth instead of vegetable, used natural chunky peanut butter, used quick cooking brown rice. Agree that chicken would be good. I think that I will add sweet potato next time as well. When I first tasted this right after preparing, it wasn't anything great. But, after it had been in the fridge for awhile, it was absolutely superb. My family made fun of me for making peanut soup, but they all said they loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cayce"
},
"reviewBody": "Love this recipe! It's an absolute favorite of mine. I made a couple slight changes. I add a full cup of peanut butter instead of the recommended 2/3 of a cup. I also cook the rice separately and I double the amount... I cook a full cup of brown rice and add it all to the soup after it's done cooking. LOVE LOVE LOVE this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeAspiringCook"
},
"reviewBody": "One of my favorite soups: easy to make, nutritious, delicious, and freezes well. What more could you ask for? \r\nFor variety, I've tried substituting cashew butter--also great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cori Anderson"
},
"reviewBody": "I love this soup so much that I buy red bell peppers whenever there's a really good sale (and then I chop and freeze them), so that I'll be able to make this soup whenever I want to, without having to pay the normal full price for red bell peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LostOutEast"
},
"reviewBody": "Took someone's advice and used half the crushed tomatoes and added about a cup of salsa. Also added a little bit of kale. It was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yummy"
},
"reviewBody": "I love soups. They're so versatile, simple, and cheap to make. For just a few English Pounds this out and out delicious soup has become one of my top-ten! The only change I made was to include a tsp of Allspice ...Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dustin"
},
"reviewBody": "Like many other reviews I added a bit as I was working and this recipe turned out DELICIOUS! I substituted one jar of salsa for one of the cans of tomatoes and doubled the chili powder as well as added a dash of cinnamon and a dash of curry powder to the soup. This soup turned out to be a hearty, spicy, vegetarian dish I would be proud to serve anyone! It's going into our rotation from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly Tyler"
},
"reviewBody": "I added chili pepper flakes, as well as more chili powder than the recipe called for, based on other reviews. However, I added too many chili pepper flakes, so I added a can of coconut milk, which tamed the heat. The recipe was okay, but I feel that something else needs to be added to give this soup some oomph. Strangely enough, this soup reminded me of Campbell's tomato soup AND bean with bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson"
},
"reviewBody": "Made this soup for first time today. Found it to be excellent. I substituted the bell peppers with Cayman Seasoning peppers, turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonda58"
},
"reviewBody": "There are not enough stars to describe how delicious and wonderful this soup is...! We didn't quite have 8 cups of vegetable stock so the balance was beef stock. Our soup was certainly thicker than what is shown in the photo, closer to a stew, but that was just fine with us. A serious hit in our family and it is going on our list of favs to make again!! Thanks so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trisha Griffin"
},
"reviewBody": "I just got this recipe into the slow cooker! Cannot wait! Is there anyway of finding out the nutritional breakdown/calories per serving?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTCHYG"
},
"reviewBody": "This is fantastic. would recommend and make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wyatthawaii"
},
"reviewBody": "Really seriously good! Added some cubed butternut squash 15 minutes into the simmer along with some cinnamon and a heaping tablespoon of chili powder. I also minced a large jalepeno pepper and sauteed it with the onions and bell pepper. Sour cream and cilantro finish it off nicely. Can't wait for the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VCC592"
},
"reviewBody": "I put cilantro on top when serving and it made all the difference. Added a new layer of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Benjamin White"
},
"reviewBody": "Awesome and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Wilson"
},
"reviewBody": "Loved this recipe! I like things spicy so I added a little jalapeno to my bowl devoured it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof5"
},
"reviewBody": "simply delish.... great for the whole family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LivsMommy"
},
"reviewBody": "Amazing! I changed it based on reviews and I tripled the chili powder, added cinnamon and cumin and curry. I used diced tomatoes instead of crushed tomatoes. They were actually Kroeger garlic diced tomatoes! I loved it straight out of the pot with no sour cream. I cant't wait to try it second day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikii Niiki"
},
"reviewBody": "Fantastic, but changes made: Added corn, carrots, cinnamon, nutmeg, chili flakes, extra garlic, salt and pepper and double the rice. Let simmer for about 2 hours, added rice about 45 minutes before done. It thickened up, to more of a chili, and was sooo delicious! Added sour cream and a fresh squeeze of lemon juice at the table, really added a whole new kick to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cbella"
},
"reviewBody": "Wow was this fantastic. I downloaded this recipe a while back and finally got around to making it- not sure what to expect. This will be on my \"frequent flyer\" list. Made as written with the exception that I only had crunchy peanut butter not extra crunchy so I threw in a few crushed chopped peanuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kalex"
},
"reviewBody": "I followed this recipe exactly and it was very good. It just lacked spice, we added a little hot sauce and it was perfect. I also added the rice at the begining because my package says it takes 45 minutes to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "penca01"
},
"reviewBody": "Surprisingly delicious! The peanut butter somehow works well with the other ingredients in the soup. The only thing I really noticed is that there is no way that the brown rice will cook in 15 minutes, I had to let the soup simmer for at least 30 minutes to get the rice soft enough to enjoy. Overall, I enjoyed it and will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jonnim"
},
"reviewBody": "yum..used red pepper flakes and ginger instead of chili powder. ate with bread instead of using the brown rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coeurdelakaur"
},
"reviewBody": "A delicious soup. I used creamy peanut butter and it was delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shoebear"
},
"reviewBody": "Very satisfying soup. As another reviewer suggested, I included some salsa and less of the canned tomatoes. Good recommendation. I also used homemade chicken stock instead of veg broth. This will now be in my quick mid week meal rotation. Thanks PIETOGO!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V"
},
"reviewBody": "I added a huge bunch of fresh mustard greens from our local CSA to this recipe and it was yummy! Used 4 baby walla walla onions instead of 2 mediums. Went seriously heavy on curry powder instead of chili powder. Put in salt as well as the pepper the recipe calls for. Used vegan \"chicken\" broth. Took almost an hour for the brown rice to soften though- not 15 minutes- so allow for that :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie D"
},
"reviewBody": "This was good! Although it was not followed directly, I think it would have turned out better if I had. I put all ingredients in a slow cooker and it turned out to be a very hearty soup the family enjoyed. I used green peppers instead of red ones because of what was on hand. I it would of been a tad sweeter if I used the red ones. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HeatherLilly"
},
"reviewBody": "This was really tasty. I doubled the chili powder and added some red pepper flakes and some diced hot pepper, and then some cilantro and a squirt of lime juice in each bowl. I think next time I might add some peanuts."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/73090/african-peanut-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/73090/african-peanut-soup/",
"name": "African Peanut Soup"
}
}
]
}
}
, "about": [
]
}
]