				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Alfajores Argentinean Style"
,"datePublished": "2020-06-18T23:38:59.000-04:00"
,"dateModified": "2020-06-18T23:38:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Christina-Chrisi Marvasi"
,"url": "https://www.allrecipes.com/cook/1392080"
}
]
,"description": "Small vanilla and lemon cookie sandwiches, filled with caramel, and rolled in coconut, are a traditional sweet, much loved in most Latin cultures."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YmiBYmCUkTLSQgsQ9m0XVuDC68w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5479121-0c0803cfc6334065bc27641d1e8801b5.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Alfajores Argentinean Style"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "66"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "157 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "32 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "65 mg"
,"sugarContent": "8 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.6666666269302 cups unbleached all-purpose flour",
"2.5 cups cornstarch",
"0.5 teaspoon baking soda",
"2 teaspoons baking powder",
"1 cup unsalted butter, softened",
"0.75 cup white sugar",
"3 egg yolks",
"1 teaspoon vanilla rum",
"0.5 teaspoon vanilla extract",
"0.5 teaspoon lemon extract",
"2 teaspoons lemon zest",
"1 (11.5 ounce) jar dulce de leche",
"0.5 cup unsweetened shredded coconut" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper. Whisk together the flour, cornstarch, baking soda, and baking powder; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat the butter and sugar with an electric mixer in a large bowl until light and fluffy. Add the egg yolks one at a time, allowing each yolk to blend into the butter mixture before adding the next. Beat in the vanilla rum, vanilla extract, lemon extract, and lemon zest with the last egg. Gently fold in the flour mixture with a spoon, making a crumbly dough. When the dough becomes cohesive enough, press it together into a ball with your hands. Wrap with plastic wrap and chill for 30 minutes to 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Roll out the dough, using as little flour as possible, about 1/4 inch thick. The dough will have an unusual consistency. Cut with a small round cookie cutter. Continue pressing the dough together, rolling it out, and cutting until you have used it all. Place cookies 1/2 inch apart on the prepared cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until set but not browned, 7 to 10 minutes. Remove the cookies immediately to cool on a wire rack."
} ,{
"@type": "HowToStep"
,"text": "Spread the underside of a cooled cookie with a teaspoon of dulce de leche, then sandwich together with another cookie until the caramel oozes out the sides. Roll the sides in the shredded coconut."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Sergel"
},
"reviewBody": "I made these for a country project at school and they were gone by the end of the day! They took all morning to make but they were so delicious! I even tried a different Alfajore recipe but this one turned out so much better! Now I make these for company as my specialty and it's always a big hit! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktbakescakes"
},
"reviewBody": "This recipe is so good that I ended up making if as a friend’s wedding gift. Everyone loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Antoinette Reyes"
},
"reviewBody": "Really good. Takes a bit long to make but well worth it. I accidentally made the cookies too large so think that is why some of them cracked while applying the dulce de leche (milk based caramel sauce, bought at Walmart). I ended up carefully spreading the dulce on a cookie then adding the top cookie. I then painted the sides of the cookies with the dulce and rolled in coconut. Definitely need to make these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "French epic"
},
"reviewBody": "Love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julian Blevins"
},
"reviewBody": "This recipe is legit as—is! C\nCrumbly, delecate, delightful!\nI did divide the lemon zest and extract in half and replace the missing half with tangerine zest and extract. Next time will add 1 more egg yolk with the aim of making them stiffer. And 1 more stick of butter aiming to make the dough more workable. But excellent as called for by this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matias Toro"
},
"reviewBody": "They turned out amazing. However I did add on top of it all 2 whole eggs as it was too crumbly which may have been due to me using lard rather than butter also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Steve Cox"
},
"reviewBody": "Followed the recipe to tee. Never had these cookies before so I'm not sure what they are supposed to be like, but I find them quite dry. Also the filling, while delicious, is too fluid to hold the top cookie in place, so it slides, I don't think I'll make them again as they are rather labor intensive. Anybody want some left over dulce de leche?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsa08"
},
"reviewBody": "I tried making it exactly as written, but the dough does not hold together, I even tried chilling it overnight. I was able to salvage my dough by bringing it back to room temperature and adding a whole egg and another 1/2 stick of butter. The flavor was great, but I found the cookies to be very dry and messy to eat. I recently came back from Argentina and most of the alfajores we had down there were more of a cakey texture. I will still make again because once covered in chocolate these are quite delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phoebe lea"
},
"reviewBody": "This recipe is very good, but i would recommend using 3 whole eggs rather than just the egg yolks so that the dough is more manageable. I rolled the dough very thin so that it was only 4mm thick and this meant there were alot more cookies and they still were a little bit crumbly when you bite into them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "This recipe was pretty easy to follow. I didn't roll. it in coconut but sprinkled powdered sugar over it instead. The dough will come out pretty crumbly feeling. Don't freak out, it's just a weird consistency. If you need to, sprinkle and knead in some cool water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "I made these for my husbands job and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "This dough was much too crumbly. Only after reading other people's suggestions was I able to rescue the dough. I added one more whole egg, 1/4 cup more butter and a little water. It then held together. The flavor is good but the actual recipe was not good to use unless the measurements are corrected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melina"
},
"reviewBody": "I am having a bit of a crumble issue after the cookies come out of the oven, I really tried all the tricks the other reviewers gave and the dough is great right after is made, however after i refrigerated it it became hard. Next time I will bake right after making the dough and see if that makes a difference. They taste great but very delicate to assemble and put together. I didn't use any vanilla rum or vanilla extract, instead I used a bit of rum lemon and orange zest. Did add more more and more eggs to the recipe so it would be softer and not as crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Batia"
},
"reviewBody": "Delicious!!!!! and so easy to prepare"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Donna Hayes"
},
"reviewBody": "I found the batter extremely dry to work with. In frustration, I added some olive oil to the dry crumbs at the end that would not stick together. Because of this, I couldn't roll thin enough to my satisfaction. I was a bit disappointed. Even the cookies themselves were a bit dry. Maybe that's how they're supposed to be? Not a favourite, unfortunately"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "These cookies were amazing. I used 1 egg and 2 yolks, white rum and I needed just 1/2 can dulce de leche for my cookies. The taste was fantastic, they look festive too (I sprinkled with confectioners` sugar) and I will use this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Juliane Carvalho"
},
"reviewBody": "I wanted to give this recipe a 5 stars, but after reading a few reviews I decided to modify the recipe by adding 3 eggs (not just the yolks). The dough had a perfect texture after this modification. I added only 1/2 tsp of lemon extract and I am glad I did NOT add the 2 tsps of lemon zest which would give a strong lemon flavor. Also, I used the Nestle's La Lechera Dulce de Leche, which is more a caramel flavor than the good old doce de leite used in Latin America. Next time I will use the Williams Sonoma's dulce de leche from Argentina. I am sure it will be even more delicious. I also used finely shredded unsweetened coconut. Thank you for sharing this recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chefgurl10"
},
"reviewBody": "I would make it again, but also i had trouble with the texture. it was too crumbly. i say add more butter and a bit more flour. thanks guys!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Young"
},
"reviewBody": "These looked and tasted almost exactly the same as the ones from my family's favourite coffee shop in Honduras. Now that we have moved to Canada, they were a very special nostalgic treat for my family!\nI did add 1/4 cup melted butter to the dough when I could not roll it. Turned out fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emily Morgan"
},
"reviewBody": "I am in the process of making these and will update again once I have completed the process. However, as it stands, I am on round two of these cookies and at my wits end. \n\nI have now adjusted this recipe to include an additional half cup of butter and two more egg yolks. NOW the \"dough\" (if one could even call it that) is workable. It is in my fridge for the second time since I started this round. \n\nI'm still hopeful...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louis Blind"
},
"reviewBody": "I tried to make alfajores before but I ended up with a brown and tough cookie. Let me tell you that this recipe is awesome! It has a nice texture and flavor!! Really easy to make with kids too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dan Marino"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "congoranger"
},
"reviewBody": "Good flavor. I unfortunately made them too thick so it was a bit difficult to eat. But that was not the recipes fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marisela Bascunan"
},
"reviewBody": "I really loved the recipe, I have tried others but this comes by far the best... all my guests loved this and they are delicious! Thank you for sharing this recipe! I have made this a couple of times now and will keep making these.. thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milenka Stocking"
},
"reviewBody": "This alfajores taste great. The only problem that I had is that it was to much of the dry ingredients so my dough was like sand so I add some milk to be able to roll and cut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "claudia"
},
"reviewBody": "These taste just like my great-(Argentinian) aunt's! I omitted the rum, only had I Can't Believe It's Not Butter (no judging please), used the juice from a small lemon &amp; not much zest and let a little of the egg whites sneak through (worried about the dough being too dry). The dough was perfection, so easy to work with! I didn't quite get 3 dozen but my cutter is slightly larger than I like (2\"or smaller should work great). These went fast. Didn't have coconut so can't wait to make them again with the coconut. A definite keeper! Thank you, thank you, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deisy L Rodriguez"
},
"reviewBody": "Fallowed the recipe, just a few adjustments to make recipe more personal. I added rum instead of vanilla rum, and lemon juice instead of lemon extract. Perfect texture, delicate, and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Scrappymom"
},
"reviewBody": "Tthe dough was too dry to roll out, and had very little flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Slala2112"
},
"reviewBody": "I agree with other reviews it is a very crumbly dough so I added some extra butter to it I took my extra dough and smashed it into another ball and put it back in the fridge to re chill before working that into cookies the colder the dough the easier to work with and roll out all and all these were yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FuzzyKoala"
},
"reviewBody": "Thank you for posting this recipe. I'm from Uruguay and mom used to make these all the time. I had lost the recipe and mom has dementia so I never thought I'd find it. I love the memories of making these with my mom and sharing those memories with my girls. Thank you so much!!!!!\nWhen boiling the sweetened milk in the can. Do you have to keep the can covered with water at all times? Can't tbe. An explode? Very nervous!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sexybaker"
},
"reviewBody": "Great recipe. Followed advice of adding additional 1/4 cup butter and extra egg yolk--dough was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinforlife"
},
"reviewBody": "I made these for my sons birthday party and they were a hit! The dough is tough to work with but you just need to press it down as you roll it out. The cookie would split very easy when I went to fill it, so I just started using a butter knife to spread it gently onto the cookie, out to the very edges, than put the other cookie on top. Than I would push gently to get the dulce de leche to come out of the sides. I found I needed about a tablespoon for each cookie. Than rolled them in the coconut. I used sweetened and it was great. I stored them in an airtight container and the next day the were delicious! This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stef4734"
},
"reviewBody": "I really like the flavour and the texture of these. From \"Gumby's\" review I used the suggested extra yolk and 1/4 cup butter. But the most helpful review was from \"Myrhagonzalez\" . She said to be gentle with the dough and I kept reminding myself of that as I rolled out the dough and it really did help. My only complaint it that I REALLY want them to look like the first picture. I do a lot of \"fussy\" work on cookies and I am willing to put in the extra time, but the dulce de Leche was just too runny. Any suggestions anyone?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "With a few modifications, this is really a great recipe. My Argentine husband loves them and I've made them 4 times now, adjusting to my perfection.\nI use 2 1/2 c. Flour and 1 2/3 c. Corn starch (just switched the amount from the original recipe). And yes, that is CUPS of corn starch. Alfajores are not meant to be too cakey and should be kind of dense.\nI also used 4 whole eggs instead of 3 egg yolks, this may change depending on the egg size you use. If the dough isn't holding together when pressed, add egg or your cookies will be a crumbly mess coming out of the oven.\nFor the dulce de leche, which I can't find near me, I buy sweetened condensed milk 14 oz and make it in the microwave. Just repeat 30second heating and stirring, the milk will brown and stiffen up, go by texture for when to stop, it should be workable not runny, and you'll want to make the dulce de leche just before spreading it, because it will continue to stiffen a little. Be sure to buy two cans of milk if it's your first time, I went by color on my first batch , overcooked it and ended up with a bowl of hard caramel that took two days to soak out! \nHow you do the vanilla/vanilla rum is not too important, I use amaretto in place of vanilla rum and like the flavor. \nSame for the lemon, I don't like the strong flavor of lemon extract but they should taste a little lemony, I use lemon juice instead.\nAfter sandwiching them, I cover them in chocolate or powdered sugar like Havanas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren Adams"
},
"reviewBody": "I had to add and extra 1/4 cup butter and an additional egg yolk to make the dough workable. The cookie part is ok but next time I think I will replace it with shortbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALEJANDRA CASTILLO"
},
"reviewBody": "I loved it the only thing is that I added 1/2cup more of butter and 1 more egg but they are really grate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gwen Rohan"
},
"reviewBody": "The dough is very crumbly as others noted. I managed to make cookies out of half of the dough but it was very slow so I decided to add the egg whites to the rest of the dough but after baking these did not taste as good as the ones without the egg whites. I used the tip about boiling a can of evaporated milk for 2 hours for the dulce de leche since I couldn't find it. It worked pretty well but I would probably boil it for 3 hours so it would be thicker. Also, I made the cookie sandwiches as suggested but then started using 1 cookie topped with the dulce de leche and coconut, which tasted alot better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "myrnagonzalez"
},
"reviewBody": "this recipe is good the only thing is to make it easier ,my recipe is almost the same just the vanilla rum is not need instead 1/2 teaspoon vanilla rum and 1/2 teaspoon vanilla ,just 1 teaspoon of vanilla extract, and the lemon extract and zest no , just 1 lemon medium size only the skin grated is perfect for the amount in this recipe .\nNow for those people that are saying that is to crumbly it suppose to be like that just treat the dough gently and the dulce the leche is suppose to be at room temperature and again use soft touch not rough to put the dulce the leche on the cookies I know when my husband makes they break but he says ,when you do it they don't break ,then I say is because I do it with care softly that's all , by the way the 3 yolks eggs is perfect I always make them like that I am Argentinian and everybody love my alfajores they say they are the best ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "andrea92fl"
},
"reviewBody": "Did not like these at all. Something about the texture.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Yeager"
},
"reviewBody": "My daughter and I made these for a Spanish project she had to do for Argentina. They turned out great and melted in your mouth! We used 3 whole eggs, instead of just the yolks, and the dough was easy to work with and we had no problems with it being crumbly or sandy. Instead of rolling them in coconut, we covered with powdered sugar. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This was very tasty, but I dont know if its worth the effort. I added an extra egg yolk as suggested by other reviewers and it was still quite crumbly. Because it was so crumbly, and because the Dulce de leche was so sticky, it was a bit difficult to put together. It was also difficult to roll because of the crumblyness. In all, 5 stars for taste, but I probably wont make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulab"
},
"reviewBody": "I made this with a friend for a Spanish class project. They were really yummy! We added a fourth egg and the dough was fairly easy to roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grubber"
},
"reviewBody": "Hi Chris, I actually had a question about this recipe - is it really 2 1/2 CUPS of cornstarch? Or is that supposed to be teaspoons? Just checking as I really want to make these cookies! Thanks. Val"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "iceemama"
},
"reviewBody": "I too had trouble with the dough being sandy. I managed to get them pressed together with much difficulty. I decided to just bake 6 and see how it went. When I baked, cooled and tried to ice those 6 with the dulce de leche, they crumbled. I added one extra egg yolk and a litte water to the remaining dough. With those additions, the dough worked fine. They tasted delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gumby"
},
"reviewBody": "Really good recipe, loved them, just like I used to get in Argentinean bakery. I had the same problem as a previous reviewer that they would crumble like sand when I would try to get them on the cookie sheet to bake. I added 1/4 cup butter and 2 more egg yokes and it was perfect (I used Large eggs, maybe with Jumbo, the 3 the recipe would have called for would be fine). I also followed other reviewers suggestions instead of using all lemon I did 1/2 of the lemon extract and zest and then the other 1/2 orange extract and zest. I had no vanilla rum, so I just mixed 1/2 rum and 1/2 vanilla. I used sweetened coconut, I think it tastes better. When I take something to parties, I like taking something different, usually something that I grew up eating, this time it was the alfajores and they were a hit! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex"
},
"reviewBody": "I am Bolivian so we make our own version of alfafores. I followed this recipe exactly except for the rum. Made it for a preschool/culture day. The kids gobbled it. My family loved it. Doubled the recipe. Only lasted a day. Only downside is that they took forever (a couple hours)! Will try rolling/cutting on parchment paper next time and cooking it right on there so I don't have to transfer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb A"
},
"reviewBody": "these are so good! I found them very easy to make and yummy to eat. A new favorite at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "The flavor of these alfajores is really good - I used orange extract and zest, and they are really amazing. I had some trouble getting the dough to come together - it was basically the texture of sand and would only get cohesive if I pressed it really really hard (but would fall apart if I touched it). I had to add some milk to make it workable, and I think it affected the final texture. Next time I will add one more egg and increase the butter a little bit. They also came out very puffy - which they are not supposed to - but I think I can blame high altitude for that. Here, cookies tend to puff up and then collapse, and I must have taken these out before they collapsed. Overall, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paula"
},
"reviewBody": "I lost the recipe I had for alfajores and these are exaclty the same alfajores I used to eat in Argentina. Thank you for the recipe! I omitted the coconut because I didn't have any in the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "guatmom"
},
"reviewBody": "Just made these for our friends who are from Argentina...they said they taste just like home! Excellent recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ann"
},
"reviewBody": "It is nice to see more latinamerican recipes on this site. My father is Argentinian, and of course we are big fans of alfajores (specially the Havanna brand). I would only suggest adding tangerine zest to the cookie dough, as in some traditional argentinian recipes. Other recipes call for using cooked egg yolks in the dough. Also if you don't have original dulce de leche, you can make a very similar one by boiling a can of condensed sugared milk during at least 2 hours, but BEWARE: cool off completely before opening!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sillycooks"
},
"reviewBody": "Very good! The best dulce de leche is \"Conaprole\" brand. You can find this in a argentinean bakery or uruguayan bakery. This tastes just like my mother's alfajores....She's, of course, from Argentina."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/187786/alfajores-argentinean-style/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
"name": "South American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2432/world-cuisine/latin-american/south-american/argentinian/",
"name": "Argentinian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/187786/alfajores-argentinean-style/",
"name": "Alfajores Argentinean Style"
}
}
]
}
}
, "about": [
]
}
]