				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Al Kabsa (Traditional Saudi Rice and Chicken)"
,"datePublished": "2019-04-03T23:50:18.000-04:00"
,"dateModified": "2022-10-04T14:13:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "EmiratiWife2010"
,"url": "https://www.allrecipes.com/cook/5923603"
}
]
,"description": "Al kabsa is a traditional Arab recipe for fragrant basmati rice topped with chicken pieces cooked until tender in tomato sauce with aromatic spices."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/nKTQEbOQe-zx-KTS-khPYrh_HLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2032831-al-kabsa-traditional-saudi-rice-and-chicken-nbarazi-4x3-1-361ddf6cc40244238f7f8d1fe4a4a932.jpg",
"height": 675,
"width": 900
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Al Kabsa (Traditional Saudi Rice and Chicken)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "52"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "528 kcal"
,"carbohydrateContent": "55 g"
,"cholesterolContent": "88 mg"
,"fiberContent": "3 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "423 mg"
,"sugarContent": "7 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"0.5 teaspoon saffron",
"0.5 teaspoon ground cinnamon",
"0.5 teaspoon ground allspice",
"0.5 teaspoon dried whole lime powder",
"0.25 teaspoon ground cardamom",
"0.25 teaspoon ground white pepper",
"0.25 cup butter",
"1 onion, finely chopped",
"6 cloves garlic, minced",
"1 (3 pound) whole chicken, cut into 8 pieces",
"0.25 cup tomato puree",
"1 (14.5 ounce) can diced tomatoes, undrained",
"3 carrots, peeled and grated",
"2 whole cloves",
"1 pinch ground nutmeg",
"1 pinch ground cumin",
"1 pinch ground coriander",
"salt and freshly ground black pepper to taste",
"3.25 cups hot water, plus more if needed",
"1 cube chicken bouillon",
"2.25 cups unrinsed basmati rice",
"0.25 cup raisins",
"0.25 cup toasted slivered almonds" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make spice mix: Stir together saffron, cinnamon, allspice, lime powder, cardamom, and white pepper in a small bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Make dish: Melt butter in a large stockpot or Dutch oven over medium heat. Cook and stir onion and garlic in butter until onion has softened and turned translucent, about 5 minutes. Add chicken and cook over medium-high heat, stirring occasionally, until lightly browned, about 10 minutes. Mix in tomato purée."
} ,{
"@type": "HowToStep"
,"text": "Stir in canned tomatoes with juice, carrots, cloves, nutmeg, cumin, coriander, salt, black pepper, and reserved spice mix. Cook for about 3 minutes; pour in water and add chicken bouillon cube."
} ,{
"@type": "HowToStep"
,"text": "Bring sauce to a boil, then reduce heat, and cover the pot. Simmer until chicken is no longer pink and the juices run clear, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Gently stir in rice. Cover the pot and simmer until rice is tender and almost dry, about 25 minutes; add raisins and a little more hot water, if necessary. Cover and cook until rice grains separate, 5 to 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Transfer rice to a large serving platter and arrange chicken on top. Sprinkle with toasted slivered almonds."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dmitry Smalyuk"
},
"reviewBody": "Fantastic dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aadil Hamid"
},
"reviewBody": "made it, and it is so perfect! I love the taste. amazing stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyela(Maryam)"
},
"reviewBody": "first time making this, I used tumeric instead of saffron, no bullion cube and I used fresh tomatoes instead of canned. it tastes fantastic, very light on the palette. will definitely make again, a wonderful one pot meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Merchant"
},
"reviewBody": "I followed the recipe almost exactly. Only changes were using dates instead of raisins and I didn't have any lime powder. We really liked it, but next time will double the spices. Do not leave out the dates/raisins. Those sweet little nuggets complete the dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gourmette"
},
"reviewBody": "delish, easy to make not too spicy perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sana Othman"
},
"reviewBody": "Amazing! I didn’t have basmati rice so I used long grain rice; I also used chicken breast instead of whole chicken. I did two cups of long grain to three cups of water and it came out so good! Thank you for the outline as this was so easy to accommodate per your personal taste and what you have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebec"
},
"reviewBody": "Rave reviews from the family. Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Brooke"
},
"reviewBody": "I made the Kabsa spice from scratch with 1 teaspoon of the following: fennel, coriander, ginger, cumin, cardamom, saffron, all meat spice, nutmeg, salt, and black pepper or white. I also cooked the chicken until it had a slight dark burn because I used dark meat thighs. I would do the same if you were cooking the chicken with bones in it. I also only cooked the chicken for 20 before adding the rice. I also added lemon zest to substitute the lime. I added yellow, red, and orange peppers after cooking the chicken with the onion and garlic for a bit. Added 2 fresh Roma tomatoes instead of canned. I would usually add turmeric, but I didn’t have any at the time. The salad to add to the rice: cucumber, tomato, and red onion with salt and pepper to taste and a splash of white vinegar. Some use basalmic vinegar and olive oil in the salad also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanda"
},
"reviewBody": "No changes, and it was Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aamer Zarzar"
},
"reviewBody": "My own Kabsah tricks: \n\n1- Put fresh peeled and cut tomatoes, carrots, green bell peppers and onions into a blender, to make vegetable juice, and add this on top of the boiled chicken and let them boil till chicken is well cooked, this will enforce the vegetable flavor (use a fine screen to separate chicken and other spices from sauce, so you will end up with clear sauce to cook the rice).\n2- Add cut peeled and cooked chestnuts while cooking rice, this will be your mysterious ingredient.\n3- After the rise is cooked, light up three or more natural charcoal till they are fully red. fill a bowl with extra virgin olive oil and place it fixed in the middle of the cooked rice (while still in the cooking bowl) after your turn off the heat, open the cook pan lid and place those red charcoals one by one, and after each time, cover the lid to capture the smoke. this will be your second mysterious (NOT HEALTHY) flavor.\n4- keep some of the cooking sauce aside to grill the chicken after it is boiled.\npre-heat the oven, put chicken in a try, pore some of the sauce on each piece and put the tray in the oven till the sauce dries out, take the tray out, add more sauce and put it back in for couple more times, i do this for around 4 rounds, this will make chicken flavored and juicy. \n5- Use whole dried limes, punch each with a knife to allow the sauce in, you can add it again to the clear sauce, and later on top of the serving dish, it tastes awesome when squeezed on rice.\n6- garnish with roas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MPblog"
},
"reviewBody": "Delicious, although I'll add more spices and will cook the chicken separately next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jami Bonifas"
},
"reviewBody": "I live in the Middle East. It didn't taste that authentic to me. It was just okay. Too much tomato taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "powermd"
},
"reviewBody": "Solid recipe, but it didn't really pop for me. \n\nSensing that this was going to be on the bland side anyway, I made a few changes to amp up the flavor. \n\nFirst, I decided to use 3 lb of grilled chicken thighs instead of cooking the chicken in the pot. I made a rub with 1 T kosher salt, 1 T brown sugar, 2 cloves garlic, 1 t black pepper, 1/2 t dried lime powder, and 1/2 t cardamom powder. I grilled the thighs using cherry wood chips for smoke. The grilled chicken came out AMAZING. \n\nThis meant I could skip the step where the chicken cooks, and go straight to simmering a bit with the spices, and then cooking the rice. \n\nThe final dish was fairly bland, so I would recommend adding 1/2 t - 3/4 t kosher salt to the hot water before the rice cooks. Depends on how bland or salty you like food. I liked the raisins, but 1/4 C is not nearly enough. I doubled it and that was an improvement. The spice mixture could probably be increased a bit, maybe 25-50%. \n\nOne final change I'd recommend is if you grill the chicken separately as I did, go ahead and wait until the rice is nearly cooked before adding it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Kay"
},
"reviewBody": "I made this for my book club when we were discussing The Princess by Jean Sasson. Everyone loved it and it was easy for this non cook. It didn't get a five because I got confused and added the rice to the chicken and sauce mixture. The rice cooked in the sauce, so it was not ruined, but I was told that the sauce was poured over the rice. When I returned to the site I realized that I misread the recipie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUNISIANSWIFE"
},
"reviewBody": "this was very very good and very easy. I used boneless/skinless chicken thighs. I have Khabsa spice(which is a blend of all the above except for the lime leaf) so I used 3 tsp of it, and a bit extra allspice simply because we love the flavor. added some chick peas. this makes a lot which is great for feeding a group or for leftovers; however i knew this going in based on the amt. of rice. the ratio of liquid to rice was just perfect. The addition of raisins was really nice to get that occasional bite of sweet/savory. thanks for this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gail giddings"
},
"reviewBody": "This recipe is really tasty, and I enjoyed it. I had some friends from Saudi Arabia in college, and when they made it, it was quite different. Same instructions, but they used cumin, maybe one other spice, unlike this one, and there was no carrot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "psychgirl"
},
"reviewBody": "This was very disappointing dish. It is very bland..blah. No real flavor to the dish Our Saudi exchange students were very disappointed in the lack of flavor as were we since we love middle eastern dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nbarazi"
},
"reviewBody": "This recipe was excellent and so easy to follow! My husband loves this dish and I have never made it so I chose this recipe and he loved it! Thank you!! Even though I changed some things I still give it 5 stars bc the base recipe is perfect. I made some minor changes based on how my husband likes it. Here's how I tweaked it: 1) I didn't use carrots 2) I used dried limes (black limes) instead of lime powder. I used about 10, rinsed with a fork poked in each one - delicious flavor! Found in middle eastern stores 3) I used white raisins not black 4) I used the tiniest bit of ginger and have no idea if it made a difference 5) for all the spices I went off the recipe but my mother in law uses heavy spices so instead of putting a \"pinch\" of the ones that called for it I put about 1/4 tspn, and for the rest I used the same amt but a heaping amt instead of a flat tspn amt.6) For garnish, I added toasted pinenuts and parsley (I added a picture). Overall everyone that ate it loved it!! I will definitely make this dish again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leggett"
},
"reviewBody": "This is the easiest to follow recipe I have found for authentic Kabsa. I used pre-made Kabsa spice mix. I also added a handful of frozen peas and substituted pine nuts for the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rayyan"
},
"reviewBody": "Very delicious! I made it for the first time in my life and my wife went crazy over it and wouldn't stop eating! Thanks a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Larby"
},
"reviewBody": "I am the chef at an international school in Bournemouth (UK) and I tried this recipe for my Arab students and they absolutely loved it, and so did all the others. It is now a favourite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oranaise"
},
"reviewBody": "This recipe was AMAZING! AND it's authentic! I normally try a recipe exactly as written first time then go about adjusting it to to fit my taste. But I broke protocol this time. I grew up in Saudi but I've never made it on my own until now. In college here in the US I had a few Saudi and Emariti (UAE) friends who would whip this up late at night. And I would help prepare it. \n\nHere are my changes: \n\n1] I sprinkled raw chicken drumsticks with turmeric which contains curcumin, a powerful anti-inflammatory and strong antioxidant. If you don't want to use saffron; turmeric, aka the \"poor man's saffron\" gives the chicken a nice yellow hue plus health benefits. \n\n2] I added freshly grated ginger with the garlic. But this is a personal and regional preference (East Coast: Dhahran, KSA). \n\n3] I used almost twice the amount of spices (except for the cinnamon) and whole dried lemon (loumi) instead of ground. \n\n4] My mom's Saudi friend recommended removing the chicken once cooked in broth. I placed chicken in a pan in oven to brown while rice was cooking.\n\n5] To make sure your rice doesn't get mushy, put a kitchen towel under the lid. This keeps the rice firm. I used Zebra brand Basmati (Pakistan). \n\nNext time, I'll also make shattah (hot sauce). THANK YOU very much, EmiratiWife2010 for an excellent dish! My family came to visit and they said it's the REAL DEAL.\n\n*EDIT: Please see photo of one serving. I garnished bowl with hot sauce, cilantro, yogurt (Byblos) and toasted almonds.*"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Werner"
},
"reviewBody": "My Arab hubby lived this dish, and I had never even tried it, let alone cooked it! I did add fried potato rounds to the recipe, as well as Goya sazon packets mixed with the arabic spice blend hubby brought from back home. When it was time for the rice, I layered the pan like a maqluba, with potatoes and chicken, then the rice and liquid....was very very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoCortinacooks"
},
"reviewBody": "after making my spanish chicken and rice recipe, I was very happy to make this this with the different seasoning. I've really enjoyed all the spices. And found it delightful 2 put this meal together. I even added a picture to show. The spice profile was different from my background, but I found it to be something to be treasures."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Thompson"
},
"reviewBody": "I have made this recipe twice now and while I enjoyed the first time I made it I made adjustments for the second time around. First of all. I increased all the ingredients for the kabsa mix by half and then the other spices that called for \"a pinch\" I just made an even 1/4 teaspoon. As for the rest, I increased the diced tomatoes to 16 ounces, I doubled the raisins to 1/2 cup, and when it suggests adding more water at the end I added another 1/4 cup of tomato sauce. Oh,and I didn't mention that I use chicken breast instead of other pieces. This second time around it came out magnificent (In my opinion). I almost couldn't stop eating it. My wife and I both agree though that it could probably use even more raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XxlilaxX"
},
"reviewBody": "Loved it!! It is not a spicy dish. Taste kind of sweet a little bit. I think Saffron gives an amazing taste, I would not skip on that ingredient and a little goes a long way with Saffron; don't need much of it to taste it. I cut my chicken breast in cubes and it was very good. Wonderful Kabsa recipe and easy to make ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KateinNH"
},
"reviewBody": "Excellent! I would add a little more spice to give it some more kick, but all the same it was very good as it was and will be on the family recipe list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ILovePotatoes"
},
"reviewBody": "Just so-so. Really was hoping for a much better flavor overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hillorie"
},
"reviewBody": "After falling in love with Kabsa at a Yemeni restaurant in San Francisco, I had to learn how to make this dish. This is a great recipe and the spicing was utterly perfect. I marinated the chicken overnight in some lime/garlic/kabsa spice, and then threw it on the grill to pick up some additional flavor before doing the steps in the recipe. It is hard to stop eating it!! The only issue was my rice came out a bit mushy, so I have to focus on water levels and not stirring/peeking to reach perfection, but that's my fault, not the recipe. Love this dish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzannefb"
},
"reviewBody": "This was sooo flavorful. It is not spicy. I substituted a diced chicken breast which enabled me to half the cook time. I also ommited cardamom and saffron since I didn't have on hand. I am sure they would make it even more awesome. I also used lime zest of one lime in place of lime powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Khandri"
},
"reviewBody": "I'm from Saudi Arabia, and I've eaten and prepared this dish all my life, and I must say that the steps in this recipe are very accurate. This dish is very diverse and is well-known in all gulf countries. So it's prepared in different ways with different ingredients, and this is just one way. Another delicious way of preparing it (my favorite) is by replacing chicken with small pieces (about 2-3 inch) of lamb or goat and adding about 15 to 30 minutes to the cooking time depending on the meat. These small cuts are not what you would normally find in a butcher shop, and they're typically found in Halal meat stores and Afghani or Persian stores. I personally don't use carrots, and sometimes even make it without tomato puree or tomato paste (it's actually called red Kabsa when tomatoes are used and white Kabsa when they aren't). What I'm trying to say here is, this recipe is very flexible and you can adjust it to whatever ingredients you have/like. As long as sauteed onions, a type of meat and the allspice parts are there, you can't go wrong with it. \r\n\r\nAll the spices in this recipe are sold in Middle Eastern grocery stores in North America as one blend, and even better, many online spice stores sell them. The spice blend is called Baharat, which literally translates to \"spices\" in Arabic.\r\n\r\nNot every one uses saffron and often it's added to make it fancier in special occasions. To get the yellow color of saffron for a MUCH lower price, we usually use ground turmeric instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EDUNCAN02"
},
"reviewBody": "Pretty good! I was missing a couple items (tomato paste and allspice), but forged ahead. Delicious with good flavor - I did add a spoonful of greek yogurt in the end to add a bit of creaminess to it, but I don't think it really needed it. I did sub beef broth instead of the water and chicken bouillon. Got impatient and didn't fully go with the simmer times, but still great. Served with asparagus. Will definitely make a version of this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "corie"
},
"reviewBody": "Something was definetly missing from this dish. Too much spice without a warm undertone. I found myself adding chicken bullion and then trying to compensate by squeezing lime over it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystalgem"
},
"reviewBody": "I cooked this dish but did few changes because husband doesnt like chicken so i replaced it with minced meat :)) i crystalized the onions and garlic in buter and added the meat to fry; it became nice and saucy. After i followed the given steps in the recipes and instead the lime powder i added shredded lime skin the taste was soooo good. I also ommited saffron i dont use it in my cooking because it is an expensive ingredient and i don't know to use it properly. I also preboiled the rice a bit in a separate pot and instead of adding it to the meat i added the meat to the rice pot and from time to time added more legume brot to make it saucy and light to chew and swallow. Try it would come out niiiice my tab doesnt let me rate properly but its a 5* f rom me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keptwoman"
},
"reviewBody": "First time I ever made an Arabic dish. Loved it. Smelled great and was delicious. I read the reviews, and I also did not use the Saffron, didn't even miss it. This dish is very flavorful with all the other spices in it. I also used boneless chicken breasts cut into pieces, vs the whole chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommymeggy"
},
"reviewBody": "I was happy to find a new Eastern recipe without curry! This dish has amazing flavor, and smells delicious while simmering. To avoid msg, I cooked the rice in chicken broth rather than using a bouillon cube/water. I ended up adding additional broth to the pot of chicken, so the mixture would end up saucier. (I enjoy the succulence that adds served over rice!) I will definitely make this again, but next time won't waste my pricey saffron in it - there are so many other spices going on, it's just not necessary, and is completely overpowered. Another thing that didn't make a lot of sense was making &amp; adding the Kabsa spice mix separately; pouring each spice directly into the chicken pot individually, as with the nutmeg, etc. would work just as well."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216889/al-kabsa-traditional-saudi-rice-and-chicken/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216889/al-kabsa-traditional-saudi-rice-and-chicken/",
"name": "Al Kabsa (Traditional Saudi Rice and Chicken)"
}
}
]
}
}
, "about": [
]
}
]