				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "All-Day Apple Butter"
,"datePublished": "1999-09-25T23:26:56.000-04:00"
,"dateModified": "2023-02-20T09:53:56.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Terri"
,"url": "https://www.allrecipes.com/cook/24328815"
}
]
,"description": "This apple butter is full of rich, sweet flavor from fresh apples cooked in the slow cooker for hours until smooth and buttery for a taste of fall."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6btoGpNjXOgNxp_nNc4GYtT93Is=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21205_All-Day-Apple-Butter_ddmfs_4x3_1356-8891575d93c741cd8a29d1fdced06115.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2421701219001",
"description": "Let your slow cooker make this irresistible apple butter for you.",
"duration": "PT1M14S",
"name": "How to Make All-Day Apple Butter",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2015/09/727600-All-Day-Apple-Butter-Photo-by-CCloves2bake-2000.jpg",
"uploadDate": "2021-07-13T04:26:55.775-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "All-Day Apple Butter"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1250"
}
,"cookTime": "PT660M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "34 kcal"
,"carbohydrateContent": "9 g"
,"fiberContent": "1 g"
,"proteinContent": "0 g"
,"sodiumContent": "5 mg"
,"sugarContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"5.5 pounds apples - peeled, cored and finely chopped",
"4 cups white sugar",
"2 teaspoons ground cinnamon",
"0.25 teaspoon ground cloves",
"0.25 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place apples in a slow cooker. Mix sugar, cinnamon, cloves, and salt in a medium bowl; pour over apples and mix well."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on High for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Reduce heat to Low and cook, stirring occasionally, until mixture is thickened and dark brown, 9 to 11 hours."
} ,{
"@type": "HowToStep"
,"text": "Uncover and continue cooking on Low for 1 hour. Stir with a whisk to increase smoothness if desired."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6btoGpNjXOgNxp_nNc4GYtT93Is=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21205_All-Day-Apple-Butter_ddmfs_4x3_1356-8891575d93c741cd8a29d1fdced06115.jpg"
}
]
,"text": "Spoon mixture into sterile containers, cover, and refrigerate or freeze."
} ]
,"recipeYield": ["128"]
,"totalTime": "PT690M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mcarni"
},
"reviewBody": "Made this last year and my MIL said it was exactly like her mommy used to make when she was a little girl. Thank you for sharing this recipe. It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherrie Gannon"
},
"reviewBody": "This is the best Apple butter I've ever tasted but I tweeked the recipe a bit. Instead of cloves, I used nutmeg. It's so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lilly"
},
"reviewBody": "I loved it. I added 3 cups of sugar in layers to each crockpot and a few of those red hot cinnamon candies. Also, since I wasn't sure what kind of apples I was using (we have several different trees), it was a little chunky this morning so I was lucky enough to have one of those hand mixers that has a whisk attachment. A quick minute of whisking each pot and the jars were ready to fill. So smooth. Easy and tastes delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Used gala apples I peeled, cored and pulsed in my food processor a few times. Cooked them per the recipe except I forgot to turn the temp down all night. Wound up being just fine. After a few hours uncovered, I used my burr mixer to smooth it out. Canned it in my canner and was able to make 7 beautiful jars. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CanarySong"
},
"reviewBody": "This turned out great! I was even able to speed up the process by cooking it on high for 5 hours instead of all day. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiff H"
},
"reviewBody": "Loved this recipe! Except I made some modifications, instead of cloves I used apple pie spice. Also did not add any salt to my batch. Turned out great both times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debbie"
},
"reviewBody": "Made it as is just cut in 1/2. Husband loves it too on English muffins with his morning coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VHK"
},
"reviewBody": "Excellent base recipe! Definitely a keeper! Used Gala and Pink Lady apples- 3lbs each. Chopped up apples into bite size pieces- added 1 3/4 cups light brown sugar, 2 Tsp ground cloves, 1TBSP cinnamon, 2 tsp apple pie spice. Mixed and using a food processor chopped into smaller bits- this had to be done in small batches. Placed back in crock pot, covered and cooked on low for 10 hrs- checking to mash down larger bits. Removed and put in processor again and processed til a smooth consistency. Returned to the crock pot and cooked on high for 1hr mixing occasionally. Consistency thickens as it cools. Canned in 1/2 pint jars- yield 4-6 jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "connie"
},
"reviewBody": "It turned out great , I put them in sterilized jars and put them in a hot bath to seal, will make again , so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rebbecca"
},
"reviewBody": "MAKES APPLE PIE FILLING....WORST APPLEBUTTER EVER!! It does not make applebutter!!! It makes PIE FILLING!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MrsAnderson"
},
"reviewBody": "I have not yet made this recipe but came here to say DO NOT PEEL the apples. The peels lend that lovely rosy colour of apple butter and have masses of natural pectin that lets apple butter set nicely. The recipe was obviously written by someone with no knowledge of food history or food preservation. I'll use it as a base, but with peels on, then strain it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Roberts"
},
"reviewBody": "Excellent and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GAHAGAN"
},
"reviewBody": "First time I've ever tried making apple butter and I don't need to look any further because this was absolutely PERFECT! My husband raved about it and was making happy yum noises while he ate it on homemade bread. It's just the two of us, so I froze most of the batch in \"jello shooter\" cups with lids. This is the perfect amount to for us each to \"butter\" two slices of toast. It freezes well. A real treat. Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brad"
},
"reviewBody": "I loved the consistency and ease of making it. I used fresh apples but it was way to much cinnamon for me. I added 3 cans (15oz each) of unsweetened apple sauce to mellow it out. Much better now in my opinion!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSCHRIS1221"
},
"reviewBody": "My favorite apple butter recipe! I have found this fills around 9 to 11 half pint jars. Kind of depends on how juicy your apples are or how much moisture cooks out. Or maybe its because I weigh my apples after I have peeled and cored them.\n\nMy favorite variation: Substitute half of the weight of the apples with fresh cranberries! Run the cranberries through your food processor using the shredding blade first. This will make an amazing cranberry apple butter!\n\nTip: prepare and get it started in the slow cooker in the evening, or about 12 hours before you will be awake the next morning. Then it can cook all night unattended and its ready in the morning to put in jars and process/can. \n\nI have also used only 3- 3.5 cups of the sugar and it still tastes great. I much prefer to taste the apples and spices rather than a bunch of sugary sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corrine"
},
"reviewBody": "Cooked about 4 goes on high and an hour low without the lid. Large full crock of apples reduced to 1/3. I would not have thought to use my crockpot, thanks for the tip! I think the immersion blender is the key to a silky smooth butter. Mine has no water but does glisten nicely. It may have gotten darker with a longer cooking time but I think I'd lose more volume. I used mostly Wolf River apples. Absolutely delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lunaeria"
},
"reviewBody": "This was my first time making apple butter! I used a mix of apples we got while apple picking, so this was a great way to use up the apples. I only used one cup of regular sugar and one cup of brown sugar and it was plenty sweet. Didn’t have cloves so I used allspice and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My 3 boys"
},
"reviewBody": "Used galla apples I peeled, cored and pusled in my food processor a few times. Cooked them per the recipe except I forgot to turn the temp down all night. Wound up being just fine. \nAfter a few hours uncovered, I used my burr mixer to smooth it out. Canned it in my canner and was able to make 7 beautiful jars. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seb827"
},
"reviewBody": "This turned out really well! It took a lot of time peeling and dicing the apples, but it was well worth it. I had a ton of Early Mac apples leftover from an early orchard trip, so this was a great way to use them up. When I make it next time, I may cut down on the sugar a bit as I found it quite sweet. But the flavor is delicious and I’m looking forward to having it for breakfast throughout the fall and winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "I doubled this recipe but kept the sugar right at 3 cups since I used 5 pounds of gala apples and 5 pounds of red delicious. The apples are already sweet. Cooked it in my slow cooker for 22 hours making just over 6 pints and processed in the canner for 10 minutes. Absolutely delicious and unbelievably easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oops! I forgot to say that I also reduced the amount of sugar. The first time I made this recipe I used 1/2 cup Stevia and 1 cup brown sugar. and it was plenty sweet. The second time I just used 1 cup brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monkeybusiness"
},
"reviewBody": "Absolutely awesome!!! A little bit of heaven on a biscuit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Violet"
},
"reviewBody": "Make a nice Christmas gift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VHanko"
},
"reviewBody": "Absolutely incredible. \nI followed some of the suggestions of other reviewers and did one batch with 1.5 cups white sugar + .5 cup brown sugar (i.e. the sugar amount gets halved). Ended up throwing it all, a few cups at a time, into my blender after 9 hours, then uncovered as is in the recipe for 1-2hrs. Came out stellar!\nNext batch I did 2 cups white sugar, 1 cup blown sugar (i.e. 3/4 sugar amount). Left overnight untouched 10 hrs, then in the morning I blended it all a few cups at a time, let it sit heating uncovered for a few hrs and voilà! Perfection. This batch came out more caramelized, and personally I feel is more fit for pancakes and waffles due to sweetness.\n\nIf I'd known making apple butter was THIS EASY with a slow cooker, I'd have been making it years ago. Fresh apples are so plentiful here in northern CA. It's such a great way to use apples that aren't ideal for eating raw due to texture, size or high tartness.\n\nWill make again and again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsBootheel"
},
"reviewBody": "Only thing I did different was I added fresh chopped rosemary. Delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Karrie Clugstone"
},
"reviewBody": "WHEN CANNING PUT HOT APPLE BUTTER IN PINT CANNING JARS WITH LIDS LEAVE 1/2 - 1 INCH SPACE FROM TOP OF JAR. PLACE IN BOILING HOT WATER BATH FOR 20 MINUTES TAKE OUT AND LET COOL MAKE SURE YOUR LIDS SEAL. I HAVEN'T MADE THIS RECIPE YET BUT IT SOUNDS YUMMY AND I WILL BE MAKING IT IN A COUPLE OF DAYS... THANKS FOR THE RECIPE..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kori"
},
"reviewBody": "I love it. takes some patience but so worth it, plus the house smells delicious while it simmers all day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazmyn51698"
},
"reviewBody": "I read the reviews and added 1/4tsp allspice. I also started it at around 12pm left it on high for an hour then turned it down to low, that night at around 10pm I set it to warm. The next morning I put it back on low for about 4 hours then took off the lid and set it on high for about 3 hours. I also used my immersion blender to blend it which worked wonders. Oh, I chopped the apples up in my processor before putting them in the crockpot. I checked to see if it was done by placing a wooden spoon upright in the center of the crockpot till it stood up straight on its own. I then filled canning jars and bathed them for a half hour. It turned out great. The long wait is well worth it. I'll definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLYSMAMA"
},
"reviewBody": "Here's what I learned - use a soft apple-like red delicious. I used about 20 of these and added in 3 honeycrisp apples because that's what I had. The red delicious apples cooked down smooth after about 12 hours in the cooker, the honeycrisp ones left it a bit chunky. You could run it thru the blender or food processor, but I just chopped my apples into tiny bits by hand. The type of apple you use will make a difference in the smoothness. I made more than the recipe calls for - I filled up my 6 1/2 Q cooker to the top and ended up with about 4 C of apple butter. Do not be tempted to add a lot of extra spices based on a lot of apples because the flavor will become concentrated as it cooks down. I used 2C brown sugar instead of white for additional depth of flavor. You can add more sugar &amp; spices as needed after it has cooked down for awhile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazmine Rivera"
},
"reviewBody": "Really good. Added my own spice. 1 hour is not enough to simmer out the last of the liquids. I did about 2, and it was still watery - but amazing flavor.\nI added Cinnamon, nutmeg, clove, allspice and did a mix of granny smith and other apples I had laying around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATA1"
},
"reviewBody": "Easy and made this is my Instant Pot in 30 minutes (smaller portion). :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CREEKPERSON"
},
"reviewBody": "Great I also only did 2 cups of sugar and another teaspoon of cinnamon. Cooked all night and most of the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Landwehr"
},
"reviewBody": "I made this and it turned out so good. It was very easy and it did take all day. Cooking in the crockpot made easy and it was easy to clean up. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grahlfs"
},
"reviewBody": "Good recipe, I like the addition of cloves. Like nearly everyone else I cut back the sugar to two cups and even that was too much. Here is a tip. If you blend the apples before cooking there is no need to peel them, and it is better for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Gray"
},
"reviewBody": "Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewCook"
},
"reviewBody": "I made two batches simultaneously. One with the 4 c white sugar and one with 3 c white and 1 c brown sugar. The one with brown is richer and darker, but both were terribly much too sweet. I wanted to try the recipe as is even though some reviewers said to reduce the sugar. The flavor is spot on and all is not lost. I did add allspice and increased the cinnamon a little. Just my taste. I will try this again next fall and maybe halve the sugar or just add more apples. Great recipe though minus the super sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony D"
},
"reviewBody": "Delicious. I used a blender about half way through the cook. It cut the cook time in half, based on the spoon test on a plate. I was ready to leave it overnight, but it was done - perfect consistency, amazing taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri"
},
"reviewBody": "By far my favorite recipe for apple butter! kids and grands look forward to finding a jar of this in their family Christmas baskets every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fr3aky"
},
"reviewBody": "I was using Cortland apples, which are sweet enough in my opinion, so I added only about a spoonful of sugar for half the described recipe. Still super tasty and a real treat on toasted bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Stimson Kirschner"
},
"reviewBody": "Everyone liked it. I thought it was easy I did cook longer than the estimated time. I didnt have cloves and it did seem like it was missing something so I ended up adding pumpkin pie spice and cooked for another hour. I used 12 fresh picked apples and it came out extra sweet. I dont think it was 5pds though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy"
},
"reviewBody": "This is a great method for making Apple Butter. I didn’t follow the recipe to the T....only in that I didn’t measure everything exactly and I cooked the mixture for as long as it took to get the correct consistency. This meant cooking it for about 15 hours on low!!(Plus the 1 hour on high in the beginning)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "freddie"
},
"reviewBody": "We have made it twice and the only thing we changed was the amount of sugar, we didn't put as much but I think that depends on your apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K McCr8"
},
"reviewBody": "This was super easy and delicious! I followed the advice for how to check if the apple butter was done and had to cook with the lid off for much longer than the original recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Michael"
},
"reviewBody": "Did not use any sugar as my apples were sweet apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Schlo"
},
"reviewBody": "My whole family loved it! I put it in the same jar that the apple butter came in that we bought in Gatlinburg and they said it tasted the exact same! And it doesn't get any easier than putting it in a crock pot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "Added fresh ground cloves. \nOne cup less sugar.\nTurned out great !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LBG"
},
"reviewBody": "I use Macintosh apples since they're on my property. I cut very small pieces and fill crockpot 3/4 full. I cut the sugar and cinnamon by half but use 1/4 teaspoon of salt and cloves. By far the easiest recipe if you have a lot of apples. I get a ton of complements on my butter. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marya Mallasee"
},
"reviewBody": "I loved it. So easy. A little too sweet.\nI’m going to try with sweetener"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Best I have ever had!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shannon Sizemore Hutton"
},
"reviewBody": "I think I need to work on a combination of apples that go better together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Wonderful and yes I will make it often, mailed jars full to My children."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bruce Parrott"
},
"reviewBody": "Used a variety of apples and had to mash at end. Minor amount did not melt... Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "First of all I am not a cook, not a chef. I always cooked because I had to. Now that I am retired with no little kids, I have started making stuff. I have learned so much on line. It has become my reason to go into the kitchen. I recently received about ten pounds of apples, a lovely gift. But in time they would spoil. I never had apple butter, I tried it as a sample. So I found this recipe. My slow Cooker could only handle 3 lbs of large Delicious red apples.. I followed the recipe, except I only added 2 cups of sugar. I also used a blender once everything was cooked. I am amazed how good it turned out. For me, it was like winning, a simple pleasure. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylee Mee"
},
"reviewBody": "This was an awesome recipe. It was my first time making it and it was so good and also easy to follow. I added an extra pound of apples to cut the sweetness. Will defiantly be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pulga"
},
"reviewBody": "Use half brown and half white sugar with a mix of honey crisp and delicious red apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Rodriguez"
},
"reviewBody": "I added lemon juice, came out so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly Williams"
},
"reviewBody": "I used several varieties of apples and adjusted the sugar with sugar in the raw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Wiesman"
},
"reviewBody": "easy great chunky - just what we wanted"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Cimini"
},
"reviewBody": "I have made this for the last several years and it always comes out amazing! I’m only giving it 4 stars because I don’t make it as written. I half the sugar using a cup of white and a cup of brown. Otherwise, super yummy! A fall favorite and a great way to use up this apples we always pick too many of!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Fillmer"
},
"reviewBody": "We have made this recipe every year for the last 5 years and everyone loves it. We make at least 2 batches and male small containers for gifts to all our family and friends. They ask us for it every year around October."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Vigil"
},
"reviewBody": "Fantastic recipe! The apple butter had a wonderful flavor! Since September 23rd 2018, I've already made this recipe three times... 6 quarts every time and ALL my apple butter is completely gone!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanna"
},
"reviewBody": "Anyone know how many canning jars this makes? 8oz or 12oz jars?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarnesTM"
},
"reviewBody": "Oh my gosh this recipe was simply the best! I definitely used all the sugar, cinnamon, and clove just like the recipe stated. While the apples cooked down I cut up more apples and added to the batch so that it filled up my crockpot as one of the other reviews suggested. Great, great tip! This was the most delicious apple butter ever! In fact I made it three days ago and it is completely gone because all of my friends have devoured it LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oom50"
},
"reviewBody": "Love it and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnycook"
},
"reviewBody": "Made half the recipe and shared the results. The finer you chop the apples, the smoother the results will be (even though everything gets soft and cooks down). When we got tired of eating it with toast, I served some of it with pork tenderloin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "me"
},
"reviewBody": "Other than using 2 cups brown sugar plus 2 cups white sugar, I kept recipe the same. Delicious! Super easy. I used the immersion blender towards the end to smooth out the consistency and allowed it to cook further without the crockpot cover. Canned the results to use as hostess gifts and for friends. Makes 20 small gift jars. Can’t wait to try it on a lovely baked Brie for Thanksgiving! Yes, it is sweet but you can always adjust to taste. I will try reducing sugar to 2-3 cups for next time, but keeping it 50/50 for white/brown sugar. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JulieW"
},
"reviewBody": "I found there were quite a few adjustments to making this recipe work; the outcome really depends on the type of apples you're using. Also, 1 hour with cover off was nowhere near enough for my preference of thickness. For the 1st batch, a neighbor gave me honeycrisp off their tree. Since they're already quite sweet, I added 1/3 c white sugar &amp; 3/4 c brown sugar, which balances out the sweetness &amp; gives a caramelly flavor. Let it go all night in the crock on low, used my immersion blender &amp; had it sit about 7 hours w/ lid partly off to get the thickness I wanted. The next batch was a blend of the remaining honeycrisp &amp; others I had on hand. After the step of immersion blender, I wasn't at all happy with the taste. Added more sugar, more cinnamon, a tbsp of vanilla. After letting it thicken, it still tasted kind of flat, and any further adjustments would make it too sweet or too spicy. I'll be using it more for apple butter muffins &amp; bars so it doesn't go to waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haunani"
},
"reviewBody": "Easy recipe to follow with a very tasty outcome. I'm keeping this recipe and I've already shared this recipe with family and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "Just made this last night and finished it today. It took a little longer to cook (about 12 and a half hours) but that could be because I just cubed the apples instead of finely dicing them. The house smelled amazing while I was cooking it so I wasn’t complaining. I added 1/2 teaspoon of allspice and upped the cloves to 1/2 teaspoon as well cuz I loved spiced apple. I also cut the sugar in half (only added 2 cups) as a few of the other reviews suggested. Next time I make this I might only add 1.5 cups of sugar cuz it still came out sweet. It’s a bearable sweet though, not sickly sweet. This recipe is definitely staying in my fall collection though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingQueen"
},
"reviewBody": "This recipe was so easy and delicious! Hubby and I went apple picking and brought home 25lbs of apples, in addition to baking lots of goodies, I decided to try my hand at apple butter. It came out absolutely perfect and I even tried canning for the first time (with directions I found online) and I was successful! I'm back now to make my second batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Lafferty Collins"
},
"reviewBody": "This stuff is amazing. I added a little more sugar, bout 1/2 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WisherEternal"
},
"reviewBody": "I made this recipe using gala apples. I also added nutmeg and used 3 cups of sugar instead of four. It came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Selina Low"
},
"reviewBody": "I use 20 Fuji apples and 2 cups of sugar. Total hours cook was 14 hours (4 hours without lid) texture was not dry like a paste but it still taste good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "randy mattox"
},
"reviewBody": "Tastes amazing and loved by everyone I’ve given it to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebecca"
},
"reviewBody": "I followed the recipe and absolutely love this! So yummy and definitely smells amazing while in the slow cooker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabo"
},
"reviewBody": "I made this with 14 lbs of apples (prior to peeling and cutting them up) and divided it between two crock pots. I only used 3 cups of sugar in each crock pot but still used 2 tsp of cinnamon and 1/4 tsp of cloves in each crock pot. IT IS DELICIOUS! We ended up canning it and came out with only 8 pints after the apples cooked down, but it was well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Vann"
},
"reviewBody": "Followed recipe. Perfect! This year I was more careful with my apple choices. Even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CW"
},
"reviewBody": "So glad I found this recipe! I made this twice. The first time I made followed the recipe exactly; using Granny Smith apples. My husband loved it. I thought it was too sweet, so I made another batch to use for holiday gifts. I used 2 cups regular sugar and 1 cup brown sugar, again using Granny Smith apples but left the peel on. After I removed the lid, I used a stick blender to break up the chunks and peel. For me the second batch was perfect. With less sugar you can taste the apple and keep the tart bite. I also canned using a 5 minute hot water bath to preserve. Makes a great gift and soo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Russell"
},
"reviewBody": "I made it. It tasted good, but when I cooled, it tasted more like caramel. Put it in the fridge and the next day it was hard as a rock. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "joiseygirl"
},
"reviewBody": "USE LESS SUGAR!! I used Granny Smith apples, 2 cups white sugar, 1/2 cup light brown sugar, and spices as listed in recipe. I ran peeled and cored apples through food processor before adding to crock pot. I cooked 1 hr on high and then on low for about 14 hours. Removed lid and cooked for 1 hour and when tested water was pouring out of it. Used a stick blender to get to butter consistency. I had to cook a total of 5 hours after removing lid. It’s dark brown and very caramel tasting, which is very nice, but then the sweetness hits and it’s overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trudy"
},
"reviewBody": "I love this recipe! It came out like apple butter should. It is a bit too sweet but I will work on that. I like nutmeg in apple recipes so I added nutmeg and I used an emersion mixer to smooth it out. Yummy! This will be my \"go to\" apple butter recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I’ve been using this recipe for two years now. I’m so grateful you shared this with us. West Virginia is known for making some of the best apple butter by far! My daughter is a apple butter critic and compares them all to the apple butter fest in Ketser WV. She took two jars home after eating some for dinner so this recipe Made the grade in her book and mine! ! never would have made homemade apple butter if it wasnt for this crockpot recipe. BTW the house smells so good while cooking it too! Thanks for sharing with all of us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ellen Berg Maravilla"
},
"reviewBody": "Used 3 cups sugar. And a little more cinnamon. Perfect\nI let it cook all night (use a crock pot liner) ran it thru my blender for perfect smoothness, and canned it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tburkhardt"
},
"reviewBody": "I found that this recipe was way too sweet. I only added 1cup of sugar but next time won’t add any. I used a mixture of Granny Smith, fuji, and gala apples and thought they would balance each other out. Not the case."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EasyOnTheSalt"
},
"reviewBody": "So simple and yummy and smells so good while cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mackenzie Wardlow"
},
"reviewBody": "I added a lot more spices to it, about 2x the amount of cloves and a lot of dashes of pumpkin spice mix to it. It's very sweet (I do love sweet though) so I might only do 3 cups sugar next time. It didn't take more than an hour like some other people said to thicken at the end. Prep time is a LOT longer though (2 hours maybe to skin, cut, and cube apples), so take that into account or else you'll be like me, frantically whisking apple butter smooth at 3 am. Would make again though!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fruit Grower"
},
"reviewBody": "As many others have stated, the original recipe is pretty rich with sugar. I used Mollies Delicious apples from my own tree. This particular variety is sweet enough right off the tree that no extra sugar is needed. Friends and family gave it rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shagump1"
},
"reviewBody": "I made this per the recipe and found it to be VERY sweet. Next time I will start with 2 cups of sugar and add more at the end, if needed. Also, I used an immersion blender after the apples cooked down to make it a smooth, and even consistancy. Overall, it's a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Linda Woods Connolly"
},
"reviewBody": "I made this yesterday. I adjusted the sugar to make it less sweet, but it's still much too sweet for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ISHDI"
},
"reviewBody": "Made this using Jonathan apples. While I hate changing a recipe the first time I make it, 4 cups of sugar sounded like way too much, so I reduced to 3, and used half white and half brown. Finished batch was very good, but way too sweet. Made a second batch, using 1 cup sugar, and then combined the two batches (meaning I basically ended up with 2 cups of sugar in a \"regular\" batch). Final flavor was excellent! Canned these in a hot water bath, and got 12 eight ounce jars. First time making apple butter, and first time doing any canning ... kind of a fun project!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dana DeMunno"
},
"reviewBody": "TOO SWEET! I was not going to peel and cut 5 lbs of apples so I only did 3 and cut the ingredients in half. I did 2 cups of sugar and its too sweet. We went apple picking and got Macintosh apples and cortland so I'm guessing the apples were already sweet. If there is a next time, I'm going to try something different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Menard DeMello"
},
"reviewBody": "I love it! So easy. I'd put a bit less cinnamon. I did put it thru the blender to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "First time I have made apple butter. Turned out great and is very tasty. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jj"
},
"reviewBody": "Making this right now changed up a bit substituted cup and a half of brown sugar for white omitted cloves added more cinnamon some nutmeg and ginger been making this for three yrs. Going to can and ship to aunt and mother in law who beg for it lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyshea McGivney"
},
"reviewBody": "My husband and I love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Capron"
},
"reviewBody": "This is now a family favorite! I ended up just placing all ingredients into the crockpot, set in high and let it be all day. I did none of the extra steps for cooking. I also subbed in 1/2 cup brown sugar and left out the clove and replaced it with 1 tsb of pumpkin pie spice. That was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CtUsaMom"
},
"reviewBody": "Followed the recipe and added a teaspoon of lemon juice. Might consider 3 1/2 cups of sugar next time. It is a bit sweet. Someone did say this could change the consistency. Cooked on high 1 hour, 8 hours low still covered. And three hours low uncovered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Casablancaise"
},
"reviewBody": "This is amazing ! It's going to be hard to go back to putting jam and preserves on my toast !\nWe went apple picking last weekend and I had over 20 lbs. of apples in the house. I picked this recipe to use some of the apples but wasn't sure, the family was going to like it. So I halved the recipe and I realized later that it was a mistake ! Everybody loves this apple butter !\nThank you Terri for sharing this recipe on AR."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Nelson"
},
"reviewBody": "I will definitely made it again &amp; I will borrow my foodie son-in-laws peeler! I put the ??s through my food processor at someone's suggestion &amp; I would cut the sugar about 3/4-1 cup. Really yummy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21205/all-day-apple-butter/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/221/side-dish/sauces-and-condiments/canning-and-preserving/fruit-butters/",
"name": "Fruit Butter Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21205/all-day-apple-butter/",
"name": "All-Day Apple Butter"
}
}
]
}
}
, "about": [
]
}
]