				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Almond Shortbread I"
,"datePublished": "1997-12-21T16:51:22.000-05:00"
,"dateModified": "2022-08-08T10:46:29.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ROBIN JOYE"
,"url": "https://www.allrecipes.com/cook/907397"
}
]
,"description": "This melt-in-your-mouth shortbread is made with butter, flour, sugar, and pure almond extract."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/R8ZELKMDyuztF1ewc1k9RUAZVec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/227387-f72ad9109fc64a5a914452342323ee8a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Almond Shortbread I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "203"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "191 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "27 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "73 mg"
,"sugarContent": "9 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup butter, room temperature",
"0.5 cup white sugar",
"2 teaspoons almond extract",
"2.5 cups sifted all-purpose flour",
"0.33333334326744 cup granulated sugar for decoration" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, beat butter with 1/2 cup sugar and almond extract until light and fluffy. With a wooden spoon, stir in flour until smooth and well combined. Divide dough into 2 parts. Wrap in plastic and refrigerate for 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "On lightly sugared surface, roll out dough, one part at a time, about 1/2-inch thick. Cut out cookies with a 1 1/2-inch round cookie cutter. Place on ungreased cookie sheet 1 inch apart. Make an indentation in the center of each cookie with the end of a wooden spoon."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven until cookies are light golden brown around the edges, 25 to 30 minutes. While still warm, roll in sugar. Cool completely on a wire rack. Store in an air-tight container."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is THE best almond shortbread cookie recipe in the world. I make it on holidays with 6 drops of food coloring in the shape of hearts, in 4 leaf clovers, etc. I also make frosting with powdered sugar, milk, and shortening, to decorate them with a border, a name, etc... And that \"icing on the cake...\"asked these cookies out of this world to EVERYONE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gem"
},
"reviewBody": "These are addictive. Finally made them for the first time after having saved the recipe in my Collections since forever. I made just half the recipe but added 2.5 tsps of almond extract as the one I currently have seems to be weak. I also brushed egg white and sprinkled a bit of sugar on them before baking as I'm not a fan of pale cookies. These are small cookies and also thin -- I tend to roll out pastry kinda thinly. But it made them crispy! Will be making again 😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "I really liked this recipe, but my review comes after a few experimentations with the dough. As you roll, use the sugar as you would use flour. It will help if your dough is slightly sticky. I noticed this recipe got more pliable and less sticky if left in the fridge for a bit longer in the fridge. I left one part in the fridge for a few days just for the sake of it and to have shortbread ready to roll and bake. After bringing it to room temperature, the dough was nicely pliable, and I had pretty much no trouble. Be mindful about the thickness of the dough as you roll it. skinnier will yield a crunchier shortbread. Thicker will yield a chewier one. Also, be aware of the oven temperature as they are all different and shortbread cut thinner will brown much faster making it a bit too crunchy. I solved the over browning of my oven by cutting the baking time by 5 minutes and it worked for both thin or thick shortbread. Will make it again as it is so buttery. Also, will make more shapes as this is a versatile dough that is good enough to cut it in so many cute shapes and make gifts. Next time I might dip them into chocolate or make a bit of a thin glaze to decorate them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marlena “Nina” Asocar-Wilson"
},
"reviewBody": "Not very good very dr and no flavor and I followed receipte to the tee..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Watkins"
},
"reviewBody": "Fantastic !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Morse"
},
"reviewBody": "This recipe is so easy and always turns out great! Have made it several times. I always chill it in two logs overnight. Bake in the morning with a little sprinkle of sugar and slices of almond. Makes about 28 small delicious cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelbs"
},
"reviewBody": "This cookie was so good I felt compelled to write a review! It was buttery and almondy and so delicious! I took parts of other reviews and split the difference on the flour and used 2 1/4 cups. It was quite crumbly at first, but using my kitchenaid mixer the dough came together perfectly with just some time. I did add 1/8 cup light brown sugar to the mix because I love brown sugar in my cookies anyways, but I bet they would have tasted just as good with just the granulated sugar. I formed two logs over an inch in diameter and let those chill in the fridge before slicing between 1/4 and 1/2 inch thick cookies. Not all my cuts were consistent, but that’s what I was aiming for. I let them bake 25 minutes and they are absolutely delicious! This will definitely be my go to shortbread recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Pepin"
},
"reviewBody": "We like slightly chewy cookies, so I did a 1/4 c of brown sugar and 1/4 c of white sugar. Also made a lemon glaze and sprinkled crushed honey almonds on top of the glaze. I baked the almonds for about 5 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "irinka"
},
"reviewBody": "Delicious cookies. I typically don’t care for cookies but decided to make some with my son. We all loved them! Will definitely make those again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kinji Nightcore"
},
"reviewBody": "Came our pretty good, and tasted really nice. But I would recommend that if you make this, add a bit more butter for a better consistency. As the amount of butter told to put in is way to little and the dough is over the top crumbly..... Just a little more butter and good to go"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Step"
},
"reviewBody": "Like everybody else who learned from mom and Betty Crocker, I creamed the butter, sugar and vanilla first. My cheapo hand mixer was challenged but we produced a smooth stiff dough. I added 1 tablespoon of dried lavender from the summer garden. You cannot imagine the scent. I also rolled and patted into a log to chill, then rolled in course bakers sugar (turbinado, demerrara) and sliced. The lavender lends a cool tang brought out by the butter (never margarine) not too sweet, elegant little tea cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josey Grace"
},
"reviewBody": "Well.... These cookies are addicting. They taste PERFECT and totally melt in your mouth. They have just the right amount of almond flavor. HOWEVER... The dough was so crumbly (Maybe my butter was too hard). I had to both use a paddle attachment on my mixer and knead it a bit with my hands to get it to come together, I refrigerated it for 1 1/2 hours, and it was hard as a rock. the dough stuck to my rolling pin a bit and fell apart while cutting the cookies. They took about 32 minutes to bake, so a little longer than it should. I'll totally be making these again, and hopefully the dough will cooperate better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sierra Autumn"
},
"reviewBody": "I doubled the almond extract and the cookies came out to be amazing! My family loved them and I added some chocolate on top along with a word print press that says “Home Made.”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sjb1"
},
"reviewBody": "Pretty good, though I feel like the recipe as is is too much flour or not enough butter. I had to cut the flour down a bit and it was still quite crumbly and hard to roll out. I made sandwich cutout with raspberry jam (Linzer cookie style) and it was quite good, but only made 6 sandwiches/12 cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gopherit"
},
"reviewBody": "I love these cookies! They are not only Easy to make, but can be altered to any flavor you wish! Big hit in my family!! So deliciously simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krumbar"
},
"reviewBody": "I make this recipe often, but one of my nieces is deathly allergic to almonds. Solution: substitute lemon extract and add some lemon zest. Don't use lemon juice instead of extract; the moisture content is different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TracySadler"
},
"reviewBody": "I after refrigeration, the log was very hard to roll out so I ended up cutting 1/2” slices off the log for baking. The cookies and the dough were delicious :) Next time I think I might try to make them a little thinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendye"
},
"reviewBody": "My husband's favorite cookie. It's a delicate cookie. Definitely roll it and slice it. Super easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Adria"
},
"reviewBody": "Is there an ingredient missing or the wrong measurement listed? I made these exactly as written...when I took the dough from the refrigerator after the 2 hours It was very stiff and difficult to roll out. And it was very sticky...I tried a wooden surface, a glass surface and even on parchment paper...they stuck to everything!!! They spread out thin in the oven and I had to remove them early because they were getting too brown. I allowed them to cool on the cookie sheets but when I transfered them to a wire rack they all fell apart!! I was so disappointed. They do taste good so I’ll have to figure out what I can do with the crumbled mess...I’d hate to toss them all out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody Stevens"
},
"reviewBody": "No changes, turn out good Hubby loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nici Roberts"
},
"reviewBody": "I doubled the recipe, and used just a touch under the stated amount of flour, because I added 2 tbsp of almond meal for extra almond oomph. I also thumbprinted all of them and added strawberry rhubarb jam in the prints. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anka"
},
"reviewBody": "I chose this shorbread cookie recipe because of the great reviews but for me it was just okay .... tasted fine after it was done,however , making it was a challenge ... followed other reviewers advise with only 2 cups of flour, did not melt the butter,subsituted with vanilla extract, and worked the dough with my hands so it is well mixed -after working the dough for good 30-40 minutes it was still very very dry and crumbly - i left it to cool as per recipe-but could not do anything with the dough- it was just falling apart ... i had to add quite more butter and also a bit of milk in order to stick together ... the reviews are so high -it seems that this issue with the dough only must have happened to me........ not sure what happened but i was not very impressed by this recipe actually at all... they turned out fine at the end ...i bake regularly so i m use to different types of dough but this recipe just didnt come out as i thought it would .... so giving it only a 3 stars (will post photos )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystalball"
},
"reviewBody": "Good, easy recipe. I made almost as the recipe states, I used only 2 cups of flour and the dough was perfect. Used my fingers to mix in the butter so it was fully incorporated. It was so fast, I let firm up in the freezer about 1/2 an hour after rolling into two logs in waxed paper. I fit all of the sliced up cookies on one large cookie sheet but that increased the bake time to 40 minutes. The recipe is great since I can see how customizable it is - I plan to add in chopped nuts and/or dried fruit next time. Great with milk, and I'm sure will be just as good with tea or coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Ruth"
},
"reviewBody": "These are very good. They melt in your mouth, they are not dry and they are easy to make. I didn't change a thing. I can deal with these. I will definitely make these cookies again.\nThe next time, I will use a combination of brown and white sugar and use vanilla extract instead of almond. I will put the whole batter in a pan and put in the fridge to firm, then cut them into little bar and put fork prints on them so they will look more traditional."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Todd"
},
"reviewBody": "This recipe was amazing. I wanted a light delicate cookie that I could add minced crystal ginger to. This was perfect. I did cut the flour down to 2 cups and added 1/3 C. minced crystal ginger and used the slice and bake method. MY NEW FAVORITE!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Price"
},
"reviewBody": "Easy, delicious, addictive. I made the dough into 2 rolls and chilled for about 2 hours and sliced 1/2 inch thick and baked. I did not change the recipe at all. These are fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "txcook570"
},
"reviewBody": "Delicious!! I decreased the amount of flour to 2 cups and increased the almond extract to 3 tsps. I love almond flavored things! The dough was crumbly, but I used to my hands to knead the dough together into a disk. After 2 hours in the fridge, the dough rolled out perfectly! I will definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christine Korthaus"
},
"reviewBody": "Something was off---the dough would not hold together at all. It came out so crumbly it was unusable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Ciletti"
},
"reviewBody": "I'm not really a fan of shortbread normally but my daughter loves shortbread cookies so I made a batch. I used the ingredients as listed, even the 2 1/2 cups flour and it was fine. I mixed with a wooden spoon, no problem, took like five minutes. I split the dough into log rolls as I saw others doing..much easier than rolling out and wrapped them in plastic wrap. Put in fridge twenty minutes..cut into 1/2 inch circles, coated the bottom of a glass in sugar and smashed them down to about 1/4 inch. Simple and easy! Mine baked 15 minutes and were slightly golden. I sprinkled with ground almonds, cinnamon and sugar. My dough was perfect. Maybe could be sweeter but i thought it was good with that amount of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LawyerChef11"
},
"reviewBody": "These were heavenly. I used the recipe as is and they turned out beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickygloz"
},
"reviewBody": "These were very good! But after the first batch, I rolled out the next onto crushed almonds or placed sliced on top and they were much better!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Very delicious cookies. I used only 2 cups flour too and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t2andc2"
},
"reviewBody": "Wonderful shortbread cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karlee"
},
"reviewBody": "So easy and yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "btrflygrl"
},
"reviewBody": "I have no idea what I did wrong but the entire thing was crumbly when it was time to roll it out. I creamed the butter and sugar til it was light and fluffy, separated it into 2 parts and left it in the fridge for the 2 hours. It's completely crumbly. How in the world am I supposed to roll it out and use the cookie cutter?? I am not happy as this recipe smells and sounds delish and now I've wasted supplies :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cj Pickle"
},
"reviewBody": "Trying to find a dough to start rolling and cutting cookies. This I'd not it. Too much flour and dough tasted bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mickey"
},
"reviewBody": "I did something wrong. It came out too crumbly, then after I put in fridge it got super hard. :-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deidre"
},
"reviewBody": "But had to use some water to make a more pliable dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Gallagher"
},
"reviewBody": "Delicious just as written! I used the \"slice and bake\" method rather than rolling them out. Sliced about ?\" thick, baked in a convection oven at 300 degrees for 25 minutes (at high altitude) ... PERFECT. I rolled them in cane sugar while still warm. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Terry Lefler"
},
"reviewBody": "I decided to try this recipe and saw only high reviews of it from the recipe page. The first time I tried it just like the recipe stated and it turned into a rock from being in the fridge then when trying to roll the dough it just crumbled to pieces. \n\nThe second time my daughter tried to make them. She put in another cup of butter, 1/4 cup of sugar and a splash of almond also she only put in 2 cups of flour. She didn't put it in the fridge and had to keep working it in her hands to try to keep it together. It was too much hassle for the product that came out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bethyroonie"
},
"reviewBody": "The dough was crumbly and I had to warm it up with my hands before I started rolling it. If you put sugar on the top as well as the bottom it won't stick to the rolling pin. I baked them shorter than the recommended time and they turned out fine. I couldn't figure out how to get the sugar to stick to the top after baking though… maybe that just shows my inexperience as a baker. Probably won't try this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Carole1263"
},
"reviewBody": "Definitely disappointing. I read a few reviews before making this recipe. They were all rave reviews, so I thought I'd give the recipe a try. The dough was very crumbly and hard to roll out. When the cookies were done they were tasteless and dry and I could hardly taste the almond flavor. If I make these again, I would use only 2 cups of flour (or less) and add more sugar and a little more almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Claudia Kriston Cleveland"
},
"reviewBody": "Terribly dry recipe. Wish I'd have read the reviews first and cut the flour down to 2 cups. Couldn't roll it out. Had to press it into a cookie sheet and hope for the best. Even then when it came out it didn't stick together. Waaaaay too much flour in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gillian Viveiros"
},
"reviewBody": "These cookies tasted good, but I had to add another 1/4 cup of butter to bind everything and I set them for 25 min and most of the first batch burned. I will try again as it was my first try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosie"
},
"reviewBody": "Instead of white granulated sugar I use confectioners sugar...Instead of 2 1/2 cups of flour, I use 1 1/2 cups of flour and 1/2 cup of cornstarch (total 2 cups)...the cornstarch makes it melt in your mouth and more delicate..I also add 1/4 tsp salt...and I use either vanilla or almond extract....sometimes both!...these cookies are very addicting and I have had many raves at cookie swaps....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie Kale Pearson"
},
"reviewBody": "Made this using brown sugar instead of white sugar. Made a great recipe awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dfrasche"
},
"reviewBody": "These were really great. We fought over them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kylie"
},
"reviewBody": "Amazing recipe even with my blunders! The only things I did differently were: 1) I substituted the almond extract with vanilla because I didn't have any almond extract. 2) Rolled the dough into logs before chilling and cut up afterwards. 3) I accidentally put only half the butter in and only realized it after I had added the flour. I added the rest of the butter and it still turned out great! Chopping up the butter into small cubes and letting it sit at room temperature for a few minutes made it easier to whisk together as well. Great basic and very yummy shortbread cookie. Thanks for posting!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nefertiti381"
},
"reviewBody": "What a marvelous sugary treat! I like to coat my cookies in white sugar after taking them off the baking pan. I also don't bother with using cut outs, that takes forever. Just drop the dough on the pan as though baking choco chip cookies, and they are just fine. I also don't bother tinkering with this recipe. Made it \"as is\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley87"
},
"reviewBody": "i made this one and omg it was amazing A pluss"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olwen"
},
"reviewBody": "A very good basic recipe that should be a basic in any recipe collection. Excellent flavour. Possible to ring changes - leave out the almond essence and use orange, lemon, vanilla. Make them thinner and sandwich two together with a chocolate or vanilla buttercream. Additionally, would make an excellent strawberry shortbread with the addition of fresh strawberries and whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mags"
},
"reviewBody": "Delicious! Made these for my brother as shortbread is his favorite. Dipped some in chocolate and they were a hit. I rolled into a log and sliced chilled dough instead of rolling and cutting. Would defininetly make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathyc"
},
"reviewBody": "Made these cookies following the ingredients exactly. Used my KitchenAid stand mixer as other reviewers suggested and had absolutely no problem with texture of dough. Rolled into logs, refrigerated overnight, let sit out for just a little until slightly softened and sliced into circles. I topped half with granulated sugar prior to baking and left the others plain. Once baked, I dipped the plain cookies halfway across with melted white chocolate and then sprinkles. Absolutely delicious - perfect amount of crispness. Everyone loved them. Will definitely make again and again....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kellacious1"
},
"reviewBody": "I'm not sure why, but I was unable to roll out this dough (after following instructions exactly). It was too dry and crumbly. I tried letting warm back to room temp but it was still too crumble. Instead I pressed it into the bottom of a metal pie pan (1/2 the dough into 1 pie pan), pricked it thoroughly with a fork, and baked about 25 minutes or til light golden. It was delicious cut into wedges. But I was disappointed I couldn't use my cookie cutters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alweber"
},
"reviewBody": "wouldnt change a thing awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pauline"
},
"reviewBody": "This recipe is very tasty. As stated by previous reviewers, this dough does get rock hard! But you just need to work the dough a bit with your hands to warm it up. I rolled my dough to about 1/4 inch thickness and used a snowman shaped cookie cutter to cut out the cookies. Each time I gathered up the dough, I rolled it out to 1/4 inch thickness and stuck it in the freezer for 5-10 minutes. It was the perfect consistency for cutting out my snowmen. I also baked the cookies at 325 degrees for 15 minutes. (My cookie cutter was 5 inches long) The cookies turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pattie Loia Costa"
},
"reviewBody": "Just made these...I have to say thank you for all the reviews because I think they are the reason I thought this recipe was so easy. I made one circular log and one square log and put them in frig for 1 hour. I did roast almonds, crushed them fine and mixed with sugar and cinnamon and rolled the cookie logs into that before slicing them. (and the hint of using my Kitchenaid for every step was especially helpful....You were right...having the mixer beat the dough longer allowed it to become soft and smooth...not crumbled like some people reported.) My 5 year old helped me sprinkle colored sugar on them just before setting them into the oven. Simple, easy and yummy. Thanks for this recipe. I never made shortbread before because I thought it was a very hard cookie to make. This was so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snapitssarah"
},
"reviewBody": "Great recipe! The dough was a little tough to work with because of the fact that it was kind of crumbly, so instead of rolling it out I simply rolled it into little balls and flattened them with my palm on the baking sheets. They turned out fantastic and everyone kept asking if I had bought them from the store! Great with tea or coffee, will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RitaCarriere"
},
"reviewBody": "I followed this recipe to a t last year and my family and I loved them. We enjoyed them so much they were eaten in 2 days. I'm planning on making them again this holiday season. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flashsmith"
},
"reviewBody": "I didn't have a single problem with this recipe! I Put the butter in my Kitchen Aid and whipped it for at least 5 minutes, then the sugar and almond flavoring (a sin not to use real butter and real almond flavoring)and whipped another 5 minutes. Scraping the bowl now and then. The flour mixed in perfectly and the finished cookie was melt in your mouth heaven! I've also used ground almonds in the recipe and it's also wonderful. My husband couldn't stop making yummy noises! Thank you so much Robin for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marja Boersma"
},
"reviewBody": "I used half flour and half almond powder. I blenderd whole white almonds into powder and used that for the half of the flour. This way you have more almond taste! It's great recepi and even better on my way. Keep up the great work with baking cookies, bye Marja"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Surita"
},
"reviewBody": "YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CT Baker"
},
"reviewBody": "Great recipe! If anyone is familiar with Fiori di Sicilia (extract that is vanilla + citrus) it is a great alternative to almond in these cookies! I used a teaspoon of this + 1 tsp vanilla. Cut down flour to 2 cups. They came out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "good, but not great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iron_Lady12"
},
"reviewBody": "UNBELIEVABLY EASY &amp; GOOOOD!! \nSo I never thought shortbread cookies were *this* easy but following this recipe I guess they really ARE! I followed the recipe's ingredients to the letter. I just changed the way I cut the cookies out &amp; the decoration. Like another reviewer, I rolled the dough into a log. In addition I added amaretto-toasted almond trimming. I blanched about a 1/2 cup of raw almonds &amp; toasted them in amaretto, let them cool &amp; chopped them finely. So after rolling out my cookie dough into a log, I brushed on some egg wash and rolled the dough over the chopped nuts, wrapped in plastic wrap, chilled for the recommended amount of time, then cut them about 1/4 in and baked according to the recipe. They came out wonderful and now I'm storing them in my fave cookie jars. They're incredibly buttery, crunchy and just plain delicious!! I just finished eating one with ice cream for dessert...sooo yummy!! I highly recommend this recipe especially since it just nails the basics of shortbread cookies. You can always take the basics and build on them the way u like! Good luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celena Vincent"
},
"reviewBody": "Yummmm!!! This is so good!!! I didn't have any almond extract so I used maple extract and OMG! It's delish! I also took another reviewers tip and made them into logs and just sliced them! Awesome and this is def a keeper! Thank you for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "baseballsen"
},
"reviewBody": "I felt compelled to set up an account here to review these cookies because they were that good. I made one batch for a valentines day party and we enjoyed them so much that I made another batch a week later. It's a really great, simple cookie that I would highly recommend!\nI did make some minor alterations to the recipe based on others comments:\n-added 1/4 tsp salt\n-cut flower down to 2 cups\n-added 1/8 cup brown sugar\n-added an extra 1/8 cup of granulated sugar\n-added an extra tsp of almond extract\n-refrigerated in a log shape for an hour and then cut quarter inch slices instead of rolling it out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie-Cat"
},
"reviewBody": "These were pretty good! I usually bake chewy cookies and I was looking for something crispier for a change and this did not disappoint. These shortbreads had the buttery, melt in your mouth crispness that I was looking for. I followed the ingredients as listed, except for adding 3/4 cup crushed almonds. Also, instead of dividing and chilling 2 hours, I simply shaped the crumbled dough into a log (about 1.5 feet long) on a piece of waxed paper, rolled it up in the paper, and chilled it for about 20 minutes. Then I sliced the cookies 1/2\" each, dipped the tops in sugar, and baked for about 20 minutes. We really enjoyed these and I'll make them again. PS-- I also used an electric mixer when making the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjketark"
},
"reviewBody": "Great, very buttery. Made them as part of a selection of christmas cookies for the kids' teachers. They were a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kwalker"
},
"reviewBody": "Great easy recipe! Only used 2cups flour as well. Made thumb print cookies. Light and crisp. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Cannon"
},
"reviewBody": "Great recipe! I did one batch just as the recipe stated...liked them so well, I mixed up a second batch and used marschino cherries too. I divided the dough in half, placed it in Saran wrap and made it like refrigerated dough. Refrigerated it 20 or 30 minutes, then cut the dough into 12-almost equal pieces...rolled it by hand into \"ropes\" about 6 to 8-inches long. Took a marschino cherry and began rolling the dough around the cherry, creating a \"pin-wheel\" ...sprinkled red sugar over the cookie and backed according to the directions...so pretty and yummy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMCLRH2O"
},
"reviewBody": "The dough is easy to work with and very versatile. I rolled it into 1 inch balls and then into colored sugar. I flattened the balls with a glass. \nEveryone liked the cookies despite the fact that they weren't very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "One of the best recipes for shortbread I have found. I did not roll out the dough and use cookie cutters. I rolled into 2 logs and put in the refrigerator for 2 hours, sliced , sprinkled with colored sugar and did not flatten. It took about 23 minutes to bake but when they came out of the oven I couldn't wait to try them. OMG I couldn't believe how good they were, melt in your mouth good. So easy to make and soooo good, it's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tinkadink"
},
"reviewBody": "I didn't have almond extract so I used vanilla extract and added slivered almonds on the top. I do like this recipe but as others have said it is a little dry. I ended up using 2 cups of flour instead of 2 1/2 like someone else said and it's still quite dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HildieVK"
},
"reviewBody": "This recipe did not go well at all. I followed the directions exactly for ingredients, mixing, chilling and rolling... the only thing I did differently was divide the dough in 3 parts instead of 2 to prepare for rolling (3 parts = 1 dozen each) \r\n\r\nThe dough tasted pretty good before baking. The almond extract was light and the PERFECT amount for just a hint of almond. The was SOOO hard to roll out. I divided my dough into 3 rounds to prepare for rolling, and by the time the center was the right temperature for rolling, the edges were melting from all the butter. I made these separate from all of my other cookies this year, because I didn't want the kitchen to be hot from the oven going while I was rolling something with so much butter... it didn't help. \r\n\r\nThe few cookies I did get to come out were horribly dry and crumbly, and the sweet almond-y flavor from the dough was gone. Dusting with sugar did not help, because they were so dry nothing would stick. \r\n\r\nIt is unlikely I will attempt these again--too much experimentation to get it \"right\" is effort better spent trying other recipes. Cutting the flour, increasing the sugar, rolling in powdered sugar... these all might help.\r\n\r\nThese might work for you if you live in an extremely humid but very cool climate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathieBr"
},
"reviewBody": "Lovely, lovely lovely!! Wonderful taste and texture, made these especially for my daughter with my regular Christmas cookies and she will adore them!! Thanks for a great recipe Robin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These taste wonderful but the dough is SO dry - even for shortbread, so it made it really difficult to roll out and shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EJE"
},
"reviewBody": "This was a super easy, fantastically tasting shortbread recipe! I followed the recipe as written and my entire family loved it. We will be adding this one to our list of favorite homemade cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Delicious! We added a little extra almond extract because we love that flavor. Per others suggestion rolled dough into tubes and refrigerated. Ended up making the next day and cut into slices. These cookies do not spread out, FYI. Tasty morsels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "islandmama78"
},
"reviewBody": "my kids and i loved these cookies!!! so simple yet so delicious!!! i added a tsp extra of the almond extract. i didn't have any problem at all with the dough. it was easy to work with. i followed the advice of other reviews by rolling the dough in a log, refridgerate and slice them a 1/2inch apart. before slicing, i rolled the entire log in colored sprinkles. i will be making these often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "These cookies are so wonderful!! I used a mixer and didn’t refrigerate the dough before rolling it out. They are so delicious!! My two little cuties are gobbling them up faster than I can make them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANGELAHAIRE"
},
"reviewBody": "I made these as Christmas gifts for my neighbors. They were okay, but nothing to write home about. I probably won't make them again, as I'm looking for something with a wow factor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teressa DeJong Drenth"
},
"reviewBody": "Excellent! EASY! Used an 8x8 pan and baked 30 minutes on 300 degrees. I used salted butter and added 1/2 teaspoon salt with the sugar and butter. I whipped the butter/sugar/salt/almond flavoring combination for about 3 minutes. In keeping with other reviewers, I used my mixer for the whole recipe, adding the flour gradually while my mixer was on \"stir.\" Glazed with royal icing on the bias of the cookie and sprinkled with crushed almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Young Reed"
},
"reviewBody": "Delicious cookie; not sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae"
},
"reviewBody": "These cookies really do \"Melt in your mouth\"! Plain and simple with a wonderful flakey texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made 5X the recipe for Christmas gifts and turned out excellent, though not quite as moist as some shortbread that I have had. Definitely learned my lesson about leaving dough in the fridge over night! 2 hours is plenty long enough I am sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryann Sunflower"
},
"reviewBody": "This cookie is awesome! Gave to 3 friends for gifts and all asked for the recipe. I used only 2 Cups of Flour, indented the top, put in a sliced almond in half of the cookies and left the others plain. Then, when they came out of the oven and cooled a bit, I sprinkled with a mix of cinnamon and sugar. Be sure to leave in refrigerator only two hours. Many thanks, Robin! You and your cookies are the BEST!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "magicpam"
},
"reviewBody": "Husband really liked these, but niece did not (she's quite picky). I never had a chance to try them. Did not have almond extract, so I used vanilla instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I followed the recipe as is and when I took my dough out of fridge it was a rock I was mad, but then instead if throwing it out I put in mirowave for 1 min. thank god it was useable again! I made two logs rolled one in red sugar other one in green sugar and just sliced them looks nice (I wanted to roll out and cut with cookie cutter, but didn't want to mess to much). They look and smell nice love with tea in the morning :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Stone"
},
"reviewBody": "This recipe is absolutely perfect. My kids LOVE them! I've made this shortbread for all the cookie exchanges, school festivities, gifts for friends, and they were a huge hit. One reviewer said it was too much flour, but I haven't had a problem with that. I use my Kitchenaid and just mix it until it makes a big clump. You can put it in the frig for a couple of hours, or a couple days. Just give it time to warm up a bit and get malleable if it's more than a few hours. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Morena0803"
},
"reviewBody": "These are so good. I wish I would have read more reviews before making them though. You really do need to cut the flour to 2 cups, or add more butter, I ended up adding more butter. I did roll them into logs, like others suggested, chilled them and then sliced and baked. My logs were about 1 1/2 inches in diameter and were done in about 12-14 minutes. I will be making more tomorrow to give away with the rest of my baked goodies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adrienne"
},
"reviewBody": "one of the best shortbread cookies i've ever had. the cookie was rich and buttery with just enough almond flavor. this will definitely become a Christmas cookie recipe staple in my house! just be sure to not roll the dough too thin because they are very delicate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NATHALIA"
},
"reviewBody": "I decided to play around with my usual holiday shortbread and I thought trying a new recipe would be the first step - I kind of like that I don't have to use cold butter, it's so much easier on your arms if you don't use an electric mixer. The texture is much closer to traditional purchased-in-store shortbread and I received positive reviews so I just finished putting a second batch to chill!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindsaylee0802"
},
"reviewBody": "Love this recipe-perfect taste, texture, also just used my mixer for the whole thing. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UKJESSI"
},
"reviewBody": "These are fantastic! Followed ingredient list exactly, but used electric mixer. So easy! Topped with Almond Butter Icing and the first batch was gone in minutes. I'm still getting requests for the recipe. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kimber"
},
"reviewBody": "I REALLY wish I had read the reviews FIRST. Like others, my dough was crumbly and just had NO HOPE of rolling out. So I pushed it down into a 9x13 pan and baked it like a crust. I'll probably just melt some chocolate over it or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kayisdelirious"
},
"reviewBody": "They did melt in your mouth... after much fussing and babying along. When I started to add the flour, I began to have some serious problems. I ditched the wooden spoon concept and went over to my hand mixer. There was no \"smooth and well combined.\" It was like... flaky dough. After I let it sit in the bowl while I re-read the reviews, I decided I'd put it in the fridge. I took it out of the fridge and it was a rock. So, I microwaved it, got it room temp, and then ended up being able to roll it out between two pieces of saran wrap. I was almost going to throw it out when I said, oh, we'll just test it. They turned out. Not sure if it was worth the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "After reading all the wonderful reviews of this cookie I decided to give it a try. Not sure what I did wrong but they never got to the oven. I left the dough in the frigde overnight (that may have been the issue, not sure) but when I took it out the dough was like a rock. Couldn't roll it it was so hard. I left it on the counter for three hours and it was still like a rock so I tossed it. Can anyone shed some light on this I really want to add these to my holiday baskets. Thank-you and Merry Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Good. Buttery. Recomended."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10539/almond-shortbread-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
"name": "Nut Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
"name": "Almond Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10539/almond-shortbread-i/",
"name": "Almond Shortbread I"
}
}
]
}
}
, "about": [
]
}
]