				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Amazingly Good Eggnog"
,"datePublished": "2002-12-11T00:37:25.000-05:00"
,"dateModified": "2022-09-30T15:59:03.000-04:00"
,"author": [
{"@type": "Person"
,"name": "NATALIESMOM"
,"url": "https://www.allrecipes.com/cook/436668"
}
]
,"description": "This eggnog recipe is the best and creamiest homemade eggnog thickened with tempered eggs and flavored with rum, cinnamon, vanilla, nutmeg, and cloves."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9Ou-5dnVn2i5jNRlT0dhtgGjlYI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/57028_Amazingly-Good-Eggnog_LZakaria_5911445_original-1x1-1-2f8ec7871db844b49c55e490482b8c8c.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2743374261001",
"description": "See how to make creamy rum eggnog that’s…amazingly good.",
"duration": "PT2M50S",
"name": "Amazingly Good Eggnog",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/07/22/57028_Amazingly-Good-Eggnog_LZakaria_5911445_original-4x3-1.jpg",
"uploadDate": "2021-06-25T14:24:08.608-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Amazingly Good Eggnog"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "1120"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "349 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "264 mg"
,"fiberContent": "0 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "73 mg"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"4 cups milk",
"1 teaspoon ground cinnamon",
"5 whole cloves",
"2.5 teaspoons vanilla extract, divided",
"12 large egg yolks",
"1.5 cups white sugar",
"4 cups light cream",
"2.5 cups light rum",
"0.5 teaspoon ground nutmeg" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine milk, cinnamon, 1/2 teaspoon vanilla, and cloves in a saucepan over the lowest heat setting; stir and heat for 5 minutes. Increase heat to medium-low and slowly bring to a boil. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Whisk egg yolks in a large bowl until light yellow in color. Add sugar and whisk until light and fluffy."
} ,{
"@type": "HowToStep"
,"text": "Pour some of the hot milk mixture into the egg yolk mixture, whisking quickly to avoid scrambling the eggs. Continue adding hot milk and whisking to combine until all milk is incorporated."
} ,{
"@type": "HowToStep"
,"text": "Pour the mixture back into the saucepan. Cook over medium heat, stirring constantly, until thick, about 3 minutes; do not allow the mixture to boil. Strain to remove cloves and let cool for about 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9Ou-5dnVn2i5jNRlT0dhtgGjlYI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/57028_Amazingly-Good-Eggnog_LZakaria_5911445_original-1x1-1-2f8ec7871db844b49c55e490482b8c8c.jpg"
}
]
,"text": "Stir in cream, rum, remaining 2 teaspoons vanilla, and nutmeg. Refrigerate before serving, 8 hours to overnight."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT565M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic! Gave some to a couple of co-workers, and in their words, this was the best eggnog they had EVER tasted! I subbed Fireball whiskey for the rum and the cinnamon in the whiskey complimented the eggnog perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Incredible recipe. My wife, who hates store bought eggnog, is now an eggnog lover and can't wait for me to make it next holiday season. A few adjustments: 1) made it without booze and added it later to taste. 2) only used 1 cup of sugar. 3) used lactose free milk and cream. Sooooo delicious - I'm craving it again just typing this review. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This. Recipe. Is. PERFECT. Deliciously creamy, sweet, thick and perfectly spiced. I don't have a single complaint. I personally chose not to make it with alcohol, and it was delicious for Christmas morning. My husband who isn't he biggest eggnog fan, couldn't stop telling me how amazing it was, and I wholeheartedly agree. I noticed a lot of people mentioning that their eggs scrambled. I find that the key is to slowly temper them. The first few times I added some of the hot milk to the yolks I only did a little splash, and whisked quickly and well with each addition. Gradually as the yolks heated up, I increased how much milk I was adding at a time. Once all the milk was incorporated and I moved the mixture back to the sauce pan, I started with the heat on low and gradually increased it to medium as I stirred constantly. It's really important to be cautious and not too impatient once you start adding the yolks. But my batch turned out creamy, and without even one clump of egg! I will be making more of this before the end of the year and every holiday season from this year on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wklarks"
},
"reviewBody": "Excellent recipe!! I substituted ground cloves for whole cloves, and it was perfect! Highly recommend ~ not a drop left after Christmas dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CC"
},
"reviewBody": "This eggnog was the best I have ever made!!! The only thing I did different was put the whole cloves in a little cheesecloth sack!!! It had the best taste &amp; everyone that had it LOVED it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this yesterday, and I think it has a very smooth texture. Things that I did differently: -I'm a non-alcohol person, and this recipe needs to be adjusted to drop the alcohol. I added about a cup extra milk, otherwise it's way too \"custardy\". -I love holiday spice and so I added an extra tsp of cinnamon and tsp of nutmeg. Even better if you have cinnamon sticks or nutmeg nuts to add! -I easily tempered the eggs by adding a little of the hot milk to the uncooked scrambled eggs and whisked like crazy. I did not boil the milk at any point, just heated it until it began to foam lightly, that way the eggs didn't curdle or lump up. I did not have to sift anything out of the mixture at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pumakittycat"
},
"reviewBody": "Did not taste like eggnog at all. Tasted much more like pumpkin pie, which, while tasty, is not at all eggnog."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good results. This is my new go to eggnog recipe! I did change the technique based on my experience making ice cream or custard. I wouldn’t boil the milk in the beginning, but instead heat it until it’s steaming hot and then slowly whisk into the egg/sugar mixture. Then return to heat and stir as you heat it on med low heat until thick. This may take a bit longer, but you will be less likely to have lumps. I also only had heavy cream on hand, so it turned out with a slightly different mouthfeel. I would recommend using the light cream as stated in the recipe. -cheers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Love this eggnog! I've been making it for the last 3 years. The only change I make is using less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "S Lawton"
},
"reviewBody": "I am only giving 3 stars because of the difficulty I had cooking the mixture without the eggs cooking and getting lumpy. In this day and age, a whole dozen eggs and 4 cups of milk makes for a real expensive mistake. I will give my suggestion. USE A DOUBLE BOILER when cooking the mixture. Because if your stove is a POS like mine and can't regulate temperature, you WILL scramble the eggs. As for taste, it was good, but I wouldn't go so far as to say \"amazingly\" good. I think I will give someone else's recipe a try this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This eggnog is so good, I love it. And for the people that are complaining of it being lumpy and therefore giving this a bad review, that’s due to your error, not the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making this recipe for years, now. I cut the sugar down to 3/4 cup, and don't add the rum. It's delisssssh. We usually pour it over a shot of bourbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Mangan"
},
"reviewBody": "An excellent recipe, everyone loves it! Wow it's been 8 years since I made the recipe of eggnog. The above review was written in 2014. I am going to make it again being that the last time I made it everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making this one for over 10 years. Its the only one I'll make. I never liked Eggnog ever in my entire life, that is until I tried this one. Its exceptional. I make it for gifts and everyone loves it. I also make a gingerbread eggnog cheesecake with this egg nog, and its to die for. Will be making my first batch of the next weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As the name states, it's amazing! I always make it around the holidays and it a hit with everyone who tries it, even people who question a drink with eggs in it. I've been making it for years now, and always have requests to bring to holiday parties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this recipe! Made with our farm fresh eggs and Jersey milk. Did not add alcohol so that we can drink at breakfast. Super easy and Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeLynnda Mixon"
},
"reviewBody": "Me and my grandson made this eggnog of course without the alcohol and it turned out delicious five stars I must say when you are doing the alcohol do it to your own personal taste of how strong you want it and it turns out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved it. I used brown sugar added nutmeg during step 1 and added use some traditional Barbadian Rum. This is now part of the Langdon Family Christmas Traditions. It is so good doing it in mid -January."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarra Isabel"
},
"reviewBody": "I love this recipe. I've been making in for 6 years. My family and friends are Colombian and Latin American. It was never really a hit until this year. My husband, who has never liked eggnog (nor any Colombian versions of creamy eggy drinks) was impressed. The one thing I did differently this year was I didn't add the nutmeg (by accident). Just cinnamon and a few extra cloves. The other key is using a hand mixer for the yolks and sugar; make sure their nice and cream coloured (not a strong yellow colour) when your done mixing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a BIG mistake I think.... I made mine a few hours ago and just realized I used the whole eggs and not just the yokes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naciabonilla"
},
"reviewBody": "My husband adores it when I make this for him around the holidays - thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Falcon"
},
"reviewBody": "Made for the first time. Replaced milk and cream with lactose-free products. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CassandraMoon"
},
"reviewBody": "***Too much Rum*** this coming from someone who used to drink rum all the time. The recipe was flawless other than the overwhelming taste if rum. The next time I make This I will Make it with half the amount of rum the recipe calls for. Other than the pure rum taste the consistency was perfect, smooth and creamy. I wish I would Have read the other reviews about the liquor prior to making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "putrasalju"
},
"reviewBody": "By far the best eggnog recipe I found. Really easy too! My only suggestion would be to keep the fire really low when you have added the eggs....the first time I made this years ago, it had scrambled eggs at the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blumoonlight31"
},
"reviewBody": "One of our favorite holiday traditions! We always follow the recipe exactly and it always turns out great! This year we bought glass milk jars to make Christmas presents for our friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added a star anise and five allspice berries to the milk mixture and cut the rum back to 1.5 cups. I think I could've taken it further, but all-in-all it's pretty amazing so far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I've made this a couple of times and it has been a HUGE HIT with my crew. Absolutely love it! Getting ready to make it again this Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkhntrjgb9"
},
"reviewBody": "I have been making this for nearly 5 years. Over the years, I have tweaked it somewhat to my liking. I have received so many compliments that my family and friends start asking me in October when I will be making more. Some actually bring over there own mason jars. I always make it virgin then add Meyer’s Rum when serving. It truly is “amazing”!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shaybelleabc123"
},
"reviewBody": "This is the best eggnog! Yes, it’s boozy. But we love it and make it every Christmas season!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeni W"
},
"reviewBody": "When they called it Amazingly Good Eggnog, they weren’t kidding. I’ve made it many times. I make it without the alcohol, and let each person add their own booze if desired. My personal favorite booze for it is brandy, but it’s perfectly wonderful without a tipple, too.\n\nSometimes I failed, sometimes I succeeded. Whenever I failed, it was always in the overcooking of the combined milk\nMoisture and the sugar/egg mixture and cooking it for 3 minutes or until\nIt starts to thicken. I waited much longer until it was noticeably thick. That’s a mistake. Just cook and stir for the 3 minutes, as stated in the recipe, and remove it from the heat. It will continue to thicken as it cools. Once I realized that, all was well.\n\nIf you do mess up and it gets over cooked and lumpy, no, you cannot use the mix to make massive quantities of French toast. I tried. It doesn’t work that way. Sorry. LFMF\n\nYou can, however, add successful eggnog to vanilla ice cream in a blender and make a decadent eggnog shake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dark_shadow_wolf92"
},
"reviewBody": "I decided to use my stand mixer to constantly stir as i tempered the eggs, overkill maybe but hey it works.\nI added less then half of the rum (as i didn't need the alcohol content quite that high and used one of my favourite coffee rums instead to add a little extra flavor.\nBut the recipe is solid otherwise"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tazchee"
},
"reviewBody": "THE BEST eggnog I’ve ever had. Even my husband, who typically doesn’t like eggnog, loves it. We adjusted by reducing the cloves to four (4); it was just too much cloves for us. My sister thinks it’s strong; she likes about half the alcohol. Tastes great non-alcoholic as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YayaG"
},
"reviewBody": "Oh my gosh, this drink is literally addicting. I saw the review and questioned how good it really is... but then after reading so many reviews realized almost everyone said how people stated it’s the best EggNog ever. And then I thought to myself if that’s really the case, somebody at our small New Year’s Eve celebration will say it... I waited and low and behold, my friend ends up saying it’s a better/best EggNog he’s had. Lol. \n\nI also want to say I never write reviews, but told myself if someone makes that statement, I would. So here I am. It definitely is now my go to holiday recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pilotamd"
},
"reviewBody": "I used 6 yolks and 3 whole eggs. It was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith B."
},
"reviewBody": "This is by far the best recipe I've made. I always double it, and it comes out perfect everytime. There are a few things to pay attention to. I always beat the yolks and suger with a mixer until it turns the consistency of brownie batter. When tempering, add about a third of the hot milk to the yolks a ladle at a time stirring constantly. Then add it back to the pot. I've never had eggs cook or curdle. Heat to 170 degrees, and it's done. This is the same way I make ice cream. Strain and transfer to your contain, then chill overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cfgenie"
},
"reviewBody": "without rum and it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna Gorny"
},
"reviewBody": "I made it as written, it’s a tradition in our family at Christmas. I let my guests choose whether or not to add the rum though. I also use whipping cream, and add that folded into the cooled egg nogg instead of light cream. Grate fresh nutmeg over it and it’s wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "akaAlfie"
},
"reviewBody": "Good recipe, make it every year. Step 2 should really mention not to let your temp rise above 160 during that 3 minute cook’ or your mixture will solidify"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rumbleblox"
},
"reviewBody": "WOW! So easy and so delicious!!! My husband loves this. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Michelle Mohamed"
},
"reviewBody": "I thought this eggnog was great! I didn't change anything about it, except add a little extra nutmeg for my own tastes. Additionally, I let guests add the rum to their own liking. \n\nYou'll see a lot of folks in the reviews saying to decrease the sugar. If you're going to drink this as a non-alcoholic drink, I would agree to do that, because it is a little on the sweet side. However, when it's paired with rum, I felt that it was the perfect amount of sweetness to offset the rum's bite. \n\nenjoy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dakota"
},
"reviewBody": "Best Eggnog ever!!! We tried a couple different liquors and found that Jameson was by far the best combination. Also, I had people telling me up and down how much they hate egg nog, I gave them a taste of this recipe and they were suddenly egg nog lovers! Thank you so much for this delicious homemade recipe! Will definitely be using for the rest of my days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amcavalieri"
},
"reviewBody": "I am diabetic so I substituted Splenda for the sugar and left out the rum, but will add it when we serve it to the adults. Some of the family don't like cloves so I left them out. I will use it again since I can cook it . I want to be careful about the possibility of salmonella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanelle"
},
"reviewBody": "Great recipe! Very flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSimmons55"
},
"reviewBody": "Sooooo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Talana9"
},
"reviewBody": "I have made this 3 times now. All three times I made it rum free. First time I messed it up somehow (tasted incredible but texture was not right). Second time was amazing! Third time was perfectly amazing again! The third time I added rum after it was cooked and chilled so I can get the right amount to my taste. Mixed very well. Would recommend mixing rum after or using much much less rum than recipe calls for. I love this recipe so much (and so does everyone that tries it) that I will NEVER buy store bought again. My kids can't wait until I make some this year and neither can I!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trizo"
},
"reviewBody": "Delicious! I make it every year without alcohol. Guests add their own spiced rum or bourbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Brubaker"
},
"reviewBody": "I use whole milk and heavy whipping cream...mmmm... \n\nMy friends keep asking for me to make more...Thinking about trying to make it into ice cream next."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Palensky"
},
"reviewBody": "It is now our tradition!!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookardu"
},
"reviewBody": "Love this recipe! I started adding amaretto to my glass of eggnog during the holidays! I miss It so much that I have to have this all year round lol! The only thing I used different was heavy cream instead of light cream! Still taste great and not too thick. Not as sweet as the store bought, which I like too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Maxey Goris"
},
"reviewBody": "So rich and full of lovely spice! Made many many times. Instead of rum just a splash of rumchata is nice. Makes an excellent party gift or Christmas gift poured into a gallon mason jar and festooned with a bow. Will win over diehard eggnog skeptics."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKLOVER69"
},
"reviewBody": "I just love it!! excellently delicious eggnog!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Ulrich Booker"
},
"reviewBody": "It is definitely delicious!! I did use whole milk, and the second batch I added 1 cup of brandy in addition to the rum, which I used spiced rum... I made the first batch for Christmas gifts. They called me to tell me how good it was after they gave it a taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Cruz"
},
"reviewBody": "I absolutely loved it. I’m away from home and this tastes very similar to the egg nog from home. I didn’t add any rum because I have a toddler. I recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimyco Trules (solsister8)"
},
"reviewBody": "I love this recipe. I make it every holiday season. The only thing that I do differently is that I whip the egg whites and fold them into the eggnog. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Perry"
},
"reviewBody": "Simply amazing. We didn’t add the liquor until after (by the cup) as some people drink and some don’t. It was sooooo tasty and actually better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Perry"
},
"reviewBody": "Simply amazing. We didn’t add the liquor until after (by the cup) as some people drink and some don’t. It was sooooo tasty and actually better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "*gwhiz*"
},
"reviewBody": "I love eggnog and this was really good. Everyone loved it. I kept everything the same except I used 1 cup of light rum and one cup of bourbon. It was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne Doe"
},
"reviewBody": "This recipe has become a holiday tradition in our house. It’s important to make a day in advance, which will give the spices time to infuse into the eggnog. We prefer it a bit less “eggy,” so I reduce the eggs to 7-8. We find it very sweet when made per recipe, so reduce sugar by 1/2, using 3/4 cup. It’s still plenty sweet. Also, I add the alcohol to individual servings, so those who don’t imbibe can enjoy. Great with honey flavored Jack Daniels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gibsons"
},
"reviewBody": "Taste great but It should be thicker. I messed up so maybe that's why, I didn't let it cool long enough, (maybe 10min, on the counter and not in the fridge) before adding the remainder ingredients, unless it's runny for another reason."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "007Esquire"
},
"reviewBody": "Bourbon or Rye instead of Rum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shootingal"
},
"reviewBody": "This is fantastic. Use Captain Morgan's Spiced Rum to hide the alcohol taste. I added 3 whole cups and barely got a tingle. I wanted to add more but also didnt want to inadvertantly get Grandma drunk. I also used half and half instead of \"light cream\" cause I didnt see such a thing at the store. I will definitely make this again. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Karen Jenkins"
},
"reviewBody": "Its delicious! The only thing I didn't care for was it got super thick once chilled. Had to add lots of milk to loosen. It was still good though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Rutherford"
},
"reviewBody": "I halved the recipe and made a few substitutions so I didn’t have to go to the store...I used 1/4 teaspoon ground cloves instead of whole cloves (I did still strain as instructed, don’t skip this step because it catches any curdled milk...it wasn’t much but I like a smooth texture), a 1/3 teaspoon of cinnamon instead of 1/2 (since allspice contains cinnamon), half and half instead of light cream, and 1/4 teaspoon Allspice instead of nutmeg. I used Captain Morgan spiced rum and lastly, peaked the egg whites with 1 tbspn of sugar and folded it into the nog after chilling for a few minutes because I like it frothy!\nOMG...YUMMY!! ??\nI made this for a friend but ended up drinking an entire glass after my initial taste test. I’m delivering it tomorrow!! \nPlease note...it is rather spikey but oh so good!! I don’t plan to operate heavy equipment after drinking it...??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "infinity6305"
},
"reviewBody": "I make this every Christmas. I mostly follow the directions, except I couldn't find light cream so I used half and half. And when I make the adult version, I use 3/4 cup each of dark rum, brandy, and kahluah. It is very delicious whether it's virgin, or not. Especially if you make it a day or 2 in advance and let it sit in the fridge and marinate. My husband, who is ridiculously picky with foods and beverages cuz he thinks he's a chef, absolutely loves this and won't even drink store bought eggnog anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maggie Williams"
},
"reviewBody": "This would be great with or without alcohol. Definitely only use half of what’s called for though. I like my booziness, but that 2.5c would be overwhelming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren Storm"
},
"reviewBody": "This eggnog is deliciously creamy. I beat up the egg whites for extra foam which worked out great. I also added fresh ground nutmeg which gives it a scent so reminiscent of the holidays. It was a little sweet, and next time I would use less sugar. I didn't add the rum and maybe that would have cut down on the sweetness. Overall, a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nell Hinkelman"
},
"reviewBody": "I didn't follow the time suggestions for cooking the milk and egg mix. Instead, I slowly cooked the milk to 160°F (not boiling), then slowly added it to my egg mix with my stand mixer running on medium. Once all in, I put the mix back into my pan and cooked it to 160-165°F while whisking the mix. I found no issues with any burning milk or curdling eggs in the two batches I made AND I have the peace of mind that it will be safe for consumption. So far, so good! I made this tonight (Christmas Eve) for tomorrow (Christmas). I made a spiked batch and a virgin batch. We sampled each over ice before putting them to bed for rest. Let me say... the flavor is amazing and the aroma is out-of-this-world. My husband who does not like rum and doesn't really like eggnog said it was good! I could taste the rum a little too much, but when I added some whipped cream as a topper it cut through the sharp alcohol taste and was dangerously delicious (had hubby sample it after figuring that out). I funneled my mixes into some empty milk jugs and tucked them in. I can't wait to see how the final product turns out. Barring a complete collapse overnight, I am giving this 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystle Wiles"
},
"reviewBody": "The hit of the holidays with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "black_eclipse"
},
"reviewBody": "I will never have store bought eggnog again. Such an easy recipe and delicious! Second time around I didn't use quite as much sugar but that's just my preference. I also had it without alcohol and I actually liked it better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jesse Edw"
},
"reviewBody": "I have made this eggnog several times and I highly recommend cutting the sugar. ~2/3rd of a cup. \nA lot of people are complaining about having the milk curdle (gross). Milk curdles because of a drop in PH, do not add the rum until after the cream and do not skimp on the fat, 3.25% milk and minimum 15% cream.\nEnjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colette Klaasen"
},
"reviewBody": "The recipe is quick easy and tastes like christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vader"
},
"reviewBody": "Love this! I don’t add the rum and just let individuals add the rum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray"
},
"reviewBody": "This was my first time making eggnog so I decided to halve the recipe just incase I didn't like it. I also only added 1/2 cup of rum as most of the negative reviews were about the rum being too much. \n\nThe rum taste was just enough for me personally although my husband added more to his. We really enjoyed it and will definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "omg SO Good! no curdling.. I used half and half and milk as I didn't have light cream . I doubled the recipe and added a bit less sugar as had been suggested but it would have been fine as written. I added enough rum to make it last a bit longer than the 4-5 days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent Grung"
},
"reviewBody": "This will be my third year in a row making a huge batch to pass out as gifts. Everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Howard Nelson"
},
"reviewBody": "5th time I’ve made this recipe. Yes I’ll make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amin Parvaresh"
},
"reviewBody": "I've made it and it's great, however, it is overly sweet for my taste.\nI have even used less sugar than what the recipe called for, but it was still too sweet.\nBut other than that, it is fluffy and great, kind of like a milkshake but with much more air in it, and it was my first time that I've ever had eggnog, overall, I enjoyed it and I think I will make it again, but with a few changes, since it is winter, I think I will try to serve it hot, not sure how that would go, we'll see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Reiner"
},
"reviewBody": "This recipe is devine! I used Jamieson Irish whiskey instead of rum but I'm sure it's good with either of those. At the end of recipe I replaced 1tsp of vanilla with pure almond extract \nwhich added an extra special flavor. It's so good, like a dessert! A big hit at the party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Robertsson"
},
"reviewBody": "Loved it - 1/2 the rum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Corrin Phillips"
},
"reviewBody": "The base recipe is solid, this produces a thick creamy eggnog. I found the spices off: the cinnamon overpowers and the nutmeg underwhelmed. Try steeping several cinnamon sticks, a few cloves and a crushed nutmeg in the hot milk for an hour before proceeding, the flavor deepens, becoming more balanced. Reduce the sugar to 1 cup. I prefer mine with bourbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Hoffman Lewandowski"
},
"reviewBody": "Absolutely perfect! First time I’ve ever made eggnog and this turned out wonderful. The flavors are spot on. Better than store bought. I omitted the alcohol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momto4under5"
},
"reviewBody": "This is the good stuff! It took me a bit to get I right but was totally worth it! Will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeSires"
},
"reviewBody": "So I made this 2 nights in a row!!! I DID NOT put 2 1/2 cups of rum I only did 2 cups and am VERY satisfied!!! Amazing amazing although I’d wish it was a tad bit thicker but as far as taste 2 thumbs up!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Harrell"
},
"reviewBody": "I made at least ten batches of this last year to serve to friends and neighbors that dropped by and everyone loved it. Each batch was a bit different depending on what was still in stock at the grocer, heavy cream in some, half &amp; half in others, milk to fill in the gaps and amazingly it adapted well each time. Some got rum, some took bourbon but all seemed happy to have it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "I loved this! And so did my family, especially my sister who is very picky with her eggnog lol. I didn't have enough rum extract to substitute for the real rum so it didn't have as much flavor, but OMG add the rum! It makes all the difference. I will definitely be making this again! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renato"
},
"reviewBody": "Awesome sauce recipe. Definitely worth it. Just make sure to add little by little the rum (too much of it for my taste)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi"
},
"reviewBody": "Holy moly!!! This is soooooo good!!! I almost left out the cloves, but I wanted to try the true recipe. YUM!!! It’s perfect! I did substitute one cup of whiskey for one cup of rum. I’m saving this recipe forever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "musicmom"
},
"reviewBody": "Followed the recipe except without the rum. Used Rum flavoring. I felt the flavor was okay but not good enough to justify the amount of work to make it instead of just buying a well known brand at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra Prasolova"
},
"reviewBody": "Amazing balanced taste! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annjell"
},
"reviewBody": "I made this today. Everything went perfectly until the last step, and then I noticed the egg was starting to curdle. I followed someone else's tip and pulled it off the stove-top, put over a bowl of ice and stirred with a whisk like crazy. It saved it! I left out the rum so people can add it to their own liking. It tastes divine! Rich and flavorful, smooth and delicious. Thank you for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colin Netzley"
},
"reviewBody": "This recipe worked really well. I was low on rum, so only added 1 1/2 cups and accidentally grabbed heavy cream instead of light. It all ended up working perfectly because you had to mix it with a bit of milk to thin it out (stretched it out) and the amount of rum meant you got a hint, but it wasn’t too strong. Making it again tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jfold"
},
"reviewBody": "Love this recipe! I’ve used it the last couple years, and it produces consistently great eggnog. I often cut the recipe in half for smaller gatherings and have been using a 50/50 combination of cognac and dark rum for a smoother flavor than rum alone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yadontneed2no"
},
"reviewBody": "I used evaporated (Carnation) milk instead of regular milk and added ground ginger as well. Best eggnog I’ve ever had in my life!!! Something magical happens when you refrigerate it overnight. It doesn’t taste the same but it’s so amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas"
},
"reviewBody": "It was delicious and not too difficult to make. I appreciated having the video, especially for the warning to not put all of the hot milk mixture in with the eggs but to add it slowly.\n\nThanks so much!!! It was a big hit at Christmas dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keawa"
},
"reviewBody": "Honestly this is one recipe perfect as stated. One caveat - if you aren’t experienced enough to bring milk to a a boil in a pan (I’m not) use a double boiler method to prevent burning. This is creamy and only gets better on day 2 thru ... kidding it doesn’t last past day 2 even when I hide it overnight when I first make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Haimraj"
},
"reviewBody": "It taste great, first time I made eggnog.... it curdle so I follow a reviewer suggestion of blending it till it smooth out and also I use one cup sugar suggest by another reviewer. Left out the rum. Will definitely make again.\nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkerran"
},
"reviewBody": ". It did not turn out exactly like I had expected it to. Also, I didn't have any whole cloves. Next time I think I'll try it with brandy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Smith"
},
"reviewBody": "This was simple to follow and turned out great! If you aren't a big alcohol drinker I would definitely go easier on the alcohol. Maybe 75% of what the recipe calls for. I loved it. However, instead of using light rum, I used Kraken Spiced Rum. It tasted great with it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/57028/amazingly-good-eggnog/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/77/drinks/",
"name": "Drinks Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/141/drinks/eggnog/",
"name": "Eggnog Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/57028/amazingly-good-eggnog/",
"name": "Amazingly Good Eggnog"
}
}
]
}
}
, "about": [
]
}
]