				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Amazing Lemon Scones"
,"datePublished": "2020-06-18T23:51:46.000-04:00"
,"dateModified": "2022-09-08T09:54:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ANGELSTAR"
,"url": "https://www.allrecipes.com/cook/angelstar"
}
]
,"description": "These lemon scones with a simple lemon glaze are deliciously sweet, rich, and buttery. Sure to be a hit at your next brunch or afternoon tea."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fCQmZrtUArCmm2cUHmnhQT-h9sU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1445936-cade8c7f68e94ac1adcab3e0f639b4f4.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Amazing Lemon Scones"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "303"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "446 kcal"
,"carbohydrateContent": "62 g"
,"cholesterolContent": "54 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "488 mg"
,"sugarContent": "32 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"3 cups all-purpose flour",
"0.33333334326744 cup white sugar",
"1.5 teaspoons baking powder",
"1.5 teaspoons baking soda",
"0.33333334326744 teaspoon salt",
"0.75 cup cold butter, cut into pieces",
"9 tablespoons milk",
"3 tablespoons lemon juice",
"2.5 teaspoons lemon zest",
"1.5 teaspoons vinegar",
"2 cups confectioners' sugar",
"0.33333334326744 cup butter, melted",
"2.5 tablespoons lemon juice",
"0.5 teaspoon vanilla extract",
"2 tablespoons water, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make the scones: Whisk flour, sugar, baking powder, baking soda, and salt together in a large bowl. Cut in cold butter with 2 knives or a pastry blender until mixture resembles coarse crumbs. Whisk milk, lemon juice, lemon zest, and vinegar in a small bowl; stir into flour mixture until dough is moistened."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out onto a lightly floured surface and knead briefly, 5 or 6 turns. Pat or roll dough out into a 1-inch-thick round. Cut into 10 wedge-shaped pieces; arrange 1 inch apart on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until bottom edges are golden brown, 12 to 15 minutes. Cool scones on a wire rack for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make the glaze: Stir confectioners&#39; sugar, melted butter, lemon juice, and vanilla together in a bowl until smooth. Stir water into sugar mixture, 1 tablespoon at a time, to make a glaze; drizzle glaze over warm scones."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thea Marwinske Potts"
},
"reviewBody": "Very simple to make and absolutely delicious!!! My new go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KUndermoon"
},
"reviewBody": "Added Crasin/nut mix -1/3 cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sherikwong"
},
"reviewBody": "Was too dry and crumbly. The dough wouldn’t hold together even before baking. I added more lemon juice than the recipe called for and I didn’t even taste it. Just tasted like butter and flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have always wanted to make scones but was scared for some reason. These are totally easy to make and they came out delicious! I used my blender/food processor to combine everything and the dough was perfect. I also cut the frosting in half and it was perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "They are Amazing! Super easy. Light flaky. Followed directions. I just added tiny extra milk as needed to moisten the dough. Glaze just tart enough. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SewHappybyChristie Petersen"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nocturnal"
},
"reviewBody": "These are wonderful. I would suggest weighing your flour if you find these dry…1 cup equals 120 gm. They are perfection when you weigh your flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made these several times and everyone loves them. However I always had to add more milk in order to be able to have the dough not be too crumbly. And for the glaze I just use the lemon juice and the butter but not nearly that much icing sugar. Lots of requests for this recipe from friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeminiMommy"
},
"reviewBody": "The scones themselves are amazing! (I highly recommend using a food processor for the dough it is SO much easier!) I have to admit that I had no idea that butter could be used in a glaze and I am never not using it again! Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Kuypers"
},
"reviewBody": "Didn’t change a thing. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were delicious, even though I didn’t get a single compliment, all were gone the next morning. The things I changed, triple sifted the dry ingredients together. I added a Tablespoon of water when kneading the dough, as it seemed a little dry. Preheated the Oven after I had them ready to go in, to give a little reaction time. Also I halved the Glaze and added a quarter teaspoon of Lemon Zest to the Glaze. Just the right amount of moistness and not at all falling apart crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this recipe. I used a dough hook for the final mix instead of kneading. I had a lot of extra frosting, so would decrease the amounts, using 1 1/2 cups confectioners sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenikasheldon"
},
"reviewBody": "Delicious recipe...no dry scones here! Based off previous suggestions, I used my food processor to mix in the butter, then added the liquid through the chute, and the dough came together beautifully. I also only made 1/2 the icing, which was plenty. The only other modification was that I added a little extra lemon zest to the icing. Will be making these again, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jolumo"
},
"reviewBody": "My glaze curdled, what is the cause? Hot butter maybe? Did I mix too much (my icing sugar was a bit old and lumpy). \n\nI added raspberries and hazelnuts, so I can’t really comment on how perfect the recipe is, since I had to wing it a bit when adding milk (to compensate for moisture from berries)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elena Nasser"
},
"reviewBody": "The recipe was ok. I found the lemon flavor from the scone dough alone was nearly non existent. If I made this again I would definitely double the lemon juice in the dough. The 13.5 tbsp of liquid was nowhere near enough to form any sort of workable dough. I probably added 1/4 more milk to get it moist, but not too moist and still crumbly. Cook time was also off for me. I cooked mine till about 22 minutes. The dough did rise quite nicely. I would make again just with a few fine tune adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ali Wicks-Lim"
},
"reviewBody": "We love this recipe. We follow it exactly as written except that we find we only need half of the glaze mixture and even that is a lot. Also, even though we make ten scones an inch thick as the recipe calls for it always seems to take at least 18-19 minutes for them to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "Easy to put together! Delicious! Very light. I baked them on a pizza stone which made them brown nicely on the bottom.\nCould easily substitute orange juice and zest.\nI have made these twice. The first time I made one round and cut it into eight scones. The second time I made two small rounds and cut them each into six scones which we liked much better for portion control."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish421"
},
"reviewBody": "Yummy! After reading reviews, I made only half the quantity of the frosting but used the full amount of lemon juice, mmmmm! It was more than enough to cover the scones generously and puddle around them on the baking tray. I will be baking and sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Peck"
},
"reviewBody": "Absolutely love these! I've made these a few times and, like other comments have said, thought they needed more liquid. This time I didn't add more liquid and made it exactly as the recipe states. It will look very dry until you turn it out onto a floured surface, but it all comes together. This was the best batch of the ones I have made, so I would really recommend following the recipe exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Pilver"
},
"reviewBody": "These were outstanding! I did have to add a couple more tablespoons of milk. I will definitely being making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAM"
},
"reviewBody": "Made them Saturday. Delightful breakfast Sunday morning, now savoring one a day through the week.\nI snuck 1 tspn vanilla extract into the milk portion. The dough IS scary dry, but stay with it, you'll be fine (I needed no flour to knead). Really nice glaze, too. Since I don't keep cream around, this will become my keeper for scones. Looking forward to trying different flavors, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Geier"
},
"reviewBody": "Like another reviewer said there was not enough liquid. I added about 2 tbsp more of lemon juice and poured in milk slowly and cautiously into my mixer until a slightly wet consistency was accomplished. They tasted amazing!! I also used the lemon frosting suggested by another reviewer which was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nellie Kennick"
},
"reviewBody": "I absolutely LOVE this recipe! The scones are so soft and full of wonderful lemon flavor. My family devoured them! Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brianna yenne"
},
"reviewBody": "Turned out delish. This will be my go to recipe now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WayLady"
},
"reviewBody": "These were great! Melt in your mouth yummy! I added a half tsp more lemon juice and some dried cranberries. Definitely will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenKT"
},
"reviewBody": "The glaze makes twice what you need, but overall a lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Hill"
},
"reviewBody": "THIS RECIPE IS MY ABSOLUTE FAVORITE!!!! I’ve been making it for about a year and a half and everyone eats it up! I go with “bigger is better” so I do 8 big scones The consistency and flavor are always on point! I highly recommend this to anyone who loves lemon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannie Mosley- Brusa"
},
"reviewBody": "Love this recipe! Since my husband is prediabetic I substituted the sugar in the scone batter for Stevia and it worked just fine. The recipe calls for 9 tablespoons of milk. Why not just say 1/2 milk plus 1 tablespoon (8 tablespoons = 1/2 cup)? If you did not know this it is kind of ridiculous to measure out 9 tablespoons! I was questioning vinegar in the frosting but I love the tanginess of the lemon juice and vinegar. They turned out moist. A favorite recipe of mine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt"
},
"reviewBody": "These are great! I made a half batch with everything halved except for the lemon juice. Went a little hot on that for the scones and in the frosting for extra lemony flavors. \n\nThe key is cold butter. I used my hands and really got into the drys to mix it. Smash it up and sprinkle the ball back into the bowl until you can squeeze any part of the mixture and it stick together. Then you know all the butter is dispersed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "BEST SCONES EVER! I've made these at least a half of a dozen times now and EVERYONE loves them, including my boyfriend and my best friend, neither of whom \"like sweets.\" I always use almond milk, 1/2tsp instead of 1/3tsp of salt, and a little extra lemon zest in the icing. I made them vegan with vegan butter once and you could hardly tell the difference! I've never left a review on any recipe before, but you HAVE TO TRY THESE!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JNRey"
},
"reviewBody": "Delicious! Soft and moist. My family lived them and asked me to make another batch right away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jane denali"
},
"reviewBody": "10/10 amazing recipe! This was my first attempt at baking scones and it turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mare"
},
"reviewBody": "I LOVE lemon scones and can never resist them when I'm at a good bakery, but these were seriously the best I've had. Never made scones before and the whole \"cutting in butter\" concept is tricky, but I fumbled along anyway and these came out great. I had to bake them a bit longer than 15 min., and added a touch more lemon juice to the dough, and then an extra tablespoon or more of zest to the frosting. Perfection! \nThank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taza Mummsie"
},
"reviewBody": "I added extra milk/water when i was making the dough in the bowl, turned out great. Making them again today because they lasted all of 2 days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mona"
},
"reviewBody": "Love, love, love these lemon scones. Remember to not knead dough too long because your scone will become hockey pucks! Lol... you can also use self-rising flour instead of AllPurpose if you don't have All Purpose. These scones are wonderful with your coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "toomanycooks"
},
"reviewBody": "The recipe is rather more fussy and involved than most scone recipes I've tried, and the lemon flavor in the scones themselves is decidedly mild. Like other reviewers, I too had to add extra liquid to make the dough have a usable consistency. Tasty enough and with a pretty nice texture, but if you're looking for a very lemony scone, this isn't it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DODODIGGS"
},
"reviewBody": "I thought these were great. I did make a simple glaze instead of the thicker icing just because that is my preference but they were tender and delicious! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Gallegos"
},
"reviewBody": "never in my wildest dreams would I have made these, this recipe was so simple to follow and was easy to make, every one loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Klingensmith Sewell"
},
"reviewBody": "These were so good and I'm glad I used this recipe. I used the food processor to cut in the butter but I didn't make any other changes and the scones were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Imsmackey"
},
"reviewBody": "Delicious! I followed directions exactly but had WAY too much icing, literally coated each scone and 1 cup left. Next time I will 1/2 the icing. I had to knead the dough in the bowl after cutting in butter to get it well blended, I will try the tip about using a food processor in the future. Otherwise, recipe is easy and delicious as written. These are party/guest worthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allyson"
},
"reviewBody": "Fairly easy recipe. The hardest part was zesting the lemon. If you have a food processor available, I recommend using it. I hand mixed the dough and it ended up being crumbly. I added extra milk and lemon juice to the mixture to add moisture. Turned out rather well for my first attempt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Myers"
},
"reviewBody": "Yummy goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anke Shep"
},
"reviewBody": "Didn’t brown very well. Flavor was subtle—not too sweet. Perfect for the adults in the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Orme-Latreille"
},
"reviewBody": "This was such an easy recipe to follow and make. I did add extra lemon zest (we use organic lemons as I would not want pesticide drenched lemon zest) to the lemon sugar drizzle. Fantastic and I will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melissa Cortes"
},
"reviewBody": "The were very dry and mostly tasted like flour. Too little liquid for 3 cups of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michael bonney"
},
"reviewBody": "Great recipe— also works well for lemon blueberry scones as in the photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fatty eater"
},
"reviewBody": "Taste so good! Everyone in my family love it so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessamyn Anderson"
},
"reviewBody": "I’ve been making these for years, they are by far my favorite pastries to make, they’re very easy and they taste amazing. Overtime I’ve learned that I don’t need to make nearly as much icing so I cut that part in half I also don’t add water to it unless it starts to dry out as I’m drizzling because it spreads a lot when it’s too wet. Scones are a bit of a dryer pastry, so the dough is very dry so you need to work it together when you kneed it before rolling it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marco"
},
"reviewBody": "Surprisingly moist scones! Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "A. N. Davis"
},
"reviewBody": "I love scones, however for some reason I always thought they were difficult to make... until I looked up the recipes online and realized they weren't much more complex than the biscuits I've been baking for my husband.\nThis is the recipe I tried when I decided to make my first batch of scones. I had some lemons I needed to use up, so it was perfect.\nThe reason I am not giving this recipe five stars is because I noticed a few problems that would prevent a less experienced baker from having success.\nFirstly the ingredient list is a bit of a mess. Why would I measure 9 spoons of milk, if I can just pour half a cup? Same goes for butter. It's way easier to cut 12 tablespoons (they come pre-measured in sticks where I'm from) than to try and cram ice cold butter into a cup... You get the idea.\nSecondly, if we are making scones, not sweet biscuits, the recipe should call for cream and eggs. This is not a complaint, as I don't always have those items on hand, just an observation.\nThirdly, that is way too much glaze for a batch of scones. Cut the ingredient amounts in half and you'll have plenty.\nLastly, the baking temperature and time are completely wrong. This is a flaky pastry which requires high heat and short baking time. 400 to 425 F for about 10-13 minutes is far more appropriate. I tried baking it at the temperature provided and it took them half an hour, plus some time under a broiler just to get cooked through and golden brown. \nAll in all, I loved the finished product, afte"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asanda"
},
"reviewBody": "I did not have baking soda but still they came out perfect. Delicious, definately making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa"
},
"reviewBody": "These stones were amazing! The texture was spot on. The whole family enjoyed them. I made them per the recipe. The only change I made was with the glaze. Instead of adding water to thin it I added additional lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Allen White"
},
"reviewBody": "For the first time ever, actually got it right on the first try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Villadiego"
},
"reviewBody": "These were amazing! I'm not a huge fan of lemon desserts but my husband is so I decided to make these. The lemon flavor was strong enough that my husband loved it but not so strong that I didn't. I definitely recommend this recipe. I used fresh lemon juice for the icing, but pre-squeezed for the batter and I think that was for the best as the icing has a much stronger lemon flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNN39SCAF"
},
"reviewBody": "I make them vegan and they are absolutely delicious!!! I've made them multiple times and my entire family loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Court"
},
"reviewBody": "I would definitely make this recipe again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Not a chef"
},
"reviewBody": "This is a great, easy recipe. We made a vegan version using soy milk instead of cows milk and using Earth Balance vegan butter. They came out great. We used home grown lemons and the scones were wonderful. We may make an orange version too. Definitely a new favorite recipe. Thanks for posting it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia Earnest"
},
"reviewBody": "Amazing! Family scarfed them down!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah"
},
"reviewBody": "This is my favorite scone recipe! I added about double the zest to the dough as well as some to the frosting for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Milstein"
},
"reviewBody": "Yum! I made just a few adjustments for my tastes. Omitted the vinegar, used 6 tablespoons of lemon and reduced milk th 8.5 tablespoons. Skipped the icing to reduce the sweetness. When making these for guests I'll add on the icing. I thought they were delicious without!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Rivas"
},
"reviewBody": "My cousin made these for us and shared the recipe. As soon we got home, I made them. Amazing is right!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dennis Hoaglin"
},
"reviewBody": "You could halve the glaze recipe and still have plenty. Next time I'll add some frozen blueberries. Nice lemony flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Peggy Streetman"
},
"reviewBody": "TOO Dry....\nOnly made up 1/2 the topping mix and even with that I had extra!\nMaybe I was supposed to drench the scones in the topping to offset the scone dryness. ;)\n\nWon't make again......next..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Delicious! Melted in my mouth. I’d recommend freezing the butter, not just cold. They spread a little. And 1/2 the icing recipe would have been plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Domzalski"
},
"reviewBody": "Perfect scones! Made for Christmas morning. Makes a lot of icing, so will cut the amount in half next time I make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "unapologetically domestic"
},
"reviewBody": "Wonderful recipe. Have made it many times. The scones can be cut smaller and they are delicious even with no glaze. you’ll have extra glaze the recipe makes a lot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell"
},
"reviewBody": "This is a delicious recipe. It's easier to use the food processor. Just pulse til the dough lumps together. Also 9 tbsps of milk is just a half a cup so save some time by using a measuring cup instead of a tbsp. The butter amount comes out to a stick and a half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Caruso"
},
"reviewBody": "Used kefir and sour cream to replace milk. 2 lemons total with zest. Less than 1 cup confectioners for the glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "23421"
},
"reviewBody": "I think I needed to bake them a little longer. Turned out to be absolutely delish. Served with Canadian bacon to balance carbs. Added lemon zest to lemon glaze for extra lemon flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elsiejay"
},
"reviewBody": "Yeah, these are great!! Like a few others, mine were too dry to form into a ball, but with the addition of a couple tablespoons of cream the consistency was perfect, and they are really wonderful. I used brown sugar just because, and two large limes because living in Guatemala we rarely see good lemons. I will add the juice of another the next times, and there will be many next times. I didn't add the glaze. They are really terrific the next day because the zest oils and flavors have more time to develop. Fresh they were crispy outside and soft inside. This afternoon they are even better. Thanks for a great addition to my recipe box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "Five stars for flavor but two for the dough recipe. I have been making scones for 20 years. This dough is way to dry as the recipe is written, which is a result of the wet-to-dry ingredient ratio being off. I had to add an additional 2T milk to get it to hold together and as a result ended up overworking the dough. For those who describe the scones as cake-like in texture, it is because the dough is overworked, which results in a stronger gluten network (and thus cake texture instead of crumbles). I will probably not make this again, as it will take some trial and error to arrive at the right dry/wet ratio. Additionally, I thought the vanilla in the glaze competed with the lemon. I would pick just one flavor for the glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beauty"
},
"reviewBody": "wanted to make these to try out before I have guest staying, these are perfect for am coffee, left overs I just pop-em in the micro for 10 sec. &amp; still tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elli Prickett"
},
"reviewBody": "Very yummy. Would make again for sure. Extremely light and fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Andrews Burpee"
},
"reviewBody": "Excellent lemon flavor. I decided to add blueberries to the recipe. Made a more flavorful scone and moister. It would also be nice excellent with poppyseeds in it.\n I suggest this recipe for anyone who likes blueberries and lemons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "???"
},
"reviewBody": "They are delicious but I will make only half the frosting next time. I have way too much frosting left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "This is a winning recipe! I did make a couple changes based on people's comments that there didn't seem to be enough liquid. I added one egg and exchanged the milk and vinegar for 10 Tbsp of buttermilk. The wet and dry seemed well balanced compared to the other scone recipes I have and like. They turned out moist and tender on the inside with a nice crispy layer outside. I used a simple glaze of powdered sugar with just enough lemon juice to make it runny. It was nice and tartly lemon, but let the powdered sugar flavor through....I'll try the glaze in the recipe when I make them next."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhienzi"
},
"reviewBody": "I love these scones. Not too fluffy and not too dense! Very good flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ParadiseGal"
},
"reviewBody": "LOVE THESE.... I did add more lemon because I absolutely love lemon and I tried adding some cranberries but I'm not sure how they will turn out. In the picture I show 3 going to my wonderful 97 year old mother-in-law who loves them also"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsea Shulga"
},
"reviewBody": "To die for! So easy to make. I followed the recipe, exact."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miki"
},
"reviewBody": "AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Used 1 cup powdered sugar, 1tsp lemon extract, and 1-2 tsp lemon juice for glaze, added a little water to thicken. Got lots of compla"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheSweetLife"
},
"reviewBody": "These were quick and quite tasty, they don't taste like a regular scone, but they are still very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nhaner01"
},
"reviewBody": "I followed the receipe as called for but added in blueberries. Came out fabulous...this is now my \"go to\" scone recipe! thank you for posting!! Nancy H"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy AndAaron Huebner"
},
"reviewBody": "I make these all the time for church. Half the glaze -just my preference. I get compliments always- amazing is right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanine"
},
"reviewBody": "this recipe is delicious. easy to make. I will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TerriLeeAnn"
},
"reviewBody": "These scones are delicious! I used buttermilk for the milk, but otherwise followed the recipe as written. However, the oven temperature and timing were all wrong for me. After the recommended 11-14 minutes at 350, the scones were still practically raw. Even after 20 minutes, they were not baked. So I upped the oven to three eighty five, and by the time the oven hit that temp, they were finally golden and perfect. My range is only a couple of years old, so I don't think my oven is slow. I know ovens vary, but next time I bake these, I'm going to use a hotter oven. The icing recipe makes enough icing for two or three batches but that's no problem, I just put the icing in the fridge and I'll use it for lemon cake or another batch of these yummy scones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "REA173"
},
"reviewBody": "Very good. Like I saw in another review, I also used my food processor, being careful not to overdo it. Just a few pulses til it comes together. They cooked up nicely. Very tender. I do think it needs more lemon flavor in the scone itself (personal preference) so I may up the lemon juice and/or zest next time. The glaze is quite nice too although it calls for a HUGE amount. I halved the glaze and still did not use it all. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Phillips"
},
"reviewBody": "I made these today but with some changes. I discovered that I had no white flour so used 2 cups of Multigrain flour mixed with 1 cup of Cake &amp; Pastry flour and dusted the board with barley four. I didn't do the glaze and they were sweet enough without it. They tasted very lemony....I used all lemon juice and no vinegar. I thought they may turn out heavy because of the multigrain flour but they were light and fluffy.... my guests asked for the recipe so I guess they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathi48836"
},
"reviewBody": "We are addicted to these scones too. I made the recipe exactly as written. The only change I made is to use my food processor to mix all dry ingredients and very cold butter. Pulse it until it resembles course meal. I then turned this out into a bowl and added the liquid ingredients. These are so tasty. I did use 2 lemons squeezed for the juice and the zest. Fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdm"
},
"reviewBody": "Recipe is easy to follow. Flavorful. My family gobbled them up. A keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LAWoods"
},
"reviewBody": "Good recipe. The scone cooked well, wasn't too dry and had a nice flavor. It wasn't lemony enough for our family and there was way too much icing. Next time I will add more lemon to both the scone and the icing and cut the icing recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Siegfried"
},
"reviewBody": "Cake like texture and very subtle lemon flavor. Next time I will substitute some lemon oil for the fat to increase the flavor. Also had to really work the dough and add additional liquid to get it to come together. I mixed by hand"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sheila Grant"
},
"reviewBody": "I followed recipe to a T. Found it was very bland tasting! I had to make lemon icing so it would taste better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eman"
},
"reviewBody": "Absolutely fantastic! The only thing different that I did was add a little zest to the icing. These are a keeper and will be making them again tomorrow morning to take to work. Thank you so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I made it as the recipe said. Fantastic. Well I did add more zest and juice!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca "
},
"reviewBody": "These were some amazing scones! They were quick and easy. If you like lemons, you will like these! My entire family loved them. The scone itself was not very sweet, but the icing on top was the sweet part of it. That made them so good! I would definitely recommend these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "somlai"
},
"reviewBody": "Very nice recipe. Light and flaky. I had to add two additional tablespoons of milk and ice water, I live in the San Francisco Bay area and when I try baking, I need to use the extra water as ingredients don’t bind as well here. I came from a very high elevation and dry climate to this low and more humid one and I’ve noticed this in all my baking. Just in case you do need to add the extra water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Park"
},
"reviewBody": "I have made these dozens of times. They are wonderful! We like more lemon flavor so i add more zest and a couple drop of lemon oil. Occasionally i add in fresh ginger or lavender flower. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Storemski"
},
"reviewBody": "These are pretty yummy!! Make sure you use fresh lemon juice and zest, as it really adds to the flavor. This recipe made very large scones, so I divided the dough into 2 parts and rolled each part into a round, then cut that in half with a pizza cutter and cut each 1/2 into 4 equal wedges. So, I was able to get 16 scones from each recipe. Make sure you let the scones cool a little before brushing the glaze on or else it melts and runs down the side and creates a sticky mess. I found it easier to brush the glaze on instead of drizzling it. These were super yummy and easy to make!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/229571/amazing-lemon-scones/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1997/bread/quick-bread/scones/",
"name": "Scone Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/229571/amazing-lemon-scones/",
"name": "Amazing Lemon Scones"
}
}
]
}
}
, "about": [
]
}
]