				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Anisette Toast"
,"datePublished": "2020-06-18T23:43:30.000-04:00"
,"dateModified": "2022-06-09T06:03:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Linda"
,"url": "https://www.allrecipes.com/cook/lindalmt"
}
]
,"description": "Anisette toast is a biscotti-like cookie that&#39;s lighter and softer in texture than the traditional Italian version. Delicious with coffee or anytime!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cZl76RvRC3zV0kkVkZfzfioowgQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/481872-9c40d01b2c174955bd0f1557af87b91d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Anisette Toast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "58"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "215 kcal"
,"carbohydrateContent": "37 g"
,"cholesterolContent": "57 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "201 mg"
,"sugarContent": "17 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.5 cups all-purpose flour",
"2 teaspoons baking powder",
"0.25 teaspoon baking soda",
"0.25 teaspoon salt",
"0.25 cup softened butter",
"1 cup white sugar",
"3 eggs",
"4 teaspoons anise extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Mix flour, baking powder, baking soda, and salt together in a bowl; set aside. Grease 2 baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Beat butter and sugar with an electric mixer in a large bowl until fluffy. Beat in one egg until completely incorporated, then another. Beat in last egg along with the anise extract. Mix in flour until just incorporated. Divide dough into two 12-inch long logs, 1/2-inch thick; place on prepared baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden and firm to the touch, 20 to 25 minutes. Remove from the oven, and allow to cool, 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Cut into 3/4-inch thick slices using a serrated knife, and place cut-side-down onto the baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake 5 to 10 minutes until the bottoms turn golden brown. Turn cookies over, and continue baking until golden brown on the other side, 5 to 10 minutes more. Cool completely on a wire rack before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "Make a yummy treat!!! My wife is not a fan of anise but she loved these. Not an overpowering flavor. Just perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Dorsett"
},
"reviewBody": "When I was little, one of my mom’s best friends used to make these. For almost 20 minutes (that’s how long it took me to stop stuffing them in my face), I was transported back to that kitchen-Thank you to whoever perfected this recipe. They are marvelous - I followed the recipe exactly - I’m a tentative baker. I only just recently realized that baking is chemistry- “Close enough” doesn’t cut it. Since my husband thinks anise is Satan’s spice and won’t go near these (more for me) I look forward to experimenting with different flavors and maybe some chocolate dipping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Umland"
},
"reviewBody": "I was craving this for about a month and based on local availability and online pricing I decided to make my own. This recipe is sooo good! Will be making this again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nae"
},
"reviewBody": "Very Perfect recipes Thank you! I love Anise flavor so I added ground powder Anise as well as the extract. I rolled into a ball in my hand then rolled onto parchment paper lined pan. Made it easier to shape and spread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sal"
},
"reviewBody": "Easy and quick!\nI did make one change, which I am sure is noted in comments someplace, I added two extra teaspoons of anise extract.\nEveryone loves them!\n4 starts because of change I made, or else I would have given it 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clog"
},
"reviewBody": "Perfect! Didn't change a thing. If you like anise you will love these. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcallen1"
},
"reviewBody": "Delicious.... so glad I made this. Turned out perfect and was so easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Vitrano"
},
"reviewBody": "I’ve made this Anise toast many times. A real family favorite. I’ve also used the main recipe and substituted the anise extract for: almond extract and toasted almonds to make almond toast, as well as hazelnut extract and chocolate chips to make hazelnut chocolate chip toast. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Roberta Strugger"
},
"reviewBody": "Ok guys, I need help.\nI read all the reviews before I made this...even the one that used gf flour.\nI have always used Bob's 1 to 1 gf flour for everything without a problem...except with this.\nThe batter was NOT soft and sticky; it was crumbly, sort of like making a pie crust dough, and wouldn't stick together. I even tried to wrap it in plastic wrap in the fridge for a half hour, but it still reminded me of not having enough shortening to bind it together.\nSo I added some oil and viola' it sort of stuck together. I made round cookies instead of a log, and they were alright.\nI sure could use some help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quizasx3"
},
"reviewBody": "Made twice - first time with no changes, and it was spectacular. Second time at hubby's request, subbed vanilla for anise extract and added two tsp. cinnamon. Also yummy, but nothing beats the original. I like this texture better than biscotti -- it's lighter, and not as crumbly. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne Zoricak"
},
"reviewBody": "My grandmother used to make something similar. These are pretty close. The only thing I changed was to use anise OIL not extract. The oil gives much more flavor since there is no alcohol to cook off. I prefer a sponge-like texture so these are quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vabeachgirl"
},
"reviewBody": "My go-to recipe for this cookie. It gets rave reviews with my Italian family’s!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Greg Bubba Poulos"
},
"reviewBody": "1st time making this recipe.Dough is kind of hard to work with but it is an easy recipe, &amp; I also could let them bake longer for the second baking. Maybe 12 min. as they didn’t seem to get quite as brown as I thought that they would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LilyP"
},
"reviewBody": "I signed up for this site just so I could comment on this recipe. I've made a lot of recipes that I find on the web and almost all are just so so or disasters. This recipe is the exception. It’s easy to make with items in your pantry (except for the anise extract). It is so good, I’ve made it 6 times in the last month! It only lasts for a few days in our house. My 92 year old mother whom I am visiting, loves it, too, so I am making her a batch right now. I may make another tomorrow for her freezer. She and I have one or 2 with our morning coffee. This will be a memory I will keep. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Eulie"
},
"reviewBody": "It's perfect just the way it is!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brancman"
},
"reviewBody": "I’ve made this recipe probably 15 times and my whole family just adores it! Thanks so much for creating this recipe for all of us"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dleaverton"
},
"reviewBody": "Amazing! Tastes like the kind my mom used to buy years ago in Central Pennsylvania, but is not available where I live in the Midwest. I've been wanting some for years, and was so glad to see this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi"
},
"reviewBody": "I have made anisette biscotti for years and reading the reviews on how sticky The dough was is an easy fix. You should refrigerate the dough for 2-3 hours or freeze for 30 mins. I make the logs 2\"wide n 1/2\" thick. Then cut on an angle a finger wide. I also TO vary n add slivered almonds n chopped whole almonds. I use half slivered so there are nuts evenly throughout n coasted chopped so when cutting into slices, you don't break the cookie with a large nut. I also use anisette liquor as well as as anise extract.\nJudi Hill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanie McMahon"
},
"reviewBody": "Love how easy the recipe is. I just used a pot and a spoon as I am not done unpacking in my new kitchen. The second time I made the recipe, I cut them 1/2 inch thick, I also made a double recipe and I added a Tablespoon of Fennel seeds to boost the anise flavor. I did find the dough sticky but not as wet as others, maybe because I used large eggs, not extra large eggs. I can't live without these in my house now. THANKS FOR THE EASY RECIPE! 3rd time, Double recipe increased extract to 1 Oz bottle and 2 Tablespoons Fennel seeds. Fourth time: ALL THE ADDITIONS AND A 1 TEASPOON VANILLA, made them even more buttery and delicious. Final recipe. So happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdhenin"
},
"reviewBody": "The recipe is perfect as is!! Do not make any adjustments. It's a very sticky dough, that's how it's supposed to be. Perfect and delicious. It makes me laugh when someone takes the time to review a recipe, that they didn't follow. They substituted this, didn't use this because they didn't have it, blah blah blah. Then you didn't follow the recipe. Of course they're gonna suck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Khirah"
},
"reviewBody": "The family loved this recipe. I cut the anise in half as they are not fans of overwhelming flavor, but love the hint of it. I will definitely be adding this to my dessert list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Fantastic recipe! Can also substitute almond and vanilla extract (2 tsp of each) for the 4 tsp of anise extract for a variation that is also very good!! To roll out sticky dough, place on slightly floured surface and roll quickly with hands into a log (do not handle dough for"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucille Naber"
},
"reviewBody": "made these for a friend and she really liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Walter MacNicoll"
},
"reviewBody": "I thought they were not going to be ok because after they were baked, the uncut log(and I use that term loosely as it was flat!) was brown around the edges and it looked SO flat. Nevertheless I kept following the directions and they looked like anisette toast in the end. I had no anise so I used vanilla extract instead and substituted 1/8 cup of light olive oil for the butter as I am watching my saturated fat. Probably a mistake. I will try one more time with no fat and get some anise extract. My husband is suggesting that I dust this batch with cinnamon and sugar as they are kinda blah. Used same number of tsp of vanilla but you can hardly taste it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karmala"
},
"reviewBody": "Delicious! And... I was able to make it with Pamela's Artisan All Purpose gluten free flour with great success. Also, I used coconut palm sugar instead of white sugar. These came out tasting exactly like the Stella D'oro anisette toast that my mom, sister, and I used to share over cups of tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam Amato"
},
"reviewBody": "Great recipe, double the Anisette though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eemmais"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "University of Windsor"
},
"reviewBody": "Linda!! Absolutely THE best Anise Toasts I've ever made. I love to bake and these were easy to make, great dough to work with and the flavour is phenomenal. I didn't have anise extract so I used 1-1/2 tsps of anise seeds and I sprinkled large sugar on top before baking. FABULOUS...thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dreijunge"
},
"reviewBody": "I've made them twice in the past week-shared with my mom &amp; some neighbors-they are awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Diem-Salentino"
},
"reviewBody": "best anisette cookie I've had!!! Better than any store bought (which aren't bad) Will never buy them again! Thanks for the keeper!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHORECOOK"
},
"reviewBody": "EXCELLENT! One taste of this dough and I knew I was on the right track. It was so easy to work with. I used a spatula and dipped it in water to smooth the top of the loaf. I was surprised that the instructions didn't say to lower the temperature before the second bake. I didn't and all was fine. Thank you Linda (LMT) for sharing such an EXCELLENT recipe! I will be making this again and doubling the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandma rose"
},
"reviewBody": "My mom made these cookies every year but they never looked like the Anisette Toast from the store. I compared the ingredients to my Moms and they were exactly the same, but this recipe explained HOW to lay out the dough. Very easy and they come out just like the picture. Only sorry I didn't DOUBLE the recipe as they disappeared too quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "12566"
},
"reviewBody": "What did I do wrong??? Followed directions as given, they formed and baked perfectly.... light and crispy BUT they have a terrible after taste..the only way I can describe it is it seems like the baking soda and powder had a reaction to each other... this overpowers the hint of anise flavor. Any suggestions???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zoe"
},
"reviewBody": "I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "My Sicilian husband just loves anything licorice. This is his favorite cookie and I purchase them from the Italian bakery often. I tried this recipie and made them one morning while he was still sleeping. He thought I bought them, but the evidence was in the kitchen sink! This is my second time making them. I made 2 smaller loaves instead of one big one, because the cookies came too big. When I form the logs, I dampen my hands slightly since the batter is very sticky. It worked out great! They get better and better with a little practice. Also, I round out the edges of the log for the traditional shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love Cooking"
},
"reviewBody": "Linda, If your batter is sticky and hard to handle, try putting batter in refrigerator for a half to an hour..It should be easier to handle without going through all the work that you do.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GiGi"
},
"reviewBody": "Fantastic!! These just came out of the oven and they are absolutely perfect. I love anisette toast and now I will certainly have it whenever I want. Very simple, straight forward recipe. Love it. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kisavirgo"
},
"reviewBody": "Tastes exactly like SD. The dough was sticky but when I finally got it into 2 loafs it turned out perfectly!\nHere is an update to my first post. I baked these using 1tsp flori do Sicilla flavoring in place of the anise. Scrumptious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sassy"
},
"reviewBody": "Being from NYC, I have fond memories of the Stella D'Oro rich anise sponge. This is so close, I cannot detect a difference. I now live in Central America and I included these in Christmas baskets this year for all my Central American friends. Everyone requested more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Peralli"
},
"reviewBody": "I'll admit, I rarely rave about anything in life, but this treat is one to take note of!! I baked the toast on two different types of cookie sheets. The air cookie sheet provided a light blonde toast color. The regular cookie sheet provided a light toast color. Each colored toast had its own amazing taste. These were so simple to make and will please any anise lover!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Marshall Saar"
},
"reviewBody": "My Grandmother Mother myself and now my Kids and Grandkids have grown up with a very similar recipie. I somehow lost my recipient...can't believe it. I've search all over the wntinoeb to see if I could find one that was close. The only real difference is my recipient called for oil instead of butter and a couple tablespoons of milk. I am going to try there tonight to see how close they are. We called them Grammar Tarantino's Anise Toast. Out of this world good..Sometimes i would eat them instead of the meal. If anyone can comment on the butter instead of oil and what the milk would do id appreciate it. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keri"
},
"reviewBody": "I made these as a gift for my father, because I remembered him eating anisette toast when I was a child. For some reason, my silly brain read the directions as saying to bake the cookies at 400 degrees F, so the loaves burned on the bottom after only about 19 minutes of baking and I had to throw them away. Fortunately, I had enough ingredients to make a second batch. I reduced the temperature to 375 degrees F for the second batch and started checking the loaves after 10 minutes. At 18 minutes, they were perfect. They sliced beautifully and the sides toasted nicely, again at 375 degrees F. My dad loved the gift and my kids and fiancee even reaped the benefits, because the recipe makes way more than my dad could eat by himself before they go stale. I'll definitely make these again, AND I'll make sure I use the correct oven temperature next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAMBAKE"
},
"reviewBody": "A wonderful recipe! I can't believe how easy they are to make!! They taste exactley like the one you buy but of course better because they are homemade! I also used the spatula to transfer dough from bowl to pan and used the spatula to shape into 12\"x 1/2\" log. So cute when 4-5 are placed in decorative cellophane bag and tied up with ribbon. Thank you Linda!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Presutti Rogers"
},
"reviewBody": "Delicious! I have been searching for a really good anisette toast recipe, and this is it. Just the right amount of anise flavor and perfect for dunking. For variety, you could also dunk ends in dark dipping chocolate and chopped nuts. Great recipe! I will be making these again for Christmas for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Lentz Hatcher"
},
"reviewBody": "These were really good especially dunked in coffee. I followed Linda's advice on how to shape them. It was really a good idea. Thanks Linda."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvu61"
},
"reviewBody": "these were very good well enjoyed by my co-workers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Kealalaina D'Angelo"
},
"reviewBody": "These are better than delicious! I cut off the ends and ate them while the cookies were baking and they are so delicious I am pulling them out of the oven to eat because they are THAT good!!!! I am a big Stella Dora Anisette toast, but I can't get them where I am in Hawaii and these blow them away. So incredibly delicious!!!! Thank you thank you thank you for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "As I was making this recipe I began to think I had done something wrong. I didn't think these would turn out at all but I was wrong. I'm making these a new staple in my home. Next time I might get fancy and dip the tops in chocolate and shredded almonds. The only change I made was I used vanilla and almond extract because I didn't have anise extract. Thank you for sharing linda I love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "The dough is very sticky and soft ... you should not be tempted to add more flour or use your hands to shape. I scoop up a spoonful of dough with a soup size spoon and lay it on the cookie sheet and keep doing that until I have several spoonfuls of dough laying next to and touching each other in a very crude shaped log. Then I take a rubber spatula and push/pat it into a log shape about 10-12\" long, about 4\" wide and 1/2\" high (each log). This dough is very soft but will bake up into shape. Hope this helps everyone."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/215829/anisette-toast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/215829/anisette-toast/",
"name": "Anisette Toast"
}
}
]
}
}
, "about": [
]
}
]