				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Anko (Sweet Red Bean Paste)"
,"datePublished": "2020-06-18T23:59:53.000-04:00"
,"dateModified": "2022-10-30T08:25:13.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "Anko, a sweet red bean paste that&#39;s often used as a filling for cakes, pastries, and other Asian desserts, is so easy to make with this DIY recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zXpEhuCRMKoPhKnR8Ns4taGMoN4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3670446-718e3c5478594967beccff452e454b9b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Anko (Sweet Red Bean Paste)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "16"
}
,"cookTime": "PT115M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "222 kcal"
,"carbohydrateContent": "51 g"
,"fiberContent": "6 g"
,"proteinContent": "5 g"
,"sodiumContent": "9 mg"
,"sugarContent": "38 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 cup dried red beans",
"1.5 cups white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place beans in a saucepan and cover with 2 cups water; bring to a boil and cook for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Drain beans and transfer to a clean saucepan. Cover with 2 to 3 cups water and bring to a boil. Reduce the heat to low, cover, and simmer, adding more water as needed, until beans are soft and can be crushed between your fingers, 1 1/2 to 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Drain beans and return to the saucepan. Add sugar and set over medium-high heat. Cook, stirring constantly, until sugar melts and beans form a loose, shiny paste, about 10 minutes. Immediately transfer paste to a container to cool."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Immersion blender is your friend for last stage. Lacking that, potato masher works fine. Nothing wrong with a little extra texture. It will offset the smoothness of the outside just fine. You can cook longer for darker, but you best know about candy making Temps and Crack stages to risk not taking sugar too far down that path. Don't want it at hard crack and get dry and hard on cooling. Test with small bowl with ice cubes in water. Test a pea. If it is soft ball, even near hard ball, your golden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie de Sinestre"
},
"reviewBody": "Easy. Beans were very liquid before I cooked them ith the sugar. I did not take them to a candyStage. Don't know what they'll do after cooling in a loaf pan with parchment paper lining. I'm hoping it will slice and roll after cooling. Tasty though. Oh added about 1 tsp salt after cooking. Soy sauce would work too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shernielle Christeline Teo"
},
"reviewBody": "I've used rice cooker to steam (5 minutes) and cook the beans for 2 hours. After which I followed their method, then i used handheld blender to crush the beans not completely had some grains in it. Then i transferred back to the stove to cook and stir until it does not have any water in it. The last 5 minutes I added a tablespoon of corn oil and stir well. Hope it helps:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geekygurl92 Sneed"
},
"reviewBody": "It taste great I can’t wait to use it it just needs to cool and I added cinnamon?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eliza"
},
"reviewBody": "Recipe was easy to follow, fool proof. I used hand whisk right at to smooth it a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bro Ski"
},
"reviewBody": "Cooking time was a little longer than what I expected. I did not do day before preparations to the beans like others suggested but total time to make was about 2 &amp; 1/2 hours. Like many others said, the recipe did not say to mash the beans up. I used a blender like others suggested. I added only 1 cup of sugar and stirred it for about 5 minutes on medium heat, then transferred to blender. It was sweet enough with only the one cup of sugar (maybe slightly a bit too sweet for my taste) but in the end they tasted pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lday"
},
"reviewBody": "I also want to add: adzuki beans worked perfectly for this, they are very sweet and bright. You can add a little cinnamon too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joseph Harrington"
},
"reviewBody": "Remember to crush the beans. Soaking the beans isn't necessary. I recommend using 0.75x the recommended amount of sugar, as it is very sweet, otherwise. Also, simmering on lower heat near the end, while doing the crushing, will help a lot; remember that sugar's melting point is 2x that of water, so you're going to want a fairly moist bit of beans for the final cooking process bc you'll need to boil them to actually melt the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Papa Grrowler"
},
"reviewBody": "It didn't come out anything like the texture or color that I've seen in Anko. The times might be based on a different type of stove than I have. My wife says the texture is ... awkward but it taste great. Think I'll try adjusting the temperature and cook times to get better results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monkeytechahoo"
},
"reviewBody": "I soaked the dried beans overnight first. Then after cooking I used an immersion blender as smashing the beans by hand was not as smooth and productive as I liked. The tastes is smooth and nice. Just like I remember when visiting Japan and eating Mochi there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LKB"
},
"reviewBody": "If you are using dried beans, soak them overnight first and drain the water. Then start cooking as directed. This may be why some are reporting longer cook times. \nI only use 1cup of sugar, and for me the end result is sweet enough. I also like to add a small splash of vanilla and a tablespoon of butter to enhance the flavor and creaminess. \nLast, depending on the texture you want, mashing, blending, or food processing the cooked beans is necessary. Otherwise all you get is lumpy sweetened beans. Do this once the beans are fully cooked. If your blended mixture is too runny, just cook it down a bit longer. I like to set aside about a ¼ cup of the whole cooked beans and stir them in at the very end to add a little texture. Texture is up to your individual preference, however.. \nThese are some tips that work well for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wolfyhound"
},
"reviewBody": "Recipe never mentions crushing up the beans, and doing as written would result in beans in a sugar base, not paste. I beat the beans and sugar together and then cooked it down in a saucepan. It never quite got to a \"paste\" consistency, perhaps because I strained it(the photo shows no bean skins, but recipe never mentions this part either). Took longer to cook beans to soft, much longer to cook mix to a sort of paste consistency. Once cool it should be a soft paste and the flavor is pretty on point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "French epic"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Malice"
},
"reviewBody": "To start, I used honey instead of sugar, but did everything else the same. I used this to make mochi and red bean pancakes. Definitely took more than two hours to get the beans to soften, and that was w/ med-high heat. I do not suggest lowering the sugar/honey content than what the recipe suggested because the high level of sweetness is a large part of what removes the after-flavor of bean. Ultimately I was satisfied with this recipe, though, as mentioned, took longer than anticipated and the beans were a bit difficult to crush (though they were fully soft). Next time, I think I will half the recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jotk"
},
"reviewBody": "I had made sure to use adzuki beans, which wasn't part of the original recipe (seems too important to be left out). The final product still tastes like \"bean\" in a way that the store bought versions don't. Does anyone have any advice for fixing that ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "Delicious and easy to follow recipe. This worked perfectly for daifuku sweet mochi. The consistency and sweetness reminded me of the store-bought type. Thank you for the recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/238507/anko-sweet-red-bean-paste/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
"name": "Cuisine"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/238507/anko-sweet-red-bean-paste/",
"name": "Anko (Sweet Red Bean Paste)"
}
}
]
}
}
, "about": [
]
}
]