				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ann&#39;s Shrimp Etouffee"
,"datePublished": "2020-02-01T02:50:19.000-05:00"
,"dateModified": "2020-02-01T02:50:19.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Ann Cooper"
,"url": "https://www.allrecipes.com/cook/234702"
}
]
,"description": "Shrimp, onions, celery and mushrooms, seasoned with paprika, garlic and crushed red pepper. Great over steamed rice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EHdQhcn2-0T8rSQcV1xnDADnEL0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1082393-8421c0c1efe242e3ad2f70b4f4c2fd3d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ann&#39;s Shrimp Etouffee"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "245"
}
,"cookTime": "PT100M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "205 kcal"
,"carbohydrateContent": "4 g"
,"cholesterolContent": "204 mg"
,"fiberContent": "1 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "328 mg"
,"sugarContent": "1 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup butter",
"2 large white onions, chopped",
"6 stalks celery, chopped",
"3 cloves garlic, pressed",
"4 tablespoons all-purpose flour",
"5 pounds fresh shrimp, peeled, deveined and chopped",
"1 cup chopped fresh mushrooms",
"3 tablespoons paprika",
"salt to taste",
"ground black pepper to taste",
"crushed red pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large skillet, melt butter and saute onions, celery and garlic for about 45 minutes or until they are cooked down."
} ,{
"@type": "HowToStep"
,"text": "Stir in flour and cook briefly, do not brown. Stir in chopped shrimp and cook for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour in 2 to 3 cups of water and mushrooms. Stir in paprika and season with salt, pepper and red pepper flakes. Cook for 30 minutes. Should be a thick and have a gravy-like consistency."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT145M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NeeterWoman"
},
"reviewBody": "I added 1/2 cup minced bell peppers to the veggie ingredients. I also used 2T roux mix with the 2T flour since I has more veggies than this recipe. \nPS. I used 1 can cream of mushroom soup + 1 can of water instead of fresh mushrooms~ only because my hubby isn't a fan~ I added it after the veggies heated in the flour/roux. Also, I cheated by using cooked shrimp so I added them at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kenneth lords"
},
"reviewBody": "Not flavorful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacob Tenderico"
},
"reviewBody": "I liked it. I had to add bell peppers because it’s not Cajun unless you use the trinity, onions, celery, and bell peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Super Solver"
},
"reviewBody": "I'm a huge fan of Cajun food, so I would naturally fall in love with this etouffee recipe. After I got more and more familiar with this recipe I started making modifications to it. Like completely the Blessed Trinity with the addition of green bell pepper. I also add more paprika and include more spices like cheyenne, ancho, and (since I'm Texan) hatch peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "Have made it several times, and pretty much stayed with the recipe as written except used two - 2lb. packages of shrimp. It pretty much filled a large saute pan. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kopen"
},
"reviewBody": "I have made this 4 times now, as written but scaled down to half. My picky family has requested this at special gatherings, so you know its good. I now feel I am at liberty to experiment with some of the other suggestions (tomato paste, green pepper, etc) I serve mine with jasmine rice cooked in coconut water, which adds a sweet touch to the dish. Thanks Ann."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "G&A's Kitchen"
},
"reviewBody": "I tried to do 1/5 the recipe because I only had 1lb of shrimp and there are only two of us! I took some of the reviewers' advice and used broth instead of water and added the shrimp last so it didn't over cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reginal Tucker"
},
"reviewBody": "I used the shrimp shells to make a stock as water brings nothing to the party. I made this for 6 servings instead of 20. I did not use mushrooms and I forgot to add paprika, but all worked out well. I added some cajun andouille sausage. So I guess that would make mines Shrimp and Sausage Etoufee,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reginal Tucker"
},
"reviewBody": "I used the shrimp shells to make a stock as water brings nothing to the party. I made this for 6 servings instead of 20. I did not use mushrooms and I forgot to add paprika, but all worked out well. I added some cajun andouille sausage. So I guess that would make mines Shrimp and Sausage Etoufee,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "otheraimee"
},
"reviewBody": "This is now in regular rotation. I did make adjustments based on other reviews- chicken stock instead of water, a 14oz can of stewed tomato when I added the stock, left the shrimp until the end to cook, and a couple shakes of cayenne during seasoning. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Kirkwood"
},
"reviewBody": "I don't understand how someone could give this recipe any less than five stars. I followed exactly, but didn't have mushrooms on hand, so didn't use them. My whole family (ranging in ages from 1 to 30) gobbled this up and asked for more. I served over a bed of white rice. Total perfection. It's our new favorite shrimp recipe and probably one we'll be making a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mspanamag7"
},
"reviewBody": "Im def making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vmira101"
},
"reviewBody": "Great recipe. I made the mistake of adding frozen shrimp, so if you do, don't add as much water. It was a little watered down, but that was my fault. I added a splash of white wine, and some crushed tomatoes, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bcbg0813"
},
"reviewBody": "Made to serve 4 and added the raw, I chopped shrimp the last few minutes of cooking. Also added can of stewed tomatoes and 1/2 cup of chopped frozen spinach (to offset the butter in my mind). Added creole season to it on my first plate, then tried it with Old Bay on the second. Both tasted really good, but the Old Bay almost won out. Thanks for the recipe, added it to my Cajun Obsession recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mariama Cooks"
},
"reviewBody": "Okay! This recipe turned out great. Though given all the of prior comments I did a good amount of adjustments. As with others I used chicken broth instead of water also I used olive oil in place of some of the butter. I also added heavy cream and green peppers. I really like the consistency of the sauce and the flavor. I do wish it had a little more color like that in the picture. Thanks for a good recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra Sveum"
},
"reviewBody": "I have been wanting to learn to make this, and this was a perfect recipe to start. I did substitute some items as suggested by other reviewers, and it turned out delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Callie"
},
"reviewBody": "Yummy. Almost as good as the restaurant where I first tried this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sjade2001"
},
"reviewBody": "Really good base to start with! I made about half of the recipe. I had to use frozen, thawed shrimp, and added them at the very end to not overcook. To up the flavor pallet I used beer, vegetable stock, and chicken bullion in place of water, upped the garlic (I only had garlic powder around) and used creole seasoning for the kick. We gobbled it up over some mixed grains and barley!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tameshia07"
},
"reviewBody": "delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Bell"
},
"reviewBody": "The main dish in our traditionally non traditional xmas dinner 2012. I was to cook this one, but the husband took over and that was fine as I was making rolls, mushrooms, and a chocolate cake. He's an awesome cook, so there was no doubt he would do a supreme job ;)\n\nThis is a keeper for sure! We've been to New Orlean's and have had a cajun cook make a meal for us at home as well......I think this was even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TinaNg28"
},
"reviewBody": "I'm a very picky eater and dislike grocery shopping. I stumbled upon this recipe one day and saw how little ingredients it required so decided I would try it. I couldn't believe how great it tasted. Since trying this recipe a month ago, I had been making it every weekend and eat them for lunch and dinner for the upcoming week. I doubled the recipes (40 servings) and finished eating the entire thing in less than a week. I'm addicted to this recipe. I will continue to make it once a week until I get sick of it, which I don't think I ever will.\n\nFew things I modified: I add some starch for thickening and 1/2-3/4 cup of red wine. I cook the shrimp for 15 minutes instead of the suggested 45. Also, to save some money, I double all the ingredients except for shrimp. \n\nThank you so much for sharing such an awesome recipe. You make a picky eater like me so happy. I have problem with keeping weight on me due to my laziness of cooking and I don't like spending money eating out, but thanks to this recipe I have been maintaining my weight since I enjoy eating this so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Hosler"
},
"reviewBody": "Well like a few others I of course had to cut the recipe down &amp; make some changes. I cut it down to a pound of shrimp (5/6 servings). I used chicken broth &amp; white wine instead of water (a little over a cup). I also seasoned the shrimp in some old bay prior to cooking. I also did some other things to the sauce.. I used \"Tony Chachere's Creole seasoning\" (instead of salt) along with the paprika, a couple dashes of Whorcestershire sauce, I also added a chopped tomato for some flavor and color. With a few changes I would give this 5 star &amp; I will keep it and make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stick"
},
"reviewBody": "Go easy on the crushed red pepper for a kid friendlier meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Milligan"
},
"reviewBody": "Wonderful recipe! I did use the suggestion of using chicken broth and a bit of white wine in place of the water but found the spices to be perfect. It's worth making again and again. Thanks for the recipe Ann! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melbox23"
},
"reviewBody": "I followed some of the other reviews and substituted low sodium chicken broth and white wine. Also the last 4 spices and used tony chachers.\r\nSo so good! Husband asked it be be added into rotation:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "qatarsessions"
},
"reviewBody": "I have made this many times and I've changed it so much that it may be a different recipe at this point but it serves as written as a good start. I use 1 stick butter and 1/2 C olive oil. I add a green bell pepper chopped and a can of Rotel tomatoes. I add the water/ chicken broth and Rotels right after mixing in of the flour and let it all cook for about 15 minutes. If it needs to be thickened I add a mixture of cornstarch and white wine. I agree with another review that the shrimp is cooked way to long. I used chopped shrimp and crawfish tails and cook for about 6-7 minutes. This recipe will make 6-8 good size servings. Not even close to 20 small cup size servings. I find it delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "very good. i cut the recipe down to just 1 lb of shrimp. tasted like a good gumbo. we served it w/ rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChefKatie"
},
"reviewBody": "Decent! We liked it. Notice that if you lower the amount your making - the water you need is less too! &amp; the cooking time is so much shorter. Ate on white rice &amp; had Spinach Brownies on the side - Mmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellieann"
},
"reviewBody": "This was delicious! Next time I will serve it with garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dlkfla"
},
"reviewBody": "not sure that the directions are correct....saute onions, celery and garlic for 45 minutes?\nNot sure I would cook shrimp for 20 minutes either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tedsbaby"
},
"reviewBody": "perfect to me just have to watch the h20 in the method. if you cut the recipe .. you have to cut the water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Q"
},
"reviewBody": "Excellent recipe! Added a couple of spoon fulls of tomato paste as some suggested. Will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany"
},
"reviewBody": "Wow- so tasty! I halved the recipe and cut down the cooking time for the shrimp a bit. Served over brown rice. Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sw"
},
"reviewBody": "My brother brought this to our Christmas lunch. He used about 2 lbs of shrimp and cut back on the heat because my husband doesn't do spicy. Served over rice, it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachello"
},
"reviewBody": "I've made this recipe twice now, and I love it. Instead of seasoning with salt, pepper, and red pepper, I've stuck with Tony Chachere's Original Creole Seasoning (and lots of it). His blend is a good balance of spicy, salty, and robust flavor. Also, I used a mixture of shrimp and crawfish, but the crawfish make it sort of gritty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mindy Henderson"
},
"reviewBody": "Very good - I followed the other reviewer's advice, added a splash of wine, chicken broth instead of water, half a small can of tomato paste and a few dashes of cajun seasoning. Delish! Husband and 9 year old daughter liked it. Have some tobasco on the table, too...MMmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goober"
},
"reviewBody": "This recipe is so yummy &amp; versatile, I followed the suggestions by other reviewers and found them super helpful. I've made this recipe several times and loved it but tonight I substituted stew meat, used vermouth &amp; corn starch to thicken the broth and then used it as a filling for a Shepherds Pie. It was by far the best Shepherds Pie I have had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tichka Slack"
},
"reviewBody": "i substituted lobster we caught in the Bahamas..used about 6 - 7 tails and this was a great recipe! I have made it several times on request..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sian"
},
"reviewBody": "So easy! So Good! This is awesome and simple - I will definitely be making this on a regular basis!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ryan"
},
"reviewBody": "I thought overall this dish was good, although it was kinda of bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lyndseye225"
},
"reviewBody": "I made this for 4 and it was awesome! I was so surprised at how low calorie, but delicious this was. I did adjust the time and used 1/2 water and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "I have tried several etouffee recipes, but this is the most authentic and best tasting. I have adjusted a little, including using lobster stock instead of water or chicken broth. I also started using half shrimp and half scallops, which everyone loves. Unfortunately crawfish is hard to find in Los Angeles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Paula Harrell"
},
"reviewBody": "I'm sure the sauce is excellent but I just have to tell you that cook in any size shrimp for 20 minutes will only give you the toughest shrimp imaginable... Please be fair to the shrimp; put them in LAST and cook them only until they turn pink - 4 minutes at best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Disonmom"
},
"reviewBody": "Try this recipe. It's fantastic! Wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kricket2571"
},
"reviewBody": "This was good but I did change the recipe a bit based on other reviews: I used about 3 tablespoons of white wine to deglaze my pan after I added the flour, added some cayenne pepper for extra kick and worcestershire sauce for a bit more flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pa"
},
"reviewBody": "Very good Etouffee. I am from Louisiana and this is the best one I have found. The only thing I added was a bay leaf for extra flavor and didn't add mushrooms. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colibri"
},
"reviewBody": "This was a yummy recipe but way too much butter for my Weight Watchers program. I reduced the butter, substituted olive oil when I could and used nutritional yeast to help maintain the butter flavoring. It turned out quite well and pretty tasty. I'd make it again for certain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShellyCooks"
},
"reviewBody": "So so yummy and so so healthy and so so low in calories! I scaled this down for 2 people. I added 2 green bell peppers to make it a little more authentic. I also used olive oil instead of butter. I served over brown rice cooked in low sodium chicken stock. Another thing I did was make a quick shrimp stock to use in place of water. I took the shrimp shells and put them in a bowl of water, microwaved for 3 minutes, and let sit until I was ready to add the water. Definitely a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "laura*starla"
},
"reviewBody": "I added white wine and other spices. My very french boyfriend said his even frencher grandmother used to make something similar, and she is often the standard I have to live up to..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buncephoto"
},
"reviewBody": "ummm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cruisergirl21"
},
"reviewBody": "Pretty easy recipe. I added about half a can of tomato paste, creole seasoning, used chicken stock instead of water, and added some cornstarch near the end. I also added half a large tomato, a green bell pepper, some worchestershire, and hot sauce. I agree that it seemed rather bland before adding the extra flavors. It was very tasty over rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamara B"
},
"reviewBody": "loved it.. honestly, I feel like this is a really great 'base' recipe. I think that if I followed this recipe exactly it might turn out a little.. bland? Made a few revisions to accommodate my own tastes.. Chicken stock instead of water.. a small can of tomato paste.. chopped green pepper.. added cooked, brown rice at the very end to thicken it up and add some heartiness.. come chili powder &amp; hot sauce for more kick.. Oh, and some salt to taste. I know.. a lot of revisions!! I'd use this recipe as a starting point again, for sure! Very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCARVER99"
},
"reviewBody": "My family loved this dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vin"
},
"reviewBody": "Followed this very loosely. Added green onions and green bell pepper, along with an assortment of spices and sauce. Cooked the rice in the mix -- next time I'll add more water or broth so it comes out more soupy. Very excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZvilleMom"
},
"reviewBody": "Excellent recipe. Super easy to make too. Only made a few changes by taking out mushrooms (kids hate them!) and adding about a cup of diced tomatos - had half a beefsteak tomato that I needed to use. Served over rice and it was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wun Fungi"
},
"reviewBody": "Though technically not authentic (the genuine article includes green pepper), this is still a good, basic recipe. The shrimp should be added last as they cook very quickly. 50 minutes is a very long time to cook shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajax"
},
"reviewBody": "Very good. I think you have to add the tomato paste as suggested by the other reviewers. I added tomato paste, a bit of worcestire sauce and chicken broth. It was very filling! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANGELINAZOOM"
},
"reviewBody": "Definitely scale down the liquid and use broth instead of water. Added some worchestershire for a little depth. Really good dish over some rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ZOPOOH"
},
"reviewBody": "We didn't care for this at all. I couldn't even convince the kids to eat the shrimp out of it and that's very rare. However with the addition of some soy sauce rice vinegar, sesame oil and some peas and carrots it made an edible stir-fry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mtnmacgrl"
},
"reviewBody": "This was very spicy and tasty! Pretty easy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Chang"
},
"reviewBody": "Very spicy recipe. Yet it is rather not tasty enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dragngirle"
},
"reviewBody": "This just wasn't what I was expecting. The consistency wasn't what I was looking for. My grandfather was Cajun and my family used to make what we called shrimp stew so I was trying to find something like it on here. However, this didn't quite live up to my expectations, but that's just my personal preferences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HannahLass"
},
"reviewBody": "I made this a while ago and I dont know if it was something I did or if it is just the way an Etoufee should be but we weren't too keen on it here. But that could be personal preference rather than a reflection on the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "Great recipe! I did change a few things though. I used 1/2 cup butter, chicken broth instead of water, and added some creole seasoning to it. Served with garlic bread and steamed veggies. The nex day my husband and I were arguing over who got the left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smitty"
},
"reviewBody": "wanted to do another recipe but did this one...well i will do it again forsure but i did scale it down...but was very happy with the results ... thank u"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessemae"
},
"reviewBody": "My family loooves this recipe. I usually double the celery amount, just because I think its such a tasty component. Really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Prince"
},
"reviewBody": "My Family LOVED it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Moore"
},
"reviewBody": "I made it with cut up chicken breasts because I don't like shrimp and it tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maisa"
},
"reviewBody": "deliciuos! iadded chicken broth in place of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Blanchard"
},
"reviewBody": "We loved this recipe!! It ended up being fairly easy, and made me feel like a famous chef when I was done. I used pre-cooked shrimp to cut down the cooking time (added it right at the end), substituted chicken broth for the water per the other reviews, spiced it up a bit with cajun seasoning because we like our stuff hot, and also included some Worcestershire sauce. This is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missannieb"
},
"reviewBody": "This was a good recipe...I didn't have mushrooms and I added a lot of red pepper flakes so it was SUPER spicy! But very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonna Jacobson"
},
"reviewBody": "This was very good. The changes I made were minimal. I added some tomato paste, used pre-cooked shrimp, and for the fluid I used chicken broth (although white wine would've been my first choice but oddly didn't have any on hand!). I served this over brown rice. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dena"
},
"reviewBody": "This recipes was ok. I'm a big fan of cajun dishes but I thought this one was a little bland. I did add some canjun seasoning but I think if I make it again, I will follow some of the other reviews and use chicken broth instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHCMEOW"
},
"reviewBody": "Great base recipe. Definitely needs more heat to be truly cajun. I add 2 to 3 tsp. of creole seasoning when I make this. I also use chicken or seafood stock instead of the water for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ehjudah"
},
"reviewBody": "didn't care much for this recipe. i love shrimp and this is not a 'shrimp wonder' dish to me. maybe pork roast would have been better for this. Thanks for sharing anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILUV2COOK25"
},
"reviewBody": "Made some modifications according to my taste. (added 1 TB Tomato paste, worschestire, and extra garlic). I changed the servings to 8. Also, I only added 1 cup of water in the end. Lastly, we served this over whole wheat angel hair pasta with some parmesan. Very Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ranessa"
},
"reviewBody": "Very good! I didn't change too much in the recipe, but I did at some Cajun grill seasoning, for more flavor. And, I used chicken stock instead of water, also for more flavor. So easy and yummy, I'll definately make this again and again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Everjonez"
},
"reviewBody": "This recipe was delicious! It took FOREVER to make, so I may try and find some shortcuts. I will be making it again though! yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMANUEL"
},
"reviewBody": "This was great! I didn't have any cayenne pepper and felt the only thing it needed was a little kick. Next time, I'll make sure I have some handy because I'm sure it's perfect with it added. I also added 2tbsp of tomato paste and added a rue to thicken at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THENEWTRICIA"
},
"reviewBody": "I followed the recipe exactly, and it came out fantastic! My husband, who rarely likes shrimp, said he loved it, too. He had it over rice and I had it over salad greens (low carb diet). YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant L"
},
"reviewBody": "Like others, I quartered the recipe. I used 1/2 california paprika and 1/2 smoked spanish paprika. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YaGyrl"
},
"reviewBody": "Will use again. Family ate all of it. I did have a lot of leftovers but they didn't remain as leftovers after my husband and kids went back for seconds and thirds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LADYJAYPEE"
},
"reviewBody": "I scaled the quantity down to 1/4 of the original recipe. Based on other reviewers' comments, I agreed that, as is, this dish needed some depth of flavors; so I used chicken broth rather than water, added homemade cajun seasoning (rather than just paprika, cayenne, S&amp;P), a little worcestershire, some tomato paste, garlic powder along with the fresh, &amp; a bit of white wine. I used a portabello mushroom &amp; all that was available in my town was already-cooked shrimp, which I tossed in toward the end, after the sauce had simmered, to warm it through. Served over sticky rice alongside steamed buttery broccoli. Thanks for sharing your recipe, Ann!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kpb2cool"
},
"reviewBody": "I had been looking at this recipe for a while and was getting all the ingredients together. So on my off day, I made this and talk about hmmm, hmmm good! I was trying to stick to the original recipe, I made it to the part where you add the shrimp, but my patience wore out and from there I deviated. Based on other reviews, I added chicken broth, a can of rotel original, tony chachere's, old bay, sliced okra, crab meat.....served it over rice with cornbread, my fiance' who's Arabic, loved it too, the gravy/sauce lingers on your tongue and you just want to keep eating until its all gone. I will serve it again. Quite adaptable, once you get the gravy right, anything else is all good...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LUV2BURN28T"
},
"reviewBody": "I prepared this for a family gathering everyone loved it. they talked about it for 2 days after. I did add a little extra spice to my taste and I used tomato paste for a little color. I will make this again for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bobbijunkie"
},
"reviewBody": "This is good! However, using that much butter/margarine is scary! Next time I will try only 1/8 of a stick or canola spray. I also want to try to add okra and stewed tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli J."
},
"reviewBody": "I've made this dish several times, and everytime its wonderful! A few times I was out of paprika so I just used a seasoning salt. Plus I always add extra garlic since we love it so much! Very easy to make, and tastes awesome! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAMALAMA398"
},
"reviewBody": "I used cooked shrimp and eliminated the 20 minute cook time for the raw shrimp. I don't cook much but I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly P."
},
"reviewBody": "I used a can of tomatoes w/chilis instead of some of the water and I ran out of paprika, so I put some cajun seasoning in also. My husband loved it! Tastes great and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "Fantastic! I added creole seasoning and it tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "Delicious! I added 1 can of Ro-Tel tomatoes, original or mild, and I used only 2 cups water. A friend used the RoTel tomatoes and 1 can cream of celery soup to replace the fresh celery,and she said it was so good. The gravy makes the shrimp and rice delicious.Fresh garlic and onions make it so good. I like alot of onions, so I increased it to 1 more onion in the recipe. Super good! I didn't cut up the shrimp, just choose the size of shrimp wanted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eLi"
},
"reviewBody": "i liked it, but my family (and a very picky husband) loved it! will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was truly fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LANA6"
},
"reviewBody": "i have made this several times. using chicken broth instead of water, tomatoe paste, old b"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Maziarka"
},
"reviewBody": "EXCELLENT recipe! I used this for company and it was RAVED over! I used a chunky one-cup measuring cup, packed the rice tight into it and dumped it out onto each plate. Then I served up the etoufee OVER the mound of rice, garnishing with lemon and orange slices and parsley. PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J'sHomeSousChef"
},
"reviewBody": "I gave this a four because I did some changes for tastes. If you enjoy seasoning, I suggest the following: Use chicken broth instead of water, season with McCormicks Cajun Seasoning and McCormicks Red Pepper Seasoning. I used half shrimp and half crab meat. My hubby could not believe how YUMMY it all was!!! I served this with some of my signature cornbread and it was the perfect compliment to this great dish! Thank you Ann!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maya"
},
"reviewBody": "Even though my family rated this 5, I still didn't taste anything extra-ordinary that would make want to have this again, especialy with the long cooking time. I don't know, maybe it's due to all of the changes I made- used chicken broth as recomended (and yes, I scaled it down) added 1 tbs tomato paste and used 2lb shrimps and 1/2lb scallops (which was my first time cooking scallops- and they came out delicious!) Also, as spices used , besides the ones in the recipe, cayene pepper and a lil bit of chili powder for a kick. over all was good and enjoyed it. Thank you for a very good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLFROMSCRATCH"
},
"reviewBody": "I found this to be a great way to use up leftover New Year's Eve shrimp. Very yummy! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SM Voss"
},
"reviewBody": "My family loved this etoufee. Have also used this recipe with chicken and sausage instead of shrimp."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25861/anns-shrimp-etouffee/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1425/soups-stews-and-chili/stews/etouffee/",
"name": "Etouffee Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25861/anns-shrimp-etouffee/",
"name": "Ann&#39;s Shrimp Etouffee"
}
}
]
}
}
, "about": [
]
}
]