				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Antipasto Platter"
,"datePublished": "2001-02-14T23:22:48.000-05:00"
,"dateModified": "2022-08-08T10:48:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Wendy"
,"url": "https://www.allrecipes.com/cook/250514"
}
]
,"description": "For this antipasti platter, a variety of cheeses and deli meat slices are layered with vegetables, peppers, and spices to create a mighty party platter that&#39;s filled with exciting flavors and easy on the eyes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/qfdsF8b6r8k16I_DgZMaop46_ko=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6178358-f418a5a23c0548e0ac1ac8cbe6f588ee.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Antipasto Platter"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "56"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "503 kcal"
,"carbohydrateContent": "7 g"
,"cholesterolContent": "94 mg"
,"fiberContent": "2 g"
,"proteinContent": "31 g"
,"saturatedFatContent": "18 g"
,"sodiumContent": "2209 mg"
,"sugarContent": "3 g"
,"fatContent": "39 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"2 heads iceberg lettuce",
"1 tablespoon garlic powder",
"1 tablespoon dried oregano",
"1 (8 ounce) bottle Italian-style salad dressing",
"1 pound thinly sliced cooked ham",
"2.5 pounds sliced provolone cheese",
"0.5 pound Genoa salami, thinly sliced",
"0.25 pound Capacola sausage, sliced",
"0.25 pound pepperoni sausage, sliced",
"0.25 pound prosciutto, thinly sliced",
"0.25 pound thinly sliced roast beef",
"1 cup fresh mushrooms",
"1 (6 ounce) can marinated artichoke hearts",
"1 (7 ounce) jar roasted red peppers",
"1 (6 ounce) can sliced black olives",
"0.75 cup sliced pepperoncini peppers",
"1 (5 ounce) jar sliced pimento-stuffed green olives",
"0.5 cup crumbled Gorgonzola cheese",
"0.5 pound mozzarella cheese, sliced",
"0.25 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Remove large outer leaves from the heads of lettuce. Arrange approximately 1/3 in a layer on a large serving platter. Sprinkle with 1/3 garlic powder, 1/3 oregano, and desired amount of dressing. Layer with ham and Provolone."
} ,{
"@type": "HowToStep"
,"text": "Layer Provolone with another 1/3 of the lettuce, 1/3 garlic powder, 1/3 oregano, desired amount of dressing, salami, and capacola."
} ,{
"@type": "HowToStep"
,"text": "Repeat layering with remaining lettuce, garlic powder, oregano, dressing, pepperoni, prosciutto, and roast beef."
} ,{
"@type": "HowToStep"
,"text": "Layer with mushrooms, artichokes, roasted red peppers, black olives, pepperoncini, and green olives. Drizzle with more dressing as desired."
} ,{
"@type": "HowToStep"
,"text": "Top with Gorgonzola, mozzarella, and Parmesan. Cover and chill in the refrigerator until serving."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanette"
},
"reviewBody": "A real showstopper! Everyone raved, several asked for the recipe. Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Steinberg"
},
"reviewBody": "There was no way that I had a platter big enough for this display. I had a large framed mirror which I picked up for next to nothing and used that. It worked beautifully.\n\nCut WAY back on the cheese. I did not put the dressing on until just before I served it and it was just a drizzle. I put the marinated artichoke hearts in ramekins. To add more color I sliced red, orange, green and orange peppers and placed them in different areas of the platter. I ate the raw-ish roast beef before it hit the platter. Everyone thought it was done professionally. If you want something beautiful to present, this does the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "Oh this was great!!!! I loved it!!!! I followed the other reviews and used Romaine Lettuce instead of Iceberg. I also prepared the platter the day before without the dressing. What I also noticed about this recipe was usually, when I decide on making a recipe it's usually from the picture, when I saw this picture it looked Great! Unfortunately, the ingredients did not match the picture, which was fine but I wanted mine to look like the picture! All the meats were the same and the cheese's except I did use the fresh round Mozzarella balls. The vegetables were not the same in the picture I think I saw decorated radishes, my only vegetable was mushrooms. I did not use any of the spices just the salad dressing. I did not have a lot of people over for my dinner party so there were leftover which was great I was able to eat mine for lunch for the next couple of days I loved it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen Hunkins Decoteau"
},
"reviewBody": "I would never use iceberg lettuce on an antipasto tray. Riddicio would be better . That kind of lettuce would get soggy quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Ajkic"
},
"reviewBody": "Very versatile, I used things we enjoy and left off things we don't. A big hit when entertaining."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UHcougar"
},
"reviewBody": "I made this for my cousin's baby shower and it was loved by everyone. I will definitely make this again. The only thing I did differently was serving the dressing on the side. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Litherland"
},
"reviewBody": "Made this for a BIG party! Took a while to get all the ingredients at the deli and people were rather surprised at the huge platter of meat and cheese, but everyone loved it. Only downfall is, if you get all the ingredients in the proper quantity and high quality as per the recipe, it does get rather expensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WOLFECOOKIE"
},
"reviewBody": "This was great! Went faster than the lasagna that was for dinner :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terese"
},
"reviewBody": "I grew up having this with special dinners. We love it, the only thing I use different is instead of iceberg lettuce I use romaine. Sometimes we have just for a meal with some crusty bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki in CA"
},
"reviewBody": "Fabulous party platter, there is something for everyone. I have made this many times and vary it each time. Stopped adding the lettuce leaves, the salamis and other items are colorful enough. As others have said, this is pricey but always a hit at a pary. I also make sure to have good foccacia and other breads along with tasty mustards for those who want to make a mini sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Bognanni"
},
"reviewBody": "use about a qtr of the dressing in it to keep it from getting soggy and serve the dressing on the side instead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andee"
},
"reviewBody": "Another way to do this is to lay large romaine leaves around the edge of the platter. roll the salami and cheese and group together, placing in sectiona on the platter. Make sections around the edge of the platter for the olives, the artichoke hearts and whatever else you like. Put the mixed salad greens in the center of the platter. Decorate the top with slices of green peppers and tomato wedges or grape tomatoes. Salad dressing can be served on the side or poured over salad at the last minute. Make salad dressing with red wine vinegar and olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank 'exodus' Macera"
},
"reviewBody": "almost the way nanna made it. Most authenic I've seen on here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "good but not great. expensive to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Ruth Hand Pirko"
},
"reviewBody": "This is a great appetizer, lovely presentation, great flavor! It's only draw back is that it is very expensive to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "balletalyssa"
},
"reviewBody": "Didn't have the lettuce and just ended up making a pretty layout of the meats and a variety of cheeses. It was gone by the end of the party and everyone loved it! People were so glad that I brought it because it was a good assortment of a variety of foods that were different from the typical \"veggie plate\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Fabulous! I added some sliced tomatoes. This salad goes a LONG way! I halved the recipe and served 8 people with mucho leftovers (also had burgers, dogs, etc). Unfortunately the leftovers were fairly soggy the next day. Next time, if I'm not serving this as a main course, I'll make a LOT less. But it does look lovely as well as taste yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakergirl"
},
"reviewBody": "very good, but very filling. I served as a first course for an Italian dinner and guests were almost too full to eat the main dish...will make again though. would be perfect for a luncheon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HotMama"
},
"reviewBody": "The hit of the party!!\nInstead of bottled italian dressing, this recipe is far better with balsamic vinegar and olive oil sprinkled just before serving. Reduce the provolone and use whichever ingredients you have available and it is also superb. I do not always use every ingredient- usually omiting roast beef and the gorgonzola. I get asked for the recipe every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MGALS"
},
"reviewBody": "Fairly inexpensive to make and when served it was a hit! People even started putting on bread a making sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley W."
},
"reviewBody": "Absolutely phenomenal! I made this platter a day in advance...and it was still the hit of the party. It makes a beautiful centerpiece serving dish. As suggested in some of the other reviews, I decreased provolone to one pound. I also omited mushrooms and gorgonzola cheese. I cut the platter into serving pieces before adding the \"toppings\" (olives, artichokes, etc) which seemed to work well. I also added dressing just before serving to prevent everything from getting soggy. If you need to make this a day in advance, I would suggest using romaine lettuce instead of iceberg-- it would hold up a little better. I highly suggest this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZOEANNESMOM"
},
"reviewBody": "I made this on New Year's Eve. It was a hit. Everyone loved it. It made a HUGE platter. Next time, I might make a half-sized version. The lettuce gets a little soggy when eaten the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCLadyKB"
},
"reviewBody": "I began serving this recipe for family gatherings last year. Everyone in my family raves about how wonderful it is. I convert the recipe to 20 servings, which amounts to two platters, and it is always finished. Wonderful recipe! My italian family gives it 2 thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PATTERSONG"
},
"reviewBody": "YUM!! It was a bit expensive to make, but, the taste and the compliments were well worth it! We cut the cheese and meat into cubes or strips. I would add sliced red onion and garlic croutons next time. A must for pizza or spaghetti parties. We only used about 1 lb. of parmesan cheese to top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LIPSTICKFETISH"
},
"reviewBody": "Really fantastic. Fresh meats from the butcher made this exciting platter a rave at our Holiday party! Authentic Italian style."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZPARTY"
},
"reviewBody": "My family loved this one... I will however use a bit less provolone next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KDSIM"
},
"reviewBody": "This was very good --- I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JNADRIG"
},
"reviewBody": "My wife made this for the first time recently and never stopped getting compliments the whole day. It was easy and everyone enjoyed it very much. Everyone wanted the recipe. \r\n\r\nShe made it on a round platter about 14\" in diameter- not sure if that was what was intended. It cut into nice squares quite easily and was easy to serve. \r\n\r\nShe also found it hard to use up 2 1/2 pounds of provolone cheese without it dominating too much. I think she used about a pound."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDVMD"
},
"reviewBody": "Everyone went nuts over this one! Presentation was beautiful. I left out the mushrooms because I had used them all up in another recipe. I also cut the mozzarella into strips and layered on top because I wanted some of the other colors to come through. Made this the night before and put in the refrigerator; thought the lettuce might get soggy but it didn't. Again, this was a winner during my \"Italian Buffet Party.\" I needed to serve a big crowd and it worked great. A little hard to slice into pieces but we figured it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BAILEY971"
},
"reviewBody": "This is our favorite dish to bring to those \"special occasion\" parties! Everyone loves it, its easy to prepare and looks gorgeous! Thanks for the perfect crowd pleaser!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "great recipe but quite pricey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was excellent. It was one of the first things to go at the pot luck I brought it to. I made mine a little more decorative instead of just layering, it was so colorful. I left the dressing on the side so people could add what they wanted and so it would not get soggy. It is pretty expensive to put together but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I brought this to a party, and not one bit was left. Everyone wanted to know who made the anitpasto! One word-to-the-wise: it's very expensive--I think it cost me about $60-70 for all the ingredients. And you'd better get a patient deli-person to wait on you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRAMMA GORGEOUS"
},
"reviewBody": "This is soooooooo good, and especially good with hot breadsticks! My guests loved it because it is something different too. I made my own oil and vinegar dressing, and used variations on the ingredients based on what I had or what we like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Navy_Mommy"
},
"reviewBody": "I love to make Antipasto platters. They are expensive though. I didn't place everything that Wendy listed on mine, there was just no way I have a platter that big. I agree with other reviewers that you shouldn't later the meat and cheese. I will tailor my platter to the crowd I am serving too. Some times it is just meat and cheese. I agree to leave the dressing off the lettuce. I do however drizzle my veggies and meat with a mixture of olive oil and oregano to add a little extra flavor since I usually don't serve dip with the platter. I don't recommend putting the oil on the cheese though or it will get soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "I made this to bring to a New Year's Eve party and based upon previous reviews, I omitted the Italian dressing so it wouldn't get soggy and layered the meats side by side. The veggies were served on a separate platter. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Marino"
},
"reviewBody": "All the ingredients worked well together for great appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jensenly"
},
"reviewBody": "I tried this exactly as the recipe calls for and ended up with soggy lettuce in between layers of meat and cheese. The instructions for the provolone was way too much cheese and I would cut in half. I would agree with the review with suggests simply laying all the different ingrediants side by side on a platter. Great ingrediants, but be prepared to spend a few $$. This is not an inexpensive recipe! I'll try it again, and see if laying all the ingrediants side by side helps. Nov. 2004 - Back again! I tried this again with a few modifications and it was great. Left out the lettuce, fresh mushrooms, green olives and gorganzola. I was going for a very firm, compact dish and wanted to eliminate soft ingredients or anything that might be hard to cut. I layered all the ingredients in a 13x9 dish and then place it into the freezer, just until it was very cold. (not frozen, though). This enabled me to slice the dish into neat, bite sized squares which I then stuck a toothpick in and made an appetizer platter. Great hit because of the small bite-sizes and all the low-carb dieters loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A277387"
},
"reviewBody": "All of my favorites on one platter! If you’re having a dinner party you have to serve this as your cold appetizer!! I change one ingredient - I use fresh mozzarella balls. Also, instead of layering the ingredients, I arrange them side-by-side around a platter and fill in the center with the soft cheeses so that my guests may choose what they like without having to sift through all those layers. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't make the platter version but instead just mixed all the ingredients and left out the lettuce. It was amazing! Despite making a large portion, this dish didn't last long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Corbett Balach"
},
"reviewBody": "Delicious and a hit at my annual Christmas party as the \"new dish.\" A real hit. Have to have it every Christmas party now, as always requested. Instead of garlic powder and oregano, for a new taste, try Salad Supreme seasoning (found in spices) I use Romain lettuce..does not get soggy. Mix my own Balsamic dressing, balsamic, olive oil, salt, pepper, garlic and honey and just sprinkle it over the salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JWALDAL"
},
"reviewBody": "I brought this platter to a Christmas party and it was a huge hit! Everyone thought it had been professionally made! It is delicious and very easy to make. I substituted Italian Seasoning for the oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "To clarify.... Remove the lettuce leaves in their entirely, and layed out on the platter in a smooth layer. The larger the leaves the better. This is what keeps the serving squares together."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/26694/antipasto-platter/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/102/appetizers-and-snacks/antipasto/",
"name": "Antipasto Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/26694/antipasto-platter/",
"name": "Antipasto Platter"
}
}
]
}
}
, "about": [
]
}
]