				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "A Number One Egg Bread"
,"datePublished": "1998-08-25T09:19:56.000-04:00"
,"dateModified": "2023-02-23T14:10:18.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Kevin Ryan"
,"url": "https://www.allrecipes.com/cook/24325175"
}
]
,"description": "Egg bread is delicious on its own, but this slightly sweet Hawaiian concoction is sublime when used for French toast, bread pudding, or fondue."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/481-pgvToVK9u0bP9gLYGlC1AXg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2752465-495924b50e174ede83088b042295c3f3.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "A Number One Egg Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "238"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "214 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "110 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "148 mg"
,"sugarContent": "3 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 (.25 ounce) packages active dry yeast",
"0.66666698455811 cup warm water (110 degrees F/45 degrees C)",
"6 large egg yolks",
"4 large eggs, at room temperature, divided",
"0.5 cup vegetable oil",
"0.25 cup white sugar",
"1 teaspoon salt",
"4.5 cups all-purpose flour, divided",
"1 pinch salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Dissolve yeast in warm water in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in egg yolks, 3 whole eggs, oil, sugar, and salt. Mix in 3 1/2 cups of flour to make a sticky dough."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out onto a lightly floured surface. Knead with remaining 1 cup flour until smooth and elastic, about 7 minutes. Transfer dough to a well-oiled bowl and turn until entire surface is coated with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 1/2 hours."
} ,{
"@type": "HowToStep"
,"text": "Punch down the dough and divide into thirds. Roll each piece into a 12-inch long rope. Braid the three strands together and seal the ends. Transfer the bread to a greased cookie sheet."
} ,{
"@type": "HowToStep"
,"text": "Whisk remaining egg with a pinch of salt; brush on top and sides of bread. Set eggwash aside. Let bread rise until doubled in volume, about 45 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Brush bread again with eggwash."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden, about 40 minutes. Cool on a wire rack."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT205M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Deeds"
},
"reviewBody": "Nice bread. However, this was enough for two loaves, not one. So I split it and made two loaves and cooked only 20 minutes, and it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is my absolutely FAVORITE bread now! It is like a dream. Okay, it DOES make a huge loaf, but it is GLORIOUSLY huge and we love it, and, you know, Challah is a Festival Bread, so celebrate! We make it into a four-strand braid so that the \"knobs\" are smaller. It is fabulous out of the oven: you tear off a knob and butter it, it has a soft-crunch crust, and the lightest interior. But the BEST part, I think, is that it keeps for WEEKS in the fridge, and you just tear off knobs for dinner, wrap them loosely in tinfoil, warm them 10 or 15 minutes in a 400 oven until the edges crisp up again, serve them with real butter, and they are a melt-in-your-mouth DREAM. THANK YOU FOR THIS AWESOME RECIPE!!!! (SMOOCH SMOOCH!!!! :-) And to think we first tried it as a way to use up extra eggs.... p.s. We use 2 cups of King Arthur Whole Wheat Flour and the rest Pillsbury All-Purpose, a great combination. DONE AFTER 30 MINUTES IN OVEN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this twice. First time was awful, threw it out. 2nd time not much better. Was too crumbly and had no taste. With the price of eggs these days, I won’t try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adpowers0322"
},
"reviewBody": "This was soooo easy to make! Yes, there’s a decent rise time, but no biggie - just plan ahead. But this made a MASSIVE and BEAUTIFUL loaf! I mean LOOK at this thing! ????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnetteTrotter"
},
"reviewBody": "It rose much faster than expected"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Acker"
},
"reviewBody": "My daughters have made this recipe several times, it has become a family favorite. We enjoy substituting in three whole duck eggs for the three whole chicken eggs to give it a richer flavor. It makes a great gift and we are always thrilled to share this recipe from allrecipes with our friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jaime Cochran"
},
"reviewBody": "OK, first -half this recipe. Considering other peoples comments on the flavor, I added a couple tablespoons of honey and it did not help. I did like the texture of the bread. Very soft and fluffy on the inside with a decent crust. However, it tasted way too eggy. The most I can say is I'm going to cut it up dry it out and make a French toast bake with it. If you were still keen on making this, take note the cooking time should be about half of what is stated. I think I cooked mine slightly over 20 minutes and even then it was a little too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia Wilson"
},
"reviewBody": "I checked the oven 10 minutes before it came out and it looked and smelled so delicious I was so excited to try it.\n -olivia wilson -12"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sabryne F"
},
"reviewBody": "They came out great, definitely should make two loafs. I braided both, put one out freestyle &amp; put one in a loaf pan. Also, cooked for 25min and inside temperature was 205. Crust was hard due to the 2-3 egg washes, can put aluminum foil (spray first so it doesn't stick!) over it for a bit to keep from getting too hard.\nI did the 6 eggs that someone suggested and it was fine, but not as sweet as challah/egg bread usually is. Didn't like it as much. I'm guessing it was the eggs since that's the only item I changed. Will try again using recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizzie"
},
"reviewBody": "I have made this recipe 3 times. I love it! I give this recipe all the stars you can give it. I make an omelet for myself every morning with egg whites, and I am always looking for something good to make with the yolks, because my husband can eat them. I have put sesame seeds, poppy seeds, and a wash on this. I think I might make something with pecans and a tiny bit of glaze. This is a great all purpose recipe and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Tu"
},
"reviewBody": "This is an awesome egg bread/challah recipe. I used quick-rise yeast instead of active, used 6 whole eggs instead of 6 yolk+3whole, used brown sugar instead of white, substituted 1 cup of all purpose with coarse wheat flour, and added 1 tsp of honey. I did half of it and it was still a nice big loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Goodbrand"
},
"reviewBody": "Wow! One of the most amazing bread recipes EVER. Followed the recipe exactly an it turned out perfectly! Subtracted about 15 minutes from the cook time. So fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maka"
},
"reviewBody": "I tried it and overall liked it very much. It was very easy to put together.I will make it again but with a few adjustments.\nA few comments that rang a bell with me: not much flavour , very huge loaf, and not sweet enough.\nSo I am thinking that more SALT is needed - maybe 1.5 or 2 teaspoons to liven up the flavour. \nAnd maybe only one packet of dry yeast instead of two so it doesn't get so huge.\nAnd as was suggested - increase the sugar to ½ C to sweeten it up just a bit.\nAnd I used ¼ C oil and ¼ C melted butter --gotta have that buttery flavour.\nAnother comment -- try 6 whole eggs instead of the 6 yolks and 3 whole eggs -- I might try that one sometime.\nAdding a pinch of salt to the egg wash was a very nice touch.\nI love an eggy bread. Nothing quite like it. \nThank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Sistare"
},
"reviewBody": "It baked beautifully. rich color and very eggy!! I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adri"
},
"reviewBody": "Easy, soft n delicioys. I just dont know how to brad perfectly but it wash great to make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shane Allin"
},
"reviewBody": "I used only 4 cups of flour and the dough turned out perfect. I followed the recipe instructions exactly. My suggestion would be to cover the loaf for the first 20 minutes of baking as this browned way too quickly and when finished it had a hard thick crust. \n\nIt was not the most flavorful loaf of bread and all that the egg really did was make it a little heavier than a normal baked bread recipe. \n\nI will try it again to see how it works on a lower heat.....maybe 325."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "I took some reviewers suggestions and used 7 eggs ( because 2 of them were very small) instead of using eggs and yolks. I also added 1/4 cup raw honey in addition to the white sugar. I let it rise 3 times instead of twice. It made a HUGE loaf. I let it bake for 20 mins and sit in the oven a minute or two. I can see this being a staple in our kitchen!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi O'Neal"
},
"reviewBody": "This is our go to recipe for bread. It's rich and eggy. I skip the braiding and bake it into 3 loaves, either in loaf pans or round loaves on a cookie sheets. About 25 min @ 375."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DianeCam"
},
"reviewBody": "I wish I would have made 2 loaves, as this thing turned enormous. Plus, I cooked it for 40 minutes, thinking I’ll take it out early, only to find it was already a bit darkish. I expected this to be a little on the sweet side but really, there’s not much of a distinctive flavor. Since the recipe description mentioned Hawaiian ladies,, in the back of my mind, I’m thinking sweet like the store bought rolls. If I made this again, I would tweet the ingredients. As it stands it would probably make a good breakfast casserole or French toast. My house smells so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MJR"
},
"reviewBody": "My first attempt making egg bread. Pretty good, although not fantastic. Came out with the consistency of a bagel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aunt Jeannie"
},
"reviewBody": "I really wanted to love this bread. It was so easy to put together. It made large,soft , beautiful loaves. Unfortunately, it was so terribly bland. I am not sure what it is missing, but it just missed the mark on flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne Madole"
},
"reviewBody": "Melts in your mouth when toasted and is great for french toast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Princess Di"
},
"reviewBody": "Tastes like newspapers! (Sorry). Beautiful paper mache crust, this is basically 2 full sized loaves of a cream puff like delicacy. \nTo add flavor i would suggest double the salt and sugar and add half cup dried milk powder. \n.....Beware! This doubled so high it hit the top of my oven! You must divide it. Cooking time way too long. Check this at 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jarichbourg"
},
"reviewBody": "This was an easy recipe to follow, and the outcome was truly delicious. The family was fighting over every piece!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mnene23"
},
"reviewBody": "First, instead of the eggs i substituted ground beef. Then, rather bread ingredients, i used some taco seasoning that I had laying around and served it in cute taco shells...It was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary-Ellen Flynn"
},
"reviewBody": "WARNING! This recipe makes a huge \"take up the whole oven\" loaf of bread! I knew it would and separated the dough into 3 separate breads. Overall it's a good recipe. I found it to be a little underwhelming. It lacked a sweetness I was looking for in an egg bread. Next time (and I will make it again) I will add a bit more sugar. Also, it you are making 3 loaves from the recipe the cook time is only 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cari Arnett"
},
"reviewBody": "Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pmcdowell"
},
"reviewBody": "This is a very simple and quick recipe, and the bread tastes wonderful. I was making an English summer pudding which is a bread pudding with fruit. It was perfect and I had enough egg bread to make it 6 times. As several reviewers suggested, I divided it into 2 loaves, and even with that they were pretty big. I need some practice braiding, but I think they looked pretty good. It freezes well and I am planning to use the rest for a savoury mushroom bread pudding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rodrubinos"
},
"reviewBody": "Good recipe. I made two loaves instead of one. They are huge! I also changed the amount of yolks to 2 and added 5 eggs. I baked it for 18 minutes. I will do it again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe. I made two loaves instead of one. They are huge! I also changed the amount of yolks to 2 and added 5 eggs. I baked it for 18 minutes. I will do it again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alex Tantleff"
},
"reviewBody": "Very dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Halen Horner"
},
"reviewBody": "Beautiful. Perfect. First time Baker. A++ result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer St-Arnaud"
},
"reviewBody": "This bread is absolutely amazing! Be careful of the baking time though. My bread was ready after only 20 minutes. 40 minutes would over cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Simpkins"
},
"reviewBody": "My family loved this bread. I was asked to make another loaf before they were done eating the first one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alma"
},
"reviewBody": "no it was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GuineaMama7"
},
"reviewBody": "This was my first experience making bread and it turned beautifully! I made 2 smaller loaves instead of 1 but otherwise followed the recipe exactly. It was ready to come out of the oven in 20 minutes. Highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "young_baker"
},
"reviewBody": "This is an amazing recipe. It is very moist and rich without being sweet. Makes great french toast. I have made a loaf of this for thanksgiving every year for 3 years. The only time I wouldn't recommend it is if you don't have a large family since this bread is pretty big. This year I even shaped and made it into a turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CTX"
},
"reviewBody": "I made this almost exactly to the recipe, but ended up adding 1/2 cup flour because the dough was way too sticky (I measured the flour by weight so who knows if something was lost in translation). I also only needed 20 minutes bake time, bottom rack and tented for half of it. \n\nLike other reviewers, I ended up with two good sized loafs. They were extremely light, and very bland. I'll ding the recipe for the blandness, but I suspect it was my own personal preference that egg bread shouldn't be that light. \n\nI plan to use the rest in French toast, but that's about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elwood"
},
"reviewBody": "5 starts for taste and consistency, absolutely delicious. \nNeeded changes to recipe: \n\nBake time, maybe 25 mins tops, or it will burn.\n\nCut rise times in half or maybe go with 1 yeast packet. \n\nFollowing the directions exactly yielded a GIGANTIC loaf - thought it was gonna push the oven door open and make a break for it ;-)\n\nBut still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky Murrieta"
},
"reviewBody": "I made this bread and it was definitely burned and I took it out 10 minutes early. After taking the crust off it tastes great, so I will probably try this recipe again, but at 350 F instead of the 375."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janeasilver"
},
"reviewBody": "Excellent recipe, great for using up heaps of eggs. Thank you for sharing. As advised by other reviewers I just used 6 whole eggs. Used honey instead of sugar (we have bees as well as chickens). I did this in the bread machine to the dough stage. Needs to cook in foil as also advised somewhere. Made into two huge plaits - loved it:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette Flinn"
},
"reviewBody": "A very good bread. I chose to make this because I had a lot of leftover egg yolks from a different recipe. I made the whole recipe, but divided it into two braided loaves. It cooked in about 15-18 minutes. Its a little on the bland side. I'm not sure what its missing (possibly a touch more sugar?) but its a good bread to put with something- soup, spinach dip, jam, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Delbert Simmons"
},
"reviewBody": "When braiding the bread the dough began to lose it's shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmorson"
},
"reviewBody": "No changes made, but I also made buns any the kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was good, but it could be better! The texture was good, but the bread needs WAY more than 1 teaspoon of salt. I ended up with a huge loaf and was disappointed as it was sweet, but bland. I made meringue the week before and had 6 leftover egg yolks, so this recipe was perfect for me but I doubt I'd make it again unless I have leftover egg yolks again. If I did, I would definitely use closer to 3 tsp of salt. Also, I baked my loaf for 30 minutes and it was browner than I would have liked, and the interior was a bit too dry. I think 20-25 minutes would be better, depending on your oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "AnnieAnadama"
},
"reviewBody": "I did not make any changes to this recipe and was so excited to try it based on the reviews here. I'll say that I thought this baked perfectly and the instructions were fine but there is no sweetness what-so-ever in this bread. I will make it again, but most likely will omit the white sugar and add honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Little Tyke"
},
"reviewBody": "This was a easy recipe but because the batter was very sticky it was very hard to braid but it turn out well. What I found put was to wet the towel that covered the dough in hot water and it doubled the size in half the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "This recipe does not disappoint. I followed it but added 1/4 cup of honey. It turned out soft and fluffy inside and crispy outside. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laurtin2472"
},
"reviewBody": "Meh...texture was really great, but flavor was a little bland for my tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RHODE74"
},
"reviewBody": "This was ok. It was really light and fluffy but it just doesn't have much taste. My son found out that he loves it when he makes cinnamon toast out of it, so that's a plus. I chose this recipe because I had 7 leftover yolks from making meringue cookies and the only thing different I did from the original recipe was to add the extra yolk. Be warned that this makes a HUGE loaf! Mine measured 18\"x 9\"x 3.5\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SibakMama"
},
"reviewBody": "Love this egg bread. I make it super rich by changing the oil to butter and use milk instead of water. I actually make rolls with the dough rather than bread. Comes out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheVikingChef"
},
"reviewBody": "Made two beautiful loaves out of this, however did not need to be baked as long as advised...the crust was overdone at 25 minutes, but the inside perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Garden2plate"
},
"reviewBody": "We used 8 duck eggs and one used for the egg wash. 2 tablespoons of yeast and 1 1/2 teaspoons baking power. Used a 1/2 teaspoon salt. Takes 5 1/2 cups of flour in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Ann DiMuccio"
},
"reviewBody": "I LOVE THIS RECIPE. I ADDED WHITE RAISINS, BLACK RAISINS AND DRIED CRANBERRIES---DELICIOUS. ATER PUTTING ON THE EGG WASH, I SPRINKLED ON POPPY SEEDS---A GREAT EASTER BREAD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "majroot"
},
"reviewBody": "The Egg Bread was delish! I cut the recipe in half so it would serve 9 people. It was very light and fuffly. So overall this bread is a little time consuming but it was worth it. If I could fix one thing it would be is that cook it for 20min-35min it was done at 25 for me. I would totally try making this bread if I were you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Summer Wagner Miller"
},
"reviewBody": "Unfortunately this bread was lacking in flavor, big time. And the top of it from the egg white wash over browned and almost burned the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aaron S. Clair"
},
"reviewBody": "As previously mentioned, the baking time is way off. My oven runs hot so I baked it at 350 and it was well browned at 26 minutes. Splitting the dough into two loaves would also improve the recipe. The taste is unspectacular. I expected something much richer considering the number of eggs involved. I wouldn't have made it if I didn't have a ridiculous number of eggs to use up and I doubt I'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie King Tommy Lumpkin"
},
"reviewBody": "This recipe is awesome! I have made it quite a few times with perfect results every time. I am always getting requests to make it for friends. I have made it both with 6 yolks and 3 eggs as well as just using 6 whole eggs with pretty much the same results. The dough is very sticky so as some suggested I added additional flour once and the bread turned out too dry. So for me it's best to work with the sticky dough. I also have convection oven. I set to convection bake 280 degrees, cover bread with foil after 8 to 10 minutes and it's done after a total of about 24 minutes. Try this recipe. You'll love it! It makes awesome french toast as well as bread pudding! Thank you for sharing this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marie an"
},
"reviewBody": "This bread is fabulous! Light and airy. I did bake it at 350 degrees. I also put it on two pans, so the bottom would not overbrown. I found that 30 min. was enough. I used a piece of dry spaghetti to test the bread doneness. It comes out looking \"gourmet\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayce Dowdy"
},
"reviewBody": "Turned out light and fluffy. This will be my new go-to bread recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Izzy Shores"
},
"reviewBody": "I make this a lot, especially at the holidays. I like to throw in cranberries, walnuts and cinnamon. It'll blow your skirt up toasted with butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crazypoetgirl"
},
"reviewBody": "Wonderful, I have not had much success bread making in my life, but this one was easy and came out great. I turned the recipe into dinner rolls and the family just ate them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jcote99"
},
"reviewBody": "I followed the recipe as written but the bread came out very dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "83mvega"
},
"reviewBody": "The recipe is huge, and cutting it in half would yield a nice sized loaf. The bake time recommended is far too long; I baked mine for about 25 or 30 minutes. The bread is very light, however it is also quite flavorless. I will not be making this bread again, unless the french toast I make with it turns out to be out of this world... Kind of defeats the purpose of making fresh bread at home, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Meggin Lanier"
},
"reviewBody": "This bread was very light and fluffy, not the richer, denser egg bread I was hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alec Wong"
},
"reviewBody": "Overall, the recipe is excellent, and tasting it made me discover that this might very well be how some of my favourite Chinese buns are made. It came out fluffier than anything I've baked yet, and might become one of my favourite methods to use. \n\nThe only problem that I have with the recipe is that it called for much too little flour, or too much moisture. I accidentally used all 560g of bread flour to begin with, which is (I presume) all 4.5 cups, but the pre-rise mixture was too sticky, and unworkable. Seeing as how the recipe uses AP flour, this should have been more than enough, but I ended up adding...perhaps another 100g of flour to the mixture to get the cohesive unit that I am used to working with. \n\nIf anyone could post what they used in baker's percentages, that would be fantastic. I would love to make this again, but it would help to have a solid recipe for reproducibility. Thanks everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellie08"
},
"reviewBody": "Pretty good recipe! Used it to make Challah bread this past Thanksgiving and although we are not Jewish it came out excellent. The only thing I would change is cutting the recipe in half unless you are cooking for a large crowd. it is a time consuming process but can't really expect anything else since it is homemade and if done right it is worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This recipe was a hit with my family! Easy to make and so very tasty! Like many others commented it does make a very large loaf ( a bit bigger than a new born baby) but I think thats great because it is going to go fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Olaf de Winter"
},
"reviewBody": "I followed the recipe to the letter, smoke came out of my oven after 23 minutes, but the middle of the bread was still unbaked, so i let it stay in there the full 40. The outside of the bread is completely burnt, and though the inside is OK, the taste is nothing noteworthy, reminds me of bad grocery store egg bread. Maybe halving the recipe helps, but I doubt it helps the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolce Cuoco"
},
"reviewBody": "not even 2 minutes out of the oven and it's half eaten! Tip, cover bread with foil the last 15 minutes of baking, to prevent over browning, excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CookBookBabe"
},
"reviewBody": "This recipe actually teeters between 3 stars and four stars. The dough was easy to mix and kneaded well. It took a longer time to complete its first rise. Cooking time also needed to be decreased as well, so keep a sharp eye on your bread. \n\nFinished product was pretty, the texture was good, and the flavor was a light sweetness (suprisingly not overly eggy). I personally did not care for the flavor, but my husband and kids liked it. So for me it was only a 3 star, but my hubby and kids gave it 4 stars. \n\nThis makes a lot of bread (you could actually get two decent sized loaves). I cut the recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ping Lee"
},
"reviewBody": "wohoo~ first time ever making bread and I got it right &gt;__"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sashanna"
},
"reviewBody": "Wow! A positively delicious egg bread recipe. It is perfect. I followed it exactly, even though I am that person who will always change something, simply b/c I'd never made egg bread and wanted to get an idea of a basic recipe. This was so incredible! The only thing I did differently was that I made it into two basic loaves, rather than a braid. It makes two good sized loaves that are awesome for toast or sandwiches. Like other reviewers I cooked it for only about 30 minutes rather than 40 and it came out beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jim Davidson"
},
"reviewBody": "The bread was huge so you'll definitely want to cut this in half. It looked great but, when we went to eat it, we found it be extremely dry. Huge disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanne"
},
"reviewBody": "As an egg bread, very nice. As a Hawaiian bread, not so much. IF you are making this as a Hawaiian bread, add more sugar. I'm thinking of increasing the 1/4 c. of sugar to at least 1 c. I made these as Hawaiian rolls and was able to get 15 nice size rolls in a 9 x 13 glass pan. They rose incredibly well and had a nice flavor, although not quite to the sweetness of Hawaiian. Mine were done after 22 minutes, so 40 minutes at 375 was quite long- a little warning just to check them at the half-way mark. With some tweaking, I think these would make an excellent Hawaiian roll to make sliders, morning egg sandwiches and more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vee"
},
"reviewBody": "Based on other reviewers, I halved the recipe, and added an extra rise. It was perfectly done at 23 minutes. Maybe the full recipe would have taken longer? It was qiuite yummy. We ate half and froze half for another night. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ConTessa"
},
"reviewBody": "I would give this a 5 star, if not for 2 corrections I had to make. Upon reading the reviews, I decided to make 2 loaves out of this recipe instead of one. Which I was very thankful for, because it made 2 14 inch long loaves. Crazy!\nSecondly, I only had to cook it for 20 minutes instead of 45 and it was a dark, golden brown. \n\nOther than that, absolutely delicious. The people who said this is gross simply can't cook bread worth a hoot or don't know what 'egg' bread is. \nYUM! I'm putting this recipe away for later use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamers9050"
},
"reviewBody": "This was pretty good. I am not very experienced in baking bread so i used the time measurements for the risings rather then sight and wound up with an enormous loaf of bread! I will make this again, the flavor is very good but i won;t let it rise quite so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Used this recipe, and made dinner rolls instead of braiding it (baked at same temp for about 10 min). They were beautiful, light and fluffy and delicious. I served them at my brother's wedding reception and I got so many compliments!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chef Cee"
},
"reviewBody": "This recipe itself has some issues. First off, there is no way this needs to bake for 40 mins. It probably was done after 20. And it was lacking in the sweetness of Hawaiian bread that I was looking for. Don't know if I would ever try this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HappyLandWhat?"
},
"reviewBody": "This is the third time I've made this bread, it always turns out great! I use the full recipe, because I love how big this bread is. It's plain, so it goes well as an an accompaniment with other foods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itsthe_o"
},
"reviewBody": "Just a quick point, it could be that people are having different results with this because of altitude. If this recipe came from Hawaii, it's most likely a higher altitude recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "This bread turned out ok, I cooked it for 25min per others reviews, but I think that was still a little too long. It came out really light and pretty but I feel like this bread is missing something. Maybe more sugar or some honey like other reviewers suggested, or more salt like another reviewer mentioned. Overall, I would try making this bread again but definetly with some adjustments. We also found that it was very sticky kneading it at the beginning but by 7 minutes of kneading it gets a lot better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "earthchild"
},
"reviewBody": "This bread turned out exactly as I had hoped. Giant, light, fluffly and golden. I halved the recipe and still ended up with a normal challah sized loaf. To those who say this bread is bland... when was the last time you bought some bread and just ate it plain? very unusual I say. This bread is fantastic with just a little jam or honey, equally good dipped in soup or stew. Doesn't need anything at all. However, I think the addition of lemon zest, poppy seeds and some extra sugar might make it a stand alone bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ASTROPHE"
},
"reviewBody": "Not enough sugar... this thing is HUGE. It was as wide as my half sheet pan when made as a braided round wreath... so 13 inches in diameter. Baking time is too hot and too long. I did NOT preheat based on reviews warning about it. I put it in and started at 375 deg and after 20 min I started to worry, so I cranked it to 350 and went another 10 min for a total of 30 min baking. Then I let it cool. It was fine, but a little darker on top than I like. Very good texture and airy though. Also a nice yellow color and easy dough to work with. Next time I am going to try with 1/2 cup sugar, butter instead of oil, and 350 deg for 30 min or 325 for the 40 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "Truly a great bread recipe! I started by proofing the yeast. I find that this helps in getting great results with any type of bread. I used a kitchenaid with a dough hook to help with the kneading. It makes a huge loaf, halving the recipe might be better if you don't need such a big bread. Also, I cut the cooking time to 30 minutes. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prettycoolme209"
},
"reviewBody": "This recipe came out great as you see in my photo I posted, I x the recipe by 4 so I can make bigger rolls and my residents loved them when I brushed them with melted honey butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "liz"
},
"reviewBody": "The bread was okay at best. It was plain tasting. It was also very crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookies!Cookies!"
},
"reviewBody": "Great tasting bread! I made it exactly as written and turned out two large braided loaves and 4 small buns. A little disappointed in the texture. It was moist but almost crumbly kind of like a sponge cake. I was hoping it would be a bit chewier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great tasting bread! I made it exactly as written and turned out two large braided loaves and 4 small buns. A little disappointed in the texture. It was moist but almost crumbly kind of like a sponge cake. I was hoping it would be a bit chewier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikita"
},
"reviewBody": "Fantastic and simple recipe! Scaled it way down to 6 servings and shaped the dough into round buns instead of braiding. Beautiful golden brown sheen on the outside, fluffy and light texture on the inside. I sprinkled mine with poppy seeds after the second egg-wash, and they make the end result very attractive. Delicious! Make a batch today and your kitchen will smell heavenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hilda Del Real"
},
"reviewBody": "it was ok, it needs more sugar. the kneading was a sticky mess i had to add flour while i was kneading so i could free my fingers from the stickyness of the dough. it bakes really fast, i got distracted and left it over 40 min. i guess it only takes about 25 min. it was dark on the outside but the core was fluffy. i would probably modify it next time by adding sugar or honey and some butter to add flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jtimion"
},
"reviewBody": "1/2 the recipe and add a little more salt... it comes out of the oven looking great :) I will totally make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edgecliff Farm"
},
"reviewBody": "I made pecan rolls with this recipe-amazing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily Butler"
},
"reviewBody": "Delicious! Light and fluffy, crispy outside. Halved recipe, baked only 22 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathryn Ham"
},
"reviewBody": "I did the same as others and halved the dough. Made one nice loaf. I had a little problem because I was short an egg, but I just used the whites from the 6 eggs I only needed yolks of and made do. Very good bread but boy did it make a mess of my kitchen! Super sticky and hard to manage during the kneading process. Other than that, though, it was good. My first time to make it. Can't wait to put it in my French toast casserole for the morning!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ExecChef"
},
"reviewBody": "Excellent Tasty Recipe, But yes Reduce Cook time on One full Loaf by 7minutes.. comes out perfect.. This a family lover"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bsbaby"
},
"reviewBody": "I found this to be so good although I really think it needs a tiny bit more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "misscarolb"
},
"reviewBody": "I cut this recipe down to 1/3 and it was fairly easy. The bread had a wonderful texture but definitely needed more sugar, or something else...I will try again with a few changes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/6879/a-number-one-egg-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
"name": "Egg"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14742/bread/yeast-bread/egg/challah/",
"name": "Challah Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/6879/a-number-one-egg-bread/",
"name": "A Number One Egg Bread"
}
}
]
}
}
, "about": [
]
}
]