				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Apple Bavarian Torte"
,"datePublished": "1999-12-11T22:48:34.000-05:00"
,"dateModified": "2022-08-08T11:37:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "terri dallen"
,"url": "https://www.allrecipes.com/cook/50958"
}
]
,"description": "This torte is made in a springform pan. Cream cheese, almonds, and apples deck this to the nines! Enjoy this dessert with your loved ones during the holidays."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NP6HmRcAXBEPUhpLyvl8CMff22M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/366308-f984814ea7834937a212a711570aa046.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Apple Bavarian Torte"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "289"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "285 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "56 mg"
,"fiberContent": "2 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "117 mg"
,"sugarContent": "23 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 cup butter",
"0.33333334326744 cup white sugar",
"0.25 teaspoon vanilla extract",
"1 cup all-purpose flour",
"1 (8 ounce) package cream cheese",
"0.25 cup white sugar",
"1 egg",
"0.5 teaspoon vanilla extract",
"6 apples - peeled, cored, and thinly sliced",
"0.33333334326744 cup white sugar",
"0.5 teaspoon ground cinnamon",
"0.25 cup sliced almonds" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 450 degrees F(230 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cream together butter, 1/3 cup sugar, vanilla, and flour. Press crust mixture into the flat bottom of a 9-inch springform pan. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, blend cream cheese and 1/4 cup sugar. Beat in egg and vanilla. Pour cheese mixture over crust."
} ,{
"@type": "HowToStep"
,"text": "Combine 1/3 cup sugar and 1/2 teaspoon cinnamon. Toss the sliced apples with the sugar mixture and spread over the cheese filling."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 minutes. Reduce heat to 400 degrees F (200 degrees C) and continue baking for 25 minutes. Sprinkle almonds over top of torte. Continue baking until almonds are lightly browned and apples are tender. Cool before removing from pan."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "It was simple to make. Very impressed how it turned out. A very rich dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgorham"
},
"reviewBody": "I used three Granny Smith and two Honeycrisp apples, and it turned out beautifully. Next time I may go with slightly softer apples. This is delicious served warm, chilled, or room temperature."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This was the best Apple recipe I ever made. Soooo easy,.. try it. Sandy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slove2090"
},
"reviewBody": "Fan favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanD"
},
"reviewBody": "Tried as written, splitting the apple layer and cream cheese layer. Second time I doubled the cream cheese layer so it would be visible. Made a larger torte and more servings. Both times I used 6 cups of sliced Granny Smith apples--just the right amount. Put the sliced apples into microwave about 4 minutes. Quite a bit of juice came out the first time after sitting which I was afraid would make the crust soggy, so I poured some of it off and used later. While baking, the top apples started to look dry and used a silicone pastry brush to dab on some of the appIe juice and covered loosely with foil. In a glass measuring cup I made a glaze with any remaining apple juice, adding water to get to 1/4 cup, 2 heaping tablespoons brown sugar and 1 tablespoon butter. When about 10 minutes baking time left, I put in microwave long enough to melt everything and used pastry brush again to dampen the apples and bake until finished. The time I doubled the cream cheese mixture I did put a cake tester in the center to be sure the lower level of cream cheese was baked. Definitely want to refrigerate before serving. I topped slices with whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "From my experience I found grating the apples worked perfectly. Donna"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahb_philly"
},
"reviewBody": "I love this dish so much! It's my go-to for whenever I need to bring a dessert somewhere. The overlapping rings of apples make it look so pretty and garner lots of compliments. I find I need many fewer apples than called for here--2 big apples or 3 small ones is enough for 3 rings. And my best tip is to add a pinch of salt when making the crust--getting that tiny taste of savory adds to the rest of the flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pixiedust00"
},
"reviewBody": "Excellent!! It was sooo Delicious! I made one and shared it with my mom, if I hadn’t shared it probably would have eaten the whole thing by myself LOL. Made two more today one with pear and one apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily_D"
},
"reviewBody": "This was the best thing I’ve made in a while. I didn’t change anything in the recipe and in the last few hours my boyfriend and I have already finished half of it! ...oops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "I made this to bring to dinner with friends (there were 6 adults and 5 kids). I wanted to be sure I had enough for everyone, so I made 1-1/2 the crust and filling recipe, which was absolutely perfect for my 11\" tart pan. I kept the apples at the 6, which was also the perfect amount for the pan I was using (oh yeah, and I did microwave the sliced apples for 3 minutes before tossing them with the sugar/cinnamon mixture). This turned out fabulous! It was so pretty, and the taste was amazing! There were 3 teenage girls at the get together, and one of them made the comment to the other two \"we need to go to Miss Kim's house for cooking lessons!\" I'm sure it was because this dessert impressed! Will definitely make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belle"
},
"reviewBody": "Soooooo good. The crust was so buttery and tasty!!! I used a springform pan and the juices dripped out of the bottom causing a mess in my oven!! Next time i will make sure foil is placed below to minimize the mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Stevens"
},
"reviewBody": "This is so easy to make. My family and I really like it. I will be making it many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Macrina Hallaquinn"
},
"reviewBody": "So easy to make! Only substituted the sugar with honey in the cream cheese layer and xylitol in the crust, but WOW, was so delicious I had to give half of it away for fear of eating all at once!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarahbeth.510"
},
"reviewBody": "This dessert is a winner--with elements of cheesecake and pie, what's not to love? I skip the almonds so that the layering of the apples is more visible, which makes the presentation lovely. It's always a hit when I bring it to an event.\n\nAs others have noted, you can use a few fewer apples than called for, and be sure to slice them thinly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iloveit"
},
"reviewBody": "GOOD FAST EASY We enjoyed this I need to make again with a few changes for me. Use just smaller than 9 by 13 pan. I found this a little flat. All layers could be just a touch thicker.\nTook almonds forever to brown then crust started to colour.\nI will not worry about almonds as much next time or brown a little ahead. Still this was very good, fast , and I will definitely make again. 2nd time. Using the 8 by 10 much better.\nYou notice the cheesecake layer better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Cloud"
},
"reviewBody": "Just made this recipe for the very first time. It turned out great! everyone loved it! I am planning to make another one for an event this weekend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Lane"
},
"reviewBody": "Very good. I did microwave the apples. Lots of crust, shortbread like and good. Definitely going to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deanbean12"
},
"reviewBody": "I found this exact recipe on Taste of Home, it's a great recipe. I had a coworker request it for Thanksgiving &amp; offered to pay me whatever I wanted for it! \nI inadvertently almost doubled the cream cheese (one of those big blocks you cut off what you need, I used what was left) it turned out to be a happy accident. I have also made it with pecans when I was out of almonds, still awesome. It's a keeper. Not too difficult but a bit time consuming. Totally worth it. I also use whatever apples I have on hand at the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinmom"
},
"reviewBody": "Excellent. I love that it looks so elegant yet is so easy to make. I used 4 quite large Fuji apples which I cut with an apple slicer, then further sliced each section into thirds. On the advice of other reviewers, I microwaved the slices for about 1-1/2 minutes prior to mixing with the cinnamon. I also used almond extract instead of vanilla in the crust, but next time I will halve the amount because it was just a tad strong even at just 1/4 tsp. Wonderful dessert; I plan to make it for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "I've made this twice, and both times it got rave reviews. I didn't microwave the apples as many have suggested, I just sliced them fairly thin and I had no problems with them being crunchy. The first time I made it the almonds didn't brown, even after more time than suggested. The second time I browned the almonds separately and sprinkled them on top after the torte was finished baking. They didn't stick well either way, so it didn't really matter. The second one seemed to have more of an almond flavor. I did follow other reviewers suggestions and used half vanilla &amp; half almond flavoring instead of all vanilla and I liked that additional touch of almond. Good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Froyus81"
},
"reviewBody": "I will definitely make this again! Thank you for sharing this. I made a couple of additions though. I only added a bit of brown sugar for a little deeper flavor and I ground some nutmeg into the apple mixture. I think I might experiment with some of those fancy flavored cream cheeses next time, as well as bringing the crust up along the sides of the springform pan a little more to aid in serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Messy Cook"
},
"reviewBody": "Read many of the reviews on here to help with the recipe. I agree with increasing the filling mixture. However, I would have either cooked the apples stove stop or microwaved then strain some of the liquid from the apples as this made the torte somewhat soggy. Also I wouldn't reduce the crust recipe as it was the right amount (at least for the springform pan I used). Lastly since we were topping with almonds I put some almond extract in the crust which was delicious! Overall a very good recipe and would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joni Kegelmeyer"
},
"reviewBody": "Unbelievable ! Made pastry in Cuisinart, made filling in Cuisinart Used a little extra sugar all around ;-) Baked almost twice as much as recipe called for. Used a lot of apples Slice thinner next time. Improves with age."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookhealthy"
},
"reviewBody": "This was very delicious! I used a tofu substitute for the dairy product in this and did not miss the real milk. Great news for any out there with dairy allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JenniferS"
},
"reviewBody": "Excellent taste, but time consuming, crust was mushy, and failed to keep form when cut. The filling just spilled out everywhere when sliced, which may have been due to having just dumped the slices in instead of arranging them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mcs091004"
},
"reviewBody": "I was actually disappointed with this dessert. I am picky about apple desserts, but these apples were just barely cooked at all and super crunchy - made a mess when we tried to cut into it. I will definitely use the crust recipe again, but the overall torte if I were to make it again I would sauté the apples in a pan first to almost done and then arrange them in the dish. I do appreciate that I doubled the cheese mixture and layered it with the apples a few times because otherwise it would have just been a large amount of undercooked apples. I also added more cinnamon than was called for which added a lot of flavor which would have been missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hourglasscat"
},
"reviewBody": "This was good, not great. I would rate it 3 stars but everyone else really liked it, so I upped it to 4. First off, I'm pretty sure this is a tart and not a torte. Second, I had to cook it maybe 20 minutes more than the recipe called for due to the apples being undercooked. At the point they finally were tender, bits of the crust were over browned. I do not agree with others saying there is not enough cream cheese filling. I think there is too much. If making again, I would make more dough for the crust as it barely went halfway up the sides of my tart pan. I would then probably just do a thin layer of cream, maybe 1/4 inch. I also made the cream with almond extract in place of vanilla which was delicious. Next, the apples need something more to meld them together. I would maybe make some sort of a paste on the stop by cooking them a bit with sugar, apple juice, and cornstarch. Jam or something would work too. I didn't like that the apples were just kind of sitting on top on the cream and would've liked it to cook with the other layers. It also needs something to keep the almonds in place. They just fell right off the slices. All of that aside, the tart did have good flavors and was well received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marti"
},
"reviewBody": "I was disappointed in the appearance of this and handling it. It tasted fine but the apples weren't soft after the 35 minutes of cook time, so I added another 20 minutes. It still was under-cooked. Tasted fine but fell apart when I tried to serve it. Anyone else have this problem? I didn't see any comments about adjusting the baking time but if I prepared this one again, I'd double the time at the lower temperature before adding the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "attiladashuhn"
},
"reviewBody": "Wonderful taste. Since some reviewers suggested that the apples needed some softening and I don't have a microwave, I put the apple slices and some milk in the oven at 175 degrees C while I was preparing the rest.\nDefinitely going to be repeated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PSI GROUP"
},
"reviewBody": "I wasn't sure about this. But boy am I glad I made it!! Amazing! My husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Bennett"
},
"reviewBody": "Served this after Christmas eve supper, it was awesome. Will definitely make again. Made it like it was written and loved by all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This is torte always get compliments and requests for the recipe whenever I serve it. I have been making it for years. It is delicious and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "paradoxcookie"
},
"reviewBody": "Made it per direction, pretty good. Thin slice the apples and double the cream cheese filling, the best apple pie cheesecake I've had. Also good with pears as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eugenia"
},
"reviewBody": "The temperature is too high. Next timeI will try on 375 o 350 at the same time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzy"
},
"reviewBody": "Yummmmy! Yummmmy! Yummmy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizz"
},
"reviewBody": "Made this over the weekend and it was great (husband had two pieces!) I took advice of reviews and this is what I came up with: Used the original crust but doubled the cheese filling while adding 1/4 tsp. of almond extract with 1/2 tsp. vanilla. I think the key to tender apples is slicing thin, so I used four large HoneyCrisp and sliced about 1/8\" thick also taking time to arrange them as evenly as possible in a circular pattern. I baked at 450 for 10 minutes and then turned oven down to 375 for about 40-45 minutes. I covered Torte the last 10 minutes so apples wouldn't over brown. We all thought the crisp/tender apples with the cheese filling was a terrific combination (if you want soft apples, make apple pie). \nThanks everyone for the comments!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momsully"
},
"reviewBody": "I made this for Christmas Eve as a dessert everyone loved it especially my husband he couldn't wait to have it for breakfast too I followed the recipe exactly no changes and I found it to be quite easy thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "goofystitch"
},
"reviewBody": "This was pretty good warm, but leftovers the next day served cold tasted much better! The crust is more like a cookie than a dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AuntE"
},
"reviewBody": "Fantastic. I thought the 8\" springform was perfect. Each step was easy and a perfect amount for a delightful fall treat. (Good for any time though) I added craisins which was nice. Came out of springform pan no problem after taking a plastic knife beforehand just in case. Never made a torte before and I will def. do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CATLUV"
},
"reviewBody": "I made this recipe yesterday. We went apple picking last Sunday and I was looking for a simple and quick recipe.......this recipe was both and all enjoyed! Was nicely flakey and melted in your mouth and also pretty in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "This didn't come out looking too pretty (and slicing it up wasn't pretty either) but it was devoured by everyone (I only got one bite out of it), so giving a 5 star. only thing I did different was toasted the almonds a little bit beforehand. Recipe will be a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "courtneyamazing"
},
"reviewBody": "My husband could not stop talking about this torte. I made it with pears, and it was absolutely delicious. He's asked for it several times since!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Olesha1972"
},
"reviewBody": "The torte ended up so sweet it was impossible to eat it. If you apples are not incredibly sour, the amount of sugar needs to be reduced in 25-30%. \n\nSugar overpowered the cake's taste, so I'm not sure if it was good. The creem cheese tasted mediocre."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "Sent this to work with my husband and he brought me back a lot of compliments...will use for a dinner party next time..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Trenado"
},
"reviewBody": "Turned out pretty good, not sure if I'll end up making this again or not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYBELL"
},
"reviewBody": "Simple to make and looks beautiful on a nice serving plate. Taste is fabulous. Everyone loved it at our holiday gathering. This is really something special. Will make again and again when I need a nice dessert that everyone will like. Only change I made was to use walnuts (because I didn't have almonds on hand)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swolfe_2"
},
"reviewBody": "This is one of the best recipes I've made! MAKE SURE YOU SLICE YOUR APPLES THIN ENOUGH, so that you don't have the same probs as the other readers. I only needed 3 large apples (the tartness of granny smith was perfect). Make sure you don't use anything bigger than a 9 in pan, or else the yummy crust is spread to thin. Don't worry about just dumping the almonds on the top and spreading them out, they turn out toasty and fabulous! This is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bluewater Lady"
},
"reviewBody": "I needed to use some leftover apples and I am not a good crust maker...so this recipe was a hit! Easy to make and very tasty..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AuntMeeMee"
},
"reviewBody": "I made this for game night this weekend and it was a hit. My personal opinion though it was slightly to sweet. Next time I will cut back on the sugar. Also I microwaved the apple mixture ahead of time as others suggested and the texture was perfect. Also next time I will double the cream mixture of use a smallerspring form pan. It baked nicely but once it cooled down wasn't as high as I wanted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BB34"
},
"reviewBody": "yummy, made exactly as directed. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aeth15"
},
"reviewBody": "This reminds me of an apple cheesecake recipe but simpler. I made the recipe without changing anything. The baking time took longer than stated. Precooking the apples may have helped. The crust was good and easy to make. I put the crust ingredients in the food processor and then formed it into a ball after processing. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma"
},
"reviewBody": "The torte is beautiful! Like others, I increased the filling by a 1/3, and i'm glad I did. I was able to layer crust, filling, apple, filling, apple beautifully. I only needed 2 medium Golden Delicious apples, thinly sliced. I added a cinnamon sugar glaze (1/2 cup water, 1/2 brown sugar, 1 tsp cinnamon boiled over stove) at the same time as the almonds, and it bubbled SO nicely in the broiler! Basically, MAKE THIS TORTE, IT'S DELICIOUS :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KIT1"
},
"reviewBody": "I baked this last night in a pyrex glass pie plate and it stuck a little to the bottom....cream cheese layer was very flat but I guess this is different than the other autumn one on this site. Everyone liked it and I only used 2 granny smith apples which was enough apples....would probably make again and use the spring pan called for...thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "andy"
},
"reviewBody": "The base was a bit oily and the cream cheese might've been better layered throughout the apples; perhaps I've missed some instructions. Regardless of the look, 'twas tasty. Thanks for the recipe ^^."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curly Sue"
},
"reviewBody": "Amazing! Great with a scoop of vanilla bean ice cream. I pulsed the crust mixture in my food processor and used ice cold butter. I only used 4 apples, sliced 1/4 inch thick and layered them in concentric circles. I also microwaved the apples 2 minutes before layering. Soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEYIMAUSER"
},
"reviewBody": "I don't really care for desserts with fruit so this one totally surprised me. Absolutely delicious, will definitely make it again. I used granny smith apples which were a little underbaked after 25 minutes so next time will bake a little longer. Otherwise, wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahg"
},
"reviewBody": "This was excellent -- would highly recommend it. The only change I made was to follow the advice of others and sub almond extract for the vanilla in the crust. Plus I cut the butter in with a pastry cutter, rather than creaming.\r\n\r\nAnyway, the presentation was great, as was the taste. Will definitely make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheisler"
},
"reviewBody": "Great recipe! Entire family loved it. Used 3 large granny smith apples - sliced thin and also microwaved for 2.5 minutes before adding to pan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julieka"
},
"reviewBody": "Made this for a card club get together. Tasted good, and I got requests for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicolecaroline1023"
},
"reviewBody": "AMAZING! Very similar to those that I had growing up in Germany. For those that are saying that there is too much crust or that the apples are not cooked enough, they obviously don't know what a bavarian torte is, and were just expecting an apple pie. The only change I made was instead of tossing the apples in so much sugar, I just sprinkled the cinnamon on top and cut the sugar to about 2 tbsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JC1124"
},
"reviewBody": "Very good. I followed other reviewers' suggestions and microwaved the apples for about 2 minutes. I doubled all the rest of the recipe and used an 11in spring form tart pan. I had to turn my oven down quite a bit and cooked a little longer, so not to scorch the top. It turned out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SheilaP1"
},
"reviewBody": "Well, here's a strange one. My husand HATES butter - won't eat anything with butter in it, even if he can't taste it - just knowing there's butter in something will keep him away. So I didn't tell him there was butter in the crust and was nervous because I found it very buttery tasting - but he loved it and didn't mention anything about it being buttery tasting. I asked him to rate it and he gave it 5 stars!! \nThe irony is I LOVE butter - and yet I found the crust tasted much too buttery and the filling was just OK. I gave it 3 stars. I've made much better desserts.\nSo I chose the happy medium and gave it 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley McNaughton"
},
"reviewBody": "recommend making the crust thicker to get more of the taste. Also be sure to microwave the apples long enough before baking them so that they are softer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodell Olson"
},
"reviewBody": "Delicious!! I did microwave the apples as suggested, and doubled the cream mixture to make more layers. So good, made it for Christmas desert and my family LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apos159"
},
"reviewBody": "This was a wonderful dessert! My family raved about it! I used a mixture of canned pears and 1 large Granny Smith apple. I also used almond extract in place of the vanilla and did not include the almonds. I baked this in a tart pan to make a prettier edge crust. Beautiful presentation and delicious to eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetotravel"
},
"reviewBody": "I scaled it down for two portions and didn't use a springform pan. I also used blackberries instead of apples. I cooked them for a few minutes in water, sugar, and cinnamon before I topped the cream cheese mixture. I also left out the almonds. I am looking forward to trying this with different types of fruit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Guillotte"
},
"reviewBody": "Made this tonight and everyone loved it! it was easy to put together, ingredients on hand, looked so pretty. I did leave out the almonds because my children don't like nuts, but I didn't miss them at all! My SIl told me I should make this for christmas dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Kline"
},
"reviewBody": "Pretty tasty. I only used three granny smith apples, but should have used at least one more. I doubled the cinnamon/sugar. I put the almonds on before baking, and they turned out okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This was a wonderful not-to-sweet dessert (and breakfast item) that was easy to convert to a gluten free recipe. The only change was three large apples (2 Gala and 1 Golden Delicious) and baked in a 9 inch square pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a wonderful not-to-sweet dessert (and breakfast item) that was easy to convert to a gluten free recipe. The only change was three large apples (2 Gala and 1 Golden Delicious) and baked in a 9 inch square pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2ranis"
},
"reviewBody": "As others have mentioned, this is one of those desserts where it's super easy, presents beautifully, and the taste heavenly! But definitely precook the sliced apples in the microwave for 3 mins w/ the cinnamon and sugar. Also used 1/4 tsp vanilla &amp; 1/4 tsp almond extract instead of the 1/2 tsp vanilla and only needed 3 big Granny Smith apples. *Either toast the almonds before-hand or closely watch the edges of the torte after adding the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Lou"
},
"reviewBody": "totally awesome! don't change anything!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carlyjane_25"
},
"reviewBody": "This was one of the most beautiful desserts I've ever pulled off. Only change made was a sprinkle of brown sugar over the top with the almonds. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JFHVT"
},
"reviewBody": "I too microwaved the apples for 3 mins. turning every minute. Then I did 2 layers of the filling...cream cheese, apples repeat. Smelled yummy and was very good. Really best served warm out of the oven. Bet it would be great with a scoop of vanilla ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mariam"
},
"reviewBody": "I tried to follow recipe as closely as I could except for some additions: -Added 1/4 tsp almond extract to both mixtures. - precooked apples as others suggested (and let me tell u, this was necessary!)in a skillet with a splash of water -Used red delicious applesand added less than 1/4 cups sugar to them. -Added a bit of milk to almondsbefore adding them to the top and sprinkled them with a bit of sugar on top of tart. Baked 10 minutes and then drizzled the top with the leftover liquid from the apples and returned to bake five more minutes to caramelize. TURNED OUT AMAZING!! i AM SURE IT WOULD HAVE TURNED OUT GREAT IF I HAD FOLLOWED RECIPE AS IS AS LONG AS I PRECOOK THE APPLES THOUGH! UPDATE: A couple days later, some of the guests that tried the tart admitted to loving the filling part, but still the topping was not that great. Still not caramelized and cooked through enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margo"
},
"reviewBody": "Great recipe. I increased cream cheese to 12 oz and added 1 TBS of lemon juice to it and only used 3 Granny Smith apples. I also lined the springform pan bottom with parchment paper and brushed the cooled torte with Apple Jelly. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JNB"
},
"reviewBody": "Just happened to see this recipe and thought it sounded good. Boy, is it ever good!! I used 3 apples and 1 asian pear and microwaved them as other reviewers suggested. I also used 12 ounces of cream cheese. This dessert is also very easy to put together. I didnt have a springform pan so I used an 11 x 7 baking dish. It fit in there perfectly. Will definitely make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catgirl"
},
"reviewBody": "I made this for Sunday night pot roast dinner. I LOVE THIS RECIPE. First of all, it was SO EASY. Second, it looked so PRETTY. Third, it tasted WONDERFUL! I followed the recipe exactly, except I used only 4 apples, and I microwaved the apples for 3 minutes. I will be making this often. Thanks much, for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweet_peachie"
},
"reviewBody": "I've made this recipe a couple of times. I microwaved the apples for 3 minutes before cooking, as suggested. I also brush on 1 tablespoon of melted butter over the top so the apples brown nicely and don't dry out. Tastes delicious with almonds, but equally wonderful with pecans. Always a hit!! Don't hesitate to try this recipe! So easy and foolproof."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I have made this torte twice now and have gotten rave reviews from both groups I served it too. It was pretty easy but elegant dessert. Looked like I bought it at a bakery. Will keep this on the top shelf of all time favorite apple recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NOK"
},
"reviewBody": "This was yummy torte! Great for cream cheese lover!! The only thing I'd do differently the next time would be, precook apples or do something for the top... Apple on the top was kind of dried up by baking naked..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Regina's Kitchen"
},
"reviewBody": "tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Lynne"
},
"reviewBody": "5 star recipe for sure. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Lundquist"
},
"reviewBody": "I liked that this recipe sounded easy, with beautiful results. Well, it was easier than I expected. I followed the instructions, with the exception of cooking the apples in the mircowave for 3 minutes. I liked the way the photo looked and decided to layer it... from the bottom, to the top, I used crust, filling, apples, filling, and more apples (arranged in a circular pattern on top). We did not have the almonds, and so I decided on a cinnamon sugar sauce. YUM! Got rave reviews from everyone, and they were fighting over who got the last of it. This would be impressive enough for guests. Next time I may glaze it with my Cabernet Sauvignon jelly and use pears, instead of apples. Thank you, Terri, for a wonderful recipe. It will be in my holiday repertoire this season as everyone has already requested it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "Very disappointed. I shoul've known when I opened the oven door to add the almonds this wasn't going well. Juice leaked from the springform pan &amp; burnt. Then when I tried to remove from pan, after it cooled, the crust stuck to the bottom, &amp; things fell apart when transferring to a plate. The crust is good &amp; I could use that in other desserts. The filling leaves a bad taste in your mouth. It gave me a \"flashback\" to cheesecake, which I don't like. (very overpowering taste) The apples were hard &amp; I did nuke in microwave, as suggested &amp; even in small quantities."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "OMG! What can I possibly say about this recipe that hasn't already been said - it's fabulous! I didn't change a thing except to leave off the almonds as my husband isn't a huge fan of them. It took a little longer to cook and the smell was divine. When it came out of the oven I couldn't resist topping it off with a warm caramel sauce - just a little. I must say the smell from the oven was definitely an indication of how it was going to taste. My husband devoured his piece and declared that I could make this anytime!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shay"
},
"reviewBody": "Great recipe, me husband loved it. Definitely cook the apples some before assembling or else it is difficult to cut neatly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Not oonly did this taste delicious but it looked like a professional baked it. My Aunt Eleni said on a scale of 1-10 this was a 13 and insisted we take a photograph of it! The only sub I made was to use almond extract in place of the vanilla which I love and enhanced the almond flavor on top. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilieb1"
},
"reviewBody": "This is delicious! I cooked it a tad bit too much, while trying to get the almonds to look toasted. Maybe that's why it fell apart a little. I will most definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "briarsmom"
},
"reviewBody": "AWESOME! Huge hit at my Bunco party! I did increase the cream cheese to 12 oz like others had suggested and used 2 kinds of apples; Granny Smith's and Washington reds. Will most definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirsty Buchanan"
},
"reviewBody": "GREAT RECIPE and so easy!! I made two and tried different things with each and my recommendations are: 1) Resist urge to add extra moisture to the crumb mixture. Just press firmly into tin and rely on the juice from the cooking apples to bring it together. 2) Brown sugar works well as a substitute. 3) If you like cinnamon, double it. 4) Def follow others' tips and cook the apples for 3min in microwave first! 5) Pour leftover juice from apples as they cooked in microwave/cinnamon/sugar over torte once you have put the almonds on. ENJOY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "The finished product is beautiful and tasty. I'm only giving it 4 stars b/c if I had not taken the advice of other reviewers and pre-cooked the apples we would have been really disappointed by crunchy apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky C"
},
"reviewBody": "This is a beautiful presenting dessert and it tastes wonderful. I did make a few changes to the recipe. After reading the review I followed their advise and I microwaved my apples for 3 minutes after tossing them with the sugar and cinnamon. I also only used 4 tart apples instead of 6. Microwaving them did create extra juice in the bottom of the bowl so I spooned them onto the filling leaving the juice in the bow. I also increased the filling by using 12 oz of cream cheese, 2 extra TBSP of sugar and 2 eggs. I used almond extract instead of vanilla throughout the recipe. I also added dried lemon peel to the apples and the crust. I baked it an extra 5 minutes at 450 degrees. I didn't have sliced almonds so I sprinkled chopped almonds on top and baked about 5 more minutes. My family was very happy with the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitchell"
},
"reviewBody": "I would have given 10 stars if possible. Great! After reading the reviews, I did precook my apples just a bit on the stove and pre-baked my crust for a few minutes. It came out fabulous! I used Granny Smith apples. I will be making this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "I found this recipe in a magazine at least 30 years ago--wish I could remember the magazine, but I do remember it wasn't a culinary magazine. However, this has been my go-to company dessert recipe for years. It is absolutely delicious and always turns out perfectly beautiful. I've always used Yellow Delicious apples. I also press the dough 2 inches up the side of the springform pan--looks like it was made in a bakery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Hofeditz-Pilskog"
},
"reviewBody": "This is a \"kill\" recipe that I've been baking for 20+ years also. However, my version is to top the torte with apple slices dipped in cinnamon-sugar mix and then starting with the outside edge working in, place the slices in a circular pattern with the slices barely over-lapping. Warm in microwave about 2/3 cup apricot preserves. Gently spoon onto the apple slices and spred covering the entire top. Bake as directed-YUM!!!! Very pretty and looks like an european pastry. I'm sure adding almond slivers before the apricot preserves would add to the look and taste too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsey Wolnowski"
},
"reviewBody": "This was really good! I cut back on the apples as suggested by others (I used 4) and I cooked them for 3 mins, at 1 min intervals, on high, stirring after every min. Turned out great! We served it with home made vanilla ice cream, and it was fantastic! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "I made this a couple months back and I just saw I forgot to review it! This dessert is just delish! I pretty much went by the recipe except when reading the reviews, I thought I should cook my apples just a touch before adding over top. I sauteed them in a skillet with butter and the cinnamon and sugar mixture. This gave them a nice carmelized sauce. I also, when adding the almonds, made up more of a streusel type topping with some butter, flour, brown sugar, and the almonds to sprinkle on. For the crust, along with the vanilla, I added in some almond extract to give it added flavor. I ate this both warm and cold. I think I liked it best cold and served with ice cream! For me, it didnt have enough apples. So I definitely will up the apple amount next time, maybe even the cream cheese mixture as well. Thanks for the recipe! I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "I was super excited to try this recipe, but was bummed by the results. I give this 3 stars based on mine, but since I altered the recipe based on other reviews I had to provide an extra star for making (unneccessary) changes. I think it would have been better written as is. I decreased the apples and doubled the cream cheese filling as recommended by so many, but wasn't nearly as impressed as I was expecting. Not enough apples and too much cream cheese, almost like a bland apple topped cheesecake (made with above changes). I think it would have been much better, and the apple torte I was hoping for, by leaving a thinner cream cheese layer and loading up more apples on top, probably exactly as written. This is the first time I made a recipe based on recommended changes, and then found it was probably better as is written. This was for in-laws Easter brunch... I am the dessert master queen and try to live up to my expectations every time I make them something and was almost dissapointed to be serving this the way it turned out. * PLEASE NOTE THIS IS A GOOD RECIPE, I SHOULD HAVE TRIED AS IS FIRST BEFORE MAKING CHANGES. I will try again as written and make a better review then, probably better!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9543/apple-bavarian-torte/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
"name": "Apple Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9543/apple-bavarian-torte/",
"name": "Apple Bavarian Torte"
}
}
]
}
}
, "about": [
]
}
]