				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Applesauce for the Freezer"
,"datePublished": "2020-06-18T23:55:56.000-04:00"
,"dateModified": "2022-08-28T11:09:36.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Robert Crowell"
,"url": "https://www.allrecipes.com/cook/4078134"
}
]
,"description": "Make your own applesauce with this recipe using lemon juice and lemon zest to enhance the apple flavor. Great for immediate enjoyment or for freezing."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EUhjKQJWb7EN3DZk7w2cJ7F2O-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1049469-applesauce-for-the-freezer-Sue-4x3-1-ec3a138c1fa04878b485011ce84c603b.jpg",
"height": 675,
"width": 900
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Applesauce for the Freezer"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "45"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "63 kcal"
,"carbohydrateContent": "17 g"
,"fiberContent": "2 g"
,"proteinContent": "0 g"
,"sodiumContent": "60 mg"
,"sugarContent": "14 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3.5 pounds apples - peeled, cored, and quartered",
"1 cup water",
"0.25 cup dark brown sugar",
"0.25 cup white sugar, or less to taste",
"3 tablespoons lemon juice, or more to taste",
"1 (3 inch) piece cinnamon stick",
"4 strips lemon zest",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir apples, water, brown sugar, white sugar, lemon juice, cinnamon stick, lemon zest, and salt together in a large pot. Place a cover on the pot and bring the mixture to a boil. Reduce heat to medium-low and cook until the apples are soft, 20 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove pot from heat. Remove and discard cinnamon stick and lemon zest strips. Mash apples with a potato masher."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "li-hing lilikoi"
},
"reviewBody": "Forget your old idea of what you think applesauce tastes like. Make this and your mind will be blown. Seriously. I added white sugar to taste after cooking. Whirled ? of it in the blender to smooth it out and because I did not peel organic Costco apples. Four minutes, natural release 10 minutes in the IP, but half the water. Eat it warm. Top with a broken crunchy granola bar. Absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Glosenger"
},
"reviewBody": "Made it and came out GREAT! Pretty much followed the recipe used Cortland apples. Came out pink because of the apples. Again looks and taste wonderful. Will be using this recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suebeedo"
},
"reviewBody": "This is the best applesauce I’ve ever had. I used Cortland apples and I doubled the recipe. I’ll probably make more because this will disappear fast. The lemon made it awesome! Thank you so much for sharing this outstanding recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovealltennis"
},
"reviewBody": "Delicious. I will definitely make again. I only used the brown sugar. Not sure if I really needed it as the apples I used were mostly the sweeter types. As another reviewer suggested, I too put the lemon peel in a tea ball to make it easier to retrieve the lemon peel in the end. I use a dough masher to break up the apples once they are cooked. It offers a nice, slightly chunky texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Krob"
},
"reviewBody": "Best applesauce I’ve ever had and so easy to make!! My husband absolutely loves it too! I used a crockpot instead and used a blender to smooth it out. Can’t wait to make more!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Teets Noon"
},
"reviewBody": "I made this in my instapot, cooked on vegetable setting for 8 minutes and used immersion blender to mash. My husband's new favorite applesauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Terrific flavor - will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "markat"
},
"reviewBody": "This recipe turned out super. It was delicious to eat and quick to make. Only problemn was it was so good it never made it to the freezer. Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri J"
},
"reviewBody": "awesome sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Braun"
},
"reviewBody": "Very easy to make. I didn't make any changes, but next time I might try to make it with lo-cal brown sugar and/or non-sugar sweetener. Apples have plenty of carbs by themselves, so added sugar doesn't help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "I don't peel apples as therein lies lots of nutrition. I use an applesauce mill (arm exercise!), no peeling or coring , which draws most of the nutritional content from the peels (minus some fiber) and when in a hurry I use a blender but then I do have to core them. Make with monk fruit in place of sugar and add more cinnamon, because there is never too much for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SamArt"
},
"reviewBody": "The apples were from my tree but they were very small (1”-3” diameter) I tried peeling a couple but it wasn’t easy. Next time, with similar sized apples I’ll blanch them (boiling water for 30-60 seconds, then immerse in ice water for a minute or two.... easy peasy peel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D"
},
"reviewBody": "This was my first time making apple sauce, since I had a lot of apples on hand. In fact I have never been a big fan of applesauce in general. HOWEVER I am a HUGE fan now. This recipe was absolutely delicious, the fabulous spark to the recipe was the addition of lemons (which I am addicted too). Thank you so much for this recipe. AH-mazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Hyde"
},
"reviewBody": "I added some fresh ground nutmeg and 1/2 tsp cardamom. Ut was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Great recipe, and very easy! I used to help my mom freeze applesauce years ago peeling endlessly, cutting apples, and then using a pressure cooker. This was far easier; I threw everything in my crockpot and 3 hours later, done. It is an amazing, and very tasty recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEARLIE5"
},
"reviewBody": "Excellent. Very fresh apple taste and the right sweetness- my apples weren't overly sweet. I had to pick my apples off my trees after hail damage and had been cutting them up and eating them, and today it was time to use the rest of them. I had Golden Delicious and Tydeman's Late Orange apples. Made this as written except I left the peels on and put the peels that remained in the foley food mill into my blender to chop up more. Sooooo good, I liked the addition of some lemon. I added more ground cinnamon after cooking, my sticks are old. I was going to freeze some but I think I will wind up eating it all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen "
},
"reviewBody": "love this recipe. a keeper for sure! followed as directed used less white sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JillDragon"
},
"reviewBody": "I've never made applesauce from scratch before, so I honestly don't have anything else to compare it to apart from the store bought stuff - but this recipe is miles and away better. \n\nI made it with a mix of golden (very)delicious and red (not)delicious apples - about 2/3 golden and 1/3 red. The only change I made from the recipe was to reduce the white sugar to about 2 tablespoons. And honestly, next time if I use a similar mix of apples I'll omit it altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I addd some strawberries I had in the freezer that I needed to use up and this recipe still turned out fantastic. If you do that and the berries are still partially frozen, just strain out some of the juice after you cook it all. I knew I needed all the water from the recipe when cooking so followed that to a T. Will make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brasil8a"
},
"reviewBody": "The lemon juice and zest are key here! Best applesauce for me, ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim G"
},
"reviewBody": "Awesome recipe. I skipped the white sugar, which is really not needed, and used my favourite baking apples - Northern Spies. I found I couldn't get the lemon zest back out, but it was OK - just adds a bit of tang when you bite into it. Knowing that, I might cut it up a bit smaller next time, and just not worry about trying to get it out.\n\nSince my family likes our applesauce spicy, I used 3 cinnamon sticks, added 6 whole cloves, and grated in some nutmeg. The cloves and cinnamon sticks definitely need to come back out, of course!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hcserpnyak"
},
"reviewBody": "Delicious and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol markham"
},
"reviewBody": "Will now only make this applesauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn"
},
"reviewBody": "I didn't add any sugar. It turned out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Rekrut"
},
"reviewBody": "I used only the brown sugar and it was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "april"
},
"reviewBody": "Very good....followed the recipe as written. Wondered if there would be too much lemon, but it's perfect and adds a lot. Might add a little more cinnamon to it, just as my personal taste. Great without it too. I used the slow cooker and halved the recipe because I only had 4 apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LibertyBelle78"
},
"reviewBody": "Very Crock Pot friendly recipe. This was my first attempt at applesauce. I cored, but did not peel the apples, and I added a pint of blueberries. Cooked it overnight and after cooling it the next day, I removed the fruit and mashed it with the hand blender. There was quite a bit of juice left, so perhaps a bit less water is needed for the Crock Pot version. Still, it was perfect, and so easy. Plus, blending the skins in to the sauce gives it a pretty color!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spoonnlime"
},
"reviewBody": "This recipe reminds people how much they love apple sauce. I left out the lemon zest (no lemon on hand) and because I had used sweet apples I almost halved the sugar according to my taste. I left it a bit chunky too! Saving this one to make for years to come."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Canfield Peck"
},
"reviewBody": "This was the best applesauce I ever made. I thought 1 cup of water was too much so I only used a half cup. It was plenty. I will make it again with maybe a little less lemon. Delicious. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CU Lady"
},
"reviewBody": "Loved how this turned out. I put the ingredients in a crock pot for three hours on high. Ran my immersion blender through to make it smooth and it's ready for the freezer. I only used the brown sugar didn't add the white sugar. I believe the fresh lemon juice and zest is key."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaykessler"
},
"reviewBody": "I used Fugi apples and doubled the recipe and the results were great. It does taste delicious warm over vanilla ice cream! We froze it and enjoyed it for weeks! Thanks for the great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellie Mitchell"
},
"reviewBody": "This is, by far, the BEST applesauce I have ever made. Our neighbors gave us two different boxes of their apples (don't even know what kind...a lot like Gala or Fuji). I had 7 cups apples for the first batch and 8 cups for the second. Note: I put the lemon peel in a tea ball so I could remove it more easily. My family raved about it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "This is an awesome recipe! I added nutmeg and used green apples from my tree in the backyard! This will be a wonderful addition to my kids schools lunches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funmonkey"
},
"reviewBody": "So yum!!! I did happen to add nutmeg, because I love spices, but tasted before, and it was really good. Will do again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley E."
},
"reviewBody": "Made this as gifts for Christmas 2013 and four months later my family is still asking for more! My 1 1/2 year old nephew kept saying \"Mmmmmmm more apple!\" and kept licking the spoon. There's no better review in my book than that :) The lemon peels are the key to success for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneP"
},
"reviewBody": "Simple and sweet!\nI use ground cinnamon and no lemon juice/zest since I am usually just trying to use up apples and don't have these on hand. I blend it in my blender, quick and easy!\nYummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dayna Yockey"
},
"reviewBody": "I made a large quantity of this recipe with 20 pounds of MacIntosh apples. I left out the lemon zest (my preference only) and decreased the sugar just a bit. It is deliciously sweet with a little lemony zip from the juice and the tartness of the apples still comes through. Rather than freezing, I chose to can mine in small jars with two servings each. It is a beautiful consistency and texture. Thank you, I have found my applesauce recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J9"
},
"reviewBody": "Love this applesauce! I put everything in a slow cooker on high and in 3 hours it was done. I have little ones so I used the hand blender to smooth out what little bumps were left. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smokey"
},
"reviewBody": "I just finished making it and the house smells wonderful. Of course I had to lick the spatula after the last stir and.... yummmm. I cut the recipe to make about 1 quart, enough for two meals. Our Mac tree is very \"giving\" this year and I know there will be a lot of applesauce in the freezer. Thanks for the recipe robcrow and thank you for the crockpot idea Sarah Jo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "This also works out well in the crockpot. Just throw everything in the crockpot leave it for most of the day and by the time you go to fish out the cinnamon sticks/lemon peel, it pretty much is ready to go. All you have to do is run a hand blender or potato masher slightly. DOUBLES WELL."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/234078/applesauce-for-the-freezer/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1333/side-dish/applesauce/",
"name": "Applesauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/234078/applesauce-for-the-freezer/",
"name": "Applesauce for the Freezer"
}
}
]
}
}
, "about": [
]
}
]