				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Argentine Meat Empanadas"
,"datePublished": "1999-01-09T03:19:53.000-05:00"
,"dateModified": "2022-10-16T06:06:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Liliana"
,"url": "https://www.allrecipes.com/cook/24325674"
}
]
,"description": "This is my original version of the Argentinean recipe for and delicious empanadas. Any meat can be used for this recipe, just be sure to cut it up into tiny pieces."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SvjtnlHCv3HceTRmbepxeTqQ8Xc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1000801-fc1db46ee9dc47d99ef685d4336caedb.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1969072601001",
"description": "See how to make ground beef empanadas.",
"duration": "PT5M18S",
"name": "Argentine Meat Empanadas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/47078121-5d25-4bd5-9290-db43025d8860/180246e9-72e0-42cd-8383-b5eb01c3ce86/1280x720/match/image.jpg",
"uploadDate": "2021-07-12T12:53:39.068-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Argentine Meat Empanadas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "123"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "498 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "73 mg"
,"fiberContent": "2 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "327 mg"
,"sugarContent": "4 g"
,"fatContent": "37 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 pound lean ground beef",
"0.5 cup shortening",
"2 medium onions, chopped",
"2 teaspoons Hungarian sweet paprika",
"0.75 teaspoon hot paprika",
"0.5 teaspoon crushed red pepper flakes",
"salt to taste",
"1 teaspoon ground cumin",
"1 tablespoon distilled white vinegar",
"0.25 cup raisins",
"2 large hard-cooked eggs, chopped",
"0.5 cup pitted green olives, chopped",
"1 (17.5 ounce) package frozen puff pastry sheets, thawed",
"1 large egg, beaten" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Spread ground beef into a large sieve. Slowly pour boiling water over top for partial cooking. Let drain and cool."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, melt shortening in a skillet over medium heat. Add onions; cook and stir until just before they begin to turn golden, 12 to 15 minutes. Remove from the heat and stir in sweet paprika, hot paprika, and red pepper flakes; season with salt."
} ,{
"@type": "HowToStep"
,"text": "Transfer cooled beef to a bowl. Mix in vinegar and cumin and season with salt. Mix in onions until well combined. Transfer to a large plate to cool and harden, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (180 degrees C). Line a baking sheet with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Cut puff pastry dough into 10 circles. Place a spoonful meat mixture onto each round, making sure at least 1/2 inch of the outer pastry edge stays clean and dry. Add olives, raisins, and hard-cooked eggs to each round. Slightly wet the edges of pastry rounds, fold in half into half-moons, and press the edges together. Seal empanadas by twisting and curling dough together between your thumb and index finger, adding pressure before releasing each pinch and moving on to the next one."
} ,{
"@type": "HowToStep"
,"text": "Place empanadas onto the prepared baking sheet. Prick each empanada with a fork near the curled edge to allow steam to escape during baking. Brush empanadas with beaten egg."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SvjtnlHCv3HceTRmbepxeTqQ8Xc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1000801-fc1db46ee9dc47d99ef685d4336caedb.jpg"
}
]
,"text": "Bake in the preheated oven until golden, 20 to 30 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This recipe sounds great. She gives specific instructions as to how to seal the empanadas to prevent them from drying out. I wish the accompanying video would have shown that procedure and the resulting look of that empanada recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Ricks"
},
"reviewBody": "So so good, and for us a welcome new flavor pallet! The whole family gobbles them up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Odom FortWorth"
},
"reviewBody": "I have made these a couple of times. They are great right out of the oven or as leftovers for a quick snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "Good recipe but I’m surprised that the author states use the pinch method to close and not a fork. Yet the video shows a fork. I was hoping to see the pinch method but alas....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RonGoings"
},
"reviewBody": "I had the real things in Buenos Aires, these are almost as good, be careful you don't put too much in the middle you can't seal it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen W."
},
"reviewBody": "I liked the use of the puff pastry, but I found the meat to be bland. I need to pump up the spices for next time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "This recipe worked well with one exception. In my new convection oven, I didn't realize that you weren't supposed to use the bottom rack setting so for half of my batch the bottoms burned (even though I rotated per the recipe). I won't make that mistake a second time. After slicing off the bottoms, those were salvageable. They tasted good and my family really like them. Preparation time seemed quite a bit longer than advertised though. I will try these again and try some other fillings as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lillie Sanders"
},
"reviewBody": "Liked the filling. Didn't care for the texture of the puff pastry. Wil try with a pie crust mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raeroe"
},
"reviewBody": "These were delicious. They were a lot of work but very tasty. Don't think I would make them again due to the amount of work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gini M H"
},
"reviewBody": "The recipe I got years ago from a Bolivian friend used regular pie pastry. Rest much the same and fantastic dish I had not thought to use for awhile. Thanks for the reminder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "I don't know if it was just me, and it probably is, but i'd like to say this anyways. To those considering use of traditional dough, this recipe might not work. First of all, the dough ripped several times, and it was a nightmare to work with. The filling kept spilling out. I haven't tried the puff pastry yet because I followed some other suggestions, but this was one of my biggest failures in the kitchen. It also feels like you can cut the filling into 1/2 or 1/3 as there was way too much for the dough I had. Aren't empanadas also supposed to have cheese? The taste is good though for the filling, if a bit weird...I feel as though I need to tweak this recipe a lot for myself. Not saying that this recipe is bad, it just didn't mesh well with me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TNTSk8r"
},
"reviewBody": "My Girlfriend is Chilean, and this is very close to the authentic recipe. She especially enjoyed it as the raisins are more of a Chilean variation rather than Argentinian...only gave for stars because you’ve got to use empanada dough!! I used Goya brand in the red package. Also, all the steps with the pouring hot water over beef are completely unnecessary, and not how traditionally cooked...Just cook everything together, as most of the other reviews suggest. Also, I chopped up two onions as this recipe called for, but only used half as it was way too much...either way, the recipe is very close and they came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Thibodeaux"
},
"reviewBody": "I wasn't so sure about the raisins and the green olives together...but I will normally try to stay with a recipe the first time I try it...so I did...and wow! They balanced each other and each became subtle to the overall flavor. \n\nThe only thing i really changed...instead of folding them in half and sealing...I just placed another pastry on top and sealed them all the way around. I felt I wanted more filling than could be held in a 3\" round folded in half. Very good dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spatula flipper"
},
"reviewBody": "Great empanadas! I used veg oil instead of shortening and didnt do that silly hot water part in step 2 and just cooked the beef in the skillet after cooking the onions and added all the seasonings then as well. just made sure to undercook the beef a little seeing as it continues cooking for a half hour in the oven. Was a great hit with the fam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Towne"
},
"reviewBody": "I spent time in Argentina when I was a child and my Mother made these often after we left. After I married, my husband was a runner, and I made these for him and his friends after they ran. Everyone loved them--I made one small (or maybe large )change--I use pita bread that I buy from the Muslim grocery store where they make pita bread daily. It has always been a huge hit and using pita pita bread makes it much easier and it's just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rayna"
},
"reviewBody": "This is fun to make and turns out tasty, however as another user mentioned in the comments, the recipe is somewhat out of proportion; I was left with extra filling after using up the puff pastry sheets. I'd recommend either halving the filling or doubling the pastry. I may also try this with coconut oil instead of shortening and ground turkey to make it a little less fattening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janburn"
},
"reviewBody": "I used this for just the basics and then added my own ingredients like cumin, cilantro coriander, el pato tomato sauce, salt and paper. This is the first time I used a puff pastry...ever, believe it or not! This was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelissaRivero"
},
"reviewBody": "Huge hit at my niece's birthday!!\nOnly change I made was mixing the eggs and olives into the meat. And served with YUZU sauce garnished with green olives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lori"
},
"reviewBody": "We made this for our Pope party. They turned out great. Couldn't find hungarian hot paprika so just added cayanne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cat"
},
"reviewBody": "Very good,it's different,i used no salt and everyone really liked them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Reza"
},
"reviewBody": "Two problems:\n1. Puff pastry didn't complement the other ingredients well. I feel that there are better options. \n2. Amount of filling far exceeded the amount of puff pastry called for in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "A friend of ours from Argentina told me that we had to try Empanadas. I showed him this recipe and told him that I was going to make it. He told me to leave the vinegar and raisins out so I did. I also didn't have Hungarian sweet paprika so I left it out. I used freshly made Empanada dough that our friend gave me the recipe for. Turned out great!! Will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laguna Lala"
},
"reviewBody": "My family loved them. I did, however, substitute Johnsonville Italian Sausage for the ground beef which gave it a more chorizo taste. I did not use shortening but vegetable oil instead. I added 2 cloves of minced garlic, used less paprika and added some oregano and pepper and I left out the raisins. I used pastry discs from a local Mexican market. I fried ours in vegetable oil until lightly golden brown. Fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adriana mooney"
},
"reviewBody": "Loved it! with one MAJOR CHANGE...the puff pastry is too sweet. I buy the pastry rounds specifically for empanadas in the freezer section in the grocery store. There are various brands, Goya, La Cubanita, and others. I found them in St. Paul MN as well as Huntington Beach,CA. The meat preparation is fantastic. All fat is gone so they bake up beautifully. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CORILITA"
},
"reviewBody": "It was excellent. I'm not basing it on anything so I can't speak for authenticity, but it tastes great and wasn't difficult."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jbooshey"
},
"reviewBody": "I'm really frustrated by this recipe. I followed it exactly with one exception. I was able to get 12 empanadas out of the dough. That said, I don't understand the proportions at all! I had 80% of my beef mixture left over and the same for the olive mixture. What a WASTE! The recipe is a lot of work and since it is such a mess, I'd never bother with it again. Flavor wasn't near good enough to make up for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quickstepback"
},
"reviewBody": "One of my and my husband's very favorite recipes! We've used it with beef, venison, turkey and a combo of meats and they all turn out fantastically! I was a little bit skeptical about the raisins and olives at first, but then I tried it, and it was perfect. Give it a try, it's great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "I don`t eat meat, made this recipe for my mom, so there is her opinion. I made just the meat filling using Rosina`s Empanadas dough recipe from this site. I followed the recipe exactly, just omitted vinegar. This is the best meat filling we have tried so far, but we had a feeling this won`t be the one keeper. To suit my family tastes, next time I will omit raisins, because my mom didn`t like so much the sweetness that came from raisins. Green olives gave a very nice flavor, I used less than 1/2 cup. Delicious and interesting. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mbutterfly35"
},
"reviewBody": "This has become a family favorite. I usually have enough filling left over to freeze for next time, and it works perfectly! My husband lived in Argentina for 2 years and this brings back great memories for him. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "A co-worker of mine is from Argentina and his wife, who is from Italy, made them empanadas one evening for supper and he brought some leftovers in and I loved them, so I tried to look for a recipe that was similar to how he was describing she prepared them and I found this one (his wife happens to share the same name as the author!). My husband helped me prepare the empanadas, so they weren't as time consuming (I doubled the recipe as we have a lot of mouths to feed and always plan for leftovers). These were sooooo good!!!! I even used the recipe once to make a shepherd's pie when I didn't having the empanada shells :) Such a great recipe...definitely a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dragonflydreaming"
},
"reviewBody": "As a vegetarian who once ate meat and lived in Argentina, I've been searching for something along these lines to fiddle with. The only thing I changed was instead of meat, I used firm tofu, drained and squeezed of excess moisture and then sauteed with the onions and spices so it would absorb the flavors, and added a pinch of cinnamon and cardamom. Delish! Served with a glass of APOTHIC red wine &amp; a garden salad, it's perfection! Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ardys"
},
"reviewBody": "These were very tasty empanadas, but I think even a little bit spicier would have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie King"
},
"reviewBody": "Very good recipe. I added tomato sauce and a little flour to meat mixture because my boyfriends Argentinian mother suggested, and it was really good. also omitted boiling meat. used saltena brand empanada dough from frozen section of argentinian market. i like the ones that are made for oven and \"drier\" as in flakier crust. but both are good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "remi"
},
"reviewBody": "Close but not quite. I've made these several times and was shown how by my friend from Buenos Aires. We use almost the same ingredients except... No shortening, 1- white onion, No paprika- Hungarian or hot, No vinegar, 1/4 teaspoon of cayenne, and Filo dough brushed with raw egg at the seam and on top. They turned out perfect every time and tasted great. Side note- friend preferred pimento stuffed green olives while I did not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amylee828"
},
"reviewBody": "These are amazing. I used the goya empanada dough instead of the puff pastry and it turned out awesome. There are endless fillings for these doughs, and they can be baked or fried. I will try buffalo chicken and diced tomato next. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milla"
},
"reviewBody": "As a born-and-raised Argetine, these are really, really close to the real thing. I always leave the eggs out I just sautee everything together, but I wanted to say go to your local latin/spanish market and get the real empanada dough, it's much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "majhnsn"
},
"reviewBody": "We were in Argentina last year and had some empanadas. This recipe is quite authentic in flavor. I really enjoyed having them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "recipeats"
},
"reviewBody": "After getting a pregnancy craving for empanadas this morning, I found this recipe and thought it sounded delicious. I ended up doing three things different than as posted... I cut the shortening down to a 1/4 cup because 1/2 looked like WAY too much, I used 3/4 onion - again too much, and I added cilantro because I had it and thought it would be good. The reason I gave it 4 stars instead of 5, is because the lesser amount of onion and shortening was perfect - otherwise this recipe was exceptional. Will use again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bigD"
},
"reviewBody": "the ingredients sounded odd, but the end result was better than expected"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Elaine Huggins"
},
"reviewBody": "WOW!! Just like my great-grandmother used to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aksilva"
},
"reviewBody": "These were good, but as a mom with 3 school aged children they were not worth the time they took to make or the mess I made making them. I was also left with alot of extra filling. If you are considering making these buy at least 2 packages of phyllo dough so you can make extras."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aufenackeri"
},
"reviewBody": "I am currently living in Argentina and what many people do is: once you glaze them with egg yolk, sprinkle a little bit of sugar on top of them. The contrast between really salty and sweet is amazing! What is also very important is: not to cook the meat too much the first time around. Once you pop them in the oven a second time to cook the dough, it might get a little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oliveoilandchocolate"
},
"reviewBody": "I dream about these empanadas. The first time I made them, and made the dough as well, and they were amazing. I had some filling left over, so I froze it and then bought the ready-made empanada dough you find in the freezer section. They turned out dry and tasteless. Not sure if the juiciness got lost from freezing, or if the dough really made that much of a difference. At any rate, following the recipe as is was really amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "twilight"
},
"reviewBody": "I'm only rating the filling as I made my own basic dough. They were very tasty and they smelled awesome - I made them with only 1 kind of paprika (the store didn't have sweet vs. hot), without raisins and with kalamata olives instead of green. I also made some without the egg, I preferred it without egg. Good base recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JanetteL"
},
"reviewBody": "These were pretty good. The shortening can be cut at least in half or even to 1TBS and the fillling deperatley needs salt. Make sure the dough is very well pinched or they will open up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Gregory"
},
"reviewBody": "I didn't really understand how to make the half moon shape; I guess I was kinda in a hurry. Mine ended up looking like big pasties but these are really, really tasty! My husband and I had the two leftover for lunch today and I think they were even better. This recipe is definately going in my recipe book and I'll have to work on the half moon thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kezia"
},
"reviewBody": "Very good, a little greasy but I think that is normal for empanadas. Wanted to eat the entire batch. Husband and kids liked them too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "timujin"
},
"reviewBody": "These were great! I like adding golden raisins to the mixture for a contrast in flavors. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookster"
},
"reviewBody": "This is an amazing recipe! I am so happy I came across it and gave it a try. The only thing I do differently is I use margarine instead of shortening. I have tried cooking these with golden and regular purple raisins and I prefer the golden. I usually serve it with the Spanish Rice II recipe found on this website and a crisp green side (such as salad or green beans). Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VariableVeracity"
},
"reviewBody": "Excellent recipe! The dough is not quite like the empanadas I remember. This is better! The puff pastry is so light and airy and delicious. The filling was tasty too. Had lots of extra filling. Might need to use 2 packs of the puff pastry. I can see changing up the filling to whatever suits your taste. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "atomas"
},
"reviewBody": "This was wonderful. I didn't add the green olives and eggs because my daughter doesn't like them, but I think that the raisins made the dish. I used the puff pastry dough, but forgot to thaw it, so I baked those and then filled them. I am going to try the empanada dough one reviewer mentioned next time. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I made these for a Missions banquet at church. Different people were assigned different countries to prepare dishes from. These were a huge hit. The South American Table stayed the busiest all night. I doubled my recipe and made about 60 empanadas....I too chose to leave out the raisins, but added everything else. The puff pastry was a little difficult to use, the next time I will find a recipe for emanada dough and make that. Thank you for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "odessyboina"
},
"reviewBody": "This recipe was fantastic, even better than I had hoped. I made slight changes though: first of all, I had to double the amount of cumin and I used 3 tbsp of red pepper flakes (I used the ones that come with pizza) I had just a few chopped olives and I dumped the vinegar they come in along with a tbsp chopped jalapeño and a bit of the its vinegar. There is a person who said cumin is not in the original recipe, well it is. Paprika, however, is not. So I didn´t use any, believe me, I didn´t need it! The boiled egg sounded odd, but considering it is an original ingredient, I added it. It went well with the other flavors. I already had some flaky crust handy, so I used it. They were great, will make often and perfect for special ocassions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Memack"
},
"reviewBody": "These were a hit at a party.I added extra vinegar(red wine vinegar) for more flavor. I sauteed the onions and extra lean meat together. The raisins were a really nice addition to the mixture. These were definitely worth making."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntie M"
},
"reviewBody": "This was my first time making empanadas and I'm hooked! I read the other reviews and cooked the onions and meat together, then added spices. These were very easy and tasted GREAT! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MRSKJS"
},
"reviewBody": "The meat filling was tasty. However, like a previous reviewer, I too chose not to use the puffed pastry and opted for the dough from the Empanadas Fritas de Queso recipe. All in all they were very good. I did not have any raisins so I substituted with craisins. Next time I think I will try it with my pie crust instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Moser"
},
"reviewBody": "Great recipe. I changed it up a little. I used a leftover spoon roast I had from the night before and minced it a food processor. I also made pizza dough to use as the dough. I also tried it with puff pastry-but the pizza dough was easier to work with and tasted great. I also added fresh cilantro. It was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BratCat"
},
"reviewBody": "Made these and they are excellent. Had extra meat left. Made more and froze them. They cook and taste great just like the first day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "peebsy weebsy"
},
"reviewBody": "After reading all the great reveiws on this I was excited to try this recipe. But the end result was nothing special. I did make my own empanda dough from scratch (from another recipe on this site) rather than using the puff pastry. I also substituted some chopped up baked potato for the hard cooked egg since the egg seemed odd to me. And, as suggested by other reviewers, I cooked all the filling ingredients together rather than following the directions in the original recipe. I did, however, use only 1 tbl of olive oil to cook everything in instead of the 1/2 cup shortening as in the recipe since that seemed very excessive. Maybe that lack of fat was what gave my filling a somewhat dry texture. We also found the seasoning to be rather bland. For all the effort that went into making these, these were only ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ETAINL"
},
"reviewBody": "Excellent dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyByrd"
},
"reviewBody": "This was really flavorful - I liked the tang of the olives and vinegar with the meat. I doubled the recipe and made big, main-sized empanadas instead of the smaller ones suggested here. As a couple of reviewers suggested, I browned my beef with the onion, and also added green peas with the egg and olive. I did have a devil of a time with the puff pastry - but that's just me, I won't make you suffer for it. Very nice! Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ELIZALIZ"
},
"reviewBody": "Made it exactly as the recipe states and my familt loved it. It's a bit of work but worth it to see all the food disappear! No leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Go to the frozen foods and get the Goya or Saltano brand of empanada dough. You won't get an authentic empanada with puff pastry. You can fills these with veggies, chicken, ham and cheese (sprinkle oregano for an authentic Argentine flavor). In Argentina they use different patterns in the crust edges to distinguish the type of empanda that you are eating. In my opinion the raisins are a more Chilean style and my husband's family, nor our friends include them, but I'm sure this varies from family to family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "allibeek"
},
"reviewBody": "This was awful! The dough made the flavor bland and dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Hanks"
},
"reviewBody": "My husband lived in Argentina for two years and he said it tasted just like an authentic empanada. It was really yummy! thank you for this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yvie b"
},
"reviewBody": "Soooo good!!! Tasted very authentic and reminded me of the dish my aunt made when I was little.\nI made just a few changes for a naturally sweeter version. I substituted 1 ½ red apples in place of olives, rice vinegar instead of white vinegar, and left out the red pepper. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel P"
},
"reviewBody": "I only made the filling from this recipe (made my own empanada dough from scratch)and it was great! Very authentic tasting! I am only giving it 4 stars instead of 5, because traditional Argentinean empanadas are made with dough and not puff pastry. Also, you can simply saute the beef before using...no need to make it more complicated by using a sieve. It ends up tasting the same. Give this one a try!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "momma_s"
},
"reviewBody": "What completely makes this recipe is a real empanada crust, not a puff pastry. For this, try the dough recipe from the \"Empanadas Fritas de Queso\" recipe. It's more work than a ready-made crust, but so worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sweetzang"
},
"reviewBody": "I really get raves about these Empanadas, but personally there is something missing, maybe more salt, or Adobo? But I do love them and would recommend the recipe to people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jang"
},
"reviewBody": "excellant. very authentic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rebeccalovestocook"
},
"reviewBody": "I thought this recipe was great! I made some changes from the original which is why I gave it 4 stars instead of 5. I didn't use the shortening, but used just a tiny bit of olive oil. I also added some garlic and peas, and ommited the eggs and olives. Also, I used a mix of raisins that had 3 varieties. It turned out very well!! Putting it together was time consuming, but worth it! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KYLIEHINE"
},
"reviewBody": "I found some spanish frozen dough in the supermarket and it was fine, I fried some and baked some, definatley baking them is MUCH better. I left out the shortening and raisins. I put too much paprika oops but my husband LOVED it anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TinyTurtle"
},
"reviewBody": "Thank you! I am originally from Paraguay, love empanadas! Reminds me of home. The only thing we did differently was add green olives, it adds a unique flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Fuselier"
},
"reviewBody": "I substitute the meat for any leftover meat that I have on hand such as roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "the empandas would taste better if you used real empanada dough.you can get it at any international store..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just didnt like this recipe. i made 2 batches and both times didnt like it. it was greasy, and had way too much stuff in it. will not make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "just wanted to note -a below user said it didnt work with filo, thats because the recipe calls for puff pastry. They are 2 different things!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LUCKEYS9"
},
"reviewBody": "the combination of flavore was very good. I added almost double the spices called for to increase the flavors. Family and friends loved it. A little time consuming but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KALTROGGE"
},
"reviewBody": "The filling is delicious and my family loved them, but they are little time consuming, and I didn't get as many out of one package of puff pastry as I would have like. I think next time I'll try them with a plain pastry crust, as more puff pastry is too expensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LEAPIELEE"
},
"reviewBody": "Really tasty, but way too greasy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AHAMMER"
},
"reviewBody": "My mom is from Peru and she makes empandas from a very similar recipe. This recipe gets two thumbs up for its authenticity! The only difference between my mom's empanadas and this recipe is the way you cook the beef. In my mom's recipe the beef is fried with all of the seasonings and onions. It is then drained of its excess fat. 80% lean works best because it prevents the meat from getting dried out when baking. I grew up eating beef empanadas and they are great! I think condiments really add something to the empandas; we always ate them with either lemon squeezed over them which works really well with the sweetness of the raisins and the spicyness of the paprika. The second option was to pour a few shakes of hotsauce to into your empanada. Cayenne peppersauce is excellent on an empanada!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We just weren't impressed. Thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cindy Motz"
},
"reviewBody": "these took forever to make and were a complete disaster. the fillo was too thin for such filling, the filling was bland, and they were not visually appealing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KUTTYKNU"
},
"reviewBody": "These were great. I actually mixed the eggs, olives, and raisins in with the meat mixture to save time, and it turned out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TINISIA"
},
"reviewBody": "This recipe was great. Just a little bit greasy. Reduce the amount of oil and it'll be perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EARTH*ANGEL"
},
"reviewBody": "This was a really delicious. I made a few changes though. I added diced, precooked pototoes and a lil bit of frozen peas and it was delicious. I served it to a few friends and they all loved it and wanted the recipe. I also used puff pastry.This is a keeper!! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this dinner for our household and took some over to the neighbor. Everyone, aged 1 to 65, LOVED it! Very simple to make. I did subsitute Ground Turkey for the beef. This wasn't greasy at all. Vary good! iserved spanish rice and put my left over meat mixture in the rice. MMMMMMM and served that with tortillas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a different crust but followed the meat recipe and my family loved it/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "super yummy!\r\nlike i remembered when i was in s. america"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely delicious!!!! What an awesome recipe... I lived in Chile for awhile, and empanadas were a mainstay.. but I love this variation with the phyllo dough!!! Would love to know if there are any variations for the cheese and chicken empanadas!!! Thanks for a great recipe..."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12512/argentine-meat-empanadas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
"name": "South American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2432/world-cuisine/latin-american/south-american/argentinian/",
"name": "Argentinian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12512/argentine-meat-empanadas/",
"name": "Argentine Meat Empanadas"
}
}
]
}
}
, "about": [
]
}
]