				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Armenian Rice Pilaf"
,"datePublished": "2019-04-02T02:45:59.000-04:00"
,"dateModified": "2022-12-13T13:12:03.000-05:00"
,"author": [
{"@type": "Person"
,"name": "5lilblessings"
,"url": "https://www.allrecipes.com/cook/905586"
}
]
,"description": "This easy-to-prepare rice dish with noodles and chicken broth is a staple of Armenian homes. It&#39;s great as a side dish with baked chicken."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hoxmqLVPfMA653la4nw54rbqhjw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1034039-armenian-rice-pilaf-Sandria-Woloschuk-4x3-1-2c1adc07a62e41a6988d064c579f1fa0.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Armenian Rice Pilaf"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "118"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "535 kcal"
,"carbohydrateContent": "85 g"
,"cholesterolContent": "48 mg"
,"fiberContent": "1 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1976 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.5 cup butter",
"1.5 cups uncooked fine egg noodles",
"3 cups uncooked long grain white rice",
"5 (14.5 ounce) cans chicken broth",
"4 cubes chicken bouillon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in large saucepan over medium-high heat. Add the egg noodles and stir until they begin to brown, being careful not to burn the butter. Stir in the rice. Continue stirring until rice is coated with butter."
} ,{
"@type": "HowToStep"
,"text": "Pour in the chicken broth and add the bouillon cubes. Bring to a boil; reduce heat to low and cover tightly. Cook without uncovering pot until all the liquid has been absorbed, about 20 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjollimnraymsncom"
},
"reviewBody": "My wifes grandfather came over from Armenia in 1914 bringing with him family recipes. I tried this while she was away. It turned out nicely and had an almost custard like texture. The grandchildren liked it almost as much as grandma's. If you like pilaf this is a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane N (Dee)"
},
"reviewBody": "Love this dish my Mother in law who passed before my kids were born used to make this all the time. So glad to find what is essentially her recipe (she used regular egg noodles) so I can make it for my grandkids ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erienne"
},
"reviewBody": "We didn’t add the noodles since we had to go gluten free and just replaced it with more rice. It came out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Silverman"
},
"reviewBody": "It is amazing. It’s enough rice though to feed an army. Definitely more than 6 portions. More like 15. The taste is amazing! I have even made this recipe super low sodium due to the grandparents and it turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Serpa"
},
"reviewBody": "Absolutely the best Rice Pilaf!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Nyquist"
},
"reviewBody": "It was very good. I added the celery while the rice and pasta was cooking. Also, I cooked the mushroom seperately and added them at the end. Every (almost everyone) like the dish, although some did pick out the muchrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Johnston"
},
"reviewBody": "It came out perfect. I did add a half cup of Parmesan at the end because I wanted to use it up. It was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hilary Newman Steves"
},
"reviewBody": "Loved it as is! Didn't make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KitchenQueen(not)"
},
"reviewBody": "It was very tasty, but a little too salty. Next time, I’d use low sodium chicken broth and maybe unsalted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "penny"
},
"reviewBody": "looking for a variation on basic rice I used this recipe as a guide but I had to use what I had on hand. I had angel hair pasta and jasmine rice. worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "Excellent! Instead of the cans of broth I used organic chicken base 1 tsp. per cup of boiling water; 2 cup of rice 3 cup of broth.\nperfect as is. Each time I make I follow one of the suggestion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie C"
},
"reviewBody": "My husband and I both enjoyed this. I did add a little sauted onion, carrot and celery but other than that left it pretty much per the recipe. It was good the first time with baked pork chops, then we had some topped with a beef green chile stew. I still have some left, and I have some leftover chicken, so I think a little chicken fried rice is still in the works. Much more than 6 servings, at least for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Gerald Gaudreau"
},
"reviewBody": "The amount the recipe called for made more than 5 servings. No problem! It was an awesome dish and glad to have leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken Easterling"
},
"reviewBody": "I made this and we led it. However in the picture it looks like it has sliced mushrooms and maybe sliced celery in it. I might add some vegetables to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Haleblian"
},
"reviewBody": "Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Cerny"
},
"reviewBody": "This is a great comfort food! It's like a really good Rice A Roni--buttery, herby, and lovely chicken flavor. My grocery store doesn't have the fine egg noodles, so I just crush up medium egg noodles. I also make it with brown rice instead of white...I just parboil the brown rice for about 20 minutes. I've found that I sometimes have to increase the butter and number of bouillon cubes until it reaches that perfect point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Howard"
},
"reviewBody": "I am the original poster and half Armenian. This pilaf recipe is a rather plain one but this is this recipe for regular chicken rice pilaf. There are many different kinds of pilaf....some that call for oysters and pine nuts, some call for currents and many diverse seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "This was plain, had too much butter, almost greasy. Update: I made this a second time with basmati rice, roasted pine nuts, diced onion, celery, mushrooms diced, and garlic powder. Just a few 1/4 cup of each of the vegetables and a shake of the garlic powder. I added the vegetables to the pot just after sauteeing the noodles. This is a versatile base recipe in that you are able to add other flavors easily. This recipe certainly makes a ton of rice, even cutting the recipe in half, I had 2 days worth. I cooked it in a Le Creuset douch oven for 25 minutes and left it covered after I turned off the stove for another 10 minutes for the excess liquid to absorb. I usually can't cook rice, but I succeeded with this recipe. Eureka!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mlchandl"
},
"reviewBody": "I've made something very close to this and it's from a family friend who's Armenian. Once you brown the egg noodles add salt and powdered garlic and mix. Then stir in rice and mix. Then add enough chicken broth to go up one inch above the rice and boil until the broth goes below the rice level (you won't see the liquid anymore). Then lower heat and let sit until all liquid it gone. It's my favorite rice. I don't measure the amount of salt or garlic, no one in my family ever has, I just watched them make it to see how much they put in. But if I had to guess (with 1 cup of rice and 1/2 a cup of egg noodles) maybe a teaspoon of salt maybe a tad more and tablespoon of garlic powder? Keep trying and you'll make it to taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melcooks"
},
"reviewBody": "different . ok but nobody raved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Staritz"
},
"reviewBody": "good, flavorful, but too much money for rice (5 soups, 4 bullion, etc adds up)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEAH CUSTARD"
},
"reviewBody": "I add some cumin to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Wheeler Caldwell"
},
"reviewBody": "Love this recipe. We use Ramen Noodles and it is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "We enjoyed this very much as a change of pace to my regular rice pilaf. I didn't have egg noodles so I used fideo that I had hanging around the cabinet and I added some caramelized right before serving. Super yum I'm glad we have leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KELARJIAN"
},
"reviewBody": "Same basic recipe that has been in MY Armenian family for 3 generations (in The USA) and my little ones are starting the 4th generation now. The old timers would sometimes top it off with plain yogurt or diced tomatoes as do I. I also use sea salt and fresh, finely cracked white pepper and maybe a bit less butter. I strongly recommend using converted/parboiled rice as it doesn't clump though basmati and jasmine are pretty darn good too as is large milled cracked wheat (bulgur). BTW: I too prefer orzo. You can pre-brown this (the trick always is to get it only GOLDEN brown)in a slow/moderate oven layed out thin on a backing pan stirring several times. Put it in a jar, then mix ALL other ingredients in a rice cooker and sit back and have a drink. FIVE STARS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lkgeorge"
},
"reviewBody": "David really liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coluembe"
},
"reviewBody": "Made it for Christmas last year. It was loved! Even by all the picky kids. I made mine with orzo pasta intead of \"fine egg noodles\". Worked beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misty"
},
"reviewBody": "I halved the recipe and used homemade chicken broth. We loved it. Served with Baked Pork Chops from this site and steamed broccoli. This does make alot, will have plenty of leftovers for lunch tomorrow. Thanks for posting, 5lilblessings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen P."
},
"reviewBody": "This pilaf was delicious just as written. There are lots of additions you could make by adding vegetables or chopped chicken but I love the ease and simplicity of it just the way it is. My only question is serving size. I halved the recipe and it was enough for at least 6 servings. If you make the full recipe, you can serve 12 more people. Thanks siliblessings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. C."
},
"reviewBody": "This is the way I learned to make rice pilaf from my grandmother who was part Lebanese. So delicious. This particular recipe makes enough to feed an army!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Crossen Baquet"
},
"reviewBody": "I have made this recipe many times. My family and I really love this recipe. This recipe makes a whole lot of rice pilaf. Delicious recipe that I will continue to make over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol Rasberry"
},
"reviewBody": "Seems more like the beginning of a recipe to me. Kind of bland. I guess that might be what they were going for. I have made rice cooked in broth many times, not knowing it was Armenian. I used vermicelli noodles and followed the recipe to the letter. Not sure what all the fuss is about but it's okay. I would probably add some veggies next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Maxwell"
},
"reviewBody": "Tastes great! The kids &amp; everyone loved it. However I find that with the amount of liquid it calls for the rice ends up being lumpy &amp; sticky. Then again I had chicken stock in a container not a can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "McCrearyacres"
},
"reviewBody": "If I could just rate the taste of this dish vs. the whole \"dish experience\" this would be 8 stars. BUT the calculations for number of servings is ridiculously wrong--I fed 8 people off of this recipe (as a side) as written and if the leftovers are any indication--we'll be eating this for the next 39 years. We at spicy Korean tacos as our main course &amp; needed something to off-set the heat--this is the perfect recipe. Don't expect this to be anything more than it is--rice, vermicelli &amp; chicken stock. It will be mild tasting, but a very great side dish (but I strongly suggest not taking the serving size mentioned in the recipe as a good estimate)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Renner"
},
"reviewBody": "Yummy! Kids and hubby requested I make this again, and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "terriyaki2"
},
"reviewBody": "This has potential but, is pretty boring without adding at least some peas, diced carrots and herbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmoore214"
},
"reviewBody": "This was really good! I cut the recipe in half and it made a ton. \n\nI fried the rice with a little garlic and chicken seasoning. I also used some stock from a chicken I cooked in the crock pot. \n\nNext time I make this, I am going to check it before 20 minutes. The rice was slightly over done, but that may be because I am not used to an electric stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vannamei"
},
"reviewBody": "Only one suggestion: after 20 minutes of simmering remove pan from heat and let \"rest\" (covered) for another 20 minutes. Simply recipe and always comes out perfect. No need to mess with it or doll it up, as my mother would say."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMYLEE01"
},
"reviewBody": "Exactly the taste I was looking for"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "Quiet and understated, just what I wanted to serve alongside a fish entree. I used orzo rather than fine noodles and added fresh chopped parsley at the end. Scaling this down to one serving, and then making half of THAT, served the two of us quite sufficiently."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spunky Buddy"
},
"reviewBody": "White rice can be boring but browning it first in butter along with a little pasta, then cooking it in chicken broth added much appreciated flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tahitian4rmj"
},
"reviewBody": "My father is a quarter Armenian and used to make this during the new year. This tasted just like his if not better. Yumm..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "quiltersammy"
},
"reviewBody": "Scaled this down for two people. It was quite good. I added some diced onions and cooked it altogether in the microwave (in a 'special' rice cooker). Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JLD5010"
},
"reviewBody": "Quite tasty! I added fresh garlic, minced onion and mrs. dash seasoning. I scaled it down to 2 servings and it made a HUGE amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "I halved the recipe and it still made a ton - very good and served with armenian kabobs with warm flour tortillas to wrap kabobs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Lloyd"
},
"reviewBody": "We really liked this dish. Used instant rice and it only had to cook for about 10 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RosewayRenee"
},
"reviewBody": "My Armenian son-in-law really liked this and said it tasted like back home. I felt it was acceptable, but a little flat, flavor-wise. Next time, I think I will add some caramelized onions and a dash of garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1PICKLELOVER"
},
"reviewBody": "You really don't need 1/2 c of butter -- just a tablespoon or 2 is plenty. The rice/pasta and broth proportions are also a little off -- 2 to 1 still works as the rule of thumb. A little onion or garlic powder are good additions. All in all this is a great, very versatile side dish alone -- or can be a great start to a rice casserole. MMMm! Thanks! btw - this makes MUCH MORE than 6 servings!! But that's ok - it's great leftover too! ( :"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "photojenny25"
},
"reviewBody": "This rice was absolutely fabulous!! I served it with roast chicken, and it complimented the chicken so well. I've been looking for that \"perfect rice pilaf\" for quite some time, and this recipe really delivers! I used broken spaghetti, and next time I'm going to make sure to break them into smaller pieces, because my husband thought the texture mix was a bit strange, but the flavor was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline"
},
"reviewBody": "This rice is excellent!! I made 1/2 the portion and there was plenty of rice - including leftovers. I've prepared it a few times now &amp; it always comes out perfect. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Some people add a generous sprinkling of prepared apple pie spice, that is similar to a blend of spices used in the Middle East. I liked the idea of adding a chicken boulion cube to the chicken broth for more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Some people add a generous sprinkling of prepared apple pie spice, that is similar to a blend of spices used in the Middle East. I liked the idea of adding a chicken boulion cube to the chicken broth for more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redskit"
},
"reviewBody": "oh my goodness sooooooo good.. And I scaled it down to 2 and it made A LOT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andromeda Annie Gowin"
},
"reviewBody": "I like this a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like this a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRindell"
},
"reviewBody": "I halved the recipe and it made enough for at least 8 people. Used orzo pasta for that traditional rice pilaf texture. Very tasty and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "magdelaine"
},
"reviewBody": "Rice-a-Roni without the box or artificial flavors. This is now a staple on our table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stellarwbz"
},
"reviewBody": "OH MY GOSH! This rice is the best. My grandma made this rice when I was growing up. We had white rice with dinner every night and every once and a while she would make this rice. It was a special treat. I am glad that I found out how to make it because it reminds me of her. My (very white/american) boyfriend said this is the best rice he ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey"
},
"reviewBody": "We really liked this easy side dish! I scaled it down to 2 servings because I read that it feeds more like 15 people instead of 6. Very tasty! I will definatly make this again! Thanks for sharing:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkoo80"
},
"reviewBody": "This is a really easy, tasty side dish. This recipe is NOT 6 servings. It is A LOT of rice. I would say closer to 12!! I made it in my 2.75 qt. dutch oven and the rice reached the top of the pot by the time it was done cooking. Also, the recipe seemed to call for a lot of liquid so I cut it down to 6 cups of broth (1 cup rice=2 cups liquid) and it came out perfect. I don't know how it would have worked with 5 cans of chicken broth. I only used 3."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "Great staple recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Jo"
},
"reviewBody": "Very good. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "g33kdot"
},
"reviewBody": "I thought this sounded good when I read it and boy was it. I didn't have fine egg noodles so I used extra wide, and they worked fine. I only used 1 tsp of bouillon (1 cube) instead of 2 for less salt, and used basmati rice. Topped the pilaf on a bed of chopped uncooked kale and served with lightly seasoned chicken and sweet corn (got the corn idea from another reviewer). All in all it was a delicious dish. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yasmin Melody Koch Zraikat"
},
"reviewBody": "Some of the best rice i have ever made!\r\nUpdate: I still make this recipe now, years after my first rating. It's buttery, flavorful, decadent. \"More rice, please\" is the refrain when I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kckooks"
},
"reviewBody": "I loved this rice. I only made half since there were just two of us dining. I was serving it with beef and was worried about it having too much chicken flavor, so I only used the bouillon and not the broth (but I'm sure it would have been great with the broth). I also love a the rice at a Greek restaurant in my town, where they add cinnamon. I added cinnamon to taste and it was wonderful!!! Thanks so much for the guidelines!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICHK35"
},
"reviewBody": "I thought it was pretty good but the family really liked it and want me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "Wow! Such a simple recipe, but tasted sooo good! THANK YOU! I sort of pared down the ingredients to make only 4 servings, about 2 Cups perhaps, and it was just enough, and delicious. I did use thick spaghetti and basmati as those ingredients were on hand. Broke the pasta into 1\" pieces (1/2 C) and used 1/2 C rice, 3/4 C sauteed mushrooms, 2 C chicken broth, about 1 T butter and 1 T olive oil, salt and pepper to taste. Has anyone put toasted almond slices in this yet? It just seems like a great base for building flavors and greating an even more elaborate side dish, or a main dish even. I appreciate the original recipe- thank you, and you've inspired me to play with it a bit (play with my food, if you will!). If I come across a great combination of add-ons, I'll post here, and on my blog, if anyone wants to know, or share back and forth for the fun of it- http://michaels-killer-recipes.blogspot.com/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CRAZYKIDZ"
},
"reviewBody": "The taste is delicious, but I made some changes to fit my family size (6)... 1/3 c butter, 1 cup noodles, 2 cups rice, 4 cups broth &amp; 3 bouillon cubes. After melting butter, browning noodles and adding rice, I transferred to the rice cooker &amp; added the broth &amp; bouillon. 4 cups of liquid is more than enough for 2 cups rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbraddock4"
},
"reviewBody": "I didn’t know what to do with the half a bag of fine egg noodles I had sitting in my cupboard, typed \"fine egg noodles into the ingredients search and this was the first thing that came up so I though I would give it a shot since I had all the ingredients on had and it came out Delicious! I cut the serving size down to two since I made this as a side dish for me and my fiancé, and man was there a lot! future hubby thought it was FANTASTIC and asked me if it was easy to make (I’m sure I will be getting request for \"that rice noodle stuff you made that one time\" pretty often!) Thanks for the great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy G."
},
"reviewBody": "This was the best rice ever!!! It was so buttery and delicious. I made it for a BBQ as a side dish and everyone was fighting for leftovers to take home. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NICKA"
},
"reviewBody": "I followed recipe as written. It was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JED901"
},
"reviewBody": "I made it per the recipe, only I cut it in half. It was a delicious... and improved... change from packaged flavored rice mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdmccarley89"
},
"reviewBody": "Very good and very fast and easy. Would go great with almost any chicken dish. We used normal spaghetti noodles broken in half and it tasted just fine. Remember...the more butter the better. =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leia Davis"
},
"reviewBody": "I added some garlic and onions when i was browning the noodles/rice, and cut the bullion in half. Great recipe, everbody loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "QueenKey"
},
"reviewBody": "I am only going to give this 3 stars because although it tastes good, (how can you go wrong with butter) the taste was not worth the calories. It made a ton of rice and noodles. My husband thought it was a little bland and asked me not to make it again. I froze the left over rice and I will be using it in other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAE921"
},
"reviewBody": "PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni in Indiana"
},
"reviewBody": "Very yummy! This is the rice recipe I have been searching for. However, I think next time I make it I will use orzo instead of fine egg noodles just for looks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "petitchameau"
},
"reviewBody": "So simple, and what a great taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KGora"
},
"reviewBody": "I scaled this down to one serving for my husband and I. We ate plenty and still had enough left over for at least two more people. I used thin spaghetti and jasmine rice because that is what I had on hand. I also skipped the chicken boullion because I didn't have any. But since I always use low sodium chicken stock it ended up kind of bland (not the fault of the recipe) so I added a little chicken seasoning. I did think the amount of butter was a bit excessive because it left the lips feeling a bit greasy. This was a good quick and easy side dish I will make again. Reminded me of a little of chicken flavored Rice-A-Roni."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beamerz3"
},
"reviewBody": "Had this for dinner tonight and it was great!! I didn't change a thing, made it just like it was listed. Thank You for the recipe it is a keeper!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann"
},
"reviewBody": "Made this tonight for 8 people and it was wonderful. It looks good when it was served and tasted just as good. Very easy! Definitely a keeper. I made it exactly as the recipe stated but because I had 8 guests, I doubled the recipe. It makes a lot!!! Everyone ate large helping and some took seconds and still had a lot left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VIVNIDHI"
},
"reviewBody": "Made no changes other than use whole wheat egg noodles. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ"
},
"reviewBody": "Quick and easy. I sauteed the rice in the Butter, then added the noodles--as they browed quickly. I also heated the water (in microwave while sauteing the rice) and added it hot. Cuts down on time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natbrat"
},
"reviewBody": "great recipe. threw in toasted pine nuts when it was done. I also just used broken up angel hair pasta, instead of egg noodles, cause thats all i had at the moment. love it, thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2"
},
"reviewBody": "I have grown up on nearly this same recipe. 1 cup rice to 2 cups chicken broth (water with bouillon or one can broth plus enough water to make two cups), brown some egg noodles or I like to use orzo, my aunt even uses spagheti noodles (what ever you have on hand will do). If I have it on hand will often add a can of mushrooms to the pan. I have progressed to dumping all ingredients (still brown orzo in butter) into the rice cooker and walking away to perfecgt pilaf every time. This is my staple potluck item."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer DeFosse"
},
"reviewBody": "I used chicken bouillon powder (about two tablespoons) and water instead of the cubes and broth. This was very good, but you should know that it makes a TON. I'd say it's enough for at least fifteen people. The taste is excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "good...a bit bland for my husband, but my kids and I liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KGROMAN"
},
"reviewBody": "This was basically my mother-in-law's recipe and she was from Puerto Rico. It goods very well with Spanish food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenburlison"
},
"reviewBody": "Everyone loved it. Even the non rice eaters. Was a great hit at Xmas dinner although it was kind of boring to look at. Maybe someone more creative than me could do something with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dub4theworld"
},
"reviewBody": "My mom used to make this a lot when I was young. I had no idea that it had Armenian origins. It is perfect with chicken. Just a little more work than regular rice but the difference in the final product is significant. This seemed like a lot so I halved the butter and rice, eye-balled the noodles accordingly, cut the bouillon cubes and only used two cans of broth. It was still more than enough for two people, but it was so good it won't be a problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYM600"
},
"reviewBody": "Made this for one holiday and now my 13 year old (who won't eat most side dishes except mac and cheese) requests this. Making it as a change for Thanksgiving too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "My family raved over this dish. Even my husband, who isn't a rice fan unless it is fried rice, said how good this was and how well it went with the roast pork I had made. This seems to be a very versatile dish and would probably pair well with about any meat. I used linguine that I broke into sixths. Thanks, it's very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri L."
},
"reviewBody": "This would probably be 6 stars as written...I am trying to cut sodium and fat so I used low sodium chicken base and only one Tbsp of butter for 2 servings. Also, the serving size it quite large. We had plenty left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjwill"
},
"reviewBody": "This was awesome. Nice compliment to chicken or pork. Family loved it and are asking me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rknap14"
},
"reviewBody": "We loved this. I made it for a family reunion (my husband's family) picnic. I wanted something that would hold up in the Utah summer heat. The was a little worried that it would be too bland, so before I cooked the rice, I added some garlic salt and italian seasonings. The seasonings by no means overpowered it. They were very subtle. Cooking this in the chicken broth/bouillon is very important -- as you could tell by the aroma in my house when it was cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bikerchickie"
},
"reviewBody": "I used to do catering for an Armenian friend of mine, and all we wanted was the FOOD - forget money. THIS is the closest thing I have found YET that even comes close to hers. DO NOT add a \"pinch\" of anything - this is the way it is SUPPOSED to taste. YUM. Even my super picky never eats rice daughter asked for THIRDS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Smit"
},
"reviewBody": "The kids loved it! Could have used a little \"pinch\" of something though - maybe some garlic powder?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chefin' it Up"
},
"reviewBody": "Great recipe. Only had to add a little salt &amp; pepper to final product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "5lilblessings"
},
"reviewBody": "Very popular family recipe. We Love it here! Whenever we have baked chicken we make this. Great with warmed sweet corn."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/67862/armenian-rice-pilaf/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
"name": "Rice Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14364/side-dish/rice/pilaf/",
"name": "Pilaf"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/67862/armenian-rice-pilaf/",
"name": "Armenian Rice Pilaf"
}
}
]
}
}
, "about": [
]
}
]