				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Artichoke Tetrazzini"
,"datePublished": "1999-02-20T09:17:22.000-05:00"
,"dateModified": "2022-07-14T15:53:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Gayle Wagner"
,"url": "https://www.allrecipes.com/cook/24323441"
}
]
,"description": "Mushrooms and onions sauteed in butter and thyme are combined with flour, chicken broth, half and half, Parmesan and the liquid from marinated artichoke hearts to make a rich and delicious sauce. Fold in the artichokes and serve over hot linguini."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6LLP17SpXih9WozqB6Iwhps4k2E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1112855-adf684a8d7e542e4942cb36350f89036.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Artichoke Tetrazzini"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "69"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "435 kcal"
,"carbohydrateContent": "53 g"
,"cholesterolContent": "43 mg"
,"fiberContent": "4 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "772 mg"
,"sugarContent": "3 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 (8 ounce) package linguini pasta",
"1 cup fresh sliced mushrooms",
"0.25 cup chopped onion",
"2 tablespoons butter",
"0.125 teaspoon dried thyme",
"2 tablespoons all-purpose flour",
"1 (10.5 ounce) can condensed chicken broth",
"1 cup half-and-half cream",
"1 (6 ounce) can marinated artichoke hearts",
"0.25 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cook linguini in a large pot of boiling salted water until tender."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, saute mushrooms and onion in butter or margarine with thyme. Remove from heat. Stir in flour. Then stir in chicken broth and half and half. Return to heat, and stir until the sauce boils and thickens. Strain artichokes, and stir the liquid into the sauce. Add the fresh Parmesan."
} ,{
"@type": "HowToStep"
,"text": "Drain linguini, and toss with sauce. Fold in the strained artichokes. Serve immediately."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess Nemcová"
},
"reviewBody": "Pretty good. I didn't read the reviews prior to this, but I do agree with some in saying it's a little bland; I think it needs something. I added lots of pepper to mine, and some chili flakes. Sundries tomatoes is a good idea. As I love mushrooms, artichokes, and pasta, I'll make this again, but probably add a few things. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charis"
},
"reviewBody": "I plan to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "steveT"
},
"reviewBody": "I was expecting more flavor, easy to prepare, but it was lacking something. I would not make this again unless I can think of something to spice it up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I added more mushrooms, more artichokes and added the juice from a whole lemon. Also put some of the marinated artichoke juice in the water used to boil the pasta. I used very little of the marinated artichoke juice in the sauce. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Strobel"
},
"reviewBody": "Everyone loved this! I switched olive oil for the butter, corn starch for the flour and milk for the half and half. Also added garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Strobel"
},
"reviewBody": "Everyone loved this! I switched olive oil for the butter, corn starch for the flour and milk for the half and half. Also added garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dipexa"
},
"reviewBody": "loved if! I may have not added enough butter : four ratio but other wise it was easy and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Rogers Reeves"
},
"reviewBody": "I had the ingredients and this sounded good. I halved the chicken broth and half-and-half as I was just making a small dinner for my husband and me, used more thyme and added a bit of nutmeg and a shake of red pepper flakes. I did not use the canned artichoke liquid in the sauce because it was already tasting PERFECT. This just hit the spot tonight and, coincidentally, was one of the best sauces I have made in years. Thanks for the recipe. It is now in a place of honor in my new 'regular rotation\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianayorty"
},
"reviewBody": "I loved the recipe. I don't care for overpowering taste of marinated artichokes, so I used artichokes in brine and rinsed them and did not use the brine in the sauce. Other than that, I followed the recipe exactly and it was soooooo good. And even better the next day for leftovers. It's the perfect creamy sauce. Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoJo"
},
"reviewBody": "Very good. I used oyster mushrooms and fresh thyme. Served it with French baguette with garlic butter and a simple salad. I didn't think it needed garlic in the sauce but the garlic flavor went well on the side. Leftovers reheated well in the microwave on half power."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bigfatchef"
},
"reviewBody": "Good base recipe, but I did make some changes to make it more flavorful. As is, the artichokes are not the centerpiece and it is not pretty to look at in the dish-- kind of grey and bound together by the cheese which was added too early and clumps everything up. I added more flour to make it a little thicker, used homemade chicken stock in place of canned, added pepper, whole,cream top milk in place of half in half, and twice as many artichokes (and used the juice in place of some of the stock so you wouldn't waste the artichoke flavor.) I also put the cheese in last as other reviewers did to not have it be such an integrated dish. Finally, I put about three big handfuls of baby spinach in the bottom of the pasta dish and put the final, hot noodles with sauce over that and then gently folded the spinach (now wilted) in. Worked great and added a bit of freshness to a pretty heavy dish. (You should also not cook the linguini until tender, since once you put it in the hot sauce it will overcook. I kept my linguini very al dente and let the sauce cook it the rest of the way.)This is very rich so I'd serve it with something acidic, like a tomato or fruit salad with nothing cheesy or creamy on on the salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "We really loved this. I did use capellini rather than linguini (my hubby's preference), and I didn't have half and half so used heavy cream instead (!). My chicken broth was my homemade broth using the carcass of Roast Sticky Chicken from this site, so it had all that added flavor (but that's mostly what I use--never the canned stuff). Otherwise, I followed the recipe. My hubby wants this again tomorrow. No problem with that! There are only the two of us, and this makes a lot! But it was really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vness"
},
"reviewBody": "We liked it very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FOODILUVIT"
},
"reviewBody": "Very good... taste reminds me homemade creamed spinach on pasts, but using artichokes instead. I made it without the parm cheese since the hubs doesn't like that taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JJB"
},
"reviewBody": "I didn't like this but gave it a star more than I think it deserves because I changed stuff and that might have ruined it. I added garlic and had to use artichoke hearts in water because that's what I had. I put in Italian seasoning instead of thyme and used wheat noodles. The first time I ate it I just thought it was bland. Just not to my tastes, I suppose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MimiMay"
},
"reviewBody": "For as much fat (cheese, 1/2 and 1/2, butter) as this recipe has in it, I thought it would be a lot creamier. The taste was good, but I thought it was too soupy. If I make it again, I will cut back significantly on all the liquids. I'll reserve the cheese, toss the sauce with the noodles, put them in a casserole dish, top with the cheese and bake until it's melty and the liquid has thickened."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MTCHYG"
},
"reviewBody": "I used milk instead of half and half. I think that was a mistake. Not as good as it should have been I\"m sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KP5"
},
"reviewBody": "I loved the flavor of this recipe. The sauce was delicious. I loved how it makes plenty of sauce. I definantly like more sauce on my pasta, and this was perfect. I added garlic when I was sauteing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "I enjoyed this recipe with a few minor changes. I took the advice of cayanne pepper and sun dried tomatos to spice it up, and for the cheese I used a pre-shredded mix of parm/romano/asiago. I think I might even try adding some broccoli to this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Morris Huntley"
},
"reviewBody": "I LOVED this recipe. I used 4 cubes of very concentrated, frozen homemade chicken broth instead of canned. I also cubed chicken and sauteed it in lemon juice and seasoning salt. I almost left out the artichoke marinade, fearing it would make it too thin but I'm so glad I did not. The sauce is a bit thin even with the lesser quantity of chicken broth but the flavor is fabulous and I don't mind at all! This is one of the best recipes I have tried off this site!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANGCHICK"
},
"reviewBody": "I thought this dish was bland, although everyone else in my family liked it a lot. I also added chicken and black pepper and a whole lot more parmesan than the recipe called for. I will try it again but next time I will add some minced garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LEASTMAN"
},
"reviewBody": "We really like this dish. I double the artichokes because we love them and add two chicken breasts (choppped) because my boyfriend refuses to eat a main meal without meat. But a good recipe nonetheless. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "Delicious. Currently one of my favorite pasta sauce recipes. I add a little garlic, more mushrooms, and a lot more dried thyme than the recipe calls for - at least a 1/2 tsp. if not more. I think the extra thyme flavor really stands up well next to the artichoke marinade and parm cheese flavors. Finally, I like to use shorter pasta instead of linguine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "After reading the reviews, I decided to add a few things to this to make it a little more flavorful. First, I added about 1/2 cup of sundried tomatoes, and a bit more artichokes than it called for. Then, I added some cut up chicken breast (2 pieces) - which I sauteed in garlic and olive oil. I used fresh thyme instead of dried, and used about 1 tablespoon instead of what the recipe called for. I also tried using both portobello and shitake mushrooms - but the shitake were far better. Lastly, instead of adding the parmesan, when the dish was finished and on the plate, I added a slice of goat cheese to the top. It's really rich and creamy, melts slightly into the pasta, and is soooooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PRACTICINGJOY"
},
"reviewBody": "i wish i could give this one six stars! it was so delicious and quick &amp; easy to make. didnt have half and half so used regular cream, which while tasted great, was probably a little too rich. and next time i'd probably want to add some sundried tomatoes for color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "WHITNEYB"
},
"reviewBody": "Not memorable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "OMOBELLE"
},
"reviewBody": "I found out from this recipe that I don't like artichokes as much as I thought I did. That aside, I thought it was pretty good once I picked the artichokes out. I think it could be a really good basic recipe, sans artichokes, that could easily be adapted for other pasta dishes. I added grilled chicken and garlic and black pepper. It had a mild flavor but I wouldn't say bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "Quick and easy to make with an amazing flavor! I will be making this again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca H"
},
"reviewBody": "I thought the recipe was very good! I substituted 1/2 teaspoon of fresh thyme instead of the dried stuff, and I think that solved the \"blandness\" problem some other reviewers warned about. I used extra mushrooms as suggested, and I think I'll add chicken next time, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband and I liked this recipe alot. My husband gave it 4 stars. It didn't rock our world but for now it is staying on the monthly recipe rotation. Will try some red pepper next time and more artichokes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEROMAINE"
},
"reviewBody": "i LOVED this! i also used fat free 1/2 &amp; 1/2 and it was still very creamy. i put chicken in mine too, but think it would be just as tasty without it, although i will definitely add more mushrooms next time. i also put in more artichokes than the recipe called for - and i didn't get the marinated ones, instead the ones packed in water. they worked great! (i added a little bit of their water to the sauce)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this recipe. I did add chicken breast to make it a complete meal and spiced it up a little with paprika and cayenne. Husband and teenagers all liked it, they even ate the artichokes! Very good, will definately be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nickie P"
},
"reviewBody": "This was ok. We weren't crazy about it. I probably won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thanks LNILSSON66 for the suggestions! I was apprehensive about this recipe at first. However, your advice about extra thyme, garlic, and chicken made this recipe a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MKENNA"
},
"reviewBody": "This was okay, but I agree with others that it was a bit bland even after adding extra thyme and garlic. I had a ton of leftovers because none of the kids would eat it so I'm hoping that it's more flavorful as lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOLSON7"
},
"reviewBody": "I did not care for the artichokes. I didn't like the tangy taste. I have taken this basic recipe and came up with a great new recipe.one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamar Boursalian"
},
"reviewBody": "Really quick and delicious. I used skim milk and cornstarch to cut down on the fat and it was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good and extremely easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe seemed like it was missing something, a little to bland for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added some sauteed chicken breast and a little bit of minced garlic and smidge more thyme than the recipe called for. I Used fat free half &amp; half with (I think) absolutely no loss of taste or creaminess. My husband loved it and my teenage sons devoured it (although they did pick out the artichokes). This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe for my family and ended up having company stop over. This was a big hit!! I added chicken to mine, and everyone loved it.I will have this on the top of my list for a unexpensive crowd pleaser, Thankyou for sharing this great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best dish I have ever made from this website. It is absolutely fantastic. I too used fat free half and half. I added more thyme because it tasted a bit bland for my taste using the amount given in the recipe. I also discovered that this tasted much better the day after because the pasta had an extra day to absorb all the flavors. For this reason, this is an excellent recipe to make a couple days ahead of time if you are hosting an event."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is really yummy. I too used LOL Fat Free Half &amp; Half and it still turned out nice &amp; thick. Next time I will add some chicken I think. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BESARO"
},
"reviewBody": "Being vegetarians we used mushroom broth and actually didnt care for the artichokes too much, they were nice as a few bites, but most got left on the plate, all alone however cause we ate every bite of the rest. It had a nice depth to it-good comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esmee Williams"
},
"reviewBody": "Delious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Enjoyed this dish!!! To make a lower fat dish, I eliminated the butter and sauteed in PAM and used Land O' Lakes Fat Free Half and Half. My wife raved about it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family loved this recipe. I will make it again. Next time I may add chicken. cara"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11720/artichoke-tetrazzini/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16815/main-dish/pasta/tetrazzini/",
"name": "Tetrazzini Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11720/artichoke-tetrazzini/",
"name": "Artichoke Tetrazzini"
}
}
]
}
}
, "about": [
]
}
]