				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Asian Pork Tenderloin"
,"datePublished": "2020-03-04T23:59:14.000-05:00"
,"dateModified": "2022-08-08T17:16:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ONOLICIOUS10"
,"url": "https://www.allrecipes.com/cook/991131"
}
]
,"description": "This Asian pork recipe features oven-roasted pork tenderloin in a marinade of soy sauce, garlic, ginger, chile paste, sesame oil, and brown sugar."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JE4h-DFtRQJ9cJfxffuEAZxKHas=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/683261-asian-pork-tenderloin-Alberta-Rose-1x1-1-b5973c1b277645518b05b000c838c1ec.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5737901125001",
"description": "Sensational and simple marinade that compliments the tenderloin well!",
"duration": "PT1M15S",
"name": "Asian Pork Tenderloin",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/781a8883-7899-400d-9215-e8cdad7ff333/a5b133b1-2238-489c-bc2d-6e28468e022a/1280x720/match/image.jpg",
"uploadDate": "2021-07-09T05:20:38.482-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Asian Pork Tenderloin"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "440"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "385 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "98 mg"
,"fiberContent": "1 g"
,"proteinContent": "37 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "922 mg"
,"sugarContent": "9 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (2 pound) fat-trimmed pork tenderloin",
"0.33333334326744 cup lite soy sauce",
"0.25 cup sesame oil",
"2 tablespoons Worcestershire sauce",
"3 green onions, chopped",
"4 cloves garlic, crushed",
"2 tablespoons packed light brown sugar",
"1.5 tablespoons Asian chile paste",
"1.5 teaspoons pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place pork tenderloin in a shallow dish."
} ,{
"@type": "HowToStep"
,"text": "Pour soy sauce, sesame oil, and Worcestershire sauce into a medium bowl. Whisk in green onions, garlic, brown sugar, chile paste, and pepper until combined. Pour sauce over tenderloin, turning meat a few times to coat. Cover the dish and marinate in the refrigerator for 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Transfer pork tenderloin with marinade into an aluminum foil-lined baking pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JE4h-DFtRQJ9cJfxffuEAZxKHas=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/683261-asian-pork-tenderloin-Alberta-Rose-1x1-1-b5973c1b277645518b05b000c838c1ec.jpg"
}
]
,"text": "Roast in the preheated oven until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), 25 to 30 minutes. Allow to stand 5 to 10 minutes before carving."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT520M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved this - quite easy to make and very tasty. Since I didn't have any light soy sauce or light brown sugar on hand, I used regular tamari and dark brown sugar, and they worked fine. I served it with parmesan risotto, chopped spinach, red onion and minced garlic sauteed in olive oil and a white Rioja -- elegant enough for a nice dinner party and simple and affordable enough for a family dinner. It's going in my permanent recipe file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristinkburns"
},
"reviewBody": "If doubling, increase the temp to 460 and the cook time to 30-35 mins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Cartee"
},
"reviewBody": "This is very delicious and moist. Keep cooking time to no longer than 30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had to substitute habañero jam for chile paste (couldn't find any are my local grocers), so mine came out spicier, I think, than was intended. Makes an amazing sauce for marinade or other uses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joseegrice"
},
"reviewBody": "This was absolutely delicious, I made no modifications- which I usually do. We had it with Coconut rice and Pak Choy, a very easy and delightful meal. It's a new family favorite, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LouKap"
},
"reviewBody": "OMG; delicious!! As other reviewers suggested, I threw in a bit of ginger (the stuff in the tube; didn't have any fresh) and used Asian Chile garlic paste 'cuz that's what I had. Roasted at 350 for about 50 minutes; it was perfect!! I also reduced about half of the marinade and thickened with cornstarch. This is now in my \"keeper\" file!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BIGDADDYWF"
},
"reviewBody": "This is ok and maybe 4 stars should have been given but the flavor was middle of the road and the cooking directions left the sauce scorched to the pan. Obviously very easy to make but I think I will find other uses for my pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Omophagos"
},
"reviewBody": "Turned out outstanding, though I made some major tweaks. I had some serious bourbon barrel-aged soy sauce on deck, so I halved the amount to account for its 1.5 grams of sodium per Tbsp. To make up for the liquid I used the juice of half a navel orange as well as its zest. I also included an inch of fresh ginger. The ginger makes it--do not skimp. I marinated for about 18 hours. The acid from the OJ worked wonders and created a very, very tender result.\n\nI highly recommend going at a lower temperature in the oven. I did 350 for 40 minutes, and it was absolutely perfect. However, I only gave the roast a bit of the marinade to keep it moist in the oven and used the rest to make a sauce thickened with slurried flour, which was dynamite. I also recommend adding the leftover pan drippings to the sauce while the meat rests. \n\nServed alongside Lemongrass, ginger, garlic rice with green onions lime added. Excellent and simple meal with minor prep."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steven pye"
},
"reviewBody": "I did the low and slow 325F for 90 min- I also doubled the marinade recipe- I used 1/2 to marinate the pork, then I reduced in a saucepan the other 1/2 marinade and glazed the pork tenderloin!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dianejh"
},
"reviewBody": "I didn't care for the flavor of this sauce--I believe the sesame oil overpowered the other flavors, even though I did reduce the amount as others suggested. The ingredients seemed to be conflicting with each other for flavor, rather than blending (perhaps the Worcestershire sauce was also at issue). I reduced the heat as others suggested and used a thermometer to heat it to 145 degrees, which did produce a very juicy and perfectly cooked tenderloin. I wouldn't make this recipe again, but if I did I would use just a bit of sesame oil and probably omit the Worcestershire sauce. I also believe the amount of sauce it makes was more than needed for the size of the tenderloin given."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Johnson"
},
"reviewBody": "Great marinade for pork and tofu! Like others cut sesame oil (1.5 TBSP) used peanut oil for the balance. Line the pan! For vegan tofu, just use vegan Worcestershire sauce, slice pressed tofu into cubes, marinate for an hour, bake at same temp, for same time as pork. I made the pork for my husband and tofu for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spencer"
},
"reviewBody": "I generally prepare the recipes just as written (or videoed) for the first time. This prep was the same but it ended up being marinated for about 48 hours! The taste was obviously stronger but it was VERY tender. Everyone liked it and it made great leftovers for sandwiches on toasted sour dough bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karyn"
},
"reviewBody": "I halved the marinade for a 1 lb tenderloin piece, marinated for 7 hours, and baked at 350 for an hour. It was perfect! The sesame taste is full, so if you are not a big fan maybe decrease the oil a little. I used light soy as well, so it was not too salty, was just right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I took the suggestion of others who have made this recipe and set the oven at 325. Slow roasting for just over an hour. This was tasty and tender. I served this with cabbage (not slaw) and mashed potatoes. The marinade went with it all!! My husband said it was a winner!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amyrts"
},
"reviewBody": "Marinated this before work. I didn't have the Asian sauce. Came home to air fry 30 minutes on 400° (turning halfway) We really enjoyed it. Picky teen that doesn't like pork went back for a 3rd slice. Served it over the Bacon Fried Rice also from this site"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "We served this dish for a quarantined family dinner and were very pleased with the overall taste. For this inaugural venture, we marinated the pork for 4 hrs. vs. the suggested 24 and expect the taste to be even better next time. \nPreparation was simple to follow. Thank you for this meal suggestion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian C."
},
"reviewBody": "Really tasty recipe - substituted Sriracha for the spice element - and rather than marinading - I cook the whole thing in a slow cooker for 5 hours (turning the pork loin hourly)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manuel Segovia"
},
"reviewBody": "Very good flavor, I just sent it to my daughter. \nI made a mistake, I used very low mold, and I lost most of the juices when it was in the oven, and to fix it, I prepared a cream with milk, sesame oil, soy sauce, Worcestershire, crushed red pepper and corn starch, and I put in the top of the pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Konainc"
},
"reviewBody": "After 25min pork was at 139deg. I reduced the temp to 325 and covered. Cooked for 15 more minutes. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Milliken"
},
"reviewBody": "The pork was perfect pink and tender. seasoning kept their promises in the flavor. Sweet sharp kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julzmini"
},
"reviewBody": "Love it! used Sambal instead of chili paste because its what I had and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriK"
},
"reviewBody": "Amazing flavors! Only change was that I forgot to marinate overnight and so I cooked it for 5 hours in the slow cooker. No sticking, sauce was perfect, and so tender. Thank you for a recipe we will go back to again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Ruth"
},
"reviewBody": "Really delicious and easy. I found it a bit salty even with lite soy sauce so next time I'll substitute some no salt chicken broth. I took some other reviewers' suggestions &amp; cooked it a bit longer &amp; lower but split the difference. 400 for 35 mins was perfect for 2x 1lb tenderloins. Served it with stir fried bok choy, carrots, &amp; mushrooms with the leftover marinade (cooked on stove top) &amp; steam fried noodles, as another reviewer suggested. Delicious, easy, company-worthy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dnicole"
},
"reviewBody": "I used all the ingredients except for the Worcestershire sauce (because I didn't have any) and I added a teaspoon of ground ginger to the marinade. It marinated for 6 hours, baked at 350° for 50 minutes. It was juicy, tender, and DELICIOUS!!!\nI took the advice from the reviews and heated the marinade on the stove and made a gravy to drizzle over the tenderloin. Served it with Jasmine rice &amp; asparagus. I will definitely be making this again and will try it with salmon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AzSunset"
},
"reviewBody": "Very tasty. Cut the recipe in half for a 12 oz tenderloin cut into 3/4\" medallions. I used avocado oil &amp; I also reduced my hot chili paste to 1/2 tsp. It still had plenty of heat( &amp; we do like heat!) It allowed me to marinate for a much shorter time ( 1 hour) and I grilled them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Larco"
},
"reviewBody": "Wow this was great! Kind of reminded me of the Mongolian Beef dish at PF Chang’s with the sweet and spicy. It wasn’t too sweet but I still think I might cut back on the brown sugar a bit...we like spicy. The pork was so juicy, we marinated for 2 days. We also cooked down the marinade since it had raw meat in it so we could use it as a sauce for the pork and rice. We made a garlic bok Choy dish on the side and it all went well together. Sharing this recipe and definitely making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Nice flavour but I followed the suggestion of cooking it at 325. I only cooked it for an hour, not for 80 or 90 mins as suggested, and it was way over cooked! So disappointing! Will try it one more time and the cooking time suggested in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "Made it exactly as written but did not have time to marinate except for 30 minutes. Also I cooked on 350 for about 40 minutes, covered in a LeCreuset pan. Next time make rice with it and thicken the sauce and pour over rice. Also the leftovers are perfect for Pad Thai. Next time will add ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy"
},
"reviewBody": "This turned out AMAZING! Everyone raved about it. I used a 3.5 lb. loin so mine took over an hour in a convection oven, but it was worth the wait. Wow. Super tasty and tender. I had it covered with foil about 1/2 baking time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Kolonkowski"
},
"reviewBody": "This was so GOOD! This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howardsan"
},
"reviewBody": "This was very good. I did make a few modifications. I didn’t have pork tenderloin, just a pork roast, so I cooked it low and slow (325 degrees until the internal temp. reached 145 degrees) so the meat was tender. \n\nI added a couple tsps. of orange marmalade to the glaze and some ginger paste.\n\nI boiled the leftover marinade for 7 minutes, adding a tsp. of butter and spooned some of it over the cooked roast while it rested.\n\nServed with rice pilaf and a fresh green bean, red bell pepper and portobello mushroom blend, yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russ F"
},
"reviewBody": "With a pork tenderloin being so inexpensive, and this recipe being so very good \nIt's on my table at least a couple times each month!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "w_anne"
},
"reviewBody": "Great simple recipe that tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great simple recipe that tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martina Žaloudková"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JETT"
},
"reviewBody": "Easy to make and a good flavour for pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Johnson"
},
"reviewBody": "It was fast, simple, and delicious. I did not have all the ingredients, but these were super easy to substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth McCarthy"
},
"reviewBody": "no chili pepper for me and it came out delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgrigas"
},
"reviewBody": "Flavor was delicious. Meat was moist and tender. We will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Schroeder"
},
"reviewBody": "Family really enjoyed it. Made some fried rice along with fresh steamed broccoli. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Roulston"
},
"reviewBody": "I made at as with the recommended changes. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SaraZam78"
},
"reviewBody": "Wish I hadn’t added extra garlic. But still delicious. Served it with white rice and mango chutney. Yum!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Taylor"
},
"reviewBody": "Just made this using less of the oil, and sriracha instead of chili paste. I also used chives pulled from my garden. No issues with saltiness. I doubled the recipe and marinated two tenderloins in two separate ziplock bags about 7 hours. I cooked in oven at 400, for about 30min (I use a meat thermometer and cook till around 135) then let rest for 10min. I simmered the leftover marinade in a large skillet till cooked down, and used as a sauce. Very very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie homemaker in training"
},
"reviewBody": "Really tender good flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dummerston Dan"
},
"reviewBody": "This was delicious, and my entire family loved it. That doesn’t happen everyday, as picky palates often prevail. The only change I made to the recipe was to delete the brown sugar, as we are limiting as many carbs as possible. I substituted two packets of Splenda for the necessary sweetness and that worked well. It may have caramelized better with the brown sugar, but it still produced a rich, thick and delicious sauce. I served it with roasted broccoli and Asian sesame ginger slaw. Thanks for a great recipe. This one’s a keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom W"
},
"reviewBody": "I used a meat thermometer, turned out so tender with great flavor, cooked it in a cast iron deep pan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "old fashion cooker"
},
"reviewBody": "I love this recipe, very tasty, even my 11 yr old grandson loved it and he hates everything. I knew I wanted to use the marinade, but I also knew I didn't want to use this cooking method, so I used a 2# pork sirloin-tip roast, marinated for a few days (not my choice, it just happened) and cooked it using the High Heat method. 20minuites in 500 degrees and it was perfection. I almost always use the high heat method with pork because it's perfection...I only gave the 4 star because I didn't follow the receipt exactly, YUMM! Try it's sooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elaine Mahanti"
},
"reviewBody": "The sauce burnt and the pork was dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Sanders"
},
"reviewBody": "This is awesome. I did halve the sesame oil and substituted the Asian chili paste with Korean red pepper paste (go chu jang). It has never failed me for a big crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Excellent meal - I made it just as suggested other than I put everything in a one gallon zip loc bag to marinate instead of using a pan. Using heavy foil to line a casserole dish when baking it meant I had zero clean up too ;-) Sauce was excellent and meat was flavorful and very tender. Looked pretty enough for company, but easy enough for any day. I marinated it about 8 hours (I've found too long in the marinade can make a pork tenderloin mushy so I watch the time now). I cooked it a bit longer than suggested (maybe my tenderloin was thicker than most?) so I suggest being a little flexible in your cooking time. Meat sliced and held together well, so presentation was picture perfect also. I can see this sliced and arranged on a platter with sauce on top at a buffet or holiday meal - it really is a very pretty dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane L Gesicki"
},
"reviewBody": "My family said this was the best pork they ever ate!!! So juicy and full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terese Wulff"
},
"reviewBody": "Best tenderloin ever…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "A@4U"
},
"reviewBody": "This was quite good especially for a last minute weeknight dinner. I would actually award 4.5 stars. It marinaded for approximately an hour. I made the sauce using minced shallots and Siracha chili sauce as that's what I had on hand. My tenderloin was not 2# so I adjusted the cooking time accordingly. I did not read the previous reviews so I'm sure some of my points have been addressed. Much of the sauce burned on the aluminum foil roasting at 450*. Next time, I will double the marinade/sauce and add ginger. In half the sauce, I will marinate the pork then use the sauce for basting the pork while roasting instead of roasting in the sauce. With the other half of the sauce I will add sauteed mushrooms and reduce to about 1/2 to serve tableside as a sauce. I will also roast at 400* instead of 450*. All in all, this was a really good recipe that just needs some adjustment for our personal preference. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "I cooked a large tenderloin... maybe 5lbs. I doubled portions, but it could still use more asian flavors. Also cooked it a little longer to 45mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NDFan0010"
},
"reviewBody": "Delicious! Cooked at 325 degrees for 90 minutes and added potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melanie Bigoni"
},
"reviewBody": "Pork was so juicy and tender! My family loved the flavor it's a new favorite at our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BadGalBrenda1"
},
"reviewBody": "Such a delicious and easy thing to make! I only made small changes to the recipe. I added two tsp grated fresh ginger. Also I let the tenderloin marinate for four hours. It was still super moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista Markstrom"
},
"reviewBody": "I made this twice, second time with 3 tablespoons of honey instead of brown sugar, marinating it for about 6 hours and grilling it. This recipe turned out better than the first time, and the first time was a 4.5 out of 5 stars. We have a gas grill with 3 burners. I heated the grill to its max, turned off the back burner while keeping the front two on high. By placing the pork over the non-lit burner in the back and turning frequently, it created a nice browned crust which kept the juices in. I then turned down the front two burners to medium high and grilled the pork until juices ran clear when pressed. After removing pork from grill, I let it rest for a few minutes before slicing. The flavor was spectacular and the pork was moist and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie Overend"
},
"reviewBody": "I made this absolutely wonderful recipe and it turned out wonderful!! My husband wants more and I have shared this with others already and they felt the same way. The only thing different that I did was to roast the tenderloin in a hot oven-450 degrees on an aluminum foiled baking pan for 13-14 minutes. It came out perfect with a pink center. The leftovers were just as good the next day too. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kjcharzy"
},
"reviewBody": "Easy to make, very tasty and a quick clean up gives it five stars in my book. I reduced the soy sauce to a smidge over 1/4 cup and didn’t add the green onions as I didn’t have any. Otherwise the sauce was made as written. I did cook it at 325 for about 85 minutes. I had two 1 lb tenderloins and drizzled some marinade over the meat for cooking and heated the rest with 1/2 tsp cornstarch to serve with the meal. It didn’t make a lot of sauce but was enough to spoon over the slices and the brown rice we had with it. The meat was moist and tender and my husband especially loved the sauce. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Myhre"
},
"reviewBody": "great change up from our normal pork and sauerkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Casper Wood"
},
"reviewBody": "It was absolutely delicious. I paired it with boiled potatoes and made a salad. I also made extra marinade for dipping! Everyone had seconds! I will make this again for sure. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Guyana"
},
"reviewBody": "I will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Florencemead"
},
"reviewBody": "I added honey and did not put the spicey hot ingredients in! Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leeza Voyage"
},
"reviewBody": "This was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Parnell-Proulx"
},
"reviewBody": "Followed recipe, tossed all in a ziplock bag and marinated overnight till dinner time. It was tender and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hannah"
},
"reviewBody": "it is fantastic. I did not change any ingrediants but when I was ready to live it in the sauce i put it in a ziplock bag with all the sauce and let it sit in it over night and when I was ready to cook it I put it it in dish and put aluminum fool over it and it kept all the flavor. you should try it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Carrillo-Fox"
},
"reviewBody": "YUM!! Yes, I made some of the suggested changes, but this still gets 5 stars for flavor and ease of prep. The taste is phenomenal and the tenderloin lived up to its name: tender! I did lower the amount of oil and used EVOO, used Asian chili sauce from chain (Buffalo) Wing Shop instead of paste, and altered the time/temp, as follows: covered w/foil and cooked at 400 deg for 30 min, checked the temp, kept it covered but lowered to 375 and cooked for another 15 min, then uncovered for 15 min. DEFINITELY line your baking pan/dish with foil! I reserved some of the marinade before putting the pork in a zipper bag and used that to coat the stir fry veggies (green beans, baby carrots, red bell) and ramen noodles that I served with the. tenderloin. Sooo good, will make again for sure --thank you for the recipe : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdonahue"
},
"reviewBody": "Was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette Skelly"
},
"reviewBody": "I made this for three generations of my family and they all enjoyed it very much. I have never had such juicy pork tenderloin before. I served with lemon garlic egg noodles , snow peas and broccoli. So good that we fight over leftovers. It has a nice mild flavor. The only thing I didn’t have was the Chili paste so I just omitted it. I think I will continue to make it this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Really, REALLY tasty!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GCC"
},
"reviewBody": "It was very good. Didn't change anything except I cooked it on the grill instead of in the oven. I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhonda"
},
"reviewBody": "I've made this several times now and it's great every time! I follow the recipe exactly although I think it would be great with some of the additions other reviewers have mentioned. I use pork tenderloin (not pork loin) and it cooks perfect as specified in the recipe. I will confess I have made this a few times with only an hour or so of marinade time and it's still great! It works great for me as a last minute throw together meal. Thanks for giving us a great family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Q The First Timelord"
},
"reviewBody": "Came out awesome. I rated it four stars just because it didn't make me cry it was so good, but was still very good!\n\nOne tweak - the pork for some reason took longer to cook than the 30 minutes after i refrigerated it overnight... took me about 50 minutes ... at 450.... \n\nVERY good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Roberts"
},
"reviewBody": "It's delicious. I did change the chili paste for Sirachia sauce and used regular chicken broth not low sodium. I did not add any salt as called for. Also, could not buy a pork tenderloin but used a rolled pork loin. I highly recommend roasting it at 325F for 80-90mins. This will make it incredibly tender! It literally melted in my mouth. You MUST use light soy sauce, otherwise the regular soy sauce is too salty. At the end of roasting, the marinade was greatly reduced. You can put the marinade in a pan on the stovetop, whisk in some flour or corn starch, add mushrooms to make a gravy. Needed to let the mushrooms cook, about 20 minutes in the gravy sauce, stirring frequently. \n Absolutely delicious!!! Thank you for the wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stixanstones"
},
"reviewBody": "Amazing! Made it just like the recipe said, and it was delicious. My husband was commenting on how good the house smelled while it was baking.\n\nWe cooked a tenderloin like this, and then sliced it up to go in Vietnamese spring rolls. It was super tasty... and not just a few pieces of the meat went straight in our mouths before making it into spring rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris muller"
},
"reviewBody": "made it exactly as shown. i would definitely reduce the amount of soy next time or add more brown sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LORIGENES"
},
"reviewBody": "This is excellent and easy. Spicy but not too hot. I marinated it in a ziplock for about 36 hours (plenty of marinade for two tenderloins). I roasted it at 425 degrees on convection bake, basting it with the marinade halfway through, until about 155 degrees. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kainai"
},
"reviewBody": "We used a heaping tablespoon of yellow Thai curry and a dollop of Asian Chile sauce in place of the Asian Chile paste. We also let it marinate for about 36 hrs and then cooked it at 300f by mistake for half an hour. Then we gave it another fifteen or so at the proper ish temperature. Anyway it turned out freaking incredible. Juicy and extremely flavorful and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Hudson"
},
"reviewBody": "This was great didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RSquared"
},
"reviewBody": "Very tasty! I followed the suggestions of cutting back on sesame oil, adding ginger, and cooking at a lower temperature. I’m very pleased with the results but if I were making for company I’d cut back on the chili paste. I appreciate the heat but many others do not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessi Rasmussen"
},
"reviewBody": "Awesome recipe! I just added about 1 tbsp of fresh grated ginger...kicked it up another notch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bruce Carpenter"
},
"reviewBody": "Easy to make and it taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becki Fontaine"
},
"reviewBody": "This is Delicious....I cut up the pork and let it sit in the sauce before I served it. YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneP"
},
"reviewBody": "What can I say other than yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoefercooks81"
},
"reviewBody": "Loved it! My tenderloin was two 1# pieces instead of one 2# piece. I also cooked the meat in the marinade. There is none left, and all my kids had seconds! Will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stampindt"
},
"reviewBody": "I reduced the spices a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WillyWanker"
},
"reviewBody": "We really enjoyed the pork tenderloin, it was very tender and the flavor was great. I followed the recipe as close as I could and plan to add it to our list of winners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie E"
},
"reviewBody": "I made this recipe using two 1lb pork loins, using the same ingredients. I marinated them for about 18 hours, flipping every so often. Also, I followed a suggestion to cook at a lower temp. I cooked the pork loins on 325°F for 80 minutes, flipping once (40 minutes into cooking time). Came out delicious and tender. Recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "I use this marinade for pork fried rice. I usually use boneless pork chops for that. Really good. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "I cut the sesame oil in half and marinated this overnight. I cooked it at 325 for about 75-80 minutes then turned it up to 375 for the last 15ish or so. I also took another reviewers suggestion and made a \"gravy\" out of the leftover marinade by just adding a cornstarch slurry and less than 1/2 cup of water and boiling it for a few minutes. Poured that right on top of the now SLICED pork loin and that sent it over the top! Will definitely make again, this was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LanPoo"
},
"reviewBody": "I made this today, like others I cut the Sesame oil in half and used Olive oil for the other half. The flavour was amazing. Cooked at 325 for 80 minutes but the marinade burned. Next time I'd make extra marinade to make sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephen"
},
"reviewBody": "this is my go-to recipe whenever I have a tenderloin. my tip would be.. create a \"boat\", gently wrap the loin in aluminum foil. this keeps the meat covered in the marinate while cooking instead of spreading out and drying up in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L. Brewster"
},
"reviewBody": "I really liked this pork roast; however, I felt the marinade was too salty, so I kept adding brown sugar until it cut the saltiness. I didn't have a single tenderloin as it was two that looked like one, but the advantage to that was we got two meals out of the tenderloins. I lowered the temperature of the oven and only cooked about 25 minutes. Very tender and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanL"
},
"reviewBody": "Marinated 8 hours as recommended and just followed the recipe, with the exception of having to use olive oil in place of sesame oil. This was delicious and a family hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Mooney"
},
"reviewBody": "This was a very tasty and simple dish. Marinated it for about 10 hours. Cooked to perfection just by following time and temperature direction. I will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "don"
},
"reviewBody": "Prepared pretty much as written. Marinaded for 20 hrs. Subbed Thai chili sauce in place of the Asian chili paste. Roasted a 2 lb cut for 1 1/2 hrs at 325 deg. Came out great! Very juicy and really good flavor! Boiled the marinade, thickened with corn starch added 8 oz of shrooms, served it all over rice. Did someone already say, best pork I ever ate? DW liked it even more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "I loved this marinade! It would also be tasty on chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ali"
},
"reviewBody": "5 stars based on tweaks suggested by others. Added fresh ginger to the marinade. Cooked at 350 for 50 minutes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/83117/asian-pork-tenderloin/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
"name": "Pork Tenderloin Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/83117/asian-pork-tenderloin/",
"name": "Asian Pork Tenderloin"
}
}
]
}
}
, "about": [
]
}
]