				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Authentic Swedish Pancakes"
,"datePublished": "2020-06-19T00:06:35.000-04:00"
,"dateModified": "2022-12-07T12:55:56.498-05:00"
,"author": [
{"@type": "Person"
,"name": "Amber Adamson Kincheloe"
,"url": "https://www.allrecipes.com/cook/9121092"
}
]
,"description": "This Swedish pancakes recipe makes stacks of small, authentic crepe-like pancakes that are soft, ready in minutes, and made with simple ingredients."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/f-mkitLPYlvkasDtXFK8cxR40JI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3581295-authentic-swedish-pancakes-Marianne-4x3-1-5c447314535d4220b430914797903138.jpg",
"height": 720,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6316682160112",
"description": "",
"duration": "PT1M",
"name": "How to Make Authentic Swedish Pancakes",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/7f179b95-f89c-4026-9077-fd39745b9992/fcab65c2-9d2e-4980-8a76-9edc15865690/1280x720/match/image.jpg",
"uploadDate": "2022-12-08T07:35:53.912-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Authentic Swedish Pancakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "65"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "66 kcal"
,"carbohydrateContent": "8 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "0 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "122 mg"
,"sugarContent": "2 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 eggs",
"1.25 cups milk",
"0.75 cup all-purpose flour",
"1 tablespoon white sugar",
"0.5 teaspoon salt",
"1 tablespoon butter, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Beat eggs in a bowl with an electric mixer until thick and lemon-colored, 3 to 5 minutes. Stir in milk."
} ,{
"@type": "HowToStep"
,"text": "Sift together flour, sugar, and salt in a separate bowl. Add to egg mixture; mix until batter is smooth."
} ,{
"@type": "HowToStep"
,"text": "Grease a griddle with butter; heat over medium heat. Drop tablespoonfuls of batter on the griddle; spread to make thin pancakes. Cook until light brown on bottom, 1 to 2 minutes. Flip and continue cooking until second side is light brown, 1 to 2 minutes more. Repeat with remaining batter."
} ]
,"recipeYield": ["13"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother of 5"
},
"reviewBody": "A bit thicker than my Mormors but this was a quick recipe and my kids liked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "I love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aras"
},
"reviewBody": "These are not authentic Swedish pancakes: add six tablespoons of melted butter to the batter and double the salt for pancakes your children will learn to make for their children."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CheflessInFL"
},
"reviewBody": "I ran out of my handy Ikea frozen Swedish pancakes, but still had a bag of their meatballs left. I'm so glad to have found this quick and easy recipe - all the ingredients came together perfectly, and the batter had the perfect consistency to easily swirl into the pan for an evenly thick pancake. I used a non-stick ceramic frying pan, which made the edges of the pancake have super thin crispy edges - a delightful contrast to the rest of the pancake that my family and I enjoyed. I love Ikea, but I think I'll be making my own Swedish pancakes from now on! 🥰"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Woods"
},
"reviewBody": "That's pretty much my mother's Carlson recipe, brought by her grandmother from Sweden. If we children begged, she'd stand at the stove and make them on a Saturday morning. Let butter melt, then lingonberries, raspberries, or syrup are all good. Our father liked butter and sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Schroeder"
},
"reviewBody": "These great out great! We used Almond milk, and I think that made it so the didn’t brown very much — still delicious though! Topped with PSL sauce and chopped pecans. Let’s go Fall!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Works best if you use 3c milk, beat in 2 large eggs then slowly mix in 1 1/2 c flower. Let sit for 30 min, remix. Be careful not to over do it. Put a cast iron pan on medium heat, let sit until smoking, put butter on pan and turn the pan until covered, put just enough batter to thinly cover the pan, turning pad you poor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it. Added some fresh cardamom for that taste of Scandinavia!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the classic Swedish Pancake recipe that is in the Better Homes &amp; Garden red checkered cookbook where i leared how to cook them over 50 years ago. These are the only pancakes I like and we fuss them up a lot for Christmas morning with a whipped vanilla muscarpone cream filling. Yum! The only difference I make to them is how crepes are made. You melt all of your butter in your skillet, then pour it into your pancake/crepe mixture. You won't have to butter or spray your skillet again for the entire batch. My mom served these with an orange liquor sauce or maple syrup. I serve them with maple syrup or whipped vanilla muscaropne. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did what was in the instructions. The pancakes turned out like crepes at first then i made them thicker by adding more batter. My Uncle who lives in Sweden says to have potato flour instead of all purpose flour or add corn starch to the all purpose flour a 20/80 mixture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Holman"
},
"reviewBody": "Very good Swedish pancakes! Doubles wonderfully. I melted the butter &amp; added it to the batter before cooking so no oil was needed on the griddle. This recipe is very much like my Swedish grandmothers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added all of the ingredients together down to the letter and got a liquid goopy mess for batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were soooo good!!! Legit better than any pancake house! 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca D"
},
"reviewBody": "quick &amp; easy kid friendly recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazjoanna"
},
"reviewBody": "We loved the recipe. My family commented how delicious they were and that they tasted almost or better than iHOP version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DebDB"
},
"reviewBody": "I have made Swedish pancakes for years. This was more like scrambled eggs watered down. It absolutely needed more flour. I would find another recipe with more flour. I hate leaving a bad review especially on someones family recipies. I fell in love with Swedish pancakes at Ihop, have used the mix and made my own. The texture of this was way off. :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Llewellyn"
},
"reviewBody": "This recipe is so delicious, they turned out perfectly! Thank you for sharing, this one is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huitzilopotchtli Garcia"
},
"reviewBody": "Wonderfully light a d delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Christine"
},
"reviewBody": "These pancakes turned out amazing. Heavenly. I added some cream cheese, jam, &amp; some syrup on top. These were perfect. So glad I found this recipe. It reminds me of my favorite Swedish restaurant back home. We will be making more of these for sure!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "If you prefer pancakes over crepes you'll like this recipe. But it's not \"traditional\" in that it's closer tasting to an American pancake, and Swedish pancakes are more closely related to a French crepe. For my taste, it was a too much like a pancake (because of the extra flour) and it needs a tablespoon of butter melted into the batter. What this recipe points out well is to whip the eggs prior to incorporating the other ingredients. Great tip!\n\nI made this to see what I thought of it, but I prefer 1/2 cup of flour (instead of 3/4 cups), a tablespoon of melted butter in the batter, and a sprinkle of cinnamon (definitely not \"authentic\" but pairs great with my Lingonberries)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eve Salinas"
},
"reviewBody": "The recipe itself was good. However what I didn’t like was all that butter on the griddle. The crepe absorbed most of it and caused the crepes to be greasy. Next time I’ll spray with canola oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nichlas Brown"
},
"reviewBody": "Although harder to regulate temperature, I would recommend doing this in a trying pan as it is much more possible to get those perfect circle shapes for folding and/or rolling. The batter also came out too think to make thin enough pancakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma CeCe"
},
"reviewBody": "Now I can make pancakes just like my Swedish grandma used to make for us in Kansas. Used 1/3 Recipe for one person. Bacon drippings-no butter. Whole lactose free milk because that's all that was in the cupboard. Perfect every time. Thanks for the memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivy Stone"
},
"reviewBody": "They are delicious! At first, they seemed a little watery but, when we cooked them they work just fine. fruit makes them great. 1 tablespoon is not quite enough to make them as big as they are in the picture but we did it like that and they were just small"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Hughen"
},
"reviewBody": "I misplaced my family recipe for Swedish pancakes so I was glad when I came across this recipe. The only thing I changed/added was 2 tablespoons of melted butter to the batter. This recipe is delicious and I will definitely make them again. I served them sprinkled with powdered sugar and lemon juice. If you are making them for a crowd you will definitely want to double the recipe. This was the perfect amount of batter for my husband and I to have 5 pancakes each and another 5 to put in the fridge wrapped in plastic wrap for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucky"
},
"reviewBody": "Cut this recipe in half, since I am a widower and children are grown and gone. This is the best Swedish pancake recipe hands down. Very easy ten minute prep time. I added 1/8 teaspoon vanilla to the recipe as a personal taste preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "echo3000"
},
"reviewBody": "Not my preferred variation Swedish pancakes but they turned out ok and would probably pair well with lingon och powdered sugar. I felt the recipe could use butter within the mix and that these turned out a bit on the hard side rather than soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pete wagner"
},
"reviewBody": "Nice recipe. I added 1/2t vanilla extract, otherwise excellent as presented :)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Brick"
},
"reviewBody": "The only difference I made to this recipe was to add a teaspoon of vanilla extract, which I was taught from my father by his mother (my grandmother) from Sweden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruthie M"
},
"reviewBody": "Very good. . ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hill, Heidi J"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARIAN"
},
"reviewBody": "Very easy. Made as is. Keep in mind, as they are (plain) they aren't much... you need to add toppings to enhance them, much like traditional pancakes. We usually add butter with leftover cranberry sauce (from a previous turkey dinner). red currant jam or, if we can find it, lingonberry preserves. We also top it with fresh fruit - various berries in season, peaches, bananas, etc. We've been experimenting using them with savory toppings, using leftover pancakes for lunch and dinner. It's hard to go wrong since it's just a good, basic pancake. I've even made a bunch on a camping trip where we were acting as 'trail angels' to backpackers hiking the Pacific Crest Trail, making them breakfast as they passed by. Man, can those kids eat! but the best part is that many of them asked for extra pancakes so they could take with them for lunch. Apparently, they all love to use them with peanut or almond butter. Keeping this in mind, I made the batter in large batches ahead of time at home, and we cooked them on site. Worked really well because everyone could pick and choose the toppings they wanted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Pereira"
},
"reviewBody": "We get Sweedish pancakes from our local pancake house. My kids were fighting over the leftovers one night so I found this recipe. My husband said they are amazing! They are a staple in our house now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wanda Carroll"
},
"reviewBody": "I liked it but hubby did't. Said they didn't look done.\nGoing to try it again with a bit more cooking, flour &amp; salt &amp;1/2 tsp vanilla. \nI made them into crepes with apple pie filling from a can and jazzed it up with more pie spices. \nMakes lovely crepes, just not a \"man's\" dish apparently."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine Sullivan"
},
"reviewBody": "When I was a girl, I sat in the kitchen with my Swedish grandpa and watched him make these. When I needed a recipe while sitting with him he just said, \"oh put a few eggs, a sprinkle of flour, some baking powder, a little sugar, and there ya go .... Thanks Papa, but this recipe here actually spells it out and it tastes pretty close to yours. Cat in Seattle"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vilela"
},
"reviewBody": "It turned out really good. My nieces, ages 12, 9 and 7 are completely different, one filled with BlackBerry jelly, one with nutella and one with marshmallow cream. Rolled them up like crepes and took them to school for snacks. A great easy recipe for young cooks to make and share with friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Larson"
},
"reviewBody": "Didn't change anything. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Butler Myers"
},
"reviewBody": "These pancakes were lite and fluffy. Easy to make and filling. I followed the recipe as written and thoroughly enjoyed. I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wincroft"
},
"reviewBody": "loved it and it was so simple! can go with any topping you want. One grand wanted chocolate chip and banana, one strawberry, and another cinnamon sugar all was great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Monique Martinez"
},
"reviewBody": "Deliciously sweet and easy to make!!! I paired the pancakes with a fresh lemon syrup. Just add fresh lemon juice and sugar together over the stove on low an lightly drizzle for an extra fresh kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalia Weaver"
},
"reviewBody": "I made this recipe using vegan butter and lactose-free milk. the consistency was liquidy (as I've heard it's suppose to be). I used a little vegan butter on the pan and for 2 servings I used just 1 egg white. The Pancake cooked fast and flipping it was no trouble. The taste, texture, and thiness are fantastic for any dairy allergens this recipe is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ismael"
},
"reviewBody": "Made this for the first time and the wife love it she said it was better than what she eat at New York thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana May"
},
"reviewBody": "No changes needed. This was the recipe we used when I was a child. They came out perfectly!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Nazeri"
},
"reviewBody": "Grew up on these pancakes in Germany when you don't use sugar let them cool and cut into strips use as Noodles in Broth ...delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Krieger Livesey"
},
"reviewBody": "Use medium-low heat and these are perfect. Kids and toddlers love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Rue"
},
"reviewBody": "Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Beth Schumann"
},
"reviewBody": "loved these! added lemon extract for a fun flavor twist and they were amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KatherineJaneIII"
},
"reviewBody": "I made it just as the recipe said, except I used whole wheat flour. It seemed quite runny when I put it in the pan, but after it cooked a little, it was just perfect! My husband and I both LOVED it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "randyhaar"
},
"reviewBody": "I doubled the recipe, it turned out perfect! Family couldn't get enough of them, will be making them again for sure! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evan P."
},
"reviewBody": "Needed 1/2 cup more flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rsbecca@WD"
},
"reviewBody": "This is the exact recipe that my husbands grandmother, who was from Sweden, used to make her grand kids all the time when they were young."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danalu"
},
"reviewBody": "Delicious! I've made these a few times, followed the recipe perfectly and they've turned out...perfectly! My husband and I can't get enough of these, and we're pancake fans, through and through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaB"
},
"reviewBody": "Really good. I made them as popovers, in large muffin tins. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m.c.s."
},
"reviewBody": "Served with cranberry butter rolled up inside and dusted with powdered sugar. Just take one stick softened butter and mix with one can whole berry cranberry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "This recipe is very similar to the one my Mormor taught my mom, and I've been making these now for a little over 50 years! This calls for one less egg, a little more flour, half the sugar---but it's basically the same. I tried to make it with just one tablespoon batter on my cast iron griddle, but I had better luck with two tablespoons. I've never used butter on the griddle, so it took me a little getting used to (I usually give a very light brushover of Crisco). My granddaughters thought these were a little more \"cushiony\" but still very good (they passed the big test!!)! Powdered sugar, granulated sugar, or lingonberry jam are the traditional ways I know of how to serve Swedish pancakes, but we still prefer a little jam with sour cream in the middle with a smidgen of syrup on the rolled up top! My four Swedish grandparents would be proud that their tradition has carried on! Thanks for posting your recipe, Amber!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/246952/authentic-swedish-pancakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
"name": "Pancake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/246952/authentic-swedish-pancakes/",
"name": "Authentic Swedish Pancakes"
}
}
]
}
}
, "about": [
]
}
]