				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Authentic Pad Thai Noodles"
,"datePublished": "2020-06-18T23:47:28.000-04:00"
,"dateModified": "2022-10-17T19:36:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Julia"
,"url": "https://www.allrecipes.com/cook/1159896"
}
]
,"description": "Make your own pad Thai recipe at home using this simple vegetarian recipe of rice noodles cooked with scrambled egg and tofu and topped with a perfectly-balanced sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uQfROPMBboGrzZIQ6Kqb8IgTINM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/824871-1490f65a581f4837b443a41695701add.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Authentic Pad Thai Noodles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "75"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "397 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "41 mg"
,"fiberContent": "5 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "1234 mg"
,"sugarContent": "10 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.66666668653488 cup dried rice vermicelli",
"0.25 cup peanut oil",
"0.66666668653488 cup thinly sliced firm tofu",
"1 large egg, beaten",
"4 cloves garlic, finely chopped",
"0.25 cup vegetable broth",
"2 tablespoons fresh lime juice",
"2 tablespoons soy sauce",
"1 tablespoon white sugar",
"1 teaspoon salt",
"0.5 teaspoon dried red chili flakes",
"3 tablespoons chopped peanuts",
"1 pound bean sprouts, divided",
"3 green onions, whites cut thinly across and greens sliced into thin lengths - divided",
"3 tablespoons chopped peanuts",
"2 limes, cut into wedges for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Soak rice vermicelli noodles in a bowl filled with hot water until softened, 30 minutes to 1 hour. Drain and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat peanut oil over medium heat in a large wok."
} ,{
"@type": "HowToStep"
,"text": "Cook and stir tofu in the wok, turning the pieces until they are golden on all sides."
} ,{
"@type": "HowToStep"
,"text": "Remove tofu with a slotted spoon and drain on plate lined with paper towels."
} ,{
"@type": "HowToStep"
,"text": "Pour all but 1 tablespoon of used oil from the wok into a small bowl; it will be used again in a later step."
} ,{
"@type": "HowToStep"
,"text": "Heat the remaining 1 tablespoon of oil in the wok over medium heat until it starts to sizzle."
} ,{
"@type": "HowToStep"
,"text": "Pour in beaten egg and lightly toss in the hot oil to scramble the egg."
} ,{
"@type": "HowToStep"
,"text": "Remove egg from the wok and set aside."
} ,{
"@type": "HowToStep"
,"text": "Pour reserved peanut oil in the small bowl back into the wok."
} ,{
"@type": "HowToStep"
,"text": "Toss garlic and drained noodles in wok until they are coated with oil."
} ,{
"@type": "HowToStep"
,"text": "Stir in vegetable broth, lime juice, soy sauce, and sugar. Toss and gently push noodles around the pan to coat with sauce."
} ,{
"@type": "HowToStep"
,"text": "Gently mix in tofu, scrambled egg, salt, chili flakes, and 3 tablespoons peanuts; toss to mix all ingredients."
} ,{
"@type": "HowToStep"
,"text": "Mix in bean sprouts and green onions, reserving about 1 tablespoon of each for garnish. Cook and stir until bean sprouts have softened slightly, 1 to 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Arrange noodles on a warm serving platter and garnish with 3 tablespoons peanuts and reserved bean sprouts and green onions. Place lime wedges around the edges of the platter."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackie1martin"
},
"reviewBody": "Lovely mild flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jojokrako"
},
"reviewBody": "Not bad but very salty. I'd leave out the salt provided there's more than enough from the soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah Rose Hart"
},
"reviewBody": "There was another review that mentioned how bland this recipe is. I think it was an understatement. I decided to try the recipe anyway because I typically don’t need a ton of salt or flavor to enjoy something. This recipe just isn’t a good one. The proportions are all off and the steps aren’t correct. I have yet to see a single good pad thai recipe on Allrecipes. Guess I’ll have to continue getting takeout."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianaK"
},
"reviewBody": "With some modifications, this recipe brought my Dad, who loves Pad Thai but cannot manage going out to eat any more, happiness! He has not been eating much lately but he ate every bit on his plate!! I used Japanese rice noodles instead of vermicelli, a little less sugar, a little more lime juice, 1/2 Fish Sauce and 1/2 Soy Sauce, added natural peanut butter to the sauce, and added vegetables like shredded carrots, mushrooms and peppers. We all loved it. Especially my Dad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christl N Babcock"
},
"reviewBody": "Yes and I made a dry pad Thai sauce that I sell at farmers markets"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Worleyann"
},
"reviewBody": "Update - After increasing the sauce, set the recipe to three and use that for your guide for the rest of the ingredients, increasing the eggs to 3. Use the best non stick pan you have and this is much easier and do not need oil. This will make enough for 4 BIG eaters. I but the noodles is a 16 oz pack and use about 1/3 package. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela Curtis"
},
"reviewBody": "It was tasty but not the flavors we were looking for. It wasn’t “quick” either, between soaking noodles and prepping ingredients it took me over an hour and a half to make. If you’re looking for a restaurant style pad thai this isn’t it. My husband was disappointed but it tasted good so my family enjoyed it. I followed the recipe exactly except I used pad thai noodles and not the thinner vermicelli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The_cake_machine"
},
"reviewBody": "I first made this a few months ago, and it has since become a staple dinner. Fantastic recipe, travels well if you want to take it to work for lunch the next day. I don't usually have red pepper flakes, so I sub in chili powder and it worked pretty well- plus I add more noodles and eggs because I like the way they absorb the flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilie"
},
"reviewBody": "I make this recipe all the time, my husband and I love it. I always add chicken and also I usually double the sauce and add more noodles but only so we have enough for leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Coco Hurst"
},
"reviewBody": "Used tamarind paste to make it taste authentic also wide rice noodles. Ones this thin for me end up dry and sticky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ruth B"
},
"reviewBody": "This dish was dry and there wasn't much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Weird Trick"
},
"reviewBody": "As they say, there are as many authentic Pad Thai recipes as there are Thai cooks. I was hesitant to make this when I saw the choice of noodles and the omission of either tamarind paste or fish sauce. After making it per the recipe given, it was pleasant enough if not a bit bland. The sauce didn't have the Pad Thai flavor that I expected and have experienced in good Thai restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "loriferg"
},
"reviewBody": "This is a good base recipe for Pad Thai. My husband and I enjoy lots of flavor, so I did make a few changes. I used chicken and added sugar snap peas, matchstick carrots, and red peppers, which I sautéed a few minutes before adding the garlic and noodles. After tasting the recipe I decided to add a few tablespoons of peanut satay sauce and a good squirt of sriracha sauce. It was delicious! I will definitely make this again, maybe adding some fresh ginger next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keeper"
},
"reviewBody": "Lady you got it going on thanks it was the best better than noodles and company"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coffeecourts"
},
"reviewBody": "This was Delicious!! This was my first time making an authentic asian recipe, frying tofu, etc ... It was kind of a whirlwind to prepare... all of the steps happen pretty fast so preparation is key. I followed the recipe exactly and my family devoured it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "This recipe worked better than most of my attempts at pad thai. I would prefer a little more kick but that was easily remedied with sriracha, cilantro, and lime juice upon serving. I used shrimp instead of tofu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nahid"
},
"reviewBody": "I made it. It was very good. I will use this recipe again. But I would use a little less salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake Claes"
},
"reviewBody": "Great base recipe. I used white rice noodles instead. It was a little too light on the sauce. Next time I plan to double the sauce portion, add more red pepper flakes (I like it HOT), add a little peanut butter and probably another egg. But this is a great starting point. This recipe also doesn't have the unusual oils such as fish or oyster oils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MopMop"
},
"reviewBody": "I started off by wetting an unknown multiple of the amount of noodles listed here and eyeballed all measurements from there. Also overcooked the tofu, so didn't use it, and didn't add beansprouts. Tasted awesome. Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liza Albright"
},
"reviewBody": "This was a pretty good recipe overall and close to. A little too much garlic for my taste so I halved the garlic. I also added a little more broth because the dish was a tad dry. Also, I followed the instructions on the rice noodle package rather than soaking them for the time the recipe suggested. The soaking time on the package was half of what the recipe suggests. I'm afraid if I had soaked the noodles for the entire time suggested by the recipe they would have been mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Mari Stockdale"
},
"reviewBody": "First time making Pad Thai! One of my favorite dishes in the restaurant. I used sesame seed oil, just because it is what I had, and it tasted fine. Also, I added shrimp! In my opinion, the recipe could use less lime juice, more chili flakes, and extra peanuts. Otherwise, it's a terrific base for my new pad Thai dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicolette Stoddard"
},
"reviewBody": "Delicious! made a quadruple batch of sauce...easy meal and filling. Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrice Beaulieu"
},
"reviewBody": "Delicious and you can make changes as you go! The noodles really soaked up the flavor and the dish was ever better as leftovers the next day. I would even eat this cold as a salad. \n\nI nixed the tofu and all peanut ingredients and added mushrooms, a 2nd egg, and an extra green onion instead. (I don't like peanut flavors in my food other than in dessert or on toast). I added extra soy sauce and about 1/2 teaspoon of sesame oil.\n\nThe only difficulty I had was measuring the 2/3 cup of dried vermicelli without breaking the noodles up too small. I ended up hydrating the entire package, chopping and using the amount of noodles I desired (eye-balled it), and using the leftover plain noodles to serve with meatballs and sauce later in the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christmas Queen"
},
"reviewBody": "This has become almost a weekly dinner in our house. With a few minor changes. We thought it was a bit dry the first time making it so we've increased the \"sauce\" ingredients: 1 cup of broth, 5T. lime juice, 5T. of soy sauce, and 7T. of sugar. We also use a tofu press to get most of the water out of the tofu before browning it in the wok. And cube it rather then slicce it. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Justyna"
},
"reviewBody": "A lot of ingredients, a lot of time, not a lot of flavor. I halved the recipe and used the fettuccine rice noodles, and cooked them according to instructions - which is probably why the dish sucked so bad - it was completely dry, and the noodles were clumped up. Also, 2/3 cup thin tofu slices from the recipe equal 3 tofu slices per serving.. Overall, I thought it was very bland, and i won't be making it again; even with vermicelli noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Berlee Rut"
},
"reviewBody": "It wasn't the best. I changed it up a bit; instead of using peanut oil I used sesame oil. I opted out of the tofu and used, surprise, surprise, roast beef. I cut maybe a quarter of a nice sized one and used that. \nAll the flavors seemed to blend, and that's why I say that it wasn't the best. It was as if it was missing something. My mom says that it would be good with cilantro, maybe next. This was my first time making this dish, afterall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacie296"
},
"reviewBody": "I added chicken breast in place of the tofu and also topped it with homemade peanut sauce (the kind for sate with a PB and coconut milk base) and that gave it the flavor it needed. A bit bland on its own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "My husband and I thought it was really good. Had to add a little more flavor but we are pretty particular. Would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valery13"
},
"reviewBody": "I love this dish it's so good. I've found that when I make it I have to triple it though (it's that good and my kids love it!). One thing that's nice about it is that it's spiced perfectly for kids. I always add more chili flakes to mine, but I love spicy foods. Thanks again for sharing this one!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mia Meri"
},
"reviewBody": "Tasted authentic. I'm used to stronger flavours in general so I'm not a big fan, but this tastes exactly like in the thai restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie Sailor"
},
"reviewBody": "Ok, but pretty tasteless, but I admit I changed a few things - mostly to add flavor. I used sesame oil, chicken/chicken bullion, 2 more eggs scrambled, 2 Tbls peanut butter, celery sauteed, 1/4 c more water when it boiled dry. Didn't add the red pepper for the kids. I served with hot sesame oil. Pastey flavor - think I'll stick with my Asian noodle recipe from Florence Lin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron"
},
"reviewBody": "Best pad thai, ever had. Made a few tweeks, added chicken, and dried oinions. Also replaced chili oil with chili flakes and dry noodles with fresh chow mein noodles. Only problem was did not make enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "totchipanda"
},
"reviewBody": "I didn't have peanut oil, tofu or bean sprouts, but this was still really really yummy! Definitely going to make it again :) I also didn't add the teaspoon of salt since soy sauce is generally pretty salty already. I found it tasted just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMMICHELLE"
},
"reviewBody": "Way too good!! Everyone LOVED it. Easy and delicious. Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Saltba"
},
"reviewBody": "Added fish sauce, replacing some soy sauce. Also added vinegar, but it wasn't needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IcuRN"
},
"reviewBody": "Excellent! My fiancee almost ate the whole thing in one sitting. Adding a little fish sauce is a nice touch. I found it was key to cut the tofu into very small pieces to get a nice even frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tim Swiontkowski"
},
"reviewBody": "Good but not great. I will try it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTCHYG"
},
"reviewBody": "Thank you for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Henninger Linton"
},
"reviewBody": "I also added peapods and an extra egg. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yellobat"
},
"reviewBody": "Don't make it with vermicelli. Go for wider rice noodles so they're more like pad thai noodles from restaurants and won't break apart (also easier to eat with chop sticks). The flavor was good but I needed it punched up. Like it was pad thai flavor but the intensity wasn't there. I'd keep trying this dish, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Bug"
},
"reviewBody": "Yummy! I didn't have any of the suggested noodles so I substituted them for two packets of ramen noodles and it worked out fine :) A little salty even though I only used 1/2 tsp salt, I might omit it all together since the soy sauce makes up for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jbooshey"
},
"reviewBody": "I accidentally bought flour vermicelli, but this dish is more about the flavor anyhow and the meal cooked quicker with the pasta I bought. Although the chewiness of the tofu wasn't very good, the flavor in this dish along with the different textures was outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coolcowz"
},
"reviewBody": "I used shrimp and added red pepper flakes at that time to get a gentle \"heating up\" of the spice level. This recipe needs cilantro added to the ingredient list, to be stirred in at the last minute before serving, or just sprinkled on top. Used a box of rice stir fry noodles (intended for pad thai) and followed box directions to cook by adding to a pot of boiling water, remove from heat and let sit 10 minutes, then drain and rinse with cool water. Let sit until ready to add in this dish with the seasoning. The other tester's suggestion of fish sauce is also a good idea. VERY GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baka-boy"
},
"reviewBody": "I added chicken for my household - was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idlehands"
},
"reviewBody": "Made it to spec for my family and they loved it. I would maybe make it with a bit more sauce next time, but that's it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "Not too bad although I would recommend adding some fish sauce instead of salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "McBacon"
},
"reviewBody": "I loved this recipe! My whole family did, actually. I added more peanuts &amp; omitted the bean sprouts &amp; the chili flakes. I also added more noodles and more broth. I used vegetable oil instead of peanut oil &amp; did not add salt. I loved it! I wanted to use peanut oil, but had none and it was expensive at the store. Maybe next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AuburnJeff"
},
"reviewBody": "I found the flavor to be very good. I made some minor tweaks mostly because my wife cannot eat garlic, so I increase the scallions and added chicken with the tofu. My problem has been getting the noodle consistency correc.t First time I soaked for about an hour as instructed, and they were kind of crunchy but tasty. Second time I kept the water warm on the stove (not boiling...below a simmer actually), and the noodles came out totally mushy. Now I am soaking them in warm water (per package instructions) and checking them every 2 minutes until they seem right. \n\nI suppose this depends on a lot of factors, like brand of vermicelli, water temp, etc. So I am not blaming the recipe for this. Just a heads up to others, mostly. \n\nAs far as the recipe, I took away a star only because it is a bit time consuming. But it is worth it, for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SarahJP"
},
"reviewBody": "I hate to say it, but I found this recipe to be rather tasteless. After making it as written, I ended up adding 1-2 Tablespoons of peanut butter and 3 extra Tablespoons of sugar. Maybe that's not authentic, but it sure tasted better. I may not make this again - I found it to be kind of a fussy process with not a lot of reward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kamilton"
},
"reviewBody": "So fresh tasting! Nice and light. Will be making again, definitely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele DiCarlo"
},
"reviewBody": "Amazing!!! Made this 2 times this week. Fresh and light. Second time I made 2 batches one with tofu and one with chicken. Both were great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josephine Wood"
},
"reviewBody": "Quite enjoyable and not too sweet, hubby enjoyed much more that some others that I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "it wasn't really quick to make, but it was delicious as written. didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Jo Stevens"
},
"reviewBody": "Absolutely incredible! Only change, I omitted the bean sprouts. I will definately will make over &amp; over again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220134/authentic-pad-thai-noodles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
"name": "Thai"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220134/authentic-pad-thai-noodles/",
"name": "Authentic Pad Thai Noodles"
}
}
]
}
}
, "about": [
]
}
]