				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Authentic Mexican Enchiladas"
,"datePublished": "2020-06-23T17:50:37.000-04:00"
,"dateModified": "2022-11-16T18:34:58.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Becky"
,"url": "https://www.allrecipes.com/cook/1231519"
}
]
,"description": "This Mexican enchiladas recipe is the real thing. Corn tortillas are dipped in homemade sauce, fried, and filled with queso fresco and more favorites."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZCS7FuL-2Gi67zW45eWDM8tbOuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4756790-authentic-mexican-enchiladas-Catlin-Marie-4x3-1-3b8215650a77448ab2adfea3005c468d.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Authentic Mexican Enchiladas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "79"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "477 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "57 mg"
,"fiberContent": "6 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "609 mg"
,"sugarContent": "2 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"6 dried chile de arbol peppers",
"0.75 cup water, or as needed",
"1 clove garlic",
"1 teaspoon salt",
"1 cup vegetable oil for frying",
"18 (6 inch) corn tortillas",
"3 cups crumbled queso fresco, divided",
"1 cup sour cream, divided",
"1 cup shredded lettuce, divided",
"2 medium tomatoes, thinly sliced",
"0.5 cup chopped green onions, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Snap tops off of dried chiles and place in a saucepan with enough water to cover. Bring to a boil and simmer for 15 minutes. Drain water and place chiles into a food processor or blender with garlic and salt. Purée until smooth. Press sauce through a strainer and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large skillet over medium heat. Soak each tortilla in the sauce, then place in the hot oil. Turn over almost immediately and fry for about 5 seconds on the other side. Remove to a plate that is lined with paper towels, stacking them on top of each other to keep them pliable for filling."
} ,{
"@type": "HowToStep"
,"text": "Take one fried tortilla at a time and fill with about 2 tablespoons queso fresco. Roll up and place seam side down on a plate. Place three of these on each plate."
} ,{
"@type": "HowToStep"
,"text": "Top tortillas in the following order: Start with a layer of sour cream, then a small handful of lettuce, three tomato slices, 2 more tablespoons queso fresco, and 1 tablespoon green onions."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "Turned out well. Not a huge fan on the sauce but that's OK. The method for prep on the enchladas was a nice change. Made clean enchladas! Living in Southern Texas we get such a mix of Mexican style....Like everyone else, I'll adapt it to our preferences. Thank you so much for the added education!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Estevan Carlos Benson"
},
"reviewBody": "Finally. One of the few reasonably authentic recipes out there. It's frustrating that few people know of authentic Mexican food. For those wondering how to make it _more_ authentic, it depends heavily on the peppers used for the sauce and their spiciness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nautty68"
},
"reviewBody": "I followed every step but added 6 other peppers to the mix. 4 pasilla peppers and 2 guajillo peppers. Same process as the chiles de arbol. It was a hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "IFortuna"
},
"reviewBody": "These are flautas and not traditional enchiladas like our Mexican family has made for generations (traced back to the late 1800's). These may be from a different region. I have never seen them made this way. even in all my time in Mexico. We don't fry our tortillas, we steam them and then dip in the sauce, add cheese, and sometimes an olive in the center and roll, top with sauce and bake. We use chopped onion sauted, add flour, chili powder, cumin and oregano, then add chicken broth for our enchilada sauce. I add other secret ingredients. This is where the flavor blooms. Easy to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catlin Marie"
},
"reviewBody": "This was one of the best meals I've ever made! I slow cooked and shredded chicken in some canned enchilada verde sauce, dry enchilada sauce and canned green chiles. I also only poured a LITTLE bit of the water from the chiles out and pureed it using a cuisinart, then strained it. I dipped corn tortillas in oil and THEN the sauce, fried them in a hot pan (for way more than 5 seconds a side, mine were nice and CRISPY!) and then rolled up the chicken and queso fresco, baking them at 375 for about 10 minutes. HOLY YUM! The tortillas absorb so much flavor; you do not need to add enchilada sauce on these bad boys - sour cream adds moisture and lettuce (I used a cabbage slaw mix), tomato and green onion add crunch :)))"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Ferwerda Coulliette"
},
"reviewBody": "I thought these were very delicious! Everyone who tried them loved them. I made them just as the recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megoats"
},
"reviewBody": "My husband is of Mexican heritage and my mother-in-law makes this and it is SO yummy. I asked her to help me and compared the differences-- first, she said to use 4 Guajillo chilis and NOT chile de arbol BECAUSE arbol chilies are VERY hot. I can't do extremely hot food so I am glad I got her opinion before making this. She roasts them along with two tomatillos before boiling also. Otherwise, it was the same. The chili will be MUCH darker red than this recipe. I couldn't even tell these enchiladas had any chili they were dipped in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Natasha Sahouri"
},
"reviewBody": "These are good however these are not enchiladas. These are flautas. I make flautas on a regular basis for my family :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlyn Torres"
},
"reviewBody": "Tastes great but as a novice to Mexican cuisine I am upset about a few things in the recipe that made it much harder and more frustrating than it had to be! Maybe I got the wrong chiles de arbol but the ones at my Mexican store were tiny so instead of 6, like the recipe said, I used probably 30 to make the sauce. I also drained them like the recipe said, and put them in my blender to find only a paste. DONT DRAIN THEM!! So my sauce was finally made and I dipped the tortillas in the sauce then fried them. As I was taking them out, they totally fell apart! I posted on a Facebook group and the ladies there recommended to fry, THEN DIP. This worked SO MUCH BETTER!! other than that, they are very good and I think my husband will be very impressed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jbooshey"
},
"reviewBody": "The enchilada sauce was great, despite the fact I had to use dried New Mexico chiles. I also, had a bunch of flour tortilla's so I used those instead of corn. Great recipe and I understand the reviews that call for a gooey cheese because that would have been something else!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mayra Zamudio"
},
"reviewBody": "I added onion and tomato to sauce. I also added one triangle of Abuelita chocolate to add thickness and sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jellyboo"
},
"reviewBody": "This was really good. My bf loved it and couldn't stop raving about it. He said it was one of the best enchiladas he's ever had. The changes I made was I did not strain the sauce and I fried the Tortilla then dipped it in the sauce. Will be making again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Yum! A co-worker of mine is of Mexican descent and he shared a secret with me. As many others have done, try subbing Queso Chihuahua cheese for the \"guts\" of your enchiladas. This cheese melts extremely well, but you need to pop your rolled enchiladas in the oven for a few minutes to get the melty, ooey-gooey effect. Now, about the recipe. It's a little vague. I too was confused about the sauce. I ended up adding the full 3/4 c. of water called for to my pot of chiles (de arbol) and simmering as directed. I covered my pan to help minimize evaporation and then added all of the liquid, chiles, salt and garlic to my blender (FYI, this sauce is perfect as is - there's no need to add anything else to it). NOTE: I did not find it messy or difficult to fry my sauce dipped tortillas and am glad I didn't wait until they were fried to dip them. I did have to fry for a tad longer than called for, but it all worked out in the end. My only regret is that I didn't have any sauce left to drizzle over my enchiladas (it was THAT good!). :( Topping these babies with Queso Fresco Mexican crema, lettuce, (chopped) tomato and green onion really hit the spot. Mexican rice and refried beans rounded out our authentic meal. All I can say is this was one FANTASTIC meal. Thanks for sharing your MIL's recipe, Becky! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Nice change from Tex-Mex style."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMG"
},
"reviewBody": "Okay, i LOVED the taste!! But, here are some things that i can say as i´m in mexico and i eat enchiladas once a week in a traditional cocina economica: the chiles doen´t really need to be drained, they are ok with the water, also, you can try them filled with chicken, they taste even better! and they also could not be fried, taste is better and they´re lighter. try it, fill them with chicken, you won´t regret!! But the real enchiladas are just topped with queso fresco and onion. \ni´ve never seen here in mexico an enchilada topped with lettuce and tomato. THESE ENCHILADAS ARE STILL TASTY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChgoGrl78"
},
"reviewBody": "Thank you for posting a recipe for AUTHENTIC Mexican enchiladas! I did cheat and use a store bought sauce....I saw that Frontera released a line of enchilada sauces and couldn't resist, as their stuff is pretty good and I kind of love Rick Bayless. :) \r\nAnyway, I dipped the tortillas in oil, then sauce (which was warming in a pan) and immediately rolled them up with a little bit of cheese. After they were all done, I heated a skillet sprayed with Pam and re heated 4 of the enchiladas at a time on both sides and then melted some cheese on top by putting the lip on the skillet. This is how one of the local Mexican restaurants serves them and I love how crispy the bottom gets and how melty the cheese gets. Delicious. Can't wait to try the homemade sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guadalupe"
},
"reviewBody": "THIS is exactly what I was looking for, how to make the sauce. That's the kind of sauce I used to do back in Mexico, personally I love filling them with chicken/potato/carrot mix but this is AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ahuiliztli"
},
"reviewBody": "I like this recipe but for the health conscious I would say you can bypass the frying the tortilla part...It doesn't really help the sauce stay on the tortilla too much and it just adds fat. You can just heat the tortillas up on a skillet or microwave to get them tender and then soak in the sauce. Frying it does add crispiness but if you want this dish to be healthier, skip the frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katya"
},
"reviewBody": "Delicious! I wasnt sure if they are supposed to be crispy or not when you fry them. Mine came out a bit soggy, but none the less very good. Next time i will just heat them in the pan without oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MicheleM"
},
"reviewBody": "The tortillas are very tasty! Dip in the oil first and then the sauce to avoid splattering oil. For a little extra taste, we added a small amount of chorrizo. We also put it in the oven for about 10 minutes after rolling them to help melt the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "epatty123"
},
"reviewBody": "I like these enchiladas. Everything was good except I used more chilis, 8 or 9 chili de arbol for every 12 tortillas. I also left a bit of the water from the pan. other that that these are authentic and great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Woy"
},
"reviewBody": "Love the sauce! I'm on my second batch and I've been using it everywhere you'd use hot sauce! Yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "intoJesus"
},
"reviewBody": "This was A LOT more work than was worth it. All in all it tasted pretty OK...used Chihuahua cheese instead of queso fresco and that tasted much better. But I probably won't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BIGRED227"
},
"reviewBody": "These were ok, I've had better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookfresh"
},
"reviewBody": "My mom makes some better ones, but these are very delicious too =) I only give it a four stars because I did not enjoy the hot oil jumping on me I got burned like 10 times! I made a batch of potatoe and another one of queso fresco. I also made a bomb homemade salsa verde, served it whith some jarritos yummm... I want to make these again even though I got burn =/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "No flavor. Bland. Greasy. Draining the water results in paste. Adding water dilutes of the flavor. Dipping tortillas in sauce first before frying results in grease burns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sheena"
},
"reviewBody": "I agree that you must add water to the chilies in the blender or you get paste; not sauce. I wasn't able to get exactly the right ingredients at our Nebraska supermarket, but we improvised with a different type of dried chili and quesadilla cheese. This recipe still turned out great. It's probably not one that I'd do regularly for health reasons, but it definitely hit the spot tonight. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tamtam024"
},
"reviewBody": "I've been looking for an authentic recipe like this for so long, but I always come across the more american version of enchiladas. This is great!!! Tastes authentic, and just how my sister in law(she's hispanic) makes them!. DELISH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is as authentic as you can get for Mexican food. I make a very similar recipe, but with a chile verde sauce. You can either dip the tortilla in the oil and then the sauce or vise versa. I prefer to do oil and then sauce, that way I can drain the oil on paper towels without losing any of the sauce. For the sauce, do not drain the water when it's done boiling, use that blend instead of new water. Also, to flavor the sauce, try adding onion and the chicken bullion with tomato flavor--trust me, it makes it taste wonderful! Just throw everything into the blender and blend. You can use whatever dried peppers you have on hand (chile de arbol peppers tend to be more spicier than the other dried varieties). Instead of rolling the tortillas, you can stack or just fold them over (like the picture). Although queso fresco doesn't melt very well, you can't beat the light and delicious flavor. I always use this cheese for my enchiladas. I like to add chopped onions to the filling too. And lastly, before you serve these, pop them in the microwave to melt the cheese a little. My husband, who is Mexican, loves them with either a cheese and onion filling or with cheese, onion, and chicken. Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Flaquita"
},
"reviewBody": "This is as authentic as you can get for Mexican food. I make a very similar recipe, but with a chile verde sauce. You can either dip the tortilla in the oil and then the sauce or vise versa. I prefer to do oil and then sauce, that way I can drain the oil on paper towels without losing any of the sauce. For the sauce, do not drain the water when it's done boiling, use that blend instead of new water. Also, to flavor the sauce, try adding onion and the chicken bullion with tomato flavor--trust me, it makes it taste wonderful! Just throw everything into the blender and blend. You can use whatever dried peppers you have on hand (chile de arbol peppers tend to be more spicier than the other dried varieties). Instead of rolling the tortillas, you can stack or just fold them over (like the picture). Although queso fresco doesn't melt very well, you can't beat the light and delicious flavor. I always use this cheese for my enchiladas. I like to add chopped onions to the filling too. And lastly, before you serve these, pop them in the microwave to melt the cheese a little. My husband, who is Mexican, loves them with either a cheese and onion filling or with cheese, onion, and chicken. Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LILIMTZ"
},
"reviewBody": "THIS IS EXACTLY HOW MY MOM MAKES THEM, SHE'S FROM MEXICO. YOU HAVE IT RIGHT. YOU HAVE SOME COMMENTS THAT SAY DRAINING DON'T MAKE SENSE, MAYBE YOU SHOULD EXPLAIN IT SO THEY CAN UNDERSTAND IT. EVEN THOUGH IT MAKES PERFECT SENSE IF YOU KNOW WHAT YOUR DOING.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "irenereznor"
},
"reviewBody": "I am Mexican and can tell you that this recipe is definitely almost exactly how my mother and grandmother makes/made enchiladas. The only difference that I would make is adding monterey jack cheese to the inside rather than the queso fresco and than sprinkling with the top with the queso fresco. I know it doesn't sound very authentic but the montery jack melts nicer and has a good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl SmithAlvarez"
},
"reviewBody": "I use guajillo peppers and cotija cheese (which is more like a paremesan cheese). I also fill with small amounts (smaller than you would think) with shredded chicken, diced onion, cheese and finely shredded cabbage-cabbage makes them so much better than lettuce. When I make these I usually make over 100 bc everyone in family wants some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harley93"
},
"reviewBody": "I am Mexican and this is Authentic. Soo good. Just like the ones my grandma would make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Brue"
},
"reviewBody": "I just used a can of enchilada sauce and regular cheddar cheese... and it was FANTASTIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liezel"
},
"reviewBody": "This recipe was so easy to make and tasted just like enchiladas we had in Mexico - at the nontouristy places of course :) I popped them in the oven too for a few minutes to get the queso melting - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChefJorgeMiguel"
},
"reviewBody": "Glad to see authentic Mexican recipes. Most everything else found under \"Mexican\" is either Tex-Mex, Cal-Mex or just made up-Mex."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tnasty"
},
"reviewBody": "i do it the same kinda but instead i fry the tortillas first then dip them in sauce,for the sauce i use canned tomatoe sauce mix it with chicken flavored knorr and chile california in powder wich makes it easier oohhh and the sauce has to be heated in the dipping pan they go good with queso cotija sprinkeld on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "These are yummy. I prepared the sauce EXACTLY as directed and brushed it on the torts. Totally yummy!!! I added potatos and shredded beef to the queso inside. These were so tasty will soo be making again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brunhi"
},
"reviewBody": "The suggestion of draining the water where chiles were boiled is because that water gets really bitter. You should add fresh water to blender to prepare chiles mix :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I just wanted to see if these tasted as good as my mother's, and I must say they are pretty darn close. Thanks for sharing, we enjoyed them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margarita"
},
"reviewBody": "I will give you five stars, because finally, I have found the true way of making enchiladas!! I can reassure any one that this recipe is a good one, especially since I am from Jalisco, Mexico...&amp; Queso fresco is the best cheese to use for enchiladas. And I think what she meant by draining the sauce, is to use a strainer and push the sauce through with a spoon and maybe some water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa's Mommy"
},
"reviewBody": "this is really easy people the sauce has to be thick so it won't come off while in the oil. I always like to leave it for a while longer so they could be \"redder\" and you just need to drain the chilles. Nothing to it at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsmota"
},
"reviewBody": "This was a really good authentic recipe just like my mom would make exactly almost except i warm the tortillas first in a lil bit of oil THEN dip in sauce then fill them up with a mixture of sourcream,greenonions,tomatoes,and chicken and fill them up with that mixture.. all chopped up ofcourse, and i use just plain mozzerella cheese inside and on top and even queso fresco.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmichael500"
},
"reviewBody": "This is sooo good soooooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GourmetBabe"
},
"reviewBody": "Pretty close to the real thing, lacks a little flavor. Here's how my mom makes them. Roast the chilies on a flat grill or pan till they are roasted on all sides, (watch them so they don't burn, this will be quick; brings out the flavor a little more). This shouldn't take long. Immediately soak them in hot water till they are soft. In a blender add the chilies (remove tops and seeds depending on how hot you want it), water (a bit at a time), add onion, garlic, oregano and salt. (the measurements are small, but you will get them down depending on your taste). My mom also adds Masa Harina (the corn meal used to make tamales) to thicken it a little if it is too runny. Strain the mixture into a warm pan to keep hot. The tortillas are fried a little bit first then dipped in the sauce. If you don't want to fry them I have also heated them in a pan or grill till they are slightly crispy. We make our enchiladas as layers so simply piling them on top of each other with layers of cheese, shredded chicken (to the chicken we add a little of the enchilada sauce first), and onions. YUM :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marisa"
},
"reviewBody": "Finally someone knows how to really make them authentic! This is how my mom taught me. Except we boil chicken with onion, garlic, salt then shred it and use it as a filling. After that, we fry them. They are soooo delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Wensley"
},
"reviewBody": "When I lived in Los Angeles one of my dearest friends was a lovely woman from Mexico who came to my home evenings every week and taught me how to cook authentic Mexican recipes. This recipe was one of my favorites and it is so simple with pure tastes. However, as with everything I touch I add a twist. A gorgeous combination of Arbol and Ancho chiles makes this sauce sing as well as adding a very scant amount of cumin (don't go overboard as this spice packs a punch with its distinct pungency). I also prefer to make my own corn tortillas as it's the simplest thing in the world and you are guaranteed the freshest possible ingredients. By adding a bit of chopped green onion and mild green chiles to the cheese filling you score big points in flavor and still keep the authenticity alive. I tend to like my enchiladas oozing melted cheese, so after I plate them I add a spoonful of sauce a bit more crumbled queso cheese on top and slip it into a hot oven for a few minutes. Add the crema (or sour cream), tomatoes and lettuce and voila, perfection! These are decadent and so wonderful. Also, occasionally try the same recipe without the cheese and substitute spicey chicken and roasted potatoes. Mmmmmmmmmm....soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessitlv"
},
"reviewBody": "I remember the first time I looked for an enchilada recipe on this site and I thought, who makes enchiladas in a casserole? This of course is how you are supposed to make them. I use my own enchilada sauce and I make my own filling, the queso fresco should only be sprinkled on the top, not used in the filling. Also I don't fry all tortillas at one time and then go back and fill them. I fill them while they're being fried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Mundorff Mendoza"
},
"reviewBody": "this was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "I loved the sauce, I did add about 2 tsp chicken base and 1 jalapeno to the water for a little kick. I didn't want to fry the torilla so I rubbed a little oil on each side and then heated them up in a pan until crispy. Then I dipped them in sauce (which I didn't drain, I just took out the seeds from the chili's before putting them in the blender) and added the cheese (I mixed the fresco cheese with chedder cheese for more flavor), rolled them, sprinkled them with cheese, and then broiled them on high just until the cheese was melted on top. This is my new favorite red enchilada recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meretsoleil"
},
"reviewBody": "Awesomesauce! I'm glad somebody finally put something like this up. I never heard or ate enchiladas that were baked in a casserole pan and everytime I eat Mexican I refuse to eat enchiladas cuz they're not made the \"right\" way. LOL. My mom is from mexico too and she taught me to dip flour tortillas in sauce then fry and while frying add ingredients such as cheese, beef/chicken, onions, etc...So delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I loved this recipe. I have tried different ones but this one hit the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chynna-Destiny"
},
"reviewBody": "These are authentic! My husband is from Mexico and he said they were just like he had at the fiestas and ferias. I love finding real mexican recipes like this. \nIt is not an americanized version of enchiladas, if that is what some may be looking for. These are the real deal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KARAJOY7"
},
"reviewBody": "We used the real mexican tortias and it made them so much better than the flour tortias in the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Hintz"
},
"reviewBody": "I agree with the other reviewers that the draining of the chiles doesn't make sense. I blended them with the liquid and then strained it back in the sauce pan, put it back on the heat to cook down a bit. Dipping first in the sauce fried out the flavor of the sauce. I also agree that the filling should be a melting cheese like Chihuahua and save the queso fresco for the toping. Over all the flavor was good, but the instructions seem to be missing pieces and vague. Maybe if we could all learn the recipe from her mother in law we'd get it! Thanks for a recipe that is truly mexican in style and not one of those oven baked, drowned in sauce and cheese things most people in the US think of a enchiladas! If you have a mexican grocery in your area, use crema instead of sour cream... lighter and more tangy on the tongue! (Don't forget a few slices of advocado and a sqweeze of lime on top!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanethAngel"
},
"reviewBody": "These tasted very authentic, just like mom used to make. For a lot less work and still great taste, I sometimes use the \"Las Palmas\" red enchilada sauce. Also, while more difficult,they taste better when dipped in the sauce first, then fried in oil since the oil cooks the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "emrilwannabe"
},
"reviewBody": "This meal was so very bland. My family loves Mexican food but asked me not to make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THIS IS AN AUTHENTIC RECIPE AND GOOD! BUT TRY USING CHIHUAHUA CHEESE INSTEAD \"YOU WILL GET IT MORE CHEESY OR TRY THE ORIGINAL MEXICAN COTIJA!FORE A MORE DRIER ENCHILADA. ALSO TRY FRYING YOUR TORTILLA A BIT FIRST THEN DIPPING INTO THE CHILI MIXTURE THEN ADDING YOUR ITEMS TO AVOID LOTS OF SPLATTERS AND UNCALLED FOR GREASE BURNS &amp; BLISTERS! OTHERWISE THIS IS A PERFECT RECIPE AND EVEN MORE WITH SEASONED CHICKEN WITH SAUTED,ONIONS,TOMATOES AND GARLIC TILL A BIT DRY...ADDED TO THE CHEESE WHICH IS MY ABSOLUTE FAVORITE AND SO SO FILLING!WE EAT THIS REGULARLY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GAYLE521"
},
"reviewBody": "I was looking for somthing to do with a bag of chile de arbol peppers and was quite pleased with this recipe. I agreed with the other reviewer on, how do drained peppers, garlic and salt make a sauce. So I did not drain the water from the peppers. After making the adjustment, I would give it 4 stars. Good summer recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNYLYN1"
},
"reviewBody": "This was great! It's like an enchilada salad-perfect for spring and summer when regular (American) enchiladas are too heavy and hot. I use the Red Enchilada Sauce recipe from this site and change the assembly process a bit. I simply fry the tortillas (without first dipping in sauce)then place a little of the heated sauce on a plate, roll the cheese into the tortillas and place on the plate, and then top with more sauce and the rest of ingredients as indicated. Frying with the sauce was too splattery for me (I'm not that talented!) but this way I am able to capture the flavors and it is very easy. I love it! I added diced avocado the 2nd time I made it. YUM! This is now my favorite way to eat enchiladas-so fresh tasting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SEG1234"
},
"reviewBody": "Help! I must have done something wrong. The recipe says to drain the water from the chilis which I did but after adding the garlic and salt all I had was a paste. I couldn't dip the torillas in paste. How do you get a liquid if you drain the water. Otherwise the enchiladas weren't too bad but not what I thought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was surprisingly light. My husband and three teenagers enjoyed it. I need to do better next time on the sauce, it came out somewhat watery. I used the \"serve-with\" recipe titled \"Calabacitas con Queso\" by Jyn and it was perfect!! I am going to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe, not the same old same old.I am a meat lover however i loved this as a main dish. Everyone said it was better than most meat dishes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77917/authentic-mexican-enchiladas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1218/world-cuisine/latin-american/mexican/main-dishes/enchiladas/",
"name": "Enchilada Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/22770/world-cuisine/latin-american/mexican/main-dishes/enchiladas/vegetarian/",
"name": "Vegetarian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77917/authentic-mexican-enchiladas/",
"name": "Authentic Mexican Enchiladas"
}
}
]
}
}
, "about": [
]
}
]