				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Awesome Slow Cooker Pot Roast"
,"datePublished": "1999-10-05T11:17:23.000-04:00"
,"dateModified": "2022-08-08T11:43:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Brenda Arnold"
,"url": "https://www.allrecipes.com/cook/24321660"
}
]
,"description": "This Lipton onion soup pot roast made in a slow cooker simmers in a cream of mushroom soup gravy until tender for an easy, warm, and hearty dinner."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TY0PtoJRDeFtXsqiZuU43NJ86PM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16066-awesome-slow-cooker-pot-roast-mfs_1756-a77f1baa13d94393a24f6f1da34954e7.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1560957178001",
"description": "See how to make a quick and delicious pot roast that takes just minutes to prep.",
"duration": "PT2M5S",
"name": "Awesome Slow Cooker Pot Roast",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/02/18/16066-awesome-slow-cooker-pot-roast-mfs_1752.jpg",
"uploadDate": "2021-03-10T21:27:58.424-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Awesome Slow Cooker Pot Roast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "9771"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "426 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "127 mg"
,"fiberContent": "0 g"
,"proteinContent": "46 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "639 mg"
,"sugarContent": "1 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 (10.5 ounce) cans condensed cream of mushroom soup",
"1.25 cups water",
"1 (1 ounce) package dry onion soup mix",
"5.5 pounds pot roast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix condensed soup, water, and dry onion soup mix in a slow cooker. Place pot roast in the slow cooker and coat with soup mixture."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TY0PtoJRDeFtXsqiZuU43NJ86PM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16066-awesome-slow-cooker-pot-roast-mfs_1756-a77f1baa13d94393a24f6f1da34954e7.jpg"
}
]
,"text": "Cook on Low for 8 to 9 hours or High for 3 to 4 hours."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT190M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I substituted Cream of Onion Soup for the mushroom soup. It was AWESOME! I have been making this for years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "steve"
},
"reviewBody": "We made this a couple times without changes and it was good, but when we substituted water for broth and wine and some onion and garlic what a difference that made, wow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbolton"
},
"reviewBody": "I made no changes to this recipe and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwen"
},
"reviewBody": "Delicious! Agree no need to brown first. I suppose caramelization might add flavor, but it was so tasty without, why take the time? Chuck Roast I had on hand was 2#. We love gravy, so didn't reduce liquid much. 1 can crm. of mushroom soup plus as other reviewers suggested, I was going to use beef broth+red wine for the 1&amp; 1/4 c of water, but I had a can of French Onion Soup so used that with 1/2 c red wine. (I would have added some pearl or thick sliced onions if I'd used plain broth.) Also added about 10oz thicker sliced mushrooms and about 8oz baby carrots, trimmed as necessary, but mainly whole. Cooked on low about 12 hours, but it was probably done earlier. I poured juice off into kettle and thickened with cornstarch slurry, and made mashed potatoes. Meat, gravy and vegis all were wonderful. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carolyn Salazar"
},
"reviewBody": "Very disappointing. Very bland and watery. I even added four cloves of garlic and still no flavour. Would definitely cut down on the water in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "I made this using a 4/5 pound chuck roast and substituted golden mushroom for the cream of mushroom, substituted 1 can of beef consommé plus enough red wine to substitute for the 1 1/4 cup of water and added a pound of sliced mushrooms. It was exceptional!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Forrest Halford"
},
"reviewBody": "followed recipe exactly. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome recipe. I have made it several times and it gets better every time. I use beef broth instead of water. And I add a little browning sauce to it. I season the meat with, meat tenderizer, onion and garlic powder, McCormick Montreal steak seasoning and adobo. Who ever said this recipe was nasty was flat out making it wrong ( in my opinion). It’s a hit in my house! The gravy is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Great recipe, great gravy. We ate this for 3 nights. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Gardner Salyer"
},
"reviewBody": "This is an old recipe that has been a winner for me and my Mother for many many years. The Original recipe called for Campbell's Golden Mushroom Soup. It can be hard to find these days. If you do get it, use it instead of the Cream of Mushroom soup. It will elevate the flavor that much more. Otherwise the Cream of Mushroom is a good substitute and I have used both with success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki Langenburg Dieguez"
},
"reviewBody": "We really enjoyed this recipe. I did substitute Au Jus for the onion soup as per another review. I also added potatoes, carrots and celery. Will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was SO dang good. My husband and I were so impressed! We had never heard of Cream of Mushroom soup and pot roast! I will never do it any other way now. I seared the roast with Garlic powder, pepper and Lowry Season salt. I mixed soup, water and dry onion soup in crock pot and placed the roast in the soup mixture. Added carrots and small golden potatoes 2 hours before done. EXCELLENT RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kennyweir"
},
"reviewBody": "Perfect for someone who works. I'm single, and have to come home every night. Wondering what I'm going to do for dinner.\n\nThis roast is perfect for a single person. Put every thing in the slow cooker. Before, leaving for work.\n\nIt's ready when I get home. Make up some mashed taters. Dinner is done, and there is lunch for the next day.\n\nOut of all recipes on this site. This is the recipe, I use the most."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Marano"
},
"reviewBody": "This was the easiest pot roast I ever made and the flavor was terrific. The meat shredded easily. The soups worked nicely together to create a wonderful taste. I served it over Amish egg noodles. Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette Flanagan"
},
"reviewBody": "This turned out so well. I used one can of cream of onion soup and one can of cream of mushroom soup with the dry onion packet. It was so tender and the flavor was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "It was great. I made it for New Years Eve and it was a big hit. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "winkie"
},
"reviewBody": "I added Calvender's Seasoning to the roast and a small amount of white wine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "I made it but with a couple of changes. I browned the roast in butter with sea salt and ground black pepper. I then whisked together the soup, onion soup mix, and water. I added 2 cubes of beef bouillon to the water. I then mixed it with the butter after removing the roast and placing it in the crock pot. After mixing all ingredients with the butter, I then poured the mixture over the roast.\nIt was fantastic!! My 17 yr old son even went back for 3 helpings!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "So much flavor! All of the ingredients worked so well together! Loved it!! Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KJ Mom of 3"
},
"reviewBody": "I've made a lot of pot roasts for my sons and they proclaimed this one the best by far! And I've proclaimed it the easiest! Will be my only slow cooker pot roast recipe going foward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meem"
},
"reviewBody": "I had surgery on Wednesday and really wanted a homemade meal on the weekend. Threw this awesome slow cooker pot roast together literally in 5 minutes . Which was about all I could stand after a knee replacement 3 days before! Didn’t do any of the extras like browning the beef and guess what? Won’t even bother next time. Only addition…I always add a splash (half a cup/soup can) of red wine. Turned out great! Just what the doctor ordered!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duane"
},
"reviewBody": "great recipe will use again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex575"
},
"reviewBody": "The first review of this dish wasn’t finished but it uploaded so I’m writing it again. I did doctor the recipe by adding 1 large onion (half sliced and browned in the pan using the drippings from the meat; the other half goes in raw at the bottom of the Crock Pot. I also added a box of mushrooms sliced, 5-6 celery stalks (because they were going bad and didn’t want to waste them), 3-4 garlic cloves. I added seasoned salt, garlic salt, paprika, Ajinomoto, and some pepper. I love Cream of Mushroom soup but I was afraid of using 2 cans because I thought it would come out white so I used 1 can of Beef Broth in its place.So I used 1can of Cream of Mushroom soup and 1can of Beef Broth, along with the 1 package of the Onion Soup mix (generic brand). I seasoned the roast and pierced some holes in it to put in the garlic cloves, dusted it with flour and then browned in the pan before adding to the Crock pot. I browned half the onion and the celery, covered the bottom of the pot with the other half of the onion then placed the roast on top of it. Then I added the 2soups, 1package of onion soup mix, and cooked on High for 6-hours. After 6 hours I switched the setting to low,, added the mushrooms and cooked for another hour on low. I had to add some flour to thicken up the liquid.. I forgot to mention that I used Chicken Broth in place of the water.. The results were fantastic! Very tasty and the gravy turned into a lighter shade of brown! Served with rice and egg noodles (leftover)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mpb"
},
"reviewBody": "Love this roast! I made it as written several times before I made adjustments. I use one can cream of mushroom and one can cream of mushroom with roasted garlic. I also skip adding the water. Cover the roast in the soup mixture and let it cook. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naples Kim Cooks!"
},
"reviewBody": "Amazingly easy recipe! Followed some lovely tips from others reviews and made seasoned flour and Browned the meat (4 lbs 4 oz) on all sides then scraped all the drippings into the crock pot along with 2 cans of cream of mushroom soup, onion soup mix packet, and a whole container of the beef broth. Started on high for 2 hours then set it to low for 5 more. Meat was literally fork tender with the best gravy. Steamed baby carrots and asparagus, sautéed fresh mushrooms, and cut up 5 large leeks. Put the leeks in with the meat mixture, made mashed potatoes to go with everything! Talk about TOTAL YUM! Hubby truly loves his amazing wife and chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B rad"
},
"reviewBody": "Love it. New family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa J."
},
"reviewBody": "OH MY PERFECTION! Prepared as instructed, side mashed potatoes n gravy (from the crock) and salad. So doggone good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janiemross"
},
"reviewBody": "I have made this for several years, and it's the best pot roast I've ever tasted and easiest I've ever made. I do add the little potatoes, carrots and I quarter a couple of onions, too, and throw in. Meal is done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron Mickoski"
},
"reviewBody": "Made this last night, and WOW ... what awesome flavors !!! I basically stuck to the specs, but added an extra can of mushroom soup &amp; 1 &amp; 1/2 cups of beef broth instead of H2o. I slathered the roast in the mix &amp; sprinkled the top with a light topping of more onion soup mix. Set on high for 4 hours. Last hour I added my baby spuds, baby carrots &amp; chopped onion. Holy %#$@ ... I'll be making this once a month. Thanks so much for sharing this on AR ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elin"
},
"reviewBody": "I made it for a bunch of hunters staying at our house. They all loved it, and they are all relatives that would have told me if it was not good! I did thicken the gravy with some corn starch. I am making it again tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mama"
},
"reviewBody": "Followed recipe with the exception of I sprinkled with salt,pepper, garlic powder, and flour. Seared the meat for about 4 min per side. Added carrots, celery, and potatoes to crock. I had only a 2 lb roast so plenty of liquid for everything. Family loved it! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This is a favorite in our house! I use tri-tip roast and substitute the water with a can of beef broth. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Foran"
},
"reviewBody": "Fantastic recipe! Pot roast was tender and full of flavor. Family loved it. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ramona Brunswick"
},
"reviewBody": "I scale this down since I'm only cooking for 2. Use a 2.5 pound roast, one can of soup, one packet of dry soup and 1 soup can of water. Made it several times, and it's always turned out delicious! Usually, I sear the roast before putting it in the crock. Made it the lazy way tonight (no sear) and it still turned out great. Definitely a keeper for the dinner rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Cheek"
},
"reviewBody": "I Love all your recipes and so do'es my husband. I made my pot roast and it comes out so tender. you don't need a knife to cut it. I put it on at 6am and it;s ready for luch. y'all have a Happy New Years. and a Blessed Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "I loved this recipe. The only thing I did different was that I used beef broth instead of plain water and sliced three stalks of celery and one onion to place the meat on. There was no need to thicken the gravy. Served with a crisp mixed salad and crusty sour dough bread. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alleycat"
},
"reviewBody": "Absolutely fabulous - my husband loved it. Definitely adapt the recipe - 1 can of mushroom soup, 1 can of water, onion soup envelope &amp; a 3-4 pound chuck roast - got 2 meals for 2 people . Slow cooked it for 8-9 hours and left it on warm until dinner. Will make this again !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taylor"
},
"reviewBody": "Wow this recipe is delicious!! It really goes to show sometimes less is more. I have been on the hunt for a good pot roast recipe, and have gotten okay results, but not what I wanted. I resisted my natural impulse to add to the short ingredients list, and I’m so glad that I did!! I ended up halving the recipe, as there were only two of us. So I had a 2 3/4lb roast, and literally cut the soup/onion mix all of it in half. The only changes I made was to salt/pepper the roast, coat it in flour and brown it up in butter. I also substituted the water for beef broth, I cooked it on low all day, and when I got home I took the gravy and thickened it up with flour on the stove and added it back to the crockpot with the roast. It was truly delicious!! I had hoped frying with the flour first would thicken up the gravy, it didn’t, but that’s not a big deal. This also makes a ton of gravy, as a gravy/sauce lover I was more than satisfied. Thank you so much for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this yesterday and it's definitely a keeper!! I did use beef broth instead of water. Cooked on high for 4 hours, then added potatoes and carrots. Cooked an additional 2 hours on high and it was perfect. No thickening needed since the starch from the potatoes was enough to do it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrian Jenkins"
},
"reviewBody": "Easy recipe that makes a great pot roast every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia McKee"
},
"reviewBody": "Love it!! Only I added McCormick seasoning packet also to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Celestino"
},
"reviewBody": "This recipe is super easy. I use a smaller roast 3 to 4 pounds because it’s only 4 of us. I sometimes use condensed golden mushroom soup and/or? condensed cream of celery soup. They are all fine. I don’t bother to brown the meat. The whole idea of this recipe is that it is quick and easy. Why complicate my life with extra unnecessary steps. I serve it with mashed potatoes and an array of vegetables and or a salad. No matter what you serve it with it’s delicious and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Dworak"
},
"reviewBody": "Great recipe. I used a 2 1/2 pound beef round sirloin tip roast. You ask why? Because that’s all the store had. Chuck roasts were all too small. But I added a 10.5 can of mushrooms and also used a 10.5 can of beef broth instead of water, along with a pouch of Lipton Dry Onion. I went ahead and seared the roast in a pan on the stove, 5 minutes per side. Then I placed the roast in the slow cooker, and let it cook for 6 hours on low. The roast absolutely fell apart removing it from the slow cooker. Just absolutely tender and delicious. By far, this is the best pot roast I’ve ever made. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janmarie1964"
},
"reviewBody": "After having this recipe in my recipe box for quite some time, I made it for our Sunday dinner yesterday and I'm glad I did! I did substitute low salt beef broth for the water and I did brown the roast before putting it in the slow cooker, although it's not necessary. Our roast was very moist and tender. I put a couple of handfuls of quartered fresh mushrooms in during the last half our for my own personal preference. This made plenty of gravy and I didn't find it necessary to thicken it at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Leffler"
},
"reviewBody": "I just made this for the first time and OMG! I had to write a review as soon as we finished eating and I’ve never wrote a review on a recipe before, if that tells you something. I honestly don’t think I’ve ever seen my husband clean a plate like that. I took some of the suggestions that other people had posted and modified the recipe. I used a 2.5 pound chuck roast since it’s only two of us. I seasoned the meat with salt, pepper, and garlic powder. I then dredge it in flour and seared it in olive oil. I ended putting the two cans of soup and onion packet since we love having lots of gravy to go with potatoes. I did use beef broth instead of water. I had to add 2 TBSP of corn starch to thicken the gravy. So happy to have this yummy recipe to add to the mix. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoozintheKitchen"
},
"reviewBody": "Love this. I use vermouth instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Cimbala"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Phillips"
},
"reviewBody": "So delicious! I added fresh mushrooms the last hour of cooking and used golden mushroom soup as a dairy free alternative. It turned out tender and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pchredwine23"
},
"reviewBody": "This is the best roast recipe I've ever had. I followed the directions and from reading all the reviews, I added Worcestershire sauce, fresh onions and garlic. I will never use all the other recipes I've tried. This is simply the very best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Barton- Gochenaur"
},
"reviewBody": "Really tasty! We raise our own grass fed beef so I’m always looking for different beef recipes. I used a tip roast, no searing and it was great. I did add salt, pepper and a little garlic. I cooked it on high for the first couple hrs then dropped to low, for a total of 6 hrs. Through in some carrots and celery a couple hrs before it was done and made mashed potatoes. Hubby loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Kusch"
},
"reviewBody": "This was fantastic exactly as the recipe called. The gravy was outstanding and I will be making pot roast this way from now on"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScubaSkirt"
},
"reviewBody": "This is the best pot roast recipe. I cannot stand the boring recipes with carrots and potatoes. They ALL taste the same. This one is perfect. Reduced some of the sauce after the meat was done. No need for flour if you simply reduce the sauce. Served it over organic jasmine rice with fresh farmstand roasted yellow squash on the side. Perfect. Leftovers even more perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ray Patino"
},
"reviewBody": "Took much longer, and there was no guidance on when to add the vegetables. I made it through the recipe and it did come out tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "oneschott"
},
"reviewBody": "As written this pot roast recipe is a complete failure! I followed the directions exactly, purchased high-quality meat, and the result was barely edible. The meat comes out looking pale, the gravy is watery, and the flavor is bland. Don't bother making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "The roast is very good. I coated the meat with Better Than Bouillon beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Chojnacki"
},
"reviewBody": "This recipe has been made by my Mom for over 30 yrs!!! C It was always our winter go to dinner, soo easy. The only difference is we do not put any water. Just onion soup mix and mushroom soup plus a few dashes of Worcester sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lillian"
},
"reviewBody": "This recipe came out nice and flavorful. I got about 4lb of roast meat, 22oz of cream of mushroom condensed soup, and also added sliced carrots and some potatoes (cut to bite-sized) to the mix (along with the dry soup mix). Since I added the potatoes and the slices carrots I only added about 1/3c of water instead of the 1 and 1/4c that the recipe calls for. Based on other recipes that mention the gravy not being flavorful or adding veggies I knew this would be necessary. I do wish that I added some extra salt and pepper, I'll do that next time.\n\nI have a \"one setting\" slow cooker (instead of high/low) and it normally cooks things pretty quickly. I was surprise to find that this roast needed about 7 hours on my cooker to complete. Time will vary depending on your cooker and the cut of meat you got, of course. Wait until it's tender and easily breaks apart with a fork before you decide that it's done. It will be worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Spence"
},
"reviewBody": "Great. Used 2.3# English roast seared first. Added potato, onion, carrot and celery. Added after mixing - 1 can cream of mushroom soup, 1/2 pack dry onion soup mix, 1/4 cup merlot and as recipe says. 4 hours on high, 2 hours on low. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Super-Trooper"
},
"reviewBody": "Great recipe! Even my picky son who hates roast ate it and said it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T.Hudgins95"
},
"reviewBody": "A family favorite. I made as described. No changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stuart"
},
"reviewBody": "such a great flavor from something so easy to make. the left-over gravy was used the next night dinner on sausages and mashed potato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Excellent and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lis"
},
"reviewBody": "This is a simple recipe that renders delicious results. The roast is tender, flavorful and makes its own wonderful gravy! My family loved it and I couldn't be happier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Very good, great flavor, the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred"
},
"reviewBody": "No, Yes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie"
},
"reviewBody": "Absolutely delicious. Fell apart"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "Trimmed the beef of fat and followed the recipe exactly. I was attracted by the simplicity of the recipe. Unfortunately, it was quite bland. I won't be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missangelakay"
},
"reviewBody": "This was delicious! I had a smaller roast (3.5 lbs) however the only difference is I used 1/4 cup less water. Everything else stayed the same. I cut up the roast when it was done added it back to the gravy and spooned over white rice. The gravy is so delicious and would be good over bread, mashed potatoes anything. I will forever make this dish one of my go to dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oak Moon Farm"
},
"reviewBody": "With only 2 of we shoot for about a 3 pound cut of roast unless having company. This said, I generally use same ingredient list for this smaller roast. Because I strain the cooking liquid and use it for gravy on the potatoes and carrots we usually have with this it comes out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rlltex"
},
"reviewBody": "This was really good. Super easy too. I did sear my roast ahead of time and also added carrots and small potatoes in after a couple of hours of cooking. My son who is a very picky eater got seconds so this is a winner! Will definitely make again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Cobb"
},
"reviewBody": "My whole family loved this recipe. We will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becka"
},
"reviewBody": "Finger licking GOOD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHAWK"
},
"reviewBody": "Loved this dish and will be making it again often! I modified the recipe as follows:\n1. I dredged the meat in seasoned flour and browned it on all sides before placing in slow cooker.\n2. I replaced water with 3/4 c. each of beef broth and red wine. I added more red wine near end of cooking time.\n3. I cooked the roast on high for an hour, then set it on low for 8 hours.\n4. I partially cooked small potatoes and carrots and added them to the slow cooker for the final hour of cooking (this is when I added more wine).\n\nThe gravy was delicious and the meat was incredibly tasty, moist and tender. A hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichole Tanner"
},
"reviewBody": "My new favorite beef roast recipe! I used half a cup red wine and half a cup of beef broth instead of water per another reviewers suggestion. Some people complained that the sauce is too thin. My husband preferred the thinner broth while I reduced some of it with a bit of flour to create a gravy. I could drink that gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Sly"
},
"reviewBody": "I did add a teaspoon of sea salt. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Bailey"
},
"reviewBody": "This is great recipe! My family loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goodtimecook"
},
"reviewBody": "Have made this for years....actually the last nearly 50 years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SG Welch"
},
"reviewBody": "First time I've ever had success with crock pot roast!!! \nUsed beef broth instead of water &amp; browned the roast before putting on to cook. My only regret... I used a 2.5 lb roast so no leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Pryor"
},
"reviewBody": "Easy and excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I have made this many, many times and it's always a hit. My daughters favorite dinner and the one she always requests every birthday. I always cook on low and I've taken to substituting the water for beef broth just to enhance the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "threetoes"
},
"reviewBody": "Only added cup of water came out GREAT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pooh Bear"
},
"reviewBody": "I love this recipe! Thank you for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Leonard"
},
"reviewBody": "Only used one can of mushroom soup. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Manning"
},
"reviewBody": "It was fantastic and I will recommend this recipe for anyone to try. Unbelievably tender and juicy. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nathan Hoover"
},
"reviewBody": "It's a good base recipe for one to alter. If you are going to make it as is, then it isn't the greatest recipe out there. If you want something quick to prepare then this is your recipe, but I would recommend adding a gravy mix. I've made this three times already. \n\nThe second time I added a gravy mix which helped it a lot. The third time, I switched out the cream of mushroom for cream of celery. I also added white onions, carrots, brown gravy mix, Worcestershire sauce, and a pot roast mix. It turned out great with mashed potatoes, and/or baked potatoes. Both the second and third times, I seared the beef in a pan with olive oil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Neade"
},
"reviewBody": "I've made this recipe atleast twice a month for the past year. It always turns out AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "I made this with the changes \"sdgirl\" made to it and it was awesome. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "Super good gravy. Will make again. Delicious and easy. Can’t beat that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Pasisz Deegan"
},
"reviewBody": "EXCELLENT! I’ve been using this recipe for years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Varnau"
},
"reviewBody": "It turned out way better than I thought it would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luke"
},
"reviewBody": "The gravy is excellent and can be used on most any meat dish substituting box beef broth for roast drippings. Only change I made was thicken and darken little bit using corn starch and browning sauce. And added couple 8 oz cans of mushroom stems and pieces. Very nice. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "This turned out great! I followed the recipe as written...I just added potatoes, carrots, and celery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Griffith"
},
"reviewBody": "Delicious! Used a 2.5 lb chuck roast. I looked at other reviews and browned meat in olive oil before putting in crock pot. Used 2 cans cream of mushroom, 1/2 packet beefy onion soup mix, 1 cup beef broth, 1/4 red wine and 1 tbsp worchester sauce. Did not use water. Plenty of gravy. Was thin like other reviewers said so I added cornstarch and water to thicken. Would make again! Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "woodpqrstu"
},
"reviewBody": "I found this to be an average type recipe for pot roast, I did not think it 'awesome'. The 'soup/sauce' created by the liquid/canned soup does need to be thickened I think. I prefer pot roast recipes with some seasoning: rosemary, thyme, and maybe some sage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brprescott"
},
"reviewBody": "Very straight forward, does make a great gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oldair"
},
"reviewBody": "This is my go-to recipe for pot roast - the only difference is I replace the water with red wind and usually add freshly chopped onions, mushrooms, peppers, and garlic to the slow cooker. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Whitley"
},
"reviewBody": "I got this recipe from my mother-in-law. I've made it with both cream of mushroom and cream of celery, and the cream of celery tastes a lot better. Also, add in potatoes, carrots, celery, mushrooms, turnips, corn, whatever to make it one-pot meal. I just cook for myself these days, and only make this for a potluck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie B"
},
"reviewBody": "I always sear the meat. And I also add fresh mushrooms. Other then that it’s great as is. So easy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16066/awesome-slow-cooker-pot-roast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
"name": "Pot Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16066/awesome-slow-cooker-pot-roast/",
"name": "Awesome Slow Cooker Pot Roast"
}
}
]
}
}
, "about": [
]
}
]