				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baby Back Ribs"
,"datePublished": "2000-01-03T22:55:09.000-05:00"
,"dateModified": "2022-06-12T19:28:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KHEFFN"
,"url": "https://www.allrecipes.com/cook/212147"
}
]
,"description": "These baby back pork ribs marinate overnight in BBQ sauce, then bake in the oven until extra succulent, flavorful, and fall-off-the-bone tender."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gzQN_BmFcizrMjfQ_bZs01JAHp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5447437-baby-back-ribs-RainbowJewels-1x1-1-fd064fe4d982474d8084678ce2cc143f.jpg",
"height": 1000,
"width": 1000
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1706563411001",
"description": "See how to make tender, fall-off-the-bone baby back pork ribs.",
"duration": "PT2M33S",
"name": "Baby Back Ribs",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/6d2eb812-6354-4997-9f08-bc85362b916c/9bd29aa2-7307-46ef-8370-41934d0cbe90/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:32:36.694-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baby Back Ribs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "2028"
}
,"cookTime": "PT150M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "697 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "170 mg"
,"fiberContent": "1 g"
,"proteinContent": "43 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "1607 mg"
,"sugarContent": "33 g"
,"fatContent": "37 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 pounds pork baby back ribs",
"aluminum foil",
"cooking spray",
"1 (18 ounce) bottle barbecue sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cut ribs into 4 equal portions."
} ,{
"@type": "HowToStep"
,"text": "Tear off 4 pieces of aluminum foil big enough to enclose each portion of ribs. Grease each piece of foil with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Brush ribs liberally with barbecue sauce; place each portion of ribs on a piece of foil. Wrap tightly and refrigerate for 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gzQN_BmFcizrMjfQ_bZs01JAHp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5447437-baby-back-ribs-RainbowJewels-1x1-1-fd064fe4d982474d8084678ce2cc143f.jpg"
}
]
,"text": "Bake ribs wrapped tightly in foil in the preheated oven for 2 1/2 hours. Remove ribs from foil and serve with more sauce, if desired."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT645M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BellaLuce4"
},
"reviewBody": "For a quicker/ tighter time constraint I adapted it. Using other recipes and on of the reviews on this recipes. Great recipe, read someones review about cooking them the same day and I followed with some adjustments from other recipes. THEY WERE AMAZING n fell right off the bone as promised. Cut ribs in half, trimmed the thin layer of covering on the back/bone side of the spareribs, start at the end with a knife and then use your hands to pull off the entire layer. Then scored it crosswise with a sharp knife. This allows the rub and barbecue sauce to seep in on the bone side. Then I trim excess fat and cover both sides with juice from 2 small limes and refrigerated while I made the rub. It will not taste like lime, it acts as a tenderizing agent. Rub - what ever you like. I used 3/4 cup on light brown sugar, salt pepper, garlic powder, onion powder, paprika (generously), dry mustard and cayenne pepper to your taste. Ribs were only in the fridge for 10 minutes with the lime n I then used the rub all over including all the side. Had foil pieces ready n then used 3/4 of a bottle of Barbecue sauce, smothering both pieces on all sides. Doubled rapped each section very tightly and cooked in a large glass casserole uncovered in preheated oven for 2.5 hours on 275. From beging to end they were ready in 3 hours. The trimming of the meat and cooking time took the longest. Once done, I opened each section in the casserole dish to keep the juice and run off of the sauce, cut the ribs into individual pieces and put them back in the glass dish n bastelndes the ribs and then served them. I Everyone loved them!!! Tender and delicious. Next time I will try the overnight, just didn’t have the time yesterday, but def did not make a difference on how delicious they came out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "MOIST, TENDER AND DELICIOUS! WE DO NOT DO THE OVERNIGHT FRIDGE BIT. MAKES NO DIFFERENCE. FALLS OFF THE BONE, JUST THE WAY, WE LIKE IT! GREAT FLAVOR!! SERVED WITH COLESLW AND BAKED BEANS, MACRONIT AND POTATO SALAD. LIKE SUMMER IN THE MIDDLE OF A WINTER WONDERLAND OF NEW HAMPSHIRE.SO HAPPY WE FOUND THIS RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried it, didn’t like it so I modified it. I now smoke them for 2 hours on the BBQ with indirect heat using a rib rack. I then bake them as described with no sauce, then grill them for a few minutes on the BBQ to caramelize the sauce, then I’ll give a 5 rating. Thanks for the baking tip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dark Pone"
},
"reviewBody": "It was simple and easy to follow with good results, I recommend this for making baby backs for the first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MikeCalgary"
},
"reviewBody": "I did something similar. I found 300 is too hot for that amount of time. I did it like that and they were good. But going to do the same time @ 275. The missing part here is another 30 minutes uncovered after you glaze. Then perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "Take it from a girl who never made ribs before trying this recipe...the BEST ribs ever! My husband and sons love ribs and won’t order them in restaurants anymore because they think these are far better than anything they get in a restaurant. I do exactly what it says but also broil them as everyone mentions. I actually don’t even eat ribs, but LOVE these! Sweet Baby Rays, no “rub” (which I keep thinking I should try but then think it’s not necessary when they’re so stinking good this way!) and cook as stated with more sauce to broil and whallah...Queen of the kitchen! I’ve made this so any times now and it’s never a disappointment. Thank you for helping those of us who may not be spectacular in the kitchen look like super stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kim Jenkins"
},
"reviewBody": "Not my favorite. Ribs need to be grilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lela Mac"
},
"reviewBody": "I had a 3 pound rack of ribs. First, I removed the thin membrane from the back of them. Next, I marinaded for 2 hours in the refrigerator in a bit of hot pepper vinegar. Next, I took them out of marinade, seasoned with salt, pepper and garlic powder on both sides. I wrapped them tightly in the aluminum foil \"bags\". (sprayed with Pam) Cooking at 300 for 2.5 hours, I next removed them and juices from the foil bags, and coated both sides with our favorite sauce. Placing them, meat side up under the broiler for about 7 minutes gave them just time for the sauce to stick well to the ribs. I let them sit about 15 minutes. They were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnainOK"
},
"reviewBody": "This is not so much of a recipe as a method of cooking; the end result is delicious!\n\nI had two racks of ribs, and used a half jar of BBQ sauce between them. \n\nAfter two hours, I took them out of the oven and gave a peek. They were almost ready, so I had my husband throw them on the grill for a few minutes, just to caramelize the sauce. You could do the same thing under a broiler. That's a simple personal preference, they were quite tasty as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rushdey"
},
"reviewBody": "I used a dry rub and sealed the ribs in foil the night before. Cooked ribs in the oven at 275 for 3 hours, then sauced and finished on grill for 20 minutes. Fabulous ribs. Fall off the bone and by far were the best ribs I have ever made. Thanks for the tips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Petdragonfly"
},
"reviewBody": "Turned out amazing! I used boneless beef ribs as my darling husband will not eat anything on a bone. Followed the recipe to a T otherwise. For the first time, since we've been together he has told me that this is definitely a \"make again\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mars"
},
"reviewBody": "I used sweet baby rays on half and Buffalo Wild Wings honey bbq on the other half. I followed the comment that suggested broiling it. I highly recommend doing so! I broiled it on high for about 7 minutes and it came out perfectly! This recipe helped me overcome my curse of burned/ overcooked meat. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky"
},
"reviewBody": "Great ribs! I bought 2 full racks of ribs and didn't have space for all of those foil packs. Instead I cut them in half and marinated them in a 13x9 and covered them with foil and left them in the refrigerator overnight. The next day, I decided that making all of those packs was a waste of time and a pain in the butt so I decided to have 2 13x9s of ribs, covered with more bbq sauce, and covered each with foil. I cooked at 300 for about an hour and then broiled each 13x9 separately with an extra glaze for about 8 minutes each. The ribs were not fall off the bone but rather bite easily off the bone which I preferred. An excellent and fairly easy meal that can be enjoyed all year long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I have done this with sauce and with dry rub.\nI don't cook my ribs any other way now.\nThey fall off the bone.\nSo easy to do.\nThanks so much!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dena Greenawalt"
},
"reviewBody": "I used the dry rub suggested in one of the reviews and then added BBQ sauce before broiling. Turned out perfect! I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "I used a homemade bbq sauce recipe instead of a commercial brand. The ribs were very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Esposito"
},
"reviewBody": "Excellent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beckyrey"
},
"reviewBody": "Easy and really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlphaBravo"
},
"reviewBody": "The most amazing tender, fall off the bones ribs!! I've tried a few methods before, this is by far the best way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMac"
},
"reviewBody": "Very good indoor cooking method. Very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan in MD"
},
"reviewBody": "These were delicious. I did exactly as the recipe called for but I did add more sauce at the end and broil for a few minutes. It made all the difference in how they looked -- great! Compared to how they look when you open up the tin foil after baking. I'm about to make again, this time with a bigger rib."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trsa_rn"
},
"reviewBody": "Fall off the bone perfection — the kids absolutely loved it!! I used SWEET BABY RAYS ORIGINAL and FAMOUS DAVE’S RIB RUB... great flavor!! I did remove from the packets and broil... it held to caramelize the BBQ sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edan9801"
},
"reviewBody": "tasted great! Put rub on short ribs, smothered it in bbq sauce and wrapped it in tin foil for eight hours. I forgot to prepare the tinfoil beforehand, but nothing stuck to the ribs. they fell off the bone too...perfect. Had ribs for a week to eat and received hand-written compliments"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "john prillaman"
},
"reviewBody": "Added my favorite rub and smoked salt. Didn't have time to marinate over night but still turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Greg Irwin"
},
"reviewBody": "Added bab rib sauce and will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "Made these for my step-sons Birthday! They were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichelle Perera"
},
"reviewBody": "Very yummy and very easy. I used the dry rub as per Cathy M's comment. Slathered the BBQ sauce over the rub and marinated overnight. In the morning, I baked it for 2 hours 15 minutes, then changed the foil, slathered on more sauce, and broiled for 4 minutes. I used Sweet Baby Ray's BBQ sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilene"
},
"reviewBody": "the ribs were amazing....so easy and the clean up was good.\nIm making them again for thee forth...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bellylaughs58"
},
"reviewBody": "OMG I don't even know where to begin. The most delicious thing I've ever put into my mouth! Like lots of others, I boiled the ribs (I used baby-backs) for 45 minutes. Then, as instructed, I placed on a pan, covered with barbeque sauce (I used Sweet Baby Rays), covered with foil and cooked at 325 for an hour. After that, I removed the foil, turned up the oven to 400, and slathered more barbeque sauce on, then cooked uncovered x 10 minutes. Removed from oven and let rest around 10 minutes. Folks, this could win an award :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jimmy "
},
"reviewBody": "I made this. Never again. meat tender enough for shure. This recipe has no taste. planning on adding flavor in the future. will not use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrierichert"
},
"reviewBody": "I made these for a BBQ for a group of friends and family. Very simple to make and everyone loved them! I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shnitzel"
},
"reviewBody": "Cut into 1/4 sections, used dry rub, cooked in oven for 2-1/2 hours then let rest before putting in fridge. Finished off later in air fryer with BBQ sauce topping (cut into singles before lathering on sauce. About 8 minutes to get the BBQ sauce to caramelize. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Herring Cobb"
},
"reviewBody": "This was really great! I follow the other reviewer’s and cooked for 2 1/4 hours, broiled and added more sauce the last 15 minutes. The meat fell off the bone and was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "This is an excellent and easy way to have succulent baby back ribs. I sprayed my foil with cooking spray, poured in some barbecue sauce, put the ribs on top, added more sauce and sealed it up around 9am. I put it in the oven at 4, along with a potato wrapped in foil, and waited patiently for 2 1/2 hours. The potato was perfect and the ribs were awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I read the reviews and modified to their suggestions. I coated the ribs with a dry rub instead of BBQ. After marinating and baking, we coated the meat in a BBQ sauce and finished on the grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANHale"
},
"reviewBody": "if I could give more than 5 stars, I would! So delicious, ribs were just as good as though we get the annual rib cook-off. Tender fall off the bone, great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kacy"
},
"reviewBody": "Fall off the bone tender. So simple. I put the ribs under the broiler for a bit to crisp up the BBQ sauce. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Phelps Marx"
},
"reviewBody": "Followed the recipe exactly and while they were super easy and tasty, some of the ribs were really dry. Maybe it’s the ribs or my oven but I think I’ll either try a lower temperature or cook them for a shorter period of time next go round."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "I love ribs, I love Baby Ray's BBQ sauce, but I was very disappointed with this recipe. Yes the ribs were tender fall off the bone but all I could taste was the aluminum foil. I think I actually spoiled the ribs for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Reitz"
},
"reviewBody": "Couldn’t keep the meat on the bone, so so tender. My new go-to recipe. A hit with my whole family from Grandma to the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Alford Boswell"
},
"reviewBody": "This has been my go to way to make ribs, have been using this recipe for years. Always fall off the bone perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Marcum"
},
"reviewBody": "easy make and clean up, Delicious- baked potatoes wrapped in tin foil for the same cook time were assume - any green vegetable makes a nice looking plate - capped with a full body Zinfandel or Cab. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Burghart"
},
"reviewBody": "I have always been reluctant to cook ribs because I thought it would take forever and they'd still be tough. This method produces tender fall-off-the-bone ribs. You can try the fancy rubs with it, but for most folks that just isn't necessary. Two tips that have been mentioned seem worth doing: strip the membrane on the back and, at the end of the oven baking, brush with a little more sauce, then broil the ribs for a few minutes. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nori"
},
"reviewBody": "Wonderful flavor and moist and tender. Easy to put together but the best part was I could still use my grandmothers barbecue sauce!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene"
},
"reviewBody": "I made this exactly as written and it turned out fantastic! I would highly recommend this recipe. this is so easy and the meat is so flavorful and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bobbies-girl"
},
"reviewBody": "Take heed to wrap the ribs TIGHTLY. I didn't do so well and had a lot of leaking from the foil. It also wasn't easy to remove the hot foil from the hot ribs! Great taste, though. Would make it again ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gennie Atkinson"
},
"reviewBody": "I really love this method. The day before cooking I do a brown sugar rub and put the ribs in their foil pouches. The next morning they go right to the oven from the fridge. At the two hour mark I open them up and brush them with my sauce and give them thirty minutes. Then I turn them and brush another layer of sauce and another thirty minutes. Done! Tender, moist, fall off the bone, delicious and easy cleanup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cath27"
},
"reviewBody": "I followed the many recommendations - Using the rub (¼ cup brown sugar, 1 ½ Tablespoons Paparika, 1 Tablespoon Kosher Salt, 1 ½ Tablespoons Black Pepper, 1 Teaspoon Garlic powder, 1 Teaspoon Onion Powder, ½ Teaspoon Cayenne Pepper). Since I found this recipe the day I wanted to cook them - so, they only sat with the rub for only a few hours! I cooked for 2 hours, then put on the grill for 15 minutes. They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Monk VanderMolen"
},
"reviewBody": "I have made this recipe for years. They are always a hit, and they're so easy to make. I rate it the best, but sometimes need an extra 30 minutes, so if on a schedule, give 3 hrs to be safe.\nShari\nFlorida"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tuneces01"
},
"reviewBody": "BEST DINNER IN A LONG TIME! OMG THESE RIBS ARE SO GOOD. I put the dry rub for ribs by Denise (found on this website) on my ribs for approximately 24 hours (I put them into a plastic bag.). Then I covered them tightly in Tin foil. I put them into the oven at 300 degrees for 2 hours. I let them cool for approximately 1 hour then put them on my green egg (at 400 degrees) for 3 minutes/side. I served them with warmed Sweet baby Ray’s barbecue sauce. I made Chef John’s macaroni salad and fresh kale salad. Not one rib or side dish was left I got “10’s” from all of my guests. So sweet !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Sheldon Parker"
},
"reviewBody": "Used Annie's BBQ sauce original and it was FANTASTIC"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "2 lbs baby back ribs, cut in 4 pieces, membrane removed. Dry rubbed &amp; added a tad of BBQ sauce. Sealed in foil. Refrigerate then baked at 275 for 2hrs. Cooled for 1hr then grilled, adding BBQ sauce for 5 minutes per side. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msendres86"
},
"reviewBody": "This is a no fail recipe. We use Cathy’s method of baking for 2 hours, letting them cool for an hour and finish on the grill!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RainbowJewels"
},
"reviewBody": "I normally prefer to do an overnight dry rub, but decided to give this method a chance. The ribs turned out better than I expected. I did not oven bake them however, as I was crunched for time. After marinating in the BBQ sauce I opened up the packets and cooked the ribs in the Instant Pot for 25 minutes. Then brushed with a bit more sauce and finished on the grill. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsFlinn"
},
"reviewBody": "There were some changes that i made since i only have a pound of it, but according to my hubby, it tastes so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Dillon"
},
"reviewBody": "awesome the only problem i had was rib bone stuck to tinfoil and as i tried to separate all the bones just fell out deboned with the tinfoil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimema"
},
"reviewBody": "So easy, and delicious. Used the rub recommended and they where the bomb. Tender and delicious. I didn't use the sauce until they finished cooking for 2 and 1/4 hours. Then added BBQ sauce and low broiled for a couple minutes. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff B"
},
"reviewBody": "We make these ribs at least once every 6 weeks and have been since we found this recipe several years ago. I have always wanted to make fall off the bone ribs and this recipe does it every time. I did read many of the other reviews and agree with a lot of the suggestions. We do remove the silver skin off of the back of the ribs as some suggest. It is easy to grab ahold of if you use paper towel. You definitely have to take these out after the 2.5 hrs, unwrap them, add more BBQ sauce to the top then broil them for 5-10 minutes or until the sauce starts to bubble and carmalize. Watch this step closely as to not completely burn the sauce. We also double line the pan with aluminum foil. As several reviews suggest the juices do tend to run out of the foil at times while cooking. Once you remove the meat from the foil packets it will also spill juices onto the pan. If you broil the ribs with the fresh BBQ sauce with the juice on the pan the juice will definitely burn and smoke up your oven. We unwrap the ribs and set them on a cutting board or platter. Once they are all unwrapped we peel up the first layer of aluminum foil on the pan and the fresh layer of foil is still sitting below it. We then put the ribs back on the pan and coat them with the sauce for broiling. Once they are done broiling you can move them to a platter and remove the dirty foil making cleanup of the pan VERY easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeBono's Bed & Breakfast"
},
"reviewBody": "Fall of the bone,very satisfied with the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bsbl"
},
"reviewBody": "Love super-easy recipes like this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin 911"
},
"reviewBody": "This Recipie was all that everyone said it would be. I hadn't made Baby Back Ribs in forever, and this was so very, very easy!\n\nI took the advice of others and when the ribs were finished, pulled them out of the foil, sauced them again and broiled them on high 2-3 minutes..... Yes! Fall off the bone goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Kalpich"
},
"reviewBody": "This is a great recipe! I made it as directed and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken's Kitchen"
},
"reviewBody": "Great Recipe...easy to prepare and tender delicious to boot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CherylB"
},
"reviewBody": "These are the best!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ryave2805"
},
"reviewBody": "Great ribs. We will definitely experiment with other flavours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Franks Favorites"
},
"reviewBody": "I made them the way the recipe called for and they came out great wouldn't change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Allen"
},
"reviewBody": "I have made these lots of times! This is the best and easiest recipe. I have them in oven now!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharice McLean"
},
"reviewBody": "I followed a previous review and did a dry rub instead of the bbq sauce. My dry rub consisted of brown sugar, cayenne pepper, natures seasoning, smoked paprika and chopped garlic. I marinated it overnight wrapped tight in foil then baked at 300 for 2 hrs and 40min. Removed the foil and brushed with bbq, turned the oven on broil and broiled the ribs for about 5min. These ribs were sooooo tender and flavorful! I used to boil ribs before placing them in the oven or grill, never again! This is my go to, so much easier and the ribs taste soooo much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Drennan"
},
"reviewBody": "Great recipe and ever so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Dillon"
},
"reviewBody": "I’ve never made ribs before and this turned out incredible! I did not marinate, I followed what Bentley did and they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pam"
},
"reviewBody": "These turned out really well. Haven't had a lot of success with ribs until this recipe. Tweaked it a little. Used the dry rub recipe found here. Then was unsure what to do, so I borrowed. Wrapped in foil, put on a rack, and baked at 225 for about 3.5 hrs. Then unwrapped and used convection roast feature in oven. Convection temp was 275 for the final hour. Then put BBQ sauce on and broiled until sauce carmelized. Monitored so they wouldn't turn to charcoal. Let them sit for about 10 minutes wrapped in foil. Turned out excellent. This is a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "I baked a slab in foil at 250 degrees for 4 hours. Used only dry rub during the bake. Slapped on some bbq sauce and finished them on the grill about 5 minutes per side. Excellent results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Karsten"
},
"reviewBody": "Follow this recipe to a T over and over again. Each time it works like a charm! So easy to have delicious ribs at home now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belinda"
},
"reviewBody": "Had I known it was this easy to make delicious baby back ribs, I would have done it a long time ago! I did put a dry rub on them before the BBQ sauce as others suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcs3"
},
"reviewBody": "I made this however I lowered the temperature to 250 for 2 1/2 hours here in the south we tend to cook Harmeet slower it was plenty are use Chinese barbecue sauce instead of regular barbecue sauce for kind of a Chinese flavor it was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahCatherineSmith"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Harvey"
},
"reviewBody": "Delicious! I made these using the rub and timing that Cathy M. recommended, and everyone LOVED these. I will definitely make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa38571"
},
"reviewBody": "everyone LOVED THESE!definitely a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHEESECAKEMAKER"
},
"reviewBody": "Absolutely perfect!\nI choose to use a dry rub for the baking process. I wrap each rack individually and base the baking time on the total weight, which is usually 2 to 3 hours.\n\nThere is no other way to make ribs, this is the best!\n\nThank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "5 stars for tender, falling off the bone spare ribs. I baked them in foil, with a dry rub on at 250 for 3 hours and 225 for another hour or 2. I then tried to pick them up w/ tongs to grill them for a bit to get them smoky.....they really were falling off the bone. I will only bake them for 3 hours next time at 250 degrees.....but they were unbelievably tender! And I did not peel the membrane off....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gregm17"
},
"reviewBody": "Aside from adding a little salt and pepper, I followed the recipe and it is fantastic! These were easily the best ribs I've ever made and the recipe is ridiculously easy. I'll never make them another way. My family absolutely loved them. When they were done, I went to flip the ribs over so I could cut them up and I was left holding a bone in each hand. Utterly delicious! I wholeheartedly recommend this recipe. You will not be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AwakeNbakeGirl"
},
"reviewBody": "Thank you to the cook who posted this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Buza McKay"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LLinda"
},
"reviewBody": "I used a little apple cider vinegar in the foil packets and followed one reviewer's suggestion to place the ribs under the broiler after putting on BBQ sauce to add flavor. These ribs were very good and I'd make them again, but nothing beats smoked ribs on a real smoker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sylvia Douglas"
},
"reviewBody": "Pretty darn good. Be sure to slather ribs with sauce before wrapping in aluminum foil. I wish I had added salt before cooking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana71"
},
"reviewBody": "This recipe truly had the meat falling off the bone! Baked at 300F for 2 hours 15 minutes, then opened the foil packets, slathered with more BBQ sauce, and broiled for 10 minutes. I reserved about 1/4 of the bottle for dipping when serving. Also, didn't have time to marinate overnight, so I marinated about 30minutes, and then put the straight into the oven -- still delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rudart"
},
"reviewBody": "Very good, very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hanny Manny"
},
"reviewBody": "These were fall of the bone tender! Instead of putting the sauce on in the beginning, I just seasoned with a dry rub before sealing up the foil. After the 2.5 hours, I uncovered the ribs and put on the BBQ sauce. I turned up the oven temp to 450 degrees and cooked the ribs with sauce for another 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Harris Buck"
},
"reviewBody": "so easy to make.. never had to change a thing.. the meat falls off the bone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karmen"
},
"reviewBody": "I love this way of cooking ribs, and I followed the advice of other commentators using a dry rub before cooking and then Adding sauce and broiling for a bit. To die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrosenau"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Adams"
},
"reviewBody": "Never made baby backs before this was the easiest recipe. I didn't have 8 hours for then to set only three and they were still full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Best ribs ever! Looking for a homemade sauce to go with it, instead of Bull's Eye, which is still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheridan Manfredi"
},
"reviewBody": "Excellent. I didn't even marinade prior to putting them in the oven! Made enough for 2 meals; first night didn't have time to broil with additional sauce, as some reviewers suggested... second night I did. They were both good but the additional broiling with sauce was definitely better. I will make these again... whole family loved them. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "Simply delicious!!! Couldn't have been easier. I actually made these while holding my two month old fussy baby. I did adopt a few of the recommended modifications found in other reviews. I removed the membrane and added a rub before the BBQ sauce, then did as the recipe instructed. Definitely making these again. My family loved it and licked their plates clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kip"
},
"reviewBody": "pretty perfect actually"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THE3CORDERS"
},
"reviewBody": "very surprised how good it was with so many comments for change"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neave Filan-Byrne"
},
"reviewBody": "no changes were made to this beautiful recipe i made this on friday 2nd september as part of the party food for my niece mackenzie's 2nd birthday the whole family loved it an instant favourite with my family an absolute pleasure and an absolute delight to have made and to have ate we will most definitely be making this again thank you so very much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Fortkamp Tyler"
},
"reviewBody": "The meat was tender and delicious. Easiest rib recipe ever."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16091/baby-back-ribs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
"name": "Pork Rib Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/997/meat-and-poultry/pork/ribs/baby-back-ribs/",
"name": "Baby Back Ribs"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16091/baby-back-ribs/",
"name": "Baby Back Ribs"
}
}
]
}
}
, "about": [
]
}
]