				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baby Blue Punch"
,"datePublished": "2020-06-18T23:10:42.000-04:00"
,"dateModified": "2022-08-22T14:33:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "CHIXROCK"
}
]
,"description": "I created this punch recipe when I went looking for a punch recipe for my Baby Shower. I really wanted blue punch because I was having a boy this time. The ice cream melts somewhat and turns the punch a beautiful baby blue color leaving frothy blue and white clouds floating on top. Everyone thought it tasted great and asked for the recipe. Its also very adaptable to your taste. The sky&#39;s the limit. Try any flavor or color of unsweetened drink mix in place of the blue."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gjolPxnHrXIwCwZzSUL6pv3m-lI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1513191-792ceadddeae4d3cb75c8f7de568e065.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4555846255001",
"description": "A perfect punch for parties, potlucks, and baby showers!",
"duration": "PT52S",
"name": "Baby Blue Punch",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/6ea2a664-dc62-4da6-b52c-667da4d1cb98/a114fa41-9bb6-46a7-9b12-cd3a406b0161/640x360/match/image.jpg",
"uploadDate": "2021-07-15T10:36:57.875-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baby Blue Punch"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "299"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "121 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "3 mg"
,"proteinContent": "0 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "18 mg"
,"sugarContent": "19 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (0.13 ounce) package blue, berry flavored unsweetened drink mix",
"1 (2 liter) bottle lemon-lime flavored carbonated beverage",
"1 (64 fluid ounce) bottle white cranberry juice",
"8 scoops vanilla ice cream",
"1 cup white sugar, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gjolPxnHrXIwCwZzSUL6pv3m-lI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1513191-792ceadddeae4d3cb75c8f7de568e065.jpg"
}
]
,"text": "In a large punch bowl, stir together the drink mix, lemon-lime soda, and white cranberry juice. Taste, and stir in sugar to your liking. (I like to add the whole cup.) Float scoops of ice cream on the top. The ice cream melts somewhat and turns the punch a beautiful baby blue color with frothy white clouds floating on the top."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bill Edge"
},
"reviewBody": "I added a toothpick dipped in food coloring gel a couple of times to get the blue I was looking for. Used rainbow sherbet instead of ice cream and the second batch was better than the first. The difference was I added the cranberry juice and sugar first and stirred, then the lemon lime soda. 2 gallons got gone quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Csorrell"
},
"reviewBody": "Everyone LOVED IT!!! I just used one huge thing of blue typhoon Hawaiian punch, one lemon lime soda and one white grape juice. I wanted my punch to look like clouds and IT DID! You don't have to use sherbet USE vanilla ice cream like it says folks, Trust me! I bought two of everything besides the ice cream. I kept adding everything to it as it was disappearing. I was skeptical with everyone saying they were using sherbet, no get the ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Perfect, not too sweet!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat McCallum"
},
"reviewBody": "I ould not find unsweetened drink mix. My sub. was too sweet for most of the guests. Fun drink and quite tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary hunt"
},
"reviewBody": "I used white grape juice and Blue Haiwiain Punch. Floated little boats. great Success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Lynn"
},
"reviewBody": "Made this for it’s a boy baby shower and it was a big hit. I used the blue Hawaiian Punch and added white cranberry juice and 7 Up. The vanilla ice cream was a great added touch. I floated blue rubber duckies but if it wasn’t for a baby shower or kids party I would omit the duckies. Everyone thought it wasn’t too sweet and a very refreshing drink. \nI refrigerated all of the ingredients so I eliminated using any ice. The frozen ice cream didn’t melt and make a gooey mess as some people experienced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Harvey Lane"
},
"reviewBody": "was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina Salmon Hickox"
},
"reviewBody": "I have made this a couple of times and love it! Everyone loves it. I now get asked to make it at least once a year :) The ice cream works really well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicola Lange Roepke"
},
"reviewBody": "I made this for a baby shower and I got rave reviews. I also got several requests for the recipe. I made it exactly as the recipe reads and added the recommended one cup of sugar. Fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marilyn Troyer"
},
"reviewBody": "I made this for a baby shower for a mom expecting a boy. The punch was just OK -- not one I would necessarily make again. I had to throw out over half of it -- for a shower with about 20 guests. I did use white pineapple sherbet based on the other reviewer's comments on the vanilla ice cream not working well. Also, be sure you use a clear or white juice if you want a blue punch. I used pineapple juice and thought it would be clear enough to still have blue punch. I was wrong -- the punch was a very definite green!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I don't know if it is because I was trying to make this in the fall or not, but I had a hard time finding blue drink mix. I finally managed to find the blue Hawaiian Punch. I did want to sub pineapple sherbet, but that was impossible to find in my area. I ended up with Blue Hawaiian Punch, 2L Sprite, white grape juice, and vanilla ice cream. It was a hit. Definitely add the Sprite after all the other ingredients if you want there to be some foam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I made this using for a baby shower using the suggestions...2-liter bottle of sprite, big container of blue Hawaiian Punch, half a container of white grape juice, scoops of pineapple sherbet. It was so tasty...but all of my guests were going for the wine, so I pulled out some marshmallow flavored vodka (that I had leftover from a hot chocolate bar) &amp; said 'you can spike it if you want'... then they started drinking it. So yummy, either way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "Turned out great! Couldn't find any unflavoured crystals and needed pink instead of blue punch. Did NOT add any sugar but added a few drops of raspberry lemonade concentrate instead of drink crystals and sugar. Just add a few drops and then sample to get the right concentration of flavour/sweetness. The ice cream worked well. Recommend only adding half the juice, half the pop and half the ice cream to start (my punch bowl wasn't big enough to hold all ingredients at once). Just kept topping it up as required during the baby shower until I had used all the juice and pop - don't forget to top the ice cream up too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah H"
},
"reviewBody": "This punch is great! Our grocery didn't have white cranberry juice so I had to substitute in white grape juice and we used koolaid blueberry lemonade in the unsweetened packet since that was the only blue powdered drink we could find. It came out so pretty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeni Carson"
},
"reviewBody": "I made this today for my new sister-in-laws baby shower. It was such a hit. I had to make one adjustment; only because the store did not have any white cranberry juice. They only had white cranberry peach. It was tasty as well. I was worried that since I don't drink soda, that the carbonation would not agree with me. However, it was so light that I had another cup full. Some was even taken home so others could try it. This is a good party drink."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "I made the easy punch and turned it pink with crystal light pink lemonade . Added white grape juice, Sprite and Truvia for the sugar and a few raspberries instead of the ice cream\n\nPeople said it was great and several asked for the recipient.\n\nSuper simple--I loved that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April Moore McPherson"
},
"reviewBody": "I can only give it 4 stars since I didn't follow the exact directions! I used gallon sized jug of blue hawaiian punch, 1/2 gal white grape juice and 2 liter of sprite instead. Used 1/4 gallon of vanilla ice cream. Floated the duckies in it....perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "klandrews84"
},
"reviewBody": "that was way too sweet. the kids wouldn't drink it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cupcake"
},
"reviewBody": "I made this recipe twice. Today was for a Disney Frozen theme party. I cut the sugar to a half cup and used white grape juice in place of cranberry juice. I also put blue sugar crystals on the scoops of floating ice cream for a glitter effect. Everyone loved it and I was asked for the recipe multiple times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Lynn Hall"
},
"reviewBody": "Literally every shower whether baby or bridal that I attend I am almost always asked to make this punch. Everyone just loves it. and it' s so great because you can make it just about any color you need. I have made it with blueberry, cherry, strawberry and grape kool-aid packets and no matter the flavor I use it is always great!! I use white grape juice instead of cranberry but other than that I do everything as instructed. I also make a fruit ring using sprite, pineapple and cherries to put in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LISA IN E TN"
},
"reviewBody": "Did not have an enjoyable (or even pleasant) flavor. The ice cream separating &amp; looking 'curdled' was off-putting. Will never make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chl2015"
},
"reviewBody": "I made this for my friend's shower and it was perfect. I couldn't find plain white cranberry juice, so I got white cranberry peach and it tasted good (only added 1/2 cup sugar). I think the blue drink mix might make a difference as well to the flavor. Everyone loved the way it looked! (If I get pics, I'll post.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Samida Schuler"
},
"reviewBody": "I used HP blue, sprite and French vanilla ice cream for a baby shower. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrie :)"
},
"reviewBody": "Couldn't find white cranberry juice, so I substituted white grape juice and only used as much sugar as needed to sweeten it. Everyone loved the punch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Kornely"
},
"reviewBody": "made for my daughter's baby shower. when over really well. i made a blueberry ice ring to float with the ice cream. watch how much sugar. i used a blueberry lemonade kool aid mix because i couldn't find just blueberry, and omitted sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Very good. Big hit at the baby shower. Did not add any sugar, didn't need it. Used Blue Raspberry Lemonade Koolaide. Was delicious. One person probably had like 8 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dree_marie"
},
"reviewBody": "I made this for a coworker's baby shower and it was a huge hit. However, I put all of the ingredients together and did a taste test before adding the cup of sugar. \n\nIt was delicious without the sugar, so I didn't add it. It's plenty sweet without. But the combination of the 'lemon-lime soda' (I used Sprite Zero) and the white grape juice with the blue flavoring packet (I used 2 Hawaiian Punch individual flavor packets - my local grocery didn't have any blue Kool-Aid) and ice cream was delicious.\n\nI'm glad the punch bowl was only big enough for a half batch -- I have plenty left over to make some at home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Hartmann Shimel"
},
"reviewBody": "Made this today for my grandson's baby shower, it was a huge hit! I could only find Hawaiin Punch Polar Express at the store, so I used Welch's Blue Raspberry drink instead. I also used white grape juice, ginger ale and pineapple sherbert. The ginger ale was good, but it turned the drink blue-green so I will use lemon-lime soda the next time. I stirred in the sherbert as I didn't like the lumps on top, and it helped the color be more blue but still left a nice foam on the top. Some guest mixed the punch equally with white wine, it was really great that way too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "renee kleinkauf"
},
"reviewBody": "I made this for my daughters baby shower today .... It was great !!!! Followed recipe to the tee.... Thanks ..... It was a big hit ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacy"
},
"reviewBody": "I only used half a cup of sugar. I got lots of compliments on it. People who said that they usually don't care for punch were talking about how good it was. We used Blue Bell Vanilla ice cream in it. I don't know how many scoops we used but it was about half of the 1/2 gallon container. Also, for the carbonated beverage, we used Sprite. \r\nIf I ever make punch again, I'll definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Finley Baker"
},
"reviewBody": "The first time I made this recipe for my baby shower, and it was A HIT! We made one punch bowl exactly as described, and then another ALCOHOLIC, with a half bottle of \"Three Olives Whipped Cream Vodka\". It was fantastic, just the right amount of \"dessert-ness\" with the ice cream and whipped cream vodka, but also went very well with the citrus from the juices. I have made this a few times since and it's always GONE."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Lynn Porter"
},
"reviewBody": "Made this for a fun drink for the kids on Memorial Day.\nThey loved it! Definetly a keeper thanks for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy83"
},
"reviewBody": "I love this recipe!! It was a big hit at my friends baby shower!I did changes up the ingredient a little bit.I used sprite, blue hawaiian punch, white grape juice and pineapple sherbert delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stevo"
},
"reviewBody": "First of all, I followed the recipe EXACTLY as it is written. The most important thing to me is that this tastes like your typical punch. No surprises there. Second most important, The ice cream works just fine. Many reviewers have reported problems here, but I just used plain Blue Bunny vanilla in the one gallon container and it worked without any issues. I floated two rubber duckies in it and my punch looked EXACTLY like the punch in the picture above. Looked very cute, tasted fine, giving 5 stars for a great punch recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "After reading several positive and a few negative reviews I made some amendments to the recipe. I used unsweetened raspberry lemonade mix (it's blue), left out the sugar, and substituted lemon sorbet for the ice-cream. It was a hit! I had to make 2 punch bowls full. To create the bubbles/foam I used a wire whisk and whisked until the sorbet melted. It created blue foam. The great part was there was no film that you get from ice cream in soda, and my non dairy guest could drink it. I usually am not a huge punch fan but I will most certainly make this recipe again. I forgot to take a picture until the bowl was half gone. So it looks more foamy to begin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SavyB"
},
"reviewBody": "This was super cute! I changed the recipe a bit because I made it for a baby girl. I used strawberry KoolAid &amp; White Cran-Strawberry juice. It was so yummy! It tasted like a creamy, strawberry, soda/milkshake. Every one loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jarah"
},
"reviewBody": "made this punch for a baby shower for a boy then made some changes and then made it again for a girl but instead used unsweetened raspberry mix and raspberry sherbert to make it a pink color and it worked just as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elly"
},
"reviewBody": "Wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RobinM"
},
"reviewBody": "This punch is awesome. I didn't change a thing. I even used the rubber ducky idea. I made this for my daughter's baby shower and it was a big hit! Just a note, the rubber duckies may not float well until the ice cream has melted down some. The thick froth made by the ice cream helps to hold them up. Make extra if you make this! I ran out because it was soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krdwechter"
},
"reviewBody": "I made this recipe for a friend's baby boy shower. I made the recipe without the ice cream as it was a work function and would have been too messy. I added ice to chill the punch down as well. The punch was very tasty and got raving reviews for the appearance. The rubber duckies really made the \"look\" complete. See attached photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "This was a hit as I knew it would be from the reviews. I used one gallon blue punch, 2L sprite and 1 bottle white grape juice. It would not all fit in the punch bowl at once so I used equal parts. Vanilla ice cream worked very well and The ducks were a bonus!!! Thank you for sharing this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SouthernSarah"
},
"reviewBody": "Im not a big fan of punch, but i had someone make this for my baby shower and it was amazing! love it and will find a way to use it for other occasions for sure! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoJo"
},
"reviewBody": "Great and fun recipe! I did modify things a bit because I couldn't find plain white cranberry juice, so I used white grape juice. Also, last minute I decided to halve the sugar amount to avoid adding too much so I only used about 1/2 a packet of powder mix &amp; 1/2 cup of sugar. It turned out great! I can see where people may not like the ice cream because it can look clumpy after sitting awhile (at least an our), but it didn't affect the taste one bit. My 2-year old loved the floating duck for his birthday! Can't wait to try different colors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Chatelain"
},
"reviewBody": "Perfect for the Nemo Babyshower I needed it for. It was delicious, people raved about it and it was perfect with a bath time nemo toy to set the scene."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Culinary Genius"
},
"reviewBody": "It was a hit!. If they could have licked the punch bowl they would have. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nurselele05"
},
"reviewBody": "This was a hit. I did the modifications as others did but the ratios were not very clear if you used hawaiian punch. So I used half of a container of the hawaiian punch, 1 2L of Sprite, and about 1/4 of a container of white grape juice. About 9-10 scoops of pineapple sherbert. They drank it dry. I ended up making another bowl of punch. I would refer to this in the future for other gathering using other punches etc. I have to say i dont like hawaiian punch, I would never just buy it to drink regularly ... but this was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoLeigh"
},
"reviewBody": "My sister and I used this recipe for our sister in laws baby shower. Everyone loved it! We used individual packets of blue hawain punch and there wasn't a drop left at the end of the shower."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary1993"
},
"reviewBody": "This was the best punch I have ever had, loved the combination of favors. We made it with \"Kool-Aid\" Ice Blue Raspberry Lemonade flavor and had raspberry vodka on the side for guests who wanted that little extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreatCook!"
},
"reviewBody": "SUCH a cute idea! I made a similar punch to this for a girl baby shower and it was fantastic but like your idea of adding icecream!\nI'm going to try this punch out at a boy baby shower this weekend! Complete w/ duckies and all! :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipei! It was delicious and it was such a cute idea, I had tons of compliments. I bought the rubber duck and rubber duck baby bath from my friends baby registry and served in that (cleaned of course) so both cute and a fun way to give a gift. Will use again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary P"
},
"reviewBody": "Made this for my second grandsons baby shower (made it for the first one to). Both times it came out great. VERY EASY...takes about 2 minutes (someone else said it was complicated...huh?) Anyway, I couldn't find Hawaiian punch blue so I got one of the gallon jugs of flavored water (the cheap stuff) it was a berry blue. Put in the ice cream (which makes it look very pretty) 1/2 of the blue stuff, 1/2 bottle 7-up and was going to add the white grape juice I bought and found out I left it in my daughters 'frig...AHHHHHH!!! Well, we tasted it with just the 3 ingredients and found out it tasted fine just that way. This is a VERY easy recipe...can't go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha7848"
},
"reviewBody": "I used this recipe for my sister's baby shower. I couldn't find the White Cranberry juice so I changed the recipe. \r\n\r\nI used:\r\na jug of Hawaiian Punch BerryBlue\r\na 2 liter of Sprite\r\nvanilla ice cream\r\n\r\nThis was very good and tasted excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Rickett"
},
"reviewBody": "This punch was awesome and a huge hit at my baby shower! I did however use blue Hawaiian punch instead of the blue berry-flavored unsweetened drink mix, and all I could find for the juice was white cranberry-peach. It was all gone and people started asking for more! *HIGHLY RECOMMEND*"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scam6742"
},
"reviewBody": "I made this for a friend's baby shower and it was a huge hit!!! we used blue kool aid and peach white cranberry juice because it was all i could find but it turned out amazing i would recommend this recipes for any party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cruzriz"
},
"reviewBody": "Love this punch! I made it last year for my daughters\nbeach theme bridal shower. I needed a purple punch for my nieces shower and just used red cranberry juice instead of the white. I used pineapple sherbert instead of icecream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TK"
},
"reviewBody": "Made this for my niece's baby shower. Loved it--so cute with the ducks floating in the punch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "collegechef08"
},
"reviewBody": "Wonderful punch, this was a big hit at my brother's graduation party (blue was the school color). I'd definitely recommend it. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Laudert"
},
"reviewBody": "I used this recipe for my fathers birthday party. Everyone seemed to like it, and it was very easy to make. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom22GreatKids"
},
"reviewBody": "I was looking for a punch recipe that was blue, for a baby boy shower, and this is what I found. Instead of using the kool aid, sugar, and cranberry juice, I substituted a gallon of the berry blue hawaiian punch (found in the juice aisle). So basically, I used the hawaiian punch, sprite, and vanilla ice cream. It came out totally cool looking and was a big hit at the shower. I got so many compliments on it. I think since it was blue, a lot of ladies took notice of it. You don't see many blue punches around. One lady noted it tasted like a \"bomb pomp\". I have no idea what that is, but I assume it is some type of ice cream bar you'd find on an ice cream truck. If you are looking for something for a baby shower for a boy, you should definitely use this recipe. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "krikorian"
},
"reviewBody": "I love the idea but it's more complicated than it has to be. I made it once according to the recipe the first time &amp; it was great but I was in a rush the second time so I used blue Hawaiian punch added a 2 liter of Sprite &amp; one quart of pineapple sherbet. It was just as good &amp; much faster. To make sure it looks like bath water pour hawaiian punch first, sherbet second &amp; Sprite last."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie H."
},
"reviewBody": "Loved the taste of this punch, and several shower-goers shared similar sentiments. Looks very pretty at first, but once the ice cream melts it's kind of frothy and weird (but still tastes good!), so make sure everyone gets their punch as soon as you make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeniley34"
},
"reviewBody": "This punch was excellent for a baby shower. I added no sugar, it was plenty sweet from the juice and pop. Also I omitted the ice cream as suggested by other reviews. It was well recieved at the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SARAHREBEL"
},
"reviewBody": "I followed the recipe exactly, except only used 1/2 cup of sugar, and it turned out perfectly! Huge hit at the shower - pretty and tasted great, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denisse2090"
},
"reviewBody": "I used this for my cousin's \"Duckie\" Baby Shower and it was a hit!! I simply used Hawaiian Punch, Ginger Ale and Vanilla Ice Cream. Then we topped it with little floating duckies! Very cute! We totally ran out!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "candibridges"
},
"reviewBody": "the idea was wonderful.. i changed it up and took some advice from some other reviews and used the blue hawaiian punch with white grape juice and sprite. was yummie and looked so cute for the baby shower!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "Made this today for a friends baby boy shower. Was super easy to make, took about 3 mins to put together. Ducks looked super cute and everyone thought it was adorable. I used 9 scoops of ice cream and then gave it a quick stir to help it start to melt on top and look all foamy. Also I used white grape juice as I couldn't find white Cranberry juice. Worked and tasted great! Will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenski"
},
"reviewBody": "Used blue hawaian punch with grape juice and sprite and it tasted wonderful. everyone loved this and the ice cream and ducks made it perfect for a baby shower. thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "Made this for a baby shower today and it was fabulous EXACTLY as directed. I used a packet of blue Kool-Aid (blue raspberry-lemonade) and otherwise followed the directions. The sugar is needed- its WAY too tart without it. I had to make two punchbowls full- everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "acooper"
},
"reviewBody": "I made this for my friends shower, and it turned out SO cute!!! Everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mardee Midkiff Steuber"
},
"reviewBody": "This punch was a hit at my sister's shower! Everyone asked me for the recipe! Perfect for a boy baby shower!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Wald"
},
"reviewBody": "awsome flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beckg84"
},
"reviewBody": "I made this for a baby shower over the weekend. It was a duck theme. I used a previous reviewer's advice and used the blue Hawaiian punch, Sprite, and white grape juice. Instead of ice cream I used Pineapple sherbet. Put rubber ducks in it and viola. It was a HIT at the shower. That's the only thing the guests wanted to drink! Thanks for the recipe. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kurleetop1"
},
"reviewBody": "I used white grape juice by accident but it still turned out really good. Everyone thought it tasted great and it looked really cute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashleyann"
},
"reviewBody": "The color of this blue punch is perfect for baby boy showers but very easy to use any color of Kool-Aid to change the color and flavor. The flavor is good and the ice cream makes it creamy and sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drea Drea "
},
"reviewBody": "Made this for a baby shower and it was delicious. The mom to be loved it and really enjoyed the icecream in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ItFigures"
},
"reviewBody": "Make for a Hawaiian party, so it represented the ocean with white caps. Had to substitute Hawaiian blue punch for the berry blue packet. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "Looked so cute on the table. Everyone enjoyed it. The bowl was empty at the end of the shower. Would serve again if giving a baby shower."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missy"
},
"reviewBody": "I made this for a boy baby shower and it was very cute and very tasty! The only complaint is that the vanilla icecream makes a greasy film around the edge of the bowl that looks a little yucky. Otherwise, this tastes great and is a very cute idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JohnnyCakes"
},
"reviewBody": "For those that said the ice cream separated and made it look gross -- use only good ice cream. Cheap ice cream/low fat ice cream has less cream. I've made this as is, 5 stars. I've also made this using hawaiin blue punch and sprite when I couldn't find blue koolaid. Very good both ways!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Romper"
},
"reviewBody": "TASTY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lhorvat2"
},
"reviewBody": "A great tasting punch, easy to make and a real eye-catcher. I even added the rubber duckies, just like the photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tamdesire"
},
"reviewBody": "It was easy to make and fun. Everyone loved it at the baby shower. Big hit. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EDever"
},
"reviewBody": "This was so easy and good! I will definately use it again. And I'm sure you can just use different colors of kool-aid to change the color of the punch! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlyn Pryce"
},
"reviewBody": "I made this for a festival this past summer, and it was an absolute hit!!! Although some were initally worried ice cream in punch, the people kept coming. Despite the several tables filled with sodas, waters, and other drinks, our punch table was the spot.The performers drank the entire first batch, and the second was gone within 45 minutes. Thank you so much for this fantastic recip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "Love this recipe. I threw my sister a Rubber Duckie themed baby shower and everyone loved this idea. Not only is it creative, but it really taste good. I did have to double the ingredients (thank god I buy two of everything, just in case), only because my punch bowl was big. Try it, you're ganna love it. Oh, and it's super easy to make. Pour...Mix...and Dollop!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTindal"
},
"reviewBody": "This punch was quite a hit at a baby shower I held!! I did use white grape juice instead of cranberry only because I couldn't find cranberry. It was still fabulous!! The rubber ducky floating in it really made it super cute! Thanks for such a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curlyz28"
},
"reviewBody": "This turned out excellent! I made it for my Baby Shower and had no leftovers. So many people commented on how unique it was -- cute and tasty! THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used this idea of blue punch for my son's 1st birthday which was Airplane/Clouds theme. With the blue coloring and the white ice cream clouds it was perfect to emulate clouds for the party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I used this idea of blue punch for my son's 1st birthday which was Airplane/Clouds theme. With the blue coloring and the white ice cream clouds it was perfect to emulate clouds for the party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma"
},
"reviewBody": "I used the Blue Hawaii mix instead of the blueberry, and did not use the icecream, Had a shower for 20and the punch was all gone, I also put a little blue duck in mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Brunette"
},
"reviewBody": "I had made this punch for a baby shower and it went over great. I plan on making this punch but changing the kool aid and the ice cream for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryn Courtney Whitehurst"
},
"reviewBody": "Used this for a superbowl party (the colts colors) It was a hit. I ran out and it was not the only thing to drink."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheryl"
},
"reviewBody": "This punch got alot of attention at the baby shower i was hosting. I followed the recipe eactly, doubling everything to accomodate my large punch bowl. It not only looks fantastic( i floated two rubber duckies in the punch) but tastes great too. You should be aware however that the punch does leave your guests with slightly blue mouths. My guests didnt mind but i suppose some people may not appreciate that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "This punch is perfect when it comes to presentation. I am giving a four instead of a five because I altered the recipe according to other reviews; I used Typhoon Blue Hawaiian Punch and white grape juice instead of Kool-Aid and cranberry juice. I just eyeballed it as I poured the three drinks into the punch bowl. I liked the way the ice cream and ducks looked on top, but I wasn't crazy about drinking the melted ice cream (the punch itself tasted very good, though). I might try it with the sherbet some time, but it was great for our baby shower. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This punch was a success at the baby shower! I got a lot of compliments! tasted great, and was cute with the ducks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nomstas"
},
"reviewBody": "This IS GREAT!!! The blue colour is totally cute! I used blue raspberry juice mix, but it was still GREAT! I will DEFINITELY make again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodeliciousCraig'sWife"
},
"reviewBody": "My BFF made this for my baby shower. It was very yummy and sooooooooooo cute (especially with the duckies floating on top)!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meadow Brady"
},
"reviewBody": "I used this for a sweet 16 part. It was blue water with ice cream iceburgs. Perfect for the winter wonderland party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annasutton"
},
"reviewBody": "I made this punch for a baby shower. It went over really well. Everyone loved the rubber ducks! I used blue Hawaiian Punch as well instead of the blue drink mix and I used white grape juice instead of the white cranberry juice. The sugar is not needed when using an already sweetened drink such as Hawaiian Punch. I did not have any problems with the ice cream separating or looking gross. As it melted, it melted into the punch turning it a nice baby blue shade and giving the punch a little creamy flavor. Overall an excellent baby shower punch!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/70551/baby-blue-punch/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/77/drinks/",
"name": "Drinks Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/137/drinks/shakes-and-floats/",
"name": "Shakes and Floats Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/70551/baby-blue-punch/",
"name": "Baby Blue Punch"
}
}
]
}
}
, "about": [
]
}
]