				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bacon Wrapped Stuffed Mushrooms"
,"datePublished": "2020-04-08T02:33:54.000-04:00"
,"dateModified": "2022-09-03T19:31:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jaida"
,"url": "https://www.allrecipes.com/cook/701927"
}
]
,"description": "A classic favorite stuffed mushroom is taken to new heights by wrapping in a slice of bacon. Simple, but will melt in your mouth!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Jd_Z4DX6WpN1_WoHdchePT77c0s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4470118-bacon-wrapped-stuffed-mushrooms-SunnyDaysNora-4x3-1-8b91327c090a49a2b8b0e301d70aa8e8.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bacon Wrapped Stuffed Mushrooms"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "132"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "123 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "33 mg"
,"fiberContent": "0 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "240 mg"
,"sugarContent": "0 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.5 cup chopped green onions",
"2 (8 ounce) packages cream cheese, softened",
"20 fresh mushrooms, stems removed",
"1 pound sliced bacon, cut in half" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, mix together the green onions and cream cheese . Stuff mushroom caps with the cheese mixture. Wrap each mushroom with a half-slice of bacon, and secure with toothpicks. Place on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake for 20 minutes in the preheated oven, until the bacon is cooked through."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Snee"
},
"reviewBody": "These were awesome. Definitely wanna cook the bacon halfway before wrapping the shrooms. I used 8oz of cream cheese, a cup of shredded Mexican cheese, 3 green onions, and some garlic powder. I needed 2 pounds of bacon because I used two big containers of shrooms. So I’d double the shrooms count and bacon to account for all of the stuffing. Thin and long bacon works the best. Boom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck Batherson"
},
"reviewBody": "The cheese mix makes more than necessary. We also substituted the green onion with a homemade pesto using the same amount. It was very good also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hwlwn3113"
},
"reviewBody": "Great recipe! The only changes I made were substituting chives for the green onions- I have an abundance in my garden right now. Simple, easy and adaptable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C L (CrystallikeIce)"
},
"reviewBody": "Tasted delicous. Combined this recipe with another that adds onion powder, stems minced , and a tsp or so of cayenne into the cream cheese mixture. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Rinner"
},
"reviewBody": "Absolutely Fabulous! Every time I make this there never is anything left!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "Definitely a party pleaser!! It's simple , but very flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "So delicious and super easy to make! I did keep them in the oven a little longer than called for to crisp up the bacon to our liking. These were a huge hit...a keeper~YUM!!!! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leon McCreary"
},
"reviewBody": "Took these little jewels to a bacon-themed party and they were a huge hit!\nThe combination of the creme cheese and bacon is wonderful, and the mushroom &amp; chive add a very nice taste accent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Loved this recipe! I. Chopped the cleaned stems, saluted them and added to the cream chees/onion mixture . They took longer than the recommended time, maybe 40 minuted. I wanted the bacon to be crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Muffingirl"
},
"reviewBody": "The taste was wonderful but don't cut the bacon in halve and then precook it. It will shrink and won't fit around a large mushroom. I would do what another cook did, by cooking bacon then crumble it and add to filling. I just put the bacon on top and secured it with toothpicks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bill Nickoloff"
},
"reviewBody": "I added a touch of garlic powder and salt to the cream cheese mix. I was tempted to add breadcrumbs as someone else had mentioned, but I remembered my favorite Italian restaurant and they do not use the bread in the mix. Instead they serve toasted garlic planks and evoo with herbs for dipping along side the shrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "Very good and will definitely make again. I did add a little salt, garlic powder, black pepper, and a dash of cayenne to the filling. I increased the cook time substantially to get fully cooked bacon- I left them in the oven about 40 minutes. Also, I had a significant amount of extra filling using average-sized button mushrooms, I would probably only make 1/3 to 1/2 of the filling that the recipe called for again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherry"
},
"reviewBody": "Yummy! Made these for superbowl and they didnt last long. After reading reviews i added some garlic powder and a little chedder. I made 15 mushrooms and used 4 oz cream cheese, thats what i had on hand. I had a bit of filling left over. Just saying 2 packages of cream cheese for 20 mushrooms is way too much. Amazing will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisas"
},
"reviewBody": "Very good. Make as the recipe states except only used one package cream cheese. I thought the cream cheese mixture would need something more, but it didn't. These were very good and ended up eating them all for dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Valdez"
},
"reviewBody": "These are AMAZING! Our church community group had bacon night and I searched everywhere for a bacon recipe. This blew them outta the water! :) Fantastic recipe. The only change we made - was that we left out the chopped onions and I highly recommend slightly cooking the bacon before wrapping mushrooms. If you don't, the bacon is too soft and it tastes better with a little crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marc Tessier"
},
"reviewBody": "Easy to do and fun to eat, we all loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gborer"
},
"reviewBody": "My guest like this appetizer. It was easy to make but required longer cook time than stated to crisp up bacon. I would use this appetizer again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladennison"
},
"reviewBody": "These are to die for! I didn't want to wrap them in bacon so I diced the bacon, cooked it and then let it rest on paper towel. Once it was room temp, I mixed it in with the cream cheese filling. Also, topped each one off with some crumbled bacon too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth Mower Dodge"
},
"reviewBody": "I rate this as only ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna Reader"
},
"reviewBody": "Great recipe, really yummy! Only made up 1/2 filling for the 20 mushrooms. It was the right amount of filling. Will definately make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "msxkitty"
},
"reviewBody": "I read other people's reviews and took their advice to only use 1 package of cream cheese. One was plenty! I used 2-16oz containers of white mushrooms and this was more than enough filling. I had to cut my bacon up a little bit to make up enough pieces for all the mushrooms. But it worked. And I bought some garlic and cheese croutons, smashed them up a little bit, and added that to the cream cheese mixture for more flavor. Easy to make app. Would definitely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Javachix"
},
"reviewBody": "They were fine. The bacon never got really crisp and the filling was kind of messy. I think the smaller the mushrooms, the better because its hard to eat these in more than 1 bite. I was thinking that next time to cook the bacon separately, chop it up and sprinkle it on top. Good enough recipe, but didn't make it into my \" Keep\" folder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MoonShadow"
},
"reviewBody": "We made this tonight as a side dish rather then an appetizer, but we made some adjustments...And note changes for next time.\n\nWe used one tub of sour cream and chive cream cheese with the green onions and garlic powder, we used roughly eight big crimini's and we used about half a pound of bacon as it was just me and my mother. The bacon we had trouble wrapping around and in some we just stuffed the bacon into the top. Next time we'll make sure when we clean the mushrooms to pat them dry and not wash them, they took on a LOT of moisture and released a lot of it, but it was delicious. We will make it again but make some adjustments, great starter recipe for a newbie to mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jim W"
},
"reviewBody": "I actually liked this recipe but only gave it 3 stars because I couldn't get the bacon to cook through (especially on the bottom). Any suggestions on how to do that?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smarsten"
},
"reviewBody": "Both the husband and I really enjoyed these. He's never been a fan of stuffed mushrooms but had no problem helping me eat the whole batch. Next time we make these I will follow some of the other reviewers advise to kick them up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweetchef"
},
"reviewBody": "I made this appetizer for valentines day and my lady and mother in law and I loved them. Extremely easy and fast. The only things is that the amount of cream cheese on the recipe can be quite too much for the amount of mushrooms. I even wrapped part of the creme cheese with bacon alone and was just as great. Thank you for this recipe, will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandrew834"
},
"reviewBody": "This is a great recipe that I use all the time but, the mushrooms are always best if you marinate them in some sort of marinade. I prefer to use Italian salad dressing. Let them soak in this for at least 4 hours before cooking. These can also be cooked on the BBQ grill. I also always use 1/2 strip of bacon per mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crazy4NY"
},
"reviewBody": "Excellent! Brought them to a book club discussion and everyone raved about them. Easy, fast and delicious.:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lola Manzenko"
},
"reviewBody": "Excellent! Quick and easy preparation. Delicious! It was even better cold next day.\nPS I substituted white mushrooms with mini portobello mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Chakravarty"
},
"reviewBody": "I really liked thesee! Definitely a keeper!!! Great with the bacon! I made them on the grill and served them with fresh baguette. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TyrisFlare"
},
"reviewBody": "I like all these ingredients, but for some reason I don't like them all together. Can't get over the pancake smell either when I bring one to my face to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen71"
},
"reviewBody": "Easy and delicious,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TracyJo"
},
"reviewBody": "A good base but I modified this version, added garlic powder and a little cayenne to the cheese. Also, I simmer my caps in white wine for a minute too. Pre cooked bacon so it got crispy in the oven. Elevate them on a rack for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pickyeaters"
},
"reviewBody": "I love this. Sometimes that's all we eat for dinner. It has a strong flavor so not everyone would want to eat enough for a dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Audi"
},
"reviewBody": "I made these last night. I had thick bacon and it did not stay wrapped. Regardless they were yummy. And-I reheated a few leftovers today and I must say found them even more delectable when I nuked 'em in my microwave. \nDid I mention they are easy? *g* \nThanks for sharing this \"Keeper\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TGILLS2"
},
"reviewBody": "these weres simple but VERY good. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lissa Wicked"
},
"reviewBody": "YUMMERS! I used less cream cheese and added chopped garlic and pine nuts, though roasted garlic would be better I think. My husband said I need to add these to the regular rotation! I like GUYCHEF's tip about baking on a rack to keep away from bacon grease. DO give these a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wvlady"
},
"reviewBody": "I review very few recipes but this is one of them. These mushrooms are now a family favorite. Even my 14 year old son loves them and he does not like to eat new things. Give a hint to all that think the filling is too much, clean the mushrooms of the inside membranes of the mushrooms. The membranes can make the mushrooms soggy when they are being baked. I also cook the bacon brown but still pliable before I place the mushrooms in the oven. If you place the mushrooms in a cold oven and let everything warm up at the same time, the shrooms cook more evenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mona"
},
"reviewBody": "I made this for dinner Saturday night and my son loved it. I thought I would have leftovers for Sunday and I was wrong. This was really really good. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "perplexor"
},
"reviewBody": "ZOMG! This was amazing! I only made half the recipe as a tester and really only needed about half an 8oz package of cream cheese. 2 packages for 20 is too much. I'd actually add a little bit of ground pepper to fill out the rest of the flavor, but it was soo good! An amazing and inexpensive appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ange82"
},
"reviewBody": "made this as a snack for an outdoor play. everyone loved them, and why wouldnt they? easy to make and absolutely delicious. i did follow previous review and microwaved a minute or so before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktuckermk"
},
"reviewBody": "These are awesome! I make them without the green onions and they are just as good. I also cook the bacon a little in the microwave before cooking. I prefer some of the grease to be on paper towels than on my mushrooms:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apainter0703"
},
"reviewBody": "COMPLETELY delicious in every way. The cream cheese and fresh green onions really complement the texture of the mushroom. The salty flavor of the bacon adds an interesting and exciting taste also! A++++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Athenachandra"
},
"reviewBody": "These apps were a hit and disappeared within minutes if serving them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrMojo"
},
"reviewBody": "Awesome recipe! Huge hit at our party-will need to make more next time cuz they went fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScienceTeacher"
},
"reviewBody": "I made these for a party last night, they were fantastic! I substituted two tubs of the soft cream cheese with chives and added a cup of shredded cheddar cheese. I would also recommend pre-cooking the bacon a little. I can't wait to make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Lynn"
},
"reviewBody": "very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apaige232"
},
"reviewBody": "These were very good. I like to stuff jalapenos and wrap them with bacon so I think next time I entertain, I will make both and the plate will be pretty and it will offer a variety!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsea"
},
"reviewBody": "Excellent!!!!! My son made these for dinner tonight and they were amazing. Salty and easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lluvbear"
},
"reviewBody": "I added the stems, finely diced, bread crumbs, a little basil pesto, crushed garlic clove, parmesan cheese, grated sharp cheese--til the mixture held together and wasn't too soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAIBEY"
},
"reviewBody": "This was a great recipe and perfect for what I needed. I had leftover stuffing from making wontons, so I took this idea and ran with it. My stuffing also utilized the mushroom stems a finely chopped jalepeno and finely chopped green onions, with a dash of soy sauce. Yum! Everyone LOVED them. I will bring them to all the parties I attend now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missyfulks"
},
"reviewBody": "These were great the first time I tried the recipe. However, each time I make these, I make some changes. I found that one 8 oz, pkg of cream cheese will stuff 6 cartons of mushrooms if you do the following. Cut up one bundle of green onions like chives and add to cream cheese. Chop up half the mushroom stems (3 cartons worth) and add to cream cheese. Finely chop 4 de-seeded and de-veined fresh jalapeno peppers and add to cream cheese. Add garlic powder, onion powder and black pepper to cream cheese to taste. I also used the thin bacon and found that while wrapping around the mushroom, overlay the bacon slightly over cream cheese to keep cream cheese in the mushroom. This has been a great hit for party gatherings. Thanks!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gayle"
},
"reviewBody": "I have made stuffed mushrooms simular to these for years. It is always a request that I bring them as an appetizer when we have a family dinner. I always use the small button mushrooms here is what I do differently. I cook the bacon,drain and crumble it. I use the small tub of soft cream cheese with chive and onion to which I add the crumbled bacon. Season with a little salt and pepper. Stuff the mushroom then bake them in the oven for about 20 minutes. It's a real challenge not to eat all of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Kris"
},
"reviewBody": "I thought these were delicious. It's not a complex flavor but they were good enough for me to not be able to stop eating them even though I was full!\nWe only needed 1/4 strip of bacon per mushroom and mixed colby-jack cheese in with the cream cheese instead of onions. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "These are the best stuffed mushrooms ever! I've been making them for a couple of years, and everyone asks for the recipe. Any kind of onion works, but I prefer vidalia. The trick w/ this recipe is to crunch up the bacon. I usually bake them at around 400 for 20-30 min. (depends on how big the mushrooms are), then pour out the juices/grease and finally put them under the brioler for a few minutes. You can even cook/drain them ahead of time and just rehaet and broil~~they are awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chicken"
},
"reviewBody": "These were a hit at a recent potluck. But I had to lightly fry the bacon first as they bacon would not have been cooked in the time suggested and I wanted to speed things up a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Otana"
},
"reviewBody": "I actually used goat cheese in these and they were absolutely delicious. I will definitely be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Weber Stout"
},
"reviewBody": "Served these at a party and they were the first to go! I did add some of the dry Knorr Vegetable Soup Mix to the cream cheese to add some flavor. I also pre-cooked the bacon for 1 minute in the microwave and still had to at least double the cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Caseri"
},
"reviewBody": "These are the best Ive had. I make these several times a year for mine and my husbands romantic dinner dates. He cant get enough of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "italiagurl112"
},
"reviewBody": "love love love these !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Lee C"
},
"reviewBody": "This recipe was the biggest hit at the Super Bowl party I went to this year! Everyone was amazed by how great something so simple to make tasted. Two suggestions/observations...\n1) I had doubled the whole recipe because the number of people at the party was extensive. I found that, even with putting a generous amount of filling in each mushroom, I had at LEAST half of the cheese mixture leftover. I would say, cut the filling amount by half, or make the one batch recipe for the cheese and then double your mushrooms and bacon.\n2) I used the thick cut bacon, which turned out really well because there it was easy to roll and you had a substantial amount of meat per piece. However, this increased the cooking time from 20 minutes to about an hour.\nExcellent recipe though! I will make it again and again!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesley637"
},
"reviewBody": "YUM! I only used half the recipe for the filling, as I only had 10 large mushrooms to fill. I made sure to scoop out plenty in the center and used all the filling, but they were pretty messy to eat. But DE-LISH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMCERRA"
},
"reviewBody": "I get raves every time I make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPUNKYSIMONE"
},
"reviewBody": "I've been making some changes and I have received rave reviews when I added minced garlic and shredded cheddar cheese into the cream cheese mixture. \n*Update For over a year now I HAVE to make these for every get together. They are everyones favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Brock Fuller"
},
"reviewBody": "My friend and I ADORED this recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AJ Stewart"
},
"reviewBody": "A stuffed mushroom isn't stuffed in my opinion unless bread-crumbs are included in the mix, but a friend made this and it tasted alright.\nAs a suggested, cross-hatch the bottom of the mushroom with a knife, and brush with garlic butter.\nA little seasoning in the mix, especially salt and perhaps a crumbled vegetable stock cube really help the flavour!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momof2"
},
"reviewBody": "I love this recipe, but could not give it 5 stars because of the changes I made for the second batch. I added some imitation crab meat and some garlic powder to the cream cheese mixture. I also precooked the bacon about 1/2 way before wrapping the mushroom. We liked it much better with our modifications. Thanks for the post."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelsey Wolnowski"
},
"reviewBody": "I never thought to wrap a stuffed mushroom in baccon, but it TOTALLY works! So tasty. Very much liked it! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I don't even want to think about how many of these I ate last night... I think they would be absolutely delicious with some mild-ish blue cheese. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baking Britt"
},
"reviewBody": "These were good, but the stuffing was a little plain. These would be amazing if you used the mushroom filling used in the recipe \"Mouth Watering Stuffed Mushrooms\" found on this website! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rose Martin Meirs"
},
"reviewBody": "This was ok but not the greatest. I had some seasonings for dip that I mixed with the cream cheese. The bacon made the food pretty greasy. The taste was appetizing but the grease was'nt..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kismetmine"
},
"reviewBody": "This was great! I did not have any green onions so I just used sweet onions and added a bit of garlic powder and freshly ground pepper. It was very nice. My husband and Mother-in-Law loved them. \nI had some cream cheese mixture left over so I added some minced olives and shredded cheese to it and we ate it on crackers. Mmm. \nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NYPD K9 COP"
},
"reviewBody": "i wasn't a fan, but other people I served the to were. Just thought they were a little too plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "whatarat"
},
"reviewBody": "I think these were a little bland. They could use a little season added to the cream cheese mixture as well as a little shredded cheese and that might help with the blandness, I also noticed that they were greasy, and not something that I could serve to guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "Very messy but tasty. Also, they stay very hot for quite a while. A few tongues were burned when I served them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TNociti"
},
"reviewBody": "Pretty tasty with garlic and jack cheese additions. I found these a real pain to put together, though. Definitely not the 10 minutes suggested in the prep time. I also cooked the bacon slightly before wrapping the shrooms and found that they still needed approximately 30 minutes in the oven before the bacon crisped up. I'll keep playing with this one to suit my needs. Thanks for a solid start. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "savory bites"
},
"reviewBody": "It was ok...I think the bacon should be cooked a bit before the wrapping starts otherwise its practically raw after the 20 minutes of cook time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good mushrooms, not great. I broiled mushrooms for last 3 minutes to get the bacon krispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VORCHA"
},
"reviewBody": "Betcha you can't eat just one! I had to make a triple batch of these for a grilling party I had this weekend. I did make a few changes: only used one package of cream cheese and then mixed in 2 cups shredded sharp cheddard cheese, mixed in minced garlic, and used whole slices of bacon that I precooked to the soft stage to make sure the bacon was crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAYLA207"
},
"reviewBody": "Yummy! I used sweet onion chopped up instead of the green just because that's what I had and I also added about 1/4 cup of shredded Italian blend cheese to the cream cheese stuffing, and I used low fat cream cheese and turkey bacon. My whole family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARLYNSMOMMY"
},
"reviewBody": "I made these for a get together last night and everybody raved about them! I took advice from other reviewers, added garlic powder to the mixture, and wrapped mushrooms with a whole piece of bacon instead of just half. I don't like mushrooms, but I loved these! This ones a keeper! Thanks Jaida!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle"
},
"reviewBody": "Wow! Bacon is a great addition to an old standby recipe! A little fussy to assemble, but not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chels and JJ"
},
"reviewBody": "Everybody loved this yummy treat. Try also, stuffing w/ bits of sweet italian sausage, pecans, and corn bread crumbs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these for my grandmother's 80th birthday party and everyone absolutely loved them. Instead of mostly cream cheese as the filling, I \"doctored\" it and added parmesan cheese, chopped garlic and some italian flavored breadcrumbs to the mixture. I also used chives instead of green onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDVMD"
},
"reviewBody": "Outstanding recipe not only for its taste but for its ease in preparation. I filled my large mushroom caps with Aloette (herb cheese) as a timesaver plus I really like Aloette and have stuffed mushrooms with it before. Also, used maple flavored thick sliced bacon. It was a perfect marriage of flavors. My husband loved them and said this was something to be served at our next party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATLIST"
},
"reviewBody": "These were wonderful. I mixed in garlic powder and parmesan cheese into the cream cheese. They need to be baked on a rack so they don't swim in grease. Also, 20 minutes is not long enough for the bacon to be done all the way through and even slightly crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VALENZANO"
},
"reviewBody": "THESE WERE A BIG HIT, at a recent party we attended. I had to cook them longer than 20 minutes, the bacon must be crisp or they are not good. I also raised the temp to 375 degrees. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Felton Nash"
},
"reviewBody": "These are delicious, and so simple to make! I actually took them to a breakfast carry-in this morning, and they were a big hit. I used the large \"stuffing\" mushrooms, though - and next time I would use the smaller button mushrooms instead so that they would be more bite-sized."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is yummy. I usually use the cream cheese with 1/3 less fat but I used fat free one time while making these and they weren't quite as good. My husband still gobbled them down but I'll use regular or 1/3 less fat cream cheese from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KZKD7N"
},
"reviewBody": "DELICIOUS AND EASY TO MAKE. I DID CHOP THE MUSHROOM STEMS AND ADD TO CREAM CHEESE."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i had tried a recipe similar to this but not stuffed...the cream cheese makes it sooo much better...try this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Nelson Moore"
},
"reviewBody": "I have made this recipe 3 times and it has been a huge hit every time. I absolutely love them. My dad declared that they needed more bacon and therefore, he used a whole strip of bacon for each mushroom when he made them. I think they are perfect as is and have made no changes to the recipe. They are extremely easy to make. The only suggestion I have is to use a broiler pan so the grease from the bacon drips down. The first time I made these mushrooms, they were swimming in bacon grease, but they were still very tasty. Highly recommended!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wilemon"
},
"reviewBody": "We really enjoyed these! I did add a little garlic powder to the cream cheese and sprinkled them with Parmesan before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I read this recipe this morning and couldn't stop thinking about it-- I told a co-worker about it and we both made it this evening and were MORE than impressed! The flavor of the onions really comes out in the cooking and very much downplays the mushroom taste. I was even able to convince my anti-mushroom husband to try them and he liked them! I highly recommend them and will make them for Christmas eve dinner tomorrow night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an excellent recipe - I've made these before (the cream cheese filling part, at least), but had never wrapped them in bacon. I used center cut bacon and they were exceptionally tasty! Also, I added 2 Tablespoons of garlic powder to the cream cheese/onion mixture and they were flying off the platter! Highly recommended and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Excellent recipe. I recently made it for a neighborhood get together and everyone raved about it. Those on the Atkins diet really liked it since all of the ingredients were on the allowed foods list. I know I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEREDITH GILL"
},
"reviewBody": "I made this recipe with no additions or subtractions and it was excellent. I am not \r\nfond of mushrooms whole but I ate several the first time i made them and because the recipe \r\nwas so good I made them a second time 2 days later and will continue to make this recipe \r\non special occasions and for the family at least once per week.\r\nThanks for the recipe"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/54795/bacon-wrapped-stuffed-mushrooms/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
"name": "Mushrooms"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
"name": "Stuffed Mushroom Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/54795/bacon-wrapped-stuffed-mushrooms/",
"name": "Bacon Wrapped Stuffed Mushrooms"
}
}
]
}
}
, "about": [
]
}
]