				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bacon Popcorn"
,"datePublished": "2017-05-06T09:00:45.000-04:00"
,"dateModified": "2022-06-27T10:28:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jeannine Ross"
,"url": "https://www.allrecipes.com/cook/2578464"
}
]
,"description": "Popcorn kernels are popped in bacon grease and tossed with seasoned salt in this super savory popcorn recipe. Add bacon bits and shredded cheese if you like!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EfK20fMSGPdO_oXv4vt5PKNFaaw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/326989-0902737412ae400da3528b8c00d159f7.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bacon Popcorn"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "67"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "216 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "25 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "200 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.5 cup bacon grease",
"0.75 cup unpopped popcorn kernels",
"0.5 teaspoon seasoned salt, or to taste",
"3 tablespoons bacon bits",
"1 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place bacon grease into a 6-quart pot and place over high heat. Add one or two popcorn kernels as testers. When test kernels pop, add remaining popcorn kernels and cover with a lid. As kernels start to pop, shake the pan back and forth constantly to keep unpopped kernels on the bottom. When popping slows down, remove the pan from heat and let it finish popping."
} ,{
"@type": "HowToStep"
,"text": "Pour popcorn into a large bowl or paper sack. Season with 1/2 of the seasoned salt and stir. Taste before adding more salt if desired. Toss with bacon bits and shredded Cheddar cheese for an extra special treat. Store leftovers in lunch sacks or sandwich bags."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mydear1watson"
},
"reviewBody": "I used candied bacon--it was AWESOME"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sequoia04"
},
"reviewBody": "This is a great recipe. I heat 2 Tbsp of bacon grease over medium high heat (high causes smoking) and use 3 Tbsp of kernels. It makes a good size bowl of popcorn for one or two people. The seasoned salt is a great touch (I don't measure this). I don't bother with bacon bits or cheese. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolynCooks"
},
"reviewBody": "Very tasty. Really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcici924"
},
"reviewBody": "This is pretty close to the recipe we use although we don't add any cheese. Also, If you can, crumble a few pieces of bacon into the fat (the finer the crumble the more it will coat each piece) before popping the popcorn. This adds some extra bacon flavor. I remember my sweet elderly southern neighbor making this for us as children 40+ years ago. Definitely one of my guilty pleasures."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal S"
},
"reviewBody": "This was our Sunday night treat when the family gathered to watch the Wonderful World of Disney, Flipper, Gentle Ben, etc. Each week my mom would add different spices and we would have to guess the flavors, but always made in bacon grease. My taste buds still remember parmesan cheese, chili powder, cayenne pepper, etc. Simpler times and fond memories...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Reynolds"
},
"reviewBody": "5 stars for simplicity. This was sorta salty though, but that may have been because of something I did instead. The cheese was perfect as far as mixing in with the popcorn :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PenderICanuck"
},
"reviewBody": "Use enough bacon grease just to cover the bottom of the pot when it is melted. Use enough corn kernels just to cover the bottom of the pot. Sprinkle with garlic powder and seasoned salt, skip bacon and cheese. Schmaltz made up with a little onion before you bake the chicken skin is even better. I often mix it 50/50 with olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "I've never had popcorn this way, and it was delicious! Something different than the usual. I only made a half-batch to try it. I also drizzled the popped corn with a few tblsp of bacon grease. Wanting to see if I'd even like it, I went with just the bacon grease, popcorn and regular salt. I may try it with the cheese and bacon bits the next time. I'll bet a few pinches of cayenne would put this over the top! Thanks Jeannine, great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yum! I love bacon anything and this? WoW! My 2 year old sister can't get enough of it! I didn't have bacon grease so I just used bacon bits Wow! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "shelleyz"
},
"reviewBody": "Didn't taste that much like bacon. Needed a lot more bacon grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shimmer1126"
},
"reviewBody": "best lemonade ever!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodie"
},
"reviewBody": "I grew up with the grease can on the stove. We always cooked popcorn in bacon grease and everyone had their paper bag of popcorn watching television. Every blue moon I may cook popcorn in bacon grease. It is still a good flavor but I no longer have the digestive system as in my earlier years. Kudos to the good ole days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "njmom"
},
"reviewBody": "Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "1/2 cup of bacon grease goes a long way in my dutch oven (1/2 cup grease to 1/3 cup kernels is grease overload), so of course I doubled up on the kernels. I love it when the popcorn raises the lid right up off the pot lol. And I don't care for adding the shredded cheese since it sinks straight to the bottom of the bowl anyway and that's no fun....., so instead we tried the White Cheddar Popcorn Seasoning. It was great! We also tried Kettle Corn Seasoning and it totally rocked the bacon flavor too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PV Chef"
},
"reviewBody": "Awesome! Only way I'll ever eat popcorn from now on!\nThanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyCANcook"
},
"reviewBody": "Yummmy! This was my first time ever cooking popcorn in bacon grease. I used 1/2 cup of grease and 1/3 cup kernels topped with fresh bacon bits and shredded mild cheddar. Can't wait til hubby gets home so he can try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "This was a very good recipes.It combined some of my favorite foods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie D"
},
"reviewBody": "The family and I love just about everything that includes bacon. I keep all of my bacon drippings for pies, tortillas and everything in between. So when I saw this I just had to try it. Awesome! Although I did not add cheese or bits it had enough flavor from the grease. I did add some cajun seasoning and it was yummy! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Texasbelle"
},
"reviewBody": "I have cooked everything with bacon grease except popcorn. It was great, just as I knew it would be. I was 18 years old before I knew a veggie came anyway besides fried...haha!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wilma Moore Rainwater"
},
"reviewBody": "I made this according to the recipe. It's ok, but nothing special. I won't be making this version again. Very weak in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlawson"
},
"reviewBody": "Duh! Sixty years ago, bacon grease was the only way our family made popcorn. It and lard were the greases that we had. Try lard the next time you make popcorn. add butter and salt. Pork fat rules!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "cant wait to make it this camping weekend! as a bacon lover...i play often. one of my favs is chocolate covered bacon! sounds yucky, but trust me, its the bees knees!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hannah Roddy"
},
"reviewBody": "I love popcorn, but my family didn't care for this recipe. The bacon flavor just didn't really do anything for us and the cheese and bacon added was too heavy for popcorn. It's just a matter of taste, I guess. Try it for yourself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitybuttons"
},
"reviewBody": "Small crock of bacon grease on the back of the stove all the time when I was growing up. It was used for just about everything...green beans, fried potatoes, fried corn, greens of every kind and of course POPCORN!!! Back then never thought of making popcorn any other way. We just added regular salt to it. This is just a great way to revisit my childhood and my grandparents house. Thanks for posting. You have introduced many more people to bacon popcorn and have proven that bacon makes everything better. Becky"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie Hubshman-Edinger"
},
"reviewBody": "Just add bacon salt and you have it made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJD"
},
"reviewBody": "Must agree with CATHY, May 2012. My mother and grandmother always kept a jar on the stove to which bacon fat was added. It was used for everything -- greasing potatoes before roasting, mini yorkshires, fried bread and of course our popcorn. It was a real treat to have our bacon popcorn while watching Have Gun....., 77 Sunset Strip, etc. Our big treat to go with the popcorn was a tall glass of 1/2 orange juice and 1/2 gingerale. And this popcorn and my gingerale/oj is what I shall enjoy this evening while watching tv."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "Different. We did use the bacon bites, but not the cheddar cheese. Will probably only make for a change from regular popped popcorn. Do thnk next time we'll add the cheddar cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "I was nearly 30years old before I knew there was any other way to pop corn! You cooked bacon most every morning for breakfast; saved the grease (at least what was left after you fried the eggs and made gravy to go with the biscuits) in a container on the back of the stove and used it for everything else..green beans, potatoes, fried cream corn, but especially, POPCORN! We never added anything but a light sprinkling of salt and there was never any left over! Saturday nights with Gunsmoke and Have Gun Will Travel! The addition of the finely grated cheese is a very good idea, but the basic popcorn with a sprinkling of salt (and maybe some freshly ground black pepper) is just wonderful! MMMMmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My grama used to make popcorn this way but since I only cook bacon once in a blue moon I cheat and use J&amp;D's Bacon Salt - LOL! I will be holding on to your recipe for the rare occasions I do make bacon though! Oh, and the addition of finely shredded cheddar sounds delightful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Popcorn with bacon is GOOD!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frugalmommy"
},
"reviewBody": "I love this recipe. I am of the waste not want not mentality and when I make this the kids love their snack time after nap. To vary it up from time to time instead of cheese and seasoning salt I will top it wit h salt and just the sprinkle of brown sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "needs bacon and salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klgriffis"
},
"reviewBody": "This was super easy and super yummy. I took some of it and dipped it in white chocolate too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Daniels"
},
"reviewBody": "Delicious, easy and fast. Almost as fast as the microwave. Every last kernel popped and I added a bit of salt which made the flavors - pop! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoNa LiSa"
},
"reviewBody": "I just made this for a potluck and all I can is...THIS IS AMAZING!!!! Thanks so much for sharing this recipe and I will be making this alot more. So easy and so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daybee"
},
"reviewBody": "My 16 year old son (VERY PICKY EATER) inhaled this popcorn!! I followed the directions and only added salt. He was amazed at how different it tastes than microwave popcorn. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KinyaMcNeil"
},
"reviewBody": "Very Very Very good. Especially for Bacon lovers. Took a while to save up the bacon grease, but was worth the wait. Wouldn't make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "did not find it that flavorful. i was disappointed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momo3"
},
"reviewBody": "Growing up, this is how my mom made popcorn (and green beans and corn bread...everything had a little bacon grease in it!). I haven't had it in years, but will try it again...there are no fonder memories then Friday nights growing up, having this as a treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon C."
},
"reviewBody": "We have one of those \"Theater\" popcorn makers with the crank handle. We use a stick of butter AND unmeasured bacon grease and that's it. We LOVE it. No salt or anything else and this popper pops faster than the microwave. It's best hot from the popper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jolley"
},
"reviewBody": "The bacon grease made the popcorn way too salty. Thumbs down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "Very good. My entire family enjoyed this one. I did leave out the bacon bits and cheese so the leftovers would hold. This will be a popcorn I make again as my oldest son loves bacon and popcorn which makes it a perfect combo =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "At his annual Christmas Potluck at work, hubs said someone brought popcorn that, believe it or not, was made with bacon grease. He raved about it and it caught my attention - it's hard to think of something that isn't even better with bacon, so I decided to give it a whirl. As a popcorn purist I kept it plain and simple - just popped the popcorn in the bacon grease (didn't measure either) and added a little salt. It really was quite good! While it won't take the place of real buttered popcorn for me, it was an interesting variation I enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I thought the popcorn would have more of a bacon flavor but it doesn't. I put in plenty of crumbled bacon and that helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PRETTYPOLLY4"
},
"reviewBody": "Wow! This tasted better than I thought it would. I used 1/2 cup of finely shredded cheddar &amp; monterey jack cheese rather than the full cup and crumbled real bacon on top. But after indulging in this sinful snack, we opted for a VERY healthy dinner, like a big bowl of broccoli. Thanks JR for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it was ok my kids loved it I am not crazy about bacon grease will try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "it was ok my kids loved it I am not crazy about bacon grease will try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda F."
},
"reviewBody": "I have made popcorn this way my entire adult life. After frying any kind of meat, ie: bacon, hamburgers, steak, porkchops,etc, I love to pop corn in the pan before I wash it. Fantastic flavors !! Depending on what you cooked, a little more oil may have to be added...or subtracted :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marielena"
},
"reviewBody": "It's bacon grease and you don't need to refrigerate it. People have been leaving it in a thick cup on their stove's, for ages. I just wouldn't leave it longer than a month. Take a paper towel and cover it with a rubber band."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "litewav"
},
"reviewBody": "I would think that the bacon grease should be refridgerated and I would be afraid to send this with a lunch that could not be refridgerated. Otherwise, very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "I grew up with making popcorn with bacon grease too. I still make it that way. My grandmother would use an old pot on the stove and it tasted GREAT. I use popcorn popped in grease to make popcorn balls. It is a different flavor and so delicious. Thanks for posting this. I think I will make some tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcy"
},
"reviewBody": "The only way I'll make popcorn from here on out! It was delicious! I didn't add bacon bits or cheese but will in the future. The popcorn turned out to be much more tender then my old way of making it with vegetable oil. Thank you ALLRECIPES for another keeper.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "potato_lady"
},
"reviewBody": "This was how we made popcorn, when I was a kid. I also sprinkle dry ranch dressing on it, instead of the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooks4forty"
},
"reviewBody": "This was delicious! I only used 1/4 cup of bacon grease, and plain salt - no bacon bits or cheese. The more you ate it, the more you could taste the bacon. This is a fun way to change up popcorn every now and then!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GARYSGAL513"
},
"reviewBody": "This was how we made popcorn when I was a kid. Still a go-to comfort treat. My husband thinks I'm nuts, but please try it - it's great. I've never put cheese in it, but I love to eat a chunk of cheddar with popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "renee"
},
"reviewBody": "Made with 1/2 c. popcorn and 3 tbsp. bacon grease. Topped with 2 tbsp. of melted bacon grease and salt. very tasty, but next time I will add 1 more tbsp of bacon grease for the topping for more bacon flavor. very cool idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "Yum-ay!\n\nI scaled this down to four servings for my boys and I. Simple and pretty straightforward. I omitted the cheese and bacon bits as the bacon grease would have been enough on it's own and stuck to plain salt. \n\nSurprizingly good. Would have never thought of using bacon grease to make popcorn!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/159505/bacon-popcorn/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
"name": "Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16051/appetizers-and-snacks/snacks/popcorn/",
"name": "Popcorn Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/159505/bacon-popcorn/",
"name": "Bacon Popcorn"
}
}
]
}
}
, "about": [
]
}
]