				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baked Potato Soup"
,"datePublished": "1999-01-27T14:35:35.000-05:00"
,"dateModified": "2022-10-26T11:58:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sherry Haupt"
,"url": "https://www.allrecipes.com/cook/24328249"
}
]
,"description": "This creamy baked potato soup with crispy bacon bits and shredded Cheddar is a tasty way to use leftover baked potatoes to feed a hungry family!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JdeZHt9jQjZct4AS0oP9kssDv8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5867379-361fd5f1eb254d38b7913e0abfaee07a.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1964224443001",
"description": "This soup combines potatoes with bacon, cheese, and the works.",
"duration": "PT3M40S",
"name": "Baked Potato Soup I",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0b14d35a-dbc0-455e-aeeb-66e01ecaafd1/164b13b0-6628-46a4-b216-6cabf232f8cc/1280x720/match/image.jpg",
"uploadDate": "2021-06-25T15:45:07.230-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baked Potato Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "2350"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "748 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "85 mg"
,"fiberContent": "2 g"
,"proteinContent": "27 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "1335 mg"
,"sugarContent": "16 g"
,"fatContent": "49 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"12 slices bacon",
"0.66666668653488 cup butter or margarine",
"0.66666668653488 cup all-purpose flour",
"7 cups milk",
"4 large baked potatoes, peeled and cubed",
"4 green onions, chopped",
"1.25 cups shredded Cheddar cheese",
"1 cup sour cream",
"1 teaspoon salt",
"1 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 8 to 10 minutes. Drain bacon slices on paper towels; crumble and set aside."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, melt butter in a stockpot or Dutch oven over medium heat. Gradually add flour, whisking until well-combined. Slowly pour in milk, whisking constantly until smooth and thickened."
} ,{
"@type": "HowToStep"
,"text": "Add potatoes and onions and bring to a boil, stirring frequently. Reduce heat and simmer for 10 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JdeZHt9jQjZct4AS0oP9kssDv8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5867379-361fd5f1eb254d38b7913e0abfaee07a.jpg"
}
]
,"text": "Stir in crumbled bacon, Cheddar cheese, sour cream, salt, and pepper. Continue cooking and stirring until cheese is melted."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We loved this!! Added the onions to the butter along with some garlic powder and a few red pepper flakes to sauté prior to adding the flour. Also took the suggestion to cut the milk in half and used 4 cups Chicken broth and 4 cups milk. Threw in some leftover roasted broccoli and it was a true winner and even better the next day!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene Switzer Munn"
},
"reviewBody": "By far, the best potato soup I have EVER made or tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cisston"
},
"reviewBody": "delicious, we didnt have bacon but we had ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tedd5474"
},
"reviewBody": "Followed the recipe to a tee, only addition was 1/2 teaspoon cayenne pepper. Absolutely the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess Lauren"
},
"reviewBody": "Delicious! I tweaked it by adding the garlic to the butter and also substituted 3 cups of milk with chicken stock. My daughter had 3rds :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty Fields"
},
"reviewBody": "creamy and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I think this is a good recipe with potential - modified it slightly by adding broccoli, carrots, oregano. I wanted to add celery, but didn't have any on hand so skipped that. I can see potentially celery or even corn added. Not sure if this recipe had chives, so I added that as well. Because the milk seemed kind of excessive (and other recipes had heavy cream) I ended up doing 3 cups of whole milk, and then 3 1/2 cups of heavy whipping cream to give it some more creaminess. Added bit more sour cream than the recipe called for. Added mozarella cheese and shredded cheddar cheese. Noticed it was getting thick, so I added chicken broth to thin it out. I saw another recipe had said chili powder gave it that extra oomph (it's not spicy at all, I swear. But it really does add an extra boost of flavor!) - so I went ahead and did that. I know it sounds odd, but trust me - it works!!! Never have I made perfect chowder before. With a bit of modification (because I had a sneaking suspicion it might be bland given the current state), this ended up being a complete winner for me. It literally tastes like the really good kind of potato soup you get at restaurants/buffets. I will definitely make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Berryman"
},
"reviewBody": "I used pink salt when baking the potatoes and then left the skin and salt on them when I cubed them. I didn’t blend the flour and milk into the butter at the same time, but instead dumped it all in and the whisked until the floor was fully dissolved. I thought the taste was quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent recipe with a few changes. Add 2 tbsp minced garlic while the butter is melting. Used 4 cups milk and 3 cups chicken broth. Potatoes need to simmer closer to 20min if not cooked beforehand. Add 1 tsp garlic powder &amp; 1 tsp onion powder when adding the salt &amp; pepper. This gives it a nice flavor. Husband said it was almost restaurant worthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Ocasio"
},
"reviewBody": "This soup was amazing. Day 2 is even better. Only used 4 cups milk, a green onion bunch, sauteed onions, minced onions,garlic, bacon fat and only about 2/3 flour. I like thicker soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carissa"
},
"reviewBody": "My whole family LOVES this soup. When the cold weather starts rolling in, this is the first thing they ask for! SO GOOD! I do make one change. Like another reviewer said, I use 3.5 cups of milk and 3.5 cups of chicken broth. Just to have it a still thick but soupy texture. YUMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Kammerer"
},
"reviewBody": "I made this in the slow cooker and added Xtra items!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Morse-Wendt"
},
"reviewBody": "Subbed 3 cups of milk with chicken broth. Skipped sour cream. Put half cheese in and saved other for top, saved all bacon for top. Has potential but still missing some flavor. Update: skipped roux and puréed half of potatoes with a cup of chicken broth. Then added 3 cups of broth and 3 cups of milk to the purée, with some onion, tsp of salt, and tsp garlic powder. Then added potatoes and green onions and rest of ingredients as directed. Maybe add sour cream sooner to allow it to fully dissolve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Godsgirlmomhein"
},
"reviewBody": "I changed the recipe because I didn't have any bacon, even though I am a fan of bacon. But adding a generous amount of sage really made a lovely flavor. Might be a new family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pandora Knight Peckne"
},
"reviewBody": "Super yummy! I used 2 sticks of butter instead of margarine and a bit more flour. So I had thin it out a bit with chicken stock later. But this is definitely the best baked potato soup I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1PICKLELOVER"
},
"reviewBody": "This is a great place to start! Gives you the right proportions of liquid to solids and the thickness is great. It's lacking seasoning (we added garlic and onion powders, nature's seasoning, parsley in addition to the salt and pepper). We also added some chicken bouillon and sauteed chopped onion/carrot/celery in the butter (not margarine) before adding the flour in the first step. We used some chopped leftover ham in lieu of the bacon, then tossed some bacon bits on top for garnish. All in all, it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used to make this recipe as is and I got complaints about it being too floury and too thick. I decided to try again a few years later. I started by only cooking 6 slices of bacon. Then I only put 1/3 cup butter and I sautéed onions and added minced garlic right before mixing 1/3 cup of flour in. Next I added 4 cups of milk and 3 cups of chicken broth. I waited until it was almost boiling (not already thick) and added potatoes. The potatoes will thicken on their own. There’s no need to wait until it’s already thick to add potatoes. Then I followed the rest of the recipe as followed. It turned out way better! It just needed less flour and more flavor. (: definitely reccomend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley Smith"
},
"reviewBody": "The recipe is quick and simple which gives one plenty of leeway to season to your liking. I took heed from others critiques and added red pepper flakes and chili powder for a much needed kick, imo. I also cut the flour and and butter in half as suggested and yes, the soup would be too thick without making that adjustment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vaderkitty1957"
},
"reviewBody": "I have made this soup for a couple.of years bet.soup ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haley McDougal"
},
"reviewBody": "Such a good soup! I halved the recipe as I cook for 1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jschavey26"
},
"reviewBody": "Delicious, creamy, thick and very tasty. I had half and half I needed to use up so I substituted about four cups of half and half which made it even richer.. I didn't have any cheddar I just used Velveeta. It was delicious I think it was a little salty because I didn't use cheddar but I just didn't have any I used what I had in the cabinet. Easy to make as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adrianneglobal"
},
"reviewBody": "Excellent soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "My family and I loved it! We substituted turkey bacon for the pork and used half chicken broth and half milk, giving it a bit more flavor that we enjoy as well as lowering the fat content. Definitely went into our recipe file and will be enjoyed again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "peekachu4"
},
"reviewBody": "Prep time is much longer if you don't have cooked bacon, baked potatoes, and chopped onions on hand. Otherwise, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Scott Hermann"
},
"reviewBody": "Make sure you cook potatoes before adding. Recipe does not say that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aunt Susan"
},
"reviewBody": "SAVED it to my Favorites! This is certainly an easy recipe but it sounded a little bland so, like many other commenters, I made a few tweaks and I like my finished product. 1) MILK: I used 4 cups milk (2%) and 3 cups chicken broth. Next time I’ll do 4 cups (32oz) chicken broth and 3 cups milk. This must be so bland with only milk.; 2) MARGARINE: I used the bacon fat instead, for flavor, but only 1/3 cup fat and 1/3 cup flour, which is half of what the recipe calls for, and it is plenty thick!; 3) ONIONS: I did put the green onions in per recipe BUT first, I chopped an entire medium-sized yellow onion and sautéed it in the bacon fat for 1-2 minutes BEFORE stirring in the flour. Awesome flavor!; 4) SOUR CREAM: I used 1/2 cup instead of full cup. It still tastes good but, for giggles, I MIGHT try the full cup next time.; 5) POTATOES: I left the skin on - yummy, rustic and better for you!; 6) CHEESE: I love cheese (too much) so I put in 2 cups (SHARP CHEDDAR for more tangy flavor). And, NO, it does not taste like cheese soup. It’s delicious!; 7) SEASONING: I added a pinch of cayenne for zip, some garlic powder and onion powder for a little more flavor.; 8) GARNISH: topped with a little more grated cheddar, extra chopped green onion, and I cooked extra bacon to crumble on top of the soup. I’m so curious to see how this reheats tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the1betsy"
},
"reviewBody": "Absolutely delicious and easy. I used finely chopped sweet onion and cooked them until translucent in the bacon drippings before draining and adding them. Raves from the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bealsstephanie94"
},
"reviewBody": "I added diced ham as well! Very good and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael Nicole Wright Hornyak"
},
"reviewBody": "I read many of the comments and adjusted the recipe beforehand. This is my first time ever making or truthfully eating a potato soup! It came out great! Not spicy, not runny, nice texture, not very starchy, and flavorful. Even my skeptical children went back for seconds. \n\nItems I tweaked.. 1 cut the butter, flour, and sour cream in half. 4 cups of milk, 3 cups of chicken broth. I’m pretty sure that I exceeded the suggested amount of salt and pepper, (I used my palm and gaged what I felt exceeded a tsp, but less than a tbsp.) and I added in a tsp of Cajun seasoning to pick up the lost flavor a few mentioned.\n\nLoved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Weber"
},
"reviewBody": "Great receipe except there is a lot of milk. So I only did 4 cups 1% milk with 3 cups chicken broth. Yummy!! it had so much flavor and was still very thick. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana Horton"
},
"reviewBody": "I made it again today and I still do it twice baked by potatoes I bought potatoes to a semi hard to stage in mathematics is very little add and then put them aside and then do everything else from your steps on out till it’s done very good recipe!!! 5 plus stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JimmyG"
},
"reviewBody": "I've made this before and it is awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Gunther"
},
"reviewBody": "LOVE this recipe! It is a little too thick for me, since I like extra soupy soup, so I always add some chicken broth to thin it out toward the end. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia R. Rhubin"
},
"reviewBody": "I used half the butter &amp; flour - cooked the onion in the the butter before I added the flour. came out quite creamy and really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adnirnnyl tnerap"
},
"reviewBody": "Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Dixon"
},
"reviewBody": "I have made this recipe several times. It is our favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andre Aguilar"
},
"reviewBody": "It's almost has good has olive garden baked potatoe soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Smithgall"
},
"reviewBody": "If you are a bacon fan, leave out the butter or margarine and use the bacon fat from cooking off the bacon to make the roux. My guys are not fans of sour cream so I left that out and added extra cheese. My husband is also lactose intolerant so I make this with whole milk lactaid instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elliann"
},
"reviewBody": "I altered the recipe a bit after reading some of the other reviews. I exchanged 2 cups of the milk for chicken broth. I still wasn’t quite satisfied so I added 3 tsp of chicken broth concentrate. Otherwise I followed the recipe. It makes a big pot of soup. When I reheated it, I added water to the consistency I wanted. My husband really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rachelc0502"
},
"reviewBody": "Like eating flour paste. Terrible"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue Reed"
},
"reviewBody": "I've made this a few times. I love the taste of it. It turns out very thick, my husband says it's not soup, but loves it also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "morgan"
},
"reviewBody": "When I first tasted it while it was hot, it was delicious. After it sat and cooled it thickened so much and tasted like straight flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "My family loves this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlmondBlossom"
},
"reviewBody": "This is a great &amp; simple soup. I followed the recipe except I used 1 cup of Bacon Crumble ( Kirkland brand from Costco), butter instead of margarine and 1% milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzcap"
},
"reviewBody": "This is fantastic. Followed directions. Kept a little more bacon and sour cream and onions for garnish. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lachandra"
},
"reviewBody": "I used 1 1/2 stick of butter and boiled my cube potatoes separately for about 10 minutes then added them to the stock later"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "It tastes so good! I put more potatoes than the recipe called for and it was soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melc"
},
"reviewBody": "Great simple recipe!! We added a small amount of garlic and thyme and loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Plank"
},
"reviewBody": "I have made this for years.....it is incredible. For the people that was saying it was bland all you need to add is some salt and pepper.....perks it right up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Nix"
},
"reviewBody": "Used baked potatoes. Didn’t peek at all. Followed advice of others. Sautéed celery, onions, and garlic in bacon grease. Then added butter and flour, etc. Only used half the butter but still came out plenty thick. Definitely needs the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef_mary"
},
"reviewBody": "excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lab Rat"
},
"reviewBody": "Starts with way too much roux and is DIRELY underseasoned. Once you properly salt it, it's still too thick, but not bad. I guarantee this recipe would be better if you boiled the potatoes in salted water instead of baking them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niki Robinson-Ague"
},
"reviewBody": "W"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassandra Lopez"
},
"reviewBody": "Good soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Violette"
},
"reviewBody": "So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abby escalante"
},
"reviewBody": "its really good but i wuld use carrots istead of onions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Morris"
},
"reviewBody": "I made this with some revisions. A little less flour, I used kielbasa instead of bacon (so much more flavor), I used 6 cups of chicken broth and 1 cup of milk. I added chopped onion and 1 cup of chopped celery. I added a 1/4 tsp of cayenne pepper, garlic powder and onion powder. All of these revisions made the soup extremely flavorful and not bland whatsoever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TerryV"
},
"reviewBody": "It was great! I would make this again for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ksmith29340"
},
"reviewBody": "This is perfect! I missed that the potatoes were supposed to be baked first. I diced them up in small to medium bite sized pieces and simmered them in the milk til almost done. Then in the last 5-10 minutes I added in the last ingredients and finished cooking. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jack O'Connor"
},
"reviewBody": "I made this recipe using real BUTTER and it was legit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "I made this recipe today with leftover baked potatoes. It was super easy and turned out great. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V_Ardashian"
},
"reviewBody": "So good. Whole family loved it. We just put the chives and bacon on top instead of in and a little extra cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eumenides"
},
"reviewBody": "Exactly what I was looking for! \n\nI’ve made it with and without the roux - I much prefer it with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Hodges"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "X45Boarder"
},
"reviewBody": "The only thing I change is I don't skin the potatoes. We like the skins. The whole family really likes this soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Humama23Boyz"
},
"reviewBody": "May husband and I loved this! It makes quite a bit, but all the better for leftovers. I would recommend making it for a potluck whenever we are able to do those again. We used a Black Forest flavored bacon, and the smoky flavor was a nice addition to the savory soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Peters"
},
"reviewBody": "This was a hit! Even my pickiest eater loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "septembercook08"
},
"reviewBody": "So I definitely read the reviews before endeavoring making this soup and I am glad I did! Instead of 7 cups of milk, I did 3 cups of milk and 4 cups of chicken broth. It definitely added a nice layer of flavor to the soup. Husband loved it!! It will definitely become a staple during the cold winter season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Pepper"
},
"reviewBody": "Fantastic soup - the best I have ever had. I highly recommend making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Made this for my co workers and they said it was the best potato soup they had ever had. I did double up on bacon, used whole milk, and added more cheese. I baked my potatoes in my instant pot and did my bacon in air fryer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vivian"
},
"reviewBody": "This soup was so good. I tweaked it somewhat using some of the suggestions from reviews. I put 5 cups of milk and 2 cups of chicken broth. I added garlic powder and onion powder. It came out nice and creamy. It was a hit with my family. I will definitely add this to the routine especially with fall and winter on the horizon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Quaty"
},
"reviewBody": "I'm going to be one of those people that say what I did differently. However I did make this exactly as written the first time. \n\nWhen I made this originally my husband wasn't impressed. It was a little on the bland side. Still good but couldn't have been better. \n\nChanges\n\nI used the whites of the scallions and sautéed them with 2 cloves of garlic (minced) . Removed from pot, then made the roux. I used one stick of butter and ¹/² cup of flour. \nI also replaced half of the milk with chicken stock. \n\nsoup came out delicious and flavorful. Perfect consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grams221"
},
"reviewBody": "Our family loves this soup. I use 3 cups milk and then 3 cups chicken stock. We like it less rich so I changed the liquid amounts also. I actually use 2 cups of chicken stock and add more as needed. Also I add about 1/4 cup of white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Russell Fulton"
},
"reviewBody": "This soup is delicious. My family loved it. Not difficult, but I would suggest baking the potatoes a day or more ahead to save time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JimmyG"
},
"reviewBody": "I've made this soup on a few occasions. It's my favorite. I've gotten rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Savannah Juarez"
},
"reviewBody": "I love this recipe! I made a few adjustments by skipping the roux step and using less milk. I also don't add the green onions until almost the end so they don't lose all their flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy strickland"
},
"reviewBody": "Awesome Recipe, Simple and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Mouton"
},
"reviewBody": "My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzeegirl"
},
"reviewBody": "Love this recipe. I tweaked it as follows: microwave the potatoes; \nIt needs more milk. It gets thick so need to thin. I use butter only. Needs MORE salt/pepper (and any other seasoning you like with potatoes. It is too bland with the miserIy salt/pepper in recipe.) I am about to freeze the leftovers. Hearty soup. My family loves this soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AprilM"
},
"reviewBody": "This was so good! Sub three cups of milk for three cups of chicken broth. Added a little garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon"
},
"reviewBody": "Super delicious and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drwillyp"
},
"reviewBody": "not diet friendly!!!I used bacon grease to make the roux. I used my indoor smoker to make the baked taters. I of course used cream!!!! It was orgasmic!!! I AM a god in the kitchen, (not my words)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "denise bradley"
},
"reviewBody": "Surprised reviews called this bland people are usually complaining about how much salt is in a recipe...bland maybe but it was good to me. My family added some lawrys to their bowls. So I would suggest making as stated and allow others to add more salt. Or add an additional tsp of Lawrys or Adobe seasoning salt. Also if you substitute everything for fat free and no bacon then you run the risk of Blandness. Fat brings flavor so be mindful of the dish that you’re preparing before you forgo all fat. HELLO This dish is literally butter, cheese and potatoes topped with bacon. Everything doesn’t have to be a healthy dish. Some dishes are made to be indulgent. I used red potato’s since that’s what I have more often than not. No peeling slice uncooked into chunks add to milk mixture allow to boil 25m."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SydG"
},
"reviewBody": "Added onion powder nothing extra, family loved it! Great with grilled cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I found this pretty bland. I added garlic and onion powder to try to season it up. I will not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YY"
},
"reviewBody": "Noice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "I always try a recipe as written the first time. I don’t understand all these reviews. I almost didn’t try it because it seemed unacceptable without major changes. Write your own recipe if you want, but this soup is perfect as written. Nice and thick, wonderfully tasty. So don’t say you cut the flour, and then complain that it’s too thin. I suspect some people used raw potatoes instead of baked. This is a fabulous soup! Please try it following the actual recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "Great recipe! I substituted ham and added celery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieA37"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsoneill"
},
"reviewBody": "Like my soup a little thicker so I did add some extra flour &amp; a little extra salt but otherwise no changes. It is AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I used about 10 potatoes but they were all different sizes... most of them were small. Used only about 2 TBS of butter. Didn't use flour at all. Used 4 cups of milk and 1 cup of chicken stock. At first it looked super liquid-y but it thickened and continued to thicken even after simmering 10 minutes... to a perfect consistency! For seasonings I used salt, pepper, a dash of paprika, onion powder, garlic powder and a dash of parsley. It was SO good! I was shocked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Thesilvercook8"
},
"reviewBody": "When i made it, it tasted more like a sauce than a soup.\nI will not make it again and i cut out the green peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie Coffin"
},
"reviewBody": "I took the advice of other reviewers and omitted the roux, as well as replacing some of the milk with chicken broth. I blended up some of the potatoes at the end, and stirred them back into the soup to thicken it. Excellent flavor, and very quick and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "It turned out so good. My daughters and husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this soup!!! Made a small batch but will make a full one next time. Very easy and super delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndieakeller"
},
"reviewBody": "I loved this soup!!! Made a small batch but will make a full one next time. Very easy and super delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Bentley"
},
"reviewBody": "Followed the Instructions exactly.....except added a little more cheese. My partner and I loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fgold"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ric May"
},
"reviewBody": "Made my first batch a few moths ago. I t was the best soup I have ever made!!\n\nMaking my second batch tomorrow. Follow the recipe. No changes required, but I am adding a few wild leeks I have in the freezer."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12997/baked-potato-soup-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1552/soups-stews-and-chili/soup/vegetable-soup/potato-soup/",
"name": "Potato Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12997/baked-potato-soup-i/",
"name": "Baked Potato Soup"
}
}
]
}
}
, "about": [
]
}
]