				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baked Shrimp Scampi"
,"datePublished": "2019-07-10T03:04:00.000-04:00"
,"dateModified": "2022-01-14T01:41:00.000-05:00"
,"author": [
{"@type": "Person"
,"name": "WannaBACook"
,"url": "https://www.allrecipes.com/cook/4749320"
}
]
,"description": "Tender shrimp are tossed with butter, garlic, and lemon juice and baked with Italian-seasoned bread crumbs in this rich and flavorful dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_kjx_zQUvmAuvSy0OHArR444xWM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1189502-310d95d927754d2585611f69a8a866f5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baked Shrimp Scampi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "155"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "574 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "295 mg"
,"fiberContent": "1 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "29 g"
,"sodiumContent": "424 mg"
,"sugarContent": "1 g"
,"fatContent": "48 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound large shrimp, peeled and deveined",
"1 cup unsalted butter",
"0.25 cup white wine",
"2 tablespoons lemon juice",
"2 tablespoons dried parsley",
"1 teaspoon cayenne pepper",
"2 tablespoons minced garlic",
"0.5 cup Italian-seasoned bread crumbs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place shrimp into a saucepan, cover with water to a depth of 2 inches over shrimp, and bring to a boil. Cover pan and cook until shrimp are pink, 2 to 3 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "Combine butter, white wine, lemon juice, parsley, cayenne pepper, and garlic in a 2-quart casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Place casserole dish in oven and preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "When butter is melted, lightly toss shrimp in butter mixture until coated. Sprinkle bread crumbs over shrimp."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until bread crumbs are lightly golden brown, about 15 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family raved about this. I served it over yellow rice and they loved it. I followed the recipe exactly. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BIG MIKEY"
},
"reviewBody": "IT WAS GOOD, BUT EVERYBODY KNOWS YOU DO NOT ADD WHITE WINE UNTIL LAST. WINE MAKES SHRIMP TOUGH, AND WHY WOULD YOU PRE-COOK THE SHRIMP. ADD THE WINE TO THE MIX BEFORE BREADING IT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liza Frydenlund"
},
"reviewBody": "I used the modifications made by Naples, and I got rave reviews. I did have to cook the shrimp 10-15 minutes longer in the oven - so net probably 25. But the shrimp were cold from the refrigerator going into the casserole dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "I made this twice since finding it in May 2021. For some reason - my review didn’t stick? Nonetheless; while I followed the ingredients, I followed Reviewer Naples cooking method/instructions - including her recommended Garlic Butter and Herb Pasta! (Also AWESOME!). This has been a go-to recipe when I want to make a special meal for two. I’m prepping my grocery list to make it this Saturday evening for my THIRD time and looking forward to divine eating! Grateful for finding this recipe and for Naples review!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "boxerlover"
},
"reviewBody": "Too much liquid. I followed recipe but used pre-cooked frozen shrimp. I baked for 15 mins at 400 turning over half way. Next time I make I use 1/2 butter instead of 1 cup. Very nice tasting and fast dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "The amount of butter is excessive so I cut the amount back. Also, I didn't boil the shrimp to retain as much shrimp flavor as possible, I simply increased the baking time by 3 minutes. With those changes this recipe is a 5 star recipe. Quick, easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Eads"
},
"reviewBody": "Like the others I did not parboil my shrimp but the rest I followed exactly to the recipe and my son absolutely loved it and said to make sure I saved the recipe and made it again. The only thing I'll change is I thought it had too much sauce so I will probably put half the sauce in when I bake them and then Brown the bread crumbs at the end under the broiler"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky1"
},
"reviewBody": "It was absolutely delicious. I’ve done it numerous times. I do not cook it prior I just use the? oven. Great summer recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcj"
},
"reviewBody": "Followed recipe but I did not boil shrimp. I melted butter and other ingredients in sauce pan and poured over shrimp and salmon in baking dish, then breadcrumbs on top and baked at 400 degrees for 15 mins for shrimp and additional 5 mins for the salmon. It was delicious. The cayenne added nice kick. Used 1.5 sticks of butter instead of 2 sticks. Keeper recipe. No vampires tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Izzyant"
},
"reviewBody": "Made this with almost 2 lbs of shrimp, no red pepper &amp; could have cut the butter in half, but may get some crusty Italian bread to soak up the lemon &amp; herb garlic butter! Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Drechsel"
},
"reviewBody": "This stuff is seriously amaze-balls! Here’s how I tweaked it: I halved the cayenne pepper because it had slightly too much kick for me (I’ve made it like five times now). You don’t need nearly as much butter as the recipe calls for either- I only use 1/2 cup. I also serve it over spaghetti with steamed broccoli and a little Parmesan cheese sprinkled on top. Toss spaghetti in the pan I cooked the shrimp in to coat it in the butter and voila! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al"
},
"reviewBody": "As some other reviewers said, no need to precook the shrimp. Cook in casserole dish with everything else 12 minutes at 400 degrees. Changes I made, added the garlic and parsley to the bread crumbs and added a little olive oil to it. Also added a couple of dashes of cayenne to the bread crumbs. My girlfriend who usually makes regular shrimp scampi liked this baked version better, and I agree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefboyarzee"
},
"reviewBody": "No cayenne\nFollowed sequence from 1st reviewer. \nPHENOMENAL—great for company\nMaybe less butter?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lenora Salvetti"
},
"reviewBody": "I will be making this recipe over and over. Absolutely wonderful flavor. Presentation was beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teri cordes"
},
"reviewBody": "I couldn’t give this 5 stars as I made many changes. \nAs others, I didn’t cook the shrimp in water &amp; reduced the amount of butter, I reduced butter further by mixing it with olive oil.\nThis recipe is a great template &amp; a great starting out point.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kbastedo"
},
"reviewBody": "I made this recipe without reading reviews...my mistake. I followed the directions except for using only a half cup of butter. Delicious dish except to spicy for us. Next time I will not parboil shrimp, I will add more wine, half a cup of butter and and keep lemon juice the same. I will use a 1/4 cup of breadcrumbs and 1/4tsp of cayenne pepper or red pepper flakes. This dish is easy and tasty so with adjustments, I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bearzo"
},
"reviewBody": "I did not preboil the shrimp but followed other directions. Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marc Mulford"
},
"reviewBody": "Do not pre-cook the shrimp. Shrimp cook rapidly and this step is unnecessary. The recipe calls for too much butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Very easy and delicious! I served Angel hair pasta w butter and parmesan too. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "peggy"
},
"reviewBody": "Delicious but came out a little dry. Next time, I'll add more wine and/or chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "higgins"
},
"reviewBody": "Starting with 3/4 Cup Butter and Subbed 1/2 Tsp of Smoked Paprika. Also skipping the precooking of the shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Brenner Mottola"
},
"reviewBody": "So easy, yet soooo yummy. My husband loves when I make this shrimp dish. Try it, you’ll like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Epinkard99"
},
"reviewBody": "I made this for my Mom and Dad’s anniversary dinner. The following changes were made: I did not boil the shrimp before baking it. Second, I doubled the amount of shrimp so the butter would not overwhelm the dish. Three, I left out the cayenne since Dad is not a fan of the spicy(if it was just me, the cayenne would have been a definite go). I baked at 350 degrees for 12minutes, turned the oven off and let the shrimp sit in the oven for about another five minutes. Everyone enjoyed it and I would definitely make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Lou"
},
"reviewBody": "I made the sauce and marinated the shrimp ahead of time so that was a meal prep time saver. Especially when you are entertaining guest! (Used half the butter and cayenne pepper.) It was awesome and would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louanne S"
},
"reviewBody": "I made this following the directions-my husband loved it, but, we decided to go on a keto diet so I substituted the breadcrumbs for almond breadcrumbs, added a little parm to the breadcrumbs with Italian seasonings and served on spaghetti squash. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "syd"
},
"reviewBody": "easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal Coley"
},
"reviewBody": "Made with just 1 stick of butter and 1/2t of cayenne. Used frozen shrimp, but would try again with fresh. My husband really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Smith-Parke"
},
"reviewBody": "Made it just the same as naples34102 posted except added several shakes of red pepper flakes. Served with angel hair, but would be good with rice, too! EXCELLENT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jude"
},
"reviewBody": "I was really disappointed with this recipe. What differs it from other scampi recipes is the cayenne and the breadcrumbs. The cayenne was great. The breadcrumbs were the downfall. My shrimp were tight in my pan to keep the breadcrumbs from falling down. Didn't happen. So, when I went to put it over my pasta, I had this unpleasant mush of breadcrumbs. They also sucked up the wonderful juices. So, lose the breadcrumbs and you have a delight. Just another scampi recipe .But, the cayenne was what made it a delight, after working around the breadcrumb mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KrisV"
},
"reviewBody": "Loved it although I would add a bit more broth next time as my husband and I wanted to drizzle it more over our angel hair pasta. Loved the kick from the cayenne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pegsoslow"
},
"reviewBody": "I am not a fan of shrimp scampi but my husband is. I decided to make this for dinner. I feel in love with this shrimp. It turned out perfect, was quick and easy. I will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tammy Voyce"
},
"reviewBody": "Mine came out too greasy. I did have a little less shrimp, but that was it. I used everything as the recipe says. I had to pour out all the butter after realizing there was way too much. I am not a pro in the kitchen, so this was disappointing. After fixing everything the best I could, it did have a nice flavor at the end. Next time, I'll know to keep an eye out for the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Breyer Sienkiewicz"
},
"reviewBody": "This was the easiest, most delicious Shrimp Scampi ever! Lots of butter and garlic, just like we love. I didn't change a thing and served it over angel hair pasts. It was as good as a $20 dinner in any restaurant. I used cooked shrimp so it even took less time to prepare. And, I took off the tails before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Desert Mama"
},
"reviewBody": "Substituted frozen cooked shrimp (thawed) and then followed the recipe &amp; cooking time. Quick &amp; easy. Served with herbed angel hair pasta &amp; a side salad. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "I added salt and half the cayenne due to a 5 year old eating as well. It was great but I may cut the breadcrumbs down a little maybe 1/3 cup but other than that, I will definitely make it again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe inspired me and I made the best shrimp scampi ever because of it. I didn't use the bread crumbs because the scampi looked and smelled so good without it that I just added some pasta and enjoyed it as it was. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DECAR48"
},
"reviewBody": "We all liked this. Although I made a half batch there were still too many shrimp. Will have the rest by themselves for lunch tomorrow!. I personally thought there was too much butter and bread crumbs. Next time I will use less and see what happens. Very easy and tasty. Will make again to be sure! I forgot to mention that I did not cook the shrimp ahead of putting it in the oven. There is no need to !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah"
},
"reviewBody": "It was AMAZING so easy to make and DELICIOUS I would definitely make this again!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Dunn"
},
"reviewBody": "It didn’t quite come out crisp enough otherwise it was great,my fault I put in a little too much red pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robertka"
},
"reviewBody": "Excellent, I used Chicken broth instead of wine and after baking it I put it under the broiler for a couple of minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mermaid62"
},
"reviewBody": "I followed the recipe for the sauce and cooking, but I added sliced black olives, red and yellow peppers, sliced mushrooms and halved cherry tomatoes. I used to get a similar dish at a local seafood restaurant growing up called “Sunset Shrimp”. This was better! The flavor was terrific! I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimchi"
},
"reviewBody": "This is a great recipe except there is NO REASON to ever boil shrimp first, then bake it for 15 more mins--it would be rubbery and tough. Cut way down on the butter, added lemon and a bit more wine and it's a winner! Panko bread crumbs work well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "genna"
},
"reviewBody": "So delicious! I followed the reviews and did not precook the shrimp. Just mixed everything together and baked it. Also didn’t have any cayenne pepper but added paprika and black pepper. I also added basil and some grated Parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "margie"
},
"reviewBody": "No changes. Best shrimp scampi ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erne"
},
"reviewBody": "I used half a cup of butter, half a teaspoon of cayenne pepper, &amp; frozen cooked shrimp (thawed). Baked at 375 degrees. Sprinkled with shredded Parmesan cheese when done &amp; served over pasta. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Churchill"
},
"reviewBody": "Did exactly like the recipe. Will make it again but omit bread crumbs &amp; soak up the delicious sauce with fresh French bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Madeirenco"
},
"reviewBody": "I used less bread crumbs. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BigB"
},
"reviewBody": "I did use 2 pounds of shrimp and doubled the bread crumbs and parsley and kept the same garlic, cayenne, and lemon juice. would make it again. Wasn't as tasty as I imagined and next time I would add more cayenne as you could taste it but wasn't that hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Sue Christensen LaRue"
},
"reviewBody": "All I can say is oh my gosh!!!! This was so good. We decided to have some linguine with it. I can’t remember how many times my husband said how good it was and he did it again Tony got (yes I had leftovers). This is definitely a keeper for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmurraypat"
},
"reviewBody": "No changes, very good, will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CaptainLadyG"
},
"reviewBody": "Very good, only 4 stars because there was far too much butter. I expected to have a \"crispy\" bread crumb topping. Good flavor, will make again with less butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weavermm"
},
"reviewBody": "Super! We like spicy and garlic. I boiled the shrimp in a can of beer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Tavaglione"
},
"reviewBody": "I have cut down on the amount of liquids going in it because my shrimp were swimming in it and the bread crumbs would turn out too soggy but soggy or not it is still the best I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamela clayton"
},
"reviewBody": "Husband raved when I made it. I didn’t have cayenne so I used some Cajun spice and it worked out well. I also sprinkled some Parmesan cheese on it. I boiled my frozen shrimp so I only baked this for around 10 minutes. Will make it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Home Cookin' Lady"
},
"reviewBody": "I made it as written except for pre-cooking the shrimp (totally unnecessary) and leaving out the cayenne pepper, using paprika instead. I did not care for the recipe for a couple of reasons....one was the amount of lemon taste.....a little too much for me.....and the other was that it should have specified a pan size so that the butter sauce wasn't as deep OR to use less butter in a 9 x 13 pan. I would have preferred the shrimp to be a little on the crispy side instead of the soggy ones I ended up with. So, if I make it again, I will use less butter and lemon and make more of a batter to coat the shrimp instead of floating them in the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shandy"
},
"reviewBody": "Really outstanding except for a couple of things. I just sprinkled a little cayenne in the mixture, not as much as indicated on the recipe. Next time I’ll add some salt since it seemed a bit bland and I’ll use half as much butter. It was sort of a soggy mess out of the oven, but I poured and mixed it over the angel hair pasta and it was delicious! Oh, and I didn’t bother to boil the shrimp - I simply ran some hot water over it while it was thawing. Home run on this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma"
},
"reviewBody": "This recipe really deserves 5 stars for flavor, but there's no need to follow the first step in the directions to boil the shrimp. I did use 1/4th less butter &amp; a bit less cayenne due to personal taste. My only quibble, other than the possibly detrimental direction to boil the shrimp, was in the rather pale look of the finished dish. The next time I think I'll try naples' method of mixing in a little olive oil with the bread crumbs. The next option along with the oiled bread crumbs might be a bit shorter bake time &amp; a brief trip to the \"tanning bed\" (broiler). :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Calhoun"
},
"reviewBody": "Will be making again broiled last couple minutes had over parmesan rice with garlic bread and steamed green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Secretariat"
},
"reviewBody": "I followed Naples suggestions and this came out wonderful and spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan Mowbray"
},
"reviewBody": "I would give this recipe 5 stars for taste but for the fact of too much butter - I'd cut it back by half next time. I'd also follow the recommendation of another reviewer to use a dish that just fits the amount of shrimp so that more of the bread crumbs will be on the shrimp, less mush in the pan. The shrimp does not require precooking. I made sure the shrimp was well covered in the melted butter, wine combo, then sprinkled the crumbs on and baked for 15 mins. I served it with fresh-made crusty bread. Mmm mm good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "92DORE"
},
"reviewBody": "I mean, it was delicious, but 1. cup of butter? I used 1/2 cup and it combined with the breadcrumbs to make a buttery (but delicious) mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "It was just \"ok\" to me. I found the shrimp kind of mushy cooked this way. I use a better one than this. I'm trying to keep the best ones I try out in each category and this one didn't make the cut. It wasn't bad--it wasn't \"great\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "Best shrimp scampi I have ever had!!! And so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jane Cottier"
},
"reviewBody": "The reviews were wonderful from my husband and friends!! A keeper. I did NOT cook the shrimp first, as several people also didn’t, and baked it for 10-12 minutes at 400. I also added some olive oil to the bread crumbs to moisten them. I made it in a 13 inch pan and would make it in a slightly smaller one next time in that the bread crumbs went in the melted butter broth and didn’t stay on the shrimp. We had wild rice and a salad with crusty bread and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keaster830"
},
"reviewBody": "Very, very good. I followed the recipe except for cooking the shrimp prior to baking and it turned out perfect. My husband loves spicy but me, not so much. I used the called for amount of cayenne pepper and it wasn’t to much for my taste. Such a quick and easy recipe, we will make this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maple Syrup"
},
"reviewBody": "Very nice easy recipe. Used a pound of salad shrimp and skipped out on the bread crumbs to mix it into angel hair pasta. All else as per recipe, I also skipped pre-boiling the shrimp which is not necessary, they'll cook in the oven. Topped the dish with grated asiago after plating. Beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeBee"
},
"reviewBody": "This recipe was awesome! I made it exactly as directed. Served with the Lemon Butter Herb Pasta from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bren"
},
"reviewBody": "I loved the flavour and the kick from the cayenne but the cooking method didn't work for me. I skipped step 1 completely, my shrimp were on the smaller side 16-20 count. To get a little colour on the shrimp I put them under the broiler for a few minutes. I will make this recipe again but I'll have to fiddle with the cooking method. I made this for surf and turf night and served it with spaetzle. It's a solid 5 for the flavour! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother Hood"
},
"reviewBody": "My teenage son, who isn't a big fan of shrimp, loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aimeelynn"
},
"reviewBody": "Loved it. used a half stick of butter and two teaspoons of olive oil and it was still really flavorful. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellylynn93"
},
"reviewBody": "This recipe is simple and delicious. The only suggestion is I use more breadcrumbs then called for. I toss the butter mixture with the shrimp and then add the breadcrumbs to the mixture and mix with the shrimp. I also add a cup of wine (you can never have enough!) It just has enough kick with the spice. It is made at least once a week around here :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Davis Ensign"
},
"reviewBody": "Very easy and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pisc3sappl3lady"
},
"reviewBody": "Made this with fresh shrimp caught the same day. I'm being completely honest and not exaggerating when I say this is easily top ten of the best things I've ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanie"
},
"reviewBody": "My family flipped over this meal! I have a new status in their eyes of a great cook, thanks to this great recipe - loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki Childers Zimmerman"
},
"reviewBody": "I made this for dinner this evening and like naples34102, I also took creative license with the recipe, because boiling shrimp before baking would have made them taste like rubber. Baking is sufficient. I poured melted butter and lemon juice in my round Pyrex pie pan. I coated the shrimp by dipping both sides and placed them in a pretty arrangement. Then, I mixed the chopped bread crumbs (multi-grain), minced garlic, chopped parsley, salt and pepper together and drizzled this with olive oil and mixed it once more to coat. Top the shrimp with the seasoned bread crumbs and baked at 400 degrees for 15-17 minutes. The bread crumbs were delicious and crispy on top and a nice blending with the buttered shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teri"
},
"reviewBody": "I thought there was way too much butter. It seemed soupy to me and i poured a bunch off before serving. Taste was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alysse Meiners"
},
"reviewBody": "Very good! However, as someone on a diet I used half the butter and the breadcrumbs were unnecessary. Also, the shrimp came out a bit overcooked so I'd only boil them for about a minute. Serve it up with some rice and veggies and you've got a delicious husband pleasing dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "Delicious. Scaled down a bit for the two of us, but kept most of the saucy stuff. I did cut the butter to 1/2 cup, melted all of it and put most into the pan. The rest I combined with some olive oil and the breadcrumbs, mixed well, and used that to coat the shrimp, as suggested by another reviewer. I also used about 1/2 cup spinach instead of parsley, and had a few capers to use up and so I added them too! Cut the cayenne to 1/4 tsp, and used cooking sherry since I didn't have white wine. Placed the breaded shrimp atop the other ingredients in the baking pan, and broiled for the last 4 min. Will make again. UPDATE 8/5/19: Stuck more closely to the recipe and method. Added broccoli florets after melting the butter in the pan and the addition of the other sauce ingredients. Also halved cherry tomatoes. Baked all this without the shrimp for about 15 minutes, then added the shrimp and bread crumbs which were combined with parm and more garlic. Wow, what a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sideshowrob"
},
"reviewBody": "One of my favorite recipes to make! We don't cut the cayenne at all, it's the perfect amount. I go a little light on the lemon juice, it gets overpoweringly lemony otherwise. If you don't have any breadcrumbs on hand I've used crushed triscuits in a pinch! I also add about a tsp of salt. Better than any restaurant- if you have fresh parsley it would probably be even tastier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asklar"
},
"reviewBody": "I loved the technique of melting the butter and flavorings in the oven, and then adding the shrimp and breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suprafish82"
},
"reviewBody": "Its really good every body likes it. \nWhen I make it I double up on everything becuase I cook two pounds of shrimp.. \n\nI also use cook it differently. I use half the butter and sometimes omit the cayenne pepper entirely or just use a little black pepper instead. \n\nTo make the mixture I melt the butter in sauce pan, with garlic but not to cook it. Just get rhe butter melted with it and warm up the garlic a little also put in dry parsley at this stage. remove from heat, then add half of the bread crumbs, white wine and raw peeled and drained shrimp. Then throw the whole thing is a 7x11 casserole dish and sprinkle rest of bread crumbs on top. Cook same as directions and Voilà. This is the easiest thing to make ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth Wilder"
},
"reviewBody": "I pretty much followed the original directions with a few minor changes. I used half cup of butter and 1/2 tsp. of cayenne. I also used 1/2 regular breadcrumbs and 1/2 Panko with a generous tsp of Italian seasoning mixed in. I didn't par-boil. I placed the shrimp into the melted butter mixture, cooked for 6 mins. Removed, flipped the shrimp over and covered with the breadcrumbs. I continued to cook for 8 minutes. The shrimp were cooked perfectly and the sauce tasted good but the breadcrumbs were soggy and unappealing. I will do this again but leave off the breadcrumbs unless I plan to broil the 2nd side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BoertzelCooks"
},
"reviewBody": "Doubled the ingredients and maybe should have cut back on the butter, cayenne pepper and the garlic. Put it over a bed of angel hair pasta and is now a new recipe I can add to my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nita Longo Weimer"
},
"reviewBody": "I used half the butter, chicken broth instead of wine and half the cayenne. Plus broiled a few minutes. Killer recipe! Def use all the butter called for if serving over pasta or noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Excellent - will be making it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ImJakesGirl"
},
"reviewBody": "I used the most helpful positive review to make this dish. I used less butter and would probably use less lemon next time. I opted for not using the cayenne pepper, but would try it next time. Served with spaghetti noodles and alfredo with vegetables. Everyone seemed to like this - especially Jake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurieggg"
},
"reviewBody": "Only used half the butter and broiled the last few minutes to crisp up the bread crumbs. Love this dish. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Micki"
},
"reviewBody": "This was good. Followed the recipe exactly, but wondered why the pre-boil for the shrimp. Next time, I'll omit that. Served this over angel hair pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carey"
},
"reviewBody": "This was a very good recipe. I followed another users suggestion and did not pre-cook the shrimp. I added it raw to the melted butter mixture. I omitted cayenne pepper and used seasoned salt in its place. I then added some olive oil to the bread crumb mixture before putting the crumbs on the shrimp. Definitely will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharris18"
},
"reviewBody": "Glad I checked the comments because cayenne would have killed this dish. We didn't cook the shrimp and left out the cayenne. It was amazing over angel hair pasta and homemade Alfredo sauce. One of our new staple meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOSTRESS"
},
"reviewBody": "I made this without the lemon juice and cayenne pepper since I didn't have any and used chicken broth instead of wine. I also added enough bread crumbs to the butter mixture until nicely moistened and tossed the shrimp in the butter mixture so the entire shrimp was coated with the breading. It was delicious! I'll be adding this to my list of things to make when I have guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOSTRESS"
},
"reviewBody": "I made this without the lemon juice and cayenne pepper since I didn't have any and used chicken broth instead of wine. I also added enough bread crumbs to the butter mixture until nicely moistened and tossed the shrimp in the butter mixture so the entire shrimp was coated with the breading. It was delicious! I'll be adding this to my list of things to make when I have guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sourgirl"
},
"reviewBody": "Awesome! Didn't change a thing and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samule Stevens"
},
"reviewBody": "I omitted the pepper, too spicy !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "This was to die for! I did what another lady did and i looked up that butter lemon herb pasta recipe to go with this and man, this whole thing was delish! My kids ate it standing up, before they sat down at the table. I thought what another lady wrote that now her boyfriend thinks she's a good cook, was so funny and quite true. Make it for someone you love and they will think you are a great cook! Oh yeah, i did cut down on the cayenne pepper as other people said it was too spicey. Also, I did not cook the shrimp beforehand, and just kept the dish in the oven for longer than what it called for. This time I used the exact amount of cayenne, for the kick. Do not skimp on the lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dpassar"
},
"reviewBody": "I made it as some suggested without cooking the shrimp before putting it in the oven. I think could do with less butter but overall it was a fantastic easy dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Rowen"
},
"reviewBody": "loved this as written...can't stand the reviews that changed everything and loved it. I'll add add garlic salt next time and red pepper flakes. I served mine over angel hair pasta with lemon, lemon zest , olive oil and parm cheese. Sopped up any extra garlicy butter with some lightly toasted garlic/parm croutons"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smilingkevin"
},
"reviewBody": "I made it with a little different seasoning, based on what was available, but it turned out good. The only issue, though it was a big one, was the bread crumbs. Perhaps my crumb size was too small, or the amount just a suggestion, but the amount specified was WAY too much. I put it on and it just made big clumps that soaked into the sauce. Not blaming the recipe, just something I won't do again next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nancy Schneider"
},
"reviewBody": "I did not care for this recipe. Too much butter, too much bread crumbs, too spicy and definitely not enough lemon flavor. Not anything like any shrimp scampi I have ever eaten."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/229959/baked-shrimp-scampi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/229959/baked-shrimp-scampi/",
"name": "Baked Shrimp Scampi"
}
}
]
}
}
, "about": [
]
}
]