				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baked &#34;Fried&#34; Rice"
,"datePublished": "2019-03-27T01:44:02.000-04:00"
,"dateModified": "2023-02-01T15:23:43.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Chef John&#39;s baked &#34;fried&#34; rice will satisfy your cravings for true fried rice, and it doesn&#39;t require leftover rice. Perfect clump-free texture every time!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0wI3lQ2HB_snXJIF9KJ7xX7t6nM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6493028-baked-fried-rice-Chef-John-1x1-1-d72cf1a84b11431f9744220064ff9968.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6018934032001",
"description": "Comes out perfect every time!",
"duration": "PT6M59S",
"name": "Baked \"Fried\" Rice",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/3b81ede9-d4dc-4f01-ae8c-da460140c344/191b7e34-a03d-4582-870a-5005ee10f86b/1280x720/match/image.jpg",
"uploadDate": "2022-10-29T20:54:59.094-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baked &#34;Fried&#34; Rice"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "62"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "361 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "14 mg"
,"fiberContent": "2 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "1351 mg"
,"sugarContent": "3 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 cups long-grain white rice",
"2 tablespoons canola oil",
"1 tablespoon sesame oil, or to taste",
"1 cup diced ham",
"0.5 cup sliced green onions",
"0.5 cup diced red bell peppers",
"0.5 cup diced carrots",
"0.5 cup green peas",
"3 cloves garlic, crushed",
"1 pinch salt",
"3 cups chicken broth",
"3 tablespoons soy sauce",
"2 teaspoons chile paste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place rice in an 8x12-inch baking dish. Drizzle in canola and sesame oils, then toss rice until completely coated. Add ham, green onions, bell peppers, carrots, peas, garlic, and salt. Stir until well combined."
} ,{
"@type": "HowToStep"
,"text": "Bring chicken broth, soy sauce, and chile paste to a boil in a saucepan over high heat. Pour broth over rice and stir briefly. Cover the baking dish tightly with heavy-duty aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 32 minutes. Remove and let stand for 10 minutes. Increase the oven temperature to 475 degrees F (245 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0wI3lQ2HB_snXJIF9KJ7xX7t6nM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6493028-baked-fried-rice-Chef-John-1x1-1-d72cf1a84b11431f9744220064ff9968.jpg"
}
]
,"text": "Carefully remove the foil and fluff rice with a fork. Taste and adjust seasoning. Return to the oven and cook until rice is browned and crusty on top, about 10 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Korte"
},
"reviewBody": "I do a soft scramble of some eggs so that after it's done resting for the 10 minutes after it comes out of the oven I mix that into The fried rice. Then I stick it back in the oven at 475° for the 10 minutes. The whole family loves this. The egg makes a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wildchild55"
},
"reviewBody": "Chef John's recipes are inspiration for me. I wanted the ease WITH the leftover rice factor so I cooked the rice with the oils, broth, garlic, soy sauce, and chili paste. Fluffed it and stored it in fridge. Sauteed the veggies and finished it all off with the rice under the broiler, spread out on a sheet pan. Perfection! Plus, I can increase everything for a crowd. Of course if I'm in a hurry I'll use the recipe as written as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy M"
},
"reviewBody": "This is absolutely GREAT! I did opt out on the chile paste. I also had \"seconds\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cjdj"
},
"reviewBody": "Very bland. I didn't think it tasted like the restaurant version. It was very easy to make. I added a little more sesame oil, and added oyster sauce after I tasted it, hoping to get a little more authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "techstu63"
},
"reviewBody": "Wow, this turned out exactly like restaurant fried rice, actually even better! I made it as written with no changes except I decided against the chile paste but I can see where the vegetables or meat could easily be switched out. This is going to be in my rotation for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHardy"
},
"reviewBody": "I love this recipe! I make weekly and take to work for heat up lunches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lee"
},
"reviewBody": "very tasty but a lot rice stuck to the bottom of the dish, must spray first"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Olah Galla"
},
"reviewBody": "I've made this several times. I freeze leftover BBQ ribs, then use it in this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMcClure"
},
"reviewBody": "My family loves this - what an easy meal! I add chunks of grilled teriyaki chicken (slightly undercooked) when I stir it all together. Baking completes the cook on the chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geodiva"
},
"reviewBody": "Yum! I used what we had on hand and kept it simple since my kid hadn't had fried rice before. I subbed canned chunk chicken (chopped fine) for ham, minute rice for regular, omitted the vegetables, 3 tbsp canola oil instead of sesame due to allergy issues, 1.5 tbsp light soy sauce, hot sauce for chile paste, and added fresh ginger to the sauce (and strained it out before adding to the rice). Even with all that, this was fantastic! Definitely a flexible recipe and a keeper. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I used bacon bits since I had no ham or other protein to add. I was disappointed in that the rice was still crunchy after the 32 minutes in the oven. I think that the problem was that I did not have the large heavy duty foil and only had the regular width. Consequently, even though I thought I had wrapped it tightly, I had not. I ended up putting it back in the oven twice more and ended up using nearly a cup of extra broth. It was a bit mushy but tasted okay, although my husband said it needed more flavor. I did not have chili paste to add, so I used a bit of tomato past with some Frank’s hot sauce in it (about a tablespoon). I would use more vegetables in it. I would like to try this again with some real chili paste and wider foil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Bayliff"
},
"reviewBody": "This is a hit! I LOVE fried rice from a restaurant and didn't really think I could make it as good in my own home. WITH THIS RECIPE, I CAN! My family loved it. Thank you for sharing this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Ravas"
},
"reviewBody": "This recipe was wonderful! The rice was cooked perfectly. I used left over pork chops instead of ham. I did not have bell peppers. I used left over fiesta corn, added some finely chopped fresh ginger and sautéed the veggies a little first like others had suggested. I chopped them fine enough, I think I could have skipped that step. Can’t wait to make this again! This would work with any kind of left over meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenrockefeller"
},
"reviewBody": "This dish was so easy to make and was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Dice Smith"
},
"reviewBody": "I have been baking my rice for years. It works so well and is an easy way to get great rice. You can add items like this recipe does or just cook the rice for another dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChemistryMama"
},
"reviewBody": "This recipe is just as easy as Chef John says! The only change I made was using an equal volume of unthawed frozen veggies (peas, carrots and corn) in place of the peas, carrots and red pepper. It came out perfect and was an easy way to use up the last of a cooked ham I had in the fridge. I will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "A huge hit!!! Followed exactly as written; baked in 9x13 and since veggies were minced, came out of the oven perfectly! PERFECT! Very flavorful stand alone but made to pair with Sweet Korean Crispy Chicken from the site. My dinner guests couldn’t get enough! As always Chef John! Another winning recipe that makes into my “repeat!” rotation!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "Made half this recipe but had to substitute, since I did not have some things at hand. I used half of basmati rice and half long grain rice, chopped onion instead of the red peppers and green onions. I did not have sesame oil, so omitted it. I had to omit the red pepper flakes due to intolerance. Still, in the end this recipe was very good, tasty, fast to prepare and bake. I made it in a 2qt dutch oven and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TEBB48"
},
"reviewBody": "I really wanted to like this recipe, but it was awful. I used low sodium soy and did not add any salt to the recipe, but the end product was TOO SALTY . Waste of time and food. If you include chicken broth and soy…..no surprise here. Don’t bother making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "friddlester"
},
"reviewBody": "Absolutely delicious. The easiest fried rice I’ve ever made, and far and away the best, even using ham.\n\nEnded up adding more soy sauce at the table, but nobody at the table didn’t have at least seconds. Fantastic base fried rice, imagine experimentation will be easy and I’m looking forward to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LHDunning"
},
"reviewBody": "Loved this recipe! It was very flavorful, and both the rice and veggies were perfectly cooked. I used a 13\"x9\"x2\" glass baking dish and followed the recipe except for using 1/2 cup white onion that I had on hand instead of green onion. I also used two entire 14.5-ounce cans of chicken broth (one was 40% less sodium), a little more than the 3 cups called for. Without cutting back on any of the vegetables, I added 1/2 cup each of chopped water chestnuts and bean sprouts. The water chestnuts added a nice crunch. Next time, I am going to add a couple of scrambled eggs at the end \"fluff rice with a fork\" step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "Simple and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Destiny M Hayes"
},
"reviewBody": "Made exactly as is and it was great! Would make again. Instead of green onion, might add chopped white onion next time just because I like the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly McNulty"
},
"reviewBody": "Oh my gosh this was delicious. Followed recipe as written. Came out perfect. Did not do the egg. The chili paste gave it some heat which reminded me of my favorite Thai fried rice. Best thing was I had all the ingredients on hand. A definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Mailloux"
},
"reviewBody": "This dish is so delicious! I didn’t add the ham as I served it with chicken. So versatile that you could add different meat options. This is now a definite go to recipe for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Kromer"
},
"reviewBody": "Really simple and really good. Made it just as the recipe said. My family loves it! They ate the whole thing. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Day"
},
"reviewBody": "I thought it turned out well. I didn't have chile paste, so I added about 1 teaspoonful of Louisiana Hot sauce. I also added some ground ginger. Instead of ham I diced some leftover pork chops, which were good. I also used yellow onion instead of green onion and some frozen mixed veggies. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kris Hodges"
},
"reviewBody": "Well, it wasn't as greasy as I thought it might be but there is way too much rice in this recipe. I used turkey kielbasa and low soy sauce. I scrambled two eggs and used frozen peas &amp; carrots that I cooked before adding to the dish in the last stir. Oh and I added a couple of teaspoons of Frank's Wing sauce instead of the chili paste. My husband said it was tasty and I thought it was good but stirring all that stuff in a 7 x 11 inch baking dish was a real mess. I'm not sure I'll ever make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Zimmer"
},
"reviewBody": "This is so much easier than regular fried rice.I added raw shrimp and bean sprouts for the final few minutes instead of using ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "blackhighheels"
},
"reviewBody": "I really wanted to love this, but I didn't. The rice cooked unevenly and the flavor was a little flat for me. The fried egg did help the overall taste, but there was no redeeming the grains of undercooked rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Jo"
},
"reviewBody": "Made it last night, only changes were more sesame seed oil (we love the flavor!), no meat (didn't have anything thawed out), and added chopped bok choy. It was delicious and tasted just like fried rice!! The grains were flavorful and tender. Will come back to this one often!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodger Dodger"
},
"reviewBody": "I made this exactly in accordance with the directions. It was very good. I will make this again with one change: I will add a thicker honey glaze at prior to serving. Otherwise, a very nice flavor which is not too bold. Many thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "My husband loves fried rice and Thought this was better than most restaurant versions. I’m going to add chicken next time and make it the main dish. I may put in more vegetables too. I only had Mongolian fire oil and it was fine in place of sesame oil and chili paste. I planto use this recipe often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimski"
},
"reviewBody": "Less beans and added kielbasa"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Meredith Seiler"
},
"reviewBody": "Loved it! Doubled the ham and didn't have chili paste so I added 12 drops of sriracha and 1/2 tsp red pepper flake. Didn't even realize I missed the last step. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jekl"
},
"reviewBody": "Thanks, Chef John, for another fantastic recipe!!\nMade according to recipe, except substituted a diced onion for the green onion as I didn't have any green onions on hand. Worked perfectly and was delicious! Family was raving over it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joannie Dueck"
},
"reviewBody": "Oh my goodness ! We are big bug fans of fried rice in this house. Due to some physical problems I am not sure to stand at the stove and work through the process of making fried rice. It is a LOT of work !! NOW.... because of YOU.... we can have it as often as we please. So easy. So tasty. So so wonderful ! Thank you so much for doing all the leg work for us and bringing such a fine dish to our table. The only thing I changed was I added a lot more carrots because we like carrots ! And I think next time I will scramble eggs and add them after it is done. Just because we like it. But really..... it is just the best ! Oh wait ! I did do another change.... instead of chicken broth I added a PHO broth from Campbell's. It added a nice Asian flavor. I apologize.... I meant to take a photo to add. Next time. THANK YOU !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Young"
},
"reviewBody": "Chef John is amazing. We’ve been watching his You Tube videos and I’ve tried about 8 of them now. Each has been better than the last. This was a hit with my WHOLE family. This is miraculous because I have 3 picky teenagers. Super tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey E"
},
"reviewBody": "Delicious dish, not authentic fried rice like my Korean mom would make, but good and easy none the less. I used chopped regular onions instead of green onions, and a small bit of frozen mixed veggies as well. Family all liked it too. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "D Kitchen"
},
"reviewBody": "Nice flavor, but it's missing something. Making the dish with brown rice is also a bit tricky - more liquid and time needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATE_B"
},
"reviewBody": "I wondered if 3 cups of liquid was correct... it was perfect. We used it as a side dish, so omitted the ham. We loved it - thanks for the fun recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naturelover"
},
"reviewBody": "Excellent! Another hit. Wouldn't change a thing. Thank You again Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Madden"
},
"reviewBody": "was very tasty and easy and i will make again. wasn't enough water/broth but i was able to easily fix it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vandergoogles"
},
"reviewBody": "Fantastic method for fool proof fried rice. I have also used this method for Indian, Middle Easter and Malaysian style as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Alora"
},
"reviewBody": "So easy. I add in about 1/2 lb of baby shrimp w/ the BBQ pork and my kids love it. Every time I make it, they always ask for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Baines"
},
"reviewBody": "AMAZING!!!!!!!!!!!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LauraF"
},
"reviewBody": "This was SO easy and really delicious. I would definitely try it with different variations; this time, I made it as the recipe as described but omitted the peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rocknroller"
},
"reviewBody": "Heed Chef John's wise advice--make Chinese BBQ pork ( Char Siu--recipe on this site ) and DOUBLE / TRIPLE the sauce that recipe calls for, for both the meat AND to pour ONTO your fried rice while you fluff it with a fork. Char Siu and THIS \"fried rice\" dish are a pair that indeed work well together. You'll get both that Asian restaurant fried rice texture and TASTE, that gets friendly with the Char Siu---and both together make one great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathybush"
},
"reviewBody": "Excellent- followed the recipe but cut it half for smaller serving. I did cook one omelette egg on the stove, cut it up and put in the finished dish. Will make again! Served with home made egg rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leanna Good"
},
"reviewBody": "Made this for my husband and I, it turned out excellent. I'm a huge fan of fried rice and now I don't have to go to those buffet places to get it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "Used water instead of broth - still came out good but I think it would have been better with the broth. Also sauteed the vegetables beforehand as other reviewers suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darthjen"
},
"reviewBody": "I don't think I've submitted a review on the site before but this was so delicious that I felt compelled to finally write one. I didn't change a single thing about this recipe. It's perfect. Did everything and followed both the recipe and video- including the egg on top with spices, more sesame oil and green onion for garnish. Going to make it again soon but try out chicken instead of ham for something different. Thank you so much Chef John for such a tasty recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "palsquared"
},
"reviewBody": "Excellent! Lots of leftover ham from Easter and this recipe fit the bill. Easy, quick and delicious. Used mixed vegetables for a low prep version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roland Davis"
},
"reviewBody": "I made it using the exact recipe but I did add a tsp of dashi (soup base). The dish came out perfect and delicious. I really recommend using the chili paste as it gives it a extra flavor profile. Dashi can be found on Amazon and in Asian groceries. This is a perfect solution when you don't have leftover rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stjchurchcook"
},
"reviewBody": "Chef John hit another home run! This is wonderful! I followed the recipe exactly and we loved it. I was a little worried about the amount of sesame oil but it was perfect. I can imagine using rotisserie chicken or roast pork instead of the ham with the same results. This tastes better than home-made fried rice and there is very little mess to clean up. Hubby gave it a thumbs up and can't wait to have the leftovers with the poached egg on top. Thanks for another great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This was very tasty and very easy to make. I did 1 tsp Chile paste because I was nervous 2 tsp would be too spicy, but it was not spicy at all. I also only had canned peas, so I threw them in before the last 10 minute browning part. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patty Villeneuve"
},
"reviewBody": "Being Japanese , I never would have thought of BAKING fried rice, but it turned out very well. The only thing that I did differently was sautéed the carrots and onions a bit prior to adding to rice and meat. Otherwise pretty pleased."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/272494/baked-fried-rice/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
"name": "Rice Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14364/side-dish/rice/pilaf/",
"name": "Pilaf"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/272494/baked-fried-rice/",
"name": "Baked &#34;Fried&#34; Rice"
}
}
]
}
}
, "about": [
]
}
]