				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baked Pork Spring Rolls"
,"datePublished": "2000-07-08T18:52:55.000-04:00"
,"dateModified": "2023-03-01T17:40:38.677-05:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "Try this pork spring roll recipe for delicious spring rolls filled with pork, vegetables, and spices. They&#39;re perfectly crunchy but not deep-fried!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z8g5EQT6LOE1RQJdKgpJmJi6LWU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2333-baked-pork-spring-rolls-LynnInHk-4x3-1-ec18b0a33bd64cf39776d408b9bcaf81.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baked Pork Spring Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "373"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "154 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "15 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "201 mg"
,"sugarContent": "0 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 pound ground pork",
"1 cup finely shredded cabbage",
"0.25 cup finely shredded carrot",
"2 green onions, thinly sliced",
"2 tablespoons chopped fresh cilantro",
"2 teaspoons grated fresh ginger root",
"0.5 tablespoon oyster sauce",
"1.5 teaspoons minced garlic",
"1 teaspoon chile sauce",
"0.5 teaspoon sesame oil",
"1 tablespoon cornstarch",
"1 tablespoon water",
"12 (7 inch square) spring roll wrappers",
"4 teaspoons vegetable oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Cook pork in a medium saucepan over medium-high heat until browned and crumbly, 5 to 7 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Transfer pork to a medium bowl. Mix in cabbage, carrot, green onions, ginger, oyster sauce, garlic, chile sauce, and sesame oil until well combined."
} ,{
"@type": "HowToStep"
,"text": "Mix cornstarch and water together in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Place about 1 tablespoon pork mixture into the center of a wrapper. Roll wrapper around pork, folding edges inward to close. Moisten fingers in the cornstarch and water mixture, and brush wrapper seams to seal. Repeat to make remaining spring rolls."
} ,{
"@type": "HowToStep"
,"text": "Place spring rolls, seam-side down, onto the prepared baking sheet. Brush with vegetable oil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until hot and golden brown, about 20 minutes, turning halfway through if desired for crispier rolls."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Snyder"
},
"reviewBody": "Turned out fantastic, I used egg roll wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "El Conquistador"
},
"reviewBody": "It was good but a bit much pork to cabbage for my taste. Second try I quadrupled the cabbage and doubled everything else for the same amount of pork. Added bean sprouts and some diced up water chestnuts for texture. That was good and the pork wasn’t overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janine Fairley"
},
"reviewBody": "This was not for me. They came out chew and not with the flavor I was hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Yes I made changes. I added water chestnuts, bamboo shoots, and bean sprouts. I cooked all my vegetables. They turned out great, my family raved about them. I will make them again, but they are time consuming, certainly worth it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandycritz"
},
"reviewBody": "Really good. Could us a little more ginger. Also, don't put too much oil on them before putting in the oven. I also turned them once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jintu Thomas"
},
"reviewBody": "Great recipe. I added one teaspoon of soy sauce and for Chile sauce I added sriracha. The one thing I would play around with next time is temperature of the oven. I think a lower temperature setting might be better because i took it a few minutes early or it would get more burnt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "The baking method worked out wonderfully. We love the crisp exterior of the egg rolls. I filled each egg roll with 1/4 of the flavorful mixture, a tablespoon of the mixture just seemed too small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Madden"
},
"reviewBody": "Love this and its my go to mix. I wrap it in rice paper wrappers to make it gluten free. I dont cook the wrappers though because they fall apart. We mix sweet chili sauce into the mix for a little extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie in Florida"
},
"reviewBody": "I substituted shiitake and oyster mushrooms for the pork, sauteed with the ginger and garlic.. it was delicious. It's a keeper, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ravi Benjamin"
},
"reviewBody": "Super EASY........People Just DO it !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mnpnj"
},
"reviewBody": "Made shrimp and made pork, both equally delicious!! I did use the wrong kind of wrapper which was bad. These were easy to make and even my husband who doesn't like Spring Rolls loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cojoto"
},
"reviewBody": "Pretty good for something different--very fun to make! I used egg roll wrappers instead of spring roll wrappers--I don't know if there is a difference or not. They came out a little tough but had a good flavor. I used Panda Orange Sauce for dipping. Try them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "I substituted ground chicken and I was surprised at how well baking this way worked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "M C"
},
"reviewBody": "I basically followed the recipe, there were a couple things I skipped as I didn't have them. They turned out pretty good..the babies liked them, so it's a win!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BakeIt"
},
"reviewBody": "About the most misguiding recipe I have tried. From reading all the other realistic reviews, yes, egg roll wrappers would have been the right ones to use. The spring roll wrappers stuck to the foil and wouldn't come off. Using parchment paper did no better. And the result looking nothing like the picture at all. Wrong wrappers. the lack of instructions of how to use spring roll paper should have tipped me off to that.\n\nFlavor was good, but the executional instructions and one wrong ingredient is where this recipe goes to die. I am a professional cook. I followed this to the letter, and it failed. Absolutely do not recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nightfall"
},
"reviewBody": "These were easy to make and very delicious. My only change: omitting the cilantro because I can't stand the taste. Oh, and I did make these with various other proteins - smoked tofu, ground chicken - and it worked equally well. Just be sure to dice the tofu very finely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Ruderman"
},
"reviewBody": "The outcome was fantastic, but the presentation was difficult. When they say to brush the vegetable oil they didn’t indicate both sides, so the bottom stuck to the pan. Nonetheless it tasted fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leung"
},
"reviewBody": "The idea is great to bake instead of deep fry. It gives same crispness but save all the disadvantages of deep fry. Added to that, I now usually prepare 2-4 dozens a time because the wrap I buy is 2-dz a pack. Keep them in freezer. Then just bake the amount I want to eat at a time, even only 2-3 for afternoon snack. Much much more convenient &amp; healthy.\nI use a variety of filling. For savoury, I use yam/raddish/cabbage/potato, various mushroom, chicken/pork/shrimp, carrot......\nI even made with my leftover chicken pie filling.\nI also made sweet rolls with banana, chocolate chips, chopped nuts &amp; season with cinnamon &amp; coconut sugar.\nI am thinking of using sweet potato/pumpkin with nuts &amp; cheese, fry glutinous rice......It's fun.....haha!!\nThanks a lot for the sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Conner"
},
"reviewBody": "This is fabulous. First time I baked and didn't care for it. This time I fried them because we like our wrap crisp. Baked isn't crisp but fried it terrific. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Seguin"
},
"reviewBody": "I did not try the recipe yet but I will I love the idea of cooking these in the oven \nWill try for sure. I usually never make changes the first time I try, and I can tell by the ingredients they will be awesome.\nIt is very good with red pepper jelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Evareneg"
},
"reviewBody": "Honestly, I was so exited for these. When I attempted to pull them of the tray they stuck and were served as \"deconstructed\" spring rolls. I served these with general tso's chicken and the flavors were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "baking-jay"
},
"reviewBody": "Bland, I used taco shells instead of spring roll wrappers but the suggested 1 Tbsp filling was laughable for those approximately 6\" round shells. I put about 3 Tbsp and could've jammed 1-2 more in. \n\nBesides that, the flavoring was really poor, it was very bland, no flavor, I ended up dousing my 'egg rolls' with soy sauce. I tripled the ingredients and have about 1/2 left after making 10 rolls. I doubled the oyster sauce and it is still really bland. I'm experimenting with adding more oyster sauce, soy, and clam juice to give it flavor.\n\nBasting the shells in oil none of them stuck to my pan after about 20-30 minutes at suggested heat.\n\nRecipe is a good basic start but before I made them the mixture was really clearly too 'dry'. I taste tested the mixture prior to cooking and it was bland but I gave it a go. My concern was proven after cooking and seeing they came out so plain and flavorless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Madeline"
},
"reviewBody": "Definitely will make this again, great mix of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amy w"
},
"reviewBody": "The only change I made was to use minced pork chop rather than ground pork. These are easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Steen"
},
"reviewBody": "These spring rolls are excellent! I was surprised at how crispy they became in the oven instead of deep fat frying them. I didn't have all the vegetables listed on hand, so I used the ground pork with chopped ginger, mushrooms, onions, and green peppers. They even taste good cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynsey Justice"
},
"reviewBody": "I made this recipe using egg roll wrappers and sweet Italian pork and it turned out fantastic!! Very simple recipe and so much better than deep frying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kuypers5"
},
"reviewBody": "Loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jot"
},
"reviewBody": "Made these following the recipe and didn't care for them baked. The wrapper had an unusual texture and it wasn't as good as having them fried. The filling was tasty but next time I will definitely fry them. Dissapointed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "Made the recipe as is except substituted chicken for the port. The flavor was wonderful, although I had an issue with the wrappers sticking to the pan which I think I can fix using a baking stone instead of a cookie sheet.\n\nRound wrappers worked just fine for this as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcin Kowalski"
},
"reviewBody": "Perfect! I used fish sauce just because I had no oyster sauce at the moment. Still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "I love this recipe and so does everyone that tastes it. I like it a bit spicier so I add more chile sauce. The only issue I have had is that I cannot get it to look like the picture - crispy and brown. Mine remain translucent. Any suggestions for getting them to look more like the picture?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Louise"
},
"reviewBody": "Excellent! Double the recipe and add more chile sauce and it's perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Workman"
},
"reviewBody": "Couldn't find spring roll wrappers in my store. Only egg roll wrappers, gyoza and won ton wrappers so I used the egg roll wrappers. I filled them full because they are bigger than spring roll wrappers. \nCrispy and very tasty! A bit too much ginger and I'll cut back on the chili sauce too but this has become my go to 'Roll' recipe. It's pretty easy and you can use different meats too. Thank you Rayna for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bracdiver"
},
"reviewBody": "Great recipe! A question for the community, mine come out translucent and not as crispy as expected, quite different than the photo in th recipe. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sharon Arnst"
},
"reviewBody": "I really liked these,hubby not so much . I think I might have used to much cornstarch mixture to seal the edges. Next time I will use just the water to seal the edges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joann"
},
"reviewBody": "Didn't make any changes. Hubby and I loved them. Didn't turn out as pretty as the picture, but tasted great. Will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LBME"
},
"reviewBody": "I didn't make any changes. I did serve it with a sweet chili and sesame oil dipping oil. They are better fried than baked, but you gotta keep those fat calories down where you can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitney Grace"
},
"reviewBody": "Incredible - such a good and easy recipe. I can't cook and I was able to make this wonderfully. I used ground lean turkey and I used a whole 1 lb. of meat instead of the 1/2 lb. it calls for. I used about 1.5 C of cabbage and 1 C of carrots. I just about doubled everything, including sauce. I added an entire handful to each roll and then rolled them. I skipped the cilantro and didn't use it. They were good sized and filled up my family. I double-layered my wraps (helped them be super duper crunchy) and I dipped them in sweet chili sauce. They were spectacular and I will definitely be making these again! I'm thrilled with this recipe. Easy - cheap - healthy - and good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Tipsy Cook"
},
"reviewBody": "Absolutely delicious! I only made a few minor changes to make it a tad healthier. Instead of ground pork I used ground turkey and I swapped the cabbage for spinach. Oh and I didn't have oyster sauce so I just used soy sauce and can't believe how good these are! Paired so nicely with my homemade wonton soup :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aimeelynn"
},
"reviewBody": "Yum, this was great! Added more of pretty much everything, because we like lots of flavor, but that's what works about this recipe, it's a great base to customize. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carole"
},
"reviewBody": "I have made these as written and they were great. Possible tips:\nLet them sit for at least 15 minutes before baking, I have found sealing the rice papers with the starch was unnecessary, I used a meatball scoop to fill the paper, I had my husband chop everything first (that makes a real timesaver for me)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sks61"
},
"reviewBody": "Total disaster!! Flavor was good but the spring rolls stuck to the pan and ripped apart. Should have not baked them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMC"
},
"reviewBody": "Awesome recipe. To make it easier I doubled everything and used a 14 oz bag of coleslaw mix with cabbage and carrots. Use two tablespoon for filling in 10 inch lumping rolls (30ct). Also cooked about an extra 5 to 10 minutes as they tended to get a bit soggy after they cooled without the extra time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chloe McAllinway"
},
"reviewBody": "I liked it. I added a bit of hoisin sauce to the mix and skipped on the oyster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "food friend"
},
"reviewBody": "I have made these twice. The first time I used egg roll wrappers because that is what most of the pictures are using. Spring roll wrappers are very thin and brittle, they have to be softened in warm water for about 20 seconds. The ones I bought are about 10 inches and round. Egg roll are usually rectangular and wonton wrappers are small circlers. They are both more doughy/soft than spring roll paper so they are more pliable. Both the wrappers work for the recipe, so use whatever you like or can find. I like this recipe. You can substitute ground turkey for pork and soy sauce for oyster sauce. I skip the cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "becky24"
},
"reviewBody": "I really enjoyed these springs rolls. They are excellent as written and are also a good base to work off of in order to suit each persons tastes. Next time I will make these with ground chicken"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Baked Pork Spring Rolls Haiku: \"'Guts' of these were GREAT, I'd make those and eat alone, and just skip the 'rolls.\" So I followed the recipe exactly and did end up w/ more filling than I could use for rolling (which incidentally, I had to do w/ Natsoya's egg roll wrappers, as that's all that I could find at my 4 nearby grocery stores, but I should've taken my Dad's suggestion and just asked at one of the way more than 4 nearby Chinese restaurants if I could buy spring roll wrappers from them!) Anyways, the filling was SO good and I actually liked the extras of it better spooned over rice, rather than the trouble of rolling and baking. (And absolutely, fried would've been much tastier, but the recipe is for \"baked\" and that's what I did.) I'm so glad that I tried this though b/c I've never prepared spring or egg rolls b4!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda McKee"
},
"reviewBody": "So good! I used a pound of pork since that's what I had and extra sesame oil. I also used coleslaw mix like other reviewers said and they turned out fantastic! I don't know if anybody else had this issue, but the first test batch I did stuck super bad to the pan. I sprayed it with non-stick spray and they were perfect. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vettle"
},
"reviewBody": "This is excellent. I actually had some ground turkey that I wanted to use up so I used that instead and it was still so good. I used coleslaw mix too! I also didn't have green onion and I omitted the cilantro (the husband doesn't like it). I think that I would have enjoyed the cilantro but I can see how it would overpower this if you don't LOVE it. I brushed them with oil after flipping. The only thing that I noticed happening was where I had moistened it with the cornstarch became thin when baking and some of the filling came through. But I probably over-filled them :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AHunt"
},
"reviewBody": "Reduced the ginger to half and it was perfect!! Made it using 2tsp and it over powered all of the other flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JLC"
},
"reviewBody": "My whole family disliked the strong ginger taste that these had. I made them vegetarian, but would either cut the ginger out or down significantly next time. Everything else worked out ok. I'd try it again, but with modifications for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail"
},
"reviewBody": "They were great! The only critical part in making these is soaking the wrapper for the exact time before putting in the filling. Not enough time and the wrappers are tough, and too long and they rip. Just a matter of practice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sastowers"
},
"reviewBody": "Absolutely great recipe!! I waited to try this as I'm not a baker, but on a rainy day, thought I'd give it a try. My greatest challenge was figuring out with the tools I had how to determine chopped, diced, finely sliced and minced....typical man!! Thank you for the Internet!! Because I knew nothing about the spring roll wrappers, I screwed my 2 test rolls up before I looked up the directions on how to handle the rice wrappers. After that no problem. Didn't have chili sauce, so made my own using chili powder and water. If I can con someone in the family into bringing ingredients next time, I'll bust some out for football season and look like a hero!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "Soooo disappointed. I was wanting to L O V E these, but it didn't happen. I'm not reflecting the wrapper problem (Nasoya brand) in the review, only the filling. That opinion is mostly from the wrapper side of things. They came out overly crispy at 425 (wrapper pkg said 400 btw) &amp; somehow stale - eventhough crispy. Filling: Ho-hum with ginger. I followed the recipe except used a little less garlic since I had garlic chile sauce. Pkg said to cook filling first. I cooked the pork, just didn't cook longer after adding additional ingredients. One T filling isn't enough. :/ I don't know why I didn't like these more. I love the idea. I wanted to. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hungry Bear"
},
"reviewBody": "Very loosely followed the recipe... didn't have the carrot, green onion, oyster sauce, or chili sauce... so I made something more like a cousin to this recipe. And it was REALLY good. I made my own spring roll wrappers (tedious but very cheap as they only require flour, water, and salt). I used equal parts melted red pepper jelly, soy sauce, and rice wine vinegar to dress the veggies in the mix, added jalepenos and red onion, and cooked the meat in hoisin and honey. \n\nCooking it in the oven was a fantastic tip. They were lovely and crunchy and served as an excellent surprise for the other hungry bear in my life :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bailey Jones"
},
"reviewBody": "Well I obviously did something wrong when it came to the baking, because mine did not look like the pictures! None of them really baked up very well and they got stuck to the pan so I could flip them halfway through. I greased the pan, too. Maybe need to go for something a little more die hard and greasing with EVOO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy D"
},
"reviewBody": "Great flavor and crunch. So much healthier to have a baked roll instead of fried. The spring roll wrappers from our nearby Asian market were a little hard to work with for beginners. The rolls stuck to our teeth; I'd use egg roll wrappers next time. We eliminated the oyster sauce (due to shellfish allergy) and cilantro and they came out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LoreleiLee"
},
"reviewBody": "The supposed use of spring roll wrappers (rice paper) is very deceiving. I used authentic rice paper, which is the traditional spring roll wrapper. f you do this, it becomes a complete mess after baking. The wrappers are all gooey and only the corners crisp up. I had to empty all of my spring rolls (after I attempted to bake them in the rice paper) and start over again- with egg roll wrappers. These worked perfect. The filling is very good, but the ingredient list should be altered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randal Z."
},
"reviewBody": "Defiantly recommend flipping them after 10 minutes. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "I really liked the baking instructions. I used shrimp instead of pork, bok choy, some bean noodles, parsely instead of cilantro and no oyster sauce. I served them with Hot Sweet and Sour sauce. You can sub with what you like. My friends,husband, and self all loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jobil123"
},
"reviewBody": "Very good. Didn't take quite as long as recipe states to crisp up the wrapper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The key to these is in the wrapper. Too thick and they don't taste right. Get a thin wrapper and you won't be sorry. These were OK but I still prefer mine deep fried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jolley900"
},
"reviewBody": "filling was good but the spring roll wrappers I used SUCKED. did not bake up well at all. will try again with a different wrapper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KiWi"
},
"reviewBody": "Great easy recipe, I used bean sprouts left out cilantro and accidentally tipped more oyster sauce in but it turned out fine and tasty anyway :) They are fiddly to make but they dont have to look perfect, because they wont last long n the plate!\nI liked a 50/50 ratio of meat and veges maybe even 60/40 in favour of veges.\nI found the baking and turning once worked really well - nice and crispy, even without brushing with oil. I also cooked with the seam side down first and they kept their shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I like the flavour of the filling although I think it should be egg roll wrappers instead? There are so many kinds of spring roll wrappers. i used the Vietnamese rice wrappers and then baked it. Stuck fiercely to the baking pan! Should have known... Next time, I will use a different wrapper for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I have to say that I was a bit disappointed in this...The filling was delicious (I did add a bit of soy sauce also), but I think the wrappers called for are wrong. I used spring roll wrappers and they came out chewy, gummy and hard on the ends, which none of us liked. I would def try these again using egg roll wrappers, b/c I'm thinking that that is what's supposed to be used. Also, I doubled the filling and barely got 12, so maybe plan on doing that if you are wanting 12 of these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "draggar"
},
"reviewBody": "You can replace the port with some salad shrimp (cooked, 80-120 count or 100-200 count).\n\nI used egg roll wrappers and they came out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pixiejudy10"
},
"reviewBody": "Fun to make. I suggest doubling the recipe as it is still a lot of work. You could even make a party of it, like they do in China with dumplings. You can pretty much put anything you like in the filling. I like to use chopped shrimp for some and shitake mushrooms. I love cilantro, so I don't find the amount overwhelming, but if you do, you can vary it. I like the idea of adding more wet ingredients, as they can be a bit dry. I think they might freeze well also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "berrycreekgal"
},
"reviewBody": "My husband gave these a five. I loved the filling and they did turn out crispy. I found that the texture of wrap was slightly papery. I did take suggestion of using cole slaw mix which makes this doable in a shorter amount of time. I think I will make this again for a party. Tasty and healthier than frying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scover"
},
"reviewBody": "Delicious! I usually increase the recipe to make 75-100 (using wonton wrappers), and they never last long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terpchristina"
},
"reviewBody": "I didn't like them baked, but the filling is amazing and I'm sure it will be much better fried. PS: Cabbage down the garbage disposal is a BAD IDEA!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley"
},
"reviewBody": "Tastes great, less the greasiness. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "these were ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Tepley Letellier"
},
"reviewBody": "Made twice now. Once with pork and once with chicken. I used left over grilled pork chop and left over grilled chicken breast. I used my Vitamix to shred up the meat and all the vegies. Worked like a charm. Followed rest of ingredients. I did use Egg Roll Wrappers and deep fried. My friends and family all loved these and my husband says the best he's ever had. We used a store bought sweet and sour sauce for dipping. You won't be sorry!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Butryn"
},
"reviewBody": "These took me a lot longer to make than the recipe stated, but they were worth it. Very good, and all the kids tried them and seemed to like them. I made no changes to the recipe, other than doubling it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINDY_V"
},
"reviewBody": "These were really easy and so good. I used Hoisin sauce instead of Oyster sauce and they were fantastic. My husband thought they were better than the traditional fried in a pan kind. This is a keeper. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "Good the only thing I did different was to use coleslaw instead on shredded cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Gross Coutolenc"
},
"reviewBody": "These turned out great! I love Spring Rolls, but hate frying stuff. The beauty of this recipe is that they actually do taste like they were fried. Crispy but not heavy. I doubled the recipe. Used ground Ginger, because I didn't have fresh. Used the suggested cole slaw mix and came up with 24 egg rolls. I froze most of them so we can have for later. Thanks so much for a wonderful recipe. This is a keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mricha14"
},
"reviewBody": "Almost perfect...I felt it needed cooked rice vermicelli.\r\nFreezing: I doubled the batch and only cooked them for 1/2 the time. Defrosted on low in microwave then threw on a non-stick skillet with no oil until golden to recrisp. Double wrapping the rolls will help keep from tears if you like to pack them full.\r\nOverall, this recipe has so much flavor, they don't even need a dipping sauce. Very, very good and freezes great = 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori K"
},
"reviewBody": "Here's a no-bake vegetarian option:\nMy kids love these but I make them quite differently and they take about a third of the time.\nUse broccoli slaw or some other julienned vegetable mix from the grocery store. \nUse rice paper wrappers that you wet and then roll, do not need cornstarch, and do not need to be baked at all.\nIf you used a packaged vegetable slaw and frozen cilantro (same amount), you will want to double the sesame oil, oyster sauce and minced garlic. If using powdered ginger use only 1/2 teaspoon in place of 2 tsp fresh. Serve these with peanut dipping sauce or soy sauce. They are so good and keep well in the fridge for a couple of days.\nDon't try to bake the rice paper wrappers, they will fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tarapod"
},
"reviewBody": "My husband is from Vietam and he says these are as good as the ones his sister makes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I couldn't find spring roll wrappers so I used egg roll wrappers.... big mistake. The texture of the wrapper just wasn't right. I would love to try again with the right wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nissa"
},
"reviewBody": "These were delicious! My only mistake was I think I cooked a full pound of ground pork and they were very meaty. Today I am going to make them again trying to use the right amount of pork this time. One of my friends said they were better than the ones served at the sushi place in our city!! I did add some crushed garlic, soya sauce, ginger and sesame oil to the meat while frying it. And left out the chile, but I will be adding it today to try it. Overall, these were so delicious! OH! I also used RICE PAPER WRAPS instead of spring rolls wrappers (the won ton kind) and they were soooooooo yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "Fantastic! We use ground turkey instead of pork but these are a family favorite. We have them once a week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ecoe3"
},
"reviewBody": "very crispy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nutnum"
},
"reviewBody": "I did some in Phylo and some in rice paper for my son. Both where really good!! If you use the rice paper this become gluten free, dairy free and egg free!! Perfect appy for people with Celiac or allergies!! LOVE LOVE LOVE!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "5Foot3"
},
"reviewBody": "These were just okay. I did some as suggested by baking and one batch I fried. We both preferred the fried version. The baked ones were actually surprisingly crisper but not in a good way. The texture was off, it was like a paper thinness and just crunch, no flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JennG"
},
"reviewBody": "Made the filling for fried spring rolls and was very impressed. Will definitely try the baking method next time!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jali"
},
"reviewBody": "Excellent recipe. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "Super easy, and taste great. I will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bindu"
},
"reviewBody": "Love this recipe.. First tried it with pork and have to admit that i did fry and not bake but they were soo good... everyone ate them up.. \n\nMade them today for hubby's bday using ground beef.. I think it was more flavorful with the pork but i tend to add a lil extra spices here and there and that could have been the problem too.. couldnt remember what i put in the first time.. haha.. but still a big hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cynthia Hintz"
},
"reviewBody": "pretty greasy. hard to assemble."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie"
},
"reviewBody": "Very good, I used ground turkey instead of pork. For the cabbage I used a bag of Asian salad I got at Costco. When all ingredients were mixed in the bowl, the mixture did not seem wet enough, so I added some of the sesame dressing that came with the salad. They came out great, I may have used too much meat, next time I will use less meat and add more cabbage. Didn't miss the fried part at all, Thank for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "These are awesome! I made them for a party once, now I'm required to bring them every where I go! I make a double batch of filling, and use 1 package of egg roll wrappers (couldn't find the spring roll wrappers the first time). Works out perfectly! Still cook the same way, and I always turn the rolls half way thru cooking, or the bottom gets too brown. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "great, flavourful and much better choice than fried. made exactly as directed. Might try just spraying with PAM next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nancyw680"
},
"reviewBody": "These baked pork spring rolls were excellent and very easy to make. I made them for a neighborhood progressive party - I was in charge of appetizers. The spring rolls were very popular and disappeared quickly. I love the fact that they are baked and not fried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpiter"
},
"reviewBody": "We make them every week.\nI use 1 TBS Oyster sauce and 1tsp soy. I use Sriracha for the Chili sauce. To increase protein I add bean thread noodle and two eggs, with a shot of Sriracha, cooked as a thin omelet and cut into strips.\nWe eat 3, with some rice and salad, so we get two meals. If we made more to freeze, I doubt if I would eat anything else:)\nMy wife uses a commercial spring roll sauce and I make a sauce of i part cranberry sauce,1 1/2 parts white vinagar a splash of soy and Sriracha to taste. Heat sauce to blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nsynclpc17"
},
"reviewBody": "I did not care for this recipe. The filling tasted like that of a spring roll, but was very bland. The baking time was too long as mine came out burnt on the edges making for a crunchy shell with little \"chew\" to it. I like the combination of crunchy and chewey when it comes to eggrolls. Unfortunately I think baking them has missed the mark and might have to go with the unhealthy way of frying them so that they keep their flavor. Not at all impressed by this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TARIYORK"
},
"reviewBody": "My family really enjoyed these. I didn't have any oyster sauce, nor was I going to buy any and they still turned out pretty good. I made up some sweet n sour sauce for dipping."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/26706/baked-pork-spring-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
"name": "Wraps and Rolls"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/26706/baked-pork-spring-rolls/",
"name": "Baked Pork Spring Rolls"
}
}
]
}
}
, "about": [
]
}
]