				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Baked Beans from Scratch"
,"datePublished": "2020-03-05T00:05:50.000-05:00"
,"dateModified": "2022-07-22T07:05:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "wkndyummychef"
,"url": "https://www.allrecipes.com/cook/2897744"
}
]
,"description": "Baked beans from scratch are made by simmering navy beans in a rich sauce made with ketchup, molasses, Worcestershire sauce, and maple syrup."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ensbe5Y-RIFZ7O3701xIgQTZk38=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7982469-baked-beans-from-scratch-Lynda-Lukasiewicz-4x3-1-bec1a5073cd147bf873fd9d73690c61c.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Baked Beans from Scratch"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "130"
}
,"cookTime": "PT440M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "122 kcal"
,"carbohydrateContent": "26 g"
,"fiberContent": "5 g"
,"proteinContent": "5 g"
,"sodiumContent": "196 mg"
,"sugarContent": "12 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup navy beans, soaked overnight and drained",
"4 cups water",
"0.25 cup ketchup",
"0.25 cup maple syrup",
"2 tablespoons brown sugar",
"2 tablespoons molasses",
"1 teaspoon Worcestershire sauce",
"0.5 teaspoon salt",
"0.125 teaspoon ground black pepper",
"0.125 teaspoon chili powder",
"1 small onion, chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place beans in a large saucepan with 4 cups of water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Stir ketchup, maple syrup, brown sugar, molasses, Worcestershire sauce, salt, pepper, and chili powder together in a small bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Once beans have simmered for 1 hour, drain, and reserve cooking liquid. Pour beans into a 1 1/2-quart casserole dish; stir in chopped onion and molasses mixture. Stir in enough reserved cooking liquid so sauce covers beans by 1/4 inch."
} ,{
"@type": "HowToStep"
,"text": "Cover and bake in the preheated oven for 10 minutes; reduce heat to 200 degrees F (95 degrees C) and cook 6 hours longer, stirring beans after they have cooked for 3 hours. Once beans are tender and sauce has reduced and is sticky, remove from the oven, stir, recover, and allow to stand 15 minutes before serving."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT450M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easiest tastiest recipe for baked beans. Thanks for sharing. P.S. I baked the beans for just 3 hours and still it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "my costumers love it '"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby Legge"
},
"reviewBody": "Add mustard n Brown sugar instead of maple syrup also bacon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "slix1"
},
"reviewBody": "Advice on very low heat long cooking is good even if you use a different device. I think these are under seasoned and I have never make a bean recipe that didn't have at least a little fat. I frequently make baked beans from plain canned beans and used the seasonings I have settled on. This would be a good starting point for people are just venturing into beans"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adalton"
},
"reviewBody": "Very good sauce. It was a little sweet so I added a couple teaspoons of cider vinegar to balance that. I think my ketchup was the problem. It is one of the sweeter ones available. Otherwise, flavor was perfect. Recipe is going into my make this again file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "patrickaderr"
},
"reviewBody": "A good base to modify from. I would use less water during the baking and add if needed. Also, I would increase the sauce recipe by 50%."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "05robertdrake"
},
"reviewBody": "I smoked a hip of pork and I save bones , cutting them and saving them for the bean pot, That's the way my mother did on the farm ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "19frances37"
},
"reviewBody": "made it exactly as written. I love the flavor but I never met a baked bean I did not like. Only complaint is recipe said it makes 5 cups. I ended up with 3 1/4 cup so what is the serving size here? 1/3 cup? will definitely make again. I like 'soupy' beans and these definitely were."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Don Lawrence"
},
"reviewBody": "Followed directions to a tee, beans were still hard and not edible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KatyBakes"
},
"reviewBody": "Best Baked Bean recipe I've has since I was 16 and made my first. The only things I changed were the syrup, I used sugar free, and the long time cook temperature to accommodate my oven. I have recommended this recipe to afamily members and they love it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Trombley"
},
"reviewBody": "l reduced the maple syrup and added habanero pepper and a ham hock. So yummy! Even better as leftovers. I made a big batch and put containers in the freezer to use instead of buying a can of baked beans. We also cooked them on our wood smoker. Really great with the added smoke!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Peters Sheldon"
},
"reviewBody": "Excellent! This recipe is the closest thing to my traditional recipe from 40 years ago, which my husband loves. I omitted the ketchup and chili powder, as these were not in my original recipe. I also added a few strips of cooked turkey bacon, crumbled. Sometimes, I like to \"chunk it up\" with some sweet, diced breakfast sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lanny Greenberg"
},
"reviewBody": "I used this recipe as the basis for my desired dish, which included browned ground beef and chopped, fried thick sliced bacon. Very pleased with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene"
},
"reviewBody": "I made this for our vegetarian friend for the 4th of July. It was very good, a few people went up for seconds! Even my son who said he doesn't like beans, but, came to the conclusion that it must be the other sauces that he doesn't like, lol. The only thing I did different was used Great Northern beans instead of Navy and added 1/4 teasp of liquid smoke. I also cooked them in the crock pot with the lid open a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Grose"
},
"reviewBody": "Added some dry mustard, some apple cider vinegar and skipped the molasses but doubled the brown sugar and put some dark rum in the sauce to stand in for the molasses. At the baking stage, I put 3-4 bacon strips on top. Excellent recipe. However, definitely add an avid element to the sauce to combat the sweetness and uncover the beans and increase the heat to 400 for the last hour in order to cook the beans down to the perfect sauce thickness. Otherwise, I make this again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Lukasiewicz"
},
"reviewBody": "I will make again. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Brockette"
},
"reviewBody": "I made it and turned out delicious will saving this recipe in my favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debi"
},
"reviewBody": "I made the beans as directed. They turned out great and everyone loved them. My only complaint was they were too sweet, so I will probably cut some of the sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caerhl Irey"
},
"reviewBody": "Very tasty. I would add more onion and less moisture. 1/4\" over the top of the beans seemed too much. They were definitely better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Dobbertin"
},
"reviewBody": "Very good taste, I liked how thick they turned out. I also uesed a 1 lb bag of beans then I doubled the other ingredients I will triple the ingredients next time. Mine was not to sweet but I did add dry mustard, vinegar, and paprika as many suggested. When I served mine I added a small amount of smokey BBQ sauce to my bowl, I loved it. Beans weren't mushy, and very thick and hearty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rozi"
},
"reviewBody": "Delicious, will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Valley"
},
"reviewBody": "I added some left over brisket"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ClariceM"
},
"reviewBody": "I add ham, bacon, or a pork chop to add flavor. I also add garlic &amp; green chilies. When I make this I just use an entire bag of beans &amp; up the rest of the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DogGuyDave"
},
"reviewBody": "The sauce was great! I didn't have any molasses on hand so I just did extra maple syrup I also added a little more brown sugar to make up for the molasses. It still turned out very tasty! I will make again. I also used my cast iron dutch oven. I browned the bacon and did all the cooking of the beans in my cast iron then popped it into the oven for a one dish type of cooking. I love cutting down on the amount of dishes I have to wash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragoneyes"
},
"reviewBody": "Yummy, Yummy , Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Bamford"
},
"reviewBody": "I did add some mustard powder but other wise followed the recipe. It turned out great. I did do it in a slow cooker instead of the oven. One tip that my friend, who makes baked beans regularly, told me when the beans start to boil in the water to soften them to make sure they are the texture that you want before you put them in the pot with the rest of the mixture as they will not soften up much more during cooking. Also if, when the beans and water, start to boil turn the stove down so as not to spill over the pot but keep water at a nice boil with the lid removed. Watch the water but this will help with making the beans less gassy which is one complaint when it comes to eating beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimberly"
},
"reviewBody": "I skipped the molasses and subbed diced tomatoes for the ketchup, great northern beans for navy--because it's what I had on hand. I also added chopped bell pepper and ham leftovers. These turned out great! This is a fabulous base recipe that you can do anything to personalize. Even my daughter who hates beans loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Devin Thomas"
},
"reviewBody": "I loved this, but I made some changes.\nI didnt have any beans so I used tofu instead.\nIm allergic to molasses so I used artificial sweetener for coffee.\nThe only meat I had was some old Spam so i deep fried it and added it it to pot.\nI'm scared of pressure cookers and crock pots so I microwaved the whole thing.\nMy neighbor doesnt eat pork so I omitted any bacon or BBQ.\nMy kids don't like spicy so I didnt season it at all.\n\n\nHope ya'll get my point\nThis is a good starting point recipe, make adjustments and use common sense when rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Morita"
},
"reviewBody": "Loved this recipe, I did add a little cider vinegar after reading the reviews plus a little dry mustard and it wasn’t too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Ciuffo"
},
"reviewBody": "I added smoked pork neck bones to the recipe to the chicken broth water and the beans were superb. The were gobbled up\nBtw I used northern beans as that’s all I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Stefaniuk"
},
"reviewBody": "Easy!\nSoaked beans overnight, added crisped bacon, lots of onions. \nLeft lid off slow cooker at end to thicken up. \nYummmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Tripp Waldrop"
},
"reviewBody": "These taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna calloway"
},
"reviewBody": "I added bell peppers red green and onions and a little bit of bacon everybody loved it going to want in the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Haraldson"
},
"reviewBody": "HI. pretty good but have had better. left out the maple syrup. to get most of the gas out of the beans after they soaked over night and boiled for the hour I place the pot of hot beans in the sink and dumped in 3 to 4 heaping table spoons of baking soda into the beans. watch out as the reaction will cause the degassing of the beans will over flow the pot that is why i put it in the sink. stir the mixture to maximize gas removal. after the reaction is over dump the beans into a sieve to continue with the recipe. I also use a can of salt pork with most of the fat cut off and a large onion sliced thin. both these spread over the beans then spreading the sauce over everthing. this make it almost great. if you like a little more sauce taste in the beans make a little more sauce mix and before putting the pork and onions on top stir some of the mix into the beans and then put the pork , onions on top followed by balance of mixture. I guess i could say imdid not use much of the recipe and ended up using my grandmothers recipe which had some similarities. So in that case it is 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ElizabethSceviour"
},
"reviewBody": "Flavour was wonderful but despite extended cooking time they did not get as tender as I would have preferred. Think I will try in the crock pot next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GM Hutchings"
},
"reviewBody": "Excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Linnie__68"
},
"reviewBody": "I followed this recipe and my family found it extremely bland. Once it was done, I added some extra flavoring to beef it up . That livened it up to where they liked it, but the original recipe was somewhat flavorless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Lutvak"
},
"reviewBody": "Delicious - a little bit sweeter than I would like, but still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teacup"
},
"reviewBody": "Rave reviews. I have been assigned to make this dish for future family get togethers. The only change I made was to use smokey maple syrup and add some pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Keefer"
},
"reviewBody": "Very tasty! A little too sweet for me. The 2nd time I made this I left out the maple syrup and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "I made this for the first time and it was well worth the wait. I added salt pork o the basic recipe, otherwise I followed original recipe . I plan on making this soon again but doubling the recipe and using the crockpot instead. EXCELLENT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbara212"
},
"reviewBody": "This is the second time I have made this. I made another recipe, which is terrible. I give this one 5 stars, i did not add any salt as my husband is on a salt free diet. It is so good! I did use half navy beans and half Great Northern beans. I may try the dry lima beans next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherif"
},
"reviewBody": "These were labor intensive, but very good. All my guest loved them, and there was very little left. I wanted to have more control over the amount of sugar in my beans and I found I could do this with this recipe. I made as is with the exception of adding crisp chopped bacon at the very end this first time. Next time I will add a little bit more heat, and leave out the brown sugar as the molasses I used had enough sugar, and definitely double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlc"
},
"reviewBody": "Made it loved it! skipped the brown sugar based on other reviews"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Single working mom"
},
"reviewBody": "Good basic recipe but it needs something. I made this twice, the first time I made it exactly as the recipe stated. I was good but kind of bland. The second time I added bacon and liquid smoke as well as some mustard. It was better but still needs a little something. I am going to continue to add or change some ingredients until it is just right. One thing I can say, it makes your house smell Devine as it Cooks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teka218"
},
"reviewBody": "I'm crazy for baked beans every since I was little and my grandmother made them every Sunday. I've been trying to find a recipe close to hers. I followed the recipe, also added bacon.There alright, but there just not like grama' s. These won't go to waste, we'll eat them , but I'll have to keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny Corkum"
},
"reviewBody": "Easy and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamawS"
},
"reviewBody": "I went pretty much right by the recipe and I baked them. they took a little longer to get thick then I expected. my husband even commented how wonderful they were..A lot of beans for 2 people! !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Erber"
},
"reviewBody": "Fast version turned out great! Mixed the ingredients for a sauce on the stove over medium heat then added onion and 2 cans of beans (northern works fine too). Simmered for 10 mins and served. Husband said they were his favorite and it took me no more than 15mins. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Next batch I will add salt pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Ellen"
},
"reviewBody": "Good recipe. Too sweet for me so I left out the sugar and the syrup and used a little more molasses since I like the flavor. I used Lima beans for the base and added canned kidney and black beans when the limas were done. I also added prepared mustard and liquid smoke for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Knighten"
},
"reviewBody": "I made this in the pressure cooker, no pre-soaking of the beans necessary! I pressured it for 30 minutes, did a quick release and then transferred to a 350 oven for @ 15 minutes to thicken it. I did add some ham pieces and a small chopped onion. I love it and I will make it on a regular basis instead of the canned pork and beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StoneFly"
},
"reviewBody": "The beans came out beautiful, everyone loved them. I used 1 cup and a half of water to cover the beans while they cooked and it was a perfect ammount. I also added a half a cup of real maple syrup. I cooked them in a slow cooker for 10 hours instead of in the oven. This is the best baked bean recipe in my opinion. Will definitely make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FRANCESCA"
},
"reviewBody": "This was very easy to make. I boiled the beans for an hour then put all ingredients into a crock pot on high for 4 hours. I added 1/2 tsp of red pepper flakes and 1/2 lb of thick bacon. Be forewarned, it is *very* sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "I soaked the beans overnight and put them in a crockpot for 9 hours on high (2 hours without the lid) and it still looked like soup. They tasted good but they didn't thicken up like I was expecting. I might try making this again with a lot less water than what the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valana"
},
"reviewBody": "I have used this recipe several times now with a few adjustments. I soak my beans for 8 hours, boil them for an hour and then put them in the slow cooker. I use slightly less syrup and brown sugar. I add a teaspoon of vinegar (whatever I have on hand), and a half teaspoon of prepared mustard. I slow cook it overnight and it is ready for the next day. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "secretsmile"
},
"reviewBody": "Giving it a 4 stars for technique. I modified the ingredients and amounts for my liking. I only let them bake 4 hours and they were really good. The beans held their shape and were gooey. Will make again and plan ahead to bake longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "added vinegar, mustard, garlic, green pepper.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice"
},
"reviewBody": "Carnivores didn't even know they were eating vegan! This is a great recipe...sweet and spicy beans that get better every day! I've made them per recipe, with canned beans, in the crock pot, used a variety of beans, and it always turns out fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "magikat"
},
"reviewBody": "My only mistake was not doubling the recipe! As a few others have suggested, I added 1 tsp apple cider vinegar and 1.5 tsp dry mustard. I also sauted a little bacon and the onion before adding them to the pot. I was going to skip the maple syrup. but the sauce smelled a bit too acidic. Then I remembered I had a bottle of dark maple syrup in the fridge. Worked out beautifully. Not too sweet and some nice depth of flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "waynescottfeller"
},
"reviewBody": "I made these as is, and they really deserve the five stars! They had an excellent balance of sweet and tangy, and my son and I loved them! A few people have mentioned how sweet these are. They are very very sweet. But as a side with a salty meat and non-sweet salad and dressing, thise was actually a good foil. On their own, they might be too sweet.\nYou may wonder about the 4 instead of five stars. I loved the idea of beans that did not require bacon or salt pork. And they were good as is. However, I felt like the smoky flavour that these cured pork products bring was truly missing, even though the syrup does bring a modicum of smokiness to the recipe. I ended up adding one teaspoon of smoked paprika. This gave them a more apparent, albeit mild, smoky flavour without being overpowering, and without the need for adding fat through smoked meats. This really did add to the overall depth of the flavour.\nHaving said that, even as is these are pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wyoming crista"
},
"reviewBody": "This is one of the best bean recipes I have ever made! We can't do sugar at our household so I use sugar free maple syrup and a brown sugar substatute. On my husband's request I also add cut up bacon. Now that we know we enjoy this I am up to 4x's the recipe. The bean keep well in the frig and the flavor just keeps soaking into them. I have also put the in quart bags and froze them with great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nita"
},
"reviewBody": "I am not a big fan of baked beans my fiance and daughter are so I wanted to try some from scratch for our Memorial Day dinner. I tried this recipe and couldn't stop eating the beans myself! (I was a bit confused by the scaling though because it says is makes 5 cups with only 1 cup of beans and when you try to change the number of servings, it starts with 10? We were having a few people over so I said I needed 40 servings and it was perfect even though I started with about 79 oz of beans). I used canned beans to cut down on some the cooking time we opted for great northern beans. I also cut out the chili powder and cooked bacon to add in. I sauteed the onion in the bacon fat and poured it all into the pan with the beans (I also seasoned the beans with seasoned salt) and added 2 tablespoons of dry mustard and a tablespoon of apple cider vinegar. (I also added a cup of water to make up for the cooking liquid in the recipe but will omit next time as it took the sauce too long to thicken). These were perfect, not too sweet as some of the reviews say (in fact, I added extra brown sugar to adjust to the sweetness level we were looking for). We will never use canned baked beans again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois Hewitt"
},
"reviewBody": "I LOVE this recipe. I did as some of the others suggested: soaked overnight, cooked for one hour, then made in the crock pot. I doubled the recipe so that I could use the whole bag of beans (1#). The only thing I added was a tsp. of cider vinegar and a dash of mustard. The first bite was a little sweet but after only a second I was in heaven. These taste so much better than canned beans and I know exactly what went into them. For the cost of one can of name brand beans, I made a whole crock pot full. Thank you for the great recipe. I am going to always have these on hand!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Audi"
},
"reviewBody": "EXCELLENT RECIPE! This is the 4th time in the past 2months I have made these BAKED BEANS from \"scratch\".\n\nI have added diced uncooked bacon because I like the added flavor.\n\nMy area food-bank will be getting ALL the \"canned bake beaned\" in my cupboard.\n\nFrankly, I always used to \"tweak\" canned beans whenever I made them. Not only is this recipe more cost effective than canned but they are oh so much better on the 'YUMMY\" FACTOR\n\nthanks WKNDYCHEF for taking the time to share this KEEPER of a recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YepICanCook"
},
"reviewBody": "Whoever gave this less than 5 stars is drunk. I joined this website just so I could comment on this recipe. \n\nI soaked the dry beans overnight, threw them in the crockpot and decreased water to 3 cups. Added a 1/2 tsp of dry mustard and two slices of bacon in with all the other ingredients, and set the crockpot on low for eight hours. I came home from work and walked in the door and .. oh .. my .. god. The smell alone was enough to warrant the effort. Upon eating them, I died. Seriously. So good that I died. I'm using the allrecipes review forum as a medium from the other side. \n\nExcellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookin Storm"
},
"reviewBody": "My family loves it! The directions are easy to follow and the end result is fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AHorton"
},
"reviewBody": "dry dry dry....I wouldn't recommend this recipe to anyone...Pure paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emmycurry"
},
"reviewBody": "I LOVED this recipe and so did everybody else! I made this for thanksgiving and it was a huge hit! I'm not one for those spicy bean mixes, I'm definitely a sweet person, so this was perfect! I would useless water next time, I also cooked it in a slow cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "girlking"
},
"reviewBody": "After reading alot of the reviews I decided to try this recipe and I'm so happy I did. My family loved the beans. I followed the recipe to the letter for the most part only adding green bell pepper and minced onions to my recipe and cooking them in the crock pot in the final step (that way I could go to sleep). I'll use this recipe again and again for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa "
},
"reviewBody": "These were really good - the sauce was thick and caramelized. I used all the cooking liquid from the beans adding it throughout the baking time. I followed the recipe exactly as written, but doubled it. \n\nThat being said I won't be making this recipe again. The length of the cooking time combined with constantly having to monitor the beans when baking so they wouldn't dry out wasn't worth the taste payoff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AREENA"
},
"reviewBody": "This recipe worked perfectly. The only things I did differently were partially cooking the chopped bacon beforehand so I could reduce the fat, and I just mixed everything together vs. layering. I was afraid the dish would be too sweet, but it wasn't. Good &amp; easy, as long as you plan ahead. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erikagee"
},
"reviewBody": "I made Coney dogs and these beans for a side dish tonight! My family loved them! I don't like beans of any kind so I did not try them (sorry) but everyone said they were great. I added bacon to them and doubled the sauce, to the sauce I added vinegar and mustard. Thank you for the recipe my family has really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "braids1997"
},
"reviewBody": "Was making this for a large BBQ, so I had to triple the amounts. The sauce was great, but couldn't help adding 2 tbs. dry mustard, 1/4 cup vinegar &amp; 1/2 tsp. liquid smoke for that bbq flavor, delishous! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEVSQ1"
},
"reviewBody": "This is the first time I made baked beans from scratch. I usually open a can of Grandma Brown's baked beans and add brown sugar then bake. These were so good and easy to make. I'll definitely make them again. I did add a cup of baked ham that I had in the freezer, but that was the only thing I did different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Oakrunner"
},
"reviewBody": "WAY too sweet!! I will omit the brown sugar or maple syrup next time. Maybe add a little bacon for depth of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annamarie Fadorsen"
},
"reviewBody": "Very tasty, and with the right soy sauce and Worcestershire sauce, it's gluten free and vegan! It doesn't make a lot, so I opt for a double batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamjlee"
},
"reviewBody": "Very good, wouldn't change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cerelle"
},
"reviewBody": "This was a great base recipe for baked beans, but I like my food with a kick. I didn't use any molasses (didn't have any) and I added vinegar and mustard like suggested, but I also spiced it up with chipotles in adobo sauce, and everyone at my BBQ gave it rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lori Christopoulos"
},
"reviewBody": "I may use this as a base and give one more try. It was rather watery for me. I followed directions exactly. I was looking for the old fashion, more starchy consistency. It has a very mild flavor, so would try adding pieces of bacon to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "buck98281"
},
"reviewBody": "Made exactly as written, beans were a little dry &amp; lacked flavor. Hoped they would have been sticky with lots of texture and stick to the spoon like Mom use to make, these were not what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ming"
},
"reviewBody": "DO NOT DO THIS: I followed directions from another reviewer and put all ingredients in crock pot overnight after letting beans sit in water for 8 hours. The beans were not nearly done 12 hours later! One must pour off the 4 cups of water and use only enough to cover beans as per original recipe! To remedy, i put beans in beanpot and cooked in oven at 350F until it began to thicken. Now it's ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desiree"
},
"reviewBody": "I soaked them over night. Boiled for an hour and then put it in the slow cooker for 6 hours. The BEST baked beans recipe!!!! I'll be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Johnson"
},
"reviewBody": "I doubled the recipe (1 # beans) and used a crock pot. Used pinto beans instead of the navy (had on hand), subbed A-1 and soy sauce for the Worcestershire (didn't have any), doubled the brown sugar, added 1 tsp dry mustard and 1# bacon. I only used 5 cups of water instead of the 8 it called for and it was still too soupy, even after 10 hrs on high and several hrs on low. I'm thinking the pinto beans swell and soak up much less than the navy beans. We still liked this recipe, just used a slotted spoon. I will try this recipe again with the great northern beans I have. Hopefully they will soak up the juice more. I'll also fry the bacon a little before adding to the pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CRASH5456"
},
"reviewBody": "These beans were really good, instead of salt I put in a nice piece of salt pork. It's a staple for a lot of recipes in my area :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lynnshamrock"
},
"reviewBody": "This was good, but it did not need to cook for 6 hours. It was really dry. I liked the flavors though. But, definitely not the best baked beans I've ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mother Ann"
},
"reviewBody": "I had never made baked beans any way other than open a can of pork and beans and add some brown sugar and maple syrup. These are really good, though I would add more brown sugar next time just because I like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dorothy"
},
"reviewBody": "I followed this to a T. This was very sweet but bland. I don't think I will be saving this in my recipe box. Thanks, but no thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "Thank you for everyone's suggestions. I added 1 1/2 tsp mustard powder and 2 tsp apple cider vinegar, 3 slices of bacon crumbled, and sauteed the onion in the pan that the bacon was cooked in for a more complex flavor. I cooked this in my 8 in dutch oven and it overflowed a bit so I have to clean the bottom of my oven (which is due anyways). These beans came out amazing. I will be serving them later on in the week with hamburgers and red potato salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kendra B. Lynn"
},
"reviewBody": "Actually not as cloyingly sweet as I feared...only thing I would change would be to add vinegar, or more ketchup. Needs a bit of tang; otherwise, great bean recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cocoakay"
},
"reviewBody": "added bacon bits..cooked 3 hrs on high and 10 hrs low"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "Awesome beans! I made them exactly by the recipe, only I doubled everything and cooked them in the crock-pot. Absolutely delicious! My toddler couldn't get enough! A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJ Ross"
},
"reviewBody": "Added bell pepper, a couple shakes of hot sauce, and 1/4th cup brown sugar. Omitted Ketchup added 1 small can tomato paste and 2 tbs mustard. I feel sorry for my neighbors having to smell it all day. Cooked in crockpot low for 3 hours and high for 7 hours. Results were raved about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missy1979"
},
"reviewBody": "I didnt use the onion and was out of worcestershire sauce. These were really good! My beans seemed a little dry, wonder why? I ll give 5 stars since I dont think the dryness was from the recipe but some thing this chef must have done wrong. Yummy flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicholai"
},
"reviewBody": "This was my third and final attempt at baked beans that weren't horrible - and they were exactly the opposite! This is a keeper for sure. I also added 1 finely diced green pepper, 1 tsp. vinegar, 1/2 tsp. dry mustard and a dash of poultry seasoning. I added a little less water after hearing it was too soupy, but mine actually turned out a little dry, so I would stick to the recipe. Although many people said they were too sweet, I found the opposite and added some brown sugar mid-way through cooking - perhaps because my molasses were unsweetened."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dani"
},
"reviewBody": "A bit on the sweet side but very delicious anyhow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jenny"
},
"reviewBody": "We really liked these, nice flavor. Beats the can, thats for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DAS079"
},
"reviewBody": "My husband liked these and ate them, but my kids wouldn't eat them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "h0t5auce"
},
"reviewBody": "I give this recipe a two as kind of an average. Please note, I followed the recipe to the letter. People at the party left their beans on their plates. Here's how I came to the two average. The flavor is terrible. Too sweet, no kick and no dimension. The cheapest canned beans have more complex flavor. For technique, I would give this recipe five stars. This has got to be the way to cook beans for perfect texture. The problem here is in the ingredients. It should have been a red flag when there was no vinegar, no mustard, no roasted peppers, etc. The Worcestershire sauce and chili powder are no match for the syrup, molasses and brown sugar. I'll use this recipe as a guide to come up with beans that please a Midwestern crowd."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/165249/baked-beans-from-scratch/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1673/side-dish/beans-and-peas/baked-beans/",
"name": "Baked Bean Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/165249/baked-beans-from-scratch/",
"name": "Baked Beans from Scratch"
}
}
]
}
}
, "about": [
]
}
]