				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Banana Waffles"
,"datePublished": "2000-09-09T21:04:35.000-04:00"
,"dateModified": "2023-01-30T04:57:26.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jennifer Park"
,"url": "https://www.allrecipes.com/cook/24324204"
}
]
,"description": "Delicious banana waffles with the banana cooked inside for added flavor and texture. These make a great snack as well as breakfast or bunch."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IA0J7Cn4m8BdDw8WJIN7XaG5M88=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/454371-79e09d9ce4f14725ac131b1dc2bd4861.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1954390488001",
"description": "Make delicious waffles with bananas cooked inside the batter.",
"duration": "PT2M49S",
"name": "Banana Waffles",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/7210f5ee-53c2-472f-bb31-ec1abca11fdf/1690d51e-7e40-4da8-8b1d-e3c6df766cec/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T13:58:44.386-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Banana Waffles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "184"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "241 kcal"
,"carbohydrateContent": "47 g"
,"cholesterolContent": "50 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "606 mg"
,"sugarContent": "11 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.25 cups all-purpose flour",
"3 teaspoons baking powder",
"0.5 teaspoon salt",
"1 pinch ground nutmeg",
"1 cup 1% milk",
"1 large egg",
"nonstick cooking spray",
"2 ripe bananas, sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the waffle iron."
} ,{
"@type": "HowToStep"
,"text": "Sift together flour, baking powder, salt, and nutmeg in a large mixing bowl. Stir in milk and egg until mixture is smooth."
} ,{
"@type": "HowToStep"
,"text": "Spray preheated waffle iron with nonstick cooking spray."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IA0J7Cn4m8BdDw8WJIN7XaG5M88=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/454371-79e09d9ce4f14725ac131b1dc2bd4861.jpg"
}
]
,"text": "Pour 2 tablespoons waffle batter onto the hot waffle iron. Place 2 banana slices on top of the batter and then spoon another 2 tablespoons batter on top of the banana. Cook until golden brown. Serve hot."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Williams"
},
"reviewBody": "Wow! The healthiest AND tastiest waffles I've ever made. They did tend to stick to the waffle iron so use a lot of spray."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael Cabbie Caban"
},
"reviewBody": "This recipe was a little chewier than I anticipated. Still delicious, and will try mashing The bananas and incorporating into the batter. I’ll also try adding some oil or melted butter into the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janelle C"
},
"reviewBody": "I took other comments in consideration &amp; mashed up the banana in the batter. Taste is great! Would like to crisp up the waffles a bit, but it’s not mandatory, lol!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen White"
},
"reviewBody": "I Mashed the banana,added to milk /egg mixture &amp; adddd a teaspoon of vanilla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ellerywealot"
},
"reviewBody": "I wasn't very impressed with this recipe. Putting the bananas onto the iron with the batter (instead of mashing them into the batter beforehand) resulted in an inconsistent texture/flavor. Either it was a bite of banana or a bite of dry, salty, chewy waffle. I also have quite a bit of banana stuck to the iron that I will have to clean up. Eating it with a dollop of strawberry jam made it taste pretty good though!\n\nNext time, I might try mashing the bananas into the batter as several other reviewers have mentioned. I might also try just making my regular waffle recipe and swapping out the eggs for bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I halved the recipe since there's just two of us and there were a few changes I made - I mashed half of the banana and added it to the wet ingredients before mixing it all together, then folded in thin slices of the rest of the banana (sliced and cut in half). I also added a bit of cinnamon to the batter. I think having some of the banana mashed adds banana flavor throughout instead of just in the bites with a chunk of banana. The bites with chunks are my favorite, though, so I would definitely recommend saving some banana to slice and add like the recipe states (though I think I'd slice in quarter chunks next time so it's easier to get in the waffle iron). You get a nice banana flavor with this recipe, but I love an even more intense banana flavor so I would like to try adding another half banana to half the recipe (another whole banana to a full recipe) to intensify it a little more. I definitely plan on making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bdtkim"
},
"reviewBody": "Easy adaptable recipe! I added 3 eggs and 3 mashed bananas, (because I had too many) reducing milk to achieve waffle batter consistency. I also added a little cinnamon and vanilla as reviewers suggested and the results were excellent! The family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Parker"
},
"reviewBody": "These smell delicious. Instead of nutmeg, I added pumpkin pie spice, a couple tablespoons of sugar in the raw and a large splash of vanilla. These are okay waffles, not bad, but cooked very unevenly in my waffle maker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kredrose14"
},
"reviewBody": "Turned out deliciously . Added the mashed bananas to the batter as someone else suggested. Used almond milk instead of 1% cows milk for my lactose intolerant grandson."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Emma Otero"
},
"reviewBody": "Not very good waffle consistency, I thought it was a bit too heavy. Also there was no need to chop up 2 whole bananas because this recipe only produced 3 waffles in my waffle maker. Kinda disappointed because I like to make batter for at least 4 waffles and freeze the unused portion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kathieh725"
},
"reviewBody": "I wish I had read the reviews before making these waffles. I would have mashed the bananas into the batter. This was a good waffle, and if I make these again, I will try using strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I wish I had read the reviews before making these waffles. I would have mashed the bananas into the batter. This was a good waffle, and if I make these again, I will try using strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Thorpe Williams"
},
"reviewBody": "Lightly mash the bananas into the batter and you have one great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Felipe Belluco"
},
"reviewBody": "Very crispy and delicious! I wish it was airier but still a very good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Duchi"
},
"reviewBody": "loved the simplicity . great basic batter. we added some banana extract and vanilla....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WIOSNA"
},
"reviewBody": "Very good waffles. It's my new go to recipe when I have over ripe bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sarahjoy414"
},
"reviewBody": "these are okay but not great. They lacked flavor and stuck to the pan. I won't be making them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brigitte Joannette"
},
"reviewBody": "2 full tablespoon of cocoa and 1 table spoon of protein powder in dry mixture and 1 table spoon of coconut oil in liquid mixture\nit was awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene Y"
},
"reviewBody": "I mashed the bananas, leaving a few small chunks in. Delicious! Recipe made three Belgian sized waffles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anestasia Windmeier"
},
"reviewBody": "I did follow this recipe however, I did add some vanilla extract and sub cinmamon for the nutmeg. Only because my oldest is allegic to nuts. I also mixed in the bananas after smashing them into the batter. Plus added 1/4 c sugar for some seeetness. They came out perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura S"
},
"reviewBody": "Love, love, love this recipe! Just like the other reviewers I mashed the bananas and I added a table spoon of sugar but there were a delicious way to use up a couple of bananas! They freeze well, too! I made a double batch and freeze the extra, and when I’m busy in the morning just pop it in the toaster and I use a crispy waffle in no time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "Oh my goodness! These were so good!! Like some of the others I added the smashed bananas to the batter. I also added a little cinnamon and pecans. I put these into my belgian waffle maker and they made 3 perfect waffles. I am definitely looking forward to trying these with red bean paste and walnuts - that sounds so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Phil m"
},
"reviewBody": "The batter is too thick and is not as good as the other top rated non banana recipes. I prefer just adding bananas to the normal waffle recipe over this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debbiev"
},
"reviewBody": "This is my new favorite waffle recipe!! I didn't have 1% milk so I used 3/4 cup almond milk and 1/4 cup coconut water. Delicious. I will, next time use milk and compare"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cliff G"
},
"reviewBody": "I liked the recipe, had no problems with waffle sticking at all. Good recipe will make again.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Athenerz"
},
"reviewBody": "I just love these so much, I've made them over a dozen times. In fact I get so excited when my bananas on the counter turn too soft to eat because then I know it's waffle time! I've made these as instructed with the sliced banana in the middle and while I did enjoy the surprise pockets of banana goodness, I felt like that method of making them was a little too much hassle for me. I prefer to mash the bananas and fold them into the batter, it just makes everything easier. As for the batter, the only thing I change is that I use wheat flour for that extra fourth cup of flour and add a slight sprinkling of cinnamon. I love that these don't use sugar, because I don't have much of a sweet tooth, especially in the morning, and I think the mashed bananas add the perfect amount of sweetness! This recipe is quick, easy, delicious, and didn't require any whisking of egg whites to make it fluffy- it already is fluffy! Woohoo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meghan Rodriguez Magner"
},
"reviewBody": "Yummy basic recipe. I added more banana and mashed it like other reviewers had said. Great way to use up overripe bananas! I also added a couple tablespoons of brown sugar and a teaspoon of vanilla. I also added a tablespoon of vegetable oil for nonstick purposes, as I don't use sprays. They were delicious, like banana bread. I found this recipe to yield about 10 waffles in my Belgian waffle maker. They're about 3\"x4\" waffles. Thanks for another great one All Recipes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Wiley"
},
"reviewBody": "Made 3/4 of the recipe for Frank and me. Added nutmeg and cinnamon and used buttermilk instead of 1% milk. Used 1 small egg and 1 banana. 369 calories per serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryll Lyn"
},
"reviewBody": "Great, I have made same (except I mash one banana) and the other I slice very thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle D"
},
"reviewBody": "I made these for my husband and son, and they loved them! The only substitution I made was to switch out the milk because my son cannot have milk. We added Silk brand original almond milk. I would definitely make these again! As long as you fully cover the banana slices you won't get any sticking to the waffle iron."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ripley"
},
"reviewBody": "This recipe was okay. I only used 2 tsp of baking powder instead of 3 because I thought that would be too much, and it was just enough to make the waffles fluffy without tasting the baking powder. \n\nThe sliced bananas didn't work out too well; even with the extra batter over top of them the bananas turned into brown/black goo. I would sooner just place the slices on top of a cooked waffle.\n\nI'll try this again by mashing the bananas into the batter and see how that goes. I'll rewrite my review afterwards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RonGoings"
},
"reviewBody": "Batter is way too thick, had to add more water, yes the bananas tended to stick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gatichy"
},
"reviewBody": "I made these with 3 bananas (mashed up) and gluten free flour and a small teaspoon of zantham gum. I love the taste of them - slightly sweet. Will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these with 3 bananas (mashed up) and gluten free flour and a small teaspoon of zantham gum. I love the taste of them - slightly sweet. Will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shortcake30"
},
"reviewBody": "Like many others, I mashed the bananas. Made very moist, soft waffles. A nice way to avoid adding all the vegetable oil or melted butter that other recipes call for. Will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oceanwalker"
},
"reviewBody": "This is a really good recipe. The only thing I changed was that I mashed the bananas and added them to the wet ingredients. What I loved about it was that there is no added sugar or fat. The waffles were not what you would call a typical crisp waffle, but I put some in the freezer as an experiment. I was trying to find a way to crisp them up. When I needed them I put them into the microwave for about 15 seconds to thaw, then into my toaster. That's when I got a good crisp waffle. Here's what I thought about the ingredients. Everything worked for me, but I thought a pinch more salt would add to the flavor and maybe omit the nutmeg and exchange it for some cinnamon. The nutmeg was a little overpowering even in the small amount called for. When I made the recipe for the second time I added some roughly chopped walnuts to the batter. This added more crunch and it tasted wonderful. Over all we loved the basic waffle recipe and will share it with people we know who can't have added sugars and fats in their diets. It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Goodrich"
},
"reviewBody": "These were great! As everyone else, I mashed the bananas and mixed them in with wet ingredients. I think the reviews mentioning undercooked insides might have used large bananas. Mine were small, 180g total, and the insides came out fully cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "moxie & mirth"
},
"reviewBody": "Made as-is, the waffles were doughy and mushy and slightly bitter. I added nearly another 1/2 cup of flower and 1/8 cup sugar, restirred it up, and tried again.... then they tasted good although they still were too soft for our liking once done. I had to put them in the toaster before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "titolisa"
},
"reviewBody": "Good waffle recipe. Make it often. My changes are as follows: mash bananas and add to batter. use oat or wheat flour and substitute a 1/3 of the flour with protein powder. almond milk instead of regular milk. no nutmeg (personally don't like it). These changes were made because we avoid white flour/sugar and try to be health conscience. Today I added chopped walnuts. Made a nice change. Going to try using quick cook oats next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Rogers"
},
"reviewBody": "I did the mashed banana mixed in option and these turned out great! I also added 1 tbsp of oil and a little cinnamon to the mixture. The texture of these waffles were perfect, moist and fluffy inside and slightly crisp outside. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Ann Hardy Smith"
},
"reviewBody": "Mash the bananas and add to batter, moist and yummy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Danielle Rote"
},
"reviewBody": "batter fell apart 90% of the time in waffle maker. no oil? this recipe tasted bad, too- like no flavor at all - dry and too many bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hsmcf1"
},
"reviewBody": "I only had one banana, so I substituted a half cup of applesauce, as well as using only 1cup of flour- half all purpose, half whole wheat, with a sprinkling of chia seeds. I didn't need the full cup of milk with the applesauce, q"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen M Nelson"
},
"reviewBody": "I add a few walnuts and they were very good; also I mashed up the bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marina Renusa"
},
"reviewBody": "Great idea, bledned bananas with milk &amp; combined with dry ingredients... served with vanilla icecream &amp; maple syrup. Best idea 4 waffles ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nknzl85"
},
"reviewBody": "The taste was good, but I had a lot of problems getting them to cook all the way through without burning. If I took them out when they where a (dark) golden brown, they were undercooked in the middle and made it seem like I was chewing a banana flavored sponge. The only ones that were cooked all the way through were burnt on the outside.\nI also had a big problem with them sticking to the waffle iron. Both issues I've never had before.\nWas really looking forward to this recipe, but ended up being disappointed. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trisha"
},
"reviewBody": "these were ok but I like waffles that are krisp on the outside and moist on the inside, these were moist but didn't have the crisp outside. the taste was good. I mashed the bananas into the mix and added a 1/2 tsp sugar and used 1/2 tsp vanilla. I will stick with Banana Pancakes and regular waffles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michaelc"
},
"reviewBody": "Guess I don't need Bisquick any more. \nRan out of Bisquick had a few Bananas it was christmas. \nSimple and very good, I did add a touch of vanilla extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "William Welfley"
},
"reviewBody": "This is one of the best waffles that my wife and I have ever had! Very easy to put together and great texture. I took the advice from another who mashed the bananas and mixed with the batter.\nI will give this 5 star rating after adding melted butter to help with sticking in the iron add to the flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kay77"
},
"reviewBody": "This recipe is wonderful; easy and quick and the kids loved it. As per some of the comments, I roughly chopped/mashed the bananas and mixed them in the batter. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Siobhan Piercey"
},
"reviewBody": "Good! I still like my banana pancakes recipe better, but I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christie Lynn"
},
"reviewBody": "I double this recipe because I have three hungry children in the morning and also freeze a lot of breakfast breads for later snacking and travel. So I mixed everything up and added pumpkin spice, brown sugar and cinnamon and a touch of vanilla... Started my batch and noticed, even when baked a couple cycles the insides were still gooey, so I ended up adding some whole wheat pancake mix to thicken it up. That did the trick, they were fluffier and cooked all the way thru. Over all I think this is a good start to a waffle recipe, but needs to be tweeked for anyone who needs to have fluffy waffles!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Johnson"
},
"reviewBody": "I like to mash the bananas up and rough chop 1/4 cup of pecans to add to the batter. I also add about 2 tsp of sugar and a little vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isadora Lattmann"
},
"reviewBody": "Awesome recipe! Fluffly and tasty waffles, really easy and quick to make. Smashed the banana lime suggested by other users."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mindy Kohn"
},
"reviewBody": "Do not substitute coconut flour! Will try again and follow recipe precisely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Goforth"
},
"reviewBody": "I loved this recipe and next time I will try it as written. I only had 1 banana and I used Silk Vanilla Unsweetened instead of 1% milk. I also used 1/2 whole wheat flour and threw in a handful of chocolate chips. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovesweets"
},
"reviewBody": "I added vanilla and used vanilla almond milk as sub for milk and these were amazing. I also mashed up two bananas in mix as others did. I will definitely make this again. My entire family raved about how chewy and crisp they were- perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "K"
},
"reviewBody": "I mashed the bananas and added to the mix first, but even with the addition of vanilla extract and a pinch of cinnamon theses still lacked flavor and came out spongy. Very dissapointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyrose94"
},
"reviewBody": "These are wonderful. Light, fluffy, and with the banana and nutmeg, just delicious. I think that another time I will try a bit of chopped up canadian bacon for a different taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakingnovice123"
},
"reviewBody": "Worked really well and smelled amazing. Put them in the freezer and can heat them up on school mornings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "baked up really nicely. But my son did not care for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessnoble"
},
"reviewBody": "I made a gluten free version with 1 cup oat flour 1/4 cup rice flour and 1/4 cup white sorghum flour everything else is the same. Turned out awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sooz"
},
"reviewBody": "Made these waffles for my daughter and I for breakfast today. We both thoroughly enjoyed them and will definitely make them again. I added a teaspoon of vanilla and cinnamon to the batter only because we both love the flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cgallenorr"
},
"reviewBody": "I made the recipe as is, and I would rate it 3 stars. I made them again with the following changes: I mashed the bananas and mixed them into the batter, I added a tablespoon of sugar and a half a teaspoon of cinnamon for flavor, and I used soy milk because I like the flavor. I added just a little more milk than it called for, and this made 4 full waffles instead of 3 3/4 from the original recipe. I have made them several times now with the changes and I love them! I always make extra and freeze the leftovers for quick breakfasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JTSMOM"
},
"reviewBody": "I mashed the banana like some reviewers suggested. I like them, but they are sort of soft and I think next time I'll put a little bit of sugar in the batter. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mandi Spencer"
},
"reviewBody": "I'm not a huge fan of baked bananas, but I thought these were pretty good, and my kids really liked them! I followed the layering technique as described, and didn't have any problems with it. I did oil up my waffle iron pretty well, though. I didn't have any cooking spray, so I poured in a teaspoon or two of grapeseed oil, then turned it a few times to make sure both sides were coated. I may try adding it to the batter next time. A waffle batter really should have enough oil that you don't have to oil the iron at all, so I'm giving this a four as written. I also made a few ingredient substitutions based on what I had available. I used half cake flour and half whole wheat, and mixed up some powdered milk instead of using fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Celeste Daly"
},
"reviewBody": "Tried the recipe with mashed banana's, tastes great and is the perfect amount of waffles for 2-3 people!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tati"
},
"reviewBody": "These waffles came out really nice! Not too sweet and tastes good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YAYHOWFUN"
},
"reviewBody": "Used the Foreman waffle plates -6 or 7 min and awesome...not as crisp as I'd like, but that could be the grill. I also used half whole wheat flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LJ"
},
"reviewBody": "Very tasty! I doubled the recipe and made Belgian waffles. Served them with some cinnamon butter, maple syrup and fresh blueberries and raspberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon M."
},
"reviewBody": "First time making waffles. This batter was perfect. Only thing I added was about a teaspoon of cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "I made mine Elvis.. added bacon and topped with peanut butter. I liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martha Rombach"
},
"reviewBody": "Delicious waffles...and easily customizable. I tripled this recipe, adding 1 tsp of nutmeg and 1 1/2 tsp of cinnamon. Also mashed the bananas--using five large ripe ones when tripled. Added a little canola oil, as well as separated yolks from whites, whipping whites into creamy froth before adding to mixture. We cook in waffle iron for 3 minutes. Delicious--and excellent for reheating for school-morning breakfasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Chambers"
},
"reviewBody": "Delicious! Added a little cinnamon. Kids LOVE them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pecola"
},
"reviewBody": "Comes out perfect. Stir in Walnuts for a bonus treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley-Dawn"
},
"reviewBody": "i give it 3 stars out of 5 for the original recipe and instructions. I made the dry ingredients the same but in a separate bowl i mashed together 2 bananas, 2 tsp of vanilla, 1/3 of a cup of chocolate chips and 1 tsp. of brown sugar. then mixed it into the dry ingredients. they runed out amazing! fluffy and with amazing flavour!! THANKS FOR THE STARTER BATTER :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "3MCMRMOM"
},
"reviewBody": "pretty good - i used 1/4 c. whole wheat flour, added 1 T. sugar, and forgot the nutmeg (next time!) i diced 1 1/2 bananas and added them to the batter. this made 15 3-inch waffles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "I made the recipe as is except smashed the bananas and added them to the batter. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tomyownrhythm"
},
"reviewBody": "I tried to make these for a brunch party this morning and stupidly didn't do a test run in advance. I followed the recipe's suggestion to simply put the banana slices between two layers of batter. The banana heated too much and began to steam and force batter out of the waffle iron, and prevented the batter from bonding top to bottom. The result was a two-part, sticky mess that could not pass at all forr a waffle. In the end, I gave up and made pancakes with the batter and served the bananas over them. Overall, the batter was a decent recipe and the technique instructions were a failure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JARRIE "
},
"reviewBody": "The flavor is great, the execution is flawed. I followed the recipe instructions for putting sliced bananas between dollops of batter, and I will be spending my evening cleaning my burnt waffle iron :( However, the flavor was great and they rose beautifully, so I can't complain too much. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jds317"
},
"reviewBody": "like some of the other reviewers, I smashed the bananas and added to the batter. I also added some cinnamon and crushed pecans. These were very yummy and I'll definitely make again! A great way to use up ripe bananas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eureka Gaines"
},
"reviewBody": "This was a great recipe, super easy. I mashed the bananas and added cinnamon and vanilla extract. My two year old and husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "altilun5"
},
"reviewBody": "These are great! I also mashed the bananas. My family's favorite waffles so far, and I've tried several recipes from this site already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitty Stoykovich"
},
"reviewBody": "Great recipe for when you have ripe bananas and need to use them up! loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tantuc"
},
"reviewBody": "These waffles were easy and quick to make with the bananas mixed in with the dough. I used almond milk instead of the regular and 2 tbsp of oil for non-stick properties. The waffles are mildly sweet and have room for extra spices of your choice. They come out crispy on the outside, and soft with some specks of bananas on the inside. I've got 4 and a half waffles with this recipe. Since I have to use natural sweeteners for my son, these waffles are perfect. I will be making these again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CA Cook"
},
"reviewBody": "These are yummy. I mashed the bananas and added to the batter. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taste tester"
},
"reviewBody": "These are very good they taste a lot like banana bread and I mashed the bananas then put them into the batter and mixed them in instead of just chunks in your waffle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Simpson"
},
"reviewBody": "I did follow the advice of others and mashed the bananas first. I didn't have any milk on hand, but did have powdered buttermilk instead. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathleen Sackett"
},
"reviewBody": "I hace very picky eaters and everyone loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaitex27"
},
"reviewBody": "Easily tops my list of easiest to cook and yummiest to eat. A must to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "prbacheller"
},
"reviewBody": "I wish they were crispier..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Cooks"
},
"reviewBody": "My husband devoured these! I used whole wheat flour to make them a little heartier and mashed the bananas instead of slicing them, to prevent from sticking to the waffle iron. I also added a teaspoon of brown sugar for flavor. The recipe made 5 waffles in total."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Makes a yummy waffle, but I only got 3 mini-sized (little more than a 1/2 cup scoop of batter) waffles instead of 4. I mashed the bananas and mixed them in with the batter, as opposed to putting in slices. I used light vanilla silk since I was out of regular milk, and I also added 2 tbs of brown sugar to the recipe to give it a little sweetness. I found that it took 2 1/2 to 3 minutes on my electric griddle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rob Hopkins"
},
"reviewBody": "Great recipe, I prefer to make a large batch and freeze the rest. I tripled the size, used mashed bananas and added 2 cups raisins. After having them for dinner and breakfast, we only had 1 left to freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trollmother"
},
"reviewBody": "very wonderful! I took the advice from others and mashed my bananas, added cinnamon and of course sprayed my waffle maker with cooking spray. I think I may add some toasted chopped walnuts or pecans next time to add a bit more texture. Also to make them a bit heartier, I used 3/4 cup white flour with 1/2 cup wheat flour. My 3 year old asked me to make these every day. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqueline Hanson"
},
"reviewBody": "Excellent, although I didn't try as is. Like others I mashed the bananas, but I mixed them with the eggs separately from the batter (which I used 1 and 1/4 c of pancake mix in place of the flour and baking powder). Cooked mine for about five minutes each until golden brown on one side. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Delicious! I substituted 1/4 cup of the flour with oat bran, used whole wheat flour instead of white, added a couple of tablespoons of ground flax seed, and used 3 small mashed bananas. Perfect consistency, nice and sweet. Whole family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewFoodie"
},
"reviewBody": "Very good waffles! However, I mashed up the bananas and then added them to the batter; I don't think the flavor would carry if they were left sliced. Great with peanut butter or syrup. Suggest adding walnuts for a banana nut waffle. Also good with whole wheat flour, and better for you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loge"
},
"reviewBody": "Add Walnuts and also cur the banana into pieces and mixed in with two egg whites instead of one egg, and whole wheat flour. Made some strawberry syrup by modifying the recipe on this site with orange juice/zest and some cornstarch. Turned out really good."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21271/banana-waffles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
"name": "Waffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21271/banana-waffles/",
"name": "Banana Waffles"
}
}
]
}
}
, "about": [
]
}
]