				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Banana Nut Bread Baked in a Jar"
,"datePublished": "1998-12-02T13:08:15.000-05:00"
,"dateModified": "2022-11-01T23:23:25.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Linda P"
,"url": "https://www.allrecipes.com/cook/24325712"
}
]
,"description": "This traditional banana bread features an ingenious twist: It is baked in a canning jar! Such a fun and unique presentation makes it perfect for gifts."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JCJYIfcXA_s-Y-jXh3YCK5KRvJ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5110-banana-nut-bread-baked-in-a-jar-CHIRSTEN924-1x1-1-db0f73c185ed4ef39aaf3baba877dd6e.jpg",
"height": 700,
"width": 700
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2385004317001",
"description": "See how to bake banana bread in a canning jar.",
"duration": "PT4M34S",
"name": "Banana Nut Bread Baked in a Jar",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/01bd35e0-1c4d-4c1a-bd4e-29a06807929d/336f777a-3bfb-4275-9f97-ef8b6b98a919/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T05:49:46.527-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Banana Nut Bread Baked in a Jar"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "271"
}
,"cookTime": "PT45M"
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.66666668653488 cup shortening",
"2.6666667461395 cups white sugar",
"4 eggs",
"2 cups mashed bananas",
"0.66666668653488 cup water",
"3.3333332538605 cups all-purpose flour",
"0.5 teaspoon baking powder",
"2 teaspoons baking soda",
"1.5 teaspoons salt",
"1 teaspoon ground cinnamon",
"1 teaspoon ground cloves",
"0.66666668653488 cup chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Grease insides of 8 (1 pint) straight sided, wide mouth canning jars."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream shortening and sugar until light and fluffy. Beat in eggs, bananas, and water. Sift together flour, baking powder, soda, salt, cinnamon, and cloves. Add to banana mixture. Stir in nuts."
} ,{
"@type": "HowToStep"
,"text": "Pour mixture into greased WIDE MOUTH pint jars, filling 1/2 full of batter. Do NOT put lids on jars for baking. Be careful to keep the rims clean, wiping off any batter that gets on the rims."
} ,{
"@type": "HowToStep"
,"text": "Bake at 325 degrees F (165 degrees C) for 45 minutes. Meanwhile, sterilize the lids and rings in boiling water."
} ,{
"@type": "HowToStep"
,"text": "As soon as cake is done, remove from oven one at a time, wipe rims of jars and put on lid and ring. Jars will seal as cakes cool. Place the jars on the counter and listen for them to &#34;ping&#34; as they seal. If you miss the &#34;ping&#34;, wait until they are completely cool and press on the top of the lid. If it doesn&#39;t move at all, it&#39;s sealed."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JCJYIfcXA_s-Y-jXh3YCK5KRvJ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5110-banana-nut-bread-baked-in-a-jar-CHIRSTEN924-1x1-1-db0f73c185ed4ef39aaf3baba877dd6e.jpg"
}
]
,"text": "Jars should be eaten immediately or kept sealed in refrigerator for up to a week."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elsie Johnson"
},
"reviewBody": "This is a keeper, very easy and everyone was pleased with the thoughtful exchange."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baking is Therapeutic "
},
"reviewBody": "Loved the video. The recipe was easy to follow. I made pumpkin bread &amp; used butter for shortening, unbleached flour &amp; nutmeg instead of ground cloves, and added 1/4 cp. chocolate chips . The breads took more like 55 minutes on, and two took and hour. None of them rose to the top. Since they are a gift, I tried one &amp; it was yummy. Very moist &amp; dense, but the toothpick test said they were cooked thoroughly. I even had to cover the toothpick holes with a walnut! Just can’t figure out why they didn’t rise more ??... Maybe the flour? Are they supposed to rise more once the lids are on? If so, that’s an important to mention in the recipe. My question is why do you have to refrigerate them? Every other recipe said they can go in the pantry for months I refrigerated, like bread in a can. I don’t understand and was hoping to send them in the mail without having to send them refrigerated...??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quickcook"
},
"reviewBody": "I wanted to make this in the jars but didn’t feel like it at the last minute. Instead I used my new mini loaf pans. I halved the recipe as I did not want or need such a large quantity and it filled 3 mini loaf pans. It is a very hot day here in CA so I opted not to use my oven and put them in the toaster oven instead (which I was a little worried about because the temperature of it seems higher than my oven at the same degrees). Anyway I baked them at 325 in the toaster oven for 30min then rotated them and turned my toaster oven down to 300. I checked them at 38 min with a cake tester and it came out clean so I pulled them out. Let them rest in the pan about 10 min before turning them out on a baking rack to cool. Oh my word, DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Rice-Franklin"
},
"reviewBody": "Always turns out great! I like the way it seals up with the lid on and it makes cute circle slices of bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chen Li"
},
"reviewBody": "My husband loved this banana nut bread. Said it was the best he ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nita Oswald"
},
"reviewBody": "We made this for our wedding as gifts for our guests. topped them with old fabric and they were a success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn L."
},
"reviewBody": "Good recipe, but I suggest that you not boil your lids. Sterilize them with near boiling temperature water, but water that is too hot can damage the seal on your lid when you apply the lid to the jar. Yummy stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susi McKee"
},
"reviewBody": "I made this to give as gifts, and I have to tell you it was fabulous! Baked up beautifully, smelled wonderful and tasted even better. And everyone who received one ate them in a flash. Give it a try, it's an excellent and easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Lynne Cook Heyder"
},
"reviewBody": "No changes made. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Bear"
},
"reviewBody": "Love the concept of the canning jar presentation. I posted a picture (somehow it is now showing up on it's side) of enhancements in the preparation process. \nFirst of all, I used \"Baker's Joy\" baking spray to coat the inside of the jars. This cooking spray has flour in it (no idea how they do that) so it is comparable to greasing and flouring the jars).\nOne of the other reviewers piped the mixture into the jars with a plastic bag - I found that the top of a 2 liter recycled soda bottle made a perfect funnel. The mouth of the bottle was large enough to allow nuts and chocolate chips through, but kept the sides nice and clean. Amazingly enough, the top of the inverted bottle ended up right at the 1 cup measurement in the jar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Fournier"
},
"reviewBody": "Excellent flavor! I put jars directly on the oven rack, spaced them 3-4 inches apart &amp; they baked perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaja Treiber"
},
"reviewBody": "I have a question. Do you need to remove the bread from the jar to completely cool on a wire rack and put it back in? Or leave it in to cool completely? Thank you. The recipe is delicous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Warner"
},
"reviewBody": "This recipe is probably the best banana bread recipe I have made. It was so easy to make. The banana bread stays so moist in the jar, and comes out so easy. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Malone"
},
"reviewBody": "Made this for Christmas gifts. Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy C."
},
"reviewBody": "I made this banana nut bread twice. It's moist and delicious! I did bake them right on the oven rack not a cookie sheet and they were done perfectly. I'm using these for Xmas gifts and I'm sure my friends and family will enjoy the taste and flavor. Thx for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmoney"
},
"reviewBody": "I made these for the neighbors. A good hint after sealing the jars cool them upside down. This helps the lids seal and bread loosens from the side of jars. I made 12 jars 1/2 pints and one loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia Fetherston"
},
"reviewBody": "Grandma Van Doren's White Bread review: Don't underestimate the size of bowl you need to use to let your bread dough rise. I had to move it to a much larger bowl, when I saw how much it was growing (almost overflowed) in the 1st rise. Getting ready to bake in about 1/2 hour, and it looks like they will be 3 beautiful loaves. Will update, if it doesn't remain a 5*."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K-Rae"
},
"reviewBody": "I loved this recipe !! I made them for a party of 35! The flavor was different than I normally am used to, it was the cinnamon maybe but I really really loved it!!\nThanks for sharing . This is my new go to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen McIntosh"
},
"reviewBody": "little more cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Carmen"
},
"reviewBody": "I love this recipe! It's so moist and tasty. I make it for my coworkers a lot. Recently I used 5 bananas instead of 4 (since I had an extra banana) and it was even better. The best one I've made so far. Got so many compliments from it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This is delicious!! I actually ran out of flour &amp; used Bisquick for the 2/3 cup of the flour (in a half recipe), used the full amt of cinnamon, but added in equal parts of cloves &amp; nutmeg, reducing the amt by 1/3. I also omitted the nuts because I'm not a fan of nuts in baked goods. ?? It is absolutely yummy!! I made a loaf for myself before baking it for my dept as gifts this year. Can wait to see if they love it as much as I do! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I make this several times a yr-they will keep in your cupboard up to a year and still be fresh and moist-must be stored in cool cupboard so it doesn't get to warm and pop the lid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Ross Gardiner"
},
"reviewBody": "Delicious, only change was I did them in pint and a half jars baked for 1 hour or till toothpick cones out clean. By sterilizing my jars first, it has kept perfect for over 3 months!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Veronica Eskridge"
},
"reviewBody": "Very good presentation. The addition of cloves was a bit much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SER"
},
"reviewBody": "I made 1-1/2 recipes (exactly as written) and was able to yield 11 jars for gifts. I did take the advice of many to bake them directly on the oven grill and it worked beautifully! They were moist but fully cooked. The cloves added a wonderful taste to this bread and as they were Christmas gifts for neighbors, it had a great holiday taste perfect for the holidays. Greasing the jars, and using straight lined jars made getting them out easy. Thanks for this great recipe Linda Jean!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsams"
},
"reviewBody": "My dad used to make these for me every holiday and now I have the recipe!!!! This is hands down my favorite treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calvarado"
},
"reviewBody": "This is such a clever idea! I didn't have a loaf pan and I found this recipe and thought I would give it a try. They turned out delicious. I will definitely be keeping this recipe for future use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLF"
},
"reviewBody": "Could someone please tell me why jars need to seal if going to be eaten soon. Also, I don't understand, so again helpme (!), If the jar seals, is it liked canned---and if it is like something canned wouldn't it last for a long time...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Chuck Lovitt"
},
"reviewBody": "Made the banana nut bread exactly as the recipe says and It turned out GREAt! The bread is so moist and light and fluffy but hearty. I used 12 8 ounce wide mouth jelly jars for mine because it was our due date announcements and we had more than 8 family members to give them out to. Also I used really really really ripe bananas and the consistency was a lot easier to achieve.(no lumps) I am mailing a couple out too. I hope since it's jarred that it will keep without refrigeration so our family can eat it :) Overall GREAT TASTING BANANA NUT BREAD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nychiro"
},
"reviewBody": "I have a question. Has anyone tried making this bread with butter instead of shortening? Also would it effect the shelf life?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julz"
},
"reviewBody": "This recipe is wonderful!! I made about 30 jars for my deployed Army SGT hubby and his fellow soldiers for the holidays. Not only was the bread edible after traveling 7000 miles, but my hubby and his friends ate all 30 jars in a week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bnestes"
},
"reviewBody": "Tried it. Gave it. People are asking for the recipe!!!Wonderful recipe and idea. I did not include the cloves. One reason is, I did not have it in my spices and was not able to get anywhere to purchase on the fly. Also, I feared the clove flavoring being too strong, as suggested. It was so-o-o- delish! If you are like me, I don't always get those bananas eaten when they look appetizing so Banana bread is a wise idea, especially this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Jordan"
},
"reviewBody": "Loved this recipe! It was so moist and delicious. I did use butter instead of shortening. I baked them a few days before Christmas, and just opened my last jar today, so it's been about three weeks. It still tasted just like the first jar I opened, so I would say it will definitely keep longer than the recipe states. After opening the jar, I slice it about 1/4 inch thick and spread softened cream cheese on it. It is SO good that way! I've also toasted some of the slices before putting the cream cheese on, and that makes it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "glenda"
},
"reviewBody": "I TRIEed this and the banana bread turned out the best i've ever tasted. only one problem. i didn't use the correct jars and can't figure out how to get the bread out. the bread is bigger on bottom than the top. So I guess I'll have to cut it in the jar and try to pull it out. it only says to use wide mouth jars. i considered my jars wide mouth but they are still smaller at the top. Oh well, guess I'll have to send instructions with the gift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie"
},
"reviewBody": "This was so easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjreed"
},
"reviewBody": "What a great idea. I will be adding this recipe to my annual fall list. My jars sealed and the bread turned out moist with flavor. Can't wait to try out other bread recipes using this method. I placed a piece of fabric over the top of the jars and tied it with some string. Looks great.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dixie"
},
"reviewBody": "This bread was really good. I used 1qt. jars and used the cookie sheet and half way thru the baking I rotated the cookie sheet. I will be making this again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charrine"
},
"reviewBody": "I attend Feasts in my Native Village and when it is my clans turn to host the feast this is the banana bread I make...... People know me now as the banana bread girl! :) Thank you for posting this recipe here! *****SMUDGE*****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauriec"
},
"reviewBody": "This turned out really good - kind of a funny, quirky thing to do with banana bread - but fun and really good. I did not add cloves - as I am not a fan, and like other reviews I only added about 1/2 t. cinnamon. will make again when I have leftover bananas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Easy to make and fun to show people. It's not the best as far as taste but I like banana bread in general and usually am not picky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Mccormack"
},
"reviewBody": "Made this with my son last night perfect!!!! so easy, make sure your lids are nice and hot when you put them on jars, awsome taste, the only thing I will do is not fill them quite half full as we had to cut off a little off the top to get the lids on,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "I have more of a question than anything. I want to send these to my husband who can't be home for the holidays since he's deployed. Will they hold up more than a week? Boxes take typically a week and half to two weeks to get to him."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucky777"
},
"reviewBody": "Yummy! Used 1/2 the amount of cloves as others suggested, and didn't bake in jars, since I wanted to see how it came out first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne"
},
"reviewBody": "Very good and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Perry Cardenas"
},
"reviewBody": "This is the best banana bread ever! It's more like cake than bread, but SOOOO good!! The jar thing is great for gifts, but I use this recipe when I make a regular batch too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ENELSON6"
},
"reviewBody": "this is the best of the best! I've made this recipe for years now. My kids &amp; grandkids love this banana bread. I make it just as written most the time but from time to time &amp; will handful or so of mini chocolate chips. Great as a gift! I've even made them in 1/2 pint jars for my single family friends &amp; neighbors. You have to try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmandaW2061"
},
"reviewBody": "was very good and moist and i even used the wrong kind of jars so we had to be creative and eat it with a spoon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueandBob Butler"
},
"reviewBody": "i omitted the nuts, cloves and cinnamon. in addition i decreased the salt to 1/2 teaspoon. The bread turned out moist and wonderful. baked for 45 minutes as directed. i also put Christmas fabric on the lid and tied with raffia. it looks and tastes amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chanel0712"
},
"reviewBody": "I haven't tried the recipe but I did make bread in a jar using this recipe last year for Christmas gifts. Everyone raved over it. To answer someone's question about storage. I left in my pantry and I know it stayed fresh for at least a month as that is how long I had the last jar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Herrera Claud"
},
"reviewBody": "What a great idea! Made these in 8-oz jars, using 1/2 cup of batter per jar. Baked them at 325, aprox.15 minutes, directly on the oven rack per previous recommendations. They sealed perfectly! Will be giving these as gifts with little packets of Hot Cocoa. Thanks Linda!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith A Corey"
},
"reviewBody": "I love this! I baked the first batch in half pint jars, and for Christmas I am making baskets with this, apple bread, pumpkin bread and fruitcake, all made in the jars. Not using a cookie sheet was a helpful hint, but for the smaller jars, I used a muffin pan to hold the jars since they have a smaller bottom and would be easier to tip in the oven. Even though the jars were smaller, they needed to bake the same amount of time. My gift baskets will have 4 jars of assorted breads, tea, coco and a recipe card giving full credit to Linda Jean and this website. I already use it for so many other things, this is just the BEST yet. It isnot the same old same old gift basket, the jars are reusable (I will put in new lids with the gift basket in case they want to try it) and with a little ribbon and material it looks wonderful all the while staying *green* . Thank you all for the wonderful new things to try and for the honest and helpful reviews that are posted. Merry Christmas if you celebrate it, or Happy holiday for the holiday your family does share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marge j"
},
"reviewBody": "It is most helpful to use a funnel that is designed for canning in order to not get any batter on the rim of the jar. Then it is not necessary to wipe the rim of the jar when you take the jar out of the oven -- just take it out and put on the lid and ring. Also it it not necessary to refrigerate the jars; they will keep just fine at room temperature as long as they are properly sealed. I have kept some as long as 12 months (just to test) and it was just fine; although I suggest 6 months just to be safe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zakjan"
},
"reviewBody": "I have a question for you gals that made these for gifts. You have to keep them in the fridge it says? How'd you manage that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I've used this method a bunch of times and I'm very happy with the results. I used my own recipe and due to this approach I end up with a super moist banana bread. I also made a batch for my mom who can't eat a regular loaf by herself. This is the perfect amount for a single person and being able to freeze the jars and use as needed is a wonderful idea. I will try other recipes using this method. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blondiegirl81877"
},
"reviewBody": "WOW!!! This is just like my mom use to make when I was little! The best Banana Bread recipe I have found! I did it exactly like the recipe called for. Super Delicious! Will be making this for christmas presents."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinB"
},
"reviewBody": "Turned out awesome, great for gifts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Conderman"
},
"reviewBody": "Delicious and fun to make to give as gifts! Everyone loved it! Nice and moist! I increased cinnamon to 1 1/2 tsp and omitted cloves. Baked on a sturdy cookie sheet and it came out beautiful! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenski"
},
"reviewBody": "I used my own recipe, but followed the directions here. I bought Christmas material and put it over the top and a little below the lid and secured it with a few strings of raffia. It was adorable and I was proud of them. I'll make more next year for sure. I'd like to try a cobbler in a jar sometime too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faith5280"
},
"reviewBody": "Great presentation. We did have to make it twice because the first time I accidentally knocked the jars over and made a huge mess! We baked it without the baking sheet as others recommended. We gave it as gifts using the exact recipe here and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smilem"
},
"reviewBody": "I made these in coffee cups as gifts. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junebug's Mom"
},
"reviewBody": "I made these as Christmas gifts. I considered using my own banana bread recipe baked in a jar but decided to try this. It was very good however, I am not used to the cinnamon and cloves in banana bread. It tasted more like a spice bread because these spices overpowered the banana flavor. This turned out great and was tastey, I just think the title of the recipe is a little misleading. Or, maybe it's just my perception of what banana bread should taste like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "LOVE this recipe. I bake them and send them to my boyfriend in Afghanistan, and the guys he's shared his with have asked for the recipe to have their wives make and send some. :) Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raph_2122"
},
"reviewBody": "So moist and so good ! A perfect gift"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna Vick Wells"
},
"reviewBody": "I sent these to my boyfriend on deployment in the middle east, and he and the guys LOVED them! He said they tasted perfectly fresh when he received them 2 weeks after I put them in the mail! I used 14 8-ounce jars so there was more to go around. The only other change I made was using buter instead of shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeresaA"
},
"reviewBody": "These are great! Tastes fantastic and such a cute idea...makes a great gift or easy to take when traveling...love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Diamond"
},
"reviewBody": "This is a great recipe for banana bread. I make similar recipes including zuchinni bread and carrot raisin bread and bake them in jars also. If these seal correctly they actually keep for up to a year in your pantry. We just ate some the other day from Christmas of 2009. It was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlena"
},
"reviewBody": "Amazing! The addition of the ground cloves really sets this recipe off. Everyone who tried these loved loved loved them. I only had 6 jars left over to make these in, so I made a batch of muffins. I have to say that having them stored in the jars is great. somehow they tasted even better from the jar than they did in muffin form. (I had the same experience with a red velvet that I made in the jars w/ extra made as cupcakes.) Thank you so much for sharing this recipe!! (I followed the instructions exactly, as I usually do on my first attempt. Great job and perfect measurements)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "I have done this for years but with a different recipe. It is always a hit. My comment is that I don't see the need for refrigeration. If it is sealed properly it will last for 1 year. I left some on purpose for a year and it was fine. Experiment!!! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanine"
},
"reviewBody": "These could not be cuter or easier! I tied a cute ribbon and put them in little holiday bags with tissue. It was a nice change from doing christmas cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sass A. Frass"
},
"reviewBody": "Making this for the billionth time tonight. I like to make some without nuts, some with nuts, and for a fun variation, the nephew loves it when I add chocolate chips! Extra thanks to the person who suggested to NOT use a baking sheet and cook directly on the oven wire.... HUGE tip. It doesn't cook evenly on a baking sheet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Snyder Honeycutt"
},
"reviewBody": "Everyone I gave this to said it was YUMMY... this year I couldn't find any jars in time to make it for Christmas gifts, but I decided I woulld try t just making it in loaf pans (so I could actually taste it myself) and it was still YUMMY... very moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Potter"
},
"reviewBody": "Excellent! I was hunting for a banana bread recipe, and this was highly rated, so I made it but baked it in loaf pans (made 2 good size loaves). Baked at 350 for 1 hour. It was a hit with the man, and his kids, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Skinner Reitemeyer"
},
"reviewBody": "Excellent Banana bread recipe! Thank you! These made wonderful teacher/co-worker gifts this holiday season! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Fiedler"
},
"reviewBody": "I DID use my own recipe for the second batch, filling just short of half full, as the batter was so fluffy. Worked just fine. I also kept the lids and rings in a shallow pan of water at a simmer, just as I do for canning. When the bread was done, I removed one jar at a time, carefully, wiped the rims and sealed with the hot lids and rings, treating them as I do my other canning. All jars sealed, and the one that didn't make it out as a gift for Christmas is still sealed a month later...The only problem that I can see is that a single jar is a very tiny loaf!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lizrlozano"
},
"reviewBody": "The ideah is great. I used my own family recipe because other reviews. I baked 2 dozen and tied festive bows around the lids. We gave these to neighbours for Christmas. If you bake these on a cookie sheet, be sure to rotate, as some will brown more than other. Everyone wanted to know where I got the ideah. Thanks for great inspiration!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dondie"
},
"reviewBody": "I was so excited to make this recipe for the in-a-jar baskets my sister and I do for Christmas. I give this 5 stars for the idea but a 2 or 3 for the recipe. We didn't taste banana at ALL. We decided to test one just in case. We kept eating it but it was more like we were trying to get something out of it that wasn't there. I would suggest finding a better banana bread recipe (or whatever you would like. I'm sure you could make all different kinds of bread) and using this recipe as a guideline for the baking technique. As a note, I believe we tripled this recipe and made 12 quart size jars, but had some batter left over. It took about an hour or so to bake that way. They started to look like they were going burn but turned out just fine. It was pretty moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ann Tuchler"
},
"reviewBody": "Excellent right out of the oven but it really doesn't keep well. If you ask me that's a rather silly quality in something you seal in a canning jar. Not practical for gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frnbost"
},
"reviewBody": "Super easy and delicious!!! gave them away as Christmas gifts and will be making more. I left the nuts out because so many people have allergies and the taste was still excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valrush"
},
"reviewBody": "this recipe is a keeper! very easy! my only suggestion - place the filled jar on the rack in the oven not on a sheet. the air distributes evenly around the jars that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Very creative idea! I gave these to my coworkers and friends as Holiday gifts. Be sure to only fill half way, I found out the hard way when I put in the first batch and they overflowed over the top of the jar! I made one change, after I greased the jars I used a 1/4 cup sugar/ 1 teaspoon cinnamon mixture and dusted the inside of the jar before adding the batter. Came out great! Thank you for the creative recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Sokol"
},
"reviewBody": "This recipe is great for gifts! I did what another reviewer suggested and used two cups of fruit, but i substituted the banana for applesauce and chopped apples. I also added raisins and a bit of nutmeg. It was incredible! I was not sure how to bake- with or without a cookie sheet, so i tried both. For me, they turned out better placing them on the sheet in the oven. I just placed holiday fabric and ribbon around them, and they are ready to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akitafan"
},
"reviewBody": "This is a GREAT gift for soldiers overseas. I make all different types of cakes/breads in jars and send them overseas and everytime I hear that they taste as if they were just baked. You can make any type just by filling the jar 1/2 full with whatever batter you want, the only suggestion is not to use fruits or anything that can spoil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "healthyeater28"
},
"reviewBody": "REALLY tasty, moist and delicious! I will be making this again. They make they perfect little gifts for friends, mailmen, neighbors, teachers, whoever. But make sure you keep a few for yourself! I made one batch and used wide mouth canning jars (1 qt.) and the batch fit into four perfectly. Try them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eliza W"
},
"reviewBody": "Great recipe! I omited the cloves due to other reviews citing that it was too strong of a flavor. Very moist! I preheated a jelly roll pan in the oven before placing jars on top. They came out perfect per the time table. Flavor while excellent is more of a spice cake. Hubby and I could not detect a apple taste (we sub'd applesauce for the bananas). Going to add these to the food baskets that I made for a few family &amp; friends this year. This would be great with butter (we tried that) or cream cheese! One of the few times my hubby went nuts for something sweet! He never, ever eats sweets but he certainly gave this a thumbs up :) A overall five star rating and certainly would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelley Barrett"
},
"reviewBody": "These are an amazingly easy treat to share with friends and family and they make a wonderful gift!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4my4girls"
},
"reviewBody": "This is a very good bread recipe, and I will definitely make it again. The best way to preserve this bread is in the freezer. When sealed as described, it helps prevent freezer burn, and keeps well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "This is a great recipe! I used pumpkin for my 1st time. Can't wait to try other fruits &amp; veggies. Planning on freezing the jars for Christmas giving. Very moist &amp; delicious bread!!! I tried with 8oz. jelly jars - baked for 35min. Next is the quart wide mouth jars. I made apple bread the 2nd time around. Just made banana bread in jelly jars - 8oz. Cooked them for 35 min. on a cookie sheet. Turned out fantastic!! Really a neat recipe. Can freeze them for holiday gift giving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arika L. Thomas"
},
"reviewBody": "GREAT!! used pumpkin instead of banana. my family is not too keen on them. they kept in the fridge for over six months!! super moist and really fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "This is the most wonderful jar-cake recipe I ever tried! Muffins are great for the microwave: 600 watt for 1 1/2 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette Garza"
},
"reviewBody": "Awesome recipe. Tried it for the first time. When it says, fill 1/2 jar with batter, DO IT. I filled 3/4 and it was baked over the top of the jars. I poured the bread out, wrapped it, and hand it out to neighbors, and they loved it. Also, placed on racking for baking, the jars tipped to one side. Next time will try putting them on baking sheets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Kilpatrick"
},
"reviewBody": "Wow! I was a little skeptical, but it came out SO good. I made just one jar to try it out, and turned the rest into muffins, but I have to say, the bread in a jar has to be the most moist banana bread I've ever had. DELICIOUS! I'd just say that if you do plan on moving them around in the oven for even baking, PUT THEM ON A BAKING SHEET. THe wire rack wasn't a sturdy enough surface, and I wound up tipping it over twice. But the recipe is perfect just the way it is, I didn't have to make any changes at all. Five stars and two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Civillia"
},
"reviewBody": "I have Zucchini bread my mom made in 1988 which has been in her basement 'fruit room' which still looks just fine and which we ate a jar of recently and we are still alive. I will add, eat at your own risk if kept for that long!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BeckyC"
},
"reviewBody": "Help! Some sites, and some reviewers here say that the sealed bread can be stored for up to one year. You say one week. Who is right?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Viviana"
},
"reviewBody": "It tastes wonderful! Best stuff! I make it and send it to my husband when he's deployed and it comes out just as well 2 weeks later! LOVE IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dellis130"
},
"reviewBody": "This is the best I have ever made and tasted, I did read reviews and took their advise. I did not use a cookie sheet when cooking, I do think it cooked more even. I am very impressed with this recipe. The best of all you don't ever have to throw out those bananas any more, these jars store for up to one year as long as they seal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GrilledCheeseGrad"
},
"reviewBody": "I made this for Christmas gifts for my family. I stuck right to the recipie with one exception. I'm not a huge clove fan so I only put in 1/2 the amount it called for- that made it perfect for me! (I also used walnuts instead of pecans. Next time I will add more nuts as it was a little light on nuts for my taste!) The only major issue I had was finding the right size jar. I went to two craft stores and finally settled on a jar that was a pint and had a small lip. Because of this I had to double the recipe and I still didn't have quite enough batter for all 8 jars. I did a test run with one of the jars and I filled it up a little bit more than halfway at 325 for 55 minutes. It came out perfectly! Some of the other loafs were smaller, but that didn't matter much. Everyone loved them and was so surprised! I added a cute note \"Warning: avoid initial urge to break jar. To eat: cut length wise and remove. Enjoy!\" I'll definitely try this method again with different kinds of breads."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Redcherrystar"
},
"reviewBody": "Changes: added an extra cup of mashed bananas. The condensation that builds up in the jar is very unappealing to look at, not to mention some shrinkage on the bread. Also, I had to more a little more than half of the batter in the jar, for this to rise close to the top. Will continue to use this recipe, but may have to switch to loaf pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie M."
},
"reviewBody": "I made this with my daughters to give to relatives at Thanksgiving. It was perfect! I was afraid it would be hard to get out of the jar but it actually slid right out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stuffedpuppet"
},
"reviewBody": "I have made a recipe like this for years to rave reviews. I lost my recipe and this one is just as great. When I sprayed the jars with non-stick spray I also sprinkled sugar in the jar. The hardest part of this was getting the hot jars out of the oven and putting the lids on without burning myself. I have heard that this can last up to a year unopened and in a cool dark place - I would like to try that but they never make it past a month. Even after a couple weeks they are still moist and delicous."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7024/banana-nut-bread-baked-in-a-jar/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/343/bread/quick-bread/fruit-bread/banana-bread/",
"name": "Banana Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17653/bread/quick-bread/fruit-bread/banana-bread/banana-nut-bread/",
"name": "Banana Nut Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7024/banana-nut-bread-baked-in-a-jar/",
"name": "Banana Nut Bread Baked in a Jar"
}
}
]
}
}
, "about": [
]
}
]