				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Banana Pumpkin Bread"
,"datePublished": "2000-02-26T19:22:39.000-05:00"
,"dateModified": "2022-07-19T17:15:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "matzahball"
,"url": "https://www.allrecipes.com/cook/3284"
}
]
,"description": "This pumpkin banana bread is made with raisins and walnuts and bakes up extra moist and flavorful thanks to mashed bananas, cinnamon, and pie spice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/qWCuDGxyKjrB3opVc-b_Uk7SqlU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9417823-banana-pumpkin-bread-Kim-4x3-1-ab1d9c82190448dfbd3895ecb2704c0e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Banana Pumpkin Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "544"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "328 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "3 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "258 mg"
,"sugarContent": "30 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 ripe bananas, mashed",
"1.3333333730698 cups canned pumpkin puree",
"0.5 cup honey",
"0.5 cup white sugar",
"0.33333334326744 cup vegetable oil",
"2 large eggs",
"2.5 cups all-purpose flour",
"2 teaspoons pumpkin pie spice",
"1 teaspoon baking powder",
"1 teaspoon baking soda",
"1 teaspoon ground cinnamon",
"0.5 teaspoon salt",
"0.75 cup raisins",
"0.5 cup walnut pieces" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan."
} ,{
"@type": "HowToStep"
,"text": "Stir together bananas, pumpkin, honey, sugar, vegetable oil, and eggs in a large bowl. Combine flour, pie spice, baking powder, baking soda, cinnamon, and salt in a separate bowl. Stir flour mixture into banana mixture until just combined. Fold in raisins and walnuts. Pour batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 45 minutes. Cool loaf in the pan for 10 minutes before transferring to a wire rack to cool completely."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RichWarmSpirit"
},
"reviewBody": "This recipe is a great start due to the spice balance. A few people complained about it not baking properly. I believe there is too much liquid. I heeded to the warnings, and I used only 1 cup of pumpkin and brown sugar instead of honey. It came out great after baking on 400 for 10 minutes, then reducing to 350 for 45 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I only had 3 very ripe never frozen bananas and a supply of fresh pumpkin that never runs out. I am constantly trying new recipes to enjoy my pumpkins with and have been trying to find and get what I got here tonight when I slightly modified this recipe by substituting honey with Lakanto Maple Flavored Syrup, and vegetable oil with margarine. Added ginger, nutmeg, cinnamon, just a touch of all spice. Doubled the batch one banana shy and cooked in a few different size pans. I just ate half of the smallest one, I have finally after years found and obtained the outcome I was looking for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I think vanilla should have been added to pull more flavor out. I agree with others that cook time is off. I think I had it in and out of oven for about an hour and a half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Inside is raw and outside is burnt. This makes so much batter I have no idea how they can say to use one loaf pan. I think if decided into 2 it might cook properly... the flavor is pretty bla also although I don't info that it's not super sweet. Anyway, skip this one don't waste your ubf z"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I LOVE this recipe. It's a household staple. I use white wheat, do not add dried fruit or nuts inside the bread, and sprinkle the top with pumpkin seeds and brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Good flavor. I used vanilla yogurt instead of oil, only one egg, and three bananas. I'll make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steph855"
},
"reviewBody": "came out nice! i was just using this recipe as a base. didnt add raisins or walnuts. added a tsp of vanilla, more cinnamon, used almond flour and monkfruit sweetener instead of honey and regular sugar. very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryG"
},
"reviewBody": "Very nice recipe. I followed the advice to lower temp to 325 and baked for about 65 minutes total. I didn't have allspice, so used nutmeg and cardamom instead. Very moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hsbball3402"
},
"reviewBody": "The cook time or something in the recipie is definitely off. I'd read reviews so tried to proactively adjust time and eventually heat but after an hour and a half the top of the bread is burnt while the inside is still gooey. The bread is very dense on the edges where it's actually cooked and it doesn't have a lot of flavor. I added a little cream cheese frosting to the top of the bread that was cooked which added a nice flavor. Overall I'm not a fan I'd recommend using a different recipie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nancyaiken3927"
},
"reviewBody": "I made this for the first time today. I baked it at 350 for 45 minutes as directed, but I should have tested it because, although it looked like it raised up beautifully, it soon sank and was a gooey mess in the middle. The end pieces tasted on, but overall, I’ll try a different recipe next time or adjust the oven temp &amp; bake longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I enjoyed the flavor of this bread--but the other reviewers are correct in stating that 45 minutes is no where near enough bake time. I baked my bread for 75 minutes and it was still doughy in the center. I think this might work better being divided into two loaves instead of one. Otherwise, the flavor is great with the perfect amount of spice and a nice balance between the pumpkin and banana. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lola303"
},
"reviewBody": "I really enjoyed this. I did make a couple simple modifications simply because was short on ingredients. I doubled the recipe with no issues. Subbed part of the honey with maple syrup. Subbed the oils with Greek yogurt. Subbed some whole wheat flour. Moist and delicious. Added chocolate chips. Made them into muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tmorillo14"
},
"reviewBody": "I made this as muffins- 170 Celsius convection for 16 minutes, and they came out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mapsguy1955"
},
"reviewBody": "I would give it a 5, my way I would, but I made a few alterations for my own preference. I eliminated the pumpkin spice and replaced with Chinese 5 Spice. It is more complex. I only put in 1/2 of the raisins and followed the rest of the recipe. I baked for an hour and 10 minutes at 325 in my toaster oven, turning every 25 minutes. It came out beautifully. Thank you for giving me the ideas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ky Boop"
},
"reviewBody": "I should have read the reviews first. Mine was also gooey when I went to turn it out onto a cooling rack, so I turned the oven back on and baked it for about another 45 minutes. I felt when I put all that heavy dough into the loaf pan that it was a really heavy “bread” and should have divided it or made muffins, or put it into a bigger, wider pan. The taste is good. I used sweet potatoes instead of pumpkin (because canned pumpkin isn't really pumpkin), and added raisins, and it's fine, just not too pretty to take anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "These were tasty, but needed adjustments. I baked in lined muffin tins for just shy of 20 minutes in light of other reviewers who said the bread took forever to firm in the middle. If I did this again I might spray the muffin liners to eliminate sticking at the sides and bottom. For substitutions (following recommendations of others), I used 3 bananas, 1 15 oz can of pumpkin, and added a tsp of vanilla. Then when done, I drizzled a bit of confectioners sugar/butter/milk/cream cheese glaze on these. My son said they’re fantastic with ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael Russon"
},
"reviewBody": "Followed this recipe as written only substituting the raisins for chocolate chips. I then made it into 20 muffins, instead of bread. Baked at 350° for 20 mins. Perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Andrews"
},
"reviewBody": "I really liked the use of honey and less sugar. I did not add the raisins and walnuts. It's very moist and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "Rating is for baking time.... this recipe makes a significant amount of batter for one loaf pan. I baked this for 58 minutes at 350 and I’m not sure it’s cooked in the center. The top is dark so I decided to take it out and am hopeful that it may set a bit. Agree with other reviews to use less batter or bake at a higher temp. Taste TBD but will update review. I used chocolate chips only no raisins or nuts but rest of recipe is as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Parker"
},
"reviewBody": "This bread was amazingly good. So fluffy and really rose well. I was skeptical of the honey but added it anyway and it turned out fine. Had 3 bananas so used all. Also skeptical since no liquid, in past used buttermilk for similar recipes but this one didn’tcall for it. Maybe the best bread I’ve ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annaleise Conway"
},
"reviewBody": "Overall a good recipe to work off of. I swapped applesauce for the oil, omitted the honey, changed the white sugar to light brown sugar and included walnuts. I had to bake it an extra 10 minutes (55 min total) in a 9x5 glass loaf dish but at that point it was perfectly cooked so I think decreasing some of the liquid ingredients (especially that oil) is key. Turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VHK"
},
"reviewBody": "Delicious bread! I put the batter into two 9x5 pans that were greased and lightly floured. There was too much after for one 9x5 pan. Also baked it for 55 min instead of 45 as it wasn’t cooked through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frenchy"
},
"reviewBody": "I followed the recipe exactly but I made muffins instead. Baked for 20 mins at 350. They were moist and kid approved! Half the batch I made without nuts and raisins and dipped them in a vanilla glaze (tbs butter melted, tbs milk, tsp vanilla, and enough powdered sugar to get the right glaze consistency which was about a cup) then dip the muffin tops into glaze while still warm. The other Half of the batch I added the bits and raisins to the batter and also sprinkled nuts on top. Glazed them also. Very good!\n P.s. pour boiling water over the raisins in a bowl And let sit 5 mins. they will plump up and be nice and soft . Drain before adding to batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetSusan"
},
"reviewBody": "Yum! Better as muffins than a loaf, but totally delicious. I made one perfect loaf and 6 muffins with this recipe. A few changes to the receipe after reading all the \"helpful\" reviews in advance. DRY: 2 cups flour + 2/3 cup oats, mixed the craisins into the dry mix. WET: 3 bananas, an enitre 15 oz can of pumpkin, added ginger &amp; nutmeg. BAKING: I prepared the pans by buttering them and sprinkling with cinnamon-sugar (my fave banana bread recipe calls for this); I baked the muffins for 35 minutes and the loaf for 58 minutes at 325. Muffins are delicious! I'm saving the loaf to eat later but it looks picture-perfect. Note: I live at high altitude so some of the changes may not work if you live at sea level!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DenilJ"
},
"reviewBody": "Substitute 4 oz. of unsweetened applesauce for vegetable oil (1/3 cup)\n\nSubstitute MoreFiber Baking Blend for the sugar (equal substitution)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "What a horrible recipe. I followed everything and at 1.5 hours cooking, it’s burnt/cooked on top and completely raw almost all the way through. Seems like most people that liked this recipe used a different pan. But you shouldn’t have given it a 5 if you didn’t follow the instructions. Now I’ve wasted ingredients and money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Made it according to the recipe. The smell as it was baking drove me crazy. Cake was moist and flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tmom"
},
"reviewBody": "This never cooked through in the recommended pan size and I needed to bake it far too long.\n I would search out another recipes and compare batter amounts and possibly cook in two pans of the same size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashkoe"
},
"reviewBody": "I replaced the honey with brown sugar and used coconut oil instead. I topped it with pumpkin seeds, oats, walnuts, butter/brown sugar crumble and it was delicious and beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Bretz"
},
"reviewBody": "This recipe is delicious but I had a hard time getting my loaf to bake all the way through. My bread was still wet in the middle while the outside edges were becoming dry. This recipe makes a lot of batter and unfortunately I only had 1 pan available. I think it would have worked perfectly if I had made 2 smaller loaves or used some muffin molds. Overall a very tasty recipe though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sara Olds"
},
"reviewBody": "Didn’t cook all the way through and too much dough for one loaf pan. I should have read the reviews before making"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEONEL RAMIREZ MURO"
},
"reviewBody": "Its Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "reneelopezdc"
},
"reviewBody": "I used GF flour (daughter has wheat allergy) and used applesauce instead of oil. Based on other reviews, I did use more spices. My kids loved this, ate it as dessert and for breakfast:) Gave it 4 starts since I feel like the spices really needed to be increased, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tofuburger"
},
"reviewBody": "The flavor is pretty good, but like others said, it didn't bake thoroughly. I split it into two 8\"x4\" pans and baked for about 55 min at 350. It's still gooey in the middle and not well structured. It tastes good enough for us to eat, but if I bake it again I'll play with some of the other reviewers' modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CamenZermeno"
},
"reviewBody": "Delicious!!! I will use this over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sascha"
},
"reviewBody": "Delicious recipe! To make it a bit healthier I substitute oil for applesauce and I use Splenda for baking instead of sugar. I also lower the oven temp to 325 and cook for approx 90 minutes. If the bottom starts to get too dark I wrap it in foil. I've made this several times with rave reviews. Sometimes I add chocolate chips. It's a decadent bread that's low fat/low sugar. (Minus the chocolate chips!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CherieR"
},
"reviewBody": "Very disappointed in this seemingly great recipe! The baking time is WAAAY off! I have added nearly another hour of baking time, and counting, in an effort to get the internal goo baked! Currently, lightly covered with foil in an attempt to avoid producing a giant crouton!! Should have known that with as much banana and pumpkin in a single large pan, something was off! If there is a \"next time\", I will bake it in two 8x4 pans. Just really mad that this recipe had such misleading high marks, when the reality was that the glowing reviews included remarks about the bogus bake time! I guess that's on me because I was in a hurry, looked for a banana pumpkin bread recipe, saw that Allrecipes-which is usually very trustworthy- had this great looking recipe, and I went for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Lagola"
},
"reviewBody": "ok first things first. edits.\nincreased bananas to 3.\nincreased pumpkin pie spice to 1tbl.\neliminated cinnamon (only because of increased pie spice).\nreduced oil to 1/4C.\nadded 2tbl butter.\n\nbaked in mini muffin tins.\nstarted temp at 350F for 15minutes then reduced to 250 for 10 minutes (to finish cooking the insides).\nthey came out PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christine S"
},
"reviewBody": "This bread was bland and very dense. While we love pumpkin bread and banana bread, this combination was NOT a crowd pleaser in our house. The only change I made was baking it at 325 degrees for about 80 minutes or so. It came out a beautiful golden brown and was moist, but that was all it had going for it. I will definitely not make this again, and I am really surprised that it gets such a high rating. It is one of the blandest quick breads I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Solomons"
},
"reviewBody": "Delicious well-received bread so many people liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherineitz"
},
"reviewBody": "Wow! This is an amazing recipe! I did have to cook if for a lot longer then what the recipe said, though, as many of the reviews said. But the taste was great: not to sweet, and pumpkin-banana-y. This bread was very moist. It was wonderful. Thanks for putting out this recipe, matzahball, though you may want to edit the cooking time+temperature:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SF Social"
},
"reviewBody": "READ BEFORE MAKING THIS! I guess I should make a practice of reading reviews before I try a recipe because something was very wrong here. It smelled heavenly, looked beautiful and the toothpick came out clean after 45 minutes, but when I turned it out of the loaf pan, it landed with a splat. The ends, top and bottom were done but the middle was gooey and uncooked. I suppose the nicely cooked top cleaned the toothpick on the way out. I felt a little better after reading that other bakers had a similar experience after adding another 20 minutes to the cook time, but it's always a bummer when something is a complete fail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Thompson Cornell"
},
"reviewBody": "I thought it was yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Mulcahey"
},
"reviewBody": "It took less than one day for this to disappear. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "snowmum"
},
"reviewBody": "This is a good recipe but the cooking time needs to be adjusted as it was not cooked after 45 minutes. Most Bread like this take between 60-75 minutes. This one took 65 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie Sanford Johnson"
},
"reviewBody": "WOW!! Even better than I had imagined!! SO amazing! I have shared it and passed this recipe on to friends. This is my favorite season because of these recipes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "Loved this recipe! I doubled it, used 3 cups white flour, 2 cups whole wheat, only used 1/2 c brown sugar (no white sugar or honey), and 2/3 c unsweetened apple sauce instead of oil. And then added in some chocolate chips at the end. I baked two loaves in metal pans at 375 for around 55 mins. The taste was great, although the whole wheat flour made the crust a bit tough/chewy (someone with more baking experience than I have could probably figure out a way to mitigate that). Even so, I would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Delicious bread! Just take note that it takes a full hour to bake instead of the listed 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherry"
},
"reviewBody": "I added pumpkin seeds in place of the walnuts\nThis is a very easy recipe to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ria Maske"
},
"reviewBody": "The bread did not cook, even after baking for 1 hour and 15 mins. We will try to fill the pan 1/3 of the way next time. Think this recipe needs an edit...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe exactly except I only had 1 cup of pumpkin so I added another half of a banana. I also divided it between two 9x5 bread pans as it made a lot of batter and baked for 45 minutes. A toothpick came out clean but as they cooled they flattened out a bit and are a little dense on the bottoms (but still cooked) so maybe a little longer wouldn't have hurt. This recipe is DELICIOUS. I will be making it over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cathy Murphy"
},
"reviewBody": "Not any better than any other recipe. Couldn't taste the bananas. I have a better recipe I'll just stick with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "Came out delicious. Love adding honey rather than sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Bland bland BLAND!!! Waste of time and food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C. Church"
},
"reviewBody": "I used maple syrup instead of honey and used 2 table spoons less of white sugar. Used 3 medium over ripe bananas and almost one can of pumpkin. Used walnuts and no raisins. Cooked in the over for an hour and 5 minutes. The loaf came out perfect and not stodgy at all! The recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hidden Magenta"
},
"reviewBody": "These made 2 dozen lovely muffins. 175 degrees C for 20 minutes. I substituted coconut oil for canola and added some flaked coconut instead of nuts or raisins. Delicious flavours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joyce Renna"
},
"reviewBody": "Loved it!! Will make again!! Changes: 1 c all purpose flour; 1 cup almond flour; ½ tapioca flour. 1/6 cup olive oil 1/6 cup applesauce. I followed reviews and used 2 pans \n \n the foil pans after 35 min.\n ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VegLady"
},
"reviewBody": "I made a vegan version. No eggs, no sugar. Used cherry juice instead. No pumpkin spice. Used ginger instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooker"
},
"reviewBody": "I baked it at 325 for 90 mins. Came out perfect, delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitty Hendrickson"
},
"reviewBody": "Wonderful, it is supermoist, you can taste the honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SHELL49"
},
"reviewBody": "I wish I read the reviews instead of just looking at the stars. The darn thing just won’t cook in the middle. It has now been 55 minutes and it’s so dark. I want to go to bed but waiting for it. I might just call it quits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonny Bain"
},
"reviewBody": "Everyone at work has gobbled it up! I used a whole wheat pastry flour (that’s all I have), sugar free maple syrup instead of honey and no-cal brown sugar (Swerve) instead of white sugar. Might had some nutmeg next time. I made 2smaller loaves (couldn’t even get the batter in my 9x5 pan). Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ducky Shiraz McDaniels"
},
"reviewBody": "I wish I read the reviews before I made this. I would've added twice the spice, and either split it into two pans, or baked the loaf pan on lower heat for longer like someone in the reviews suggested. I had to bake it forever, and it came out very dry and overcooked on the outside and was rather bland overall. Not the best bread I've made. I'd like to try it again with the alterations and see if it comes out better. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Borders"
},
"reviewBody": "Great recipe! I took the advice of another reviewer and added some vanilla extract, chopped candied ginger in place of the raisins and an extra banana. The flavors are excellent and create a perfect amt. of sweet. I used my greased mini muffin pan instead of loaf or regular muffin pan for smaller portion size to equal less guilt : ) I bet these would freeze nicely if sealed well too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tomikitom03"
},
"reviewBody": "This bread is the bomb! I am going to make this again....so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DonnaLee Salt"
},
"reviewBody": "I made it exactly as the recipe states! It is moist and very tasty! Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jaime Ann"
},
"reviewBody": "HORRIBLE RECIPE INSTRUCTIONS! Cooking time for this recipe is nowhere near correct! 45 minutes at 350° in a 9x5 pan... not even close. it was still totally raw in the middle. The top appeared done, so I took it out. Toothpick was clean (as the loaf was large so I couldn't insert the toothpick even halfway down). Let it rest for 10 mins and attempted to lift it from the pan with the parchment paper that I lined it with. the whole middle was wet. I put it back in the oven for another 30 minutes and it STILL wasn't done. I had to taje it out anyway because the top was starting to burn, not to mention the loaf fell flat because I took it out at the state 45 minutes mark. NEVER using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taryn Renée"
},
"reviewBody": "It was good enough. Next time I would use blackstrap molasses instead of honey and brown sugar instead of white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katharine"
},
"reviewBody": "Very heavy, mushy and not very tasty. The directions for baking were just all wrong. I tried adjusting it according to some of the other comments but will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cutewolf320"
},
"reviewBody": "I didn’t use honey, and instead I used some extra sugar. Also, I used a little bit of soy milk to thin it out as well as using extra oil for the two eggs. It was really great while it lasted in the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Marie"
},
"reviewBody": "Loved this recipe! Made the changes as recommended: applesauce for oil, 1 tsp of pumpkin spice &amp; 1 tsp of vanilla. The only issue is that this recipe makes way too much batter!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariah Estrada"
},
"reviewBody": "this was easy to make and tasted fantastic! I didn't put any sugar in it and it was still very sweet, such a great recipe I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "h20alec"
},
"reviewBody": "I followed the recipe, but did not add the raisins. I used a 9x5 loaf pan, but it was way too much for the pan. The flavor was great, but messy when it overflowed the pan. I definitely make it again, but use two loaf pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tuffycatt"
},
"reviewBody": "Delicious! I reduced the sugar and honey in half, and added 1/2 cup semi-sweet chocolate pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Dodson"
},
"reviewBody": "Very moist and baked as directed with the exception of I added 3 ripe bananas. It needs more spices so next time I’ll add additional cinnamon, pumpkin pie spice and maybe 1/2 tsp of ground cloves. I actually had extra batter so I made 6 additional muffins and baked at the same temp for 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Olivia Snow"
},
"reviewBody": "I've made this recipe twice now and both times it has not cooked throughout. I have tried splitting the batter in to 2 load pans and the center still does not cook, just raw batter. the outer edges cook perfect and from what I've tried is really good, just wish the whole dish would cook correctly. any tips would help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cwabab11"
},
"reviewBody": "i just added an extra banana and just a small spoon full of greek yogurt...it came out amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Place-Paige"
},
"reviewBody": "I made following the ingredients exactly (except I used olive oil since I don't use vegetable) and per my husband they are very good. I think next time I will add a bit more spice to them. Otherwise, perfect. I made them into muffins since that's how we prefer to eat them. This is a keeper. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sword25"
},
"reviewBody": "So good ! Delicious ...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Taylor"
},
"reviewBody": "Amazing I added a mix of white and milk chocolate chips,perfect loaf for thanksgiving dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Appleoddity"
},
"reviewBody": "Just excellent. I replaced half the vegetable oil with 4 tbsp. creamed butter. Replaced half the sugar with brown sugar. And used 3 bananas instead of 2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jennifer Moulton"
},
"reviewBody": "I used the recipe as a starting point, not the recipe by itself. I took a lot of people's advice and decided NOT to bake this in a bread pan. Glad I did, because it STILL came out somewhat \"mushy\" on the bottom, while the top was crusty and brown. What I added differently was whole wheat pastry flour in place of all purpose (because of personal preference in using less processed flour). I also added about 3 or 3 and a half cups of cored, peeled, and sliced apples (a variety of them) because I had apples to use up. I also added much more cinnamon and less pumpkin pie spice (just personal preference again; I like cinnamon way more than pumpkin pie spice). All else was identical to the recipe given. Finally, I baked it at 350 degrees for at about an hour and 25 minutes. 45 minutes was way too short, even though I chose a much larger Corningwear dish (a 10 X 10 X 2 inches). With this big of a dish, it should not have been mushy on the bottom. I was afraid to bake it any longer for fear the top would become burned or too crusty. It tasted OK, but because of the mushy texture on the bottom, I won't be making this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Meredith-Gary"
},
"reviewBody": "I followed the recipe exactly! Except I had to bake an hour. Also I added a simple caramel drizzle on top and served warm with churned butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GooGooDad"
},
"reviewBody": "Was dense, but the flavors blended nicely. Did muffins, baked for about 28 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susie-Q"
},
"reviewBody": "I used stevia instead of the sugar but kept the honey and used a little less. The previous folks were all correct in the cooking time. I needed about 1hr 10 min to get it cooked through. It will make a great breakfast bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "I made a loaf and a few muffins. My son and mother liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Heffner"
},
"reviewBody": "Loved this. Like others, I added an extra banana. I also through in a cup of chocolate chips instead of raisins and walnuts. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matisse"
},
"reviewBody": "Excellent recipe! I made it into muffins with using whole wheat pastry flour since we were out of all purpose. I added 1 tsp vanilla which enhanced the flavors. I can’t believe how light and moist they are! I was a little worried since banana and pumpkin are two strong flavors, but it melds perfectly together. Thanks for the great recipe and addictive muffins. -Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kpete019"
},
"reviewBody": "The bread is delicious! I even substituted apple sauce for the oil and the bread was still amazing! The only adjustment is that you definitely have to cook it at leeeeast 15 min longer than the suggested time if not 20 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frozeninak"
},
"reviewBody": "I sub applesauce for oil, and I never add raisins or nuts, every now and then I add chocolate chips =) I've been using this recipe for a few years now and haven't found anything that compares to it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bellylaughs58"
},
"reviewBody": "This bread is mouthwatering and delicious! I serve it up warm (either fresh from the oven or zapped a few seconds in the microwave) with a little cream cheese slathered on top. Heavenly :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tootsabell"
},
"reviewBody": "This is a moist &amp; delicious loaf. I usually bake with whole wheat flour &amp; find that regular banana loaves dry out quickly but definitely not this one! The pumpkin helps to retain the moisture &amp; it doesn't last for long in our house! Thank you so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyn Valour"
},
"reviewBody": "My Husband declared this is a winner!!!!! And I should enter this in the county fair!!!! I agree! Yes, this is by far the best recipe ever!!!! Thank You...............And the Pumpkin does balance well with the banana.....Scrumptious!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracikaym"
},
"reviewBody": "This bread is Delicious, soooo good. I used the all spice instead, didn't have pumpkin. I don't want to say never- but, my banana bread recipe is outstanding , this is a whole other level of sheer greatness!!!(:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avidwalker64"
},
"reviewBody": "I made this bread according to the recipe but omitted the walnuts. It was delicious and a big hit in my house. I did have to add to the baking time. This bread is super moist and delicious. I'll be making it again. I like the combination of pumpkin and bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody N Jason Brazelton"
},
"reviewBody": "Great loaf. I use a mini loaf pan which makes 21 mini loaves and the 2nd batch I made I added mini-chocolate chips, but this recipe is perfect, just the way it is...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Z"
},
"reviewBody": "Ok, I do think this bread tastes awesome, but it came out gooey. I cooked it 30 minutes longer then it said. I feel the problem is that it should have made 2 loafs. It's away to much for 1 loaf pan. I added vanilla extract. I will try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David Payne"
},
"reviewBody": "It was great once I added some more time. I should've read the ratings, as I had to bake an additional 25 minutes. I did add foil to the top at the 45 minute mark, since it puffed up over the pan and had browned darker than I was expecting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "Made it for a friend, they liked it!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16706/banana-pumpkin-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
"name": "Pumpkin Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16706/banana-pumpkin-bread/",
"name": "Banana Pumpkin Bread"
}
}
]
}
}
, "about": [
]
}
]