				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Banh Mi"
,"datePublished": "2020-06-18T23:38:58.000-04:00"
,"dateModified": "2022-10-05T15:41:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "metzstar"
,"url": "https://www.allrecipes.com/cook/3426813"
}
]
,"description": "Love banh mi? Try this version of the popular Vietnamese sandwich featuring broiled chicken breast and tangy quick-pickled veggies on a crunchy baguette."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OnaqhPLhMiz4W2sLilxgnwVGOJM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1039590-b6adf2e911914758b3c4e0eec3bf11e0.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6319558710112",
"description": "",
"duration": "PT1M4S",
"name": "How to Make Banh Mi",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/07ce0091-8d3d-4b09-838b-055502f2fa7b/d49b8e97-ce17-43f9-b98d-529c675d0095/1280x720/match/image.jpg",
"uploadDate": "2023-02-05T11:33:46.720-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Banh Mi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "89"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "657 kcal"
,"carbohydrateContent": "85 g"
,"cholesterolContent": "43 mg"
,"fiberContent": "4 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "990 mg"
,"sugarContent": "30 g"
,"fatContent": "25 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 cup rice vinegar",
"0.25 cup white sugar",
"0.25 cup water",
"0.25 cup matchstick-cut carrots",
"0.25 cup peeled and matchstick-cut daikon radish",
"0.25 cup thinly sliced white onion",
"1 skinless, boneless chicken breast half",
"1 pinch garlic salt, or to taste",
"ground black pepper to taste",
"1 (12 inch) French baguette",
"4 tablespoons mayonnaise",
"0.25 cup thinly sliced cucumber",
"1 tablespoon fresh cilantro leaves",
"1 small jalapeno pepper, cut into 1/16-inch-thick matchsticks",
"1 wedge lime" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine rice vinegar, sugar, and water in a saucepan. Bring to a boil over medium heat, stirring until sugar has dissolved, about 1 minute. Allow the mixture to cool."
} ,{
"@type": "HowToStep"
,"text": "Place carrot, radish, and onion in a bowl. Pour in cooled vinegar mixture and let marinate at least 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "While vegetables marinate, set an oven rack about 6 inches from the heat source and preheat the broiler. Lightly oil a slotted broiler pan."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle chicken breast with garlic salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "Place chicken on the prepared pan and broil, turning once, until browned and no longer pink in the center, about 6 minutes per side."
} ,{
"@type": "HowToStep"
,"text": "Place chicken on a cutting board. Cut into bite-sized pieces."
} ,{
"@type": "HowToStep"
,"text": "Slice baguette in half lengthwise. Pull out the soft center of the bread, leaving a cavity for the fillings."
} ,{
"@type": "HowToStep"
,"text": "Lightly toast baguette under the broiler, 2 to 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Drain off excess vinegar mixture after vegetables have marinated."
} ,{
"@type": "HowToStep"
,"text": "To assemble the sandwich, spread each half of toasted baguette with mayonnaise. Layer chicken on the bottom half of the bread. Top with cucumber, drained pickled vegetables, cilantro, and jalapeno. Squeeze lime wedge over fillings and cover with top half of baguette."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OnaqhPLhMiz4W2sLilxgnwVGOJM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1039590-b6adf2e911914758b3c4e0eec3bf11e0.jpg"
}
]
,"text": "Cut into two 6-inch sandwiches to serve."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KALFAMILY"
},
"reviewBody": "Missing Maggi sauce on the bun. This is a key ingredient"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Mae"
},
"reviewBody": "😋 yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4sheri4"
},
"reviewBody": "I have made this sandwich many times since finding this recipe just a few months ago. It's delicious! I use thighs, though, and also I add a little hoisin sauce to the mayo. Wonderful! Incidentally, I am making it again tomorrow. Thank you for sharing! 🥰"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki"
},
"reviewBody": "Sub'd in shredded pork and marinated it in Korean BBQ sauce beforehand. Wonderful recipe, really easy to make and pretty flexible with the protein you use! I may try this with some seasoned Tofu next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodShowFan"
},
"reviewBody": "I love this recipe, and have made it several times, adjusting the seasoning/ ingredients it to whoever I’m dining with . It’s just a nice yummy sandwich, don’t over think it ,it’ll be satisfying all the same. \n\nThank you for including a very easy chicken method too, I love that it is easy clean up as well. If you can prep the veggies and the marinade ahead of time, it makes it even faster when your want a quick meal! I always regret not buying more bollilo/ hoagie rolls at the store, I can keep eating these if my belly allowed me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Javanthi"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Lalonde London Ontario"
},
"reviewBody": "Just need to add some garlic next time, it was great for our staff get together before Covid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robynjl"
},
"reviewBody": "I loved this recipe! I made it open faced because i liked lots of the pickled veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan S Danak"
},
"reviewBody": "The chicken was good but I want to make it with tofu sometime, and with a little something added to the mayonnaise from a traditional Vietnamese sandwich recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Grimmonpré Palmer"
},
"reviewBody": "We made this using up leftover pork loin that we had grilled the day before. They were amazing. My husband absolutely loved the crisp veggies with the smooth richness of the pate! Made it as recipe was written. Wouldn’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha P"
},
"reviewBody": "I made it with crispy pork belly, pate, kewpie mayo, slaw, jalapenos, cucumbers, cilantro and I buttered the bread. Amazing..Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zara Gibbs"
},
"reviewBody": "I made no changes, and I would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knitlove"
},
"reviewBody": "So good. Like sooooooo good! Made it vegetarian by subbing sliced seitan for chicken. I’ll admit it was way more work for a sandwich than I’ve ever done before, but it was worth it. Did I mention it was SO GOOD?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Grant"
},
"reviewBody": "My first banh mi attempt. This recipe was very easy to follow. I used rotisserie chicken, only because I didn’t feel like turning on the oven. I also spiced up the mayo. This was a hit with the hubby."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanlee"
},
"reviewBody": "I have always loved banh mi and am so glad to have found such an easy recipe so I can make it at home whenever I like! Only change I made was to add a teaspoon each of hoisin sauce and sriracha to the mayo. Adds wonderful extra flavor! And to save time I picked up a rotisserie chicken and used a mixture of light and dark meat for the sandwiches. Quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Cook"
},
"reviewBody": "This sandwich was fantastic! I made it for my girlfriends and they raved over it! I made a couple of changes but nothing major. I lightly blackened some Cod fillets and pan sauteed them. So much flavor and spice and I just think blackening spice is wonderful. Also, I couldn't find any radishes for my pickled veggies, BUT I did find Organic Baby Bok Choy and just cut the wilted ends and up the stalk to length of other veggies. Sliced lengthwise down the ribs and tossed it in the vinegar mixture. It was GREAT and nice presentation! I drizzled my mayo with Soy sauce and some used Sriracha, we all raved. TIP: Instead of cutting my veggies into matchsticks, I shaved them down with a potato peeler. Made the veggies lay nicely :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liliana Magdaleno"
},
"reviewBody": "I love a good bahn mi and this one was good! The BF has never had one and said this was the best thing I’ve made for him. Ok now for the changes: I didn’t realize I didn’t have rice vinegar so used what I had which was coconut vinegar. I left the veggies in the marinade bc why not! They stayed crunchy. For the meat, I had some deer meat I needed to use SO I used the SAME marinade (overnight as well) and cooked it using the broiler for a BBQ look, feel, and taste and wow everything worked so well. I will add a dash of soy sauce to the mayo next time around like the reviewers suggested for an extra KICK!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frenchy"
},
"reviewBody": "I make similar sandwiches regularly using ham, roasted chicken, or even roast beef. I never use mayonnaise (mustard for soome). As for the pickles, Make plenty, they keep well in the fridge. I always have a jar filled with carrots, daikon, onion, jalapeno, cucumbers etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delaine Carl"
},
"reviewBody": "So good! I added siracha to my mayo and put garlic and soy sauce on the chicken. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica323"
},
"reviewBody": "My kids love this. Followed recipe except for: marinaded the chicken in 1/4 c. fish sauce, 1/4 c. lime juice and a couple cloves of pressed garlic then added the salt and pepper before broiling/grilling. I added shriracha and the lime juice to the mayo instead of squeezing the lime juice on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terri lewis"
},
"reviewBody": "Only used the veggie part of this recipe. For the chicken I used the \"Shoyu Chicken\" recipe from \"Big E\" (on this site) - they are magical together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stevee Ohrt"
},
"reviewBody": "My mom makes these all the time and now I do as well. I never slice the bread before putting into the oven because you want the inside soft and the outside a bit crunchy. I put a little water on the outside before putting in oven. Some remove the soft inside, but I love bread so i leave it. A couple of key things missing from this recipe is salt for the pickled veggies. I don't bother boiling any of it. I just marinate for an hour or so. Also, THE SOY SAUCE. the combo of the mayo and soy sauce together is what makes this sandwich so awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duke"
},
"reviewBody": "Awesome! First time I've tried a Bahn Mi sandwich, but it certainly won't be the last. Followed the recipe as written, except I let the veggies pickle overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsMellie"
},
"reviewBody": "Love it! Made it vegetarian, with chicken, with pork... Any which way works with this recipe. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liz2008"
},
"reviewBody": "Love it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fancy Nancy"
},
"reviewBody": "I love Banh Mi and this recipe worked well for me. I made some changes to make this a little easier to prepare. I bought a pre-cooked Jenny-O Turkey breast and sliced thinly. I mixed Thai Peanut sauce in with the mayo and also mixed in mint with the cilantro which added a super fresh taste and flair to the sandwich. This recipe made it into my Recipe Binder as one of my favs. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "This recipe is always a big hit! I doctored my mayo with fresh garlic to create an aoli. I also marinated my chicken with some soy sauce and terriyaki to boost the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shawna"
},
"reviewBody": "I liked the ratio for marinating the veggies, and the instructions were easy to follow. My tweaks are that I used spicy sausage instead of chicken, and I also used a mixture of mayo and sriracha sauce on the buns that I toasted. I filled it with cilantro for a nice fresh spicy taste, my husband and I lOVE this sandwich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony Hesketh"
},
"reviewBody": "This was a fantastic sandwich! I made one small change, and that was to grill the chicken, essentially only because I was in the mood to grill. I also marinaded the chicken in soy sauce and rice vinegar with the garlic salt and pepper, and I think the saltiness of the marinade went nicely with the sweet and tangy of the pickled vegetables.\n\nA food processor comes in handy for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this was unbelievably awesome!! there was hardly any room for improvement but knowing me and bf, i cut the the sugar in half.. pan fried the chicken with some season salt and used a lot less mayo since bf doesn't like the stuff.. bf said this tasted just like the sandwiches at the vietnamese place up the street and said it was definitely a $10 sandwich.. only reason we didn't take a picture was because we didn't want to wait to devour it.. ty so much for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lilchef80"
},
"reviewBody": "I loved the pickled veggie recipe. The only change I made was to add Siracha sauce to the mayonnaise to make it more authentic. I also used smoked brats since that's what I had available, and it reminds me of what I've had at a food truck in Brooklyn. Next time I'll make the BBQ pork and add pate. Thanks for the inspiration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurenbrooktrout"
},
"reviewBody": "This was the best sandwich I've ever made. I did cook the chicken a little differently. I rubbed it with some coconut oil, cayenne pepper and cumin and pan seared it in coconut oil. Then I put it in the oven on 450 for about 15mins. The only other modification I did was using watermelon radish instead of daikon (couldn't find it). Me and my boyfriend both had seconds. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LFrog1386"
},
"reviewBody": "I have only had Banh Mi once in a Thai restaurant and wanted more. While this recipe uses chicken instead of the usual pork, it lacked none of the flavor of the original I tried. I forgot to buy a jalapeno pepper so I sprinkled some red pepper on the chicken and mixed some siracha sauce with the mayo. It's simple, easy, quick and delicious. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an awesome sandwich that is equally good with other meats such as pork or beef. The pickled veggies along with the cilantro make this sandwich. I did add chili garlic sauce to the mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Yummy, we love everything about it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robert"
},
"reviewBody": "can u say good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~Sheri~"
},
"reviewBody": "The whole family loved this recipe. I have only had Bahn Mi sandwiches from one vietnamese restaurant, I thought these were pretty darn close. I used broiled pork loin chops in place of the chicken. After making this once with the radish and once without, we all opted to forego the radish in the next batch. I also doubled the veggies to reuse again. Or I would decrease the liquids, there is a lot of waste. I found this to be a great weeknight dinner by making the veggies the night before and then broiling up the pork and compiling the sandwiches at dinner time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kick @$$ Chef"
},
"reviewBody": "I've been on the biggest Banh Mi kick of my life the past week, and I love this recipe! I didn't have any white radish on hand so I omitted it, but without it it was still great. I also like to dip it in thai chili sauce.. makes a great dinner without having to turn on the oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PAMELA D. aPROpos of nothing"
},
"reviewBody": "I used pork instead, marinated in a dash of Maggi, a 1/4 t dark soy, 1 t low sodium soy, then cooked in grill pan. I don't marinate the onion with the other veggies. They will turn the carrots brownish, not good if you want to keep extra on hand.\nI mixed MW with Sriracha and got it way too hot. YIKES!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi Rutan"
},
"reviewBody": "Wonderful recipe. I gave it 4 out of 5 because I don't use the chicken and omit the garlic salt of course. I make a pork roast rubbed with a paste of fresh garlic, ginger and lime juice and then sliced thin after cooking instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sushihorsey"
},
"reviewBody": "I love Banh Mi and was excited to learn how to make it. Surprisingly simple. I made the sandwich one day then used the leftover marinated veggies in a salad. Still pretty good in salad form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARA"
},
"reviewBody": "FABULOUS! I love the marinated vegetables and heat in this sandwich-so fresh tasting. I pan fried some chunks of chicken and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Made this just like recipe. Did use marinated grilled chicken. Sooooo good! MAde this several times now and have ended up doubling the slaw to have enough. Mmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FeverClone"
},
"reviewBody": "I am Vietnamese, and I just would like to say that 'Banh Mi' is literally translated as 'sandwich.' So, when you say 'Banh Mi Sandwich,' you're saying 'Sandwich Sandwich.' I do admire your own rendition of it, though! Good work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "trendypencil"
},
"reviewBody": "This recipe is a nice base for Banh Mi and those who are not familiar with Vietnamese subs/food. Adding additional ingredients could make this a much better a more solid Banh Mi. One key ingredient that was not mentioned here is the soy sauce which is typically added atop the mayo and for those feeling a bit more adventurous, duck/chicken pate. As far as meat goes, the most popular/common filling is the cha siu (xa xiu) pork which is a sweet BBQ pork that is grilled/fried (my personal favorite as it goes well with the pickled veggies). Chicken can be used as well, Vietnamese cold cuts, pork meatballs or even firm fried tofu for a vegetarian option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BudsGurls"
},
"reviewBody": "I used this recipe as my inspiration &amp; only made the marinade, adding 1/4 tsp. kosher salt. I'd had pork to use from a slow smoked butt roast which was moist &amp; wonderfully seasoned so I think any good flavored pork or chicken might work just as well. I let the veggies marinate 1 hour &amp; they were great - lots of flavor but still fresh &amp; crunchy! I lightly toasted just the crusts of my bagette, &amp; I used all the veg &amp; garnish suggested but added a dash of soy sauce over all because the mayo just didn't do enough, so I'll hafta figure that out next. But try it - it's a great sandwich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "Not as good as my favorite restaurant, but pretty darn close and probably healthier too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Dayle Windley"
},
"reviewBody": "My new favorite sandwich. Hands down. Thank you so much for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "afreund"
},
"reviewBody": "Delicious and easy! Next time I make it, though, I'll definitely include some chili garlic sauce (e.g. siracha) mixed in with the mayo to give it a bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sierdsmama"
},
"reviewBody": "I am on a gluten free diet so I served this recipe over rice and made a sauce out of the mayo/cilantro/jalapenos. It was good on its own and also wrapped in a warm corn tortilla! My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Lewis"
},
"reviewBody": "very good for my first try so I dont know what to compare it to but I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amymeri"
},
"reviewBody": "Really delicious. I used Sambal and non-fat greek yogurt in place of the jalapeno and mayo and added matchstick broccoli and cabbage to the veggies. This lowered the calories and added some nutrition. It was a fantastic sandwich. I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILOVERIVERS"
},
"reviewBody": "This recipe turned out great! Easy to make and super delicious, tastes just like the local Vietnamese Deli!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "Had this last night. really delicious. I grilled the chicken breast instead of broiling and used splenda in the pickle marinade instead of sugar. I had this with some thai cabbage chicken soup and really enjoyed my dinner. Leftovers tomorrow! YAY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MUSTANGKERI"
},
"reviewBody": "I've never had a Banh Mi before, but decided to look it up and try it because I watched The Great Food Truck Race with Nom Nom and it peaked my interest. So, I can't attest to whether or not it is authentic, but I will say, I followed this recipe pretty closely and it was delicious and very fresh. The only changes I made were I used a whole grain hoagie roll instead of a French baguette, and I mixed in Sriracha with my mayonnaise. My husband thoroughly enjoyed it and we plan on making more meat tomorrow to eat with the left over veggies I prepared. I'm letting the slaw marinate overnight as well, and expect it to be even more fantastic tomorrow. Definitely would recommend trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BenMosher"
},
"reviewBody": "Delicious. Recommend Duke's mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Clevenger"
},
"reviewBody": "I've never had one before so I have nothing to compare it to, but I think this sandwich is just delicious. I've made it 3 times now and the recipe is perfect as it is. It is quickly becoming a staple at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moms diner"
},
"reviewBody": "Almost a s good as my local VN place but without the pate(which i like). Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mollycurls77"
},
"reviewBody": "So flavourful! I really enjoyed the pickled vegetables, and I didn't find it time consuming to do at all. I used my julienning peeler from Pampered Chef and was done in a snap! I added siracha chili paste to my sandwich, instead of using jalepenos, as I felt the siracha would complement the flavours better. I will definitely be making this again. A wonderful summer time meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni-Mic"
},
"reviewBody": "This is sooooo good! I could eat this every day! The quick-pickled veggies are great-though a bit of a pain to julienne by hand-I LOVE THIS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEIOUSEI"
},
"reviewBody": "This was very easy and tasty! It reminded me a little bit of cole slaw, even though I love this and dislike slaw. I bought daikon at the farmer's market for the first time this week, and this was a great way to use it! I mixed a bit of sriracha hot sauce, a little garlic powder, and some dried cilantro in with the mayo. I don't care for cucumbers and didn't have any, so I skipped those. Unfortunately, the bread I used was not that great - my local grocery store's baguettes are somewhat unfortunate. I'll try and find a better bread for the next time, because it makes a huge difference! A word of caution: Be very careful when toasting the bread - mine was too close to the broiler and smoked up my kitchen in under a minute! Oops!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MomZilla (Evin)"
},
"reviewBody": "I loved this!!! The marinade for the veggies is OUTSTANDING, even though it's so simple. I marinated the chicken in soy sauce and chili paste for a bit before cooking, and made a cilantro mayo instead of putting cilantro on top (dont like the bits in my teeth) Just personal preference, I made the sammich open faced. ALl in all, a great try! Only 4 stars because the one at my local VN place is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Poppins"
},
"reviewBody": "We LOVE Banh Mi at our house, and I've been experimenting as well. I like the marinade for the veggies in this recipe, although I think the mayo needs to be infused with something to make it more authentic (at least, they do at our VN Baguette shop...) I tried adding garlic powder and a little Chinese 5 spice just to see. We loved it. Next we're gonna try the Asian BBQ Pork from Costco as a sandwich filler."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/187342/banh-mi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1032/main-dish/sandwiches/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/187342/banh-mi/",
"name": "Banh Mi"
}
}
]
}
}
, "about": [
]
}
]