				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Barbeque Tempeh Sandwiches"
,"datePublished": "2019-04-02T02:44:52.000-04:00"
,"dateModified": "2019-04-02T02:44:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JENNX"
,"url": "https://www.allrecipes.com/cook/519955"
}
]
,"description": "I hate tofu but love tempeh and this sandwich is tangy and tasty. My boyfriend and I eat this all the time. It&#39;s great because it&#39;s vegan for him and I still like it (even though I&#39;m not a vegetarian)."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iaOMz5nupyho1Mnw21k1VFjz63Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/178682-8a8e1c18b98e4ccc876bfc8e40ebc48d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Barbeque Tempeh Sandwiches"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "164"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "375 kcal"
,"carbohydrateContent": "55 g"
,"fiberContent": "3 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "925 mg"
,"sugarContent": "20 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup barbecue sauce, your choice",
"1 (8 ounce) package tempeh, crumbled",
"1 tablespoon vegetable oil",
"1 red bell pepper, seeded and chopped",
"1 green bell pepper, seeded and chopped",
"1 medium onion, chopped",
"4 kaiser rolls, split and toasted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pour the barbeque sauce into a medium bowl. Crumble the tempeh into the sauce, and let it marinate a little, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a skillet over medium heat. Add the red and green peppers, and the onion. Cook, stirring frequently until tender. Stir in the tempeh and barbeque sauce, and heat through."
} ,{
"@type": "HowToStep"
,"text": "Spoon the tempeh mixture onto kaiser rolls, and serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abbyz2000"
},
"reviewBody": "I used half homemade BBQ sauce and half Sweet Baby Ray's. Really good! Our first time eating tempeh and everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Buff Cree Barr"
},
"reviewBody": "Darn good. I made mine with no oil (veggies were water sauteed), two green peppers instead of one red and one green and put it on a toasted bagel open face."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dads Got An Apron"
},
"reviewBody": "All 6 of us loved it.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This was my first time eating and cooking tempeh. The recipe was quick, easy and delicious. I didn’t alter anything and would definitely make this bbq recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jennS"
},
"reviewBody": "Recipes was good; should’ve used tofu instead of temph"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Manning Finnical"
},
"reviewBody": "Quick easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Truhan"
},
"reviewBody": "I'm a baby vegan and this is the first vegan dish I have ever made. I was a bit apprehensive at first but it came out delicious. I didn't use the red pepper because the one I bought seemed like it turned but aside from that I followed the recipe exactly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melanie Kies Stefanovicz"
},
"reviewBody": "We couldn't get over the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Uhlemann"
},
"reviewBody": "Great idea! The BBQ sauce was a little overwhelming. Next time I'll use a traditional sloppy Joe recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artmom"
},
"reviewBody": "I will definitely make this again! I absolutely loved it! I made my own barbecue sauce. It was a hit at my house from ages 3 to 39! The tempeh was such a great texture and flavor! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eilee"
},
"reviewBody": "First time that I cooked with tempeh and was pleasantly impressed. Unfortunately, the first time that I bought it I was intimidated as I had just started on a vegan diet and so it spoiled. \ni won't let that happen again. I have two other bottled sauces in the frig. \nThai peanut sauce and curry sauce. Can't wait to try them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Micrathene"
},
"reviewBody": "I did cook the tempeh in vegetable broth for 1/2 hour as suggested. I used the multi-grain tempeh. Use a barbecue sauce you really like and it is absolutely wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jlgomez"
},
"reviewBody": "made this as written and we both loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catara"
},
"reviewBody": "Over the last couple months I have been transitioning into a vegetarian. I made this recipe today and it was delicious! Definitely can replace meat barbeques. This will be a regular in my household from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb B"
},
"reviewBody": "I will definitely make this again. Read a few who said tempeh is better after cooked in vegetable broth. That's what I did. Didn't have any green or red peppers, so I added mushrooms and onions and a garlic clove. Crumbled hot tempeh, added to the mix and added Smoky Jon's BBQ sauce. Amazing. First time tempeh user."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Carver"
},
"reviewBody": "This was my first time eating tempeh. I'm still confused about if you're supposed to cook the tempeh beforehand or not. I opted for a bbq sauce without high fructose corn syrup. First bite...my thoughts were \"bitter!!\" I added agave nectar to cut the bitter flavor which worked very well. It took a few bites to adjust but by the end of the sandwich the bitter flavor actually started to grow on me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Dreyfuss"
},
"reviewBody": "I love this recipe; it's absolutely perfect. Another review recommended simmering the tempeh brick in vegetable broth before crumbling it, which is a great idea. In the past, I have marinated the tempeh in pareve (vegetarian) chicken broth before cooking it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anita Feeda DaFamilia"
},
"reviewBody": "Mme and tempeh are just never going to be friends. This tasted weird, I guess the combo with the green pepper and BBQ sauce and weird texture/savory like flavor of the tempeh just turned me off. My family was kind enough to eat the one sandwich I gave them but there was also no other food prepared so I guess they HAD to eat it but refused seconds. (Unusual for sure) I'm sure it worked for others but if you know you already don't like tempeh I don't recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AmyllyLace"
},
"reviewBody": "Looking for a new recipe that is ready in minutes? This simple vegetarian meal uses common grocery store ingredients. Don't be intimidated by the tempeh if it's your first time cooking/eating it. It is a great meat substitute that is equally dense &amp; satisfying. I would be really picky with my choice of BBQ sauce because it is definitely the deal breaker. The one I used was too sweet for my taste. If I had known how much sugar was in the Annie's variety, I would've picked something else. It was still a good tasting burger that got me full fast. But it lacked all the classic ingredients of a real American burger like the lettuce, mayo, tomato &amp; cheese, which is why I think this burger is more like a sloppy joe. I used Trader Joe's organic grain tempeh &amp; Annie's organic BBQ sauce (sweet &amp; spicy) on gluten free white bread. I would definitely make this again, but with a different BBQ sauce and additional toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat Smith"
},
"reviewBody": "Easy recipe, not much pizzaz."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "awakenedone"
},
"reviewBody": "Absolutely delicious! The only thing I did differently: I added some of my homemade jerk seasoning rub to the tempeh and barbecue sauce and let it marinate for over an hour. I also drained the veggies after sauteeing, before spooning it into the marinated Tempeh. My first time eating and cooking with Tempeh and have to say it was a wonderful experience!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jenny0802"
},
"reviewBody": "I may make this again. For a tempeh recipe it's very easy and simple, which is nice. I'd use a little less bbq sauce. My kids didn't like it, but I figured they wouldn't with the peppers and onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pomme"
},
"reviewBody": "No reason not to like this one. A good introduction to tempeh and one the whole family can enjoy especially those who may not be on board with being vegan/vegetarian. I steamed for 20 minutes the organic tempeh, added 4 chopped baby bella mushrooms I had on hand and used Sweet Baby Rays Original barbeque sauce. I used Earth Balance spread on kaiser roll and toasted on top of stove. Will definitely make this one again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lulu43"
},
"reviewBody": "I really liked this even without boiling the tempeh first. I added garlic like others have said. I'm not much of a cook so love how easy it was. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brianne Kerr"
},
"reviewBody": "Last night was the first time I had tempeh and it was amazing in this recipe. My husband is a vegan and I am not but I am willing to try different things. I'm not sure it could have tasted better! Will definitely be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jwilke"
},
"reviewBody": "Great, very easy and quick recipe! First try with tempeh, and it was delicious. I only used half an onion and one green pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NMChef1"
},
"reviewBody": "I'm an omnivore, and like vegetarian-style dishes well enough, but I'd never had tempeh until I ran across this recipe. I made it exactly as written, and thought it was OK - not weird or icky, but not particularly yummy either. I did note that I thought the \"4 Kaiser rolls\" wasn't enough. I'd actually bought 6 of them, and still had some of this recipe left over. I guess I just don't like overfilling my sandwiches and making a mess. This is probably a nice sloppy-joes-like recipe for vegetarians, but I probably won't make this again, though I'm open to another recipe using tempeh sometime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chefdnasty"
},
"reviewBody": "It calls for too much BBQ sauce. Drowns out all other flavor. Next time I'll use 1/2 cup. I'll make it again due to simplicity but will probably doctor it up a bit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Justice Yost"
},
"reviewBody": "This completely satisfied the craving I've had for sloppy joes since we went vegetarian. I recently discovered tempeh and my husband had the idea to try it in a barbecue/sloppy joe fashion so I went to good ole Allrecipes and found this. I made my own bbq sauce due to a lack of any pre made in my cabinets (ketchup, sugar, worchestershire sauce, etc) and we loved it. I, too, put it with some mayo-based cole slaw and it was fantastic. So fantastic, in fact, that I was sad my husband got the leftovers for lunch the next day before I did. Oh well - better luck next time (and there will totally be a next time!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IeleenL"
},
"reviewBody": "I loved it! I didn't change anything about it, it was good the way it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "staceyrain"
},
"reviewBody": "I liked this quite a lot. I wouldn't boil the tempeh or do anything other than the recipe called for, unless you have a strong aversion to tempeh. I didn't find any funny aftertaste and I served them to a meat lover, albeit adventurous eater, and he liked it a lot as well. Smells delicious while cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chris Kimball Fan"
},
"reviewBody": "This recipe was just okay for my family. I followed all the tips I found in the reviews. It was the first time we had tried tempeh, and we used the 3-grain type. Didn't care for the texture. Might try again with a different type of tempeh that doesn't have big seeds in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsRosenberg"
},
"reviewBody": "Fast, easy, relatively healthy, and pretty delicious! My husband and I thoroughly enjoyed this (and neither of us are vegetarian). They are kind of like vegetarian Sloppy Joes. We will be eating this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrjlaramie"
},
"reviewBody": "This was awesome! I boiled the tempeh in vegetable broth for about 10 minutes and let it marinate in the bbq sauce overnight. I used Annie's organic bbq sauce, smoky maple flavor. I used about 2/3 of each pepper and about 1/2 of the onion. I'd never had tempeh before but I couldn't stop eating this and had it for lunch at work several times. As others have said, the sauce will probably make or break this recipe. So easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "demintedmint"
},
"reviewBody": "Think I was expecting something more along the lines of a sloppy joe, so was a tad disappointed. If I finely chop everything up next time, then we'll get there. This recipe makes alot. I ate it as sandwhiches and dip over a week. Stubb's BBQ sauce is good with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Cook"
},
"reviewBody": "hey, tastes like bbq sauce, but crunchier! \nmade it just like the recipe and it was good. Not sure about the comment of tempeh being bitter. I never had it before, so just tried it straight. Strangely enough, it just tasted like soy beans!\nbrand was Westsoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LROBDROB"
},
"reviewBody": "It was pretty good (my first tempeh ever). I made my own BBQ sauce using tomato sauce, agave and spices. Instead of putting it on a bun, I used it as a topping for a baked sweet potato. Very healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jayhawkur"
},
"reviewBody": "Amazing! I've been vegan for over 7 years and haven't had BBQ since, and this was like a major (cruelty-free, i might add) blast from the past! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alice Gonglewski"
},
"reviewBody": "Sorry, but this was pretty mediocre by our taste. Perhaps the kind of barbecue sauce that we use for meat dishes wasn't the right flavor to mix with the tempeh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rianna"
},
"reviewBody": "Great base recipe but a must in preparing tempeh is steaming beforehand to take the bitterness away. What I do is grate the tempeh instead of cutting into small pieces. The smaller the tempeh the better it can soak in the marinade. After grating the tempeh, I steam for 30 minutes and then follow the recipe as is. Believe me – steaming tempeh beforehand will greatly improve the taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "A"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shea28"
},
"reviewBody": "This was one of my first vegan cooking efforts and it turned out pretty great. I added two cloves of garlic &amp; black beans, then seasoned with salt, pepper &amp; a bit of paprika.\n\nServed on thin whole wheat buns with lettuce and avocado. Will make again for a quick weeknight recipe! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vanessa B."
},
"reviewBody": "Great idea that covers the flavor of tempeh (which I don't like, but my vegetarian boyfriend loves). I wouldn't add peppers next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimihend2"
},
"reviewBody": "Delicious!!! Boiled tempeh for 8 minutes, marinated in BBQ sauce for 30 minutes, fried in pan for 5 minutes until hot, then mixed with already cooked vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bboggs"
},
"reviewBody": "This is easy to make and really good. I'll be adding this to my lunch rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesley"
},
"reviewBody": "This recipe deserves 5 stars! It is wonderful as is, but I have tweaked it a bit to suit our tastes. I add kidney beans because they add additional body and texture. I have always liked them in Sloppy Joes, even back when I made them with (ugh) ground beef. I also do not use quite as much bbq sauce as called for. You will find that these are enjoyed by vegetarians and meat-eaters alike. A great meal any time, but especially awesome when you have a houseful of people with an assortment of eating styles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cupcake Princess"
},
"reviewBody": "I'm a vegetarian, and I love the flavor of bbq food. This was a pretty good substitute for a bbq pulled pork sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Shoeman"
},
"reviewBody": "Haven't made this yet, but read some reviews. I think a lot of the people who gave bad reviews didn't know to steam the tempeh for 20 mins. in a steamer or simmer for 20 mins in veg. broth before using in ANY recipe. It removes the bitter taste, after which, the tempeh will rock and so will the recipe! I can't wait to try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abirleffi"
},
"reviewBody": "Very tasty. We ate them like sloppy joes the first time and then as a dip with chips and a dallup of greek yogurt on top. It had great texture with added red kidney beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the \"most helpful\" review which was the first one stating to boil in broth and then lightly brown in the pan. The tempeh did not taste bad at all.. in fact, it didn't really have much of a taste at all. BBQ sauce was the only thing i could taste. Don't get wrong, i love BBQ sauce and pretty much any condiment known to man, but this was a little over the top. MIGHT make again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PA_Foodie"
},
"reviewBody": "Great vegetarian alternative to my meat-ful summer BBQ! As recommended in other reviews, I simmered the tempeh in stock for 30 minutes before beginning this recipe. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Carr Prusha"
},
"reviewBody": "My daughter made this as written and did not like it. I took the advice of another reviewer and slow cooked as he instructed and we both loved it. My husband also loved it. Next time I will steam it first as a few bites did have a slight bitter aftertaste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cedar Canyon Ranch"
},
"reviewBody": "Very good. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "These are a delicious alternative to bbq sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mainemom"
},
"reviewBody": "Very good sandwich, really more like a sloppy joe. All the sauce covers the taste of the tempeh somewhat so it's a good way to introduce this food to non-vegans. As noted, please cook tempeh first. I sauted and crumbled it first, then drained on paper towels while sautéing veggies (along with garlic). Will make again--I have all that barbecue sauce left!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "~Added a little garlic and cumin to the peppers/onions.\n~Substituted vegetable oil for coconut oil.\n~Memphis smokey BBQ sauce.\nThis recipe makes a LOT! But it works out because it's easy to reheat and eat again. \nIt turned out really good, but adding a little extra spice definitely helped.\n\nThis is a really good BBQ fix for vegetarians!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "wyhodges"
},
"reviewBody": "not really edible. this may have been due to me not soaking the tempeh at the beginning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Arnold"
},
"reviewBody": "One of my all time FAVORITE all vegan meals. So cheap &amp; easy to make! I make this all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "You absolutely *have to boil tempeh before you do anything else to it. Simply boiling the tempeh in water for 5-10 minutes will remove the bitter taste. Boiling the tempeh in veggie broth for up to 30 minutes will remove the bitter taste and add more flavor to the tempeh. I would also recommend marinating tempeh for *at least* an hour, but truly, overnight is better. Two stars because the recipe would be okay if the tempeh is at least boiled beforehand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Lee"
},
"reviewBody": "Texture takes some getting used to if you are haven't tried tempeh, but the flavor was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mld815"
},
"reviewBody": "First time I ever tried tempeh. This was really good. If you did not know there was no meat you would think this was a sloppy joe sandwich. I used Sweet Baby Ray's Sweet and Spicy BBQ sauce. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JADE1977"
},
"reviewBody": "I've tried something very similar and it was great. Will be trying this recipe soon. Just wanted to point out that saying \"I hate tofu but love tempeh\" is like saying \"I hate apples but love honey\" One has nothing to do with the other. Tofu is soy beans tempeh is rice and other grains. Also, tofu is great, IF prepared right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonlady"
},
"reviewBody": "delicious, my first time making something with tempeh! obviously choice of tempeh and barbecue sauce makes or breaks this recipe. i used trader joe's 3 grain tempeh and loved it. will experiment with different bbq sauces!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethieb163"
},
"reviewBody": "I didn't have any peppers, and I've never had tempeh before, but this was delicious! I will definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Courtney Becka Radley"
},
"reviewBody": "My friend John makes the BEST BBQ sauce I have ever tasted. I was never a big BBQ fan but I love his sauce. I recently went vegan so I was a little sad when I couldn't have any of John's brisket one day, but we brought home a jar of his sauce. I had some tempeh in the fridge but wasn't sure how to prepare it til I saw this recipe. Since I was new to tempeh, I didn't want to waste the sauce in case I didn't like it, so I only made enough for one sandwich. I used just a tiny bit of red and yellow peppers (what I had on hand) and opted not to use onion as I knew the sauce already had a kick to it. I think two entire peppers and an entire onion would be way too much for four sandwiches, unless you're just a big fan of them. I didn't have kaiser rolls so I just used some thin burger buns. I wasn't sure what to expect with the tempeh. It was good, but very crunchy. I heard somewhere to steam your tempeh first for about 10 minutes so I think I'll do that next time. But overall I thought this was really good. I really do think it has a lot to do with what sauce you use. Make sure you have one that you know you love already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cagirlsoul"
},
"reviewBody": "Very easy - and super delish! I added lots of finely chopped veggies and served on whole wheat deli thins with sweet potato fries and salad! SUPER YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DummyCook"
},
"reviewBody": "FANTASTIC! One thing I cannot do is cook but this recipe was a cinch! Delicious and simple to make, I think 1 cup of canned sloppy joe mix would work great in place of the barbecue sauce also. Thanks for sharing this recipe. This is something I will make often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqueline Davis"
},
"reviewBody": "The whole family loved these and my hubby and 7 year old had seconds. My 4 year old and I were extremely full, so good. We will be making this again. *The secret is defiantly the BBQ Sauce, I bought Bull's-Eye Kansas City Style* (no high fructose corn syrup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moemoev"
},
"reviewBody": "This was SO easy, and so delicious!!!! I put coleslaw in my bun. I wanted to eat just one sandwich, but when I finished it, I had to have another. One of the best vegetarian recipes ever! I will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "I could eat this for days!! Seriously amazing. My first endeavor with tempeh and what a great one. Used Stubbs BBQ sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladypants"
},
"reviewBody": "Very delicious! Great flavor and texture. I didn't have onions so would have been even better if I did but I loved it anyways. I added a little granulated garlic to the mix as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Ruppenstein Dunegan"
},
"reviewBody": "I love tempeh and my homemake bbq sauce, so this recipe was great! Only one other reviewer mentioned cooking the tempeh first- it is a must! Tempeh in an uncooked food and heating it up in bbq sauce is not sufficiently cooking it. It must be simmered first or it is hard to digest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sugar jones"
},
"reviewBody": "You MUST brown the tempeh by frying with olive oil before adding to the other ingredients. It is so much better that way. Otherwise, nicem quick hearty recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raina Van Cleave"
},
"reviewBody": "YUM! I was looking for a \"healthy\" alternative to BBQ. Made some whole grain garlic bread and used yellow pepper, onion, adoboe, garlic, and carrots. Put the BBQ tempeh on top of hte toasted garlic bread and topped with cheese for an open faced bbq sandwich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ezmars"
},
"reviewBody": "This is so good! I used Irene's BBQ Sauce (which is a recipe on here, and awesome), and didn't change anything else except I added the sauce and tempeh before the peppers were tender and let the whole thing simmer for a while. Definitely enjoy this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SOLYVIVE"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Wood"
},
"reviewBody": "Delicious. My tweeks: I added a couple of cloves of garlic to the saute mix instead of onion. When I did add the bbq sauce, I added a dash of apple cider vinegar and cumin, cayenne pepper, garlic salt, minced onions, pepper, honey and paprika to taste- I think this upped the flavor quite a bit. Thanks for this idea...it's a very delicious recipe. Oh, and I microwaved the buns for 20 seconds to steam them rather than toasting- I like the texture better that way, plus it's quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "testarossa11"
},
"reviewBody": "This is great! Even my meat-eating husband enjoyed it. Made just as instructed (with only green pepper) and believe it will be in regular rotation in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennrlb"
},
"reviewBody": "Delicious! As a vegetarian with a non-vegetarian family, I am always looking for versatile recipes the whole family will eat, and this was a winner! I doubled the tempeh but reduced the veggies a bit for my pickier eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kfehrer12"
},
"reviewBody": "Yum! This is so good. Thanks so much for sharing this recipe. I had no idea how to prepare tempeh. This was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieQ"
},
"reviewBody": "This dish was delish! The only change I made was to add about 2 cloves of garlic to the onion/pepper saute mixture. My husband and I really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debsox"
},
"reviewBody": "the 3 grain tempeh is definately tastier. I also like to marinate the tempeh (I cube it instead of crumble) in some soy sauce and garlic powder (add a bit of pepper, cayenne a splash of vinegar whatever your bbq sauce and or family needs/likes) before I go full force with the BBQ suace. This is a good vegan \"but could add cheese\" could feed to non adventurous type of sandwich serve with fries/ chips and a salad etc..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So delicious! The first time I tried it, I hated the taste of tempeh. After researching a bit, I found out that I should boil the tempeh for at least 10 minutes to get rid of the bitter/pungent taste. I boiled the frozen 7 grain tempeh I had for 10 minutes, in water enough to cover, and it worked! I used hickory BBQ sauce for mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cranappleberri"
},
"reviewBody": "So delicious! The first time I tried it, I hated the taste of tempeh. After researching a bit, I found out that I should boil the tempeh for at least 10 minutes to get rid of the bitter/pungent taste. I boiled the frozen 7 grain tempeh I had for 10 minutes, in water enough to cover, and it worked! I used hickory BBQ sauce for mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookfor4"
},
"reviewBody": "This was a hit everyone liked it, even the kids! I did simmer the tempeh in vegetable broth for about 30 min. before marinating it in the barbeque sauce. (I used a recipe from this site called 'A very popular BBQ sauce') I followed the recipe except I added minced garlic to the peppers and onions. After I mixed everything together I let it simmer on the stovetop for 30 min or so. Served it on potato rolls with corn pudding. Thanks for sharing, we will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALOUISE"
},
"reviewBody": "Absolutely delicious!!! I will make these for friends who give me a hard time for being vegetarian. They will ask for seconds guaranteed. I served this to my family with coleslaw which was the perfect compliment to these sandwiches. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "4Travelers"
},
"reviewBody": "This was good. It all depends on your sauce. I would add a lot more peppers and veggies next time. My kids wouldn't eat it but I'll keep trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna Bates"
},
"reviewBody": "I only used one pepper based on other reviewers suggestions, and for us that was the perfect amount. I followed the recipe exactly for the rest of it. The flavors blended well and the tempeh really absorbed the flavors of the bbq sauce. Overall a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "I prepared the tempeh like an other reviewer mentioned. I boiled it for about 20 minutes in vegetable broth and used a mesquite BBQ sauce. The texture takes a little getting used to if you think you are about to bite into a sloppy joe like sandwich. Overall a good recipe to use if it's your first time with tempeh. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Ann"
},
"reviewBody": "This is phenomenal! I followed the suggestions to rinse the tempeh in cold water and to add garlic and hot sauce to the BBQ sauce. This is something I will definitely be making often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sierra"
},
"reviewBody": "What a great way to use Tempeh! I used a Meijer Gold Spicy chipotle Barbeque Sauce and used a purple pepper. Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VeggieCarrie"
},
"reviewBody": "I tried this recipe when my sister and her family were visiting - her oldest daughter is a vegetarian, and her husband is a meat-and-potatoes guy. The only thing I changed was adding a couple of cloves of minced garlic to the vegetables and used 2 green peppers instead of 1 green, 1 red... and EVERYONE, my brother-in-law included, ate this right up and wanted more! What a terrific, easy recipe and it turned out to be such a crowd pleaser! This is one of those good ol' standby recipes for me now, I make it as often as possible. It's pretty handy, too, for a single person because the sandwich filling keeps very well in the refrigerator and reheats very well too. Thanks for a terrific, quick, easy meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Do yourself a favor and make your own red or yellow barbeque sauce. Add an extra cup of water or vegetable broth (I use homemade pastes) and simmer in a slow cooker until the water evaporates. The vinegar does something to break down the firm and sometimes rubbery texture of the tempeh. This comes out much like a shredded/pulled pork barbeque sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKIEMONSTER121"
},
"reviewBody": "This was an awesome recipe! I am a college student always looking for fast and easy vegetarian dishes and this definitely ranks near the top of satisfying and simple. Tempeh is easy to keep around and extremely versatile for any of those think about trying it out. I just happened to have these ingredients (minus the rolls) so I just sliced the tempeh and peppers into strips. It actually takes away the whole sandwich part of the recipe but was equally as delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Knancy"
},
"reviewBody": "I followed the recommendations and used a smokey bbq sauce. Then I added some white button mushrooms and garlic to the saute. Very easy and tasty recipe. I will definately make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "My meat-eating husband and I (a vegetarian) both really like this sandwich. It's fast, easy, tastes good and has a nice texture. My only complaint is that it has too much pepper and onion (and I love peppers and onions). We used half of what the recipe calls for and will still reduce the amount when we make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Hall-Bailey"
},
"reviewBody": "This was okay. It was my first recipe with tempeh, and I am thinking part of it was I am not crazy about it. The kids and my husband did like it, so it is worth trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "philocrates"
},
"reviewBody": "Used wild rice tempeh and homemade BBQ sauce. Excellent. Used a very good Italian Roll for the bun.\n \nNote to those who don't like tempeh. Not all Tempeh is created equal. I don't like Soy Tempeh but love multi grain [3 grain, 7 grain, 12 grain] tempeh and Wild Rice Tempeh. However there are even more flavors available. Brands also differ. If you don't like one, you might like another."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evie"
},
"reviewBody": "This was my 2nd attempt at cooking with tempeh and I'm sure now that I do not like it. However, this recipe actually made it somewhat bearable to eat which is why I still gave it 4 stars."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46960/barbeque-tempeh-sandwiches/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46960/barbeque-tempeh-sandwiches/",
"name": "Barbeque Tempeh Sandwiches"
}
}
]
}
}
, "about": [
]
}
]