				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Basic Fondue"
,"datePublished": "2018-03-21T12:18:19.000-04:00"
,"dateModified": "2022-09-19T13:40:32.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KATKRO"
,"url": "https://www.allrecipes.com/cook/454835"
}
]
,"description": "An easy cheese fondue recipe without wine but with big flavor from Cheddar, garlic, mustard, and more. Perfect for dipping bread or vegetables."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Cdd9ayB3GGzKmix8G3mGz86dEdg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9109882-20a5f8fdeb214befa95892d60b201c13.jpg",
"height": 960,
"width": 1011
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Basic Fondue"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "210"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "49 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "12 mg"
,"proteinContent": "3 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "72 mg"
,"sugarContent": "0 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 cups milk",
"3 tablespoons all-purpose flour",
"1 tablespoon Worcestershire sauce",
"2 teaspoons ground dry mustard",
"1 clove garlic, peeled and crushed",
"6 cups shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together milk, flour, Worcestershire sauce, mustard, and garlic in a medium saucepan over low heat. Heat until almost boiling."
} ,{
"@type": "HowToStep"
,"text": "Gradually stir in Cheddar cheese. Continue heating until all the cheese has melted."
} ,{
"@type": "HowToStep"
,"text": "Keep the mixture warm and melted in a fondue dish."
} ]
,"recipeYield": ["64"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen W."
},
"reviewBody": "So perfect! I did use about 20% Swiss to make the fondue a little creamier and less oily from the cheddar. We love this with pretzel bites, tator tots, carrots, apples and celery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "hpknits"
},
"reviewBody": "Followed the recipe exactly, it was very thin. Had to add a cornstarch slurry, almost 1/4 cup and 4 ounces of cheese more. Flavor was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBK"
},
"reviewBody": "Very easy to make! I prepare it in my fondue set. My family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tia Pennell"
},
"reviewBody": "This recipe is great if you are avoiding alchohol. But if you want that traditional fondue then I would recommend another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark2"
},
"reviewBody": "Glad for a recipe without alcohol so I can feed it to my kids. When the recipe says \"low\" heat it really means med-low. Turned out great and my kids and wife loved the flavor as it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Samantha Grimes"
},
"reviewBody": "i reduce the recipe but had to add extra milk because it was doughy. i tasted ok. i wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jonathan Comyn"
},
"reviewBody": "It is a really good fondue. I would make it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MariW"
},
"reviewBody": "It's nice to have an alcohol free fondue recipe. Another substitute for alcohol is to use 3/4 Apple or grape juice and 1/4 fresh lemon juice. The lemon juice acts as an emulsifier in place of the alcohol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Very tasty and melted like a dream. Used Heinekken in place of beer, and a squirt of mustard instead of dry. Kept warm in a crockpot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Nichols Ellsworth"
},
"reviewBody": "Yummy!! We felt the need to add in 1/2 cup of Pennsylvania lager. And it turned out fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carolyn Ellsworth"
},
"reviewBody": "YUM!!! Happy New Years Eve tradition! :-) Just as it is. thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nadja Croft"
},
"reviewBody": "Always a good idea to read the reviews BEFORE making the recipe! I followed the recipe and got a texture that was not smooth and I am sure I would have liked the beer substitute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sargis25"
},
"reviewBody": "Great fondue! It's easy to make. We use this for nachos or just dipping cooked broccoli, carrots, and bread into. It makes a lot and doesn't heat up very well because it separates so we make a batch just big enough for us to eat right away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SerpentineScarlet"
},
"reviewBody": "This recipe is basic and beautiful. It is also infinitely adjustable to taste using white wine, beer, cream, etc. You can use any mixture of cheeses in place of the cheddar. You can also substitute cornstarch for the flour. Or tapioca starch if you have wheat or corn allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Adams"
},
"reviewBody": "I love this cheese fondue recipe. I like that it doesn't require alcohol. We eat it with sliced apples, baby carrots and homemade bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CDrum"
},
"reviewBody": "Came across this recipe by googling \"simple fondue\". This was a project for my 14 year old's French Class. I was encouraged by the reviews that stated that it would reheat well and it did! Made the night before, refrigerated and sent it in to school with him. I got 3 text messages from him that said \"everyone loves it\", then \"my class is hovering around it\" then \"the bread is gone.\" So, it's a hit with the middle school set. I gave it 3 stars because I believe that either the mustard or the worcestershire sauce was causing the milk to curdle. On the 2nd try, I did not stir in the mustard, worcestershire or garlic until the milk and flour had almost come to a boil. Then I pulled it off the heat and added those ingredients before the cheese. Worked fine that time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hansbrea"
},
"reviewBody": "Thanks for sharing the fondue recipe. Most have some form of alcohol and glad to find one that doesn't. Can't wait to try it with me new Velata fondue warmer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenifer"
},
"reviewBody": "used 1 can of bud light in place of milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookieCritter"
},
"reviewBody": "Fondue purists will hate me, but I read this all milk recipe and immediately though - mac n' cheese. It added 1 extra clove of garlic and mixed the fondue into cooked pasta and it was delicious. One thing to note, if you use pre-shredded cheese, you may need to cut back on the flour slightly since it already has a little flour on it to keep it from sticking together. The fondue tasted great, but a little on the thick side. I'll try this again with beer as other suggested, and I'll even use it the way it was intended :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal Velte"
},
"reviewBody": "Made this fondue for a girls night - everyone loved it! I used the suggested modification of decreasing the milk and adding beer. I had a lot left over and made it into a yummy breakfast casserole for the next morning. To make the breakfast casserole I melted the left over fondue, added more milk, eggs, and browned sausage, then poured it over sourdough bread cubes (also left over from my party). I refrigerated the casserole over night, then topped with shredded cheddar cheese and baked at 350 for 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "habsle"
},
"reviewBody": "Tried to make a smaller amount and followed the instructions accordingly. Did not come out right. Was grainy with no cheese flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "charming"
},
"reviewBody": "I used 1 cup of half &amp; half, and 1 cup of stella artoir beer instead of 2 cups of milk. also, used 1 tbs of flour and 2 tbs of cornstarch to coat the cheese. I first mixed everything in a pot then on the electric fondue. All I needed to do was turn up the heat and add more beer to loosen the cheese up. It was a hit at a baby shower this weekend and for a girls lunch!!! I also added some left over cheese I had...smoked gouda and mozzarella the 2nd time I made it. We dipped, bread, mushrooms, broccoli, carrots, green apple slices and pretzels!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "basg101"
},
"reviewBody": "I've always been curious to try fondue and this was my first shot. Following other reviewers I used half milk, half beer (all milk would have been bland) and cut the cheese to four cups. I used garlic powder instead of fresh garlic, and soy sauce instead of Worcestershire sauce. It was robust and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "molfettosue"
},
"reviewBody": "I made this exactly like the recipe states, I didn't add the beer like others suggested since I was serving it to my kid. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janevieve"
},
"reviewBody": "Used homemade Canadian Pale Ale in place of milk. Excellent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "symbol"
},
"reviewBody": "Delicious! Dipped bread, broccoli, and mushrooms with great results. Perfect fondue!\nI'd only ever had Gruyere-based fondues that use wine/alcohol. They are tasty, but not everyone likes the flavour left over by the spirits/wine. This alternative was a big hit all round!\nMade with a really good quality, aged cheddar. I highly recommend trying this recipe the next time you're thinking fondue. I would especially recommend this recipe to first-time fondue-ers.\nThank you, thank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Musu"
},
"reviewBody": "I tried this with 1 c beer and 1 c milk as most suggested. It is pretty good but I still think mine is better. I didn't care for the mustard, and I prefer to use half &amp; half instead of milk, and white wine or sherry instead of beer. Only about 1 cup half &amp; half and 1/3 cup wine or sherry. You can also use skim milk for mine in a pinch. I'm not sure how I feel about the Worcestershire sauce yet. I prefer mine nice and garlicky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blue PolkaDot"
},
"reviewBody": "Very easy to make. I made this for New Years Eve. Stick to the recipe even though it doesn't look enough. I made the mistake to doubled it but I shouldn't have because there was so much left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kyle"
},
"reviewBody": "I am not sure what I did wrong, but this did not taste good after being allowed to sit. I followed the recipe except added fat free cream instead of skim milk (which were my only choices). I will try again and use a different type of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patriciasmommy"
},
"reviewBody": "This was good. Served it at a baby shower. All though it did kind of taste just a little off for me. Oh well, it's prpbably just me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MY10HUNGRYKIDS"
},
"reviewBody": "Delicious! I followed the recipe exactly except I omitted the ground mustard since I was out of it, and I tossed the shredded cheese with some flour as recommended by another review . It turned out perfectly, and the entire batch fit perfectly into my 2 quart mini crock pot, on \"LOW\", where it stayed the perfect temp for our dinner. The kids loved dipping all sorts of fun veggies in the yummy fondue, and I loved how fast and easy it was to throw together. Thank you for sharing this gem of a recipe, this is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "superterri128"
},
"reviewBody": "Switched the milk for a light beer and coated the shredded cheese in flour. We made the fondue in an electric fondue pot following the directions, and served with a baguette, apples, carrots and broccoli! Yummy - will definitely make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susanmc"
},
"reviewBody": "For smooth cheese, pre-flour shredded cheese before melting. I works wonderfully. Tip I learned while working for a national fondue resturant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshinesteva"
},
"reviewBody": "Wonderful! I even used the leftovers on Mac &amp; Cheese and my hubby loved it! He asked me to never make it the old way again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Savvy Chef"
},
"reviewBody": "I took the advice of the other reviewers and did 1 cup of milk, and 1 cup of beer (We had Sam Adams Oktoberfest on hand.) It was delicious. We dipped french bread, apples, and veggies. We followed the rest of the recipe precisely with the exception of the ground mustard because I didn't have any."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "woodchurch"
},
"reviewBody": "Use beer instead of milk! Surprise: We accidently made more than we could eat, and it tastes just as good microwaved the next day after spending the night in the refrigerator."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Very good. I halved the recipe since it was just for me and my hubby, it was more than plenty. I usually make a white cheese fondue so this was a nice change and easy! Suggestion- if you use flour you are chancing it not being smooth. Sometimes flour clumps or gets gritty. My advice, I got this from all my other fondue recipes and did do it for this one, use cornstarch instead of flour. Use the same amount the same way you use the flour or you may coat the cheese with it and then add it to the liquid. Cornstarch doesn't clump and breaks down better than flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ma luetjen"
},
"reviewBody": "This is a great basic fondue recipe. Meaning...it's flexible. I've made it several times now, following the basic liquid to flavor suggestions, but improvising and it keeps getting better and better. I replaced all the milk with (dark)beer - it made it especially tart, but yum. Tonight 1/2 milk 1/2 vermouth. Best yet! Also crushed 3 heads of garlic into it, rubbed the fondue dish with garlic, and added a bit of lemon juice to help melt the cheeses smoothly. (Learned that here - Thanks All!) I have used different cheeses. Tonight with the vermouth was cheap store brand swiss and a jalepano montery jack. I have never used 100% cheddar in any of these attempts, sorry i don't have good feedback there. Served over all these times with, bread (old pumpernickel was the best), little turkey meatballs, steamed broccoli, asparagus, and green apples. Worchestire and dry mustard makes it and should be to taste..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nickythunberg"
},
"reviewBody": "i followed the original recipe and it turned out with a weird texture, i dont know kinda like apple sauce, i probably missed something, im a beginner,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim M"
},
"reviewBody": "Tasted good, but I didn't follow other reviewers advice and toss the cheese with flour - and I had a mealy-grit like consistency! (I'm sure it's the cooks fault, not the recipe!) I did sub half the milk for beer and used half sharp cheddar and half a blend of white cheeses (Italian blend maybe?) Will make again, b/c I love fondue!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kara"
},
"reviewBody": "Easy to make and mild flavor. I used it for my little ones to eat with dippers. They loved it. And my husband played clean-up. Lacks the bite of fondue with alcohol in it, but it worked for my little crew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LaurelPDX"
},
"reviewBody": "Like others advised, I used beer instead of milk and rubbed the fondue pot with a clove of garlic before adding the other ingredients. This is not the smoothest fondue but very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Crabbcakes"
},
"reviewBody": "I followed the directions exactly, except added 1 cup milk and 1 cup beer. The cheese just clumped together, and never blended with the liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karriec"
},
"reviewBody": "This recipe can also go in the freezer. Just let thaw completley and then reheat. I also added 1 tsp of liquid smoke, 3 cloes of garlic and double the dry mustard. It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle911"
},
"reviewBody": "not what I had in mind... I was looking for a rich creamy flavorful fondue. I'll try another recipe next time. Sorry :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rbecks09"
},
"reviewBody": "Great the way it is, next time we make it we'll probably add spinch, and maybe something with a bit of a kick ( like hot peppers) We served this dish with fresh veggies, and had bbq meatballs as a side. Overall very good and basic mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nargle"
},
"reviewBody": "awesome and super easy! i reduced the cheese by one cup and added 3/4 cup dry white wine. it worked perfectly and the kids loved it; a new xmas eve tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mckellister"
},
"reviewBody": "I was looking for a fondue recipe to try out my new fondue kit, and found a couple 5 star recipes but the cheeses were quite expensive. Then I found this one which is much less expensive and decided to try it. It met my expectations overall. I personally was not crazy about the flavor, which seemed really cheddary and not at all like swiss fondues that I have had. However, I got tons of complements from other guests at the party, who thought it was delicious and were excited to hear that the main ingredients were cheddar and beer. So, if you are looking for an authentic fondue recipe to impress your foodie friends, this is probably not the one - but if you are going to bring it to an ugly sweater party and eat it alongside stew and 3 buck chuck, you will be pleased with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CARTOONRCKR"
},
"reviewBody": "I can't imagine eating this with milk. I used the same amount of beer, which came out to about one and a half bottles of beer. I just used some cheap Michelob Ultra (leftover from our wedding lol), and it tasted perfect. Huge hit at work. Also, I didn't use a saucepan. I just did everything in the fondue pot. No need for that extra step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gnm"
},
"reviewBody": "This was very simple and very good! Used the milk only (no beer) and put in a bread bowl! YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry K"
},
"reviewBody": "So simple and so tasty. To make sure the flour didn't lump, I melted a small amount of butter before adding the other ingredients. Also added some buttermilk and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Faith W."
},
"reviewBody": "My only complaint with the recipe was that it didn't say why type of cheddar to use. I use sharp or extra sharp and it had a good flavor. Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanners"
},
"reviewBody": "Made this with beer and garlic flavored cheddar. Nobody could stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "palmer"
},
"reviewBody": "Good basic recipe, really good with some french bread and veggies! Like everyone said, beer in place of milk gives it more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Now this was great! I just took it inmy head to make cheese fondue one night and pulled this reciped and it was wonderfully easy to make. I took the suggestion and substituted the milk for beer and it came out very good. I served it with some home made bread and we ran out of bread were dipping anything we could into it :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "I tried with beer as others suggested. I don't think I liked the beer. You could definitely taste it - and I do like to drink beer, just didn't like the taste in the fondue. Will try again without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tommy"
},
"reviewBody": "Basic and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant's Mommy"
},
"reviewBody": "Great low-budget recipe!!!! I followed the revision that used 1 bottle of beer (used Firestone Double Barrel Ale), and just used cheap Costco Kirkland brand sharp cheddar and it was very tasty for a inexpensive Valentine's Dinner. Cut french bread cubes, green apple, carrots, celery. Granted, the cheddar tastes much different than using the normal swiss/french cheese recipe, but the flavor from the beer made it suprisingly good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Callister"
},
"reviewBody": "So delicious and easy! I did half beer and half milk as well and thought it was amazing. Great consistency, great flavor. This will definitely be our go-to cheese fondue recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KristinLeanne"
},
"reviewBody": "I took others suggestions and used 1 cup milk and 1 cup beer. It turned out great. Very cheesy. I served it with french bread. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "awatkins2"
},
"reviewBody": "I tried this and used half milk and half beer like other people said to do. It was awful I would not recommend this recipe without some serious alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ty hensley"
},
"reviewBody": "pretty good I have make it a few times with different variations but prefer to use beer or 1/2 beer and milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "This was marvelous!!! I did follow the suggestions of others and substituted one of the cups of milk with a light beer. I did have trouble with the cheese clumping, but the flavor was awsome. I will make this again and try some of the other suggesstions for fondue, such as tossing the cheese with a little flour and using a little lemon juice. I can't wait to have this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SPMURRAY"
},
"reviewBody": "Kind of bland, but a good basic starter to add to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried all beer instead of milk and it had a bit of a bite. Next time I will use half beer and half milk. I followed other reviewer's suggestion about coating shredded cheese with flour. The tip works well. The floured cheese blended into the liquids perfectly and without a problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mari Agliata Jeranek Errico"
},
"reviewBody": "We enjoyed this recipe. I had to use a bit more flour (used sauce thickening flour) to get it to a thicker consistency. But, overall an easy, kid-friendly fondue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodie mama"
},
"reviewBody": "This recipe was very easy to follow, very quick to cook, and delicious to eat. We dipped cubes of french bread and red pepper spears in it, and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FLOUNDERGIGGING"
},
"reviewBody": "I can't understand why someone would rate a recipie less than 5 stars when they don't follow the recipe. Excellent Recipe. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "It didn't taste that good at all. I tried to adjust it a little bit and add the beer that everyone has bin suggesting to do and it still didn't turn out. Next time i will not put in the dry mustard cause i think that's what made it not so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggi B"
},
"reviewBody": "I made this for a Thanksgiving appetizer. I used beer as so many others have suggested to give it that zing. I used a Pale Ale. It was a hit. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yummy mummy"
},
"reviewBody": "Really good flavor. I followed the other reviews and added some beer for flavor as well. I used this in a fondue fountain, but it turned solid after an hour. Any ideas on how to keep it creamy &amp; moving?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JESSJOYE"
},
"reviewBody": "Pretty good for a basic fondue. No single flavor stood out or overpowered any of the other flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "alittleless"
},
"reviewBody": "We didn't enjoy this at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mightymiri"
},
"reviewBody": "Pretty good. My guests enjoyed it. I will most likely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "amanda"
},
"reviewBody": "The flavor was okay but I did not like the consistency. I have made fondue before which turned out perfect. It coated the bread and veggies. This didn't coat it just ran off. It also was not smooth like the other fondue. Sorry but this is a no for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "Not impressed, I used half beer and half milk as suggested by other reviewers. The mixture was far to soupy and the cheese melted and stayed in a big ball, not as smooth as I'd hope it would be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennyB81"
},
"reviewBody": "I Loved this recipe! It was my first time making and eating fondue. It was wonderful. My husband loved it also. I didn't have Cheddard so i used Colby-jack, and I didn't have wine so i just left it out. I also put the flour with the chees before melting it, and it worked great. We dipped Asparagus, French Bread, and Steak. Will Definetly make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trisha King Pehrson"
},
"reviewBody": "Slightly thick but delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lsego"
},
"reviewBody": "This recipe is awesome, better than the Melting Pot in my opinion. I cut the recipe in half and used 1 garlic clove, 1/2 cup of milk and a 1/2 cup of Amberbock. As other users had suggested I coated the cheese with flour and then added it to the liquid. I added the milk, beer and worcestershire and after it heated up a little bit, the milk curdled. This did not affect the taste or texture of the fondue. More than enough for two people. I used garlic sourdough bread and granny smith apples to dip in the fondue. Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "buggymom"
},
"reviewBody": "I use a similar recipe that always comes out perfect. Instead of milk, I use beer, and I use half cheddar cheese and half swiss. I have never used flour, but I may try it sometime. We dip bread cubes, chicken apple sausage, raw califlower and apples. My husband requests this all the time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lily1"
},
"reviewBody": "I used 4 cups of cheese and about an extra cup of milk it was still stringy. My family thought it was good, and it's easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. Penny"
},
"reviewBody": "Totally easy, this is my new starter fondue recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Creating Beauty"
},
"reviewBody": "It was a good fondue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellee Santiago"
},
"reviewBody": "Substituted the milk with beer, and this was by far the easiest and most delicious fondue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOSTAZURE"
},
"reviewBody": "It was a very good fondue. We added 1/2 c white wine and it made a huge impact on the flavor. We will definitely make this recipe again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSDEVA"
},
"reviewBody": "Big hit! This is what I did.. 1 cup of dark beer ( I used black and tan) and 1 cup of milk. I was so worried after reading other reviews that this wasn't going to turn out but it was great! Will definatly be making again. i served this with carrots, sourdough bread and granny smith apples. Tasted just like The Melting Pot. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lilly"
},
"reviewBody": "It tastes like broccoli but I just wanted a plain cheese fondue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erika"
},
"reviewBody": "I LOVED this cheese fondue! My boyfriend wasn't very excited about making a \"cheddar cheese\" fondue as we generally make or order fancier (and pricier)cheese fondues, but we were both pleasantly surprised. We made this with a bottle of kileans irish red beer and plain shredded sharp cheddar. Soooo good. We're making it again for Valentines day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Fuller"
},
"reviewBody": "Very good! Most cheese fondues call for such expensive cheese, so this is a nice, cheaper alternative. I use 1/2 milk and 1/2 beer (the darker beer the better!). I also add a bit more Worchestershire sauce because I love the flavor. Good stuff! This recipe does make a lot - I usually halve it and it's more than enough for an appetizer for 4 people, with some leftovers too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MacKenzie Hanson Duenow"
},
"reviewBody": "Not very impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SPEEDYCIVICGURL"
},
"reviewBody": "yuck! I used the beer instead of milk and thought it was sooo gross!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ALLYDAVIS"
},
"reviewBody": "The taste was prety good but the texture was too grainy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alex's mommy"
},
"reviewBody": "I tried this for Thanksgiving and it went over well, however, I only used 3 cups of cheese, 3/4 cup of milk and 1 cup of beer. I added more worsterchire sauce and mustard for extra zing. I also tossed the cheese with flour prior to melting and it was smooth as can be. We dipped granny snith apples, and pumperniclke bread. Very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nanaimo"
},
"reviewBody": "Alright, everyone agrees that it's better with beer. This is the version I've been using:\n\nINGREDIENTS\n1/4 cup butter\n1/4 cup flour\n1 tsp. Worcestershire sauce\n1/4 tsp. dry mustard\n1 bottle (12 oz.) beer\n3 cups old Canadian Cheddar cheese, shredded\n1 Baguette, cubed; each cube with crust\n\nINSTRUCTIONS\nIn saucepan, melt butter; blend in flour, Worcestershire sauce and mustard. Gradually stir in beer; stir until mixture comes to a boil. Reduce heat; add cheese, stir until melted. Transfer to fondue pot; place over low heat. Serve with bread cubes.\n\nThis recipe makes less so you can have it for two, and it tastes better because it uses beer. The older the cheddar the better the results. Add a few drops of lemon juice to help it melt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BECKYR718"
},
"reviewBody": "It was good...I'm still looking for a great fondue!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather MacDavid"
},
"reviewBody": "This fondue has a really good flavor and it's SO easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "4EVERCROPN"
},
"reviewBody": "I followed recommedations to substitute beer for milk. Since I did that, I would rate this a 5/5! It was unbelievable! I will definitely make it again, but highly recommend the beer. I took the beer and added enough milk to make 2 cups of liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "As written, I thought this was rather bland. I ended up adding a splash of white wine, Gruyere cheese, and ground black pepper. The tip about tossing the grated cheese in flour was really helpful - the texture wasn't grainy at all. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PerkyStone"
},
"reviewBody": "Yum! tastes just like the melting pot's! i half the recipe so it will all fir in my fondue pot. i also substitute a cup of beer for the milk. I serve it with apples and panera sourdough bread. it is also good with broccoli and carrots. I also usually add 2 small cloves of garlic, but i love garlic."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24624/basic-fondue/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
"name": "Cheese"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/433/appetizers-and-snacks/cheese/cheese-fondue/",
"name": "Cheese Fondue Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24624/basic-fondue/",
"name": "Basic Fondue"
}
}
]
}
}
, "about": [
]
}
]