				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Basic Truffles"
,"datePublished": "2018-03-21T12:18:27.000-04:00"
,"dateModified": "2022-07-14T18:09:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Gina Mork"
,"url": "https://www.allrecipes.com/cook/24323491"
}
]
,"description": "This is a basic truffle filling to which you can add your own flavorings or extracts. You may use this to fill the chocolate shells you make using candy molds or roll into balls then into powdered sugar, cocoa, sprinkles or other toppings"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KLai59nrhPDwL2m5NvcJv3BFqMw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/529419-8ddcbefb3ef64560a9c701a361355934.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Basic Truffles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "131"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "62 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "1 mg"
,"sugarContent": "4 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"12 ounces bittersweet chocolate, chopped",
"0.33333334326744 cup heavy cream",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium saucepan over medium heat, combine chocolate and cream. Cook, stirring, until chocolate is melted and mixture is smooth. Remove from heat and whisk in flavoring. Pour into a small dish and refrigerate until set, but not hard, 1 1/2 to 2 hours. Use to fill candies or form balls and roll in toppings."
} ]
,"recipeYield": ["35"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S Mash"
},
"reviewBody": "This is a awesome Truffle recipe. We started making these with different flavors and sell these at our shop. We sell out everyday, and actually have people requesting more. But with other candies and cakes we can't stop to make more. I may have to double the recipe of the mornings and make twice the amount. Thanks so much for all the reviews and suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "rjbrungard"
},
"reviewBody": "Ugh! I love chocolate! This is too bitter. The cream does not help in anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rain68"
},
"reviewBody": "Bittersweet chocolate is not the chocolate to use for these. Next time I'll use dark chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janja"
},
"reviewBody": "This is what I had ben looking, the original basic truffle recipe, bittersweet chocolate, cream and vanilla. Truffles are supposed to be creamy but have a bittersweet taste to them.\nI have made variations of this recipe, added cinnamon to the cream to give the truffles a cinnamon taste, poured the gauche into different bowls to flavor them, rum, brandy or other flavors. \nOne method that I have tried and like a lot is to bring the cream to a slight boil, turn it off and let it cool, repeat, and on third time heating to a slight boil then remove and stir in a bag of 60% Ghirardelli. Put the bowls in the fridge to cool land roll the chocolate into balls.\nThe brand of chocolate, as someone has stated, affects the taste, smoothness and sensation of the decant treat in your mouth, cheap is a blah doesn't taste good, good quality chocolate has a great feel and taste. Others are better than Ghirardelli, but I can't afford them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Schofield"
},
"reviewBody": "I loved this recipe. I used one teaspoon of vanilla extract and one teaspoon of peppermint extract and Fair Trade 70% cacao. We rolled them in sparkling sugar. The sparkling sugar does add a significant amount of sweetness, so I wouldn't recommend it with a lighter chocolate. Next year I plan to use leftover candy canes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey E Wrobel"
},
"reviewBody": "What an adaptable recipe! I made a cafe mocha version because I had coffee liquor on hand, but I can easily imagine a coconut version by using coconut extract and then dusting in sweetened coconut, or even almond version...must try more ways to enjoy this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChiCookieCrazy"
},
"reviewBody": "Simple, easy and rich. I splurged for the ghiradelli chocolate chips and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ariell"
},
"reviewBody": "I used organic bittersweet chocolate so it was good quality chocolate. I added 2 tbsp. of Bailey's after I took the melted chocolate off the heat and the chocolate 'seized' -- became a grainy, gritty mess. I put it in the fridge anyway to cool and it became a solid hard block of chocolate. No way that I could scoop anything. I tried to eat it as is but it was so bitter. \n\nIn reading other recipes I think this recipe is just off and would not use it again. There really doesn't seem to be enough cream for that much chocolate. Other recipes have 1/2 cup of whipping cream for that much chocolate. Also chocolate should NEVER be heated over medium heat! It's too easy to scorch it and ruin the chocolate. You should either use a double boiler or LOW heat. And if you don't like bittersweet chocolate, you're not going to like bittersweet truffles. I would use milk chocolate or a mix of bittersweet and milk chocolate. Better yet, I'll find a different recipe. Definitely won't be using this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tiffany Henson Pajak"
},
"reviewBody": "My first attempt at truffles and they taste good. My husband and I preferred a powdered sugar coating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosie McClain"
},
"reviewBody": "This was better than I expected"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "perfect and easy to do. very elegant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "This is the best recipe! I added some butter ... And it worked out perfectly!My parents and sister love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BGCOOK"
},
"reviewBody": "These taste okay but they are difficult to work with. I end up putting the mixture in my cake decorating tube and piping it into molds that I have already prepped with hardening chocolate. Then I add more hardening chocolate on top and they come out okay. I made the recipe with cream cheese this year and found the consistency much better to roll and then dip. I think the cream cheese recipe tastes better too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "lol I made them into Christmas critters they taste sooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "raschelk"
},
"reviewBody": "I followed the directions for this recipe exactly, and although the truffles certainly weren't bad, they were rather grainy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BamWhat16"
},
"reviewBody": "I tried this recipe,and had delicious results,except that the batter melted in my hands as I rolled them. I think I skimped a little on the heavy cream,or maybe because I used semi-sweet chocolate chips. I hope to try this recipe again very soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SAMJJ"
},
"reviewBody": "Very easy. I used half vanilla extract, half peppermint. After they were shaped, I chilled them some more, then dipped in white candy coating and drizzled with red."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn S"
},
"reviewBody": "Delicious recipe! I added bourbon soaked walnuts and coated them in powdered sugar, they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Crawford"
},
"reviewBody": "I rolled mine in Bits O Brickle which is the toffee part of a Heath Bar. I ran them through the processor for a couple of seconds and rolled away. If I would have known that Truffles were this easy to make I wouldn't have been paying 3.00 for one, and these are A LOT better! Excellent recipe. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ambo"
},
"reviewBody": "These were amazing. I have to admit I was intimidated by the process, but they turned out great. I found it to be key to pour the ganache in a shallow dish - that way it cools consistently. It was quite the undertaking to roll these into little balls. Next time I will use a melon baller to make them all the same size. I did three batches over 2 days - rolled some in finely chopped walnuts, others in sprinkles (for the kids) or coconut. I also added mint extract to one batch, and rolled those in powdered sugar. Last batch was Kahlua, rolled in cocoa powder. Everyone raved over these - from my 87 year old neighbor down to the 1 year old. I'm making again for our Christmas Eve gathering, and to give to neighbors as gifts. A keeper, for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snuffles"
},
"reviewBody": "I made these yesterday for a baby shower tomorrow. I made 3 different flavors. I had a lot of s'mores items that I hadn't used, so I added 7 large marshmallows with \"about\" 1/8 cup of extra cream to the cream and chocolate while it was heating, then added the chocolate. After letting cool, I rolled them into balls and then into crushed graham cracker, let cool, then dipped in melted chocolate and sprinkled with graham cracker. I made white chocolate peppermint by mixing Ande's peppermint chips with white chocolate (about 3/4 to 1/4 ratio), and covering with white chocolate coating. The last kind I made was raspberry nut. I substituted the vanilla flavoring for \"about\" 2 tsp of raspberry, rolled in nuts, then chocolate coating after freezing for a while. They are all great, and I think the people at the baby shower will love them. I used Ghirardelli, Hershey's and Nestle for the insides and Baker's for the outsides."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRey"
},
"reviewBody": "wow. This dish is so dangerous for me! I made it as stated and then rolled the balls in crushed heath bar bits. It was amazing! I ate WAY too many because I just couldn't help myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cstarz"
},
"reviewBody": "A couple of minor changes...pour the ganache into a lined baking an or frame and smooth. Let it sit at room temperature overnight. Instead of round truffles, you can cut into strips for squares, triangles or rectangles. I also substituted irish cream for vanilla, a little heavier handed than 1 tsp, and it was amazing. Spend the money and get E Guittard, Callebaut or Valhrona. It's worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FilthyMidget"
},
"reviewBody": "I have never made Truffles before. This recipe was easy &amp; very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ethel B."
},
"reviewBody": "So very easy and it was easy to change things. I didn't have any Amaretto, but I had Amaretto flavored Agave Nectar and it worked just fine. I also added some chopped pecans. WOW"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bchis"
},
"reviewBody": "Very good base recipe to do some wonderful things with! I followed exactly, added peppermint extract to some and dipped in rich milk chocolate. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne W."
},
"reviewBody": "This is exactly what it claims to be - a basic truffle recipe - easy to make and easy to adjust to one's tastes. Granted, I am a truffle-making novice, but not new to chocolate dessert making. I will definitely keep this one to use again.\n\nAfter reading several of the reviews that said they were too hard, I added extra liquid flavoring to my first batch. When they turned out way too gooey (though they'd make a delicious filling), I reexamined the recipe. I realized that the Ghirardelli chocolate I'd bought was only 10 oz - not 12, like other brands of the same form. The 2nd batch I made, I went strictly by this recipe, and the consistency was perfect - soft and silky, but not melty or mushy. \n\nI don't know if perhaps the type of chocolate others used played a factor in their dryness - or altitude, moisture in the air, etc. But for me, these proportions were a great start. \n\nI've tasted truffles that were more light and fluffy, and I'd like to find a recipe for those in the future, but I discovered in my searching that there are many different ways of making truffles - I imagine those are an advanced version (not a \"basic\")."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lawrence"
},
"reviewBody": "Do not cook chocolate over an open flame. You should prepare truffles one of two ways. Either over a double broiler or adding hot cream to cold chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "corinnedobson"
},
"reviewBody": "these were awful. way too bitter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TribePride"
},
"reviewBody": "This was super easy (though it got pretty messy for me when it came time to roll the chocolate into balls) and produced great results. I used Ghirardelli dark chocolate and shaped it into 10 larger balls and rolled them in either powdered sugar or cocoa powder, both of which made for delicious truffles. As far as the creaminess goes, these were just what I was looking for. (I also tried making a different truffle recipe on this site that called for about the same amount of chocolate but 2/3 C cream, and thought those were much too creamy and gooey, at least for rolling into balls. They might work better if used as filling inside a harder chocolate.) This recipe, however, was perfect for rolling in toppings. It's also VERY rich. Thanks, Gina!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Modo3000"
},
"reviewBody": "they were defiantly the consistence I needed, however they were a bit bitter for my tastes,...I will have to try again next year"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cobb1121"
},
"reviewBody": "This is a perfect base recipe for making different flavors of truffles. I made 2 batches in 4 different flavors. They came out perfectly. The first batch I made with semisweet chocolate and 1/2 was coconut coated with toasted coconut flakes and 1/2 was rum coated in crushed Heath toffee bar. The 2nd batch was made with milk chocolate and 1/2 was peppermint rolled with crushed peppermint and 1/2 was vanilla caramel rolled in chopped hazelnuts. \n\nThey came out perfectly!! This is now my truffle go to recipe. It is perfect because I can change flavors, toppings, and types of chocolate and make a variety of truffles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gobomel"
},
"reviewBody": "These are very good, but my recipe is 1 lb. of semi-sweet chocolate to 1 c. heavy whipping cream, 1 tsp. flavoring of choice, 1 tsp vanilla. They come out smoother and the center is not hard. Don't forget to chill the mix before trying to shape into balls. The mixture will be too soft. So chill for 1/2 to 1 hr., then scoop out of the pan with a melon baller or a cookie scoop. They come out nice and round. Then you can roll in the topping of your choice...nuts, powdered sugar, chopped peppermint candies, etc.\nNOTE: I have also used assorted coffee creamers for the flavoring added to the cream and it comes out very nicely. You can also add hazelnut flavoring &amp; chopped hazelnuts, then dip in melted chocolate to mimic one of my favorite candies...Ferrero Rocher!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "These are good, and can support any number of variations. I made 4 flavors for Valentine's Day this year: 60% cacao (bittersweet) rolled in cocoa powder, dark chocolate mint (bittersweet chocolate, mint extract) coated in semi-sweet chocolate, milk chocolate coated in semi-sweet, and coffee creme brulee (milk chocolate, creme brulee creamer instead of cream, rum extract instead of vanilla) rolled in instant cafe lattee powder. There were all a pretty big hit. My only issue was they were not QUITE as smooth/creamy as I'd hoped. It may be the quality of the chocolate I used? Or possibly just a bit more cream would help?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajwright"
},
"reviewBody": "Turned out wonderfully. Make sure you don't leave them in the fridge too long before making them into balls or else it is too stiff to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I was disappointed with this recipe. I was expecting a smooth consistent texture and what I got was quite dry and hard (drier in the center than on the edges for some reason). I used a high quality chocolate chip $$ that I normally do not purchase. I feel that they were wasted on this recipe. I thought the cream would make it -well- creamier. But that does not seem to be the case. I will keep looking for the perfect truffle recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MamaT-bird34"
},
"reviewBody": "I have never made truffles before...so this recipe would be great for a beginner or anyone who is on a bit of a time crunch. Add whatever flavour you want with this recipe...I did two batches..I took the advice of one reviewer and added 3 Tbsp of Kahlua to one..which didn't have a kahlua taste to it at all. I also added some mint extract...very nice. Will make this recipe again, I suggest to anyone trying for the first time to freeze the mix before you roll..it's very messy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nbehymer"
},
"reviewBody": "I tried these and they were so bitter I couldn't eat them.I think maybe next time I try I will use milk chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Shadbolt"
},
"reviewBody": "I am no expert at making candy, in fact this was the first time I ever attempted it. It was so easy to make these, and it took me about 4 hours to make 200. I made 6 different varieties, and they were all great. I made the regular recipe, coconut with coconut extract instead of vanilla and rolled in toasted coconut, mint made with mint extract and rolled in crushed peppermint candies, almond made with vanilla extract but with toasted almonds in the chocolate and rolled in raw crushed almonds, raspberry vanilla (this variety required 1 tsp vanilla and almost 2 tsp raspberry extract), and mocha, which I made by blending some flavored coffee powder into the chocolate mixture and rolling in a blend of the coffee and cocoa powder. A few hints: save yourself some grief and buy a chopper (I used mine for the chocolate, candies, and nuts). Have the chocolate, cream, and extract ready before you begin melting the chocolate. It is easiest to roll and cover the chocolate if you wait until the chocolate has set firm. Then scoop the chocolate, warm it in your hands, and roll into ball. Also, I was very concerned it would be difficult to get the toppings to stick- it was actually very easy for them to stick. I hope this review helps. It was actually kind of relaxing to make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larkspur"
},
"reviewBody": "These truffles were magnificent! They were also incredibly easy to make...I made two batches of these. I used the vanilla and semisweet baking chocolate for the first batch, rolled them in cocoa, and they were awesome! The second batch I used 1/2 tsp. mint extract instead of the vanilla, and used some 70% cacao Ghirardelli chocolate...these were absolutely amazing! Intensely bittersweet with a nice touch of mint...wow. I will definitely be making these again! Thanks so much for sharing the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FoodFan"
},
"reviewBody": "I used semi-sweet chocolate and 2 tsp. peppermint extract then rolled in crushed candy canes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I had some couponing awesomeness yesterday which meant I had a bunch of chocolate chips and heavy cream that I got for cheap. This was perfect for what I needed. I actually used dark chocolate, but other than that I followed the recipe exact. I rolled half in chopped peanuts and the other half in powdered sugar. My boys flipped for these and it was a great inside-snowy-Winter-day project. REALLY fun. I'd like to try these again with white chocolate, peppermint extract and crushed candy canes. You could really go crazy with this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Walters Parker"
},
"reviewBody": "Good but not creamy enough. I rolled in cocoa powder but that wasn't a very good taste for me. That was my fault though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "butterbean"
},
"reviewBody": "I have only done a trial run with these truffles, so i cut down the recipe and used what i had so it wasn't top quality chocolate, and i only had half and half. They didn't set as firmly over night but the taste was still yummy and rich and creamy. I added maple extract and WOW WOW WOW I think with higher quality chocolate and using real heavy cream, in the proper quantities, they will come out more amazingly. I have incredible chocolate, Sirius Icelandic 56% Bitter Sweet Chocolate. It's amazing alone. Can't wait to use it for truffles. Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "My regular truffle recipe includes cream cheese. Thought I would try this recipe on the quick because did not have cream cheese handy and was extremely disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey4840"
},
"reviewBody": "Awesome! I used white chocolate chips then chilled overnight. Next morning I formed them into small balls and chilled again while I melted butterscotch chips, then dipped in the butterscotch and set at room temp. Wicked rich, but absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laurelee"
},
"reviewBody": "I had issues forming these into balls. I ended up rolling them around 2 spoons and they still looked a bit funky. Everyone who tried them did like them, I just didn't like how hard it was to work with the mixture. I might try it again with some tweaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JARRIE "
},
"reviewBody": "This recipe works as written. However, it is VERY difficult to work as written, because there isn't enough cream. On this same site, Ghirardelli brand chocolate used 1 full cup cream to the same amount of chocolate (12 ounces chopped = 2 cups). The chocolate centers resulting from this recipe are fairly stiff. They do hold up well at room temperature, and I suspect this recipe would mail very well also. Thanks for the recipe--I will probably use another recipe next time though, one that calls for more cream than this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather ;)"
},
"reviewBody": "I've been doing these truffles for years and they are soooo yummy and easy! I use fat free evaporated milk and it wors just as well (you may need a little extra time in the fridge) Also I like to add different liquiors and flavors to it (Khalua, grated orange zest, etc) use a small batch and try it ut :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookie D'oh"
},
"reviewBody": "Very easy and pretty tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "Good basic recipe, but I did find the whole process a little time consuming. This was the first time I have ever made truffles and I was very pleased with the end result. I used Semi sweet chocolate as I don't like bittersweet. Not sure how the recipe makes a yield of 35 as I could only stretch to 12. I tripled the recipe and instead of using vanilla extract, made one batch with mint extract, one with orange extract and the last batch with Bailey's. For the toppings I used various (basically anything I had in the pantry) coconut, chocolate sprinkles, almond sprinkles, toffee sprinkles and for the last I melted down some extra chocolate, dipped the truffle in the chocolate and finished with small walnut on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aksnoopy88"
},
"reviewBody": "real easy and yummy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This was incredible and so versatile. Had some bittersweet chocolate to use up, and this was perfect. Separated into three batches, flavoring one with vanilla, another with peppermint extract, and the third with rum extract. Rolled in various coatings, including powdered sugar, cocoa powder and chocolate sprinkles. All were great. Let thaw at room temperature about 30 mins before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "snakemagic"
},
"reviewBody": "Pretty good basic recipe. Dusted mine with cocoa powder, didn't notice any bitterness. Would try with different coatings and perhaps liquer in place of the vanilla essence next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RCZYZYK"
},
"reviewBody": "I used the flavored creamers (like Creamora Hazelnut) instead of heavy cream as another viewer recommended and it really kicked up the flavor. This is my favorite kind of recipe .... quick, easy and good!! Try it. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABBAJEN"
},
"reviewBody": "This is a really nice and easy recipe! I divide it into four portions and use 2-3 Tbs of various liquors in each 1/4 portion. It sets much faster, so you need to be ready to roll in about 1 hour. Rum, whiskey, amaretto, Irish cream and hazelnut all work really well. I also dip them in dark chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEECEEBABE"
},
"reviewBody": "Simple, smooth, decadent and EASY. I used dark baker's chocolate, product was wonderful; investing a little more in chocolate would surely be amazing. I added 3 oz. irish cream to one batch and 2 oz. frangelico, in the future I will use at least 3 oz. of liquer. I found it easier to chill over night and then rest at room temp for 30 mins or so before forming into balls. Way better once flavours marry together in the frige for a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evie"
},
"reviewBody": "This was an amazingly easy and wonderful recipe. I added 2 T. of butter as another reviewer suggested. I rolled them in crushed peppermint candy and cocoa, and drizzed some with white chocolate melted with a tad of oil. They were absolutely beautiful and people LOVED the flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I split the truffle mixture in half before rolling. 1/2 I added Grand Marnier to and the other 1/2 almond extract. They were both excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H.A"
},
"reviewBody": "yummmmy... these were delicious. I needed to make party favors for my daughters 1st birthday party and I came across this recipe. Last minute idea.. perfect. I didnt need to run out to the store to grab ingredients, i had everything on hand.I made them the night before and left them out on the counter and in the morning I refridgerated for 2-3 hours and then I rolled them in cocoa powder and i also drizzled some with caramel. I put them in a yellow muffin cup, put some hersheys kisses along side of them and wrapped them in pink pokka dotted cellophane wrap and tied them with a pretty burgandy ribbion. They were cute, beautiful and delicious. Thank you for sharing this recipe. ohh i also used 3/4 of a cup of heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Harriman"
},
"reviewBody": "THESE ARE GREAT, I COVERED WITH RICE CRISPIES AND COATED THAT WITH CHOCOLATE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamma M"
},
"reviewBody": "This is the best chocolate I have tasted and my husband assured me that it is much better than anything that can be purchased at the store. Will definitely be making again!! Am actually going to make it for the second time tonight (having a chocolate craving...mmmm) I love milk chocolate, so I substituted milk chocolate chips for the bittersweet. I also made some peppermint truffles by adding peppermint extract instead of vanilla. Yummy!! Tastes as good as Laura Secord mint chocolate or better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "I tried these with almond flavoring, mint and with vanilla. The mint was definitely the best. I added a bit more cream (x1.5) and I didn't use a melon baller at all. Just rolled them up like cookies. I covered them with 4 different toppings: 1) chocolate sprinkles, 2) powdered sugar, 3)cocoa powder and 4) nuts. I would try all but the powdered sugar again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker1776"
},
"reviewBody": "These are very easy to make. The truffle mixture firms up nicely when chilled. If it gets too hard, warm 30 seconds in the microwave. I used a mellon baller dipped in cocoa poowder to scoop the chocolate. I also rolled some in toasted coconut and ground hazelnuts. Make sure they're room temperature before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "belle"
},
"reviewBody": "I made 2 batches of the truffles- one I followed as directed in the recipe, and the other I added a little butter and rum. I have to say I was not all that impressed. They did get eaten, and it was a good way to use up the bitter-sweet chocolate I bought on accident(somehow I thought it was white chocolate). Sadly, I much prefer the large package of truffles from Costco. They are way better and probably cheaper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babydoll"
},
"reviewBody": "i Have made this recipe for years with great reviews. my secret is to make this recipe and let sit in refrigerator with saran wrap for a week or so it give it a creamier texture and the flavor is much more intense"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bartel"
},
"reviewBody": "i thank you for this recipe it was easy to make and i served them to many people at grill out i rolled carmel in them and everyone seemed to like them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "These are delicious! For half of the chocolate I used plain milk chocolate button melts and the other half was Lindt 70% cocoa chocolate. Very rich and not too bitter as the 70% cocoa chocolate is by itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "roweena"
},
"reviewBody": "This is a very good starter recipe! I used Ghiradelli bittersweet chips and added just a touch more cream the called for. I did expresso/coffee truffles, grinding up coffee beans VERY finely and used about 3 teaspoons for the whole batch. I refrigerated them for a bit before scooping them out and shaping into balls. I chilled them again before double-dipping them in chocolate and added a whole coffee bean on top of each. Definitely a keeper for simple they are to make, next time I'll try grinding up coconut and adding coconut and rum extracts and rolling it in coconut for a tropical twist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sammers"
},
"reviewBody": "Good recipie but this is acutally considered the ganache. For those who are more serious, be careful about burning the chocolate so using a double boiler is suggested even though it takes more time. Also, be careful with adding flavors because chocolate can seize when liquid is added (this is basically the rapid cooling of the chocolate when something like a flavoring is added). Once chocolate seizes it is pretty much ruined/useless except for hot chocolate. So good luck with all of your indulgences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allrecipesrocks"
},
"reviewBody": "Excellent, but extraordinarily time-consuming. I created a batch using the recommended amount of whipping cream and it turned out really well. I also tried using the amount suggested by another reviewer (quite a bit more) and the batch did not turn out. I froze the chocolate/whipping cream mixture and it still melted easily when dipped in chocolate. I couldn't even coat it with chocolate. I would stick to the original recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon :) "
},
"reviewBody": "These were delicious! Time-consuming, but incredibly good! After coating them in the melted chocolate, I rolled some in toasted coconut, some in pecans &amp; powdered sugar. The powdered sugar was absorbed by the chocolate, though, so I wouldn't recommend that. Thank you Gina!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I make these all of the time for events, and they are sooooo decadent! I roll in cocoa powder and the initial bitter bite gives way to the richness of the truffle! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bekahjo"
},
"reviewBody": "Try this, go with 1/2 pound of milk chocolate, 1/2 pound of semi-sweet chocolate all chopped up into small pieces. Heat 1/2 cup of heavy cream to an almost boiling. Pour the heated cream over the chocolate and stir to melt. Add 1 tsp vanilla and 1 tbsp of hot coffee. Let that set then roll in desired coating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosichops"
},
"reviewBody": "Good and easy base for truffles. Have made Kahlua, Cointreau, Macadamia, White chocolate and almond so far. It's terrible though I have to keep on trying them to see which is the best....life is tough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MedMimi"
},
"reviewBody": "I used 3/4 c. cream as dictated by the traditional truffle recipe. Instead of the vanilla, I used 3 Tablespoons (yes big T!) of Kahlua. Oh my gosh--so good! If you have trouble rolling, definitely leave in the refrigerator for another hour or so. It will make it much much easier. Once you coat with cocoa powder, let it sit for a few minutes. Then re-roll (the topping makes it less sticky) in order to make a good shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill B Edwards"
},
"reviewBody": "I'm no expert (so I'm going for a middle-of-the-road-rating) but I've tried to make these twice (actually, 4 batches, just 2 different times) and I don't like the results I get. They're very hard and not very tasty. I used to live with a chocolatier, and she could use these approximate ingredients and make something great, but when I finally gave up my \"purist\" aspirations and tried other truffle recipes I had MUCH BETTER results. I'm not sure I'm going to try this recipe a third time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohitsjustkate"
},
"reviewBody": "Delicious. I'm a beginner cook, so it took some experimentation with the refrigerator and microwave to get it to set to the right consistancy (first it was too hard, then it was too soft, then just right) but once you get the hang of it, they're easy to make. I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LITTLEGREYKITTEN"
},
"reviewBody": "This was my method: I used 1 &amp; 1/4 cup or so Ghirardelli semi-sweet chips, 2/3 cup heavy cream, 2 tbsp unsalted butter, and the vanilla. I made several flavors but quite a few people concurred that the vanilla/peppermint was the best. I rolled them in powdered sugar, rather than attempting to coat them with a shell (impossible for me!) Freezing the blobby little melon-baller scoopings for a half hour and rolling with my hands after that was the only way they came anywhere close to attractive. I gave them to tons of family this Christmas and everyone loved them. (My brother in law especially, he must have asked at least 4 times if I was absolutely sure they were all gone- I think he searched my fridge for good measure just in case I was holding out!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is definately the best their is. It is true to its words."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Z"
},
"reviewBody": "This is a great basic recipe. Anyone that complains about the taste of the chocolate is overlooking one HUGE point: If you start out with cheap chocolate you will get a truffle that tastes like cheap chocolate, or just doesn't work. A higher quality chocolate will yield a better truffle. Also, the less actual chocolate in the chips the more problems you will have getting them to the right consistancy. One more point-If you don't care for bitter sweet chocolate, don't use it. That's why there are so many varieties in the baking section. I recommend Guittard, in my mind the best you can buy before Godiva. Ghriradelli is good as well, but the Guittard has a richer, more European taste (since it is). They cost a bit more, but you won't believe what you'd get! Much cheaper than Godiva! PS- I apologize for any spelling errors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple but delicious! I had no luck with rolling or candy molds, but that's not the fault of the recipe - I'm completely inept when it comes to making food pretty. I bought a \"trigger funnel\"\r\nand dropped chocolate \"kisses\" instead. I experimented with LOTS of different flavors instead of the vanilla - all got rave reviews in my cookie/candy exchange this Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i gave these away as christmas gifts to my teachers and now they are paying me to make them from them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CENOBIA"
},
"reviewBody": "These are so simple to make, although very messy! I topped some with chopped andy's candies and they were very good. I also topped some with pecans and some with walnuts. These were a great hit! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WOW! This is easy to make, easy to adapt to different tastes, and very, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LRP77"
},
"reviewBody": "Good truffle recipe. I flavored mine with orange extract and a little vanilla too. Mine did not set up as quickly as 1.5 hours, so I let the mixture sit overnight. I formed the truffles, chilled for 1 hour and then dipped in melted chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JSquared1970"
},
"reviewBody": "Sinful but delicous - kids ask for them every Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I think I'm going to have to stick with Godiva. These just tasted like chocolate chips and hardened up too much in the bowl. They didn't mold well at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WOLFECOOKIE"
},
"reviewBody": "These tasted ok, I suppose, but truffles SHOULD be AWESOME! I felt like they got way too hard too quick - I dunno, maybe I did something wrong, but I doubt it - they were pretty easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DANDK1997"
},
"reviewBody": "I followed this recipe exactly (a rarity for me) and the truffles came out very hard. I am not sure why, but now I have to try re-heating them and adding more cream and hope for the best. I have never had a problem with truffles before, just needed a recipe as I have not made them in years.\r\n\r\nUpdate: Yup, the problem was not enough cream. Once I reheated the whole mess and added more cream, they turned out fine. I split this, added orange extract to half and peppermint extract to half, then rolled, coated with white chocolate or crushed candy canes, and they were good. However, since the recipe seems to be off, I will just use another one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sakuraiiko"
},
"reviewBody": "I used Ghirardelli's double chocolate chips for a smoother taste for my friends that do not like straight bittersweet. topped with white chocolate and cocoa powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These truffles were ok...I took the advice of one of the reviewers and used a flavoured creamer...I used hazelnut. The taste was ok, but I thought the taste was a bit too bitter for me even though I used semisweet chocolate. If I do make these next time, I will use milk chocolate. I dipped them in milk chocolate and drizzled with white chocolate so they look very pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these yesterday and my family LOVED them! They were a big hit! I did use semi-sweet instead of bitter-sweet, they were very rich and creamy. I also added 2 teaspoons of orange liquer, but the flavor was not very noticable, it needed a bit more. Overall this was a very easy recipe with a wonderful finished product! I 'm making these for gifts this Christmas....THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NAILLED17"
},
"reviewBody": "Very good and easy to make. I did try with white chocolate and they didn't set so I dunked them in chocolate and it worked fine. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oh my gosh!!!! These are so so good. I could not stop eating these, I was making myself sick\r\nso I put some in the freezer. I don't think it will work I will just sneek them out one by one.\r\nNext time I will double."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These truffles were too bitter. Truffles using semi-sweet chocolate are better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe up to take to work with me for the office Christmas Party. The first batch I made I added some orange flavoring to it and it turned out well. However, I wanted Irish Cream Truffles when I made it the second time around. I didn't want to go out and purchase a $13 bottle of Irish Cream liqueur (we don't drink) so I decided to substitute those new flavored creamers for the heavy cream. You wouldn't believe it, but it worked out so wonderfully!!! These are easy to make and it's a wonderful basic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The taste of these truffles was wonderful though I couldn't get them to harden enough to remain in a ball form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vulpecula"
},
"reviewBody": "i made these as christmas gifts, they are so easy, but look like they took\r\na lot of time and effort! i covered mine with melted milk chocolate, which\r\ngave a bit of a cool effect (dark truffle center, lighter chocolate outside).\r\ni also added a bit of brandy to them, yet the flavor of the brandy wasn't very\r\nstrong, next time i think i shall add more than just a splash.\r\n\r\nthanks for the recipe, they were a great success, especially for my first time \r\nworking with chocolate."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24691/basic-truffles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
"name": "Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/751/desserts/candy/truffles/",
"name": "Truffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24691/basic-truffles/",
"name": "Basic Truffles"
}
}
]
}
}
, "about": [
]
}
]