				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Basic Quiche by Shelly"
,"datePublished": "2018-06-08T09:20:10.000-04:00"
,"dateModified": "2023-01-30T14:35:53.000-05:00"
,"author": [
{"@type": "Person"
,"name": "DOCTOR KITTEN"
,"url": "https://www.allrecipes.com/cook/497674"
}
]
,"description": "Learn how long to bake quiche using this delicious foolproof recipe. Keep it simple or add chopped ham, sauteed leeks, or whatever you like!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3qJ2qlMaCpUZ6rN40Sp1wojnMHk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/46570-basic-quiche-by-shelly-ddmfs-3X4-0075-e3741c6179f64f8bb0d16454821765cb.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1934651160001",
"description": "Watch how to make this versatile quiche.",
"duration": "PT2M33S",
"name": "Basic Quiche by Shelly",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2023/01/30/46570-basic-quiche-by-shelly-ddmfs-3X4-0075.jpg",
"uploadDate": "2021-07-17T17:06:53.817-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Basic Quiche by Shelly"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "199"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "401 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "177 mg"
,"fiberContent": "1 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "379 mg"
,"sugarContent": "1 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups half-and-half cream",
"4 eggs",
"0.25 teaspoon white pepper",
"0.125 teaspoon ground nutmeg",
"0.125 teaspoon salt",
"4 ounces Jarlsberg cheese, shredded",
"2 ounces mozzarella cheese, shredded",
"1 (9 inch) unbaked pie shell" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Whisk cream and eggs together in a large bowl. Season with white pepper, nutmeg, and salt. Place shredded Jarlsberg and mozzarella into the pie shell. Pour egg mixture over cheese."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3qJ2qlMaCpUZ6rN40Sp1wojnMHk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/46570-basic-quiche-by-shelly-ddmfs-3X4-0075-e3741c6179f64f8bb0d16454821765cb.jpg"
}
]
,"text": "Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake until crust is golden and filling is set, 25 minutes. Allow quiche to set before serving, 5 to 10 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MILAGRERO"
},
"reviewBody": "I used 6 eggs with the 2 cups of cream so that I could make 2 separate quiches, 1 with ham and spinach and 1 with corn and spinach. Turned out beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "This is my go-to base quiche recipe which I have made probably 20 to 30 times. I make a larger crust to fit a standard sized quiche pan (try a no roll oil crust). I change up the cheeses plus add fillings of choice. Using a 9\" regular pie plate only allows for a small amount of fillings, so invest in an inexpensive quiche pan. Make a pie shield ring out of foil to put on once the crust edges are your desired color. All ovens cook different, cold ingredients take longer to cook. Time in a recipe is only to be used as a guide and not exact time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mir Delisle Oldham"
},
"reviewBody": "Reduce milk - use 1 cup of yogourt instead, and augment eggs (4 or 5 if pie plate is large). Added broccoli florets, a bit of grated cheddar and fried spam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kinneyeliz"
},
"reviewBody": "One of our favorites! So easy and good! We like it plain or with onion, ham and broccoli. \nI use 3 eggs and 2 1/4 cups 1/2 and 1/2. Fits a 9 inch deep dish perfectly. We slice tomatoes and have with it! Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "julikin31"
},
"reviewBody": "That`s an awful lot of half and half for my preference. I used 6 eggs and about a quarter cup whole milk. Added a small sauteed onion.\nBest egg pie ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nana"
},
"reviewBody": "It was very good. The perfect Christmas breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trishkrog"
},
"reviewBody": "I loved this recipe with the alterations below. I use the roll out refrigerated pie crust dough in a nine inch pie plate. I add extra cheese to deeply cover the bottom of the shell. I add chopped ham and canned sliced mushrooms (drained) onto the cheese and cover with the egg mixture in which I have increased the nutmeg and salt to 1/4 teaspoon each. My husband loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koko"
},
"reviewBody": "Wonderful starting point for any quiche. I use two deep dish frozen pie shells, fill with too much cooked cubed ham or bacon and some combination of sauted onions, bell peppers, mushrooms, and bacon bits, and lots of shredded cheese. I add one more egg to the recipe, and use for both pies. I like my veggies at least lightly cooked before putting into the quiche, and any combo of cheese: colby, jack, mozzarella, cheddar. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauren"
},
"reviewBody": "Perfect every time, light, fluffy, and wonderful! I use a deep dish pie plate with a rolled refrigerated crust, all the ingredients fit with room for any additions! A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skeeter"
},
"reviewBody": "I followed the recipe exactly and the flavor was divine. It is a custardy quiche which I loved but the family wanted more egg. I'll follow the suggestions of other reviewers and try an extra egg and less Half and Half, but this will be my go-to quiche from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ollianna786"
},
"reviewBody": "Followed others' suggestion of reducing eggs to 3 and cream to 1 1/2 cups. That left plenty of room for add ins. I would probably use it as written if I weren't adding in extras. Really tasty. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Cash"
},
"reviewBody": "I love this recipe. I also add veggies to it. Today I used red and yellow bell peppers, onion, mushrooms, spinach and some cooked bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Crust needs to be prebaked. Came out watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy Blackmon"
},
"reviewBody": "Added Bacon and onion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patina"
},
"reviewBody": "I was on a mission to find a quiche with a creamy custard like filling. This was perfect. It reminds me of the quiche served at my favorite bakery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean Teh"
},
"reviewBody": "added mushroom onion and bacon very noice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany Menard"
},
"reviewBody": "I made this as directed the first time and while it was soft-set, it was delish! I made it again and added another egg, and it was still amazing, just a tad more firm. If you’re looking to cut a few calories, use half cream and half milk. It’s amazing with caramelized onions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessica Thielke"
},
"reviewBody": "I give this one star because the cooking time is completely wrong. I took this out of the oven after the 25 minutes with it still sloshing around. Put it back in for 20 minutes...still sloshing around. Another twenty minutes (mind you everything we had prepared to go along with our quiche was cold now) and by the time I had had it in the oven for about an hour, we gave up and ate it still soft and gooey. Please correct the cook time. It is vastly inaccurate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie"
},
"reviewBody": "So easy and delicious. I made mine with Parmesan cheese and mozzarella. My add-ins were 3 pieces of prosciutto, finely sliced and about a half cup of thinly sliced scallions (both were spread on top of the cheese and then the egg mix was slowly added. Served it at room temp for brunch. A hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Lynch"
},
"reviewBody": "Very easy to make and delicious! However, you'll need to play with the creamer-egg ratio if you're adding fillers. I made two simultaneously and glad I did as one turned out a little soggy (too many mushrooms and spinach that leached water into the quiche) and the other one perfect. Here were my adjustments for the perfect one:\n- 1 cup half-half\n- 4 eggs\n- About 4 oz. spinach &amp; mushrooms\nThe consistency was great and it tasted phenomenal. One other adjustment I'll make next time is to cook the pie crust empty for about 10 minutes at 350°. Not necessary but I think it will get the bottom of the crust crisper. Bon appetit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessikajames1234"
},
"reviewBody": "This is the BEST \"basic\" recipe for a quiche base that I have found - really no need to change anything - vraiment!! Use the basic recipe, then get creative...French cooking is an art, and a recipe is followed more as a guideline...especially for a good country quiche like this one! Use this great basic recipe to make the egg base, then throw in whatever is left over in the fridge - pepperoni and jack, asparagus and Gouda...I remember Mémé making a quiche with leftover french fries and Velveeta! The only thing I change in this recipe (if I have extra eggs) is I add a couple of separated yolks to give more color and and a firmer texture, especially if I am adding a juicy veggie like tomatoes. Great job Shelly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Bray Garrison"
},
"reviewBody": "I used 5 eggs, 1/2 can evaporated milk, 1/2 cup whole milk, 5 slices of Havarti cheese chopped up, the spices as recommended, 4 large chopped brown mushrooms, and I added sautéed chopped onions, 1/2 tsp minced garlic and a chopped 5 inch long smoked link sausage. It was unbelievably delicious! I can see me trying lots of different combinations with this! Note: I pre-baked my crust but I don't think I will next time. It was overcooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHOGIRL"
},
"reviewBody": "this is a no-fail quiche as written, also holds up to additions like meat or veggies. I have made it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Stout"
},
"reviewBody": "Very easy and tasty! I would suggest 1 1/2 c of half and half, 2 cups was too much for the piecrust. I used fresh farm eggs, which tend to be smaller too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mac"
},
"reviewBody": "I read the reviews that cut the half and half back by a half a cup. Instead, I kept the 2 cups and added 2 more eggs. \n\nAlso, instead of a store bought crust, I used this https://www.allrecipes.com/recipe/24094/butter-flaky-pie-crust/\n\nCame out Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quincy"
},
"reviewBody": "So easy, and so delicious!! I made this w/ ham and spinach I did make some small changes to suit my families taste: I used a combination of Vermont, Wisconsin, and New York cheddar cheeses. So Good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony333"
},
"reviewBody": "I made this but followed others and cut down the eggs to 3 and half and half to 1 1\\2 cups. Added cheese, tomatoes, sweet potatoes and squash spirals. Had to add 10 minutes also as it was still runny after the original time ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Porter"
},
"reviewBody": "I found this recipe a few years ago and it was a HIT at a bridal shower I hosted. Have tried a couple other recipes since then, but keep coming back to this one. It has wonderful flavor - I think the Jarlsberg may be the secret. Or the white pepper? Or the half and half? Either way, this recipe can be adapted by adding spinach, onions, ham . . . whatever we decide. I find it is a well rounded flavor that appeals to everyone. Will be serving it for Easter brunch again this year! (This time I printed it out so I don't need to hunt it down on the internet again! LOL)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAULDI"
},
"reviewBody": "Excellent recipe. I didn't have any cream so used 1-1/2 cups of milk and sprinkled a little flour in with the cheese. Added some chopped broccoli and bacon. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slo_cook"
},
"reviewBody": "This is my go recipe whenever making quiche. I like that I can add whatever I want in the way of meats, veggies and cheeses. It doesn't matter what ingredients I use it always comes out perfect. I like a nice full quiche so I always use a deep dish pie crust and cut back on some of the half and half so I have plenty of room for all the good stuff I like to add. Most of the time I end up with 2 quiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "Very good basic. I throw in whatever veggies I feel like as well as some kind of salty meat usually ham or bacon. I wish there was a formula for how much liquids to solids as I usually overdo the liquids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GiGi"
},
"reviewBody": "Great &amp; simple recipe! I made the quiche with low-fat half-n-half, deli honey roasted ham, &amp; packaged mozzarella/provolone shredded cheese mix since I was short of time. Made it for Mother's Day brunch.....it was a hit!! Served with side of fresh fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beth66335"
},
"reviewBody": "Made this with chopped mushrooms I cooked in butter and then added a package of bacon pieces to and some chopped green onion I didn't cook before adding to the quiche. I used a premade Pillsbury crust and didn't bake it before filling it. For the cheese I used the prepackaged Mexican blend shreds and a bit of Swiss shreds too. It was good but I trouble getting it to \"set\" in the middle...next time I will use a couple more eggs, a 1/2 cup less half and half and cook it at 375 for 40 minutes after the initial 15 min at 425. It is a good basic base for any fillings I feel like using!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdebruler"
},
"reviewBody": "Great recipe! I reduced the half &amp; half to 1 1/2 cups and added in sauted onions, mushrooms and chopped ham. I pre-baked the crust for 5 min. at 400°. I baked the quiche at 400° for about 45 min. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! I reduced the half &amp; half to 1 1/2 cups and added in sauted onions, mushrooms and chopped ham. I pre-baked the crust for 5 min. at 400°. I baked the quiche at 400° for about 45 min. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgdriskill"
},
"reviewBody": "I've been making this for about three years now. The nutmeg makes it! I've thrown all sorts of toppings in my favorites are prosciutto and arugula or broccoli and slice tomato. Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dpmiller"
},
"reviewBody": "I use this basic recipe (doubled for two refrigerated ready made pie crusts) and use peppers jack cheese, a can of roasted chilies and a pound of ground chorizo (browned in skillet before adding). You can add anything to this basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "housy123"
},
"reviewBody": "So, I agree with everyone else! Less egg and less milk! I used three jumbo eggs and 1 cup cream and 1/2 cup fat free half and half. This left room for me to add some sautéed red pepper, onion, mushroom, garlic, bacon, ham and cheese!! I like my quiches hearty and flavorful!! I used 7 pieces of bacon, two slices chopped boiled ham, 1/2 a large red pepper, 1/2 a large onion, two cloves of garlic and about 4 large white mushrooms. Then I added four ounces of cheese and it all fit perfectly in a nine inch pie shell! Filled just to the top!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twinsgramma"
},
"reviewBody": "This is my 'go to' quiche recipe. I adapt it for lactose intolerance by using 5 eggs, lactaid milk, and shredded Swiss cheese. Sometimes I add bits of ham or garnish with sliced tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Kosa"
},
"reviewBody": "Oh so good. Finally made a quiche that came out perfect! We both loved it. I browned chopped bacon and minced onion. Let it cool while I cooked down baby spinach. Made the basic recipe proportions but the cheese I used was mild cheddar. Blended it all together and put it in a pie shell. Then I halved cherry tomatoes from the garden and placed them cut side up on the custard. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Domica Renner"
},
"reviewBody": "I replaced the cream with sour cream. I like mine to be a bit firm. Added onion powder and asparagus... This may seem like I changed a lot, but this recipe was still the foundation of my quiche and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "I used roll out refrig crust stab lots of holes with fork to get rid of bubbles then bake shell 5 min at 450 then add ingredients and bake according to directions this way shell bottom isnt mussy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cass"
},
"reviewBody": "It's a great starting off point but I made so many changes I don't even know if its even the same recipe.\n\nFirst off I used a tube of crescent rolls for the crust. I used a deep dish pie pan and stretched and squashed the whole sheet around until it sort of resembled a pie crust, up the sides of the pie dish. Poked some holes in it, baked it at 425 for about 15 minutes. Had to keep checking on it and popping the puffed parts up so it would lie flat. I sauteed baby spinach and portabella mushrooms with a half teaspoon of minced garlic in olive oil until the garlic was soft and the spinach wilted - enough to look like it would cover the bottom of the crust. When the crust was done, I used 3 different shredded cheeses, just a thin layer of each, on the bottom of the crust, followed by the mushroom/spinach/garlic layer then added diced ham over that. I added the egg layer using 5 eggs and 1 cup of skim milk, along with the white pepper, garlic salt, omitting the nutmeg. Wisked it all together and poured it over what was in the crust already - I probably had 1/3 to 1/4 cup of the egg mixture left. I added a handful of chives, about a half teaspoon of basil and a little onion powder on the top and threw it in the oven. It took almost 50 minutes until the middle got to where it was set enough that I could take it out of oven using the baking times and temps as above. Now it is cooling/setting; smells great and I can't wait to taste it. 1st quiche I ever made..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andie"
},
"reviewBody": "My husband made this! he subbed in the remnants of cheese we had in the fridge, used black pepper b/c we had it and did not have white pepper, omitted nutmeg and added broccoli. It was sooooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jason Coull"
},
"reviewBody": "added some cooked bacon bits and sauteed onions to the bottom of the pie shell with a swiss and provolone cheese mix. only used 1 cup of half&amp;half. pinch of paprika for seasoning instead of nutmeg (didn't have any lol)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aliseb"
},
"reviewBody": "Good basic recipe to tweak and add to as needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Ok, so I could not sleep tonight so I thought I would make this Quiche for my family to have for breakfast. I have never made Quiche before... It turned out great. I did have to make some different changes since I did not have a pie crust on hand. I decided to use my spring form pan and make a crust like you would for a cheesecake. I used digestive biscuits. I crumbled in food processor with coconut oil, instead of butter, I had none, I used coconut oil and a bit of vanilla extract. I pulsed it till all crumbled. I pressed it down on my spring form pan, and sprinkled asiago cheese all over it. Then the beaten eggs w/cream and chopped up smoked Ham and sprinkled it on top... I cooked it for a little longer than instructed. Delicious!!! Great presentation. I like the hint of sweetness in the crust....will make this again...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy_richelle"
},
"reviewBody": "Excellent flavor, an go to recipe for basic quiche. Thank you for sharing this recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jillerinbott"
},
"reviewBody": "This is a good starter recipe but it calls for way too much cream. And the baking time is WAY off. You must cook it for more like 45 or 50 min and reduce the cream by about 1/4 to 1/2. Add fresh basil, spinach, roasted red peppers, and use fresh mozzarella and parmesan instead of the cheese that is called for. Sprinkle a little parmesan cheese over it just at the end of cooking. Yummie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donnalouise"
},
"reviewBody": "This was my first time making quiche so this was a great easy recipe. I added crumbled left over meatloaf and frozed soup mix vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pitt1965"
},
"reviewBody": "Great basic recipe! Try subsituting the half/half with sour cream, it is suprisingly delicious! Also, get creative with it. I made mine with browned sausage, fresh diced tomatoes, mushrooms (canned), green pepper, onion, and meunster cheese. I sauteed the green pepper and onions for a few minutes until tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mimsmac"
},
"reviewBody": "I always like to try recipes as written and then tweak it according to feedback. This was the BEST quiche recipe I've ever tried and I'm \"known for my quiche.\" However, it's not terribly slimming, which is a problem, because it's so delicious, I always end up eating more than I should!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "I would not call myself a picky eater, but I didn't care for this recipe because it was way too custardy. I cut down on the cream by 1/2 a cup and added an egg, but it was still off. All 5 people that tried this agreed. I will not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CupcakeGirl"
},
"reviewBody": "This is my go to quiche recipe. I have made it with many different veggies, bacon or ham. It's no fail and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crispycm"
},
"reviewBody": "Great base. Saute onions, bacon and vegetables first. I use 5 eggs, 1 cup of cream and 1 cup of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Limit Does Not Exist"
},
"reviewBody": "It was nice! I baked the crust alone in the oven at 425 degrees F (after I coated it thinly with butter) while I mixed the eggs and cheese ingredients, then I took out the crust, added the ingredients and followed the instructions as listed. Very light, fluffy, buttery and successful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FionaO"
},
"reviewBody": "Wow! I was very impressed with this simple but tasty quiche. I agree that there is just a bit too much cream, in the future I will reduce it. I also found that I needed to cook it for about 10 or 15 more minutes for it to be cooked. The consistency is a bit less solid than I would like, but I am assuming that is because of the amount of cream. I was DELIGHTED with the taste and the simplicity. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WallyPres"
},
"reviewBody": "Never made quiche before, and this recipe is an excellent jumping off point. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeftyMB"
},
"reviewBody": "I've used this recipe as my \"starter\" four times now, and the results have been uniformly wonderful. Like other reviewers, I reduced the amount of cream to offset the other ingredients I added (if you don't, your cup really WILL run over), with no appreciable loss of flavor or consistency. One thing I did do that wasn't in the instruction was to whisk the eggs thoroughly before adding the cream, and then do it again, after adding it. It made the filling amazingly light when it set.\n\nThis recipe really is a keeper. Thanks to Shelly for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terrie"
},
"reviewBody": "I placed onions , broccoli and bacon bits at the bottom , along with the cheese ( prior to pouring the liquids) \nReduced to 3 eggs and 1 1/2 cups of half and half ( instead of 2 cups) \nResult = Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MonkeyCat"
},
"reviewBody": "This was my first quiche and I thought it was idiot proof. I cut back cream just a tad and added an extra egg based on reviews. I also pre-cooked crust a little, added sauteed onions, mushrooms, fresh broccoli, bacon, sharp cheddar and mozzarella. I also cooked an extra 5 minutes. Perfection! I will use this as my go to quiche for all occasions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gurgabusse"
},
"reviewBody": "The flavor of the quiche I made using this recipe was very good. I will definitely use this recipe again and may try adding another ingredient once in a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LnJJ"
},
"reviewBody": "We loved this! It's a great basic quiche recipe that you can add whatever you'd like to it. I added roasted red peppers, feta cheese, and spinach. Thanks for a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "5 stars with these fillings and basic changes: 1) 6 eggs and 1 1/2c whole milk. 2) Large deep dish pie plate lined with (Perfect Pie Crust-Pioneer Woman), 3) 6 slices thick hickory smoked BACON, cooked and coarsly chopped, 4) 3 TBSP minced yellow ONION + 6 oz MUSHROOMS coarsly chopped and sauteed in TBSP butter 3-5 minutes, 5) 10 oz chopped frozen SPINACH-thawed and squeezed dry + 2 TBSP chopped oil packed SUNDRIED TOMATOES. 6) 1 can small ARTICHOKE HEARTS drained, patted dry and coarsly chopped, 7) 1 1/2c coarsly grated ASIAGO cheese.\n8)IMPORTANT....Heat oven to 450 with a baking sheet on the lowest rack for 10 minutes. While sheet is heating, fill your prepared crust with all the fillings except the egg mixture. Once sheet pan is heated place crust on it, and pour egg over fillings. Bake for 15 minutes (450) and turn down to 325 for 45 more minutes, or until just set. Allow to cool at least 30 minutes before cutting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCAVA"
},
"reviewBody": "I love this recipe and it has become a regular meal in our home. After reading the other reviews I cut the half and half amount so I can add in extra goodies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cooking 4 Joy"
},
"reviewBody": "Great non-traditional way to start your day! Quick, easy and filling. Mix ingrediants, pop in oven, get ready for day, take out quiche and boom! Add chopped peppers, mushrooms or sausage bits for zest!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami-Joy Bull Beckwith"
},
"reviewBody": "I find this is a PERFECT basic for all my quiches. I omit and change the herbs/spices and cheese accordingly. Take note of the picture, this is done NOT in a pie plate, but a quiche pan. The recipe as is...added with my ingredients of choice, fits perfectly in any of my 3 quiche pans.\n\nTonight I used this adding sausage, cheddar cheese, cumin, garlic powder, onion powder and a little cayenne pepper. Topped with left over chili and jalapenos. I have used this recipe for quiches made with just veggies, ham, burger etc. Again, just change the spices and cheeses accordingly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rachel"
},
"reviewBody": "I've made this a couple of times, following the recipe exactlty &amp; also using 3 eggs &amp; 1.5 c. hslf &amp; half and it always takes much longer than 40 mins. I bake it for 15 min at 425 then end up baking it about 40 mins vs 25"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NURSE_SARA"
},
"reviewBody": "Wasn't my favorite recipe. Needed more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marcella"
},
"reviewBody": "Followed recipe without variation. Wish I would have paid attention to others who said 'too much cream, not enough eggs' because even after cooking it extra time, it was still runny and undone appearing, and not very appetizing to my family. Perhaps reheating it might make it better. There is lots left over. I will stick to using Swiss Cheese and Onion Quiche."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jwic3"
},
"reviewBody": "Awesome starter recipe! Easy to make, yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lucynda Hollowoa-Riley"
},
"reviewBody": "I did not care for this. Never again will I make a quiche that does not include leek soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Divaluangraj"
},
"reviewBody": "There is way to much half &amp; half and not enough egg in this basic recipe, I reduced the half &amp;half to 1 1/2 cup and used 5 eggs. I like meat in my quiche but can't count off for it since this a recipe for BASIC QUICHE, it's an awesome example for a person new to making quiche. You can personalize this to suite lots of different taste.\nI personally like to use Kraft 3 cheese blend (1 cup) and 1/2 cup cubed ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "best, creamiest quiche ever. In fact making this quiche made me wonder if it's possible to make a sweet quiche, like a vanilla bacon maple quiche with a bruleed top. or a quiche with a bit of pumpkin and maple mixed in. It is so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodE"
},
"reviewBody": "I have made this lots of times. It is a favorite in my family and I use different add-ins each time depending on what I have on hand. The kids love it. It also reheats well so we enjoy having one cooked and on hand for those rush dinners during the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "butteredbisquit"
},
"reviewBody": "Too much cream. I did a cup and a half and it was still too gooey. I prefer thicker quiche."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lolauren"
},
"reviewBody": "really tasty basic recipe. Added ham steak and spinach and was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MadamC"
},
"reviewBody": "I really wanted to like this recipe more than I did. I think that there is too much nutmeg, it is a spice I rarely use, so maybe I am just over sensitive to the flavor. I also had to bake it a little longer. I turned the oven up to 175 degrees and baked for an additional 10 minutes. With that modification the consistency turned out good. I added red bell pepper, onion, broccoli ,and ham to the dish and it still came out bland (except for the nutmeg)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dbdmurals"
},
"reviewBody": "I used the basic recipe for proportions which is exactly what I was looking for! I used what I had as add ins. Pepper jack cheese layered on the bottom of the crust (I also precooked the crust for about 10 min) then sliced tomatoes on top, then chopped up deli turkey. I had some fresh spinach which i sauteed with garlic and shallots and added that on top of the turkey. I poured the egg mixture on top and didn't use it all because it was starting to sneak out the edge :) It definitely needed extra time to cook but it also is important to let it firm up again after it's done. I let it sit out about 10 or 15 minutes and it was perfect! Such a great way to use leftovers :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMOBIUS"
},
"reviewBody": "We added some ham and substituted gruyere for the jarlsberg and evaporated milk for the half-and-half it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EfWarren"
},
"reviewBody": "Used Gruyere cheese for this along with the following filling: Sauteed a 6 oz bag of spinach, and removed water by pressing between a couple of paper towels, chopped and sauteed crimini mushrooms with 1 clove of garlic and added the chopped spinach back into the mix with a pinch of salt and pepper. Was a big it a brunch :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Nicol Colemere"
},
"reviewBody": "Loved this! My family's favorite add-ins are spinach (frozen, thawed and drained of excess water), asparagus and bacon (my kids ate asparagus!), chopped and cooked broccoli, and ham. You can add anything to this great, basic quiche. It has turned out great for me every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsJPS"
},
"reviewBody": "Great base recipe! I used this base to make mini quiches using the Cream Cheese Tart Shells from this site for crust. I modifed the filling and instead used swiss cheese, ham, and chives, a tiny pinch in each shell and then topped with Shelley's egg filling. They were a hit at the baby shower! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Best ever quiche - finally set in the middle! I did substitue 2 cups of low-fat cottage cheese for the cream; it's extremely yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TXCook"
},
"reviewBody": "Excellent basic quiche recipe! I used 3/4c cream and 3/4c 2% milk to cut down on the fat/calories. I stuck with the 4 eggs and the consistency was perfect. For the fillings I added shredded mozzarella, fresh basil, sun dried tomatoes and green onions. It was divine! Anything would work - that's the beauty of this recipe. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Czarny"
},
"reviewBody": "Great basis for easy Quiche! This was my 1st attempt, I made it for Christmas Brunch for my husbands family. I opted for Cheddar instead of Jarlsburg and added 1 frozen spinach, drained and dried and diced roasted red pepper for the the green/red look. SUPER tasty!! I'm making it again for a party next weekend!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G'ma Suzie"
},
"reviewBody": "I made this quiche using 4 lg. eggs, 1 can evaporated milk, sauted red onion-chopped, H.F. Turkey Sausage-thinly sliced, Mozzerella and Cheddar Cheese. I pre-baked the crust-cooled, put cheese in the crust, poured egg mix, topped with sauted onion and meat. Yum. Even the grandkids ate it all up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin G"
},
"reviewBody": "Perfect. Baked this filling inside \"Cream Cheese Tart Shells\" on this site. A definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher"
},
"reviewBody": "Perfectly adaptable for large volume preparation with variation of cheeses to match different add-ins like meat or seafood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kabulgaf"
},
"reviewBody": "great basic quiche recipe, although I'm not sure how one could fit the entire quiche filling into one 9\" pie crust. I had plenty of mixture for two 9\" pie crusts... &amp;the only mod I made was the addition of some crumbled bacon, which took up next to no room."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMWARNER"
},
"reviewBody": "This was a great base recipe. I omitted the cheese called for in the recipe and made my own variations. Cheddar and bacon is nice. Sauted onion and julienned zuchini with goat cheese was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonia"
},
"reviewBody": "Fantastic recipe. A few tweaks though-- lose half a cup of the cream, and add an extra egg, or it's a bit too light. I throw in a little chopped ham and some sauteed onions too to jazz it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brittany Austin"
},
"reviewBody": "Good quiche but a little bit too much custardy taste. I made mine with a 3 cheese mix and also a cup of chopped ham. I think next time I will reduce the half and half to 1 1/2 cups and add 5 eggs instead of 4. I will also reduce the temp and cook it a little bit longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherpajohn"
},
"reviewBody": "Best quiche recipe I have found! I only used 2 eggs and a cup of 5% cream - had a fair bit of \"filling\" - but it turned out great, nice and light and fluffy - not overdone or too dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ONE2THREE4"
},
"reviewBody": "there is way too much half and half in the recipe, i use 5 eggs and 1 cup of half and half and it works for me. i add chopped red and green bell peppers and its delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KBT24"
},
"reviewBody": "I thought this was great. Although I did alter the recipe. I left out the nutmeg, replaced white pepper with black pepper (left these out just b/c I didn't have them) and I added hot Italian sausage and some cherry tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "diny"
},
"reviewBody": "I am forever using recipes as a \"guide\" and changing things to please my family. I doubled the recipe for two quiche. I also used smoked cheddar and mozzarella I also sauteed onion and added crumbled bacon- a much heartier dish for dinner. I read one reviewer thought there was too much half and half but I did not have a problem there.. I did however add an additional egg. Also, I found that I had to cook for additional 10 minutes-could have been my oven or the fact that I was cooking two at a time. I did have to cover the crust about halfway through. My gas oven seems to cook too hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatGilland"
},
"reviewBody": "I have found that if I up the dairy to 3 cups and the eggs to 6 I can just fill 2 9-inch shells with some filling as well... My 6 year old loves the chopped up deli chicken, onion and cheddar version I make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsMolly69"
},
"reviewBody": "Amazing! Used the suggestions with the bacon, onion and gouda! WOW! The only thing I did different was use 1cup 1/2 and 1/2 and 1cup 2% milk!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46570/basic-quiche-by-shelly/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
"name": "Quiche"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46570/basic-quiche-by-shelly/",
"name": "Basic Quiche by Shelly"
}
}
]
}
}
, "about": [
]
}
]