				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bazlama - Turkish Flat Bread"
,"datePublished": "2020-06-18T23:43:14.000-04:00"
,"dateModified": "2020-06-18T23:43:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "sharwna"
,"url": "https://www.allrecipes.com/cook/3163417"
}
]
,"description": "This simple flatbread gets its tang from yogurt. It&#39;s best served warm."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/2mxGyLHv5G6_q2WfEulzj3uSQXY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8605224-9742b31157e34b84904a1097885479ea.jpg",
"height": 1523,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bazlama - Turkish Flat Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "72"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "505 kcal"
,"carbohydrateContent": "100 g"
,"cholesterolContent": "6 mg"
,"fiberContent": "4 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "1766 mg"
,"sugarContent": "5 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 (.25 ounce) package active dry yeast",
"1 tablespoon white sugar",
"1 tablespoon salt",
"1.5 cups warm water (110 degrees F/45 degrees C)",
"0.5 cup Greek-style yogurt",
"4 cups all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Dissolve the yeast, sugar, and salt in the warm water. Add the water and yogurt to the flour and mix well. The dough will be soft but not sticky. Turn the dough out onto a lightly floured surface and shape it into a ball. Cover the dough with a damp cloth and allow it to rise at room temperature for 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Cut the dough into four portions. Shape the dough into rounds and flatten each round as though you&#39;re making pizza dough. Cover the rounds with a damp cloth and let the dough rest for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Heat a cast iron skillet or griddle over medium-high heat. Place one dough round in the skillet and bake until brown spots appear on the bottom, about 1 minute. Flip the bread and bake for an additional minute. Remove the bread and wrap it in a clean kitchen towel to keep warm."
} ,{
"@type": "HowToStep"
,"text": "Repeat with the remaining dough rounds. Store any leftover flatbreads in an airtight container."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT240M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya L Miller"
},
"reviewBody": "Was very easy to make had no issues whatsoever. Love the taste and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KathleenB"
},
"reviewBody": "These were just okay, nothing spectacular. I made the recipe exactly as instructed and found the portions too large and too thick. If I make this again, next time I'll divide the dough into 6 or 8 pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson's Mommy"
},
"reviewBody": "First time making this bread. Loved that they puffed up, like a balloon! The extreme puffing occurred when I prematurely flipped the bread over after approximately 30 seconds and then flipped them over again after about another 30 seconds. I decided that I liked them this way, like a pocket pita. The family loved them with Indian chicken curry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Serela"
},
"reviewBody": "Wonderful recipe-- super easy to make and turns out great reliably even if you forget about it. Haven't tried adding herbs and garlic to it like other reviewers but I can imagine it would taste imagine. Definitely something hobbits would eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilona Steinhart"
},
"reviewBody": "It came out so well! It does need 7-10 minutes of needing and the cooking time is an estimate, but it's similar to pita and other flatbreads. They puffed exactly like pita. This is so fluffy with only a tiny tang from the yogurt. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lela"
},
"reviewBody": "I liked the flat bread it was better than store bought. My family enjoyed eating the soft and thick flat bread. After reading some reviews, I used I a cup of water. I mixed the dough in my Kitchen aid mixer using the dough hook. I let the bread rise for one hour. I placed the dough in a oiled bowl before covering with damp towel. I think next time, I will let the dough rise a little longer for 2 hours. I would also use only 2 teaspoons of salt because I thoughtit was a bit salty. I also used a rolling pin to roll out the flat bread. I made 10 flat breads about 7 inches in diameter. When cooking, heat up the cast-iron griddle to medium low. Medium high was to hot. When you see bubbles on the bread flip the bread over. It took 10 seconds. Then flip over for another 10 seconds. Flip over again and cook for another 10 seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This was a tasty flatbread. My husband and I really enjoyed the flavor. I did find the dough to be super super sticky to work with, even with using extra flour. It was really difficult to move the flatbreads to the skillet and have them retain any sort of shape. If I were to make these again, I'd probably make them smaller--maybe try 6 rounds, instead of 4, to see if that makes them easier to handle. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JaxMom"
},
"reviewBody": "3 stars for taste but even being an experienced baker, this dough was hard to work with.\nI had to add an excessive amount of flour to make it able to be handled/moved from the resting board to the skillet.\nAlso, cooking directions are somewhat vague. I had the best results covering my skillet. \nI made 5 smallish rounds that rose about an inch thick, or more. I would like them thinner and may try again with more flour so I can actually flatten the dough easily.\nA good base recipe but needs work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "This made a nice, substantial bread. It needed much more flour than stated in the recipe... And it was still somewhat sticky to work with, even after I had added about a cup of additional flour.\n\nI will make it again, though I think it would be even better with herbs mixed in the dough and a brush of butter after they're done. My rounds (6) were thick and cooked a long time for each side on my electric griddle (Set @ 350 -375) but I loved knowing I could make this bread without using the oven-- which is a real plus in hot weather.\n\nSince my rounds cooked up thick, I may split the leftovers for sandwiches or individual pizzas. Yummy any way you eat them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Taylor"
},
"reviewBody": "Oh this was sooo good! My Turkish partner and I agreed that this was the real deal! I did cut the salt in half, and it was plenty salty as it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oceanghurl"
},
"reviewBody": "Awesome. I used bread flour, cause that's what I had. And 2 tsp of instant yeast. I basted them with butter on both sides. What you don't eat right away, wrap and reheat in the toaster, they're great. They also split open easily, like a pita, especially if you toast them. This is good plain and extremely versatile for dipping or stuffing. Yay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jo Rivet"
},
"reviewBody": "This flat bread is really good. Made it as is, it turned out great. Today I am going to try it adding garlic and basil. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenn Sia"
},
"reviewBody": "It was good, although the desired amount of Bazlama in the end for the original recipe, I realized, was too much for a small family. I reduced the recipe, and the Bazlamas came out to be delicious! A little Spinach and Goat Cheese spread goes well with it, and a little Garlic Butter as a side goes a long way! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sudhir"
},
"reviewBody": "Great tasting bread when I got it right! I had to increase the flour (as suggested by some other reviewers) as it came out all sticky when I used the ingredients in the proportions described. I suggest halving the amount of water and add more only if necessary to bind all the flour together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NicolaC"
},
"reviewBody": "This is the first time I have ever made bread and I found the recipe so simple. I stuck to the quantities specified in the recipe and was surprised to yield eight very large flat breads. \nI served them with spicy lamb koftas, greek salad and tzatziki and they went down really well. \nI will definitely use this recicpe again and maybe serve with some garlic butter/mayo. I think the breads would be very versatile and could even be used with a curry or a pasts dish for mopping up. \nOverall, a big thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shoshannah"
},
"reviewBody": "Yummy! Close to pita in texture but don't have to heat up the oven on a hot day to make them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I thought this was okay. I must admit I found it to be quite heavy and yeasty compared to other flat breads I have tried. I usually make naan bread from this site. Some of the directions were kind of vague, like I would like to have known how large the rounds should be. I accidentally ended up flattening them after they rested. They were quite wet, and sticky, and difficult to maneuver in a hot pan. I didn't have a cast iron so I heated one of my better pans to medium high. I was finding that temp way too high. The dough would get black in spots and I only had four attempts to get it right. I turned it down to about 5 1/2 once the pan was well hot. It took a little longer. However, the dough seemed to get fully cooked, that way, and lightly browned instead. Sometimes a hotter griddle is better and sometimes not. I decided to cut them like the picture to use more as an appetizer being how filling and dense this bread is. I would have also liked some serving suggestions and whether they were best brushed with salted butter, as I did, or added garlic or something else. It needed something for additional flavoring. I would look for a recipe for Olga bread or snackers for possible ideas for seasoning ideas for this bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "My grandson loved this. I felt it should have been rolled out quite thinly. May have been me! Will try again, I did use a cast iron pan and may not have heated it correctly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna Cross"
},
"reviewBody": "Oh my gosh I love this bread and so did kids!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookinglildebbies"
},
"reviewBody": "Amazing!!!!! Made it for the first time today sand it was a huge hit. Will make again. Would also make a great pizza dough as well. We had it with homemade hummus"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Everitt"
},
"reviewBody": "Delicious, slightly tangy, slightly chewy bread. Easy to make and ... have now made it 6 times in the last 8 days. Can rise for as little as 1.5 hours to as long as 6 hrs, so flexible. Favourite is as written by Sharwna above, with dough pressed out to just slightly less than 1 cm thick; can then really taste the flavour of the bread/dough. But is also great stuffed. Favourite stuffed was simply with some finely chopped/broken feta cheese, sprinkled with some garlic and black pepper. Also stuffed it with 'Middle-Eastern' seasoned ground beef. We prefer it if the bread does not puff, more tangy bread flavour, but can also be cooked a few moments longer so the bread puffs up. Then is great for stuffed pita sandwiches. Nummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "I live in Germany and I think one of my ingredients was somehow not equal to the american equivalent. My dough was super sticky and incredibly difficult to work with. I'm going to use my electric mixer to combine the wet and dry ingredients next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuoLoco"
},
"reviewBody": "We made 2 batches and they were gone in a few minutes. Everyone raved at how good they were. I did use a little olive oil in the skillet for each one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "This is a great and very nutricious bread. The whole family loved. This definitely will be our new favorite flatbread recipe. Next time will make this bread with stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daria Sorhaindo"
},
"reviewBody": "It came out just as the recipe suggested, excellently.I used a stone oven to bake them and rye flour instead of white and it was fabulous. It's a recipe I will try again. The breads are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "We made this for a class project on Turkey, and the kids and parents loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SLS73"
},
"reviewBody": "I mixed this in my KitchenAid (which I make my pizza dough in almost weekly and used that experience kind of as my guide). I added a lot more flour as it was mixing (probably close to a cup). I was worried about adding too much and changing the texture of the dough---not to worry. I will make this again and add as much flour as it feels like it needs. Even with the extra, the dough just didn't want to hold together (thin/thick spots, holes) and was hard to work with. That being said, it's very tasty, therefore I will play with this. Made six large pieces. Worth playing around with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ginger"
},
"reviewBody": "This is another simple recipe I use in my foods class with. Jr and Sr. High school kids. This is the easiest recipe to make and I have even substituted buttermilk for yogurt before. It is also a very forgiving recipe. I have made it on Tuesday and put it in the fridge and we rolled it out on Thursday and cooked it in an iron skillet without a problem. I’ve left it in the fridge for over a week before without rising it first and without any problem. I make up a lot in advance, cook them and cool them about pan size. I separate them with wax paper and freeze them. When the kids are hungry, they just get one out, cover with pizza sauce and cheese and bake them for 5-10 mins until cheese is melted. Makes the best pizzas and sandwiches. I get a lot of compliments on my ham sandwiches when I use ham and cheese and the sub dressing at walmart deli drizzled over the shredded lettuce. You cannot go wrong with this recipe. If you are a newb, try it. You can’t fail!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Home Cooking"
},
"reviewBody": "I tried this on Saturday and it turned out really well. Used a copper bottomed pan to bake as I dont have cast iron. The finsished product has so many possibilities."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peas with Honey"
},
"reviewBody": "I can literally count on less than one hand the amount of times per year that we eat out, but when we do happen to be in a bind, we try to eat at Subway or something that will have a lot of fresh veggies. My hubs loves their flatbread sandwiches. Now I can cross Subway off my list of places we ever need to eat! This is even better! My dough made 8 LARGE rounds and it was sticky and took a lot of extra flour. I dry toasted it on a nonstick skillet. In the future I would use less salt. I made grilled eggplant sandwiches with onion and tomato and salted NOTHING so it balanced out. But on any other occasion this bread would be waaay salty, and I love my salt! I will definitely be cooking up extra of this to freeze for quick egg sandwich breakfasts, dinners, heck, anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tracybates"
},
"reviewBody": "I really liked this bread but, like a few others, I too found the dough extremely sticky. I cut the recipe in half and I still added at least an extra 3/4 cup of flour because it was so sticky that I could barely flatten it without it getting stuck to my fingers and hands. I was worried that I was adding too much flour and would end up with tough bread, but the end result was surprisngly tasty even though it didn't look anything like the flat breads I sampled in Turkey. I will definitely make this again but next time I'm planning on adding at least an extra cup of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ljrus"
},
"reviewBody": "One of the best. Only problem is that I eat all of it in one day. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coop's mom"
},
"reviewBody": "We do our dough in the bread machine. Turns out perfect. Cooked ours on BBQ. Colored and bubbled beautifully! Makes this really easy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andrea92fl"
},
"reviewBody": "I really enjoyed these! Quite different from the usual. They go very well with onion and chives spread. Only negative is that once I flattened them they were too large for my griddle, so I had to divide them more to make them smaller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SeaWench"
},
"reviewBody": "I read the other reviews and only one person that I could see said this dough was sticky yet I couldn't even work with it, it was so sticky. I double checked my ingredient measurements, all were correct. I ended up adding probably another whole cup of flour before I could even handle it. That said, the end result was very yummy bread. My other half loved it and that's always a good sign."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine Scott-Cochran"
},
"reviewBody": "i added garlic, parsley,and pepper to my yogurt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackiew75"
},
"reviewBody": "Amazing! I did not have the yogurt so I substituted sour cream. Made one batch as stated and another adding chopped cilantro and lime zest. Great both ways!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hayleymclain"
},
"reviewBody": "I just made this recipe for the first time. Yum! We found our new favorite flatbread recipe. Like others noted, I found that the recipe made 8 tortilla sized rounds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LAURCL"
},
"reviewBody": "This tasted great. It was very sticky even when I added more flour. I'd like a better idea of how soft the dough should be. I was worried I was going to add too much flour and make it dry. I didn't add enough flour to have it hold its shape. But I'd make it again. It was very easy and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janelle"
},
"reviewBody": "this was delectable. a gorgeously simple recipe, and it was devoured joyfully by friends &amp; family alike. thanks so much for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "I just made it for the first time and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Mayer Kaelblein"
},
"reviewBody": "so easy. didn't wait the 3 hours only had 2 and it was so mmmmmmm good. i love ethnic food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Toni Jo Fire Eating Pro"
},
"reviewBody": "Made this twice. Once exactly as the recipe read, and once adding fresh garlic and herbs. The second batch was tastier, but not as good as I had hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "summertime_blews"
},
"reviewBody": "I love this bread! It is easy to prepare and cooks on top of the stove. No need to heat up the house using the oven for this stuff! I have made it three weeks in a row now and the first time I followed the recipe exactly. The 2nd time I added shives and dillweed. (delicious!) The 3rd time I substituted 1/2 the white flour with wheat flour and added honey for a honey wheat flavor (also delicious!) I had to cook the wheat bread a tad longer than the plain white. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "Very good just made yesturday yum. Is a little sticky just use a little sprinkle of flour when rolling out. I like slightly thicker than very thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtnwoman"
},
"reviewBody": "Super easy to make and tastes great. We've had them with hummus, butter, or refried beans and meat. Once I substituted mascarpone for the yogurt and it tasted great. I cook mine on a 400 degree grill for about 2-3 minutes per side. Like other reviewers, I get 8 servings per recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "italian delizia"
},
"reviewBody": "I stuffed 2 rounds with black olive tapenade and 2 rounds with with grilled artichoes in olive oil..Oh my were sooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inji Dogukan Palmer"
},
"reviewBody": "In Turkey, we make our bazlamas stuffed w/feta and parsley, ground beef w/tomato, or mash potatoes...Just flatten the dough and put a thin layer of crumbled feta and chopped parsley, flip one side to cover the stuffing (like an omelet) and cook both sides...Eat with sour cherry jam and hot tea as our usual Sunday breakfast..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Demarchi"
},
"reviewBody": "Delicious! I made it to go w/ some homemade hummus - I also imagine it would be tasty dipped in a curry. The dough was a bit sticky and needed lots of flour to flatten the rounds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne B-A"
},
"reviewBody": "I really enjoyed this. I couldn't resist adding some minced garlic to the dough (as well as a few spices) and that worked well. Like another reviewer, I ended up with 8 rounds (cooked on a skillet) rather than 4. I was able to cook them without any sort of oil or butter on the pan at all. Mine took closer to three minutes per side (rather than 1). This may be because I did not form thin enough discs though. Either way, they were delicious and I'll definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madd0g39"
},
"reviewBody": "This is a great recipe. I used olive oil to cook it and it was fabulous! I would recommend halving the recipeas it yielded a total of 8 flats. (I did try freezing half of it as well and I wouldn't recommend it as the dough doesn't rise well after it's defrosted and it drys out pretty fast.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Epic deliciousness! I felt like a hobbit eating these! I think this would make for a fantastic pizza crust, so I froze half the dough in a tight, saran-wrapped ball for using another day. The only trouble that I encountered was transferring a dough round onto the griddle, as it didn't really retain any round shape. (And was stickier than I anticipated.) But forget the shape b/c the taste was simple and divine, and even better when I slathered it in the \"Basic Hummus\" recipe from here. When I defrost the remaining dough, I plan on either trying it as pizza crust, or making smaller flat-bread \"balls\" on the griddle, as opposed to the big floppy (albeit, scrumptious!) dough pile that I had today. Thank you for a great recipe sharwna!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/215599/bazlama-turkish-flat-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
"name": "Flat Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/215599/bazlama-turkish-flat-bread/",
"name": "Bazlama - Turkish Flat Bread"
}
}
]
}
}
, "about": [
]
}
]