				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Beefy Baked Ravioli"
,"datePublished": "2005-06-30T10:10:13.000-04:00"
,"dateModified": "2022-09-16T15:35:29.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Angie Shirk Williams"
,"url": "https://www.allrecipes.com/cook/1451539"
}
]
,"description": "This recipe is a hit with my husband and everyone else I&#39;ve given the recipe to. It&#39;s very easy and satisfies that Italian craving."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gaUB1tN47yCc0esk3x30-pkytdM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/281728-beefy-baked-ravioli-Candice-Steele-4x3-1-2cd8ea02869f4a7084ce1f342db80e56.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Beefy Baked Ravioli"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "911"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "465 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "100 mg"
,"fiberContent": "4 g"
,"proteinContent": "31 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "746 mg"
,"sugarContent": "9 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 pound ground beef",
"0.5 (25 ounce) package frozen cheese ravioli",
"1 (14 ounce) jar spaghetti sauce",
"1 (14.5 ounce) can diced tomatoes, drained",
"1 cup shredded mozzarella cheese",
"1 cup shredded Monterey Jack cheese",
"1 tablespoon grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Crumble the ground beef into a large skillet over medium-high heat. Cook and stir until no longer pink. Drain grease, then stir in the spaghetti sauce and tomatoes."
} ,{
"@type": "HowToStep"
,"text": "Spread 1/3 of the sauce in the bottom of an 11x7 inch baking dish. Arrange 1/2 of the ravioli over the sauce. Sprinkle 1/2 of the mozzarella cheese and 1/2 of the Monterey Jack cheese over the ravioli. Repeat layers, ending with the last of the sauce on top. Cover with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake for 30 minutes in the preheated oven. Sprinkle Parmesan cheese over the top before serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Cooper"
},
"reviewBody": "Very good and easy! I enlarged the recipe,added garlic and mushrooms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was totally yummy! I added sautéed peppers to the sauce &amp; a layer of provolone cheese on the second layer. Remove the foil, lower temperature to 350 &amp; stick it back in the oven to let the top brown. Taste is amazing, a crave worthy meal better than lasagna!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I used a low sodium Marinara sauce because I like the flavor of it better than a Spaghetti sauce. I think I will cut the ground beef back to 1/2 lb next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lila vandermay"
},
"reviewBody": "This was fantastic.. As for the person who said its not cooking..they obviously dont make there's from scratch cause ur looking up frozen ravioli ...otherwise u would of searched \"ravioli from scratch \" I think this a great recipe..just like from scratch!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve McWilliams"
},
"reviewBody": "Hugh hit for Sunday dinner. would not change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mother Ann"
},
"reviewBody": "This was good and we all agreed I should make it again. However, next time I think I will use a little less meat and cheese, especially less meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "My family loved this! Very easy on a workday to put together. I did add diced onion and garlic to the meat mixture. I used one 13 ounce bag and half of a 13 ounce bag of mini ravioli. I liked the combination of mozzarella and Monterey Jack cheeses. Definitely will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Lindsey"
},
"reviewBody": "This recipe rocked!! I browned the hamburger with onions, peppers, basil, parsley. We loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "My husband isn't crazy about ravioli, but I like it and make it. Last night I made this for dinner. He said it was delicious and the best ravioli he'd ever had. He's now a fan of ravioli, at least this recipe. Thanks for the sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Clark"
},
"reviewBody": "Not too bad for a slight variation on a lasagna. I used refrigerated fresh ravioli from the deli section, Italian sausage instead of ground beef, ricotta mixture layered with the cheeses, and my homemade sauce... turned out perfect. This might become a monthly recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "Very good recipe. Wife and I liked it and will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "Absolutely loved it! Made it twice already and added spinach the 2nd time. I also browned hot sausage with the ground beef since we love sausage. This is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "genibean"
},
"reviewBody": "Very good basic recipe. My variations are as follows. First I made my own sauce from a large can of tomato purée, spices, chopped onion and ground beef with sweet Italian sausage. Because it was a quick sauce, I did not used tomato paste. When using paste, cooking time is minimum of three hour to cook out the acidity. I also had some frozen eggplant. Michael Angelos makes the breaded eggplant slices and I get it in 3 pound bag at BJs. In a 13x9 foil pan, spray with Pam, layered sauce, defrosted eggplant, one pk of mini defrosted cheese ravioli, sauce, deli sliced provolone cheese, defrosted eggplant, sauce, Parmesan on top. This is what I had in my house. Covered tightly with foil, baked at 425 for 1 hour in my toaster oven. Removed the foil, baked 15 more minutes at 400 to brown top. Let sit for 20 minutes before cutting. Served with cucumber, tomato and onion salad dressed with red wine vinegar and EVOO. Cubed dinner rolls sprinkled with EVOO, garlic powder, onion, powder and parsley. Toasted while ravioli was resting. Then topped with Parmesan. No mess, no fuss, no oven to clean, foil pan to the trash. Enough leftovers for a lunch during the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carey Coble Rohrer"
},
"reviewBody": "This is a very easy meal for busy families. You can keep the ingredients on hand to make at last minute, too. I have made several times and the family loves it as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenstri"
},
"reviewBody": "I used refrigerated ravioli instead of frozen, but that is the only thing I did differently! LOVED IT! We will definitely be having this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Mead"
},
"reviewBody": "Enjoyed this so much have made it twice over the past 30 days. Very easy recipe, easy and quick to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christy demeulenaere"
},
"reviewBody": "Added 1/2 lb burger and extra cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lblady45"
},
"reviewBody": "Made if for the entire family last Sunday. They loved it. Made no changes and it is definitely a keeper! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria McLeaster"
},
"reviewBody": "really good recipe. added onion, minced garlic, and italian seasoning to meat while browning. used whole bag of pasta and whole jar of spaghetti sauce. the only complaint my daughter had was it didnt have enough meat sauce. will double next time. also dolloped ricotta cheese inbetween layers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "I did not have diced tomatoes, so made without.\n\nAlso needs clarification on directions. It should say that Sauce for layering is the Sauce mixed with meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjacak"
},
"reviewBody": "Very good. Quick and easy. I used a whole bag of ravioli, so I doubled the meat (used a pound of ground Italian sausage and a pound of ground beef), a large jar of sauce (28oz?), still only 1 can of tomatoes (I used crushed because the kids don’t like chunky tomatoes), doubled the cheese, and sprinkled Parmesan on each layer. Easy, weeknight dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "Easy &amp; yummy. I misread the ingredients and used 2 pkg of large ravioli (DUH!) but it was fine. I read a few reviews and appreciated not having to cook the pasta ahead of time. I too added some chopped onion &amp; garlic to the sauce (1-1/2 lb ground beef + 28 oz can spaghetti sauce + 14 oz can diced Italian tomatoes = I guess doubling recipe) Also doubled cheese and it fed our 5 member family with leftovers to spare. Thanks so much for an fast \"lasagna\" fix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alteredartgirl"
},
"reviewBody": "This was delicious. 5 stars with some reviewers additions. I added onions, mushrooms, garlic and italian seasoning and seasoning salt with the meat. Used 1 bag of meat and 1 bag of cheese raviolis. Ended up using 24oz pasta sauce and about another 14oz. Used a 9x13 Pyrex and it was very full. After 30 min. I lowered the temp to 350 and baked uncovered for 10 min. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nise"
},
"reviewBody": "quick and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aoverholser"
},
"reviewBody": "I used the entire 25 ounce package of Ravioli. This almost perfectly makes 2 layers of Ravioli in a 13x9 baking dish. I used a 24 ounce jar of spaghetti sauce, I doubled the amount of cheese, using two cups of each. And I also added a layer of pepperoni , because I had it on hand and wanted to use it. I also diced up a couple of Jalapeno peppers and mixed with the ground beef to add a little kick. Next time, I won't use as much cheese. When baking the full package of Ravioli, you will want to add more than 1 cup of each cheese, but 2 was too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RaChEl89"
},
"reviewBody": "Turned out really yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Nelson Thomas"
},
"reviewBody": "Perfect easy casserole that can feed a good amount of people. My family really enjoyed and we will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aghgirl 02"
},
"reviewBody": "So delicious! I made it for my family and they were all super fans, but my dad wouldn’t stop raving about it. He even said it was “restaurant quality.” I did make minor changes; i I did extra cheese (maybe 1.5 cups each instead of one), and added garlic to the meat sauce. Ended up being a winner for sure!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandie Hennessey"
},
"reviewBody": "This was great and so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marybeth"
},
"reviewBody": "Well...I never make it like the recipe. Lol...I always change things. So I used 2 lb ground beef, a 24 oz can of spaghetti sauce and the whole bag of raviolis. I also changed the Monterey Jack to extra sharp cheddar. The boys who do not like lasagna loved it. It has been added to the repertoire. Especially since it portions and freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole Ruben Barrow Geigle"
},
"reviewBody": "I used one and a half large jars of spaghetti sauce because I didn't have tomatoes and whole bag of ravioli. Instead of Monterey Jack I used baby Swiss because I had it in the fridge. Baked in a 9 x 13 pan. Used the other half jar of sauce for extra on top. This was so good we both had seconds. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kellygirl"
},
"reviewBody": "The only change I made was using Italian sausage rather than ground beef. The first time I made it, it was good, just not much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Renney"
},
"reviewBody": "very easy to make and was delicious. thanks for recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo22Babes"
},
"reviewBody": "Stuck at home in nasty weather - this is perfect for a hot satisfying meal. Even Hubs - who is NOT a pasta lover- really enjoyed his three helpings. We were chilled to the bone and wanted nothing more than pure comfort. This was excellent .\nEasy to make with items on hand. Served with hot bread and a small side salad, YUM Thanks for a great addition to our recipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "Way easier then lasagna with the same flare! I set the raviolis out for a bit to let them thaw while I made the sauce. Onions, garlic, meat sautéed then drained...then simmered in jarred sauce with extra seasonings type thing. I tossed the raviolis in a spicy bread crumb mix before layering them. I added ricotta and whatever other cheese that was in the house that needed to go so it was a nice mix! I made a half batch, covered and baked for the thirty minutes while I made a salad and had dinner on the table in a timely manner after a long day of work. I will totally do this again!! Thank you for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimmi"
},
"reviewBody": "Used whole fresh tomatoes and added creole sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A@4U"
},
"reviewBody": "Very tasty! I had homemade meat sauce left-over from a previous spaghetti &amp; meat sauce dinner plus a package of fresh mini ravioli about to expire. This recipe was perfect for my pantry/fridge-night dinner. I did not have Monterrey Jack on hand so I used the mozzarella and ricotta for the cheeses and then topped with a generous layer of Parmesan-Reggiano. Next time, if using the fresh mini ravioli, I will double the ravioli layer as it was a bit light on pasta. We enjoyed this recipe - especially my 10 year old. Thanks for a quick and easy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Riley"
},
"reviewBody": "This meal was awesome. I am very new to cooking, but this was fun and easy to do. I didn’t have the right pan size, but made it work. The lady and cousin approve it. ??????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momofbnkk"
},
"reviewBody": "Great easy recipe! Quick enough for a school night. Similar in taste to lasagna, but quicker and easier. All 4 kids and hubby liked it enough to ask for seconds. I used others suggestions for a larger batch; 9x13 pan, full bag of raviolis, 2 c. mozzarella, 2 c. Mexican cheese (with monterey jack in it, because that's what I had on hand), dollops of ricotta cheese (I didn't measure, but I used just less then half the container), 1# hamburg (cooked with garlic powder and onion powder), 26 oz. jar of Prego pasta sauce. It filled the pan very near the top; I placed a sheetpan underneath just in case it bubbled over, but it did not. Covered with foil, baked at 450 for 30 mins, removed foil and baked 10 mins more at 350. Came out perfect, and we all enjoyed. Thanks for a nice easy recipe my whole family will eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Maxwell"
},
"reviewBody": "My wife made this for dinner tonight. Turned awesome. Added chili meat from last night. th The spice just added to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IAMom"
},
"reviewBody": "Our family really enjoyed this as a weeknight dinner. Easy to put together which I appreciated.\n\nWould maybe add a little salt or garlic to the ground beef next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Myers"
},
"reviewBody": "This one is a keeper. Such a lovely idea for a quick yet satisfying lasagna type meal. I did change one or two things, no Monterey Jack cheese because well, that cheese should never be in ANYTHING that is Italian and I used turkey Italian sausage as my meat. I also threw in some ricotta cheese on one of the layers to give it more of a lasagna feel. But this was such an easy and quick dinner and after working 40 hours, just what I needed. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tlarcha"
},
"reviewBody": "This was very good. For my sauce I used a Lawry spaghetti sauce packet, made as directed on packet using tomato sauce instead of paste. Added onion and garlic to the meat. Layered as instructed, using frozen cheese ravioli. It’s definitely a keeper. Going to try different types of ravioli also"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Wagner"
},
"reviewBody": "Great recipes but next time I’ll remember to put sausage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jade W"
},
"reviewBody": "very easy, fast and cheap! tasted great! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L. Higgins"
},
"reviewBody": "I ended up using more of each ingredient than I thought I would, including adding a layer of cheese over the top before putting it in the oven. The meat was a little flavorless, so next time I will add seasonings and maybe onions to the meat when I cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Granville"
},
"reviewBody": "Quick delicious lasagna! I used refrigerated ravioli instead since that's what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly's Kitchen recipes"
},
"reviewBody": "This was easy and delicious. My husband loved it! My only change was to use gluten free ravioli, and I added onions, garlic and basil to the sauce. I like those flavors in my sauce but the recipe itself didn’t need it. Thanks for posting...such a great idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rbf59"
},
"reviewBody": "Made exactly as recipe said, was delicious will deffenity make again , shared it with a co-worker her family loved it to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Taylor"
},
"reviewBody": "I made this per the recipe. Next time I will include juice from diced tomatoes as this was a little dry. I will also bake it on a lower temperature as the cheese in the middle did not get as melted and gooey as I like. It was easy to make . The changes I would make are just my own personal taste. Not nearly as expensive to make as lasagna but the taste is very similar. I will be taking this to my next pot luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lwask"
},
"reviewBody": "Tastes just like the baked 7-cheese ravioli from Boston Pizza! So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Napolitano"
},
"reviewBody": "My daughter announced at 7pm that she had to bring something for a food sale at school the next day. I read a few lazy lasagna recipes but none had as many good reviews as this one. My frozen ravioli were round and had big gaps between so I decided to make a regular ricotta lasagna filling to disguise the scant pasta layer. I also used only mozzarella and Parmesan as I didn’t have Monterey Jack. I baked as directed and then broiled on low for five minutes to get a nice brown finish. It was the first dish to sell out! Thanks for saving my butt. This is my new go-to for pot luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Savannah Walters"
},
"reviewBody": "Delicious!!!! I used ground mild Italian sausage instead of ground beef. I think it really made the flavor. Also used double the amount of sauce. Only used mozzarella because that’s our favorite. Baked at 350 for 30 min. (I thought 450 sounded too high for my oven) and then took the foil off the top and baked another 10 min. Broiled the cheese on top for a couple minutes and it was AMAZING!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie-home-maker"
},
"reviewBody": "Delicious and a good sauce can make all the difference! Even better the next day or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Stanley"
},
"reviewBody": "This turned out really well and was so good. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patricia morgan"
},
"reviewBody": "This is a very versatile dish. You can add most anything and it will turn out great. We added onion and green bell pepper to the ground beef\nAnd doubled the sauce, cheese, and ravioli. Next time I will add ricotto cheese as one if the other reviews did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy D"
},
"reviewBody": "Great recipe. super easy to make. can;t go wrong!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawnsdewey"
},
"reviewBody": "A family favorite of ours we make often. I sometimes add shredded zucchini and onion to ground turkey to add some veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetchef21"
},
"reviewBody": "Fantastic recipe, easy to make and leftovers taste just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "retired2lake"
},
"reviewBody": "I’ve made this several times and it runs out great each time. I used 2lbs of ground beef, diced one whole red onion and 2 medium cloves of garlic, used 32oz of sauce, and plenty of basil seasoning. I cooked it for 30 minutes at 450 with foil on,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "Made this for dinner tonight and I loved it! Is it a made from scratch-Gordon Ramsey-picked fresh from the Earth level meal? No, but for us normal people that have either full time jobs, kids, school/church/family commitments, etc(who isn't busy these days, am I right?) it's a great budget friendly and quick throw together dinner. I served this is with garlic bread and steamed broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BeckaBoo79"
},
"reviewBody": "This was really good but def. needed a few tweaks. After reading reviews from prior people with me this recipe I decided their recommendations would help extend this dish for my family. The amount of sauce in the recipe is much too little and is strongly suggest to use a 24 ounce jar or larger. After reading a few of the reviews I decided to add a large can of sliced mushrooms and some frozen pepper and onion mix that I had in the freezer this was added into one and a half 24 ounce jars of tomato sauce and 1 pound of ground beef along with some minced garlic. Instead of using the Monterey Jack cheese I doubled the mozzarella cheese. The one recommendation that I did follow that I will not the next time is 30 min covered at 350, then 15 min uncovered. The temperature of the frozen ravioli was warm but not hot. Do 30 min at 450 covered and then reduce the heat to 350 for 15 min uncovered if you want to make sure it’s nice and hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee-Dee Davidson"
},
"reviewBody": "Love this! Used the whole bag of ravioli, added sliced mushrooms to the ground beef, and some oregano and basil. I was worried about the high temp, but it was perfect. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hill"
},
"reviewBody": "This is a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idyguy"
},
"reviewBody": "We loved it. It was easy to make and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Chitwood"
},
"reviewBody": "Came out great. Might have saved a little time but not a lot. Still very tasty. Added some red wine and the sauce really came together. Added Ricotta in the layers. Whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Weaver"
},
"reviewBody": "This was a fun change of pasta-pace. We enjoyed it. I did need to cook it for 60 minutes though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kris Hodges"
},
"reviewBody": "I've made this twice now and we agree that no meat would be just fine next time because it's too heavy for us. I halve the recipe because it's just the two of us and use a 24 ounce jar of prepared spaghetti sauce and no diced tomatoes then just layer sauce, ravioli or tortelllini and cheese at stated. Thanks Amgie for the great recipe idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric"
},
"reviewBody": "This turned out better than I expected. I followed the tips of another review and used all of the ravioli and doubled the sauce. It fit perfect in a 9x13 dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Grabowski"
},
"reviewBody": "I had to triple the recipe for my hungry guys! A nice garden salad on the side, and presto dinner is served. Thanks for another EASY meal to get us threw our busy weekdays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Hill"
},
"reviewBody": "So easy, good, and inexpensive. I subbed ground turkey for the beef and it was soooo goooddd!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Gamelcy Rodriguez"
},
"reviewBody": "So easy and very good....I used Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Killer! I adored this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Codi Powell"
},
"reviewBody": "Absolutely amazing.. I followed the recipe for the most part but I did saute onions n minced garlic prior to adding the ground beef. I also put my sauce on to simmer with Italian spices and garlic prior to mixing in the ground beef!.. overall amazing and can't wait to make again! frozen ravioli... who would have thought!!! ? so yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susie Gute Wall"
},
"reviewBody": "Joey gave me a 7 and I gave it an 8. I did use the frozen ravioli but it needed to be in oven longer because it was not warm enough. We had to put it in the microwave. I added garlic and a lot of onion. I just used any cheese I had. I also used ground sausage because I had 3/4 pound in the fridge. I think it was a good meal. I should make it again for sure. I might use rotella in in too or use vodka sauce instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Ward"
},
"reviewBody": "I had to make it for work. I added about a teaspoon of garlic salt and some table salt and pepper after mixing in the tomato sauce. It helped take away some of that sweetness for if you're not a huge fan of tomatoes, like myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Pulley"
},
"reviewBody": "My gosh, so easy and delicious! I used refrigerated cheese tortellini and it worked fine. I also threw in some spinach I needed to use. This is just what I needed on a busy night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Hicks"
},
"reviewBody": "I loved this recipe. Alot easier than making Lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "i used a variety of different ravioli { cheese, meat, prosciutto } was awesome. will do again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne Knight"
},
"reviewBody": "Was easy to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "M_Ellery"
},
"reviewBody": "I dressed up this recipe quite a bit to suit our tastes and it is a good base. I sautéed onions, mushrooms, spinach and garlic before adding a vegetarian burger. I used diced tomatoes with garlic, basil and onion, which I drained and then chopped a bit more in my food processor. I had some homemade marinara but also used a 16 oz jar of sauce because I like a lot of sauce. Definitely use a full bag of ravioli and I just added the amount of cheese I like, which is probably double. I baked it at 375 for just over half and hour , uncovered like my lasagna, until it was golden a bubbly. The alterations make it a five!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "It was really good. But I used the whole bag of Ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla1225"
},
"reviewBody": "I made this last night for my family and everyone loved it! I made the recipe just as its written, minus the can of tomatoes because of picky eaters in my home. This was easy for a weekend night dinner. Would taste great with a mix of beef and Italian sausage and adding some veggies like other reviewers mentioned: mushrooms, green bell pepper or spinach! I will definitely be adding this to my dinner rotation. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Conner Brisson"
},
"reviewBody": "This has become a favorite of ours! Much easier to make than traditional lasagna! I highly recommend this &amp; I made this just as described. No thawing was necessary for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karla"
},
"reviewBody": "This was simple and quick, Thank you! (I added extra cheese, I will not do that going forward, it was too much). :) VERY YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Lynn"
},
"reviewBody": "I used 1-1/2 bags of ravioli and made my own sauce. Homemade sauce is so much better! I used a 13x9 pan and added an extra layer. I also added onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Lynn"
},
"reviewBody": "I used 1-1/2 bags of ravioli and made my own sauce. Homemade sauce is so much better! I used a 13x9 pan and added an extra layer. I also added onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty W Stone"
},
"reviewBody": "nice meal. I used spinach and cheese ravioli. Also added some ricotta. Tasty, but basic, much like lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lamom23"
},
"reviewBody": "A nice twist on lasanga! Easy to make and the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cattledog"
},
"reviewBody": "The night I made it, I was thinking 2, maybe 3 stars. After having the leftovers, way better. Something about setting up in fridge overnight made it taste better to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SpycGyrl"
},
"reviewBody": "We liked this. I made one of my layers sliced zucchini. I used Italian sausage and mushrooms as some reviewers suggested and that was a great idea. I also dotted the top with fresh mozzarella, in addition to the other cheeses. Instead of zucchini, I'm going to use spinach next time for getting some veges in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "I used mild Italian sausage and fresh ravioli with spinach and cheese. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Young"
},
"reviewBody": "Thank you for the framework! We adjusted it to our tastes and cupboard stock by using Italian sausage (cooked with diced onion and garlic), making a home-made sauce ( tomatoes, tomatoe sauce, bay leaf, oregano, garlic, Italian seasoning), we used cheese and spinach ravioli, left out the monterey jack and added ricotta. It turned out very nicely and we'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad B"
},
"reviewBody": "Great! I couldn't stop eating it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Simmons"
},
"reviewBody": "This was so simple to make, a hit with my whole family. I used ground beef and ground Italian sausage, more spaghetti sauce, more cheese, and more ravioli so I could put in a 9x13 dish. Only drawback is that it took 45 mins then another 5 mins in microwave to have it hot enough, probably because the ravioli was frozen. Otherwise, delicious, will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "railyn"
},
"reviewBody": "I made this with a few additions of my own for a family gathering. They all loved it. I roasted 1 eggplant, 2 zucchini, 6 garlic cloves, 1 onion, 1 bell pepper, and mushrooms and mixed them in the meat sauce. Delicious, Next time I'll try it without the meat. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Dalton"
},
"reviewBody": "it was really good.and so easy to make...it's a great week night supper.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Johnson"
},
"reviewBody": "I made this for 250 people. This is a great recipe,they loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mgj2"
},
"reviewBody": "I used the full 25 oz of ravioli and ground turkey. Yum."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/87624/beefy-baked-ravioli/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16767/world-cuisine/european/italian/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1794/world-cuisine/european/italian/main-dishes/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/87624/beefy-baked-ravioli/",
"name": "Beefy Baked Ravioli"
}
}
]
}
}
, "about": [
]
}
]