				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Beef Egg Rolls"
,"datePublished": "2000-04-26T15:48:44.000-04:00"
,"dateModified": "2023-02-15T13:27:06.000-05:00"
,"author": [
{"@type": "Person"
,"name": "HERCATE"
,"url": "https://www.allrecipes.com/cook/66208"
}
]
,"description": "These homemade beef egg rolls are filled with deliciously seasoned ground beef and cabbage, then deep-fried until hot, crispy, and golden brown."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UWIDOSJESwVtFeJql8YyUJ7bRxc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/195107-de91ace5a0964deea64d584757275a28.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Beef Egg Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "191"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "267 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "21 mg"
,"fiberContent": "2 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "577 mg"
,"sugarContent": "3 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pound lean ground beef",
"1 medium onion, thinly sliced",
"0.5 teaspoon dried minced garlic",
"1 teaspoon ground ginger",
"4 tablespoons soy sauce, divided",
"4 tablespoons dry sherry, divided",
"1 teaspoon salt, divided",
"1 teaspoon ground black pepper, divided",
"1 tablespoon vegetable oil",
"1 large head cabbage, finely shredded",
"0.25 cup water",
"1 teaspoon white sugar",
"2 quarts vegetable oil for deep frying",
"16 egg roll wrappers" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Add onion, garlic, ginger, and 1/2 of each of the following ingredients: soy sauce, sherry, salt, and pepper. Sauté just until onion is tender, 4 to 5 minutes. Transfer to a bowl."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 tablespoon oil in the same skillet over medium heat. Add cabbage, water, and sugar, plus remaining soy sauce, sherry, salt, and pepper. Cook and stir until cabbage is crisp-tender, about 5 minutes. Return beef mixture to the pan; cook and stir until well combined and heated through, 2 to 3 minutes. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "While the oil is heating, lay one egg roll wrapper out like a diamond. Place approximately 1/4 cup filling across the center going from left to right. Moisten the top two edges with water. Fold the bottom corner up and over the filling, fold both sides in toward the center, and roll upwards to seal. Repeat to make remaining egg rolls."
} ,{
"@type": "HowToStep"
,"text": "Fry a few egg rolls at a time in the preheated oil until golden brown, 2 to 3 minutes per batch. Drain on paper towels and serve hot."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "Not much taste. The liquid really made it soggy. I added carrots for color and water chestnuts for more crunch texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Taylor"
},
"reviewBody": "My husband and son gobbled them up. Served them with sweet Tai chili sauce. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie1010"
},
"reviewBody": "This is the bomb egg roll recipe. I’ve made these for a few years and it is a hit every time. Be generous with the cooking sherry. I usually use 3 bags of tricolor coleslaw mix or one of the big bags from SAMS or COSTCO. I also use about 2 lbs of hamburger meat. Have 2 packs of egg roll wrappers. It helps to have a helper so one can roll and one can fry. Don’t forget the sweet chili sauce either Franks or get from Asian markets. Folks will love your egg rolls!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marc Bradley"
},
"reviewBody": "Too much sherry and it was nothing like anything I've tasted. Unless you know the bow to I do not recommend this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeeQTmom"
},
"reviewBody": "Looking for simplicity tonight cooking amid the pandemic quarantine... I made this filling as an unstuffed egg roll and tossed in some sugar snap peas. Delicious! Missed the crunch and flavor of the wrappers, but didn’t have any anyway. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Fierst"
},
"reviewBody": "This might be the best egg roll I have ever had! My only change was that I used the air fryer instead of deep frying it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sweet Sue"
},
"reviewBody": "A bit time intensive, but delicious, and add some chopped carrots, mushroom too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Daudt"
},
"reviewBody": "It sounds great but I always add chinese 5 spice to egg rolls or star anise for added flavor...give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "These were really good. I didn't use a full head of cabbage and that may be why they turned out a bit salty. I also didn't have Sherry so I used a tablespoon of vanilla like another reviewer did. Next I will decrease the soy sauce in the cabbage. I think it will be great then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARA"
},
"reviewBody": "I made as is for Christmas Eve snacks.. I cannot begin to tell you what a rave these were with everyone. Such amazing flavors!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwen Bartmess"
},
"reviewBody": "very very good flavor!! rolling them takes a special touch but well worth the effort to learn!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deirdre"
},
"reviewBody": "Excellent recipe!! Used bean sprouts instead of cabbage and left the sherry out. Very tasty! Highly recommend :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saler Axel"
},
"reviewBody": "Amazing and delicious!! Made them with Quorn vegetarian ground beef and they were fabulous! Also used a package of shredded cabbage slaw with carrots and it made prep so much simpler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystal Falls"
},
"reviewBody": "Delicious and easy! My family loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CA Cook"
},
"reviewBody": "Excellent! Made with pork and added carrots as a 'deconstructed' bowl. Served with wonton chips, green onions and Asian dressing (Costco mix)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Furball40"
},
"reviewBody": "Will most definitely make again. I did switch out beef for pork sausage, and cabbage for cold slaw mix, but other than that followed the recipe as written. Makes a good flavorful egg roll, does not have a strong cabbage flavor as some of the egg rolls I have tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mertz1827"
},
"reviewBody": "This was really good. It did take a lot longer to prep everything too. Also don't use spring roll wrappers hold out for the egg roll wrappers. The work better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis Jelusich"
},
"reviewBody": "I've been making these Egg Rolls for years, but instead of deep frying them, I spray a foil lined cookie tray with cooking spray. I put the assembled egg rolls on the tray and spray the tops with the cooking spray too. I put them in a 425 degree pre-heated oven and cook them for 15 minutes, then I remove the tray, flip them over and cook for another 10 minutes. I remove them from the oven and allow them to cool 5-10 minutes. Delicious every time and no oil to dispose of. Everyone I've ever served them to loved them, as do I."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veronica Young James"
},
"reviewBody": "The recipe turned out very well. I cooked them like pot stickers instead of egg rolls to cut down on the oil. Next time I make them, I might add a little more of the spices. They were good, but I like them a little spicier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harvey Sprayberry"
},
"reviewBody": "I've made this recipe several times. The only change I made is I use bag of pre-chopped slaw cabbage. Also, instead of frying, I sprayed both sides of the rolls with cooking spray and bake for 20-25 minutes turning over once. I usually make a double batch (about 40) and freeze what we don't eat immediately. Doesn't matter they are all gone in about a week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LAKRULL"
},
"reviewBody": "You should only use spring roll wrappers as wonton wrappers are too thick, they can be found in the freezer section. keep them frozen until the day you plan to make the spring rolls as they dry out VERY fast. Also thoroughly drain the meat and veg, mixture. I make dozens of these and freeze. Then fry from frozen when you want them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOTLONDRA"
},
"reviewBody": "I made this as is and it was a family hit. Most definitely making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeffl69656"
},
"reviewBody": "A little peanut butter to hold it together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaunie"
},
"reviewBody": "This recipe was a,great base. I did make a few omissions (sherry, sugar). I used ground turkey instead of beef, added 1tsp. of sesame oil, shredded carrots and cabbage (coleslaw mix), and 1/2 teaspoon of ground ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djfriends"
},
"reviewBody": "Delicious! I used ground chicken, and omitted the sherry and garlic...only because I didn't have any. I also added minced carrots. The whole family loved it. Pretty impressive when my 2 year old liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Sorensen"
},
"reviewBody": "The cabbage didn't need to be cooked but it was still delicious!!! Minus the info only because I'm allergic!!! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori K Fraser"
},
"reviewBody": "Wow!! My first time ever making egg rolls! I followed the recipe to a T, and doubled the batch. I deep fried in peanut oil (tasted much better than using vegetable oil)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KatieKook"
},
"reviewBody": "I have made this recipe a number of times now. I absolutely love it!! it makes enough for us to make some and freeze some for later (it is just me and my husband). I never have ginger or sherry on hand, so I have always omitted it and I love it anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Robinson"
},
"reviewBody": "I tried this recipe, and boy was it delicious! It tastes just like an egg roll from a Chinese food restaurant, seriously. I usually don't like to make changes, but I didn't have any vinegar on hand, so I used half brown sugar and half white. I didn't have cabbage, so I used a bag of frozen Brussel sprouts, thawed and sliced up. I also added some bean sprouts, only because I live bean sprouts in my egg rolls, dried celery flakes is also a good additional seasoning for a authentic Chinese flavor. my family loved these egg rolls and so did I. I will definitely make these again with the sweet &amp; sour chicken ll from this site. Awesome! thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loddiecheftress"
},
"reviewBody": "I like the sherry addition, but used Jimmy Dean pork sausage (the one in the roll), added FRESH sprouts found in produce area, and water chestnuts. I also baked them for 25 minutes, 350 degree oven. Yummy! Used San J Thai Peanut sauce on the side for dipping, really tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "An G baby"
},
"reviewBody": "I cook these often. I use fresh garlic and ginger and that makes a HUGE difference! I used wine instead of sherry and nappa cabbage or Asian cole slaw. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kristine Nikole"
},
"reviewBody": "This recipe wasn't clear. It says to add spices and the sherry to the cooked beef, which I did. Nobody wanted a second helping.The flavors were extremely bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "These were great. I gave it the full 5 stars as written even though I made changes. Didn't have sherry so added extra soy sauce, didn't have sugar but did add two packets of splenda. The filling was good. I chose to bake them at 400 for approx. 20 minutes. I think these would be so much tastier fried as written. Baked was ok but you don't get the crunchy texture frying gives you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Roberts"
},
"reviewBody": "I've made these before but this time I used preshredded carrots and a bag of cabbage. The bag of cabbage had carrots and sprouts but I added more anyway. I also didn't really measure anything but the water and I used the water from the water chestnuts. Everything else was just what I thought it needed, but this receipe gave me a very good guideline. Also, I omited the sherry.Thanks for everyone else's suggestions too. Bon appitite miraclesdohpn?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelica"
},
"reviewBody": "This recipe is amazing.. I used half a head of cabbage but kept everything the same. They were a good size and I made 21 and still had some left over filling. Will be making these again. We ate this with my own version of chicken fried rice and bourbon chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jthamster"
},
"reviewBody": "Amazing!!! I didn't brown meat then cook cabbage separately, just combined all together. Also when wrapping, I sealed with a touch of water, so it wouldn't separate. Worked great. Made a whole bunch and froze them, when needed will pop in micro or oven. Thanks!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BALLCRUSHER"
},
"reviewBody": "My non Chinese food eating hubby can't get enough of these. I did simplify it and just used the pre-shredded package cole slow mix to save time. Huge hit with no leftovers. Will most definitely be making again. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annette"
},
"reviewBody": "Only thing I did different was beef broth for the sherry and used the bag coleslaw mix like someone said, will make these again. I did them in the actifry, took out the paddle added half a green spoon for oil cooked 6 min fold side down the. Flipped and cooked another six min these are great thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Carter"
},
"reviewBody": "good filling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicolender"
},
"reviewBody": "This is the first time I've made any type of eggroll. I loved how simple the recipe is. I did add a half of a red bell pepper, thinly sliced. I also baked these instead of frying them. They turned out pretty and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alemap"
},
"reviewBody": "I used everything but the sugar and it was great. My only problem was with the grease dripping from them. I will make this again but will try cooking them in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Treadway"
},
"reviewBody": "We made this almost exactly as written, the only changes being fresh garlic and ginger and they were pretty great. I feel like a little more practice wrapping will make a better product but the filling is delicious and things I always have in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "breanba "
},
"reviewBody": "I made mine a lil different cooked the meat seasoned it with garlic salt pepper and season salt not to much drained it added it shredded slaw and added bean sprouts for boxes of cream cheese wrapped them in the mellisas wraps and deep fried them and they turned out great my grandmother taught me well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparkt"
},
"reviewBody": "they were the best.....:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrysC"
},
"reviewBody": "I have made this recipe many many times. I have made this recipe as written, baked and I’ve also made just the filling with ground turkey serve over rice. I've never been disappointed. Om Nom Nom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Taylor"
},
"reviewBody": "Absolutely yummy. I used a small strip sirlion steak I had left, sliced it very thinly and then again. I used packaged cole slaw, as suggested. Bought wrappers which were huge, deep fried them in a deep fry pan, 4 inches or so. The beef was pre-cooked but not the cole slaw - I think that is key. I used white wine instead of sherry. This is going in my recipe box!!! And will be shared and used again. Thanks to HERCATE."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel127"
},
"reviewBody": "The best egg rolls my husband and I have ever had! I had used ham instead of beef, because that's what was leftover from the previous night's dinner. I also used a bag of Dole Asian Chopped Salad instead of a head of cabbage for ease and extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelica Madera"
},
"reviewBody": "there is no need to pre-cook the ingredients like the recipe calls. i mixed everything together and everything cooked perfect. will be making this again, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lexi42"
},
"reviewBody": "It was good. I didn't add sugar and sherry- I don't like to add sweets in the food. I used white wine instead. This recipe definitely tastes much better than the one with shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SassySoil"
},
"reviewBody": "Best egg rolls ever!!! Made them for dinner and they were a hit. Will definitely make again, and again... Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blondyblue7"
},
"reviewBody": "Added a bit more Celery and they came out perfect..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Curtain"
},
"reviewBody": "I substituted chicken and these came out great. Cooked chicken in 1tbs of olive oil, and used the same recipe for beef. No onions as my wife doesn't care for them. Premixed no sauce coleslaw with the carrots ...\r\nUsed red moscato (3tbs). It came out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chiweenie Mom"
},
"reviewBody": "These are really good and easy. I had never deep fried before, so I read up on how important the temperature of the oil is and watched a few YouTube videos on making egg rolls. I got myself a thermometer just to make these. The only things I did differently, which are not really all that different, was to add carrots, let the filling cool before I filled the wrappers and use egg whites as a \"sealant\" for the wrapper. Will do again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iva"
},
"reviewBody": "This has become a favorite in my family. The first time I made it I made it close as I could to \"as written\" and it was fabulous. Since then, I follow it \"loosely\" (tonight I didn't have sherry but I did have cooking red wine so I used that) and we enjoy it with whatever ingredients I have on hand. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa luvz2cook"
},
"reviewBody": "Made this recipe exactly as stated except omitted the sherry because I didn't have any on hand. Consequently, they just tasted like something was missing. If I make these again, I will definitely try it with the sherry. My family liked these, but I thought they were a little on the bland side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KiwiB1204"
},
"reviewBody": "I really did like this; however, one of my favorite eggroll \"styles\" is vietnamese where they use cellophane noodles instead of cabbage. I mixed in a little cabbage for variety... but I am sold on the cellophane type noodles. I also agree with Divine Health about browning the ground beef WITH the onion and garlic. I also like the idea of adding shredded carrot for some color and added texture..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "My hubby really liked these the only change I made was to use coleslaw (1 1/2 Lb) instead of shredded cabbage. The filling was still watery. Next time I'm going to use 1/2 the sherry. but over all a good recipe. (I did use the extra water from the filling to moisten the egg rolls to seal them.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sabray"
},
"reviewBody": "I decided to make these for dinner tonight and they came out great. Family members of mine used to make these alot when I was little and I decided to try them myself. I really enjoyed these, but I would probably eliminated the sherry next time(flavor is a bit strong) and add bean sprouts to my egg roll as a extra ingredient. Other than that, I appreciate you posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina Capella"
},
"reviewBody": "Absolutely delicious! I added a cup of fresh button mushrooms chopped into the cabbage mixture. I also replaced the black pepper with a tsp of crushed red pepper flakes. These were a hit with my entire family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "My hubs is not much of a Chinese food guy. I knew he'd at least try this since it had beef. He loved them!!!! My 10 year old son who will not eat ANYTHING gobbled them up. I begged him to just take one bite. Funny, that's all it took! The recipe does make a LOT! I froze half for another time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steph24"
},
"reviewBody": "This recipe was pretty good! I dont think id make it again with ground beef. And if i did i would add some sort of seasoning! Though there was a flavor, it wasnt all that fantastic, however i will make it again with changes to the recipe! Maybe a little more cabbage and less meat (probably pork)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Higgins"
},
"reviewBody": "I didn't have enough soy sauce, thought I did. But had a great flavor just the same, and was able to freeze some for later lunches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gayla"
},
"reviewBody": "Didn't care for this with beef, made it with pork the second time and it was wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilkaisha"
},
"reviewBody": "We loved these! I used white cooking wine rather than sherry and ditched the salt in the ground beef. Also, I sauteed my cabbage in sesame oil to up the Asian flavors and shredded up a carrot to go in the cabbage. (I used my cheese grater to shred up the veggies quickly!) Yes, they have a lot of beef, but my cabbage-phobic boyfriend loved every bite! Super quick and easy! I made them in the oven, but next time I'll deep fry them. As good as these were baked, I think they'll be amazing in the fryer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "Very good! I froze them but when they were reheated in the microwave- they turned soft and mushy. I wouldnt expect for them to be crispy but unless they are going to be eaten at the moment of making them- I suggest freezing them and either refrying them or putting them in the oven. Other than that, they are delicious and will be made again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sdbooker"
},
"reviewBody": "I made them exactly as stated. Sorry they were not all that great. I guess the 5 stars are coming from people who added or took away from this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emo747"
},
"reviewBody": "Yummmmm These are great! Even better using minced fresh garlic. Used peanut oil instead of the vegetable oil. Fantastic recipe, Thankyou!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BethanyS"
},
"reviewBody": "Delicious! I made this for my family and they've requested them twice now, a new hit! I added some black beans and fiesta corn and it was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tjsmith12107"
},
"reviewBody": "was a great hit with my entire family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CBENTZ"
},
"reviewBody": "This is my families favorite! But instead of using beef we use ground pork. Beef is great too, but the pork is our favorite. I also use a package of cole slaw mix. Saves time, and makes it super easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamapeach"
},
"reviewBody": "I tried it with beef and a little cheddar...my family loved it. I also tried it with chicken. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian Kuhlmann"
},
"reviewBody": "The filling was excellent! I've made these egg rolls a few times. We love to dip them in sweet chili sauce. The first time I made them they were heavy &amp; greasy. That depends on your wrapper texture, oil &amp; your frying temperature. I prefer lumpia wrappers from the Asian market."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chichima"
},
"reviewBody": "Changed this up a lot because my son is vegetarian. Used vegetarian substitute beef (take your choice). Added shredded carrots and scallions and some hoison sauce, mirin and rice vinegar to taste. Everything was raw when I rolled up it and then let it rest covered in the fridge for a day and then deep fried it in canola oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Twede"
},
"reviewBody": "Fantastic. Will definitely make again. Quick tip, a whole head of cabbage is way too much. I used a little less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Stevens"
},
"reviewBody": "These were very tasty! I modified with vegetarian burger crumbles and then baked instead of fried and they were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kjjones1974"
},
"reviewBody": "I love this recipe and I have made it multiple times. I however do not use ground beef. I have used shrimp, beef(thin sliced), and chicken. No matter what meat I choose it always turn out perfect and delicious...one of my families favorite meals. Also FYI if you have left over wrappers and left over taco stuff in the fridge, try wrapping the taco meat, salsa and cheese in the wrappers cook as you would the egg rolls, then top with shredded lettuce, tomatoes, sour cream. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. OConnor"
},
"reviewBody": "Very good. I substituted a bag of broccolli slaw, ran it thru the food processor for a quick second to get the consistancy right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "molitor"
},
"reviewBody": "WOW! A really great simple recipe that tasted fantastic! Even impressed the boyfriend with this one. Somethings I had to change: (1) I had no Sherry, so I did some online research and read that you can use a little vanilla extract as a substitute. Did that, thought it tasted great. (2) I used 1 bag of coleslaw mix thanks to another reviewers tip. (3) I rolled the eggrolls and then I brushed a thin coating of veg oil over the entire roll since I don't have canola. (4) I oven baked mine at 400F for about 20 minutes, rotating halfway through. Follow others advice and it came out fantastic. I plan on making a double recipe and then freezing them for my on the go lunches. Very please! PS - didn't have any good dipping sauces, so dipped them in honey. WOW!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spjpcp121"
},
"reviewBody": "These were as good as everyone has said the only thing I did different was bought the packaged coleslaw mix and added shredded carrots. I also substituted the sherry with beef broth they are better than restuarant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charlotte"
},
"reviewBody": "OMG these are awesome....i made this recipe last week for the first time ever making eggrolls and they were to die for, my best friend loved them and is coming over tomorrow to make them with me again, we are hooked and it makes a great left over! making these with a version of southwestern eggrolls like chili's restaurants! yum! so easy and sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cRiStY"
},
"reviewBody": "These were so easy to make and they are delicious. I used 1/2 more groud beef because my husband is a BIG meat eater!!!! Taste fantastic with sweet and sour sauce too!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "I've made this twice now but with chicken instead of beef, personal preference. I just diced up the chicken into a fine dice and sauted it as the reciped states. The first time I used fresh ginger, but it wasn't available the second time. It's good either way but I do prefer the fresh. Omitted the sherry. I also used a bag of shredded cabbage and a half of a bag of shredded carrots. The egg roll wrappers I purchased said to seal them, make a flour/water paste - equal parts. Use the paste on the seam. I didn't have any issues with them falling a part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hazel Watson"
},
"reviewBody": "This filling was great. However, I used some spring rolls with instructions written entirely in Japanese! I'm going to use egg rolls next time, and have already purchased them - in English."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryi Mauney"
},
"reviewBody": "Made this last night, along with Hunan Beef and Vegetable Fried Rice. Tasted just like the restaurants. Actually better since I was absolutely sure what was in them! (am a little wary of Chinese food just from lack of experience in eating it) I did have a issue with the flap on the wrappers staying closed when frying so next time I will use a little egg wash to tack them down. I also used shredded cabbage in a bag. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEAHmckay"
},
"reviewBody": "These were great!!! My husband always complains when I make egg rolls because they're never as good as my friends' when she makes them. This time he said, \"These are the best egg rolls I've ever had in my life.\" Thank you, HERCATE, for helping me surprise my husband. Hahaha!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meya"
},
"reviewBody": "I made this for my nieces and nephews and I was amazed how fast they ate them! I did not use the ginger but I don't think they cared. I was quick and awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lnewlon"
},
"reviewBody": "This is an easy, simple, delicious recipe. I omitted the ginger(didn't have any) and cut down the cabbage to 2/3 of a small head and added 1/2 cup of shredded carrots. I had a little of the filling leftover so I used it in some fried rice. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meg1321"
},
"reviewBody": "these are so good! made them for a group of friends tonight as a side dish to stir fry...never made egg rolls before so i was viewing it as a total experiment! only made two per person and i could have made a lot more...they loved them! some said they were the best egg rolls they have ever had. i cut down on the cabbage and added bean sprouts but otherwise pretty much followed the recipe. i will definitely be making these again, many times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lolis Hernandez"
},
"reviewBody": "Very tasty recipe but I cut out the water to cook the cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Baby Potsticker"
},
"reviewBody": "I thought these came out all right. That may have been my fault though. I baked these instead of fried to cut the fat. The texture of the wrapper came out on the tougher side which killed the overall quality of the egg rolls. I also omitted the sherry as I didn't see the need (and because I didn't have any). I served these as a late night snack for a few of my friends. One of them made a slightly sweet soy dipping sauce and I made a creamy wasabi dipping sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'mama08"
},
"reviewBody": "This was wonderful, thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoCaliMommy"
},
"reviewBody": "Turned out Great other than my crummy egg roll wrapping skills which made my 5yr old call them burritos lol, i also used a deep fryer instead of frying in a pan. Can't wait to make them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DEBI EMILEE"
},
"reviewBody": "These are the first Egg Rolls I have made. They were a hit with the family, but I'm going to keep experimenting to perfect them. I added Bean Sprouts and grated carrot, but next time will add mushrooms and green onions as well. Make sure the filling is well drained or the rolling gets sloppy. They cook fast, so it's best to have them all done (put them on a cooky sheet) to await their turn to cook. Also trying a few different sauces for dipping. This is a good recipe with easy ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pngwnchick"
},
"reviewBody": "These were really very good! The whole family really liked them. I made them exactly like the recipe with only one change, I used celery salt, instead of the salt the recipe called for. The rolling up of the egg rolls was a bit tricky at first, but I finally got the hang of it. These were really good, will make again with the restaurant style fried rice from this site. Nice change from the weekly dinner rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shan"
},
"reviewBody": "I have been making a similar recipe to this for years. I got it from a friend's grandmother who is Filipino and they are delicious! Her recipe also has carrots and celery as well. These take a little while to make but they are sooooooo delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Delicious!!! Better than most restaurants around where I live. I didn't change a thing except being from (South Louisiana) I added cajun seasoning. Yummy!!! Definitely will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "Im giving this 3 stars only because this is my first time making egg roles therefor i'm taking some of the blame. First of all i don't see why the cooking time is 20 minutes. they cook in 1-2 minutes in the oil. leaving them in for 20 minutes would be like asking for a heart attack :) i didnt have any sherry but i don't think that's an excuse for the lack of flavor. I was trying to show my dad off by making these but i think i will stick to my father's recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet H"
},
"reviewBody": "This was a good recipe. Mine fell apart while cooking, I’m sure due to my error and not the recipe. Great taste but a little too time consuming for me."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18252/beef-egg-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
"name": "Wraps and Rolls"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16366/appetizers-and-snacks/wraps-and-rolls/egg-rolls/",
"name": "Egg Roll Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18252/beef-egg-rolls/",
"name": "Beef Egg Rolls"
}
}
]
}
}
, "about": [
]
}
]