				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Beef and Rice Stuffed Bell Peppers"
,"datePublished": "2014-01-23T16:54:03.000-05:00"
,"dateModified": "2022-06-01T06:09:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "These stuffed bell peppers with rice are Chef John&#39;s recipe for a savory filling of seasoned ground meat, cheese, and parsley baked in tomato sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z5vNVFQMqGTw1neeIuh1q4u7H2o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Beef-and-Rice-Stuffed-Peppers-26bec761fcf1411db77468a58c1d4351.jpg",
"height": 478,
"width": 400
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2777979362001",
"description": "See the technique that makes stuffed bell peppers even more delicious.",
"duration": "PT4M4S",
"name": "Beef and Rice Stuffed Bell Peppers",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2020/10/12/Beef-and-Rice-Stuffed-Peppers.jpg",
"uploadDate": "2021-03-05T00:42:23.705-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Beef and Rice Stuffed Bell Peppers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "227"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "376 kcal"
,"carbohydrateContent": "26 g"
,"cholesterolContent": "82 mg"
,"fiberContent": "4 g"
,"proteinContent": "30 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "1724 mg"
,"sugarContent": "9 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"6 bell peppers",
"3 cups chunky tomato sauce, divided",
"0.5 onion, very thinly sliced",
"1 cup beef broth",
"0.25 teaspoon red pepper flakes",
"1.5 pounds lean ground beef",
"1.5 cups cooked rice",
"0.5 cup freshly shredded Parmigiano-Reggiano cheese",
"0.25 cup chopped fresh flat-leaf parsley",
"4 cloves garlic, minced",
"2 teaspoons salt",
"0.5 teaspoon freshly ground black pepper",
"1 tablespoon chopped fresh flat-leaf parsley, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Slice peppers 1/2-inch from the top; cut out stems and set aside tops. Cut core from the inside of peppers and strip away any seeds. Cut off a thin slice from the bottoms so peppers can stand upright. Poke about 4 tiny holes in the bottoms to let juices drain."
} ,{
"@type": "HowToStep"
,"text": "Pour 2 1/2 cups tomato sauce into a 9x13-inch baking dish. Add onion, beef broth, and red pepper flakes; spread out mixture evenly over the bottom. Set bell peppers upright in the dish."
} ,{
"@type": "HowToStep"
,"text": "Combine ground beef, cooked rice, Parmigiano-Reggiano cheese, 2 tablespoons tomato sauce, 1/4 cup parsley, garlic, salt, and black pepper in a large mixing bowl."
} ,{
"@type": "HowToStep"
,"text": "Lightly stuff peppers with meat mixture. Spread 1 tablespoon tomato sauce on top of each portion of stuffing; place reserved tops onto peppers. Lay a piece of parchment paper loosely on top of peppers and cover the dish tightly with foil. Place the dish on top of a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until peppers have softened slightly, about 1 hour. Remove foil and parchment paper. Continue baking until meat filling is cooked through and peppers are tender, 20 to 30 more minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z5vNVFQMqGTw1neeIuh1q4u7H2o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Beef-and-Rice-Stuffed-Peppers-26bec761fcf1411db77468a58c1d4351.jpg"
}
]
,"text": "Sprinkle each pepper with 1/2 teaspoon parsley and drizzle with a spoonful of pan juices."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were delicious and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "g4hx4m8mtq"
},
"reviewBody": "I expected the ground beef mixture to be more like meatloaf. It wasn’t. I brown the ground beef &amp; add all other ingredients except cheese until mixed &amp; hot. Flavor is all through the meat. I used half the beef broth (didn’t need it as rice is cooked) &amp; added 1t kitchen bouquet, decreased garlic to 2 crushed cloves. Everything else the same. Sometimes I’m in a hurry. Baking time is king because of the peppers. I steam them until barely getting tender, drain well, put one pepper per Jumbo Muffin Pan slot &amp; fill. Baking time is cut in half. I cover to keep cheese on top from over- browning. Or adding cheese closer to the end of baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caquilter"
},
"reviewBody": "Thank you Chef John! Exactly how my Mom made and I loved to eat the tops which she leaved intact on top and became so sweet and delish! Great memory. I will be making very soon with green peppers as she did"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colette Robinson"
},
"reviewBody": "Made exact recipe with no changes and it was the best I have ever had for stuffed peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I combined this recipe with another one and it was perfect. The braising liquid at the bottom is what I used from this recipe and it was perfect. I used seasoning salt instead of regular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The peppers were absolutely delicious! I made two adjustments to expedite the baking time &amp; the other was just a personal choice of peppers. 1. Parboiled the peppers, JUST UNTIL they started turning a lighter shade! 2. My husband is not a big fan of bell peppers, so I use Cubanelle Peppers, just cut in half and fill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myrtle Starks-Gale Brooks"
},
"reviewBody": "I added Italian sausage, minced garlic, beef base and substituted tomato paste for tomato sauce in my mix. I also added onion soup mix and cut the salt intake to 1/2 tsp. And used spaghetti sauce for my pan base. It was so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragonmarietta1"
},
"reviewBody": "I've ALWAYS made these with uncooked meat and cooked Minute Rice, done in salted water with garlic paste and \"Italian herbs\" .. my/our preference is 1/2 lean beef, 1/2 turkey .. but you cannot pack the meat or they're a \"lump\" and dry .. the eggs and broth in the mix, loosely mixed and loosely packed, let the flavors mix, they're not just tender they're juicy and flavorful .. We top them (before serving) with Chihuahua cheese and some cracked red pepper \n\nI bake them covered snugly, on 325oF for 2 hours .. then uncovered, basted with pan sauce, for another 20 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Nguyen"
},
"reviewBody": "Delicious! I used ground turkey and veggie bouillon instead of beef broth. The pan sauce with crushed red peppers is spicy, so I wiped it off the outside of the bell pepper before giving it to my 1-year-old. She loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjkbunny30"
},
"reviewBody": "Best stuffed pepper recipe. Made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJ Harlow"
},
"reviewBody": "I usually use a Cook's Illustrated recipe for stuffed peppers but I'm in the process of packing up for a move and my cookbooks are boxed already. This is very close to that recipe. I followed the measurements of this recipe and the techniques of my tried and true by sautéing the onions and garlic, browning the ground beef, and mixing as per this recipe. I stuffed my peppers as much as I could, topped off with tomato sauce, and baking for half an hour covered. Topped with more parmesan and a bit of mozzarella and returned to the oven for another ten minutes. I only used the beef broth in the bottom of the baking dish. Anyway, this is a great recipe for this dish and can be altered here and there to suit the tastes of your family. Great job, Chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Gandy"
},
"reviewBody": "This is a recipe to hang onto!\nSo I took the advice of another commenter and I boiled the bell peppers while I browned the meat. I let my oven preheat at 375 and cooked one pound of burger and a half pound of turkey sausage with olive oil, garlic, a can of mushrooms ,and part of a couple green onion. While I let the grease drain off to the same pot I added a can of diced tomatoes, a can of tomato sauce, garlic from a jar, and the rest of the green onions. I seasoned with dried tyme, parsley, chili flakes, crushed bay leaves, and pepper. I added the meat back to the sauce along with my jasmine rice (rice cooker is a life saver). As you can see I used a Dutch oven (and posted three times because I didn't know what I was doing) there was no need for me to cut the bottoms because they all fit in the bottom nicely and could've fit a seventh. I used cooking spray on the bottom then assembled, mozzarella, filling, mozzarella, top of peppers. There was filling left over I just piled it into the middle and covered it with cheese too. After I let the whole thing cook for 10 minutes I broiled the top so the cheese got brown. So much fun to make and very very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Candelario"
},
"reviewBody": "Delicious and hearty! Had to cut them in half, they were huge and very filling. Really beautiful on the plate, and the sauce at the bottom of the pan was fantastic; Probably my favorite part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Likes2Eat"
},
"reviewBody": "Really tasty! Just what I was looking for. I used 3 red peppers and 3 green peppers just to compare--like both of them. Really didn't know what \"chunky tomato sauce\" was. So I combined canned tomato sauce and canned crushed peeled tomatoes in puree sauce about half and half. I also baked the peppers first for 15 minutes to get them soft. I also did not use the baking sheet. I kept the specified cooking times. Next time, I think I'll up the amount of Parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K and J"
},
"reviewBody": "Added hot Italian sausage and a lot more red pepper flakes. More salt, pepper and Italian spice. Put some sauce inside peppers. Topped with mozzarella. Precooked all but peppers. Cooked at 375’ for 35-45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mee Maw"
},
"reviewBody": "Made these for the guys who were doing some work on the house for me... they certainly earned a nice home cooked meal, and these didn't disappoint. EVERYONE loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "China"
},
"reviewBody": "Delicious. Finally a recipe that doesn't cook the ground beef before stuffing the peppers. Thank you very much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Great stuffed peppers I changed to red peppers because I do not like green"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "It was just ok. I will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina West"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marya"
},
"reviewBody": "Very good classic stuffed peppers. Next time, though, I will have to remember to start making them earlier as the cooking time is long (but necessary)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "palmharbormichelle"
},
"reviewBody": "I have made this so many times over the years, for guests and just for us. I always use some form of marinara, either homemade or if I am lazy, jarred. Yesterday I used a jar of Mid's Marinara. I always slice a whole sweet onion and use red and yellow peppers. I had bought a new chunk of parm but ended up using the remnants of some leftover parm, cheddar, and a little cojack from the fridge that we had shredded over the past week for other meals and it was great. I can't imagine ever going back to the old way of making stuffed peppers. I love Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bruce"
},
"reviewBody": "Turned out great, but There was too much liquid in the recipe. When I pulled the dish out of the oven, the liquid was up to the brim. Next time, I will remove 1/2c of tomatoes and 1/2 cup of broth. Also, I would cut down the salt to 1t. Too salty for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizmonster3000"
},
"reviewBody": "Delicious recipe. I only had 1lb of ground beef instead of the 1.5 that the recipe called for, but the ratio was still good and was more than enough to fill all 6 of the large bell peppers. This is for sure a favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyra"
},
"reviewBody": "I used"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tjhBoB"
},
"reviewBody": "I thought the item to be delicious. I also thought them to be of German origin. I went Pheasant hunting in Western Kansas and spent evenings and ate our meals in a friends parents farmhouse. WAS led to believe they are of GERMAN origin? The friend is Jerry Younger from the Far-Mar-Co Company. The Western Kansas community is Hays Kansas on I-70!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Fischer"
},
"reviewBody": "Delicious! I made this tonight, and my husband and I loved it! It will definitely be a staple in our kitchen. The only change I made was to the beef mixture. I added a garlic jalapeño seasoning. (My husband put cayenne pepper after cooking, but he does that to everything.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Adrienne"
},
"reviewBody": "Very good recipe. I recommend paying attention to the tomato sauce. I used \"any brand\" and it would have been better with herbs and spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carri"
},
"reviewBody": "The hubby and I loved it. I used ground pork and ground turkey and just followed the recipe. \nMaking it tonight for the second time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abby Pfeiffer"
},
"reviewBody": "Made this dish for my family last night and they loved it! I prepared it exactly as it was outlined. I did have too much filling for the bell peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Appaloosa"
},
"reviewBody": "Loved the recipe. Peppers turned out well. I think I will add chili con carne spices next time to make it texmex."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fhk"
},
"reviewBody": "This recipe was very good. I used orange peppers instead of green as that’s what we prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cassy Zona"
},
"reviewBody": "Cook time at this temperature was wayyyy too long. I had 25 mins left to go and went to check them and they were burnt to a crisp. Fail"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly G"
},
"reviewBody": "Delicious. I did add a little sausage based spaghetti sauce to the meat &amp; rice filling. Took longer than recipe stated for mine to cook but I had 8 peppers instead of 6. Thank you for this wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Stormon"
},
"reviewBody": "Just used 4 green peppers and cooked the little filling left over in a small glass bowl right in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Williams"
},
"reviewBody": "I only made it for 2 and it still was amazing!!! Just enough spice to make it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Pietrzyk Courtenay"
},
"reviewBody": "Instead of cooking the meat in the pepper, I browned the meat in skillet with chopped onions and tiny bit of chopped bell pepper. I put the empty peppers, sitting in the sauce, in the oven and let them start cooking/softening while I cooked the rice and browned the meat. So the peppers cooked for about 30 min when I pulled them out to stuff them. Then put them back in for about another 45. Came out great. I used grated parm in the stuffing and some shredded cheddar on the top (it was all I had) but was very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kristy Moran Wyler Palmer"
},
"reviewBody": "I make it a different way and less time consuming. I take out the core and all the seeds...then I boil the bell peppers 10 min ...while boiling I brown the ground beef onions with tomatoes sauce of your liking and as well seasonings of your liking....I like the knorrs rice 7 minutes then I mix in with the ground beef...I then set bell peppers on a cookie sheet I put shredded Mexican cheese on bottom then fill with stuffing and sprinkle and repeat with Mexican cheese on top put in oven for 350 degrees or fill cheese is melted....normally only takes about about 5 to 7 minutes and voila done!!! My fiance...picky kids and friends hard workers love this recipe.never failed...please enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Walsh"
},
"reviewBody": "I've made stuffed peppers 3 different ways. Usually, I Brown the ground beef. This recipe called for stuffing the raw beef , which in turned browned due to the 1 hour and 20 minutes in oven. It was good. I still like my peppers soft. Next time I will boil peppers to soften. The sauce was good with plenty of onions. Very filling. Overall, another hit with my girls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Olsen"
},
"reviewBody": "My daughter and friend loved it!\nAbsolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linjami"
},
"reviewBody": "For some reason it made way too much filling. I ended up making patties for my babies with the remaining filling. There wasn't enough sauce either. It was good though and I think next time I'll use half the filling and more tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItsMe"
},
"reviewBody": "It was very good. I adjusted a few things but it was a great guide"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peggy"
},
"reviewBody": "I've made this keeping to the exact ingredients and it's a winner. However, tonight I made it again but noticed I didn't have enough ground beef so, I took some cooked pork chorizo I had in the freezer to make up for the ground beef. \nIt was five stars before...but with the chorizo it's six stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jazzy Rodgers"
},
"reviewBody": "First time making stuffed bell peppers I wish I can upload my picture it was pretty good I think if I would have let the bell peppers cook a little bit more longer it wouldn't be so hard but yet soft and some places the ingredient was definitely easy to make with the hamburger seasoning and cook rice and onions I'll definitely try it a different way but overall it was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray’s Rose"
},
"reviewBody": "Definitely will make again! I used the Trader Joe’s jasmine rice, which really made it delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LibertyLake"
},
"reviewBody": "This stuffed bell pepper recipe was simple to prepare and had a savory flavor. This is a meal that I will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIMI"
},
"reviewBody": "I absolutely LOVE this recipe. I've it several times, even though I find the pepper prep somewhat time-consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Hall"
},
"reviewBody": "It was great I added a few other ingredients and this is a great dish. Family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale"
},
"reviewBody": "I would definitely make this again and again. Moist and flavorful. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "It was very good.I will make again.I did did put some sauce and left over meat in the bottom of the pan.It was a good decision"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TEleftheriou"
},
"reviewBody": "Really easy, and really yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lagear"
},
"reviewBody": "Each year I end up with an excess of bell peppers from my garden at the end of the summer &amp; decided to try this recipe. Omg, so delicious. I did a few things differently. I cooked the onions with the ground beef before adding remaining ingredients &amp; stuffing the peppers, and I used about 2 cups of roughly chopped fresh tomatoes mixed with a 15oz can of tomato sauce. And, I mixed the broth with the tomatoes and then poured it over the peppers before baking them, rather then pouring them individually into the bottom of baking dishes. This is now my “go to” stuffed pepper recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "My husband wants me to kick up the heat a tiny bit on the next batch, but I loved it. Made a little extra meat mixture and turned them into absolutely delicious meatballs, by the way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Zurlo Henderson"
},
"reviewBody": "This recipe reminded me so much of my momma’s stuffed bell peppers when I was growing up! I love how flavorful Chef John made it with the added red flakes! Perfect! I did notice that the video says 1/2 cup of beef broth but the recipe says 1 cup. I think 1/2 cup should be used in order to have a little thicker sauce! Honestly, this is a must try recipe because it is spot on! Love this and thanks Chef John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neela Baker"
},
"reviewBody": "I did not use a pan underneath and I used a glass baking dish so it only took 1 hour with the foil and then it was done. I also used pepper jack cheese instead and I thought it added a nice spicy flavor to the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Smith"
},
"reviewBody": "Fast and easy to make! Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy G"
},
"reviewBody": "I longed for stuffed green peppers like my mom made. And I sure chose a recipe. The peppers were better than my Mom's! I am eager to eat them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisaahurd"
},
"reviewBody": "I added chorizo to the beef and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kati Bradshaw"
},
"reviewBody": "This was so simple to make and turned out so good!!!! I left out the onion on accident but it still was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hardwood Floors Rich"
},
"reviewBody": "I used ground turkey meat Also I used fire roasted tomato’s for the pan as we like a little spice in our life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Johnson Cooper"
},
"reviewBody": "I always loved my mom's stuffed peppers growing up which was basically meatloaf, stuffed in raw green peppers. When I got older and looked up the recipe, I saw it had rice, the meat was sauteed and peppers blanched first. I just went back to my Mom's way. But this recipe is my Mom's on steroids. I added 1 egg and a little bread crumbs to the meat mixture and used Italian diced tomatoes along with the tomato sauce. It was delicious! The sauce is so good; helps keep everything moist. He's right, the cookie sheet makes it take longer but found it cooked evenly. I like the suggested way to cut the peppers and using the lid. You can get alot more meat in there. I made 4 and heaped them high like an ice cream cone. This will now be my go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bbarrick"
},
"reviewBody": "I mixed 1 lb ground sirloin and 1/2 lb pork sausage, plus all the other ingredients and made 3 stuffed peppers. They were delicious. Yum. I'll do this again with out a doubt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Star La'Shaun"
},
"reviewBody": "I seasoned the meat to taste but overall great recipe! Also, I used different colored peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Anchales Sandez"
},
"reviewBody": "Great recipe! Stuffed Bell Peppers are my dad’s favorite. I make mine similar, but I add a can of chopped tomatoes, a can of tomato sauce, and chopped zucchini to the mixture! I skip the cheese, and add a dash of tomato paste on top before I bake. I’m telling you, it is amazing, and there’s never leftovers in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jack clark"
},
"reviewBody": "I made this as written and it was flavorful. My wife loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Crawford"
},
"reviewBody": "Used 1/2 lb italian sausage and 1 lb ground beef. The flavor was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Very easy, great taste. I followed the recipe and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristieb"
},
"reviewBody": "My family loved it! I made extra rice &amp; served them over rice w some of the sauce they were cooked in over the top w Parmesan cheese. I used grated Parmesan bc that’s what I had. Very true to directions &amp; can improvise as needed! I have enough stuffing for 3 large meatballs to place in pan for my son."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Hamilton"
},
"reviewBody": "I loved making this recipe. I replaced the rice with riced cauliflower to make this recipe bariatric friendly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hillbilly"
},
"reviewBody": "I sprinkled mozzarella cheese over each one , yummy!!!!!!!!! These are perfect stuffed bell peppers!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eleni Helen Goutsos"
},
"reviewBody": "My mom made stuffed peppers, tomatoes, onions and zucchini. She's getting to the point where she forgets what she uses for the ingredients. Man, this is BETTER than my mom's recipe! I used 1 lb ground beef and 1 lb ground sausage. I had Romano cheese on hand, too. Typically, I would just eat the stuffing and not eat the outer veggie unless it was the zucchini. This time, I used red and yellow peppers since they're more palatable to me. Thank you for the fantastic recipe. This is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Nolan"
},
"reviewBody": "Chef John, you have yet to let me down! \nYour recipes are on point and the instructions are so easy to follow.\nPerfect recipe exactly as is!! I doubled the recipe and froze half of the stuffed peppers with the sauce in a separate freezer bag. My family LOVED it so much the first night, they decided to pull the frozen ones out to thaw for the next day :) The frozen tasted just as good as the freshly made...will definitely make another double batch soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juraspark"
},
"reviewBody": "This recipe comes out great everytime.\nI think the beef broth mixed with the tomato sauce in the pan is the key!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jenell Echols"
},
"reviewBody": "I'm in the process of making this now but in the video you say to use 1/2 a cup of broth but the recipe says 1 cup. You said put 2 1/2 cups of tomato sauce in the pan but then we need more to put on top of the peppers and the same with the parsley. I'm just a little confused but hopefully it turns out good..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Very good! I boiled the rice in beef broth and that added a nice flavor. Next time I will try some garlic in the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Durrele McHaskell"
},
"reviewBody": "I used ground bison and my favorite pasta sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colin"
},
"reviewBody": "I used ground tofu and added mushrooms! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Savanna Annette Doyle Stocks"
},
"reviewBody": "I used tomato paste And diced tomatoes instead of tomatoe sauce. I used ground turkey because it wass cheaper and Spanish rice instead of white rice! It was to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Dudley Dillon"
},
"reviewBody": "Yes, it was delicious! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L413c4"
},
"reviewBody": "Absolutely delicious recipe. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Allen"
},
"reviewBody": "I've made this with yellow peppers also and with turkey instead of beef, tastes absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kacey2767"
},
"reviewBody": "This was pretty good. It was better with a bit of Worcestershire Sauce. I will make this again! It was easy to make but took more time than I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "Enjoyed it immensely......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "helen"
},
"reviewBody": "They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "Yes I cooked with pork not beef"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Monte-Bagood"
},
"reviewBody": "My husband LOVES IT, I did make a few changes , though at the moment nothing is coming to my mind. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foodie"
},
"reviewBody": "Super easy and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SallyB5"
},
"reviewBody": "This dish turned out delicious! A big winner w the family. Since we are lactose intolerant I took a chance and left out the cheese and it was still great!!! I did cook it a little longer at 1.5 hours and I’m glad I did. The peppers were perfect ... slightly firm... 1 hour would have left them a bit undercooked. The meat was cooked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronnie"
},
"reviewBody": "It was delicious. The only change I made was that I stuffed hatch peppers instead of bell peppers. They’re in season for such a short time that this was a great way of enjoying this excellent delicacy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Rose"
},
"reviewBody": "I used different coloured peppers and Uncle Ben's 5 grain rice. very flavourful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MGM"
},
"reviewBody": "My husband and I absoulutely loved this. I used 1 lb. of ground beef and 1 lb. of ground pork sausage. This is certainly a keeper and will definitely make it when we have company over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arleen"
},
"reviewBody": "Just made it for dinner tonight. DELICIOUS ??!!!!! Only thing that I did different was that U used tomato sauce with cheese already in it. It was dollop good ??. May have it again tomorrow. My husband really liked it too and said we will have it alot. Thank for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jani Harris"
},
"reviewBody": "Chef John’s verbal measurements on sauce and broth are different than the printed recipe measurements. Which one is correct?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "libragirl808"
},
"reviewBody": "I love this simple recipe, I've been making them for about 4 years, it's a hit! I made them today using bison meat, my new obsession lol. Your family will love this recipe, I haven't strayed from the the technique or the basic ingredients too much and they always come out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cowboypony13"
},
"reviewBody": "I was relay good but I think I like my mama's recipe better but I also think I put to much of other seasonings in it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rin"
},
"reviewBody": "The only changes I made is the rice was not leftovers. In the family it's typical to have leftover rice, so I decided to give it a try. It came out awesome and I will definitely give it another try with our leftover fried rice instead. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StickySue"
},
"reviewBody": "This was a good recipe but I didn't have the right stuff....I had Minute Brown Rice that I didn't cook...I didn't brown the ground chuck, I cut the onions very small and didn't soften them....cooked the dish hour covered and a half hour uncovered....I also added a can of Italian tomatoes 1/2 in making meat and rice stuffing and half with the tomato sauce, I only had a 8 ounce can.it turned out great and was moist and rice was done very flavorful...Thanks, Happy Cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Pease"
},
"reviewBody": "I added an egg and some pasta sauce to the pepper mix. Didn't use Parmesan cheese, I used a cheddar mix. Also topped the peppers with cheese for the last half hour. Otherwise this is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Headleyfrazer"
},
"reviewBody": "Great recipe I just added fresh roasted corn."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/236359/beef-and-rice-stuffed-bell-peppers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13289/main-dish/stuffed-main-dishes/stuffed-bell-peppers/",
"name": "Stuffed Bell Pepper Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/236359/beef-and-rice-stuffed-bell-peppers/",
"name": "Beef and Rice Stuffed Bell Peppers"
}
}
]
}
}
, "about": [
]
}
]