				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Berry Rhubarb Pie"
,"datePublished": "2000-02-02T13:14:16.000-05:00"
,"dateModified": "2022-08-22T14:50:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Susan Gills"
}
]
,"description": "To make this scrumptious pie, rhubarb, blackberries and raspberries are combined with sugar and flour and refrigerated overnight. This sweet mixture is then spooned into a made-from-scratch crust, topped with another round of pastry and popped into the oven to bake to perfection."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MGcrwe1DtwHUQ3Txc2GjpmtC2co=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/222630-26c0cc4d29ac41acb61f39b6a69a96ff.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Berry Rhubarb Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "124"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "427 kcal"
,"carbohydrateContent": "54 g"
,"cholesterolContent": "13 mg"
,"fiberContent": "3 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "325 mg"
,"sugarContent": "24 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 cup fresh blackberries",
"1 cup raspberries",
"2 cups rhubarb, cut into 1/2 inch pieces",
"0.75 cup white sugar",
"0.25 cup all-purpose flour",
"2 cups all-purpose flour",
"1 teaspoon salt",
"0.66666668653488 cup shortening",
"2 tablespoons butter",
"4 tablespoons ice water",
"1 tablespoon butter, melted",
"1 teaspoon lemon juice",
"1.5 tablespoons half-and-half cream",
"2 tablespoons white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To Make Filling: In a medium bowl, combine blackberries, raspberries, and rhubarb. In a separate bowl, mix together 3/4 cup sugar and 1/4 cup flour. Sprinkle over fruit mixture and stir gently. Cover bowl and refrigerate overnight."
} ,{
"@type": "HowToStep"
,"text": "To Make Crust: In a large bowl, mix 2 cups flour with salt. Cut in shortening and 2 tablespoons butter until texture is like coarse cornmeal. Place 1/3 of mixture in a separate bowl. To the smaller portion, add water and mix to form a paste. Add this mixture back to the rest of flour mixture and stir just until dough forms a ball. Allow to rest at least 20 minutes before rolling out. Divide dough in half. Roll out bottom crust and place in 9 inch pie pan."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix 1 tablespoon melted butter and lemon juice into fruit filling, then spoon into pastry-lined pie pan. Roll out top crust and place over filling. Crimp edges and cut steam vents in top. Brush lightly with half and half and sprinkle lightly with sugar."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 10 minutes. Reduce temperature to 350 degrees F (175 degrees C) and bake an additional 40 to 50 minutes, until crust is golden brown."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy to make &amp; very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David A Skinner"
},
"reviewBody": "Followed the recipe as close as possible, and it was absolutely bloody delicious . What stood out for me was the inclusion of blackberries &amp; raspberries, rather than the usual strawberry combo. Pastry came out extremely well also in an 8\" metal pie pan!\nTotally two thumbs up Sue!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Delicious! I did have to add more fruit to fill up a pie. And I poured off a lot of juice that had collected overnight. . . so added a bit more sugar &amp; flour to make up for that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Barskey"
},
"reviewBody": "Made this several times! Super easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrslarson"
},
"reviewBody": "Perfect. I read the reviews so I used 2 cups of rhubarb with about 4 more cups of a mix of blueberries, black raspberries and strawberries. Added about 1and 3/4 cups of sugar mixed with 1/2 cup of flour. Topped with cold butter. I also used a pillsbury crust(s). After turning the temperature down to 350 I baked an additional 50 minutes. We waited till the next day to eat-even though we wanted it immediately ??. Still a bit runny but absolutely delicious. I’ll be making this one again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wright89"
},
"reviewBody": "Will make this again and again. Husband and I both loved it. Wasn't runny at all, and we cut into it 2.5 hours later after taking out of oven. Served with maple nut ice cream. Great recipe! (I do have to admit that I used strawberries instead of blackberries but followed recipe to a T.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CCFW"
},
"reviewBody": "Don't know if I should rate this recipe because I made a number of changes! I didn't use a pie pan - I fill a 9x13 inch pan. I used rhubarb, strawberries, a few raspberries, blueberries and blackberrries (I was cleaning out the freezer). I think it's healthier to make a topping out of oatmeal so I did that instead of crust.\nAnyway - we both loved it!\nI look at recipes as a starting point!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Gessner"
},
"reviewBody": "My MIL’s favorite is rhubarb pie, but we have a hard time finding rhubarb where she lives in Georgia. I harvest it from my garden, freeze &amp; bring when we visit for her birthday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Morsink"
},
"reviewBody": "I used 2 cups rhubarb, and 2 cups of mixed fresh berries (blueberries, raspberries, and strawberries). Same proportions of flour and sugar gave excellent consistency of filling. I did not refrigerate the filling overnight. Just let it sit for about an hour before adding it to the crust. Not runny! Very tasty! \n\nI use a different crust recipe, so I can't comment on the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "I really enjoyed this pie. It set up nicely and tasted very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheDIYBaker"
},
"reviewBody": "Really good. You don't need to let the filling sit overnight, just for a few hours. I would suggest finding your own crust recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie N."
},
"reviewBody": "I made this pie exactly as the recipe calls for. It was excellent - many compliments. I also love this crust and have used it for other pies as well. thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S Ober"
},
"reviewBody": "I love adding rhubarb to my fruit pies (particularly raspberries)...this was the perfect recipe and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary-Lyn Wigg"
},
"reviewBody": "I have made this at least 10 times since my raspberries started ripening this spring. It is a total hit with family and friends. Fresh berries and fresh rhubarb. I thought the filling was skimpy the first time but it expands quite a lot while it bakes so I was glad I used my pyrex pie plate partly full vs. a foil pie plate with half the filling on the bottom of the oven. It's runny a bit when warm but firms up perfectly once it is cool. I'd give it 6 stars if I could! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I used a frozen pie crust but brushed it with egg and sprinkled with coarse sugar before baking. It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri Wofford"
},
"reviewBody": "Easy as can be to make this one and berries are everywhere right now. I used lime juice instead of lemon and it was great. Will make this one again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mariah Tahmisian"
},
"reviewBody": "Really Good, although I didn't put in rhubarb or raspberries and it was strictly a berry pie, although crust was very crumbly, only downside!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DORY"
},
"reviewBody": "Very good filling. The flavor is wonderful. I didn't have raspberries so I just substituted it with other berries. Using flour as thickening didn't work the first time. The second time I made the pie again, I used ½ cup of cornstarch and it turned out perfect. I didn't use the crust from the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeni"
},
"reviewBody": "I made this pie for a recent dinner party &amp; it was a HIT!!! The rhubarb makes it tangy- make sure you like rhubarb before you make it. I LOVED it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Sun"
},
"reviewBody": "Don't usually write reviews but this pie was YUMMY! Rhubarb not in season so substituted with Granny Smith Apples &amp; cheated by using ready made pie crust &amp; it was excellent. 4 people polished off the entire pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetiepie39"
},
"reviewBody": "I used black berry and strawberry with rhubarb. It came out delicious. Perfect pie for a family get together, decently kid friendly for rhubarb. I felt the amount of filling was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Antishort"
},
"reviewBody": "The blackberries give the pie a beautiful dark red color. I found it a little too tart (I even cut out the lemon) and next time I will add double the fruit so it's really bursting. I'm going to go eat more pie now ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tdp125"
},
"reviewBody": "Very tasty! I used a little less than a cup of raspberries, and a little more than a cup of blackberries. Next time I will bump up the fruit by about 1/4 - I thought there could have been more filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4kidsinthehouse"
},
"reviewBody": "Very impressive and very, very tasty pie!!! I used rhubarb and black raspberries, both freshly picked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sjwalsh97"
},
"reviewBody": "This was my first attempt at making a pie from scratch and it was SO good. I will for sure make this again. It was completely gone shortly after it had cooled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikke"
},
"reviewBody": "This was my first attempt at making pie and it turned out fantastic! I used strawberries instead of blackberries and raspberries and butter instead of shortening, but followed it to a tee otherwise. Even the crust worked out! Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PUMPKIN314"
},
"reviewBody": "Delicious! I substituted blueberries for blackberries as I have a bumper crop of blueberries right now. I also used a boxed pie crust mix because it needed to be used. But I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValJoy"
},
"reviewBody": "Not too sweet or sour - wonderful - I'll make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bjoys1414"
},
"reviewBody": "Loved it, though my kid thought it was still too tart. I disagreed. I added a bit more sugar like a number of people called for. I added an additional 1/4 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "Great summer pie! I made for Fourth of July wknd and brought to a friends along with homemade vanilla ice cream. I did take the advice of others and doubled+ the fruit (9 cups in all). I used 7 cups of berries (2 pckgs strawberries, 1 pckg blueberries and 1 pckg blackberries) and 2 cups of rhubarb. I did let the fruit macerate overnight with sugar (1 1/4c) and flour (1/2 c). The fresh fruit produced A LOT of juice so I strained off a good amount so the pie wouldn't be soopy. Next time I'll just let fruit sit an hour or so, not overnight. I also egg washed the bottom crust (to prevent soggyness) and poked holes (to vent) before adding the pie filling on top. I forget the butter but did add some fresh lemon juice before sealing with the top crust. My fruit was very sweet but like others I would check yours before adding lemon as it may not need it. I baked for over 50 minutes (never heard timer!) so the filling did start to seep out the side and overflow. It was messy but not ruined. I let the pie rest for about 3 hours to cool and then refrigerated overnight. Took it out a few hours before serving to bring to room temp. Was contemplating warming but ending up serving as is with vanilla ice cream. It turned out very well. The fruit held up well even tho I was afraid it might be mushy from overbaking. The crust was also flakey and perfectly baked. I used just egg wash (no half&amp;half) on top crust so it would brown and have shine. Was definitely pleased wtih results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndyW"
},
"reviewBody": "This is the fifth rhubarb dessert I've made in two weeks, and is easily the favorite recipe. I didn't bother with refrigerating overnight, used a Safeway pie crust, and like other reviewers stuffed in a little more fruit that the called for. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "This was the first time making a crust from scratch. Came out perfect! Everyone loved it. Love the berry and rhubarb combo. Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa.murakami"
},
"reviewBody": "This was THE most incredible pie I have ever had. To make it even easier I used the Pie Crust III recipe (also allrecipes - and AMAZING): I also believe the Pie Crust III recipe prevented the \"runny\" issues another reviewer had, since it's a substantial, chewy crust that can hold those yummy juices. For the crust, I followed the tips from reviewers (added 2 tsp sugar, 1 tsp salt, and made 1.5 x the dough). \n\nI'll second the pie reviewer who said you don't need to let it sit overnight (maybe 2 hours) but I DID add the lemon juice/butter and was VERY glad - it added the perfect tang, just make sure you use fresh lemon juice (not bottled). Seriously. This is a slice of heaven. I didn't even care for ice cream with it because I didn't want ANYTHING detracting from the perfect tang of the berries and the flaky perfect texture of the sweet crust. MAKE THIS PIE!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi.A"
},
"reviewBody": "Ok, I made this with frozen mixed berries, blueberries, raspberries, strawberries and blackberries. Added an extra cup of rhubarb. The pie was outstanding, but even with the extra cup of rhubarb still needed more filling. Next time I will make this with 3 1/2 cups rhubarb and 3 cups mixed berries. Easy to make and a sure winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Santamaria"
},
"reviewBody": "This was my first rhubarb pie, and I was very happy with the way it turned out. I doubled the amount of fruit as other suggested and it was the perfect amount. I didn't completely double the sugar as I didn't want to over sweeten it since my boyfriend likes rhubarb a little more on the tart side. I'll probably go ahead and double it next time though. To firm up the filling I added a packet of unflavored gelatin and let the pie cool overnight to set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "notyouraveragegranny"
},
"reviewBody": "I threw in handfuls of berries I had , raspberries, blueberies, blackberries and 1 bag of thawed rhubarb with its juice. I didnt let it sit overnight just put it in the oven. And I used a store crust. Excellent. definitly a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Bochsler Kirack"
},
"reviewBody": "Excellent recipe!! I used fresh strawberries and frozen blueberries with the rhubarb and a little orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calimomof4"
},
"reviewBody": "This was my first experience with rhubarb and it was wonderful. Great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika"
},
"reviewBody": "Amazing! Hands down the best rhubarb pie I've ever had, plus the crust is awesome! Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quilting pastime"
},
"reviewBody": "I made this recipe just as given and loved the combination of fruit. I have found out that there are different verities of rhubarb and I happen to have plants that are known for there tartness. I increased the sugar 1/4 cup in my second pie. I added fresh blueberries, strawberries and 2 tablespoons of tapioca to the flour mixed in the filling. (this gave me a firmer pie, perhaps the verity of rhubarb is more watery then others or it could be the moisture content the rhubarb plant received before harvesting.) This is a wonderful pie. I'm planning to freeze my berry mixer in vacuum bags for a treat when the snow is flying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "I would give 100 stars for this recipe! it is always a big hit everytime I make it ,my family begs me for it! :) Thank You !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLHAYLEY"
},
"reviewBody": "This was fantastic. I doubled the fruit because I was making a deep dish 9 inch. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindi - Boise ID"
},
"reviewBody": "This is my new favorite summer pie. Having new options for my rhubarb is fantastic especially with my fresh raspberries and blackberries. Recipe was easy to follow and turned out great! I used my own tried and true pie crust recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Pulley"
},
"reviewBody": "Delicious pie, although I used what fruit was on sale, so it was strawberry, blueberry and rhubarb. I love that the pie is versatile for you to use whatever fruit you want. My husband said he could have eaten the whole pie in one sitting! I do look forward to trying it with raspberries and blackberries and I appreciate finding a pie that only uses 2 cups of rhubarb, which is exactly the odd extra amount I had left! You could taste it but it wasn't overwhelming. Just added a nice \"different\" flavor. Made my grandma's pie crust, so can't say how this crust recipe is, but I'm sure it's also yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MalElaine"
},
"reviewBody": "This was tasty and easy. I didn't refrigerate overnight, only a few hours and it came out beautifully. I don't like rhubarb but the berries make this pie shine for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MacMedic892"
},
"reviewBody": "This was our family's first taste of rhubarb--it's hard to find in the Gulf South--but this will DEFINTELY not be our last. Spectacular flavor! Not too tart or too sweet, and goes great with a scoop of vanilla on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryK"
},
"reviewBody": "This was excellent! I've been making pies for over 30 years and this one is going into my favorites list. I made the recipe exactly as stated, but put it in a smaller pie pan. (I actually put it in a disposable pie tin.)It was just the right amount of filling for the smaller pie pan and it set up beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "I've never eaten rhubarb before, but now I'm a believer! This was one of the best pies I've ever made or eaten. I allowed the fruit to come to room temperature before filling the pie since I was afraid the rhubarb wouldn't soften in the baking time, and that worked out fine. Some reviewers said they don't put all the accumulated liquid in the pie, just the fruit, but the thickening agent and a lot of the flavor are in that liquid. I put it all into the pie and had no problem with it being runny. I loved the crunchiness of the sugar topping on the crust and would like to try that on other pies. We ate it plain, but it would be out of this world with a scoop of vanilla ice cream. Give this a try if you've never eaten rhubarb and I'm sure you'll find you love it as I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SLEEPY7"
},
"reviewBody": "I added a cup of sliced strawberrys and 1/2 cup of chopped walnuts - GREAT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay H"
},
"reviewBody": "This was my first pie from scratch, and it was divine! I followed other reviews and used 6 c of filling. 8 c would definitely have run over. I was very proud of my first scratch pie crust, and this recipe was easy to follow. The shortening + butter really hit the medium between flavor and flakiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakengrace"
},
"reviewBody": "Lets put it this way I just planted 8 more rhubarb plants in my yard due to this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NCAPERTON"
},
"reviewBody": "Absolutely delicious. Everyone's plate was licked clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Gallagher"
},
"reviewBody": "I added 1/2 cup extra of rhubarb and 1 cup extra of raspberries ,so I should have added a bit more sugar, but it was very tasty. Didn't use their recipe for pastry-used French pastry recipe instead--good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ptrgee"
},
"reviewBody": "My first berry pie and used the french pastry crust and it was the best pie ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RLSCHROE"
},
"reviewBody": "Turned out great! I almost doubled the fruit part like the others suggested and that made about enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "My favorite pie on the planet is a Strawberry Rhubarb Pie I've been making for probably 40 years and look forward to every spring. So making this pie was a real departure, and I only did so because I got a little carried away with my market's sale on berries. What a treat! I used 2 c. rhubarb, 2 c. raspberries, and a cup of blueberries, and simply added a tad more sugar and flour to compensate for the extra amount of berries. There is no need to start this the night before--just let the berries and rhubarb sit in the sugar/flour mixture until they start to release their juices, stirring every so often. Because rhubarb and raspberries are tart I omitted the lemon juice and was glad I did. I didn't bother with melting the butter, just dotted it with a little butter before slipping on the top crust. For those who are not big fans of rhubarb this may be a good recipe, as the rhubarb flavor is subtle. Rhubarb lovers might want to add more! Either way, this is a beautiful, jewel-toned pie that perfectly showcases the flavors of the season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. D.B. Simonette"
},
"reviewBody": "Good, good recipe. I would agree to chill overnight and spoon the mix into the crust to avoid adding too much juice, the bottom of the crust was not mushy at all. I used strawberries, raspberries, rhubarb and huckleberries. (recommend cooking the rhubard with sugar, maybe a little water, to make a sauce, same with the huckleberries, to sweeten their tartness). Also is good with a crumble crust top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyoftheIvy"
},
"reviewBody": "Extremely good, I would highly recommend this pie. I did make one slight change due to the fact that my raspberries had gone bad (I used strawberries and blueberries in place of them), but otherwise made it as is. It was very good, and enjoyed by everyone. I do think that you can use more fruit than it calls for (which means you'd probably want to increase the sugar and flour as well), but it otherwise really needs no changes. Very, very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt"
},
"reviewBody": "This pie is amazing! I used huckleberries instead of blackberries, and about 1 1/2 more berries than the recipe called for. I added a little more sugar/flour to account for the extra berries too. The crust was wonderful, flaky, and easy to make. This was my first time making a crust from scratch, and it turned out great. I'm definitely make this again, and will see how other berry combinations do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robbin Lynn"
},
"reviewBody": "OH-MY-GOSH!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Rudd"
},
"reviewBody": "Perfect for rhubarb lovers and rhubarb skeptics alike!!! I used my own crust recipe but I have never tasted a better berry rhubarb pie. I used the exact recipe for the filling and found it to fill the pie nicely though I am sure it would be fine to add more as others have suggested. I made this for my husbands birthday (he loves pie and hates cake.) It was a great success even with people who \"normally don't like rhubarb.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chari Campbell"
},
"reviewBody": "So far this summer, I've made a strawberry rhubarb pie, a raspberry rhubarb pie and now, last night, this pie. Hands down,this recipe is THE BEST! Don't be afraid to give it a try - it is SUPERB! It filled my house with such a pleasant aroma while baking. A definite winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie T."
},
"reviewBody": "WOW! What a great way to use up all the rhubarb in my garden! I did make a few changes, doubled fruit, adding in apricots and black cherries, and I brushed the top with melted butter instead, then sprinkled with cinnamon and sugar. So amazingly good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLEVANG"
},
"reviewBody": "This is a terrific recipe. I was looking for a recipe similar to one recently purchased from our local grocery store. This is the exact pie, with the addition of apple. I increased sugar to 1cup, added 1 tablespoon of cinnamon, and chopped 2 cups of apple to add to the fruit mix. I did not change anything - oh, I did not let it sit over night, we were eager for a pie for after dinner, so I let the frozen fruit sit in the bowl with the sugar/flour mixture while it thawed, and then I added it to the pie shell to cook. This is an easy favorite from here on out! Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "WARNING: This pie is so amazing that it will cause arguements! I will make this again and again and again!! Thanks so much for this recipe! Like others, I added a little more fruit than called for. Be sure to spoon in the fruit and don't get too much of the juice or your pie will be runny. While the pie is a little time consuming don't jip yourself- make the crust! (It's the best!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHANSNAN"
},
"reviewBody": "I'm not a berry person so I didn't try this but I made it for my husband and he loved it! Very easy to make and he just loved the combination of fruit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATTORREZ"
},
"reviewBody": "EXCELLENT!!! I used Rhubard, Strawberries and blueberries and it was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULSABC"
},
"reviewBody": "wonderful!!! I used a crumb top instead though, and added just a touch more flour than suggested. also, doubled the filling my 1/2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent Pie! Only added 1/4 cup more of Rhubarb. Crust was old family secret. Mother-in-law used to make rhubarb pie - Husband said make again!! Thinking about making it for Farmers Market. Will add more rhubarb to home garden. Works for us - YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just fabulous! This was the first pie I had ever made and it turned out looking really professional and tasting even better. Used the Butter Flaky Pastry recipe but otherwise did exactly as the recipe stated. Please don't be put off by the need to mix the filling and then leave it overnight - it's a little frustrating if you want pie NOW (as I did) but for a pie this good you'll be glad you made the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Such an amazing recipe. My boyfriend ate at least a third of it! I brushed the crust with melted butter instead of the half and half since I didn't have any and it turned out great and perfectly golden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful flavor! I would suggest instead of 50/50 the crust for top and bottom to use slightly more for the bottom 60/40. I also sprinkled some sugar on the berry mixture before I put the top crust on! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FRAMBUESA"
},
"reviewBody": "This pie was awesome. I had a bunch of fruit that I wanted to use and a garden full of rhubarb so I ended up using around 6 or 7 cups of strawberries, cherries, raspberries, rhubarb, and apples to make this pie. I made a lattice crust for the top of the pie and ended up baking it for a little over an hour before I took it out of the oven, even though the crust really wasn't really browned. The color was awesome, as was the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this recipe for Father's Day at my house and everyone loved it. t I feel that the berries are a good combination with the rhubarb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marne"
},
"reviewBody": "I used blueberries, raspberries, strawberries, and rhubarb. All-in-all it turned out very yummy. I used about 8 cups of fruit, so I doubled the flour and used about 1 1/4 c. sugar. I usually don't make berry pies and have learned my lesson to let it sit overnight before cutting it. I couldn't help myself, cut into it warm and it was VERY runny - but the next morning it was all set up, so I think I had about the right measures of flour and sugar.. Just didn't have the patience to wait to eat it!!! The crust is perfect. I will use that recipe again for other pies. It's just the right mix of crunchy and flaky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEYALICE"
},
"reviewBody": "This is a fantastic pie! I too increased the amount of fruit and am very happy with the consistency. Great crust too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms. Joey Gilmer"
},
"reviewBody": "Great flavor. Follwed the recipe exactly (except for using a Pillsbury crust) and it tasted great. However, as some of the other reviews said it was a bit too runny. I imagine it all depends on how fresh and \"JUICY\" your fruit is. I also added more fruit because it seemed a little scant for that size pie. With a few adjustments this could be great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHERYLLOONEY"
},
"reviewBody": "The crust of this pie is the best and easiest I have tried. It is a \"no fail crust. . . one I will use in all my future pie baking. The berry/rhubarb combination is a great taste too with the zesty taste of rhubarb mixed with the berries. Great idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NICOLES3"
},
"reviewBody": "I made this for Easter, and it was FANTASTIC! I used frozen fruit--I forgot to buy raspberries, so I just used equal amounts of rhubarb and blackberries. It was tart and sweet: a perfect combination. I didn't want to hassle with making pie crust, so I just used a Pillsbury crust and it was still wonderful. Don't let the two day prep time deter you; it takes so little time each day that it isn't worth worrying about. Also, other than the raspberries, I followed the recipe exactly and I didn't have problems with it not filling a 9-inch pie plate or being too runny. Try it and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAK3G"
},
"reviewBody": "I have made only 4 pies in my life....this one was so easy and so delicious. I cheated though and bought a pie crust. I will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRAVLEE"
},
"reviewBody": "This is a great recipe! I had never eaten Rhubarb until I met my husband who is from Colorado(rhubarb is not grown much in Louisiana!). He loves rhubarb so I have been searching for recipes to make him a rhubarb pie. I used 1 cup of rhubarb and then put in some crushed pineapple, strawberries, cherries and raspberries. Used a bit less sugar than called for and a bit more flour to thicken. This came out great and my husband loved it. Even my family who had never had rhubarb raved about this pie!! Thank you, thank you thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hungdaemon"
},
"reviewBody": "I have baked this pie no less than 15 times, and it ALWAYS gets rave reviews. The sweet berries and tart rhubarb are the perfect mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Knight Lyons"
},
"reviewBody": "This was really good. I used a fresh rhubarb and a frozen berry mix with blueberries, raspberries, blackberries, and strawberries. It was a big hit on Mother's Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent! I took the other reviewers' suggestions and added more filling (including strawberries), and it came out fantastic. Maybe slightly too runny - next time I will spoon the fruit into the pie instead of pouring the fruit and juices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This will definetly be made again in my house, it was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JAZZY-GIRL"
},
"reviewBody": "Good except filling as given didn't fill the pie up too well, I had to add more. Good taste though, thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rnheo"
},
"reviewBody": "A little too sweet, but otherwise great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I increased the rhubarb, threw in some strawberries, and turned it into a crunch, and everyone was mad for it. Had to fight to get to try it myself. Certainly didn't last for long. Printed up 6 recipies to give to family and friends that requested it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELANIE KENNEDY"
},
"reviewBody": "I tried this recipe for a local pie competition. I won First Place. I made this two times. The first try I followed the recipe and only substituted Marionberries for Blackberries as they were not in season yet. This was too tart for quite a few people. On the second try I used only 1 cup rhubarb and 1 1/2 cups each of raspberries and marionberries. Everyone who tried this said it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "What a great recipe! I cheated and used store bought tart crusts and i also didn't wait overnight before using the filling they were still awesome! Have also thrown in some strawberries and the recepe still turns out great every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a fabulous recipe! It was nice to \"dress up\" the rhubarb with something other than just strawberries, and what better way to do that than in a delicious pie with blackberries and raspberries! I used store-bought pie crusts and it still turned out great. A real winner in my book."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "My 11-year-old made this. It came out picture perfect and very tasty. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The pie was good, however, it was too tart for the kids and takes 2 days to make, since you have to soak the berries overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Kochanek Splavec"
},
"reviewBody": "Very tasty! I found the filling to be a bit skimpy, I double it. Great crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAFICAT"
},
"reviewBody": "I've made this pie the last two years with my own fresh rhubarb. This is an EXCELLENT pie. Not being much of a baker, I bought pre-made crust in the freezer section of the grocery store. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This Pie is excellent! I used only Raspberries and Rhubarb, and it turned out wonderful. The crust was easy to make and came out perfect! I highly recommend this recipe! My Kids love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLS2409"
},
"reviewBody": "This is one wonderful pie! The crust is sheer perfection!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great pie! Easy to make and everyone loves it!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15738/berry-rhubarb-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12953/desserts/pies/fruit-pies/rhubarb-pie/",
"name": "Rhubarb Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15738/berry-rhubarb-pie/",
"name": "Berry Rhubarb Pie"
}
}
]
}
}
, "about": [
]
}
]