				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Best Ever Meatloaf with Brown Gravy"
,"datePublished": "1999-10-03T22:21:29.000-04:00"
,"dateModified": "2022-11-08T10:02:22.000-05:00"
,"author": [
{"@type": "Person"
,"name": "MARBALET"
,"url": "https://www.allrecipes.com/cook/39277"
}
]
,"description": "This meatloaf with brown gravy makes a comforting weeknight meal. The meatloaf comes out super tender, and the gravy is easy to make while it rests."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/b1Nt1zIuBotaVle-o39RLaKrKuE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/736285-best-ever-meatloaf-with-brown-gravy-Holiday-Baker-4x3-1-49cf0d2ac7774b6dbd6522d53142dcaf.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Best Ever Meatloaf with Brown Gravy"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "201"
}
,"cookTime": "PT75M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "451 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "133 mg"
,"fiberContent": "1 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "431 mg"
,"sugarContent": "1 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.5 pounds ground beef",
"0.75 cup fresh bread crumbs",
"0.5 cup chili sauce",
"1 large egg",
"0.25 teaspoon salt",
"0.25 teaspoon freshly ground black pepper",
"1 tablespoon butter",
"1 cup fresh sliced mushrooms",
"2 tablespoons minced onion",
"1 cup beef broth",
"2 tablespoons water",
"1 tablespoon cornstarch" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine ground beef, bread crumbs, chili sauce, egg, salt, and freshly ground black pepper in a large bowl; mix well. Press mixture into an 8x4-inch loaf pan, then place the loaf pan on a rack in a roasting pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until meat is well done with no trace of pink, about 1 hour. An instant-read thermometer inserted into the center of the loaf should read at least 160 degrees F (70 degrees C). Let rest for 10 minutes while you make gravy."
} ,{
"@type": "HowToStep"
,"text": "Make gravy: Melt butter in a medium saucepan over medium heat. Add mushrooms and onions; cook and stir until tender. Add beef broth and simmer, stirring occasionally, for 5 minutes. Mix together water and cornstarch in a small cup; stir into broth. Cook and stir until gravy is thickened, about 1 minute."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect for the whole family! Easy and delicious 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is so easy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg McCright"
},
"reviewBody": "My go-to meatloaf recipe - better than Mom's AND better than my ex-wife's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cponta1"
},
"reviewBody": "I followed it to the letter for the gravy ,it came out great. I did blend it in my Vita Mix than reduced it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOTOWNWINGNUT"
},
"reviewBody": "I noted the back and forth on the gravy, so I branched out and improvised. I am not a big corn starch fan, so I used roux instead. Easy day. I also added a boat load of garlic, which my family loves. I noted the issue with the meat loaf breaking apart. So, I scaled back the bread crumbs to 1/2 cup and added an egg. This was perfection. I mixed 1/4 pound of bacon bits into the mixture, as well as 3 fresh crushed garlic cloves. The dish was money and big hit with my improv of this basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "Made as written, with the exception of doubling the amount of salt in the meat and adding garlic and adding salt and garlic to the gravy. Neither of my revisions helped much. Bland and boring. This basic recipe needs so many tweaks. Embrace the spices of this world. They can save many a recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "I made this today &amp; love it. Simpler &amp; better tasting than my old recipe. I doubled the gravy recipe for mashed potatoes. Red chili gives it a nice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Kay"
},
"reviewBody": "It’s delicious! Fast &amp; easy recipe. Easy steps. I enjoyed making this simple but filling &amp; tasting dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "delicious old fashioned recipe. I used worcestershire sauce instead of chili sauce. Very good! will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Lopez"
},
"reviewBody": "Best Meat Loaf I've ever made. Thank you for this delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Ingredients readily available for most folks, easy to follow...excellent meal, without breaking your budget."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Orzulak Voigt"
},
"reviewBody": "I only made the gravy from this recipe, not the meatloaf. The gravy is wonderful and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kerry Stewart Manning"
},
"reviewBody": "After reading reviews, I opted to substitute the chili sauce for Worcestershire sauce. The meatloaf was fantastic and so was the gravy, but just not together. Meatloaf without ketchup is just wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Piper Taggart"
},
"reviewBody": "This recipe turned out well. I used salsa and chili base instead of chili sauce. I added some Worcestershire sauce to the gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gail Herbest"
},
"reviewBody": "It had been years since I made meatloaf since my husband doesn't like it I never bothered to make it for myself ,\n But today I decided It sounded good and went on the hunt for a recipe, after reading all the good reviews I chose this one.\n I followed the recipe exactly, I gotta say it is nothing special really, I used Chili sauce which by the way is not at all spicy you can feed this meatloaf to children without worrying about the heat. You could use ketchup and no one would know the difference,\n I made the gravy which also was ok but again nothing special just by looking at the ingredients you can see it is only thickened beef broth with a little onion and some mushrooms. The recipe is easy to make and it turned out ok I don't think it would be my favorite that is for sure, it needs spices or something, I actually am surprised that so many people raved about it. I would call it plain ole meatloaf!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "1.7.19 I didn’t make the meatloaf, only the gravy. I had some mushrooms which needed to be used up, and wanted a simple gravy/sauce for some grilled ground beef patties (no bun). I often use a pkg of McCormick® Brown Gravy for something like this, split the cup of liquid between beef stock and red wine, added a bit of dried tarragon, salt and pepper. OK, OK, I know I changed it a bit, but this actually turned out quite well, and the recipe is strong enough to stand on its own. I see no need to ever buy the McCormick® gravy again, as this was so easy to make, inexpensive, and turned out pretty well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billy Seiber"
},
"reviewBody": "Easy, delicious. Remember to put a few spoonsful of the heated sauce into the corn starch mixture before dumping the corn starch and water into the gravy. This is how you prevent clumping. I used extra onion in the gravy, and I also added minced garlic and chopped onion to the meatloaf. The garlic didn’t cook through in the baking process, but I’m a fan of flavorful, crunchy garlic pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "regina"
},
"reviewBody": "I didn't make the meatloaf yet. I'd already made some, but forgot to make gravy. I wanted to do something more than just get a gravy pack and I ran upon this recipe. I just finished and tasted it. The gravy is excellent!! I'll have to try the meatloaf with it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derrick Mathis"
},
"reviewBody": "Great recipe! I made a few changes: used two eggs. Also added a half cup of onions and two tablespoons of worcestershire sauce. Used a different gravy recipe from Chef John. Otherwise delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kala Moreland"
},
"reviewBody": "I didn't make the meatloaf but I did make the gravy. It turned out really good. I did however use another recipe I found on here for my meatloaf both turned out delicious. Great recipes on here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "I use this recipe for the gravy. I add 1 tsp seasoning salt and mix 1/4 cup of water (2 tablespoons of water yields too thick of a consistency for us)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "De"
},
"reviewBody": "Excellent! Tastes just like my mom used to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "I'll Eat It!"
},
"reviewBody": "I used the chili sauce from the Asian food section (the cousin to the rooster sauce). It might be a little stronger than the stuff by the ketchup, next time I’ll go with a third cup. Outside of that this turned out great. Took about 70 minutes to throw it all together, including rest time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ccski721"
},
"reviewBody": "Wanted to try a new way to make meatloaf without a red sauce, but with a homemade gravy instead. Found this, and LOVE it!! My fiance and the kids love it too! My son told me that this is the only way I'm allowed to make meatloaf from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dick Morello"
},
"reviewBody": "Really was the best ever meatloaf. Followed the recipe exactly and found it to be right on. Will definitely make i.e. again. The wife really does not like meatloaf but she did enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad Parker"
},
"reviewBody": "Doubled the recipe and made my own all spice and chilli sauce. Also using grass fed beef. Our 3.5 year old was eating on it while it cooled. He wasn't much for the gravy which made more for Mom and Dad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Logue"
},
"reviewBody": "So delicious and easy too. I will definitely make this again. Wouldn't change a thing with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LeeBt"
},
"reviewBody": "I'm giving the overall recipe 3 stars because the meatloaf isn't the best. But if I could rate the gravy alone I would rate it 4.5 stars! I make a different recipe meatloaf but keep this around just for the gravy recipe! Excellent !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Schott Carling"
},
"reviewBody": "This meatloaf is amazing. I used Worcestershire instead of chili sauce and drained the mushrooms out after they cooked for a plain brown gravy (I like the mushroom flavor, just not a fan of chewing them!). Served with mashed potatoes, it was a sensation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lucy"
},
"reviewBody": "I was more intrigued with in the gravy mixture than the the actual meatloaf. The meatloaf was fine. I had a hard time getting the gravy to thicken. I even added an addition 1 tbs of cornstarch with 1 tsp of water and it still didnt thicken after bringing to a boil. I dont know what happened but I eventually gave up and we had soupy gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Afcello"
},
"reviewBody": "This is the best meatloaf ever. It's easy for a week night and the leftovers are great. Improvise if you want (we all have those days) but never never never substitute the chili sauce for ketchup. Otherwise just go to Wendy's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Salee"
},
"reviewBody": "It's GREAT!!! Me, my husband, my daughter, my brother and my dad love it. It was pretty easy but instead of flour instead of cornstarch and it still tastes good. I totally recommend this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "I have been looking for and tried numerous recipes for meatloaf, finally this one met my hubby's approval, with only a couple slight modifications. I added half of an onion finely chopped and half of a bell pepper finely chopped in with the meat. Everything else I followed to the letter and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ember Blue"
},
"reviewBody": "I think the chili sauce gave the meat a weird flavor. Both my husband and I thought the spicy flavor was weird for meat loaf (even though we usually like spicy things). The texture was nice. And I used season salt as another reviewer suggested. The gravy tasted great and was the only reason we were able to eat the meat. I won't be making this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Not bad at all!!! Loved the gravy. Hubby and adult son are now very happy and sedately watching TV. :) \nSince \"some like it hot\", I used Adobe pepper gravy and 1 chopped pepper instead of the chili sauce. It added a nice smoke flavor but didn't make it \"hot\". \nThe other substitute was the bread crumbs had to be Gluten Free Panko crumbs which maybe why it seemed a little dense - it's typical for gluten free substitutions. \nI can say, I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolinebeck"
},
"reviewBody": "This recipe is wonderful. I used seasoned panko crumbs instead of bread crumbs and left out the salt. Smelled wonderful when still raw and even better when cooking. I also doubled the gravy recipe for extra potatoes. I will be making this meatloaf from now on. It would also be very good with additional chili sauce on top instead of gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Littlewabbit"
},
"reviewBody": "This was amazing! A new favorite of my husband and I's. Made with gouda mashed potatoes and cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolin"
},
"reviewBody": "The chili makes this meatloaf so you have to use one that has a great taste. I used Tabasco Homestyle 7 spice chili starter. My changes that I made to this recipe are that I used 2 pounds of ground bison instead of ground beef, and since I try to avoid gluten, I used crushed cornflakes instead of bread crumbs. I also added an extra egg to help bind it together. The results were great! My husband has asked for this to be added to our rotation and my brother-in-law thought it was the best meatloaf that he ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deezlyrics"
},
"reviewBody": "The only thing missing from this meatloaf is a bit of chopped onion. Just like grandma used to make! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeCanCook"
},
"reviewBody": "This recipe totally lived up to its name...it absolutely was the Best Ever Meatloaf with Brown Gravy! The only thing I did different was add a tablespoon of Worcestershire sauce as so many reviewers suggested. All plates were scraped clean and they were looking for more! BTW - meatloaf is NOT a big hit at our house, but both hubby &amp; son requested I make it again next week!!! Thank you Marbalet for this fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "T's chef"
},
"reviewBody": "I added sriracha hot sauce &amp; ketchup for the chilli sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CTCook"
},
"reviewBody": "Loved it! I did make one minor change and used tomato sauce in place of the chili sauce. I needed to add 15 minutes to the cooking time but otherwise it was perfect. The gravy was so simple but amazing...if you like gravy you will want to double or triple that recipe as we did not have enough. It thickens quickly so kept an eye on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Latoya M"
},
"reviewBody": "I've made this recipe a few times and it comes out great every time. I made one adjustment by adding minced garlic to sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "groovyj"
},
"reviewBody": "I really enjoyed this one, and yes, the gravy is quite good. I will be making this again tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJ"
},
"reviewBody": "Fantastic! A few alterations. I added 2 eggs instead of 1 it binded much better and based on other reviews added some granulated garlic. Def double the gravy recipe added minced garlic and used fresh onions. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Barbara Hood Coyle"
},
"reviewBody": "Used oatmeal,ketchup,two eggs,more seasonings, more onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "psmljj"
},
"reviewBody": "Great taste with little effort. Instead of making meatloaf I fried up all ingredients except chili sauce &amp; bread crumbs, used beef bouillion and served over mashed potatoes. A tad bit different than recipe, but very tasty nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CloudNine"
},
"reviewBody": "We liked it. I used 2 eggs per other's reviews and I used Italian bread crumbs because that's what I had on hand. It was quite spicy as I used hot chili sauce. I made an additional brown gravy packet and added it to this gravy as I wanted plenty and I read other reviews stating that's what they did. Loved it!\n\nThe meatloaf was a piece of cake to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "The meatloaf part of this recipe didn't have much going on, so it didn't interest me. But the gravy did. This review, then, is for the gravy alone. It was wonderful. I added a little more cornstarch and the juices from the meatloaf. I generally make my meatloaf gravy like this but the mushrooms and minced onions were new additions I really enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kjspontaneity"
},
"reviewBody": "This meatloaf was just okay. It didn't really have a lot of flavor. There are better meatloaf recipes out there, so I probably won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ThisMamaCanCook"
},
"reviewBody": "I used my own meatloaf recipe, so this review is for the gravy only. I tripled the recipe so there would be plenty for both the meatloaf &amp; mashed potatoes. I used baby portabella mushrooms. It was delicious &amp; very easy to make. This gravy recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ronibonnie"
},
"reviewBody": "I did not make the meatloaf but I wanted to rate the Brown Gravy as it is both tasty and GLUTEN FREE. I was looking around for a recipe for beef tips and rice and this gravy was AWESOME!!!! It's been a long while since I've had gravy and this was better than any other gravy I've made before. Tasty Brown gravy!!!! Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nvolvedmom"
},
"reviewBody": "I did not make this meatloaf but did make the gravy, it was awesome. I made 2 cups and added salt, pepper, onion powder and garlic powder. Served over my own meatloaf recipe. will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "I'm nuts too"
},
"reviewBody": "I had the same issues as some others with the meatloaf falling apart. next time i will add minced onion to it. the gravy was tasty, and needed to be doubled so that we could use it on the mashed taters that went along with the meal. i too made a rue with the butter and cornstarch and then slowly added the broth which i made from bouillon and potato water. next time i will add a splash of gravy master to make it a bit darker. thx for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leyla017"
},
"reviewBody": "Best meatloaf ever... just like the name. I add onion and garlic and some paprika with some chopped mushrooms and it really tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I read a review on here that said the meat loaf was plain, so based on that I added some dried parsley and onion &amp; garlic powder. I also had a 2lb package of lean beef, so I just used that. I thought it would go quicker if I cooked patties on my stove. They tasted amazing and the family kept trying to grab them! But, it was a little time consuming, so I think I might try the oven method as directed. I did think that the gravy was quite salty though. So, I added the same seasonings and adjusted the water, but still wasn't to my liking. So, next time I think I will make my own gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "koten"
},
"reviewBody": "This meatloaf was great! I swapped the chili sauce for worchestire sauce but kept everything exactly the same. Came out very flavorful and moist. It was gone within 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TAYLOR~"
},
"reviewBody": "The gravy really made this recipe. Meatloaf tasted good right out of the oven, although it kinda fell apart... would use an extra egg next time. Leftovers, which I look forward to, were not so great. I think I really missed the onion in the meat, however, will make again with a couple of modifications. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xsomber_resplendencex"
},
"reviewBody": "JUST REVIEWING THE GRAVY- I did not make the meatloaf, but I needed a quick and easy brown gravy for poutine. I can't use the packets due to food intolerances, and I didn't have any meat drippings on hand- The gravy was super easy and so Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karlee"
},
"reviewBody": "chili sauce??? - used tomato sauce &amp; added seasonings to taste; also added garlic, finely chopped onion, worchester sauce; then cooked as stand alone loaf in baking dish so that all sides can brown. Additional spices were good idea o/w would have extremely bland. \nPro is that recipe is easy &amp; quick to get in oven. If more than 2-3 people &amp; you want leftovers you may want to increase recipe size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evilboohbah"
},
"reviewBody": "Gravy Review ONLY! - I made the gravy from this recipe and I've got to say it was delicious! I didn't have mushrooms but even without them the gravy tasted great and it was very easy to make. This is definitely a keeper. I made it for another meatloaf recipe from this site. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DSRZ"
},
"reviewBody": "I had already made my meatloaf, and was looking for a gravy. This was good, but lacked something... maybe some garlic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "freckie"
},
"reviewBody": "This IS the BEST every Meatloaf and the Gravy recipe is yummy too. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Kinney"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foodie Family"
},
"reviewBody": "great meatloaf and gravy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kspencer"
},
"reviewBody": "Fabulous! I have never cooked meatloaf OR gravy before (I thought I hated both!) but have been looking for new recipes to try. My husband had three helpings, and we will definitely be having this again! I mixed it the night before and was a little nervous about the bread crumbs sitting but it all worked perfectly. I used ground venison and that was so good, I will be trying it with turkey next!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUESP"
},
"reviewBody": "Delicious meatloaf and gravy. Didn't have any mushrooms and the gravy was still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Kelly"
},
"reviewBody": "best recipe ever! i used garlic bread for the bread crumbs, and threw in a squeeze of dijon mustard. also an onion. i followed the gravy recipe as written below. made mashed potatoes and corn to go with. amazing comfort food - easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray Zabel"
},
"reviewBody": "This Meatloaf was one of the best I've ever had. I used 1 pound of ground beef and a 1/2 pound of ground pork, added a little garlic powder and some minced onion. It was so moist and flavorful that the gravy was unnecessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BIRDLADY51"
},
"reviewBody": "Awesome gravy which I have never been very good add. Thanks for the recipe. I'll try your meatloaf next time. I served your gravy with chopped steak this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evan"
},
"reviewBody": "This recipe worked out great. Very easy. I doubled the gravy recipe, and I'm glad I did. It sounds silly, but this was the first time I've made gravy with corn starch rather than flour. That's the way to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Surprisingly good! I did put garlic in the gravy as others suggested as well as a little cayenne for extra bite. All in all a country style wholesome supper which was especially good with garlic/sourcream mashed potatoes! Loved it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SWEETJAM"
},
"reviewBody": "I had some problems with this one. First the loaf. Mine did not bind for some reason. While mixing it I thought it would be very moist with the addition of the chili sauce. After it cooked it just didn't bind together. I have never had that happen with a meat loaf. The gravy was incredibly bland. I use very good organic stock and often have this problem with recipes because they are not full of sodium. I added both salt and pepper to the gravy. The gravy was easy to make. I would make the gravy again for sure, but I think I'll stick to my old meat loaf recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Elaine Huggins"
},
"reviewBody": "I wasn't too sure about this until the first bite. Then I ate half the pan. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda D."
},
"reviewBody": "This was a very tasty meatloaf and gravy. Next time I will add a little garlic to the meat mixture and the gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ilove2jog"
},
"reviewBody": "Nice recipe. Gravy was awesome!!! Simple to make &amp; tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bagelbroad"
},
"reviewBody": "We love this meatloaf. Juicy and flavorful, it has become part of my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "As another had done, I only made the gravy this time, but I wanted to give credit where credit is due. I have never had much luck with gravy in the past, but this was easy and fool-proof with a fabulous taste. Even my 10-year old, who complains any time she spots mushrooms, loved it and couldn't get enough. Thank you for the opportunity to make this wonderful gravy. I look forward to trying the meatloaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam Ziegler Lutz"
},
"reviewBody": "My husband loved this and he doesn't like meatloaf. I like meatloaf, and I thought this was okay. I thought the chili sauce made it a little sweet for me. The gravy was very tasty, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillian"
},
"reviewBody": "I used this recipe for the gravy only. This was a very good and very easy brown gravy recipe! I made it as written except I didn't have any mushrooms, but it was still very tasty! I would of liked it to be a little thicker, so next time I'll add less liquid. This will be my gravy recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RYALOO"
},
"reviewBody": "The flavors were very good, will make again and added to my recipe box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MN Cook"
},
"reviewBody": "I, also, am only rating the gravy because b'friend is very proud of his own meatloaf :) In any case -- FANTASTIC brown gravy!!! Holy cow -- who knew brown gravy without drippings could be so tasty and easy?? This is one of those recipes that will go to the front of my recipe book. Hopefully one day, I'll get a chance to make the meatloaf in the recipe, too! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Benninghoff"
},
"reviewBody": "I am rating the gravy only I have a meatloaf recipe that is the bomb, but this gravy recipe is soooo easy and sooo spectacular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maryann"
},
"reviewBody": "Although we here in SA would rather make meatballs but then I have tried this meatloaf - it was lovely but I also added some crushed carlic and parsley with the mixture and yes they loved it a lot. Served with mashed potatoes and sweet carrot rings and salads. Thank you for sharing this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sweetness {Doces Americano}"
},
"reviewBody": "This was a good meatloaf. Needed a little more salt. The hard part about that is you cant really taste before cooking, being as though it is raw meat. I added bbq sauce, I liked the tang. It went very well with the gravy. Will be making again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June Jessie"
},
"reviewBody": "will definately make this one again, moist and flavourful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "This is a very easy meatloaf recipe that is tasty and filling. I never bother to make the gravy and add chopped onions and fresh parsley to the meatloaf. I also use Italion bread crumbs instead of plain. The chili sauce is a great addition and much better than ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "h00siermama82"
},
"reviewBody": "My family really loved this gravy. The meatloaf was ok, but it just wasn't like my mom used to make. I will definatley use this gravy the next time I make meatloaf, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemarie"
},
"reviewBody": "Very good and the chili sauce adds a nice kick- Scaled down recipe to one pound of meat. Added one stalked of celery diced and 1/4 cup diced onion and chopped mushrooms. Also about two tblp of chopped italian parsley. Used thai sweet chili sauce. We made extra gravy- Used one 14 oz can beef broth for gravy and adjusted other ingredients accordingly. Added thyme to the gravy. Enough gravy for the meat and mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wide Eyed"
},
"reviewBody": "I admittedly did not make the meatloaf in the recipe, but the gravy was great! I followed the directions to the T and it was yummy over mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PantryDreams"
},
"reviewBody": "We absolutely love this recipe! I did make a few changes. I added 3/4 cup chopped onion and 3 cloves minced garlic to themeat mixture. I also used crushed ritz crackers for the bread crumbs instead because that's what I had on hand. I have made this twice now and it never lasts. Absolutely delicious. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Kennedy"
},
"reviewBody": "The gravy was very good and the meat loaf was actually better the next day as a sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sable H."
},
"reviewBody": "Seriously easy recipe, I used ketchup instead of chili sauce, didn't have any on hand, so added a few shakes of chili powder to the mix, as well as half a green pepper. The mushroom gravy TOTALLY made this recipe frickin kickin! Thanks for sharing : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JosieTheMama"
},
"reviewBody": "This Meatloaf was/is AWESOME. My husband LOVED it. I will used this recipe from now on. THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeyrl"
},
"reviewBody": "Really Great.. Every one Gets Tired of Tomato Meat Loaf"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hackwell"
},
"reviewBody": "I read all the reviews before making this recipe, and agree 100% with the name, Best Ever. My 7 year old loved it and told me He loves Meatloaf, which you wouldn't expect from him. I added some french fried onions as well as the bread crumbs and also added some ketchup with the chili sauce. The leftovers didn't even make it to the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BECKY"
},
"reviewBody": "i liked it, this was the first time i have EVER made my own gravy from scratch. Like all the other times i have made meat loaf though this tasted like salsbury steak, very good. I just have some personal issue with meat loaf i think"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JuneBug"
},
"reviewBody": "Sorry to disagree. The meatloaf was rather bland and of the ho-hum variety. As for the gravy, I don't know what all the raving is about--zero flavor. Not a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "meatloaf is ok but gravy is WOW"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14644/best-ever-meatloaf-with-brown-gravy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/256/main-dish/meatloaf/",
"name": "Meatloaf Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/998/main-dish/meatloaf/beef-meatloaf/",
"name": "Beef Meatloaf Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14644/best-ever-meatloaf-with-brown-gravy/",
"name": "Best Ever Meatloaf with Brown Gravy"
}
}
]
}
}
, "about": [
]
}
]