				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Best Tuna Noodle Casserole"
,"datePublished": "2021-03-10T18:02:09.000-05:00"
,"dateModified": "2022-12-29T05:22:28.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Nicolemcmom"
,"url": "https://www.allrecipes.com/cook/28183721"
}
]
,"description": "With a classic creamy taste that will remind you of your childhood, this tuna noodle casserole is the best budget-friendly meal to feed a crowd."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/sVZADhn22YXv1-VEYqvhYE6rT38=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9085119-best-tuna-noodle-casserole-AllrecipesPhoto-4x3-1-46115bbe31844cfcad82032f0ef718c0.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Best Tuna Noodle Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "51"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "481 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "91 mg"
,"fiberContent": "3 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1481 mg"
,"sugarContent": "6 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (12 ounce) package egg noodles",
"4.25 teaspoons kosher salt, divided",
"4 tablespoons salted butter, divided",
"5 teaspoons olive oil, divided",
"1 (8 ounce) package sliced fresh mushrooms",
"1 small white onion, minced",
"0.25 cup all-purpose flour",
"2 cups milk",
"1.5 cups chicken stock",
"2 tablespoons lemon juice",
"1 teaspoon Dijon mustard",
"0.5 teaspoon ground black pepper",
"1.5 cups shredded white Cheddar cheese",
"1 cup frozen sweet peas",
"2 (6 ounce) cans tuna, drained",
"1 cup panko bread crumbs",
"0.25 teaspoon ground paprika",
"2 tablespoons finely chopped fresh parsley" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of water to a boil. Add egg noodles and 3 teaspoons salt to the boiling water; cook until tender yet firm to the bite, about 6 minutes. Drain noodles. Return to pot and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat 2 tablespoons butter and 1 tablespoon oil in a large skillet over medium-high heat. Add mushrooms and onion and cook until mushrooms are softened and onions are translucent, about 4 minutes. Add remaining butter; stir constantly until melted. Sprinkle flour over vegetable mixture and cook, stirring constantly, for 1 minute. Stir in milk and stock and bring to a simmer, stirring often. Simmer for 5 minutes. Stir in lemon juice, Dijon mustard, 1 teaspoon salt, and pepper."
} ,{
"@type": "HowToStep"
,"text": "Add sauce mixture to reserved noodles. Stir in 1 cup Cheddar cheese, peas, and tuna. Pour mixture into the prepared baking dish and sprinkle remaining Cheddar cheese over the top."
} ,{
"@type": "HowToStep"
,"text": "Stir together bread crumbs, remaining 2 teaspoons oil, remaining 1/4 teaspoon salt, and paprika in a small bowl. Sprinkle bread crumb mixture evenly over the casserole."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden and bubbly, 25 to 30 minutes. Sprinkle with parsley and serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was so delicious!! I also made it using leftover chicken instead of tuna and it was also wonderful. This is a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frankie Hart"
},
"reviewBody": "My family loved it! Even I loved it and I have never liked hot tuna fish in any form. Did take more time and a bit more effort but was worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Schelvan"
},
"reviewBody": "I saw this recipe in an email, knew right away I wanted to make it because it reminded me of a casserole my mom used to make for us 4 boys and our Pops! I doubled the Dijon and bumped up the cheese, and it tasted awesome! I’ll make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this! Doesn’t take long to make and includes several of my favourite foods!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pegwaysidecomcastnet"
},
"reviewBody": "Way too much salt used. For those who have to be tight with sodium intake, don't add salt to noodles cooking or anywhere else in the recipe. Use unsalted butter. There is plenty of salt in the cheese itself and the tunafish to make the dish very nice. You might be surprised at how fresh it tastes without loading it with salt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The recipe as printed contains way too much salt for the average person. I would use unsalted butter, unsalted broth to cook the noodles in, and no added salt to the recipe. The tuna, and the cheese contain all the salt a person needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "For those wanting to try something different with the \"crust\", I suggest sliced almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theresaniksick"
},
"reviewBody": "Omg this is the best tuna casserole I have ever made and have ever had, I followed the recipe exactly except I did add a little red pepper flakes for a bite but didn't notice any and I added a tiny bit of chopped celery, I didn't double the sauce but I did the amount it called for and a half and the consistency was perfect it wasn't dry and it wasn't too wet it was absolutely perfect and for the topping I mixed a half a cup of panko with a half a cup of bread crumbs because I ran out of panko and I mixed that with oil and butter and sprinkled my cheese on top and then the panko and bread crumb mixture and then I added some of the french fried onions on top of that, it came out absolutely perfect, next time I might double the sauce and add an extra can of tuna but, like I said, it was the best tuna casserole I have ever had, was a lot of work but it was definitely worth it in the end... Soooooooo good.... I've already had two helpings and I live alone so I don't know what I'm going to do with the rest of it but I guess I'm going to freeze it in little containers lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mare"
},
"reviewBody": "This was great! Will add a little more peas next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gord"
},
"reviewBody": "Made a half recipe as we are only two and wasn't ready to share a first time with a new recipe (for me). It makes enough for a couple of days plus so use a large pot. The good news is that it was really tasty and I think it can be sealed and frozen. I saw the reviews saying it was a bit dry so I bumped up the chicken stock and deglazed with a large splash of dry white wine. I also agree with the addition of celery as it added a nice crunch in addition to the panko. We really like the ability to reduce the amount of salt by not using canned soups. The best tuna casserole that I have had and I am not sure if it is the Dijon or the lemon juice or just fresh stuff. We loved this, will probably try the recipe with crab next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noreen Gamble"
},
"reviewBody": "It was very good, although I think I would make extra sauce next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "It was just delicious. Very flavorful, creamy and rich. The Panko topping mixed with the cheese gave a tasty crunch. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I left out the lemon juice as I didn't have any on hand. Was very delicious &amp; filling!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunday Zidonis"
},
"reviewBody": "I only use 1 can chicken broth for more intense flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJL"
},
"reviewBody": "Excellent flavor and love the panko!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ramona Perez"
},
"reviewBody": "My husband swears that he loathes casseroles and especially tuna casserole. I made this recipe and spooned it into four individual cassoulets, moving it outside his concept of a casserole. He not only loved it, he asked to take the remaining two to work for lunch. I was a little worried that the sauce was a bit thin when I spooned it in, but it was perfect! I substituted fresh spinach for the peas, rotini for the egg noodles, and included some parsley in the bread topping as well as sprinkled on top when I served it. Outstanding with a glass of Sauvignon Blanc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanine"
},
"reviewBody": "I am a senior that lives alone and there are so many recipes that I make that even when reduced are still more than I could finish in a reasonable time. So there are a lot of meals that I may freeze for later. For those of you asking if this can be frozen, this is my suggestion: Complete to step 4, but do not sprinkle with cheese. At this point it can be frozen (I personally like to freeze in individual zip-lock portions but can also be frozen in larger portions). The day you plan on eating, place in refrigerator in AM (or even defrost in microwave later) before completing with sprinkled cheese and steps 5 and 6."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark M"
},
"reviewBody": "Found a nice piece of tuna steak in the discount bin at the supermarket. Just shy of 1 lb., decided to grill and then flake and add as called for in the recipe. Also made my own bread crumbs using garlic butter croutons. Semi-formal dinner for business associates. Rave reviews at dinner and then received requests for the recipe the next day. This was an excellent meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcrumley"
},
"reviewBody": "Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Proal"
},
"reviewBody": "I eliminated most of the salt. The sodium content of this recipe is almost 1500mg per serving. Even getting rid of most of the salt it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindaboo"
},
"reviewBody": "I love tuna noodle casserole and wanted to try this one because it got such good reviews. I made it with what I had on hand but the cheese on top and then sprinkled with bread crumbs is what really takes this up a notch. Super yum. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very yummy and easy to add personal favorites. I used fresh mushrooms which I sautéed with the onion prior to adding. Also, I used Sun Chips (French Onion) for a terrific topping! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "I made this a couple years back. My husband and I loved it. Prefer making our own sauce to using a can of soup. Love how it came out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gregor"
},
"reviewBody": "Wonderful base with lots potential add-ons. I like the idea ofadding celery, and if on hand, i like to add red or yellow bell pepper. I add corn flakes to a portion on top, as it gets saugy over night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was an easy delicious old family favorite. I did add celery and used potato chips instead of breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hopi"
},
"reviewBody": "This was a great base recipe for me since I’m kinda new to cooking real food. My mom used to make it this way when I was a kid. Yummmmmy. I swapped the scratch soup and used 1 can of cream of celery and left out mushrooms altogether. I added a 1/4 cup of sour cream, only 3/4 cup of milk and a tsp or 2 of spices, fresh ground black pepper, fennel seed and tarragon. I didn’t sauté the onions and with that, they add a perfect crunch to the casserole. The Lemon And the Dijon Mustard are such a fantastic match!!! My lemon was a perfect organic Meyer Lemon so I also used about 2 tsp of the zest. So………….Fragrant. Instead of a 9x13 pan I used 3 x 3 1/4 cup Ello Baking storage containers so they could go oven to fridge or freezer and back in the oven or microwave. I Cooked covered for 20 minutes on 325. I raised the oven temp to 450 for 20 more minutes and uncovered, brushed a beaten egg on top for maximum crispiness. I under cooked 2 of the 3 pans and immediately put them in the freezer. To unfreeze defrost on counter for 3 hrs. Preheat oven to 325 bake for 15 mins covered Then raise temp to 450 for 5-10 or till brown &amp; crisped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious, I added the little red chilli's to it because I like spicy tuna and it was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Mann"
},
"reviewBody": "A loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "This recipe is so much better than any other recipe than what we had as children. The fresh mushroom, fresh parsley are the key ingredients improvements in this recipe. Also, the panko is a much better alternative than the chips we used in the 80’s! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth R"
},
"reviewBody": "Very dry - otherwise tasted great. Will double the sauce next time and I am sure that will make it fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen McCubbin"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Sims"
},
"reviewBody": "My husband and I really enjoyed this. He’s not big on casseroles so that says a lot. The only thing I changed was to leave out the onion because I am allergic to it. I can only imagine how much better it is with the onion in it. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "b4d79v4tbj"
},
"reviewBody": "I never comment, but here I go…this was amazing and I love that there is no canned soup in the base!\nI tend to deviate from recipes so…I used medium egg noodles and swapped asparagus for the peas (one bunch cut to small pieces little bigger than peas, added red bell pepper (I like color) and spiced up the topping by adding smoked paprika, chipotle chili (I think any heat will work) add a half to 1/4 cup of panko since you are adding spices. Also topped liberally with Italian and regular parsley. Cooked 20-25 min let cool for 10 and asparagus still had a nice crunch. \nThank you for the original recipe. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buffy"
},
"reviewBody": "I made this a few months ago with half Gruyere and half Emmental cheeses, as I could not find cheddar where I was living. I'm not sure what this tastes like with the cheddar, but the meal I made was so very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anaharvey"
},
"reviewBody": "My husband really enjoyed it, took back to his childhood. He even said it was better than his mom’s. I even liked it. Thank for another great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Munnerlyn"
},
"reviewBody": "Delicious! Followed recipe as is. Having to restrain myself from getting thirds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shino"
},
"reviewBody": "I decreased the casserole by half for the two of us, and there were leftovers enough for lunch. I added diced celery and a carrot to the mixture and used what cheese I had on hand- a bit of Gouda, fontina and white cheddar. The casserole was delicious and enjoyed by my husband as well. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MariaB"
},
"reviewBody": "Delicious. I followed the recipe except didn’t add peas because I don’t like them. I used Beecher”s cheese, it’s worth using a nice sharp cheese for this. Really really good, will definitely make again. Served with roasted broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larry taylor"
},
"reviewBody": "This was my first time cooking a tuna casserole and much to my wife’s delight she loved it. I gave this recipe a five cause it’s the second time in thirty years she loved what I cooked. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Wonderful!!! Very happy I stumbled across this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb A."
},
"reviewBody": "This is a very tasty recipe and I made as directed (with the exception of the parsley as I didn't have any on hand). I made half the recipe, which was plenty for my family unit. Thanks so much for the recipe, it has a great flavour, is easy to prepare and it's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "Sounds delicious! I've been making tuna casserole like this for awhile but will definitely try this specific recipe next time. One comment that I hope helps someone: I have found that a 12-ounce can of tuna, yields more solid tuna than in two smaller cans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Southern Belle"
},
"reviewBody": "The best I’ve ever eaten. I used albacore tuna. This would be good made with chicken in a can too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "This recipe was SO good! What an excellent version of Tuna Noodle Casserole. Traditional in theory but such a cut above the usual bland meh. My family of 5 gobbled this right up. Thanks for a 5 star winner. I will definitely be using this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryL"
},
"reviewBody": "My husband and I really enjoyed this recipe! It is something we’re looking forward to taking to our community potluck, as we know it will feed a large group that will bring healthy appetites!\nMany thanks, Nicole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M J"
},
"reviewBody": "I halved this recipe for the two of us. It was really good for a few days warmed up for lunch. I used 1 can of albacore tuna. When sautéing the veges, I added 1/4 C red pepper for color. We love Dijon mustard, so I doubled that along with the addition of Dubliner white cheddar cheese. I really like the idea that no canned soup was in the recipe. Canned soup just adds sodium and additional fat. Good solid recipe to make again and again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/283622/best-tuna-noodle-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/413/main-dish/casseroles/seafood/",
"name": "Seafood"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15020/main-dish/casseroles/seafood/tuna/",
"name": "Tuna"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/283622/best-tuna-noodle-casserole/",
"name": "Best Tuna Noodle Casserole"
}
}
]
}
}
, "about": [
]
}
]