				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Best Ever Tuna Salad"
,"datePublished": "2000-10-29T19:48:33.000-05:00"
,"dateModified": "2022-08-08T11:35:32.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kristy"
,"url": "https://www.allrecipes.com/cook/24325384"
}
]
,"description": "The best tuna salads are sweet and creamy! This delicious recipe uses crabmeat, chopped egg, pickle relish, onion, dill weed, and yellow mustard."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/C07A4nK9QixGKQSLi9jCzSGsVMA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8722639-021e39a6e4ce48f2b2fde742cde8030b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Best Ever Tuna Salad"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "138"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "187 kcal"
,"carbohydrateContent": "4 g"
,"cholesterolContent": "80 mg"
,"fiberContent": "0 g"
,"proteinContent": "14 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "260 mg"
,"sugarContent": "2 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 eggs",
"2 (5 ounce) cans tuna, drained",
"1 (6 ounce) can crabmeat, shredded",
"0.5 cup mayonnaise",
"1 teaspoon sour cream",
"1 teaspoon yellow mustard",
"0.5 teaspoon dried dill weed",
"0.125 teaspoon lemon pepper",
"2 tablespoons dill pickle relish",
"2 tablespoons sweet pickle relish",
"0.75 cup finely chopped onion" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel, and chop finely."
} ,{
"@type": "HowToStep"
,"text": "In a mixing bowl, combine tuna, crabmeat, mayonnaise, sour cream, and mustard. Stir in chopped egg, dill weed, lemon pepper, dill, sweet relish, and chopped onion. Mix thoroughly."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rapierce4"
},
"reviewBody": "The crab is a great add-in for a tuna salad sandwich. TWO additional options; 1 that I LOVE is avocado, which my mom added to her tuna &amp; egg salad. The other is pickled jalapeno, but I don't think the dill would go very well so I swap it for cilantro. I also add a scant pinch of cumin and give it a south-of-the-border slant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blakstarn"
},
"reviewBody": "Excellent recipe that I have used time and time again since I found it. It amazes me how negative some people are. Most do not follow the recipe or make substitutions then criticize the recipe for their inability to properly prepare a dish. Waiting to read the boiled water recipe complaints they have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad Morgan"
},
"reviewBody": "This a very fresh, interresting take on tuna! I seem to have lost my previous recipe...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Femme Techie"
},
"reviewBody": "DELICIOUS ....and I did not change a thing on purpose...but I did not have Dill relish, so I doubled the sweet relish.\nNext time I will be sure to have it on hand...made it just a bit sweet. The dill relish would have been a balancer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MsM"
},
"reviewBody": "Made it. Didn't like it. I will, however, try it again using fresh crab, not canned. Canned crab and sour cream made it to runny. Mayo would be plenty for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Adcock"
},
"reviewBody": "Oh yeah! This is good stuff. Easily, the best I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Lynn"
},
"reviewBody": "I liked this, but not my favorite ever. I liked the contrasting sweet and dill relishes. I thought adding only 1 teaspoon of sour cream was kind of weird, so I upped it to a heaping tablespoon. I don't think the crab meat was very noticeable. I used about 5 green onions. Overall, it made a good sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mona Mouse"
},
"reviewBody": "Best Ever is right. So many subtle flavors and not only tuna and mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrh"
},
"reviewBody": "This is a really good tuna recipe. I did have to omit the crab because my husband has a shellfish allergy so I used 3 cans of tuna. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "Delicious! This recipe is almost exactly how I have made tuna salad for many years since I was a little girl. So I knew it would be a good one. If you want a little more crunch, some diced celery is good to add in also. I didn't add in the crab meat, since I just wanted tuna salad only. So I used an extra can of tuna to replace the crab. I also added in a dash of onion and garlic powder, and some parsley. Great flavor and the best tuna salad! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REALWYATTBURP"
},
"reviewBody": "This is a ten star creation of genius. Each element plays in a symphony of infused flavor more complex than a Mozart composition. Add the juice of bread and butter pickles, and a little seasoning salt, and you will learn what ecstasy truly is. Go on and throw out the haters reviews and allow yourself Nirvana.\nKristy, if you’d had served this at the last supper, there might have been a different outcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan the Bunny Lady"
},
"reviewBody": "This has become the go-to tuna salad recipe for my family. However, we don't usually have two types of pickle relish on hand, so I often just cut up a dill pickle spear to add in with the regular relish -- works!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Ellison"
},
"reviewBody": "I didn't have the crabmeat, but I used a mashed avocado &amp; put it on toasted rye bread sprinkled with swiss cheese, yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Towers"
},
"reviewBody": "Really good! We didn't have the crabmeat but it was still great. Thanks Kristy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annabelle"
},
"reviewBody": "Other than substituting celery and green onion for the onion, I made this, as written, last night, and served it for lunch today. It was good, but I didn't find it any better than my usual tuna salad (tuna, hard boiled eggs, sweet relish, and mayo). I did enjoy the dill/pickle, and my husband enjoyed the lemon. Neither of us could tell there was crab. It's definitely worth trying, but I wouldn't say it is the best thing ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tfk8488"
},
"reviewBody": "Tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pete"
},
"reviewBody": "I MADE THIS EXACTLY LIKE THE RECIPE SUGGESTED. I TOO HAVE BEEN LOOKING FOR A GREAT TUNA SALAD RECIPE AND THIS IS IT. I HAVE TRIED SEVERAL RECIPES BUT THIS IS WHAT I HAVE BEEN LOOKING FOR. IT'S JUST WONDERFUL AND BETTER THE NEXT DAY OR TWO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Brodeur"
},
"reviewBody": "delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "samcat"
},
"reviewBody": "I call this the grown-up Tuna sandwich. Had this for supper tonight with a spinach salad for it was too hot to cook tonight. Husband liked it also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donakmb"
},
"reviewBody": "this is, by far, the best tuna salad recipe I have ever made. I don't change a thing. everytime I make it for a function, everyone asks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mojenny"
},
"reviewBody": "I loved this tuna salad! We have all made tuna sandwiches most of our lives. This one is creamy and tasty. I used honey mustard salad dressing in lieu of mustard and sweet relish, 2 tbs. Followed the rest, exactly. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "drpepper603"
},
"reviewBody": "Not the best but it was okay. I added Seafood spices and that helped some. It was a little salty and I was disappointed that it didn't taste more \"crabby!? Crab is rather expensive and I feel like I got cheated. Needs something - maybe more sour cream and less mayo or more spices. I did double the recipe and at first I didn't add the sweet pickle relish. After I tasted it, I decided it needed something and added the sweet relish. Helped some but not enough to call it the best!! Won't try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lilly Zampacorta"
},
"reviewBody": "Way too much dill. Needs something for crunch, maybe bell pepper? Sorry this recipe is not a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jbooshey"
},
"reviewBody": "For the price, this wasn't good enough. I couldn't taste the crab and I thought the egg was a big reason for that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi Holmes"
},
"reviewBody": "This was good. I'm not a big tuna fan but I liked this recipe. I had to laugh at the reviewer who thought it was WAY too much work to open a can, cook and egg add a few ingredients in a bowl. Are you serious? It takes more effort to get dressed in the morning. This was very easy and quick to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lystl"
},
"reviewBody": "AWESOME !! Just had this for supper, this will be the only tuna salad recipe I use in the future. Didn't change a thing. It is the BEST !! Husband loved it. I used pita pockets filled with the tuna salad and topped with lettuce and tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brooklyn2323"
},
"reviewBody": "I really liked it. I added a little bit of jalenpo chopped up...not too much. Just a little for a little kick. It was very good Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mrs.C"
},
"reviewBody": "I was really excited to try this recipe but in the end it didn't taste any better than any other tuna salad recipe. I paid $6 dollars for canned crab meat and you couldn't really taste it in the tuna salad. I didn't add the egg or sour cream because I don't really like either. I won't be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MTCHYG"
},
"reviewBody": "Eh. I cut down the onions and it was still too oniony. And I really like onions. The crab didn't seem to add anything here. Couldn't really taste it. Seemed to be a pretty typical tuna salad that wasn't as good as the ones I've made in the past."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "david obrien"
},
"reviewBody": "excellent make a few small changes. didnt have any crabmeat so used seafood salad i had bought at a deli. used 6 green onions in place of white onion and used 1 tablespoon of sweet pickle relish everything else the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Thank You! Thank You! This is by far the best tuna salad I have ever had! My husband who is not a fan of tuna even liked it! The crab is a nice addition to the recipe. It's not too dry, not too runny. A great combination of ingredients. So simple too! I did only use 1/2 cup of onions and I completely eliminated the pickle relishes, I don't care much for them. I did finely chop just about 5 bread and butter pickle slices just to get the color. This was AWESOME, I used to love turkey salad but am now vegetarian so this is great! It's good on toasted bread, crackers, or would be good with lettuce, tomato, and a little mozz. cheese and toasted in the oven on a sub roll."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JENNR8ER"
},
"reviewBody": "Didn't use the crabmeat because I didn't have any but I'm anxious to try it! Even so, it was very tasty. Something seems to be missing but I can't quite put my finger on what it could be. Maybe after it marries overnight I'll feel differently. Either way, I'll be happily using this recipe from now on and I'll let you know if I find the missing ingredient :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee"
},
"reviewBody": "This is the ONLY tuna salad I make now. I have followed the recipe as written and it is delicious but I no longer add the crabmeat since no one can really taste it. I just use less mayo. Also, since some people don't really like it too sweet, I will use mostly dill relish and just a touch of sweet pickle relish. A lot of times, I'll make a double batch because it tastes so much better the next day. It's so yummy that I think I'll make it now and have it for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NeilC"
},
"reviewBody": "My wife and I love this. The relish adds a nice touch, much better that a plain can of tuna and mayo and not that much longer to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sokell684"
},
"reviewBody": "This was a great tuna recipe. I just used tuna because I don't like crab and I added a couple more eggs and a little more sweet relish. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lcollins"
},
"reviewBody": "Okay, let me preface this by saying I really dislike tuna and the only reason I made this was because my fiancee loves tuna salad. Needless to say I wasn't very optimstic about liking this dish. To my surprise it was wonderful! I didn't think it had a strong tuna flavor (which was to my benefit) and my fiancee really enjoyed it as well. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oh my god, this is the best tuna salad I have ever tasted. I made it with just a few minor modifications (I reduced the mayonnaise by one-half, increased the tuna by a few ounces, and replaced the two listed relishes with organic zucchini relish). I can't believe how good it is!! Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha"
},
"reviewBody": "Oh my god, this is the best tuna salad I have ever tasted. I made it with just a few minor modifications (I reduced the mayonnaise by one-half, increased the tuna by a few ounces, and replaced the two listed relishes with organic zucchini relish). I can't believe how good it is!! Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RONNI"
},
"reviewBody": "NOT A BAD FLAVOR..BUT MAKE SURE YOU REMOVE ANY SHELL (DEBRIS) FROM THE CRAB MEAT. I DIDNT GO THRU THE CLAW MEAT I BOUGHT WELL ENOUGH &amp; MISSED A FEW SHELL PIECES. A REAL TURNOFF...BUT OVERALL A GOOD TASTE ESPECIALLY WITH A LITTLE CAYENNE."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridgette"
},
"reviewBody": "This was my first time ever making a Tuna salad. It was a hit at the party everyone was saying the tuna was very good i will make this any time someone ask cause i dont really like to cook unless my husband makes a big fuss. lol!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EzE8"
},
"reviewBody": "I agree this is the best tuna salad ever. I thought Whole Foods had the best but this beats it. I made it 3 days ago and it's been better every day. I added a 1/3 c chopped celery for more crunch, a tbsp of lemon juice, a little garlic salt and an extra 1/4 c mayonnaise. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brans2sassy"
},
"reviewBody": "This recipe is amazing! I'm picky about tuna salad and won't eat just any kind. The first time we made it, the only thing I did different was not add sweet relish (bc I hate it), but added more dill in it's place. The second time I made it (which was the next day bc it was so good we ate it all in 1 day) I did not add tuna. Instead, I added 16 oz of the imitation crab and 2 small packages of salad shrimp. I omitted the sweet relish again and doubled the dill relish. I also added a dash of Celery salt. I have looked high &amp; low for a good seafood salad recipe and this was perfect as tuna or seafood! Thanks for sharing, we love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tbone"
},
"reviewBody": "Do not listen to anyone that says time is an issue for this recipe. It has great flavor and the time to make it isn't an issue. I'm guessing that the low stars are from people trying to break from the processed boxed food habit and trying to cook after being diagnosed with diabetes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizwaltersrocks"
},
"reviewBody": "Best tuna salad I have ever made but it is does take more time than I expected for a quick lunch. I changed a couple of things because I did not have all the ingredients as listed. Instead of the lemon pepper I added two dashes of lemon juice and added black pepper as well. I used krab instead of the canned crab and used a little less onion. Great flavor and I will make again for brunch. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjj"
},
"reviewBody": "AMAZING. Without a doubt the best tuna salad I've ever made. I followed the recipe but substituted half of the onions for celery. The extra crunch is great. I double the recipe and keep it in the fridge for a few days. I find that I can eat it every day and it's still enjoyable. Crackers, bread, whatever. It's great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicholas NickytheFish Colvard"
},
"reviewBody": "This is a great tuna salad receipe I love the idea of mixing the two types of relish with it! I havnt been able to make it with crab or egg yet but the tuna by itself is delicious! Maybe sometime I'll try it with crab as well. The little bit of sour cream that is added isn't even noticable as well as the mustard but that can be changed with adding more. Overall a great tasting and easy to make tuna salad recipe that I will make over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CINDY WAIT"
},
"reviewBody": "To each his own. I like all these things separately, but was not fond of the combination of all these flavors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "modelchick830"
},
"reviewBody": "DELICIOUS with the hint of crab and I love the onions and sour cream as additions. I have my mother making this now!! Each time I make it I do a little variation. Today I've put about a half a cup of shredded mozzarella cheese, a pinch of cayenne, and about a cup of cooked macaroni noodles. I find that when I make this I can never make enough so I thought maybe the macaroni will stretch it out...it tastes AWESOME so I don't think that'll help it stick around either!!!! !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cookie"
},
"reviewBody": "This is an unfortunate recipe. I had to try it because the ingredient list was extraordinary. Well, now I know. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JumperCable"
},
"reviewBody": "It took a little longer to throw it all together, but once you start eating it, it's hard to stop. I followed the recipe to the letter but added some diced Pimentos. The taste makes it a keeper for my family. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gary"
},
"reviewBody": "Followed the recipe to the letter. This was not the best ever tuna salad for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tanaquil"
},
"reviewBody": "Update: The flavors seemd to \"marry\" overnight &amp; this was much better this morning! Had for brunch on a toasted English muffin. If I make again, I won't add the mustard, or prehaps use Dijon. Original review: The mustard in this tasted weird to me. I couldn't taste the crab (I have always thought when using crab, keep the ingredients simple so that you taste the sweetness of the crab meat). Also, two types of pickle relish plus the addition of dill weed is overkill. Sorry, didn't really like this one. ):"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmine"
},
"reviewBody": "Great tuna salad! i added a few toasted almonds and it was Fab!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kacy Shaw Snyder"
},
"reviewBody": "Really great tuna salad. I made it first without the crab and then with. It is great both ways!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "I made this with leftover salmon instead of tuna and it was delicious! I used salmon instead of tuna and lemon juice and ground pepper instead of lemon pepper, but otherwise followed the recipe exactly. I doubled the recipe and served it to a crowd of 10 people who all raved that it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It tasted just like my mom's but my mom only used Miracle Whip and tuna...that's it. I was also excited to try the crab meat with the tuna but never tasted the crab, I'll try another can next time to see if it brings out the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Kei"
},
"reviewBody": "This was the best Tuna salad I have ever had. Even my husband who has never been a fan of tuna salad liked it. I did not use the dill weed, because I didn't have any and I used 1/2 cup green onions instead of the white onions. We ever used this to make tuna melts for the kids and they loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chicklet"
},
"reviewBody": "Awesome recipe!!!\nI changed it around a bit though. I used two eggs but only 1 yolk (to reduce the calories), 2 sticks of immitation crabmeat instead of canned, 1/4 cup mayonnaise (to reduce calories), 1 tsp lemon and frshly ground pepper (instead of the lemon pepper), 3 slices dill pickles (thiny chopped), and 3/4 green onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Great easy recipe. Left out the mustard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMVINTAGE"
},
"reviewBody": "I used a can of lump claw meat (rinsed &amp; drained) but I couldn't detect any crab in this...next time I will just leave it out. It's a pretty darn good tuna salad recipe though! I've always added hard-boiled eggs to my tuna salads for sandwiches...if I were serving it in a lettuce cup, I'd leave them out &amp; use apples or something instead. I used organic, low fat sour cream, green onions &amp; dijon mustard. I also used chopped sweet/hot pickle slices for the sweet relish. Added celery seed, granulated garlic (would normally use fresh but I just got one of those nifty grinders ;o) ) as well as a squeeze of lemon. Before I became health conscious, I always ate my tuna salad on white bread. I threw caution into the winds for one night &amp; had it on white, for old time's sake. I missed the wheat! LOL We enjoyed it Kristy ...thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scott Simmons"
},
"reviewBody": "Should haev been 1/2 cup of onion. Besides that, perfect. (And I love onion)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SDICRISCIO"
},
"reviewBody": "I just made this for my lunch for work. I omitted the crab and dill pickle relish. I used no sugar added sweet pickle slices - diced. I also used diced green onion as well. Followed recipe otherwise - Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keita Cooley"
},
"reviewBody": "My family loved this recipe. It was also a hit at a potluck lunch that I went to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth D."
},
"reviewBody": "This was delicious. I used canned crabmeat and it was still very good. I have always added egg to my tuna salad so this just let me add crabmeat too!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DutchMaNOLA"
},
"reviewBody": "Loved it and several other guests I served it to ...loved it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Very good, but the taste of the crabmeat got a little lost on me. Will stick to a basic recipe next time until another recipe captures my eye."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "Kristy, this recipe rocks! I generally don't like anything with mayo in it, but this was delicious. Thanks =o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a superb tuna salad that I wouldn't hesitate to serve at buffet or light lunch with Martha Stewart -- or even the President, for that matter. I have always put sweet relish, mayo, and hard boiled egg in my own tuna salad, but this one is so creamy-spreadable and so palate pleasing, I plan on passing the recipe on to friends. Ordinarily, a \"mere\" tuna salad would not merit that attention, but this version is a classic and a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HiTekRedNek"
},
"reviewBody": "Great recipie! The combination of my 2 favorite seafoods were perfect for making a tuna salad with a twist. It was a big hit with the family. Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABIDOLL02"
},
"reviewBody": "I've ALWAYS added hard boiled eggs to my tuna salad, I wouldn't have it any other way! This recipe is DELISH! I buttered some hoagie rolls and broiled them under the broiler so the bread was a tad \"toasty\". YUM!! Great summer recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yum! I’ve made this a couple times now... the last time I added 2 c cooked shape pasta and it made a delicious pasta salad! I think I might try it with another combination of seafood (beyond tuna and crab) maybe salmon or baby shrimp... other than that I’ve made it just as directed. Thanks, Kristy, for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DANI80"
},
"reviewBody": "I did not like this at all. Something about eating eggs with tuna just isn't right. I made the whole recipe and we hardly ate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HAWESA"
},
"reviewBody": "I thought this was really good. I made it exactly how it's written. Very gourmet tuna salad! I made all 8 servings and then had some on wheat bread for lunch everyday. Made for a very easy and tasty lunch! I love the hard-boiled eggs and onions in there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FireLooker"
},
"reviewBody": "Even people who claim to not like tuna salad love and ask for this recipe. It is the Best Ever!! Excellent flavor and texture. Substitute crab with tuna for all to enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PACEGIRL"
},
"reviewBody": "Fast, easy and good, will make again. I ran out of sweet dill relish so I added some splenda, whatever it tasted good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janscooking"
},
"reviewBody": "This was far from the best tuna salad I've ever eaten. I would not prepare it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'mama"
},
"reviewBody": "I just eyeballed the mayo, sour cream, and mustard but I'm sure I used less than 1/2 cup of mayo, and it was perfect. I also cut back on the onion, and wish I had cut back a bit more. It tasted like a very good old fashioned tuna salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMMYKUP"
},
"reviewBody": "Delicious! I followed the recipe exactly and loved the addition of crabmeat. I used low-fat mayo and sour cream, and sweet relish without sugar added, and it tastes great! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DIGIGIRL"
},
"reviewBody": "Very good! Actually a lot closer to what I grew up with than I had thought from reading it, so of course, I liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FatCatAnna"
},
"reviewBody": "Needed to make something in a hurry for an afternoon picnic - and had most of the ingredients except substituted dill pickle relish with a few pickle slices diced up - grated a tsp of lemon rind instead of using lemon pepper - used 1/2 cup of green onions - and 1 tsp of dry dijon mustard. Am saving this one in my recipe file. Excellent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Clark"
},
"reviewBody": "Sometimes you just need a recipe to remind you of the tuna you had as a kid, this is the recipe for me.......but better! I didn't have crab but plan on using it in the future! I added chopped pepperincini (sp?) then served the salad in half of a ripe avacado. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SQUEAKYCHU"
},
"reviewBody": "I loved this tuna salad. I've been looking for quite a while for some tricks to make my tuna salad more like those that restaurants serve and less like me just opening a can and adding ingredients at random. This did the trick! I omitted the crab meat (because I don't eat crab) and used dill pickle juice (instead of the relish as I didn't have any). I used freshly grated pepper instead of lemon pepper. It was excellent. I scarfed it down immediately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SHADOWMERV"
},
"reviewBody": "This was good but not extraordinary. It just wasn't worth the time or the ingredients. Just goes to show, IMO, that sometimes the most basic recipes are the best recipes. On the other hand, I served the leftovers as a dip with 7-grain crackers and my guests loved it. I substituted shrimp for the crab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FIREFLY1034"
},
"reviewBody": "Excellent recipe. The addition of the crab meat is a nice touch. I added more dill and doubled the lemon pepper to suit my personal preferences. Would definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Frame Bethune"
},
"reviewBody": "Best tuna salad I have had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JPBROUGH"
},
"reviewBody": "Best tuna salad! I agree with cutting down on the onion. I also added some chopped celery. My wife mixed it with cooked macaroni. Outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corinne Dillingham"
},
"reviewBody": "I made this for a luncheon that I am providing tomorrow. I just hope I don't eat all of it by myself before then! Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "QUASINAUGHT"
},
"reviewBody": "This was good but not the best. It tasted like any other tuna salad I have had. I left out the relish and added pickles instead. I added the crab but couldn't taste it. I think that is a waste of money. I won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent! I followed it to the letter. Put on light toasted english muffins topped w/tomato slice and a slice of mozerella cheese. Under the broiler for a minute and....great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I LEFT OUT THE CRAB MEAT WHICH IS PROBABLY WHAT MAKES IT DIFFERENT...MINE TASTED LIKE TYPICAL TUNA SALAD...BUT IT WAS GOOD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BTRACY02"
},
"reviewBody": "Fabulous! This was so great, I was really iffy about all the ingrediants, but they blend so well together. Perfect, this will be the only tuna salad that I make from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best tuna recipe I have ever had, the dill relish makes all the difference in the world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best tuna salad recipe I've ever tried. Next time, I think I will reduce the mayo to 1/3 c. and the onions to 1/2 c., but it is great. Thanks for a keeper, Kristy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARDUST_331"
},
"reviewBody": "I have been looking for a tuna salad that is not so tuna-ish. This is good. I would not use the canned crab - heard from a friend it is terrible. I bought some fresh crab meat, but found some shells in it (in the refrigerator section). I have bought jumbo lump crab meat before and it was awesome - you just have to get it from your seafood department before it sells out for the day, but it is totally worth it! I made the mistake of only putting in 6 oz of tuna by mistake so the salad was kind of on the sweet side from the sweet relish and the crab, so I will be sure to put it all in next time. I was hesitant to put the relish in, but it was nice, and wasn't overpowering or distinguishable enough that my pickle-hating boyfriend couldn't eat it. I am contemplating putting in some drained cottage cheese in, for creaminess and extra protein."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BTHORNcooks"
},
"reviewBody": "The best use ever for canned real crab meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Niki Hoffman Farbotko"
},
"reviewBody": "This was very tasty - I will definitely keep this recipe - but it wasn't much different than other tuna salads I've had. I was afraid that there would be too many onions, but it was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TANYA93"
},
"reviewBody": "This was very tasty. A real keeper. Since I made it just for myself, I used a 6-ounce can of tuna, less crab and just one egg and scaled back on the other ingredients. I didn't have any sour cream, but I don't think it made a difference in the taste. Goes great on toasted bagels with sliced tomatoes. Thanks for such a delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zernike"
},
"reviewBody": "This recipe is perfect! I doubt I will use any other for tuna salad. I substituted slightly to make it low fat: using 4 hard boiled egg whites, fat-free Miracle Whip, and fat-free sour cream. Everything else I followed exactly and served it on toasted English muffins with sliced tomatoes and a sprinkle of lemon pepper. Fantastic!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23570/best-ever-tuna-salad/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/408/salad/seafood-salad/",
"name": "Seafood Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2809/salad/seafood-salad/tuna-salad/",
"name": "Tuna Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23570/best-ever-tuna-salad/",
"name": "Best Ever Tuna Salad"
}
}
]
}
}
, "about": [
]
}
]