				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bigos (Hunter&#39;s Stew)"
,"datePublished": "2018-06-08T09:45:56.000-04:00"
,"dateModified": "2022-11-11T13:30:11.000-05:00"
,"author": [
{"@type": "Person"
,"name": "MJ46NY"
,"url": "https://www.allrecipes.com/cook/1101407"
}
]
,"description": "This bigos recipe is a traditional Polish stew that uses pork, kielbasa, and sauerkraut. It&#39;s great for a cold day and well worth the time it takes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SO_PlspuQL560114yFHGhxyck5Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5254134-5afa501bd63c48de98489918fbcc3ca4.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bigos (Hunter&#39;s Stew)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "48"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "356 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "62 mg"
,"fiberContent": "4 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "978 mg"
,"sugarContent": "7 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 pound kielbasa sausage, sliced into 1/2 inch pieces",
"2 thick slices hickory-smoked bacon",
"1 pound cubed pork stew meat",
"0.25 cup all-purpose flour",
"4 cups shredded green cabbage",
"2 carrots, diced",
"1 onion, diced",
"1.5 cups sliced fresh mushrooms",
"3 cloves garlic, chopped",
"1 (16 ounce) jar sauerkraut, rinsed and well drained",
"0.25 cup dry red wine",
"1 bay leaf",
"1 tablespoon sweet paprika",
"1 teaspoon dried basil",
"1 teaspoon dried marjoram",
"0.25 teaspoon salt",
"0.125 teaspoon ground black pepper",
"0.125 teaspoon caraway seed, crushed",
"1 pinch cayenne pepper",
"5 cups beef stock",
"1 cup canned diced tomatoes",
"0.5 ounce dried mushrooms",
"2 tablespoons canned tomato paste",
"1 dash bottled hot pepper sauce",
"1 dash Worcestershire sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Heat a large pot over medium heat. Add kielbasa and bacon; cook and stir until bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven."
} ,{
"@type": "HowToStep"
,"text": "Coat cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer pork to the casserole. Add cabbage, carrots, onion, fresh mushrooms, and garlic. Add in sauerkraut. Reduce heat to medium; cook and stir until carrots are soft, about 10 minutes. Do not let the vegetables brown."
} ,{
"@type": "HowToStep"
,"text": "Deglaze the pan by pouring in red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with bay leaf, paprika, basil, marjoram, salt, pepper, caraway seed, and cayenne; cook for 1 minute."
} ,{
"@type": "HowToStep"
,"text": "Mix in beef stock, tomatoes, dried mushrooms, tomato paste, hot pepper sauce, and Worcestershire sauce. Heat through just until boiling. Pour vegetables and all of the liquid into the casserole dish with meat. Cover with a lid."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT225M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrewCrew"
},
"reviewBody": "Truly one of the best recipes on this site! And I cook a LOT of things from this site. I couldn't find dried mushrooms (I wanted to find porcini mushrooms specifically), but next time I will try harder. I can only imagine the depth of flavor we could reach with the addition of dried mushroom umami. Instead, I added a fresh mushroom blend. Top with a dollop of this spread or serve on a crostini on the side: 8oz cream cheese softened, 1 cucumber seeded and finely chopped, 1/4 onion finely chopped, 1/4 tsp salt, 1/4 tsp black pepper. Another change I made was that I cooked it in the oven for only 2 hours, which was plenty. Next time I will not add the 1/2 tsp salt, it's not too salty, but close to it! Also, add the ground cayenne or the hot sauce, but not both. One more thing, I added one more cup of water to counter the evaporation factor and doubled the wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jimmy Guthrie"
},
"reviewBody": "Cooked it in the instant pot, browned bacon &amp; sausage &amp; removed, sautéed veggies in the fat for 30 min as I cut up and added them, deglazed per recipe, put meat back in and cooked on high pressure for 12 min and it was awesome. Note that I didn’t have pork on hand, so I doubt 12 min would have been enough for tender pork. I would try removing the veggies and just cooking the pork in broth for 20 min, then adding the veggies back and cooking it all for another 10."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kcooks"
},
"reviewBody": "This is delicious and well worth the time to make. It comes darn close to the Bigos my husband and I discovered while in Krakow. The only thing I did differently, quite by accident, was to add the sauerkraut and shredded cabbage after step 5. I simply cooked it through for an additional five minutes before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "Oh good heavens, what a wonderful recipe! I did make modifications (don't we all?)! First, I browned the meats, then sauteed the onion and mushroom, added in the spices and garlic briefly before adding to the pot. Then I deglazed the pan and just out all the remaining ingredients in the pot before simmering in the oven. I also increased the caraway seed to 1/2 tsp, the pepper to 1 tsp, about a 1/2 tsp hot sauce, and a 1/2 tsp worcestershire. Oh, I also added the soaking liquid from the porcinis. The scents coming from the kitchen were amazing and the flavor is fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Wischler"
},
"reviewBody": "i LVOE LOVE LOVE THIS RECIPE, have amde it several times, always better the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark A. Patrick"
},
"reviewBody": "I agree with the comment above about the wine. A traditional bigos would not include wine. Also, bigos can incorporate fresh mushrooms either in addition to or without dried mushrooms. Polish saurkraut is mild tasting and not as sharp as german or kosher saurkraut. A bigos can have a hunters sausage, kind of like salami, sliced and diced, in addition to pork or beef stew meat and kielbasa. You can also toss in cubed ham. A real bigos includes a dried friut, like raisins, prunes or chopped apricot. Not a lot of dried fruit, just a small amount. Make sure there is plenty of broth and serve with sour cream, hearty bread with butter and cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sofia"
},
"reviewBody": "My boyfriend is polish and has been craving this for as long as I’ve known him(3 years!!) so I thought I would give it a go. There were a few moments where I had some doubts, since I’ve never had bigos before, like when I measured 7 cups of sauerkraut, or when all the ingredients barely fit into my large slow cooker, but I just crossed my fingers and boy was I lucky. I omitted the salt, and even though I rinsed the sauerkraut a few times, it was still salty. It could have been the broth too so next time, I will adjust. Overall, it was very tasty and he had 2 servings so it was a success. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Delicious. Served with mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lora Wade McKinney"
},
"reviewBody": "I think it is safe to say my husband loved it. I thought it was ok, but he is part polish so that probably explains his love. It did not have the liquid I was expecting but I also did not have a proper dutch oven so I think that has a good bit to do with it. I did not have tomato sauce and used a can of tomatoes. We will probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia Patterson-Brennan"
},
"reviewBody": "My husband loves this receipt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kym F"
},
"reviewBody": "I doubled the amount of pork and omitted the dried mushrooms and salt. I also made it all in one pot on the stove and simmered it for hours, rather than bake it in the oven. I used to eat this as a child and it was almost exactly as I remember. It was even better the next day, just the way it should be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Appel"
},
"reviewBody": "Love food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Woodwerk"
},
"reviewBody": "Turned out great. I had cooked pork roast so I used that cubed instead of cooking in the drippings and I omitted the can of tomatoes and used more of the tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Arient"
},
"reviewBody": "Delicious. Might experiment with the cabbage/sauerkraut ratio and the wine. Added extra beef broth to make it soupier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValleyLily"
},
"reviewBody": "Really really delicious! I made this sans bacon because I find bacon tends to overwhelm other ingredients and I am not a huge fan. It's really one of our favorites!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqui Galik"
},
"reviewBody": "I combined this recipe with another recipe from a Culinary Arts Institute to create a delicious and unique recipe for Bigos. My husband, a Polish native, raved about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CharlottePenry"
},
"reviewBody": "This was so delicious. I only gave 4 stars because I had to substitute for what I had on hand. I didn't kielbasa so I used sausage and I had some left over pork chops that I used in place of the pork stew meat. I didn't have cabbage so I cut up some fresh Brussels sprouts. Also I used canned mushrooms. I didn't use the cayenne or pepper flakes because my husband doesn't like spicy. I will make this again and be sure that I have all the right ingredients. I used my homed canned sauerkraut and I really enhanced the flavor. I can't wait to try the leftovers. My husband ate two helpings of this and that means a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angiep"
},
"reviewBody": "This didn't look too appetizing while it was cooking but it was absolutely delicious. Followed the measurements but used Butterball turkey sausage. Will definitely make again. I agree with everyone else-dont skimp on the meat. I waited till the end to add the cabbage bc I wanted it kinda crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S k"
},
"reviewBody": "Wow this was very hearty! Took longer than anticipated to prepare but was worth the wait. Great meal and currently have leftovers in the freezer for a quick meal in the future. Thin sliced boiled potatoes were a nice bed for soaking up the stew sauces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthadeltorro"
},
"reviewBody": "I made this in a slow cooker. It was great! I've ordered Bigos many times in restaurants. This was the first time I made my own. It was awesome. My husband agreed that it blew away Bigos we had eaten before. I used about twice as much pork as the recipe calls for and more vegetables. The yield was about 6 qts and I froze half of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Awesome! My husband asked me to make this and we both loved it. A lot of ingredients, but completely worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Green"
},
"reviewBody": "I made this it's wonderful, I added a bulb of fennel as well, and used napa cabbage. delicious ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia C Brogli"
},
"reviewBody": "I added extra beef broth and caraway seeds and just simmered it stovetop for an hour; let it sit for a couple of hours to cool off and then re-heated it. Very tasty and every one liked it--pretty easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheesemite"
},
"reviewBody": "I absolutely love this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slim1"
},
"reviewBody": "Grew up eating bigos. Don't leave out the sauerkraut and don't add Italian seasoning. Never heard of bigos made with wine or beer. Tastes best on the third day. Freezes extremely well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UJ"
},
"reviewBody": "This recipe is super! Though not wishing to be contrarian, please note that Genevieve's negative review is misinformed. I'm a bigos aficionado having visited Poland about 50 times and consumed bigos probably in more than 100 locations all over that country. Upon arrival in Poland, seeking out bigos is usually one of my first endeavors. I share the foregoing to impart credence to my statements about Polish bigos. Though no two cooks make it identically, it ALWAYS is sauerkraut based (indeed usually mostly sauerkraut) and ALWAYS salty. I have NEVER seen it with venison or any other wild game (but why not?) and it NEVER has a \"thick, rich brown base\" (gravy). Genevieve obviously is thinking of something else. The translation \"hunter's stew\" may be the misnomer. Bigos, at least as it commonly is prepared in virtually every Polish household and restaurant today, is made with farm raised meats obtained from the butcher - most always including kielbasa and often with pork, bacon and/or ham. In Europe, recepies prominently featuring mushrooms as an ingredient commonly have the term \"hunter\" (mushroom hunter?) in their title. Bigos may or may not have a lot of or any mushrooms. But, in my experience, it always has a lot of sauerkraut, onions and kielbasa. The rest left to the imagination and resources of the cook. In Poland it is said no clever man states a preference concerning the bigos of his wife compared to his mother's if both women are living."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChrystalOates"
},
"reviewBody": "Full of flavor and super easy to make.\n\nLeftover's get better and better as the soup ages."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ewa"
},
"reviewBody": "I am Polish and had bigos many many times. I have never seen wine as an ingredient of any traditional Polish dish - not in that climate! And Worcestershire sauce? Never even heard of it until I came to Canada. Also, no Polish cook I know would add basil or flour - it should be thick with veggies and meat but not murky. Also, potatoes are eaten with bigos on the side, mashed, but not as an ingredient. And never, never skip the caraway or tomatoe paste or mushrooms (dry mushrooms should be wild Boletus). Sourcraut is essential. So much for traditional bigos... If you are a vegetarian like I am, skip the meat - the dish is reach and tasty enough without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a quick-and-easy version. Brown the bacon, chopped pork loin (more tender than stew meat), and kielbasa together in a pressure cooker; really generate a thick fond. Add chopped onion and garlic. Deglaze with red wine. Add a whole shredded cabbage and half a jar of Bubbe's sauerkraut with liquid. Add black pepper and two bay leaves. Tomatoes optional. Pressure cook for 7 minutes. Done!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dobby the Church elf"
},
"reviewBody": "This stew is out of this world! I made this for the priests in my parish and had a nice amount left over for my husband. I'm mostly a vegetarian (I eat fish) but I did try this just to make sure it was edible. It's heaven! I followed the recipe as far as preparing the meat but threw everything in a crock pot (including the meat) and let the pot do all the work. I also left out the garlic as one of the priests gets indigestion from it. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ania"
},
"reviewBody": "The more meat you add the better! Just like Babcia used to make. I also add 1cup of chopped prunes. Love it! The longer you cook it the better. Cooling it off and warming it up again for a few days, makes the flavors better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ryan Lorek"
},
"reviewBody": "Taste fine, not too hard to make. Has a very strong flavor that's definitely not for everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jan Colton"
},
"reviewBody": "Um, it's a very generic, salty dish that doesn't bear much of a similarity to the Polish hunter's stew, contrary to what others wrote below. As an authentic bigos, it should at least have 2 chopped green apples, a couple pounds of venison, shredded ham instead of bacon and pork, a couple of cubed potatoes, and no sauerkraut. You need to have a thick, rich, beautiful brown base. Napa cabbage should replace the sauerkraut so that it cooks down and soaks up the flavors, instead of making it salty. There is no \"one\" recipe for bigos, but it is a hunter's stew and it should be meaty and rich...and shouldn't be salty. This is a recipe for kiel and sauerkraut, not bigos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monisia25"
},
"reviewBody": "This recipe is delicious. I omitted the pork (because I didn't have any) and it turned out great. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SBATES26"
},
"reviewBody": "My family and I thought this recipe was amazing. This is a wonderful and flavorful dish. I'm Polish and had never had any recipe like this, so it was a pleasant surprise. It had all the ingredients we love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martina Stroupe"
},
"reviewBody": "I am polish and this was great! I did not bake it but just let it cook in one pot, the way my mom makes it and added a little bit of shredded apples to it. Served it at a Christmas party and it was a big hit! Thank you for submitting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BASIAKAL"
},
"reviewBody": "Yup, this is the authentic Bigos! The longer you cook it, the better, and it gets better after a day or so in the fridge. It's a labor of love! Getting dried mushrooms is a bit tricky. Look up \"dried polish borowiki\" on the internet and you can find several mail order sites. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa Zurek"
},
"reviewBody": "My hubby is polish and I am mexican. I have been trying to make him polish food for a while. When I told him I had found this recipe he went out and bought sauerkraut, ready to make it the same day. I made it for dinner last night. He kept raving how good it was. I was surprised, it was absolutely delioucious. I made it to the T, perfect the way it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DESIDERATA"
},
"reviewBody": "My exhusband is from Poland and made this often. I have made this recipe several times now and my sons say its better then their fathers. I followed the directions exactly the first time. Now I don't coat the meat. I just throw it all together on top of the stove at first browning the meat and then adding everything. I also use a bag of shredded coleslaw mix instead of chopping a carrot and cabbage. Works great! I just throw pork, beef or chicken in. Whatever I have or is on sale. I've never had this recipe turn out bad. We love it at our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoseRover"
},
"reviewBody": "Good recipe. A previous roommate of mine was Polish and made a variation of this often. Great on cold winter days with fresh bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I had to make a few changes due to personal preferences, and what I had on hand (I'll be honest, for me, the days of making a special trip to the store to buy ingredients I may or may not use again are gone). I made this with turkey kielbasa, light beer instead of red wine (I actually think this turned out really well), and a mixed Italian herb blend. Also, I omitted the caraway seed and the celery as we aren't huge fans, and I didn't bother with the tomato paste as I didn't want to open a whole can just for a couple of Tbsps. Even with these changes, it turned out great - hearty, filling, with plenty of leftovers for Husband's lunches this week. If I were to make it again, I would probably just use chunks of cabbage. The sauerkraut was a bit stringy, and didn't contribute much flavor. Some diced potato wouldn't hurt either. Thanks!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/138131/bigos-hunters-stew/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17048/soups-stews-and-chili/stews/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/138131/bigos-hunters-stew/",
"name": "Bigos (Hunter&#39;s Stew)"
}
}
]
}
}
, "about": [
]
}
]