				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Biscochitos Traditional Cookies"
,"datePublished": "2020-06-18T23:12:26.000-04:00"
,"dateModified": "2022-10-13T15:20:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "Biscochitos are a classic Christmas cookie in New Mexico. These delicious anise-flavored shortbread-like cookies are dusted with sugar and cinnamon."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GUcfNGAu_JLNREeaM4m6Oj-DqJs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1786717-2463be01caa74a7d95dfdb9aa3308c28.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Biscochitos Traditional Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "88"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "113 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "24 mg"
,"sugarContent": "5 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"6 cups all-purpose flour",
"1 tablespoon baking powder",
"0.25 teaspoon salt",
"2 cups lard, softened",
"1.5 cups white sugar",
"2 teaspoons anise seed",
"2 eggs",
"0.25 cup brandy",
"0.25 cup white sugar",
"1 tablespoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Sift flour, baking powder, and salt into a bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat lard and 1 1/2 cups sugar together in a large bowl with an electric mixer until smooth. Add anise seed and beat until fluffy. Stir in eggs, one at a time. Add brandy; stir in flour mixture to form a dough."
} ,{
"@type": "HowToStep"
,"text": "Roll dough with a floured rolling pin to a thickness of 1/4 or 1/2 inch. Cut dough with a fleur-de-lis cookie cutter, or other simple shape. Place cookies onto ungreased baking sheets. Mix 1/4 cup of sugar and cinnamon together in a small bowl; sprinkle over cookies."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the edges are golden brown, about 10 minutes."
} ]
,"recipeYield": ["72"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Brethour"
},
"reviewBody": "Absolutely delicious! I've lived in New Mexico for 22 years and have had many dozens of others' biscochitos over the years, and so I decided to try making some myself, and found this recipe. Since I don't have lard on-hand and my stores here seem to have only 5 lb buckets of it, I tried refined coconut oil instead. It's about the same consistency as lard, too. The result was absolutely incredible. I don't think the switch hurt at all. I made a second batch where I doubled the amount of anise seed, and there were better in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Trujillo Frank"
},
"reviewBody": "My Great Aunt, who always made these for Christmas never passed down the recipe. But these were as good as hers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara J Behrens"
},
"reviewBody": "I used butter, not lard and orange juice instead of the brandy and they were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Gillespie"
},
"reviewBody": "This is the absolute best recipe if you can't get one from your abuela. Translates well to gluten free if you use Cup4Cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Martinez"
},
"reviewBody": "Great recipe for these. Tried different recipes and this one is the best so far!! Will be using it again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Wyss"
},
"reviewBody": "Made a half batch. Simple and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivyana Gonzalez Josiah"
},
"reviewBody": "They came out perfect. Tender, and perfect for dunking in milk!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBIN PREDDY"
},
"reviewBody": "I'm from New Mexico and this recipe is very close to the cookies we had there at Christmas and special occasions. The anise flavor was a little light to me, I will double it the next time. I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Simone Stowe"
},
"reviewBody": "You can substitute shorting for the card and use orange juice for the Brandy. It's not Christmas without these cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LindaandYves"
},
"reviewBody": "dough was dry and kept breaking while being rolled. Once they were baked they were dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jencancook"
},
"reviewBody": "I made this recipe with one addition. I added I teaspoon of liquid anise extract. They came out delicious! I’m a native New Mexican having grown up on biscochitos, these cookies really bring back memories. You must use the lard and brandy in order to preserve the texture and flavor if you’re going for “tradition “."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Iza Belle"
},
"reviewBody": "Very close to New Mexico's traditional cookie I grew up with. Biggest change was adding more Anise! I made two different batches and doubled the Anise in my second batch and it was much improved. I might even try adding more next time, to see what the true amount should be. I used lard in one batch and shortening in the other. Lard has a distinct smell and taste, but honestly you be fine using either. Don't skip the liquor, brandy or whiskey are great options. The dough is rather dry, it's a simple fix. I slowly added a few TBSP's of milk (you can probably us any unflavored liquid) until it got to the consistency it needed to be. Fun traditional New Mexican wedding and Christmas cookie! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Aragon"
},
"reviewBody": "Very simple recipe and wonderful tasting !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndi Moreno-Nieuwenhuis"
},
"reviewBody": "It’s just like my mom/grandma/aunts used to make growing up!! Although I used port wine instead of brandy because that’s what I remember my mom stating years ago. Will definitely save this recipe!! LOVED how they turned out!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anita Rocha"
},
"reviewBody": "I made these both with lard and second batch butter. Sent to my husband's work all from new mexico didnt tell which butter won. Also made with kaluha it was perfect. Although they were dry added kaluha till right consistency. I have made them several times. Covered with chocolate and white candy big hit. Recently rolled with small Reeses peanut butter cup. Yum oh and covered them with candy too. Love to kick it up a notch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Trujillo"
},
"reviewBody": "I made them with gluten free flour and xanthem gum. They turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Bussey"
},
"reviewBody": "This recipe makes biscochitos. They taste like biscochitos. What more can be said. Biscochitos FTW"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mt7505"
},
"reviewBody": "This is a great recipe. I actually followed an \"authentic\" recipe from New Mexico prior to making this one. Hands down this one was way better. I did crush the anise seeds with a spoon. I pressed them 10 times. This made the anise flavor stand out a bit more. Also, I didn't have brandy so I used orange juice. They came out light and crisp. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLM"
},
"reviewBody": "Great recipe. I add peach liquor to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yosemite Garcia"
},
"reviewBody": "One word...DELICIOUS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristina Danks"
},
"reviewBody": "I made this for a group of native New Mexicans for a birthday party (I'm from Ohio), and they ALL said that these were the BEST biscochos they have ever had!! I half way melted the lard, used orange juice instead of brandy, used 1 tablespoon of anise extract, and rolled the dough in cinnamon sugar before baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Cordova Thompson"
},
"reviewBody": "This cookie was the ONLY cookie my mom made when I was growing up. She's from New Mexico and she made them with both love and pride for her culture and her heritage, so they were a BIG deal. She made them with lard and E&amp;J Brandy, and without a written recipe, so when I wanted to continue on with the tradition, allrecipes.com was my first stop. I've made this recipe so often, and it's always been a big hit. I started selling them by the dozen at community craft fairs and such and they always disappear. I use plain Crisco. I increase the Brandy to 1/4 C plus 1 Tablespoon. This dough is a dry dough, so it helps to keep it a little more moist when rolling. Do not flour your surface before rolling, only dust your rolling pin often. I also increase the anise seed to a Tablespoon. I roll out to a 1/4 inch as they grow up and not out while baking. Any thicker and you'll end up with a biscuit. I increase the baking temp by one minute or they are too delicate. Delicious recipe. Happy baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "malibu"
},
"reviewBody": "My husband spent part of his childhood in NM so these are made annually. This is by far the best recipe that I've found. KEY to successful biscochitos is LARD and GOOD Anise seed! OOPS and don't forget the brandy! The dough is soft but rolls out fine. Do not add more flour! (I was tempted)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jen Leeann"
},
"reviewBody": "the dough was dry and i had to add another egg and water to get the dough to stick. will not use again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "Love these cookies. I used vegetable shortening instead of Lard and ground Star Anise (1 1/4 teaspoons) instead of the anise seeds. They turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Hart"
},
"reviewBody": "Have made these twice to rave reviews. They are a not too sweet shortbread type cookie and the anise flavor is very subtle. I did use Crisco instead of lard but didn't consider that too much tampering of the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La Pinta Negra"
},
"reviewBody": "Coming from a Hispanic background, Bizcochitos are a holiday must. We have used this recipe for years with regular flour and the cookies are a no fail. However, we are gluten free due to inflammation and digestive issues. I was worried but used a good gluten free flour on a one to one exchange and had the same wonderful results. I did learn, however, that if you beat/mix the cookie dough too long that the cookies come out crumbly and dry. This recipe is basically a shortbread recipe and the cookies should be dry but not crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alyse Carpenter"
},
"reviewBody": "I was born and raised in Albuquerque, New Mexico. They are not traditional shaped like that they were rolled out and cut slices into one side and roll them into the cookie forming little hoops, then baked. The cookies are supposed to almost melt in your mouth. Delious recipe, not correct shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "I had never heard of biscochitos (I am a NM transplant) but was asked to make some. Searched here and found this recipe....followed it exactly as written except I subbed orange juice for the brandy. DELICIOUS!!!! So easy...turned out perfect from the first batch to the last (I made 4). This is now an annual tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally's OneOpinion"
},
"reviewBody": "I use solid coconut oil instead of lard, one gets the same texture as lard. Then I share with my healthier family and friends. Also the thinner roll makes for a better dipping cookie (in milk or coffee). Reduce baking time if thinner cookie is desired. Fantastico!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "So, my daughter leaves for school at 8:00 this morning, then texts me at 8:30 telling me she needs to bring a treat for her Spanish class today for \"cultural day\". I whipped up a half a batch of these, using half butter/half Crisco and OJ for the brandy. Nice little cookie, with just a hint of anise flavor. She was very happy when I dropped these off during her lunch period with a printout of the cookie's origin, thanks to Wikipedia!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LUCKYCHANCE"
},
"reviewBody": "just like grandma/mom used to make, i now see why mine are different, i use shortening, still good but i bet the lard is the magic ingredient. i also used spiced rum, it's what i had on hand, i think my mom used port wine? regardless, these always bring back the most wonderful memories, i want to cry when i taste the first cookie, takes me back to my mothers kitchen as a little girl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "les2788"
},
"reviewBody": "Came out amazing followed it exactly only it felt a little to crumbly at first added just a tiny bit of hot water to help gather a ball to roll! But they came out exactly like I expected they way I know biscochitos taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kari"
},
"reviewBody": "Too dry, bland, not tasty at all. Minus 1 star. Will not make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PharmDJD"
},
"reviewBody": "I've always wanted to be able to make biscochitos like a family friend made when I was a kid, and as soon as I smelled this dough, I knew this was it! To match my memories I used cream sherry instead of brandy, and 1 teaspoon anise extract instead of whole anise seeds. I also rolled the cookies in cinnamon/sugar while they were hot to get the texture and appearance I was looking for. Otherwise, I followed the recipe. They were AWESOME and just how I remember them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "es3153"
},
"reviewBody": "Very dry, think it might be too much flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Thames"
},
"reviewBody": "I did not have any Brandy in the house ~ so I used instead 1/2 C.of red wine plus 1/2 C. of fresh squeezed orange juice (these ingredients are common variations to traditional biscochito recipe's instead of using Brandy), also I used Butter Flavor Crisco instead of Lard and they turned out really good! I have used Lard before and as I live in N.M.that might be the preferred old fashioned way to do it (which I have) but I think the Butter Crisco gives them a lightness in the batter. These cookies get dusted with cinnamon/sugar before AND after baking - cooled on a wire rack - I would highly recommend this recipe -I only tweaked it slightly but this recipe is A KEEPER!! Great Dunkers in coffee OR milk =]\nP.S. I DID sift the dry ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Olsen"
},
"reviewBody": "These were very good! I used 1 tblsp brandy flavoring and used milk to make up for the rest of the liquid from the lack of brandy. I also added a little more anise because I know I like my biscochitos a little more anisey! :) Took me back home to Albuquerque!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMYSVP"
},
"reviewBody": "I am a vegetarian so i didn't use lard - i used butter instead and orange juice instead of brandy. they are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I'd actually rate these closer to 5 stars if I made them with lard, but I just don't like the smell of lard, so I used shortening instead. As a native New Mexican, biscochitos mean Christmas to me. I never really knew how my grandma made her version, but these are pretty darn close. Delicious recipe- thanks for sharing! My only piece of advice is to not overwork the dough- biscochito dough is supposed to be crumbly and this one is- it seems like it needs more liquid, but don't add it- the crumbly dough leads to flaky delicious cookies. Also, I rolled mine in the cinnamon sugar after baking since that is what my grandmother always did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Grothe"
},
"reviewBody": "These were yummy! I didn't have brandy so I used whiskey instead. The lard gives a distinct flavor. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheCattlemansWife"
},
"reviewBody": "Made these for my son's baptism - wonderful! I used rum instead of brandy and 2 teaspoons of anise seed extract. I coated cookies in cinnamon/sugar before and after baking. You must make the cookies very thick, otherwise they will crack and break while you are coating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "This is the same recipe I have used for 12 years now. Everyone loves them. One thing I do different is I put 1 or more cups of sugar in a shallow container with cinnamon to your liking and as I cut I put cookies in the mixture and give them a good dusting. You'll never go wrong with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DUGirl05"
},
"reviewBody": "Very yummy but my batch was a little dry/crumbly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Gurule"
},
"reviewBody": "Wonderful!!! Thank you Becky for the great recipe, these taste just like my grandma's cookies. instead of brandy i added vanilla with no anise seeds, and they tasted identical to hers. Again thanks for the recipe :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "akarpins"
},
"reviewBody": "These cookies were very good. Can't stop eatting them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CiaoHound"
},
"reviewBody": "DELICIOUS! I'm Latina... these cookies bring back memories of baking at Xmas with my Grandmother! A couple of suggestions: (1) Melt lard in the microwave before mixing it with sugar.... it keeps the dough more moist when rolling; (2) Use 1 Tablespoon of Anise Liquid instead of seeds; (3) at Xmas, coat w red &amp; green sugar sprinkles instead of sugar &amp; cinnamon; (4) Use bread flour instead of all purpose flour &amp; ALWAYS sift it; (5) NEVER substitute Crisco, butter or Vegetable Oil for the lard. Notes: #2 - I don't like licorice but love these cookies. By using anise liquid instead of seeds, the taste spreads thru the cookie &amp; isn't as overpowering! Even my Mexican family prefers them over my grandmother's own recipe with anise seeds! #4 -- Bread flour helps keep the cookie light like shortbread instead of dense &amp; heavy. I have used wheat flour &amp; it doesn't change flavor just texture. Don't forget to sift the flour as this too helps keep them light &amp; flaky. #5 -- I know I know, the lard has 10,000 calories &amp; it's all fat! But, the cookie is supposed to be flaky &amp; a light shortbread consistency; you lose that texture with other shortenings &amp; they become heavy &amp; dense. I try to eat healthy &amp; use Canola butter, wheat flour, splenda in recipes but this isn't one of them that works with substitutes. Eat them once or twice a year guilt free then get on the bike &amp; do some cardio. Trust me, after 46 years of eating these cookies, you won't regret the indulgence!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattiwithani"
},
"reviewBody": "Excellent cookies. Family and co-workers couldn't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "300020001000"
},
"reviewBody": "I made these for my son cause he is doing new mexico as his state project we loved them! We used shotening we haven't used lard yet, is it better? but they are still great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mmhmm"
},
"reviewBody": "I used crisco instead of lard, and these cookies were so DRY! The only thing that saved them was the massive amount of cinnamon-sugar. I don't want to give them a bad rating, though, because I didn't follow the recipe exactly. We've got a vegetarian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mamaby"
},
"reviewBody": "The dough came out very dry and so did the cookie. I made two batches, just to make sure I hadn't messed one up and the result was the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mollykathrynlewis"
},
"reviewBody": "A little dry, but I loved the anise seed and cinnamon taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these for my family but no one liked them because of the licorice flavor. Made a second time without anise seed and with pineapple juice, and rolled them into balls before baking because I just don't have the counter space to roll out dough. They were gone before the oven was cool. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cruzmom"
},
"reviewBody": "SIMPLE, QUICK &amp; DELICIOUS! These were lovely. I whipped them up to take with us on an outing. I never knew lard-based cookies could taste sooooooooo good!. My family loved them. I cut up my dough with a pizza cutter to save time. But I got my daughter to roll them in the cinnamon sugar when they came out of the oven. I will make these again. GREAT RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMH"
},
"reviewBody": "Im Happy to see someone finally have this recipe with lard and not butter or just shortening, the way its supose to be made. I have awesome memories of making these with my grandmother ( no rum ) lol I love it! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lina"
},
"reviewBody": "This recipe brought back memories of my grandmother! I loved them. They tasted just like the ones she made for us as children. My grandmothers recipes is almost exact except for a couple small details. Her recipe used only 1 C of sugar, and she used 3 eggs. She also used orange juice (I like to use OJ) or whiskey for the liquid. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mellie"
},
"reviewBody": "I am giving this recipe 4 stars because of the ease and the basic ingredients used. The cookies were quite good, the directions were clear and concise and the baking time was spot-on. However, I did not give them 5 stars because they are definitely not **quite** authentic. My sisters and I made these cookies to include in my welcome baskets for the guests attending my wedding in Santa Fe, NM and the recipe we used had about 15-20 ingredients and the cookies were MUCH more authentic tasting. I did not have most of the ingredients on-hand (or the time or desire!!) to duplicate that recipe. This is an easy, very quick recipe that will give you good results but is missing just a little **something**."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DRIQFX"
},
"reviewBody": "These weren't exactly like Grandma used to make, but they did take me back. Next time I'll add more anise. The dough got rather crumbly so I had to keep adding butter. This recipe's a keeper~~~I'll just tweek it to make it my own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Proud Mom of 6"
},
"reviewBody": "Very happy go come across this recipe.\nMy Grandmother use to make Biscochitos when all us grand kids were little.\nI made them for my kids and they fell in love. I will be making them again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OneofTwoMoms"
},
"reviewBody": "Made these for my partner who was is a New Mexico transplant. She couldn't wait for them to cool before she was eating them. She claims they are totally authentic. The only suggestion would be to dip the cookies in cinnamon &amp; sugar (liberally) after they come out of the oven - as soon as cool enough to touch. Otherwise...perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Giles"
},
"reviewBody": "My mother has been making these cookies all my life - it wouldn't be Christmas without them! We have always used small (1 inch) cookie cutters in various shapes. We put the cookies in a bowl filled with cinnamon/sugar and then put them on the baking sheet - then back in the sugar when they come out of the oven! My family eats them like popcorn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMMA37"
},
"reviewBody": "I made this for a hispanic friend of mine. She never said how they were so.....\nMy husband thought they were good.\n\nUpdate: My hispanic friend said these were wonderful! She said they brought back memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2angelsmommy"
},
"reviewBody": "These are as good as my sister-in-laws SECRET RECIPE that she won't give out. My husband loves biscochitos and these won him over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Loved these cookies! Never heard of them until I was having a 1/2 way to Cinco de Mayo party and was looking at recipes. Will definately make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKLaura"
},
"reviewBody": "Very good sugar cookies with just a hint of licorice flavor! I couldn't find lard so I used butter instead and they still turned out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "usmcwf22"
},
"reviewBody": "Well, first off: Never send a man to do a womans job. :p My husband bought All Vegetable Shortnening instead of lard. Still, they came out DELICIOUS! I was told they come out better w/ lard, so i'll use that next time. Also, I used brandy, not pineapple juice like another suggested, but I did use PJ to moisten up the dough when needed. THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margot D. Cordova"
},
"reviewBody": "This recipe is the best. My Grandmother used to make me these cookies as a little girl. The only difference to the recipe was she used ( pineapple-juice)instead of (brandy). She would roll the cookies in the sugar &amp; cinnamon when the cookies were still hot. Thank You VERY MUCH."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am glad I came across this recipe. I made about 4 dozen of these cookies they where delicious. Everyone loved them for the holidays they went great with hot chocolate or coffee!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/88027/biscochitos-traditional-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17425/us-recipes/us-recipes-by-state/",
"name": "U.S. Recipes by State"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1763/us-recipes/us-recipes-by-state/new-mexico/",
"name": "New Mexico Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/88027/biscochitos-traditional-cookies/",
"name": "Biscochitos Traditional Cookies"
}
}
]
}
}
, "about": [
]
}
]