				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blackberry and Blueberry Pie"
,"datePublished": "1998-04-06T17:20:13.000-04:00"
,"dateModified": "2022-07-14T17:40:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Debbie Sanchez"
,"url": "https://www.allrecipes.com/cook/24322700"
}
]
,"description": "A wonderful taste combination, this terrific pie can be made in the summer with fresh berries and in the winter with frozen ones."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/k0H6aByHEjygJzoP5fhsmLI9S8s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3706911-332141df2c594f65afb2a4a659a60b42.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2347116540001",
"description": "See how to make a fresh two-berry pie from scratch.",
"duration": "PT5M29S",
"name": "Blackberry and Blueberry Pie",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/1bd8683e-46f0-497c-9264-e8d9d7d9e9e5/df2c7aff-a44b-41b0-a5d6-b0b100850a71/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T09:50:55.062-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blackberry and Blueberry Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "223"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "436 kcal"
,"carbohydrateContent": "60 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "4 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "313 mg"
,"sugarContent": "27 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.66666668653488 cup shortening, chilled",
"2 cups all-purpose flour",
"1 teaspoon salt",
"5 tablespoons cold water",
"0.75 cup white sugar",
"0.33333334326744 cup all-purpose flour",
"0.5 teaspoon ground cinnamon",
"4 cups fresh blueberries",
"1.5 cups fresh blackberries",
"1 tablespoon lemon juice",
"2 tablespoons butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cut shortening into 2 cups flour and salt until the shortening is the size of small peas. Sprinkle in water 1 tablespoon at a time until flour is moistened. Gather into a ball, wrap with plastic, and refrigerate at least 30 minutes. Divide the dough in half and roll out half on a lightly floured board. Line a 9-inch pie dish with the pastry. Roll out the top crust and set aside."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix sugar, 1/3 cup flour, and cinnamon. Stir in berries to coat. Pour the filling into the pastry-lined pan. Sprinkle with lemon juice and dot with butter. Cover with top crust; cut slits in the top to vent the steam. Seal the crust and flute the edges."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/k0H6aByHEjygJzoP5fhsmLI9S8s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3706911-332141df2c594f65afb2a4a659a60b42.jpg"
}
]
,"text": "Cover the edges of the crust with foil to prevent over-browning. Bake in the preheated oven until the crust is golden brown and the juices are bubbling, about 45 minutes. Remove foil during the last 12 minutes of baking."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer Puente Malak"
},
"reviewBody": "Dough for crust would not hold together when forming a ball. I compared this recipe with others and found that it omitted 2 tbsp of shortening. It would have been helpful to have that extra!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby Rosales"
},
"reviewBody": "It was so easy, but I grabbed the first glass dish and it was a round cake pan but it still came out great! This recipe is going to be used many times! Thank you very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Regan"
},
"reviewBody": "I did an all blueberry pie using 2 cups fresh and 4 cups frozen. I was worried it would be soggy but the recommended 2 tablespoons of starch fixed that perfectly..i used a store crust so I cant comment on the but I do agree that 1 full cup of sugar is necessary..i thought that was suggested due to the blackberries so I didnt add more because i had just the blueberries but even still it couldve used the extra 1/4 cup. It still was yummy with ice cream but alone it isnt very sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jem"
},
"reviewBody": "Used the filling recipe as inspiration with few tweaks:\n-Used 2 cups of frozen blueberries, Which I cooked down on the stove for about 10 minutes with 1/2 cup sugar\n-Added 2 cups of fresh blueberries, 1/3 cup of flour and 1 tbsp cornstarch after taking it off stove. Then added do use of all the lemon and the zest\n-Blind baked the crust, but did a quick coat of beaten egg white to keep the crust nice and crisp\n-Added the billing with the butter and cooked at 375 for 30 minutes. \n\nThe pie with full set in the oven. No runny juices"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "I used a premade crust so cant review that part of the recipe. For the filling I opted to use raspberries instead of blackberries. After reading reviews I decided to add 2 T. of cornstarch with the other ingredients. The result was a tasty pie. I used fresh berries and my pie was at room temp and still had runny filling. We loved it so I will try it again next time will add more cornstarch or flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Criswell"
},
"reviewBody": "I made two of this recipe. One with store bought crusts and one with homemade. There was no difference between the two except for time spent so I would recommend going with store bought. I made one using brown sugar instead of white and it was much more flavorful. Great, easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "Best pie ever! I have cheated and used premade crusts and it is still so good! I like to use cookie cutters to cut out the top for a fancy look."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goat’s Mom"
},
"reviewBody": "The pie was delicious very easy to make everyone loved it great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Miller"
},
"reviewBody": "Great pie filling recipe! I used a different crust (French pastery pie crust on this website) but the filling is perfect. I also switched the boysenberries and blueberries so the pie was 4 cups of boysenberries instead. Came out great! I did use frozen berries and had to drain the liquid out some when the pie was done but it was no big deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharirus"
},
"reviewBody": "Absolutely delicious ( I did make my own pie crust recipe though ). I have never had a blueberry and blackberry pie and I don't think I will ever just have blueberry again. So rich, thick and lots of deep flavour. Instead of cooking the fruit in the pie and worrying about it being to thin, I thaw the berries in a sauce pan, add the sugar, salt, cinnamon, lemon juice and butter. Then when it gets hot I add the flour and cornstarch and mix until it is thick. Then I add it to the uncooked pie shell and put the uncooked pastry on top on and bake till browned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Del Marie Middleton-Shields"
},
"reviewBody": "ABSOLUTELY FABULOUS\nI did let my mixture sit and soak up the sugar before pouring into crust\nStarted eating it before taking a picture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Ginsberg Rowe"
},
"reviewBody": "Best pie I ever made!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carm Moscarello"
},
"reviewBody": "I loved the berry combination in this pie but found it was way too juicy. My berries were more sour after baking in this pie than they were originally. I baked it for several hours to try to thicken it then resorted to spreading flour on top and baking some more. The result was a chore to eat it did thicken. I will always add cornstarch as other reviewers mentioned to any pie I make again but I will not be getting any requests and will not be making this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bob Thompson"
},
"reviewBody": "no"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MountainLovinGal"
},
"reviewBody": "This was a really good tasting pie that I served to guests -- and got rave reviews. I cheated and used Pillsbury pie crusts -- they worked well with this recipe. I used 2 cups blueberries, 1 cup Red raspberries &amp; 1 Cup Black raspberries. I omitted the lemon juice. I folded in 1/4 C. of flour to mixture and let it sit 15 minutes prior to filling the pie shell. No runniness! As others have done, I used 1/2 white &amp; 1/2 brown sugar. I even added a 1/2 tsp. of vanilla -- makes the flavors pop. I served with both real whipped cream &amp; good quality vanilla ice cream. I'll make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kare Smith"
},
"reviewBody": "I usedi refrigerator pie dough, it otherwise followed the recipe &amp; it was a huge success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Nygren Coburn"
},
"reviewBody": "Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyryden"
},
"reviewBody": "I love all my recipes I've saved but cannot get back on all recipes. What happened"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathi Ringue Mattea"
},
"reviewBody": "Made this tonight. I had frozen blackberries from this summers foraging, and frozen blueberries from costco. The only difference is I probably used equal amounts of blue and black berries and somehow misread and only added 1/2 cup sugar instead of 3/4 cup. Still just fine. Thawed and drained my berries.... Pie set up beautifully. :D THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aya.M"
},
"reviewBody": "I had a hard time making it but turned ok. I think i put too much water since i put 9 tablespoons of water instead of 5. So it turned out hard. I shouldv'e put more butter. Also a potato masher would be great for this recipe instead of a pastry cutter. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Bogasch"
},
"reviewBody": "I have made this several times and love it! A favorite dessert during the berry season. I have used both fresh and frozen berries. If you are nervous about a lattice top crust, it's find with a normal rolled out top crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wendyBB"
},
"reviewBody": "This recipe doesn't make enough pie crust. I will either use my own crust recipe next time or increase this recipe. I prefer blackberries to blueberries because they're more flavorful, so I made my pie with equal berry proportions and received many compliments on the taste. I added 1 t. cornstarch as other reviewers suggested and was pleased with the resulting filling consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Lynne Hudson"
},
"reviewBody": "SO GOOD! The filling comes out great, but it could use a little less flour. It was a tad dry, but I used fresh blackberries that I picked off the brier patch. I also drained them it might not be so dry if I hadn't have drained them. Even though it was dry it was delicious warm and with some ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Lovetro"
},
"reviewBody": "delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dimples"
},
"reviewBody": "My husband made this dessert last weekend. But there was a problem. It was gone the NEXT DAY! YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annabelle10"
},
"reviewBody": "very good. I used my own pie crust recipe, and added about 5 TBSP. cornstarch-- but otherwise followed. very good and got great feedback from family. will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NewCooker520"
},
"reviewBody": "The pie crust was difficult to make, and I made this pie twice already. I figured, since it was my first time making crust ...it would be difficult, but it was just as hard the second time around. It was a good filling, but did not use all the sugar needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hugh B"
},
"reviewBody": "I didn't change a thing, the crust was flaky and the filling perfect. I used some Blackberrys from moms ranch and some blueberries from the oregon coast. I did lightly brush on melted butter and a light sprinkle of sugar to finish it off ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules921"
},
"reviewBody": "I have made it a couple of times and and it always is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene Brandt"
},
"reviewBody": "I tried this recipe using my own pie crust recipe. I used 3 1/2 c. blackberries and 2 c. blueberries and added about 1 1/4 c. sugar, as the blackberries needed more than the blueberries do. I also added about 1 tbsp. of quick cooking tapioca. The filling was not too runny or too thick; just about right. Instead of baking it for the entire time in the oven, I baked it at about 80% power in the microwave for 10 min. first, while the oven was heating, then finished it for 10-12 min. at 425 degrees in the oven. This prevents the crust from browning too much. The microwave baking time equals about the same as 30 min. in the oven for 10 min. in the microwave. I've done this with other fruit pies in the past, and it saves heating up the kitchen too much also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saresco"
},
"reviewBody": "This being summer I used fresh fruit. Blueberries, blackberries and sliced strawberries made for a delicious pie! I put an extra cookie sheet on the bottom rack underneath the rack that had the pie (on another cookie sheet) on it. Glad I did because it bubbled quite a bit as it baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassychef"
},
"reviewBody": "Delicious recipe that everyone in my family loved. I did not end up using the crust part of this recipe, however, the filling was fabulous. I used frozen berries that we had previously frozen. Thawing them under warm water, I dried them with a towel before putting them in with the rest of the filling. Excellent flavor. I think I would use a little less sugar next time just to match my tastes. I also think we would use just blueberries and maybe try other types of berries too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "saucysusie"
},
"reviewBody": "I followed the recipe, but also took note of some other reviews, adding 2 tbsp. corn starch, increasing sugar to 1 C, increasing the number of berries (4 C fresh black, 2 1/2 C thawed blue), and adding lemon zest and juice. I also took out the butter and brushed the top with beaten egg (instead of milk) and sprinkled with sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOYCE_NIELSEN"
},
"reviewBody": "My family loved the flavor of these two berries mixed together. While I picked fresh blackberries and blueberries this summer, I froze them to use as needed. They worked fabulously in this pie. I also used the corn starch another reviewer suggested to ensure the filling thickened properly. I've made several of these pies this fall, and my family is asking for this one for Thanksgiving dessert, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tmcg"
},
"reviewBody": "This turned out perfect with a couple of alterations. I have made many berry pies now and found that all turn out a little runny unless I cook down the berries whether fresh or frozen. Here's how I did this recipe: Added berries to pan on medium heat with sugar, lemon juice, cinnamon, ginger, and cardamom (depth of flavor) and added 2 tsp. water to 2 tsp. cornstarch or flour. This step thickens the berries and prevents too much juice. I waited for the berry mix to cool then and added it to the pie crust to bake. It made the perfect pie! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corabael"
},
"reviewBody": "We used the Crisco crust recipe, which is almost identical to this one. I used fresh berries, and followed the recipe almost exactly. We wanted raspberries in our pie, so I did 3/4 cup blackberries, 3/4 cup raspberries (with the listed amount of blueberries). I also added a little more sugar and skipped the lemon. We also sprinkled some maple sugar I happened to have on hand on top of the crust after we pulled it out of the oven which really added a lot to the final product. Okay, so maybe we didn't follow the recipe all that exactly. :-) But I didn't see the recommendation to add cornstarch until afterward, and I'm actually kind of glad I didn't. We served it still warm, but it had jelled nicely and tasted absolutely delicious. It was a little gooey but I thought the texture of the filling was perfect. I wouldn't have wanted it more firm. The whole family (except the one member who doesn't like berry pie) gobbled it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spapsdorf"
},
"reviewBody": "This rating is for the filling only! Very good and gooey, not too sweet. May add more blackberries next time to balance the berry flavor more. We used the French Pastry Pie Crust recipe on this site for the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patti jo"
},
"reviewBody": "Absolutely the yummiest! Used already prepared pie crust (Pillsbury) (because no matter how hard I try to make my own crust, it just turns out awful!). Anyway, I used about a 1/4 cup flour, and instead of cornstarch that I saw a lot of cooks used to firm it up, I used tapioca: 1/4 cup as recommended on the box back for a plain blueberry pie, &amp; it wasnt' runny at all. And I used the full 1 cup sugar--the blueberries around here are kind of sour this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anbhean"
},
"reviewBody": "I like this a lot, as did my family. Our only modification was that we used our favorite pie crust as opposed to the one suggested (just what we always do because we have the best crust recipe ever!) As far as runny pies go, I saw on another recipe that you should turn the oven off when the pie is cooked, crack the door and let it sit for an hour to aid with thickening. Worked like a charm. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "moosette"
},
"reviewBody": "Got rave reviews when I made for a work-related bbq party! Despite having to substitute a few ingredients (not enough time to go to the grocery store) it tasted really good. Besides substituting strawberries for the blackberries, and butter for the shortening, I added a tablespoon of corn starch based on other reviewers. I can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CKR"
},
"reviewBody": "This pie was simply delicious (my guests thought so as well). I added 2 tbsp cornstarch as per other reviewers and it was perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindyPett"
},
"reviewBody": "Great recipe! Got instructions for the lattice top from betty on youtube"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melissa.hunt31"
},
"reviewBody": "I liked the base of this pie but I decided to make it more of a mixed berry pie and used blueberries, blackberries, raspberries and strawberries. I stuck with my usual crust recipe (per other reviews) and used cookie cutters to make a decorative crust (this one, for Christmas)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anahi"
},
"reviewBody": "A little runny but great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chantelle Kadlec"
},
"reviewBody": "Very good--I've made other blue-black pies that weren't as good but I did add 1 full cup of sugar. I also made this with frozen berries but it was still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Corrina"
},
"reviewBody": "The flavor was good, the crust was good, the only thing I should have done was thaw out the frozen berries before using them--it turned out too runny even adding a TBS. of cornstarch in addition to the flour. But, that was my fault, otherwise, excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "Excellent way to enjoy both tastes of blackberries and blueberries. Would add more stars if possible"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vtgrumpy"
},
"reviewBody": "I've been making this pie for several years now and have always enjoyed it. We will use fresh berries and adjust the ratio depending on what's available. Use Arrowroot and the pie will not be runny, it is an acid stabile starch. These pies also freeze well, we will make 6 or so every summer and store in the deep freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "Made this pie as a cobbler, for Father's Day it was a hit everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maureen"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri S."
},
"reviewBody": "I used a pre-made pie crust, didn't have enough blueberries so supplemented with blackberries and added about a tablespoon of cornstarch. The pie was good though I'll probably try a different berry pie recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Buescher-Hill"
},
"reviewBody": "This was my first-ever homemade pie. It was so delicious I made it twice in 2 weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JARRIE "
},
"reviewBody": "I used a storebought crust and made a streusel topping for mine, so my rating is for the filling only, which was quite good. It didn't really set up thick enough for me, and I followed the recipe as stated for the filling. This isn't a problem except it makes it not plate well, so I'm glad I gave this a test run. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "firstdibbs"
},
"reviewBody": "did not like the crust but the filling was really good! I'm not a huge fan of blackberries, so I'm sure that didn't help but my husband liked the pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mieu"
},
"reviewBody": "I did not use the crust recipe so I cannot comment on it. To sum up the discussion on using frozen berries: If you are using frozen berries, either don't drain so much juice and add the flour or cornstarch, or drain ALL the juice and DON'T add the flour or cornstarch. I drained all the juice and added the thickeners and it was way too thick. However, the sweet/ tart flavors of this pie was just right and adding the ground cinnamon as well as nutmeg wouldn't hurt (I used a combination of ginger, nutmeg and cinnamon, leftover from making carrot cake) and it turned out alright :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "little t"
},
"reviewBody": "This was a big hit for dinner christmas eve! The only downfall was the crust, it didn't seem like enough and ended up making the top look sloppy. I would use your own recipe and keep everything else the same. Top with Cool Whip or vanilla ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Henson"
},
"reviewBody": "No additions needed, this was very enjoyable. sweet and tart. I added raspberries a couple times as well..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Brown"
},
"reviewBody": "Very good recipe! I love the combination of blueberries and blackberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momsy"
},
"reviewBody": "I have been making this pie for 6 years. Can't beleive I haven't written a review before now! I am a lazy cook and use refrigerated pie crusts. If I use fresh berries I follow the recipe as stated, but if I use a combination of fresh and frozen berries I increase the flour to 1/2 cup. If I use all frozen berries I use 1/2 cup plus and extra tablespoon. Everone loves this pie!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "benderb"
},
"reviewBody": "Great recipe! The pie tasted amazing and didn't take long to prepare. We were out of shortening, so used butter instead--worked just fine! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley 'Simpson' Knippers"
},
"reviewBody": "This pie is scrumptious! The combo of berries is so good! I am a I am not such a great baker, but this recipe was easy enough that it came out great! I took others advice and added some cornstarch to thicken the sauce. I will make this over and over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chefsazy"
},
"reviewBody": "This pie was just okay. It had nice flavor, but the crust could have been flakier and, as another reviewer mentioned, it became a bit mushy - did not hold up well for left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenni"
},
"reviewBody": "Not my favorite pie. The blackberry seeds drove me crazy. it tastes pretty good, but i wasn't really blown away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Andrew K."
},
"reviewBody": "Didn't care for it at all. I ended up adding an extra 2 tablespoons of cornstarch and it didn't do anything but leave a powdery taste on the blueberries. Not to mention after 45 minutes of baking the crust came out slightly uncooked and the blackberries had liquified. My first slice was a few hours after it had cooked and it still tasted good (Would've actually rated this a 3 had I not been too lazy to post here until morning ) even though it was really runny but after letting it sit overnight the bottom crust became unbelievably mushy and I started to taste the cornstarch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AUSTINS"
},
"reviewBody": "Had fresh blueberries but my blackberries were frozen so I added a little more flour to ensure it wasn't runny. Perfect consistency! Amazing recipe, quick to prepare and the crust is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KSHUCK"
},
"reviewBody": "This was a delightful recipe. My family had just been blackberry picking and I was tired of making the same types of things over and over. I opted not to make the crust for the pie and instead used a frozen roll-out pie crust. Because I only had one, I found the Crumb Topping for Pies recipe by Jakesdelights and added that to the top. I cooked for 35 minutes and the topping got a little too dark. Next time, I'll probably check it after 30 minutes. Because the crumb topping has brown sugar in it, I might also reduce the amount of sugar in the filling as it was very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BuddGurl"
},
"reviewBody": "Thank you for this great recipe! I just baked this pie today. I used a store bought crust, omitted the butter and added 1 Tbsp. corn startch as recommended by other reviewers. I made an egg wash of: egg white, a small amount of yolk and a small amount of cold water - beat it until slightly frothy then brush on top of the pie. I also sprinkled some sugar over top of the wash. When the pie was in 20 minutes, the edges were already golden brown so I covered them with foil. There was some filling seepage but the pie was still so pretty that I had to take a picture and upload. \nI will definitely be using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingWithLove"
},
"reviewBody": "Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Neeley"
},
"reviewBody": "I followed the recipe as is. The recipe for the crust was half the amount that I needed; it was only enough for the bottom crust. I gave this 4 stars because my boyfriend thought that there was too much cinnamon and not enough tartness. Overall though a good pie! Next time I would just use half the amount of cinnamon called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Eckart"
},
"reviewBody": "This recipe is so good that it actually inspired me to become a member so that I could review it! I used a cheater crust, so I can't review that, but the filling was phenominal. I did add the cornstarch (3 TBS) so the filling wouldn't be too runny, but other than that didn't change a thing! We had six people over for lunch and ended with one tiny sliver of pie left. Two people actually went back for seconds! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Missteree"
},
"reviewBody": "Good, not great. Needs something to put it over the top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "katybee"
},
"reviewBody": "I wish I could give it 3.5 but it's not an option. I used a different crust recipe so I can't judge that, but as for the filling, it was much to runny! I brought this too a bbq and some said it tasted like the cinnamon overpowered the fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kasha"
},
"reviewBody": "I don't eat pies, I just make them, but everyone LOVED this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "delicious! Made my subsitutions. I used a frozen blueberry, blackberry, raspberry mix, and then added some fresh strawberries. I used splenda and also added some cornstarch via other users. Also added some extra cinnamon because I love it. I also used the French Pastry pie crust recipe on this site, which was wonderful. very flaky and suited the pie. will definitely make this pie again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NLCHIPMAN"
},
"reviewBody": "this was good, but if you are looking to please a blueberry pie lover don't make this pie. My b/f wanted a blueberry pie and I thought I would spice it up with this recipe. He was disappointed - I think mainly because of the seeds in the blackberries. Or maybe just because it didnt taste like blueberry pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I was lucky enough to find fresh berries on sale in January, so I made this pie for my fiance for his birthday instead of cake. I used Pillsbury crusts from the refrigerator case, but otherwise made the recipe as written. Very very tasty! The amount of filling was just right and we didn't notice that it was runny. I've been able to cut slice after slice and the berries/filling stay in place. A+!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie S."
},
"reviewBody": "This was a pretty good pie but found that I actually needing more dough to make the crust. I think next time I will use 3 cups of flour and 1 cup of shortening. I would rather have to much then not enough. As far as taste though it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Libby Shearer Farmen"
},
"reviewBody": "This was good- nice flavor, goes great w/ vanilla ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BlueEyedBugsy"
},
"reviewBody": "Absolutely wonderful! Everyone who has tried this loves it! I did make a few modifications:\n- I used two packages of frozen berries (one three berry and one raspberry)\n- I used a different crust recipe\n- I added 3T of cornstarch and a bit more sugar to the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Skelly"
},
"reviewBody": "I'm giving this three stars because of the amount of juice from the berries. I am not sure how to reduce this as I used frozen berries, thawed them and drained them before I put them in the pie. My crusts didn't even stay together long enough to put it in the oven. The juice took over and separated them before I could finish my decorative crust.\n\nNOTE! I also added 3 TBS of corn starch. I've never had to use a turkey baster to reduce the amount of juice in a pie - this was a first for that! \n\nI'm thinking that the frozen berries were at fault here. Had I used fresh, this may not have happened."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mybabiesmomma"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C25OR624"
},
"reviewBody": "My Daughter used this recipe for her 4-H project. She received a Blue Ribbon and made the Honor Group. We really enjoyed eating her practice pies. She didn't change anything except she used a full top crust instead a lattice top like the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBYLN"
},
"reviewBody": "this turned out a bit runny but it was a hit at the pie auction. Great flavor and the addition of cinnamon was fabulous! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "I made this pie with fresh blackberries and frozen blueberries. I have never liked blueberry pie, I always thought it was too sweet. When I made this pie I thought about cutting back the sugar. However, I completely forgot the sugar when I was making it and it was the best blueberry pie i have ever eaten. It wasn't runny at all once it cooled off and you could really taste the fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRISTYG"
},
"reviewBody": "My grocery store was out of blackberries(!?) so I just used blueberries. It was fantastic and not too runny at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E_Bear"
},
"reviewBody": "This Recipe Was WONDERFUL!!! It was so yummy i had to go back for seconds. It is also great with some vanilla ice- cream, especially when warm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Absolutely great! I've made it twice in two weeks now, my husband can't get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shayes"
},
"reviewBody": "This pie was very good. I must say, I did have to leave out the butter because I was making it for a vegan family, and I used a frozen mix of blueberries, raspberries and blackberries. Next time I will use Martha Stewarts pastry recipe, I do not like to use shortening due to the hydrogenated oil. If I need to use frozen berries I will either thaw them first and pour off some of the juice or use 3T of cornstarch, like others suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcromwell"
},
"reviewBody": "This was fabulous. I didn't have enough blackberries so I added some raspberries. I did use frozen berries so I took the advice of previous reviewers and added corn starch. I added 2Tbs but next time I will add a third.\nVery very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tonigm"
},
"reviewBody": "Wonderful pie!!! My husband can't stop eating it. :)\nI used 2C blue, 2C black, and 2C rasberries. I also added 2T cornstarch since the blackberries and rasberries were frozen. The pie was still just a little bit runny, so i might use another tablespoon of cornstarch next time. And i guarantee, there will be many next times! Yummy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmbone"
},
"reviewBody": "I chose this recipe for my very first pie I've ever made. I was nervous about making a pie but this one turned out great! I couldn't believe how good it was! The blueberry blackberry combination was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommabaker"
},
"reviewBody": "the bake time was a bit more for an electric oven (55-60 for a golden crust)and it needed a touch more (1 tbl spoon more) shortening and sugar (which I would the next time I make it--1.5 tsp) but the pie itself is a terrific recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "april"
},
"reviewBody": "I made 3 pies. The first two turned out a bit wet, the one I made the next day (drained more liquid from the berries ad added raspberries) turned out perfect! Everyone loved it and I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reyclaw"
},
"reviewBody": "I added raspberries to the pie. Very simple and yet so good. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Delicious, and makes a beautiful presentation. I used fresh berries and it came out wonderfully. This was the first time I tried a lattice pie crust as well, which was also surprisingly easy and helped make this pie look professional! It was a big hit, I would recommend it for any summer get together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HAWESA"
},
"reviewBody": "This was good. I used fresh berries- about 2 1/4 cups blackberries and 3 cups blueberries. I also added nutmeg and just used the pre-made Pillsbury crust, which saved a ton of time. A good summertime dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRH201"
},
"reviewBody": "Excellent recipe. Added a few strawberries and raspberries, which turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg Natural"
},
"reviewBody": "This pie turned out perfectly!!! This was my first attempt at a fruit pie and even my mother (who is the family expert on them) was impressed. I used the Pillsbury refrigerated crust and made the lattice top - tasty, pretty and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae"
},
"reviewBody": "Great! Didn't need to make any changes!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12120/blackberry-and-blueberry-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12946/desserts/pies/fruit-pies/blueberry-pie/",
"name": "Blueberry Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12120/blackberry-and-blueberry-pie/",
"name": "Blackberry and Blueberry Pie"
}
}
]
}
}
, "about": [
]
}
]