				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Black Bean and Sweet Potato Quesadillas"
,"datePublished": "2020-03-10T02:52:03.000-04:00"
,"dateModified": "2022-10-18T23:28:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Holly L"
,"url": "https://www.allrecipes.com/cook/2943252"
}
]
,"description": "Mashed sweet potatoes, black beans, and Cheddar cheese are sandwiched between two tortillas for a tasty vegetarian appetizer that even meat-eaters will like."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5lg3trLcNou6Sb3UfrZXuDlabCo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1005697-black-bean-and-sweet-potato-quesadillas-Sugarplum-4x3-1-e161f5b86af140d5acb430db1935c3f7.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Black Bean and Sweet Potato Quesadillas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "60"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "663 kcal"
,"carbohydrateContent": "102 g"
,"cholesterolContent": "30 mg"
,"fiberContent": "16 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1517 mg"
,"sugarContent": "5 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 large sweet potato, peeled and diced",
"1 teaspoon chopped fresh cilantro",
"0.25 teaspoon chili powder",
"0.5 teaspoon salt",
"0.25 cup frozen corn",
"1 (19 ounce) can black beans, drained and rinsed",
"8 (8 inch) flour tortillas",
"1 cup shredded Cheddar cheese",
"cooking spray" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until very tender, about 15 minutes. Drain and transfer to a bowl. Mash sweet potatoes and mix in cilantro, chili powder, and salt."
} ,{
"@type": "HowToStep"
,"text": "Place corn in a microwave-safe bowl and microwave on high until warmed, 1 to 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Spread 1/4 cup sweet potato mixture onto 1 tortilla; cover with 1/4 cup black beans and 1 tablespoon corn. Sprinkle 1/4 cup Cheddar cheese atop corn; cover with a tortilla. Repeat with remaining tortillas and fillings."
} ,{
"@type": "HowToStep"
,"text": "Spray a frying pan with cooking spray and place over medium heat; cook 1 quesadilla in the hot pan until cheese is melted and beans are heated through, 3 to 4 minutes per side. Repeat with remaining quesadillas; slice into quarters."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ljoym"
},
"reviewBody": "We loved the sweet potato added to the other traditional Mexican food flavors. Nice recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "I thought this was pretty good. I made the filling as written. I used street tacos as they are smaller. I will make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janicep"
},
"reviewBody": "This was easy and delicious!! I’d do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ty Furman"
},
"reviewBody": "I love these. Lots of options for variations. I like to roast the seeet potatoes. I have added spinach, roasted red peppers, roasted garlic (smashed with potatoes), and more. They are also very easy to make vegan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "robin"
},
"reviewBody": "Not my favorite. Didn't like the flavor of the mashed sweet potato w/everything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheenaco"
},
"reviewBody": "I made one exchange. I used cilantro paste instead of freshly chopped cilantro. I enjoyed the quesadilla. However, I really liked this as a dip for tostitos. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lee Wolfe"
},
"reviewBody": "A great recipe that allows for variations. Very tasty! Thank you. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacy Gilbert"
},
"reviewBody": "This recipe was filling, easy, and absolutely delicious! My husband loved it, too. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JerneysAngel"
},
"reviewBody": "I was looking for a meatless entree when I found these . I had cooked the black beans the day before, so the prep on these was pretty quick. I loved how yummy they turned out. These, or some version of them, are going in the rotation at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anniegolden"
},
"reviewBody": "Many thanks to the submitter of this recipe. Sweet potatoes are nutritious and inexpensive and deserve to be on our tables more often than Thanksgiving. I changed a couple of things around, but it was still the same basic recipe. I microwaved the sweet potato for 2 minutes, then added the frozen corn and microwaved for 1 minute more. Peeled the potato and gave the peelings to my dog, who loves them. While the sweet potato was in the microwave, I sautéed 2 scallions and 1/3 red bell pepper in a little bit of butter. Mashed the sweet potato with cumin, coriander, chili powder, paprika and salt. These were unexpectedly delicious. Served with sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "Made these as noted in the recipe. We ate these but the family found the sweet and savory mix odd. Won't be part of our rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "Made these as noted in the recipe. We ate these but the family found the sweet and savory mix odd. Won't be part of our rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Jones "
},
"reviewBody": "Very filling! You don't need to use two tortillas if you don't want too. Just make sure to spread the sweet potato thin so you can fold it. It's better served with salsa or pico di gio."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Pratt"
},
"reviewBody": "Will definitely make this again. I tried another version of this and it was good, but the corn gave it a great sweetness. Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lturnsleft"
},
"reviewBody": "Exactly what I hoped. The combination was good just didn't quite please my 5 year old who loves sweet potatoes and corn respectively...be warned if attempted for a picky child(maybe sans beans)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorraine Tuliano"
},
"reviewBody": "I used canned sweet potatoes since they were already peeled and cooked. Came out on the sweet since but still good. I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "I have made this a few times, using extra cilantro and added cumin.... :) I do broil them instead of using a pan, but either way, a yummy dinner with guac and whatever toppings you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leah Wolf"
},
"reviewBody": "Great base recipe, which is very easy to tweak. I didn't have corn, but I added some scallions and mushrooms to the mixture. I also put in some garlic, cumin and cayenne to give it a bit more of a kick. It was really excellent! One of those recipes that I'll probably never make the same way twice, but use whatever I have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GPOSBORN"
},
"reviewBody": "Very good! I just mixed the mashed sweet potatoes, beans, cilantro and corn together with seasonings and added a little bit of salsa. Would make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alliecatrobin"
},
"reviewBody": "These came out great! I did add a little extra chili powder and some garlic powder. This is a great recipe though, first time making anything like this and I will be making it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess Gisler"
},
"reviewBody": "I added some onions and rotel and served with sour cream on top. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marinus Swanepoel"
},
"reviewBody": "Added some cooked (with taco spice and 1/2 a diced jalopeno) and shredded chicken breast. Did not care for the sweet patoto taste, willreplace it with refried beans next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MommyWilson"
},
"reviewBody": "I thought it was pretty good, but my husband and boys did not like it at all. My husband just couldn't get the idea of sweet potato pie on a tortilla out of his head."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HelenaFrazier"
},
"reviewBody": "Didn't like this. I just didn't care for the flavors. Totally a preference thing. Nothing is wrong with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "astuan"
},
"reviewBody": "Thanks for this easy, nutritious recipe! Found this recipe 3 weeks ago, and have made it once a week; it's so easy and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Ann Rabolt"
},
"reviewBody": "These were delicious, everyone in my family loved them. I omitted the corn and chili powder, added garlic powder and cumin. To save time I cooked the potatoes in the morning and mashed the beans and seasonings with the potatoes so when i came home from work I just had to fill/cook the quesadillas. I made salsa fresca (chopped tomatoes, onions, juice of 1/2 lime and salt) with it. YUM! Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michela Whiteside"
},
"reviewBody": "First time I made this recipe and EVERYONE loved it. My kids are 5 and 2.5 they globbed the quesadillas up!! I did make 2 sweet potatoes instead of 1. I also used 2-15 oz of black beans and omitted the corn. Here's a tip for the sweet potatoes; microwave them instead of boiling. After microwave wrap sweet potatoes in foil and let them rest for 10 mins. They will be nice and soft and fall off the skin; you don't have to peel or chop! Bottom line this recipe is fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wrglily"
},
"reviewBody": "Loved this recipe! Didn't change a thing and it was fantastic! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bubba"
},
"reviewBody": "Yummy! Filling, satisfying and easy. We are not vegetarian but enjoy meatless meals. I came home tired from work one day and decided to try this (I had saved it a year ago) I roasted a poblano chilli and added to the black beans. I didn't have cilantro so I added 1tsp. Cumin. Perfect dinner for a tired night??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefskitchen"
},
"reviewBody": "Everyone loved it and asked me for the recipe. The recipe is best served the next day when the ingredients merge. I didn't have chipolte peppers and jalapeno so I substituted 1 crushed dried red hot pepper and 1 dried jalapeno I grew in my garden last summer (removed seeds), a shake of pizza peppers and half a thinly sliced fresh poblano pepper. It was splendid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emmalou"
},
"reviewBody": "Tried this for dinner tonight, really good! I also went the lazy route, once the potatoes were softish, I poured the water off and added black beans and corn, garlic, chili, and onion powder to the same pot, then just mushed it all together. Spread on whole wheat tortilla and added spinach and cheese, and voila, dinner! Nice basic recipe that you could add lots of interesting things to, definitely a keeper. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rparker"
},
"reviewBody": "Loved this recipe. I thought it wasn't spicy enough, so I added half a jalapeño, and some cayenne pepper, and extra chili powder, and mixed the corn and beans into the sweet potato. I used less salt; it isn't needed if it's spicy enough. Topped it with guacamole and salsa. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Dalton 'Lizzie'"
},
"reviewBody": "We love sweet potatoes and these came out great. I used more cheese because we love cheese just as much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Blesener"
},
"reviewBody": "Very good meatless recipe but is fab when spiced up a bit more. I doubled the corn, used 2 cups of mashed sweet potatoes, and added LOTS of cilantro. I tripled the chili pwd and added cumin, garlic pwd. cayenne, and anything else I thought would taste good! I used a mixture of sharp cheddar and pepper jack cheeses, and just mixed everything together, except cheese, to simplify. Served it with avocado, sour cream, and salsa. Yum! Will absolutely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeenChef"
},
"reviewBody": "Found this online for my mom, who's a less than average cook. Easy to make, quick, and yummy. Gave it to an 8, 10, and 12 year old, they loved it (Very picky eaters). Only tweak would be to double the amount of spices in the sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ConkyJoe"
},
"reviewBody": "Pretty good but not wowed by it. The high sodium content is a distraction to an otherwise healthy appetizer (nearly half the sodium is attributable to the flour tortillas). Take note of the 1/2 teaspoon salt in the ingredients as there are two references in the instructions about adding salt . . . one when boiling the potatoes and another as a seasoning after mashing the potatoes. It’s unclear if the specified amount is intended to be divided or not. So you may want to do a taste test before adding 1/2 teaspoon salt as a seasoning. Had to add other seasonings to make this more palatable (i.e., onion powder, garlic powder, and a dash of cayenne pepper). We had 10\" flour tortillas, and the recipe made three rather than four 8\". Used a cast iron pizza pan to cook the quesadillas and a cake lifter which made it very easy to flip them over. At medium heat, the cast iron pan caused them to brown quicker than the time stated in the instructions (i.e., about 2 to 3 minutes per side)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Meatless Monday winner! I didn't measure any of the spices; just used to taste, and added both garlic and onion powders as well. Short on time, I mixed the ingredients all together (minus the cheese, which I sprinkled on before topping with the other tortilla) instead of layering them, which worked perfectly. I used two medium sweet potatoes and seasoned black beans which jazzed up the flavor. Super easy to get on the table, nutritious, and delicious...a winning trifecta in my book. Served with sliced avacado and the MIL's homemade salsa, this dinner was a homerun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idagal"
},
"reviewBody": "so, these are perfect. great alternative to a meat quesadilla; the sweet / savor combo is wonderful as a side dish for a meal. I\r\nTook this to a barbeque with salsa and guac on the side, even cold they went over well. all gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this is surprisingly good.. i used my own seasoned beans.. so i didn't add the chili powder or salt.. didn't have cilantro or corn.. but could see how they would add to the dish.. it almost makes me think of something African.. ty for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarplum"
},
"reviewBody": "Delicious, healthy, and nutritious. I will make these again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231880/black-bean-and-sweet-potato-quesadillas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231880/black-bean-and-sweet-potato-quesadillas/",
"name": "Black Bean and Sweet Potato Quesadillas"
}
}
]
}
}
, "about": [
]
}
]