				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blenty of Blintzes"
,"datePublished": "2020-06-18T23:07:42.000-04:00"
,"dateModified": "2020-06-18T23:07:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sherbg"
,"url": "https://www.allrecipes.com/cook/598887"
}
]
,"description": "Not exactly a blintz, but who cares when it tastes as great and is as fun to make as this layered brunch dish? Blenty of blintzes, indeed!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WrTI5Z_Ak27K_rOZ2cdxbpzATic=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8280879-90d0338d1a214378b7ee2d7fbbfa6dd4.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blenty of Blintzes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "45"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "422 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "159 mg"
,"fiberContent": "1 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "742 mg"
,"sugarContent": "8 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.25 cups all-purpose flour",
"1 teaspoon baking powder",
"0.5 cup butter, softened",
"3 tablespoons white sugar",
"2 eggs",
"0.75 cup milk",
"1 (16 ounce) container cottage cheese, creamed",
"2 tablespoons butter, softened",
"1 egg",
"1 tablespoon sour cream",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x9 inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, mix flour, baking powder, butter and sugar. Stir in eggs and milk. In a separate medium bowl, mix cottage cheese, butter, egg, sour cream and salt."
} ,{
"@type": "HowToStep"
,"text": "Place 1/2 the flour mixture in the baking dish. Cover with the cottage cheese mixture, and top with remaining flour mixture."
} ,{
"@type": "HowToStep"
,"text": "Bake 50 minutes in the preheated oven, until puffed and golden brown. Allow to cool slightly, and cut into squares to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey B"
},
"reviewBody": "It is hard to rate this accurately because I’ve never heard of or tried this dish. For ex, if I try a lasagna recipe I rate it as to how it compares to others I’ve tried. This is like a mix between egg custard and a cheesecake perhaps. It is a little bland, but I think it’s supposed to be. I did take other reviewers’ advice and added a dash salt and 1 Tb. Sugar to cottage cheese mixture. I wish I had added the tsp of vanilla as someone suggested. On its own, it would be a 3 out of 5. But by simply adding reduced frozen strawberries (with a couple teaspoons sugar), it was a good dish. Not too heavy, but rich enough. I will try blueberries on it as well as that may give it a little something to liven it up. If I made it again, I would probably bring to a pot luck brunch, but I don’t know that I would crave it enough to make just for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Delores Walters"
},
"reviewBody": "Crepes were good but the filling was to runny for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "thekellysong"
},
"reviewBody": "I found this casserole to be a bit on the disappointing side. It wasn't bad exactly...just bland-ish (even with the addition of vanilla and cinnamon). Except for adding those two things, I made the casserole exactly as written. I ended up having to cook it an extra 15 minutes, probably because I live in a high-altitude area. I ate a bowl of this casserole with a generous dollop of strawberry jam on top, and it was pleasant but not quite what I was hoping for. I didn't feel like I was eating a blintz at all...more like a spoonbread with cottage cheese. I doubt that I will be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "spunkycook"
},
"reviewBody": "It did not taste like blintz like you would get at IHOP which is what i had hoped for because I love IHOP's blintzes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laura"
},
"reviewBody": "Soooo good, I made it just as written ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betvid"
},
"reviewBody": "Tastes like grandma's but a lot less work! Thank you so much for this recipe!\n\nI served it to my music group and my husband for lunch today and everyone enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigShotsMom"
},
"reviewBody": "I began with no clear idea of how this should taste so I can't speak to the authenticity, but it was the star of our Sunday brunch. I used low fat cottage cheese and sour cream and it was still rich and satisfying. The flavor profile was a bit bland for us so I warmed some homemade raspberry preserves and dribbled just a bit of sweetness. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "shelley durazo"
},
"reviewBody": "The recipe did not turn out well. I layered half of the dough mixture on the bottom of a 9x9 baking dish and then filled with cottage cheese mixture, but was not able to apply a layer of dough on top without mixing it in the cottage cheese mixture. It turned out like a bread with cottage cheese clumps. There was no cheesy filling between two layers of bread. I am not sure what went wrong, but if the top layer of dough actually was placed on top and not mixed in the cottage cheese, it would have been better. Wont make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tzimmes"
},
"reviewBody": "This was delicious! I don't have a 9X9, so I used an 8x13 and that was fine. I omit the salt and added 2 T of sugar to the filling, and a t of vanilla to the crust. \n\nI've also made it with regular small curd cottage cheese, instead of creamed and that was good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bev Palmer"
},
"reviewBody": "Cut the salt as the reviews said and add sugar. Read reviews!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhondarella"
},
"reviewBody": "This stuff I LOVE!!!! I think the original recipe is great, but here is how I did the filling to take it up a notch. I used a 9x13 glass pan and doubled the recipe. I used the recipe for the crust as it was originally printed. Instead of the original filling I used the sour cream,added a 1/2 cup of sugar, a 16 oz carton of marscapone and a 16 oz carton of ricotta with only one egg and a slosh or two of Amaretto, no salt. In between the layers I added some granulated raw sugar and cinnamon. I baked this until I could see that both the top and the bottom crust were cooked. The filling was a bit soft still. NO PROBLEM, by the time this was served it was PERFECT! Then the day after this stuff is like a cheesecake, it is amazing on day two! I also served a sauce with this that was made using peach jam, with some Amaretto and a bit of cranberry sauce. OOO-LA_LA! Amazing! Thanks sooo much for this recipe! I will use it for many occassions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherryk"
},
"reviewBody": "in spite of adding the vanilla, cinnamon, and extra sugar, my family thought this was still bland. Not a keeper for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samitestar"
},
"reviewBody": "Surprisingly good. I cut the salt down in the cheese mix and added a 1/2 tsp of sugar per other reviews. I think next time I will use ricotta in place of the cottage cheese. It is tastiest warm (I like it with strawberries) and it reheats well. UPDATE: I made this again, with ricotta and 1/4 cup cottage cheese in place of 16oz of cottage cheese. I added a liberal dash of orange liquer and it really made the cheese part of the dish better, made it taste more like crepes suzette. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Love this recipe, I've used it three years in a row for my Chanukah party and it always gets raves! Even my mother, who didn't think you could make a blintz without frying it asked for the recipe. Because I have a sweet tooth, I do, as many others have suggested, add 1 tblsp of Sugar, 1 tspn of vanilla and about 1/2 tspn of cinnamon. Thank you for this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SallyMae"
},
"reviewBody": "Sorry, I did not like this. I work at a Pancake restaurant and LOVE blintzes with fruit. I tried adding fresh strawberries to this, but it was not sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lotrgal922"
},
"reviewBody": "We liked this recipe, but I can see how this might not have a broad appeal. However, I didn't have cottage cheese so I had to use ricotta cheese. It tastes fine, but not anything fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MIDDLECOOKIE"
},
"reviewBody": "Very disappointed. Dough was too sticky and where the recipe said \"pour\" the rest of the dough on top, there is no way you can pour it. Will make this statement though in honesty - Maybe due to the fact that I live in Australia (am American)and had to cook it in a fan-forced oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "S&G Mummy"
},
"reviewBody": "I thought this was terrible. I followed the recipe exactly and it was too salty, unpleasant in texture and otherwise essentially bland. My husband (who likes all food) found it pretty unpleasant and my son wouldn't eat it at all. Will definitely not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TINAMC28"
},
"reviewBody": "I would rate it with 5 stars, however, I didn't follow the recipe exactly. Texture is very much something like that of spoon bread or a dense popover. I omitted salt altogether and added a dash of cinnamon and vanilla to both flour and cheese mixtures. Baked perfectly at exactly 50 minutes! Like others, I also made a berry syrup from frozen berries to drizzle/pour over top. Tasted delicious! I will definitely make again for a brunch or as an alternative dessert dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candi-z"
},
"reviewBody": "This was absolutely amazing. I doubled the recipe and put it into a 13x9 glass pan. I served it to my book group and the raves went on and on. Run ....do not walk to this recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Theresa's Cookin'"
},
"reviewBody": "I added sugar to the cheese mixture, vanilla to both, no salt as per reviews, and a fruit layer...just a little bland still. Everyone else loved it, just dusted powdered sugar on top for sweetness...seemed to do the trick sort of....just a little bland really.\nAlso, texture NOT what I expected. All fell apart...the inside mixture is really runny. Still good though. Just not what I was expecting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie K."
},
"reviewBody": "I made this for Easter brunch. I cooked it the night before, which was fine and created a denser dish. In addition, I followed an earlier review and omitted the salt, added vanilla and a small layer of blueberries on top of cheese layer. Also, I made a warm blueberry syrup from frozen berries. I loved the versatility of the recipe --- and my guests loved the dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJDASEN1"
},
"reviewBody": "Wonderful! I can't seem to find blintzes in my hometown, but this recipe really brings the taste home for me. The texture is wrong, but the taste is really great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina"
},
"reviewBody": "I've never understood how anyone can \"review\" a recipe that they've altered so I make most recipes the way they're written the first time I try them. This one is no exception and I'm glad I didn't change a thing! Moist, delicious, easy and economical to prepare. \r\nOh I did change one thing...I don't have a 9x9 pan so I made it in my 8x8 glass pan. Came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENKENT"
},
"reviewBody": "Super! I made this for brunch on Mother's Day, and it was a huge hit! (and really easy!)\r\nI served it warm with homemade Peach Preserves, sour cream and fresh berries. It was gone before the first batch of mimosas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZENXA49"
},
"reviewBody": "i grew up on blintzes. this is much easier. i would drop the salt from the cottage cheese mixture and add 1-2T sugar instead. and cinnamon, of course! \r\nthis is somewhere between a blintz and lokshen kugel. yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RDENIGRIS"
},
"reviewBody": "I made this recipe today and although it doesn't beat the \"from scratch\" method, it's quick, easy and yummy. I followed some of the suggestions (halving the salt and adding vanilla)and I decided to add a teaspoon of cinnamon to the cottage cheese mixture and it helped. Serving it with sour cream and homemade strawberry preserves rounded out the taste nicely. I would make this recipe again for a quick cheese blintze fix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmartcookie"
},
"reviewBody": "It seems like I *never* follow a recipe - and sometimes it even happens when I'm not changing something on purpose! I made this for dinner tonight and, surprisingly with all the goofs, it came out just great! Not puffy, but still very good. I added vanilla and left out the salt, at the recommendation of others. Served this with chunks of cantaloupe on the side and some leftover baked spiral ham - everyone loved it! I'd make it again - next time trying to follow the recipe by not leaving out ingredients just to see what it is supposed to be like.\r\n1. I inadvertently left out the baking powder.\r\n2. I also inadvertently left the melted (instead of soft) butter in the microwave and forgot to add it to the cheese mixture, so poured it over the top of the cheese mixture instead.\r\n3. I also didn’t have enough cottage cheese – only about 1 cup – so added about 1/4 cup sour cream instead of just a tablespoon. \r\n4. I also sprinkled about 3/4 cup fresh blueberries over the top of the cheese before spooning the balance of the dough mixture on top. VERY good – and I think I would try peaches or sliced apples sometime, too. \r\n5. I also made a mixture of raw sugar and cinnamon and sprinkled it over the top of the whole thing before baking. Also VERY good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caliope"
},
"reviewBody": "I've adjusted the amount of butter/fat I've used in this recipe sometimes, because I prefer less. But with or without adjustment, this recipe is quickly becoming a staple for brunches in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YVERSCH"
},
"reviewBody": "I made this recipe after reading the reviews. I did not add the salt, but added a dash of vanilla. I served it with sour cream and a fruit preserve. The dish got rave reviews and will become a staple when I have to bring a \"breakfast\" dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PIXIE_BIT"
},
"reviewBody": "This recipe was ok. While I was not expecting the recipe to be like a blintz or anything, it was pretty off of what I had hopes for. It ended up alot like spoonbread. I found the taste a bit too salty for some reason. I do have to admit that it was a taste that became addictive though. With warmed with lots of fruit, etc. I don't plan to make it again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QUEENNMAB"
},
"reviewBody": "Delicious served with fresh fruit and sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Had requests for this recipe after serving at a family brunch. Changes: did not add salt, added a Tbsp. or so of sugar, served with warm fruit sauce and was GREAT. Even better the next day!P.S.\r\nAlso consider a dash of pure vanilla...Easy &amp; yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did not like this recipe at all. It was soggy and had an eggy taste. I even baked it longer hoping that would help. It didn't. I wish that I had used the ingredients to make some real blintzes that I'm still craving, but I wasted them making this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MAEVEN6"
},
"reviewBody": "This is not my blintz recipe. My dh said more like cheesecake but not sweet. I added vanilla to the center and will to the batter next time and a bit of sugar. Definitely needs fruit. Good for an Erev Shabbos meal as dessert with fruit. Or brunch dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BECKERJ"
},
"reviewBody": "The recipe was quick and easy, but I was disappointed in the taste. I was really hoping for something that tasted like a blintz- but this did not. It was good as a snack with a sweet topping (I warmed strawberry seedless preserves on the stove), but this recipe is not making the cut for Christmas brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my mother's birthday brunch and it went over great. Very easy to prepare and make. Are family has always loved cheese blintzes and this way they can be prepared for a meal quickly. We just used cinnamon and sugar to top! The only thing I would change is the amount of salt (a bit too salty). Next time I will cut the salt in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Bezemes Walstrom"
},
"reviewBody": "I actually didn't make this, but a coworker did. It was wonderful! We all got the recipe from her. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's quick, easy, and cuts beautifully. I served it at a Oneg Shabbat luncheon with sour cream and homemade peach and strawberry jam. Three people asked for the recipe. It was not served hot--really just warm--and everyone loved it, even my husband!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/37341/blenty-of-blintzes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/147/breakfast-and-brunch/crepes/",
"name": "Crepes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/37341/blenty-of-blintzes/",
"name": "Blenty of Blintzes"
}
}
]
}
}
, "about": [
]
}
]