				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blonde Apple Brownies"
,"datePublished": "2020-06-18T23:59:52.000-04:00"
,"dateModified": "2022-09-16T19:59:03.000-04:00"
,"author": [
{"@type": "Person"
,"name": "herbalady"
,"url": "https://www.allrecipes.com/cook/1704669"
}
]
,"description": "Blonde apple brownies, made with brown sugar and cinnamon, are a tasty twist on the traditional blonde brownie recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ThsIxJ3hpsX4EBgy4aQofLxn6YU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1483214-cee35ec6db6140919037e66607b3ea3b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blonde Apple Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "28"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "315 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "57 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "134 mg"
,"sugarContent": "33 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup salted butter, softened",
"1 cup white sugar",
"1 cup lightly packed light brown sugar",
"2 large eggs",
"2 cups all-purpose flour",
"1 teaspoon baking powder",
"1 teaspoon ground cinnamon",
"6 McIntosh apples - peeled, cored, and diced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Beat butter, white sugar, brown sugar, and eggs in a bowl with an electric mixer until smooth and creamy. Beat flour into butter mixture until well combined; add baking powder and beat. Stir cinnamon into batter. Fold apples into batter; spread into the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out with moist crumbs, about 45 minutes."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kayleigh8714"
},
"reviewBody": "Four stars because these are not at all like a blonde brownie and the name had me craving a buttery blonde brownie with apples mixed in. This is definitely more of an apple cake. It is tasty though and a great way to use of apples after Apple picking. I think a crunchy streusel topping would make these five star worthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef"
},
"reviewBody": "Firstly these were not soggy for me but I used less apples - 1.5ish regular size apples as I only had 4 total in the home. Side note- it’s not a time to use excess &amp; 6 is too many even if there wasn’t a shortage to be honest though. I also added a splash of vanilla, pumpkin pie seasoning, cloves, and ginger. I didn’t measure anything just a couple shakes as my fam likes warming spices. It was amazing and this is day 3 - crust is still crispy so I’m"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Digital_Nebula"
},
"reviewBody": "Sooooo good!!! I didn't have Macintosh apples so I used fresh picked Braeburns and it turned out delicious. Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itsaino"
},
"reviewBody": "I found this in the last Allrecipes issue and it was such a great hit! Everyone LOVED it!\nIt will be one that we make often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nan"
},
"reviewBody": "These blondes were incredible! I used the recipe that was published in AR magazine in April/May 2018 which is the same as this one, except it called for 1 1/4 c butter. Also, the magazine recipe called to brown the butter and then put the melted butter in the refrig to cool for 30 min., which I did. Maybe that extra half stick of butter made the difference, but mine were definitely more blonde/brownie like than cake-like, which some reviewers mentioned. I only had one large Fuji apple, so it also had less apple in it than the recipe. However, I think the lower amount of apple kept them from being soggy or mushy the next day. I added a good half cup of walnuts. You can’t beat the smell of browned butter, and I think the browned butter made these so delish. Baked exactly 45 min. Cooled about two hours. Absolutely wonderful, even the next day. Next time I might add some caramel chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Bruxvoort Everts"
},
"reviewBody": "This was delicious. It is definitely going into my recipe book. And I will make it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "I followed other reviewer suggestions and added a little vanilla, nutmeg and extra cinnamon. It came out perfect. This is delicious and moist. Calling it a brownie is a misnomer, as it is what I consider a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marci Banes"
},
"reviewBody": "This is a great Fall dessert. Everyone loved this treat. I made the recipe just as instructed and it came out more like a cake rather than a brownie. Im glad the other reviews said the same thing because I thought it was my lack of baking skills. Either way it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Stryer"
},
"reviewBody": "Great recipe. But as other people suggested I used vanilla extract and extra cinnamon. came out delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imareader247"
},
"reviewBody": "I couldn’t get Mackintosh apples, but Gala apples worked wonderfully. I made this and took it to a retirement party and everybody loved it and everybody wanted the recipe! I don’t bake, so if I can do it, you know it’s got to be easy. Thank you so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JANNIECAT"
},
"reviewBody": "I made this exactly as the recipe stated based on the high reviews, but wasn't very pleased with the results. I was planning on serving this to company with ice cream, and I'm glad I made it the day before so we could try it. When I was adding the apples to the mix, I felt the ratio of apples to dough was very high. When it first came out of the oven, it wasn't too bad because the bottom was fairly crisp. Despite the 2 cups of sugar (which I consider a lot for a dessert), it didn't taste very sweet. After sitting in the pan overnight, it was very mushy and the consistency was not appetizing. I was very surprised and see that this turned out much better for others. I had to go to \"Plan B\" for our company's dessert..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr. ASMD"
},
"reviewBody": "Fantastic! I had a bunch of macintosh apples to use up, and this was the perfect recipe. I brought it to a fall potluck, and everyone brought home extra pieces. :) My changes were just for a little extra depth of flavor - 1 tsp vanilla, 2 tsp cinnamon (rather than 1), 1/2 tsp nutmeg, 1/2 tsp ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirsten Gilbert"
},
"reviewBody": "This is a great recipe. Especially if you have apples to be used up. I used 4 granny smith apples in place of the 6 macintosh apples. I also added about a 1tsb of vanilla extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabetta"
},
"reviewBody": "Wow! So simple and so good!! I made after reading Naples suggestion (she's always right) but I didn't expect was so delicious since the quantity of apples is big.\nI used fuji apples, add 1 tsps of vanilla and half tsp of salt.\nNext time, I will eat it with some whipped cream or caramel sauce.\nThank you very much for sharing this recipe!\nMolto buona !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norene Dennis"
},
"reviewBody": "There is something about apple season that makes me want to bake, which I rarely do. The ingredients were simple and it was easy to make. They turned out perfectly. Like someone mentioned in another review, more like a flat cake than brownie, but moist and tasty. I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer C Finn"
},
"reviewBody": "I think this was a good basic recipe but not very flavorful.... I added powdered sugar to the top for added sweetness. Next time I think I will up the sugar by 1/4cp. and cinnamon by another tsp. It could also use some walnuts or even butterscotch chips to give it a more rich flavor. It has the consistency of your typical apple muffin so perhaps putting a strudel topping on would be good too. It's a good recipe to play with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bibi"
},
"reviewBody": "Oh, my, this precious recipe has been languishing in my Favorites for a long time. I don't know why I waited. This is delicious! I'm so glad I tried it. I had Fuji apples, so that is what I used. I did not change any other ingredients, except to add a bit of salt and some vanilla extract. I creamed the sugars with the butter, added the eggs; I combined the dry ingredients, added them to the wet, then stirred in the apples. There is no way to fold in the apples, just get them in that batter the best way you can, because the batter is quite stiff. The juice in the apples provides the moisture. Be sure to use a very large bowl. The bowl I started with was too small, so I had to transfer to the largest bowl I had. I added about 20 extra minutes to the baking time, and the \"brownies\" were still quite moist in the middle, so rely on the actual toothpick test, not the minutes. I added some whipped cream (ice cream would also be nice) and a drizzle of caramel sauce, which sent this already delicious recipe right to the moon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "violet80s"
},
"reviewBody": "I really liked this recipe and so did my friends. I do think it's a bit too sweet and next time will make it with less sugar, but I will definitely be making it again. Also, it was more like a coffee cake than a brownie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarplum"
},
"reviewBody": "These were super good. I thought it was more like a cake than a brownie but either way my family loved these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "As this recipe's first reviewer I am happy to recommend it enthusiastically. In my mind this was more a shallow cake than brownies, but these were so good I don't really care what you call them. Moist, packed with apples, delicious as is, with a scoop of ice cream or drizzled with warmed caramel sauce, this was a real treat that was quick to prepare. Note: I prepared this with the conventional mixing method, beating the butter and sugars until creamy, adding the eggs (and a teaspoon of vanilla), then adding the combined dry ingredients (including a half teaspoon of salt). Update: Eat 'em quick! Even loosely covered the top was a bit soggy by the following morning!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/238475/blonde-apple-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
"name": "Apple Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/238475/blonde-apple-brownies/",
"name": "Blonde Apple Brownies"
}
}
]
}
}
, "about": [
]
}
]