				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blueberry Turnovers"
,"datePublished": "2019-04-02T02:49:26.000-04:00"
,"dateModified": "2019-04-02T02:49:26.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Charita Braker"
,"url": "https://www.allrecipes.com/cook/2451469"
}
]
,"description": "Blueberry crescent rolls made with fresh blueberries rolled into prepared croissants and baked to perfection for a light, delicious pastry. Serve warm with a tall glass of milk."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/R-9d2BE_wvsMnEWKb82bDzrf8iY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/958216-1aebf54bd58c451ea57534445edf3182.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blueberry Turnovers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "129"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "21 g"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "233 mg"
,"sugarContent": "11 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (8 ounce) package refrigerated crescent rolls",
"0.5 cup fresh blueberries",
"0.25 cup confectioners' sugar",
"0.25 cup prepared vanilla frosting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll out crescent dough triangles onto a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Place 1 tablespoon blueberries on the widest end of each triangle. Sprinkle 1/2 teaspoon confectioners&#39; sugar over blueberries on each roll. Beginning with the wide end, roll up each crescent around blueberries; pinch both sides to seal completely."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden, about 12 minutes. Remove to cool on a wire rack for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Dust turnovers with remaining confectioners&#39; sugar. Drizzle with vanilla frosting."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Songer Willard Frye"
},
"reviewBody": "I made this for our ladies Bible Study and took it to church. It was GREAT. I used Pillsbury crescent rolls, and they have downsized them. They were too little, so next time I will be combining TWO triangles together and doubling things up inside. But it was all very delicious... taste, texture, frosting.... everything. Five Star for sure. But as usual... they took longer to make than the suggested time. The frosting takes time to make, also. I made it from scratch. A cream cheese and vanilla frosting on allrecipes. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rain3707"
},
"reviewBody": "These were so yummy and very easy to make. We made the vanilla icing using 1 cup confectioners sugar, 1tablespoon &amp; 1/2 teaspoon of water, and a dash of vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sofia.lemke75"
},
"reviewBody": "So simple, quick and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Used pastry puff for crust and soaked blueberrs\n in orange juice and simple syrup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "Used frozen blueberries and mine needed to bake longer than 12 min, more like 16-17 or they were still doughy on the inside (possibly because of the frozen berries). Easy and good though. Did a glaze of powdered sugar and milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Brandt"
},
"reviewBody": "Very easy to make! Taste good as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrjmj1"
},
"reviewBody": "Very good, quick &amp; easy to make. \nMight try it with a quality pastry dough next time, but was very good as-is in a pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AEH13"
},
"reviewBody": "LOVE IT!! THEY TURNED OUT GREAT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Copp"
},
"reviewBody": "Used this for inspiration. I had blueberries in the freezer and a can of crescent rolls in the fridge to use up. So I simmered the berries on the stove with a bit of sugar and cinnamon and thickened with a small amount of cornstarch. Let it cool in the fridge. Used about 1/2 or so for the pastries. Rolled out the pastry and cut them into rectangles rather than triangles pressing them together.and flattening where necessary spread a tsp of softened cream cheese that I heated up in the microwave so it would spread nice over half of each piece. Topped with 1 TB of cold blueberry filling and folded the pieces over top and pressed all edges really good. Put on ungreased cookie sheet and baked for 12 minutes. Piped a thin frosting of creamed cheese, icing sugar and cream in a zig zag pattern over each once they cooled a bit. delicious! Nice inexpensive quick and easy dessert. Not master chef worthy for sure, but cheap and easy and tasty. These would be good wrapped up to put in lunches as well. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandra Kingdon"
},
"reviewBody": "Delicious!! I used vanilla frosting heated up so it drizzled on the turnovers. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JadeLynn"
},
"reviewBody": "I used frozen blueberries (thawed) and i didn’t have any powdered sugar so i used butter cream icing instead. whole family loved it and will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie F"
},
"reviewBody": "I loved these!! I am thinking about adding an extra dash of regular sugar or something next time..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "vogel"
},
"reviewBody": "Made no changes, came out somewhat edible. Probably won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nightfall"
},
"reviewBody": "I did not like these at all. I've used puff pastry instead of homemade pie dough, and that was really excellent, but the crescent roll dough just didn't work for me. It's the wrong texture, it doesn't taste right, and it was a waste of fresh berries. I ended up throwing them away, and my family definitely has a sweet tooth. A shame, but at least I tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "These are so easy and so good! Canned crescent rolls are my new favorite thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "These are so easy and so good! Canned crescent rolls are my new favorite thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Incredible! The exact amount of berries for just that many crescent rolls. I got up early and made a double batch for my husband to take to work. Figured it looked straightforward and I would chance a new recipe. I used someone else's idea to stir the powdered sugar into the berries instead of doing it individually. Used parchment paper. Could have skipped the powdered sugar topping since I was drizzling with frosting. They taste just like blueberry donuts. The guys went nuts over them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Klemenc"
},
"reviewBody": "This recipe is so easy and amazing! I wouldn't really call it a turnover though. For more flakiness you'd want to use puff pastry. I've made this recipe 5 times so far, and my friends and family love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Simmons"
},
"reviewBody": "Really easy and delicious! I modified it slightly, mixing 2 cups of blueberries with approximately 2/3 c of powdered sugar before placing them in the crescent roll dough. I also used dough sheets and made them into rectangles instead of triangles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Sarlo"
},
"reviewBody": "I used canned bluberries and they were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cortney Beth Gomez"
},
"reviewBody": "Fun &amp; easy afterschool snack. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "Absolutely perfect little gems! I used a heaping tsp of powdered sugar inside and baked them on a Pam sprayed sheet pan. I made an icing of powdered sugar, milk and vanilla and covered the warm turnovers. This was perfect for a weekend breakfast. I would have never thought of this, I'm so glad I found this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "I must make these more often! Super easy and quick! From start to finish, I was able to prepare, bake, cool, and decorate using Shiny Cookie Icing. 10 yo daughter ate 4 so I'll double the recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Compton Mathie"
},
"reviewBody": "We loved these! I added a little more sugar than it called for and a little honey and brushed the top with honey. They were yummy! Really easy. I used frozen blueberries and let them stay in a few more mins. I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ros Hollingsworth"
},
"reviewBody": "Still good without the frosting - even my"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Delores513"
},
"reviewBody": "I found the crescent rolls were not large enough. Made a mess when I tried to roll them4"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jbooshey"
},
"reviewBody": "The crescents were too salty and there wasn't enough blueberry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebekah Rose Hills"
},
"reviewBody": "Quick and easy breakfast treat - I missed the flakiness of traditional pastry you would have with a turnover, but can't complain with how tasty, and easy these were!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nwink97"
},
"reviewBody": "I was kind of skeptical of these but I ended up loving them! I put a layer of cream cheese on the croissants before I added the blueberries coated in the confectioners sugar and it was a good decision because it gave it extra flavoring! Definitely will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hawn"
},
"reviewBody": "Needed something fast. This was super fast and super easy. I used confectionary sugar and lemon juice to frost on the top. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1flhippy"
},
"reviewBody": "It's a very yummy and easy breakfast pastry. Like the others noticed, if you don't seal the pastry enough, it will leak out, but that didn't make it any less delicious. And like many others, I changed it to suit me. I used granulated sugar because it's what I had, and when it was done, I brushed it with butter and sprinkled with cinnamon, not the cinnamon sugar mix, just plain cinnamon. And I added whipped cream because I didn't have vanilla frosting. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Piano Hands"
},
"reviewBody": "It was super easy, i ended up using a plumb sauce/filling that i had made already. Delicious and simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marciajandzio"
},
"reviewBody": "I patched two crescents together to make a rectangle and thus 4 turnovers. Yes, they were not puffed pastry but the company thought they were great. Used cake icing from the tube on top with conf sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcgbllg"
},
"reviewBody": "so I grow my own blueberries and they are very tart. I tried a couple of versions of this and have found that for me the best is to cook the blueberries first with enough sugar to sweeten them adequately. When I just used blueberries straight with the sugar on top they always fell out. This way it is really easy to roll up and is so much more consistent on taste and texture. I also loved the other reviewer's idea of adding some cream cheese so I spread a little whipped cream cheese on the dough before adding the blueberries. Cook as directed and drizzle some confectioners sugar icing on top when they are done. Out of this world delicious!! I will be making it as long as my blueberries last!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bamablonde66"
},
"reviewBody": "Made these last night. They were oh so good! And so simple to make! I used fresh blueberries I had in the fridge! Even though the recipe says vanilla frosting optional, I recommend a homemade vanilla glaze! Made one I found on this website and it made the turnovers even better! Will definitely make these again and again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jewelsmom"
},
"reviewBody": "OK, So I had Easter morning house guests and crescent rolls. Saw this recipe and substituted chopped fresh strawberries and mini choc chips. No frosting, just a dusting of granulated sugar. They were excellent, but not close to the recipe posted her. If I had blueberries I would have tried that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loretta Fantin Dominico"
},
"reviewBody": "So easy and fast to make, and they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "What a good idea! This deserves five stars for as fast and simple it is and tastes good besides! I used cinnamon and sugar on the berries, then sprinkled cinnamon and sugar on top. I also want to try spreading cream cheese and jam instead of the berries before rolling up sometime. Great with brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grave Flower"
},
"reviewBody": "I've made these twice. Everyone loves them. I use the bigger crescent rolls so I can add more blueberries. Also use a vanilla glaze recipe I found on this site. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristi"
},
"reviewBody": "Pretty good for a quick and easy treat if you have some fresh blueberries. Not flaky and dough is not sweet, but not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBailey"
},
"reviewBody": "I used more sugar than called for but didn't measure and it worked perfectly! I have very tart and juicy organic blueberries though. I also added a couple pinches of nutmeg and a teaspoon or two of cinnamon. No measurements since I made these with a couple of toddlers :). After they cooked, we made a creamy topping of butter, powdered sugar, and Tahitian vanilla paste. They were so good that the two boys (Ages 2 and 5) were trying to steal one anothers' rolls because they had eaten the whole pan full! The 5 year old kept saying \"They are even yummier with the sauce on them!\" needless to say, these will be made again:) They are super easy, very kid-friendly, and a quick make, bake, and cleanup. Not to mention, Beautiful! we dusted the tops of them with cinnamon for looks and it was incredible! Can't approve this recipe enough!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillr"
},
"reviewBody": "Five stars for an easy recipe using crescent rolls. If you expect a top of the line pastry, dont bake with crescent rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dede"
},
"reviewBody": "Made these this morning, they were absolutely delicious. The only issue I had was putting them together, eventually I did it and they pretty much didn't over flow. So they weren't a mess. Made a vanilla glaze, yummy!!! Will make again real soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "V.Naehu808"
},
"reviewBody": "I love the ease of this recipe. Mine doesn't look like the photo, but then again,I used cream cheese frosting because I had leftovers in the fridge, and I like it better, so I just smooth it on like buttah. :) Their juices oozed out of the crescents onto the baking sheet, but no matter, they tasted great. Thanks so much. My g-daughter thanks you too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "Considering how easy these were and how quickly they disappeared from the breakfast table, they definitely deserve a 5 star rating. Everyone loved these and we will be having again, and may even try different fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terrie Bass"
},
"reviewBody": "These were a great, quick dessert! sweet but not to sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ralisam"
},
"reviewBody": "Quick and easy. But nothing compared to truly homemade. My husband, who detests blueberries, actually liked them. But my kids took a bite and turned up their noses--a \"cheap\", less tasty version of toaster strudels, according to them. They're okay, but would be MUCH better if you go through the little trouble of making pie crust from scratch or something like that instead of the packaged refrigerated dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Young Llopis"
},
"reviewBody": "The turnovers were very sweet. I think I will reduce the amount of powdered sugar the next time I try these. I liked the ideas the reviewers had on using other fruits too. Some reviewers suggested using canned pie filling when fruits aren't so plentiful. Good idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Young Llopis"
},
"reviewBody": "The turnovers were very sweet. I think I will reduce the amount of powdered sugar the next time I try these. I liked the ideas the reviewers had on using other fruits too. Some reviewers suggested using canned pie filling when fruits aren't so plentiful. Good idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meghan Silich"
},
"reviewBody": "My husband loved these! They were quick and easy. I didn't make the icing on top and they seemed like they were missing something. Next time I will try the icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LEENBEAN"
},
"reviewBody": "What a PIA and a giant mess! I worked so hard to make each one just right and seal up all the edges well. It looked like I had poured blueberry syrup all over it when it was done. The flavor was lacking too. I'm glad so many people have had a better experience than I did! I won't make it again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "atttt"
},
"reviewBody": "So simple, really great! Fixed them just as the recipe said. Then mixed a little butter, vanilla, confectioners sugar and milk for the icing and had a great midnight snack for guests. An awesome no muss, no fuss recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Marie Tidwell"
},
"reviewBody": "Easy and yummy. Just sifted powdered sugar on them and served with ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kasey Bielecki"
},
"reviewBody": "I love this recipe. Every year I go blueberry picking and end up with 15 to 20 lbs of fresh blueberries. This recipe is always in my rotation. It is quick, easy and a crowd pleaser. I often get asked for the recipe and people are always amazed at the simplicity of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingCutie"
},
"reviewBody": "These are amazingly simple and yummy. My husband is a blueberry fanatic, and absolutely loves these little things. They're also perfect for overnight guests because of the minimal preparation and cook time involved. Will be coming back to this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mmhmm"
},
"reviewBody": "I was hoping this would somehow taste better than blueberry mush inside a crescent roll, but it didn't. It was fairly simple, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milo"
},
"reviewBody": "This is a great simple recipe/idea. Like the reviews suggested, I also simply mixed the blueberries with the sugar in a bowl instead of adding them separately to the dough. If you pack too many blueberries in, it does leak out and can make the pastry soggy. It's definitely important to seal the pastry well before baking! I've used other fruits with this too, but a real favorite was Nutella :). Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINGERLY88"
},
"reviewBody": "Delicious! I did have some leftover cheese filling from a coffeecake I made but I know they would be great without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Super duper simple. I don't know why I can't seem to get my little triangles folded up nice and neat and pretty like other cooks, but crescent rolls are sort of my nemesis in the kitchen. This time was no exception as the rolls popped open as soon as I got the paper off one side and they came apart in the tube, so I started with a mess. I managed to get them all out in as much of 1 piece as it would but they sure aren't pretty. Good thing my family cares more about flavor than appearances. I drizzled these with a homemade vanilla glaze. My hubby was most impressed with these gems so it was worth the struggle with the crescent dough. I'd make this again even wrestling with the pesky roll dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Litegal1"
},
"reviewBody": "Dreamy sighs - these were absolutely wonderful! I used frozen berries (simply rinsed to soften) tossed with the powdered sugar. Once done, we topped with leftover berries, some blueberry syrup (from AR), and home made whipped cream. To die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin S"
},
"reviewBody": "These are amazing!! I can only make them when I am having people over or else I end up eating them all!! I used frozen blueberries and cooked just a few minutes longer and they were wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandy VanArsdale Gober"
},
"reviewBody": "These were pretty good. Needs something to make them great,just not sure what that is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charis"
},
"reviewBody": "These are awesome!! My kids loved them! I made the blueberry, then ran out of berries. Then, I tried bananas and they were even better!! We also sprinkled with 1/2 pack of stevia instead of sugar. YUMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Peggy S"
},
"reviewBody": "Hardly what I would call a turnover. My husband is a big connoisseur of turnovers and admitted they tasted like dinner rolls filled with blueberries.\nTurnovers are supposed to be big and flaky. Next time I'll try making them with puff pastry dough.\nSorry, but quite frankly, I don't see this recipe falling anywhere close to the 4 &amp; 5 star ratings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PlaceOfYes"
},
"reviewBody": "Flaky crescent rolls, tart blueberries, sweet frosting. This is fabulous! So quick and easy! I made a homemade lemon frosting for the topping and it was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "made this for dessert with family. It was a big hit with everyone but especially the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gammie"
},
"reviewBody": "i made these for an office brunch and they were a big hit! Followed the recipe as written and they were so easy....even made them a day ahead and stores in airtight container....will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tjohnson034"
},
"reviewBody": "The kids and I just made these. They are so easy and so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "So easy to make- and DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda_Panda"
},
"reviewBody": "These were way better than I had anticpated. They were super easy to make and everybody loved them. Will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lacey"
},
"reviewBody": "These were tasty though not really my thing. I found it a small pain to get the crescent to come together. I would make these on parchment paper as several came open and I have to clean cooked blueberries off my pan. I am giving this 3 stars instead of 4 because of my own preference. My hubby ate quite a few of these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmily"
},
"reviewBody": "OMG we ate the whole batch in like 10 minutes! Made them just like the recipe.. very easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Fellows"
},
"reviewBody": "Fantastic and so easy! I have made this a recipe a few times for my fiance, and he LOVES them for breakfast! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Hamilton"
},
"reviewBody": "YUM!! I didn't have powedered sugar, so I used sugar and put a tsp of cream cheese over the berries, rolled it up and voila! I can't wait to bring it to my coffee gathering tomorrow :) thank you for the idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PONTIACGIRL71"
},
"reviewBody": "Excellent recipe, the only problem is how addictive they are! I drizzled an almond glaze over them (icing sugar, milk, almond extract)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EXPERIMENTATOR"
},
"reviewBody": "So easy and so yummy. I use 6 blueberries per turnover, and always use more than one package of rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacielynne"
},
"reviewBody": "Loved these. I have tons of blueberries in the freezer and always looking for quick and easy recipes. Topped with a glaze of lemon juice and powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JJRsMomma"
},
"reviewBody": "These are very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liane G."
},
"reviewBody": "I used fresh raspberries and cut-up fresh strawberries and they were a big hit! I made 24 of them to bring to a church breakfast. Definitely taste better warm. Very easy and inexpensive to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovebeingamom"
},
"reviewBody": "Very good, I gave it 5 stars because of the ease of recipe and few ingredients! Everyone enjoyed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "This recipe was easy and delicious! I only made one change, instead of vanilla frosting I made a lemon sauce with lemon juice and powder sugar and drizzled it accross the top. The family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danica Hicks"
},
"reviewBody": "I used canned Blueberry pie filling instead of berries and sugar. I also used warmed vanilla frosting to drizzle on top. My family is in LOVE with this great recipe, good thing it is easy!! Thanks for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "For such a simple recipe I could not believe just how good these taste. I made them this morning to serve at a coffee morning and book exchange I was hosting and everyone loved them and wanted more, more, more. I used two cartons of dough. Rolled each crescent in a ball and then rolled in a small oval with my rolling pin, I wet the edges and filled with the blueberries and sugar which I had already mixed together. Made sure the edges were very well sealed to save the blueberries leaking and baked on a large Pampered Chef stoneware bar pan. Once they were cooled I piped with vanilla frosting and a dusting of conf. sugar. Delicious, I will me trying these will all manor of fillings..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Marie Poulsen"
},
"reviewBody": "I was skeptical on how these would turn out, since the recipe is so easy. WOW! They came out great! I used fresh blueberries, and instead of topping with frosting I served with ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RobynMomto2"
},
"reviewBody": "Very easy and yummy! I made these tonight and my family already wants to know when I am going to make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eclarkson09"
},
"reviewBody": "I made these but with my own puff pastry and frosting and the inside was delicious. I'll definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GANNADAV"
},
"reviewBody": "I thought these were very good! I followed directions and then made a drizzle by adding half and half to powdered sugar - instead of the prepared frosting - quick and a very tasty way to use fresh blueberries - Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Marks Meadors"
},
"reviewBody": "These were soooo easy and they tasted great! I tossed the berries and sugar before filling the rolls and made a powdered sugar glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenabug"
},
"reviewBody": "YAY! I'm very kitchen challenged but my inlaws gave me 2 pints of blueberries to do something with and I needed fast and easy! This was perfect and plate licking good! I am sugar sensitive so I substituted honey inside and sprinkled some ground flax and cinnamon too- then after they baked I put a drop of honey on each and more cinnamon. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gswoody"
},
"reviewBody": "These were good and easy. My blueberries were a little on the tart side, however, so I'm sure they'd be better if the blueberries had been sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "These simple little turnovers are absolutely wonderful! I will definitely use this recipe over and over again! Did not have icing so I used confectioners sugar with a little milk to drizzle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katy_ford32"
},
"reviewBody": "I bake desserts for our family-owned restaurant and these were a huge HIT! I glazed them in a powdered sugar/water glaze and decorated the tops with buttercream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Herbest"
},
"reviewBody": "My family loved these, I used frozen Berries that I thawed and drained,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azmommyof2"
},
"reviewBody": "Followed the recipe &amp; it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ollie"
},
"reviewBody": "These really were surprisingly delicious, and so easy! I changed it a little bit to make it even easier. First, I lined the baking sheet with parchment paper (so cleanup was a breeze). Also, rather than sprinkle the blueberries, and then the powdered sugar before rolling it up, I just tossed them both together before placing them on the croissants. Make sure you seal it really well, otherwise the filling will leak. These were really good right out of the oven... and I'm sure they'll also be wonderful for breakfast tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melisa Creemer"
},
"reviewBody": "Really easy and good! I used honey instead of powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrie_cooks"
},
"reviewBody": "I'm rating this a five-star recipe because it is SO easy to prepare and still delicious! My husband really loved this recipe. I think that I personally prefer to use puffed pastry for turnovers, but this recipe is perfect if you don't have a lot of time but want to create an impressive brunch treat or dessert. I made a buttercream icing and drizzled it on top. Simple, easy, and delicious, and a fun project to do with my daughter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENHAMNER"
},
"reviewBody": "These are really fantastic! So easy to make and very yummy! I made my own butter cream frosting and used a plastic bag to drizzle and it was the perfect combo! I am sure these will become a staple treat in our house. Could also be great for a brunch treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kori Lavertue"
},
"reviewBody": "I wanted something quick and yummy to make with extra blueberries...well this is the perfect recipe. They were absolutely yummy. I will definitely make these again, since they're almost gone already!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/147378/blueberry-turnovers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/147378/blueberry-turnovers/",
"name": "Blueberry Turnovers"
}
}
]
}
}
, "about": [
]
}
]