				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blue Cheese Ball"
,"datePublished": "2019-04-02T02:50:19.000-04:00"
,"dateModified": "2021-08-26T12:18:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LOONEYPROFESSOR"
,"url": "https://www.allrecipes.com/cook/1273145"
}
]
,"description": "Only five ingredients combine to make an unforgettable classic cheese ball with the distinctive flavor of blue cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dM4pUtr9SSv0HhligL-lxA85gfU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9369645-5ce39618b815411596f149f35b47fe9b.jpg",
"height": 2000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blue Cheese Ball"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "107"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "207 kcal"
,"carbohydrateContent": "3 g"
,"cholesterolContent": "45 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "255 mg"
,"sugarContent": "1 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 (8 ounce) packages cream cheese, softened",
"1 cup crumbled blue cheese",
"1 cup shredded sharp Cheddar cheese",
"0.25 cup minced onion",
"1 tablespoon Worcestershire sauce",
"1 cup chopped walnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, stir together the cream cheese, blue cheese, Cheddar cheese, onion and Worcestershire sauce. Transfer to a separate bowl that has been lined with plastic wrap. Cover and refrigerate overnight."
} ,{
"@type": "HowToStep"
,"text": "The next day, gather the cream cheese mixture into a ball. Spread the walnuts out on a dinner plate. Roll the cheese ball in nuts until coated. Refrigerate or serve immediately."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT490M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karma"
},
"reviewBody": "Brought this to Christmas Eve and everyone loved it! I made three small balls and rolled one in dried parsley and one in dried cilantro as well. Will start making every year for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buffyfoster"
},
"reviewBody": "This is THE recipe for cheese balls of holidays past. I change 2 very minor things after trying as-is the first time. I add just one garlic clove grated on a micro plane, and I roll it in toasted pecans instead of walnuts. Do NOT leave the onion out! I find it gets better after a few days in the fridge.. just do the rolling in the nuts right before you serve. Save this one. It’s truly the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Rhea Thomas"
},
"reviewBody": "I’ve been making this cheese ball for years and my mother made it years before me. Very popular in the family during the holidays. I add chopped black olives and a dash or so of Tabasco sauce. Never wrote my actual recipe down. Was glad to find this to help refresh my memory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RontheDon"
},
"reviewBody": "It didn't quite turn out how i expected, but it's alright. I mean, overated af but it's whatever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "winanemmy"
},
"reviewBody": "These is a family favorite. I serve with veggie sticks like bell peppers, carrots, celery and crackers. It’s definitely a hit, I’ve also used different nuts if I don’t have walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Gregory Tatman"
},
"reviewBody": "Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adrian784"
},
"reviewBody": "I used green onion. I also coated the outside with parsley instead of nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Tarter"
},
"reviewBody": "I used chopped pecans instead of walnuts which turned out great. However, next time I want to add crispy bacon to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Chastain-Coates"
},
"reviewBody": "I have been making this for almost 40 years, it is the best! Everyone loves it even people who really do not care for blue cheese! :) You will not be disappointed with this easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel den Hoed"
},
"reviewBody": "I love this recipe! I’ve made it multiple times and also without blue cheese for pickier family members. It’s always well loved and eaten quickly. I use Annie’s Worcestershire sauce to make it vegetarian friendly. I substitute the regular onion for dried minced onion for a more subtle onion flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terri Geer"
},
"reviewBody": "This is similar to the cheese ball that my Grandmother, and myself, have made for decades.\n\nI use the cream cheese, the blue cheese and a lot of minced garlic. I long ago stopped using nuts because it was getting in the way of the cheese. But my Grandmother used chopped walnuts. Back when I did use chopped nuts I used chopped almonds or cashews. And in my family, all generations, we use original Ritz Crackers. Nothing else tastes the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pegatha"
},
"reviewBody": "Flavor was delish but a bit soft to hold shape. I grated the onion so maybe too juicy?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie White Johnson"
},
"reviewBody": "One of my favorites! I changed it up just a bit and replaced the onion with shallots and the walnuts with pistachios. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Paris"
},
"reviewBody": "Perfection, exactly as described. I didn't add or subtract anything, even though I was a bit skeptical of the combination...and it was absolutely divine. The recipe made two good sized cheeseballs, and we ended up eating one ourselves at home. So very good, but better when you let it sit for the recommended time, as the flavors blend together and mesh better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScrapDiva"
},
"reviewBody": "The only change I made was to change the nuts from walnuts to pecans. It is terrific and even people who don't like blue cheese like this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "Made it exactly as the recipe said to. Actually, it is so easy, my husband made it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie "
},
"reviewBody": "Made exactly as written and it was a big hit. Being Greek, none of my 40+ relatives knew what a cheese ball was and they all loved it. I would halve the recipe next time, as written it is a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey"
},
"reviewBody": "Love it!! Used shredded cheese for outer layer. It took no time and was great! This will be my \"go to\" for a last minute potlucks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kobie75"
},
"reviewBody": "My whole crowd loved this cheese ball! The blue cheese gave it just a little different flavor. I made two smaller cheese balls out of so it. I meant to try one with raspberry jam over it but people dove in before I could top it. I think next time I'll add more cheddar cheese as well. But as is, it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3marbles"
},
"reviewBody": "The cheese ball was awesome. Next time, I think I will decrease the chopped walnuts and add them to the mixture instead of the outside and roll the cheese ball in Lowry's Seasoned Pepper instead. Black pepper and blue cheese. . sounds like a good combo to me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Judylee"
},
"reviewBody": "A"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Church"
},
"reviewBody": "I have been making a recipe very similar to this for about 40 years. I lost my recipe several years ago. I checked here just to make sure I should add worcester sauce. My recipe calls for a small wedge of blue cheese and a small jar of Kraft Old English cheddar spread. My grocer was out of the Old English today so I substituted the shredded cheddar which tastes just as good. I don't use onion but I did use minced garlic. Recipe was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren MG Burt"
},
"reviewBody": "I made this recently for a holiday party and it was a huge hit! I used pecans instead of walnuts and added them in the mixture - I still rolled it in pecans the next day. I also used extra sharp cheddar cheese. And I added a pinch of minced garlic. It travels well and holds up for a party. Very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy Buckley Wuerdeman"
},
"reviewBody": "I used very high quality blue cheese and I thought it was a little strong. I would cut the amount of blue cheese back considerably"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Rafiki Scarpitti"
},
"reviewBody": "Oh my goodness! I have not been able to have cheeseballs in so long, so I tried this recipe for a party. Such a hit!! I made it as-is, but with less walnuts. 1/2 cup instead of 1, which was more than enough! Some hints- I put mine in an electric mixer and that blended and crushed the cheddar cheese so that it wasn't really obvious there was cheese in there- So good and creamy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soup Loving Nicole"
},
"reviewBody": "I personally cannot stand blue cheese and am not a fan of cream cheese either. I made this for hubby and my 5 star rating is based off of his feedback. I made as written except that I used pecans instead of the walnuts (his preference). So simple to prepare and with few ingredients yet packed full of flavor. This one is a keeper for the blue cheese lovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jadite47"
},
"reviewBody": "My favorite cheese ball recipe that always brought rave revues."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele White Hester"
},
"reviewBody": "Made this tonight and couldn't wait to chill it and make it into a ball -- it is absolutely delicious! Especially if you are looking for a cheese ball with a good sharp taste to it! I made no substitutions -- only used New York Sharp Cheddar (which is a very sharp variety). This one is going into my \"make again\" file!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessg"
},
"reviewBody": "I have been making this Cheese Ball for years and it is still one of my favorite things ever. I usually only make it during the Holidays, but I would love to have one in the fridge all the time. The only differences I make is to use pecans instead of Walnuts and I go ahead and roll it in the nuts right away on wax paper and then wrap the whole thing up in wax paper and refrigerate it. I have found that refrigerating it first makes it crumbly and is hard to get the nuts to stick well. It is a little messy to do it soft, but it is worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kendra Johnson"
},
"reviewBody": "I made this cheese ball once and it was a big hit. I'm making it again to take as an appetizer for a family Thanksgiving dinner. Super easy to make and has a lot of great, but mellow, blue cheese flavor without being too strong for those who may not enjoy straight blue cheese. I followed the recipe 100% (using red onion because it didn't specify which type) and really enjoyed it served with a hearty wheat or whole grain cracker. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Schulte"
},
"reviewBody": "As someone who is trying to find \"PERFECT, MAKE AHEAD, so you can enjoy your guests\" recipes, this is a KEEPER! Very EASY, yet exquisite.\n\nI'm not a fan of someone giving a recipe one star, and then you find they changed everything about the recipe - but most who changed this recipe a little, gave it 5 stars. So, I did add a little garlic powder and tobasco sauce as recommended by reviews, and since I don't care for walnuts, I used pecans. WOW!!\n\nI entertain frequently and I'm guilty of trying very complicated appetizers that keep me in the kitchen, away from the party. This recipe will be on the base list of what I am serving EVERY time, so I can spend time with my guests with a glass of wine in my hand. LOVE!! And my husband, who is not a big fan of blue cheese, loved it too. I plan on serving it alongside roasted grapes with crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Yessenia Kissel"
},
"reviewBody": "really good a little big dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannonhb"
},
"reviewBody": "This was great, made it for Thanksgiving and the family ate it up! I used Costco crumbled gorgonzola blue cheese and it was fantastic! Rolled it in a combo of chopped pecans and walnuts with some dried parsley mixed in for color. Getting ready to make again today for a holiday party. Super easy! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THESTRAUGHANS"
},
"reviewBody": "This recipe was a big hit for thanksgiving. I added dried cranberries to the mix which made a sweet addition"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frugal-Foodie"
},
"reviewBody": "Fabulous!! I added a clove of pressed garlic to the mixture. I divided the mixture in two and made the nut-covered cheese ball from one half. The other half I used to fill pre-baked phylo cups. I toped them with a pecan half and a drizzle of honey. OMG. HEAVEN. I will be making this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanne Cain"
},
"reviewBody": "Easy and tasty. Changed this recipe to 8 oz of cream cheese instead of the recommended 16 oz. The cheese logs were not as soft. This did not effect the taste of the blue cheese as being over powering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettsi"
},
"reviewBody": "As decadent and delicious as you might imagine! I ate more than my fair share, I'm afraid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geemaof3"
},
"reviewBody": "My mom used to make this a lot for cocktail parties. I had lost the receipe so I am so happy I found it here. The only difference is that she used all blue cheese...no chedddar...and it is excellent!! Thank you for having this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hulabo"
},
"reviewBody": "Great cheese Ball recipe! Just the right amount of tang. It is a holiday tradition for me to make this cheese ball and it is always gobbled up. I add some chopped green olives and use pecans instead of walnuts. I also add some pecans to the inside of the cheeseball as well as all over the outside. DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "forpeepsakes"
},
"reviewBody": "I made the mistake of skeptically making 1/2 the recipe. This error left my husband and I standing at the counter, weilding individual butter knives for the last smidgen of cheese ball on the plate! Love this recipe! I will always make the full recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "moon_music28"
},
"reviewBody": "I made this for my French in-laws when introducing them to American Thanksgiving. It was super easy and really good. I'd definitely make it again if I need a quick appetizer to pick at."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom22GreatKids"
},
"reviewBody": "Super easy to make and a nice change from the traditional cheese ball. I only made one change, I used a red onion since it's what I had on hand. A real crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KristenK"
},
"reviewBody": "Ifound this recipe 2 years ago for Thanksgiving appetizer and now my extended family asks me to make it for every occasion! I add just a bit of garlic powder and it is amazing! If I am making it last minute, an hour in the freezer firms it right up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SQUASHBLOSSOMGIRL"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NSJOLIN"
},
"reviewBody": "I halfed it and it made a huge cheeseball. Everyone liked it. I served it with crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HoneyBee"
},
"reviewBody": "This was delicious! I didn't change anything about the recipe except I served it as a dip, not a ball...of course I used insanely good bleu cheese from Rogue Valley Creamery in Oregon. I served it with some really good crackers and slices of crisp apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BECKTY"
},
"reviewBody": "I was glad to find this. It's the same cheese ball I grew up eating, and I always lose the recipe. I do not generally like cheese balls. If I want cheese, I get some cheese slices. But this is a great tangy flavor. Perfect for holiday company. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Krueger"
},
"reviewBody": "PERFECT as is! Needs no modifications! (oops! forgot to mention I did use pecans instead though)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wyattdogster"
},
"reviewBody": "A true 5 stars! Made exactly as stated and it's fabulous. No one in my family likes blue cheese except for me and my elderly father. I made this for us to enjoy Christmas day and we couldn't keep everyone else out of it! It makes a huge cheese ball, so I divided it and made two cheese logs...saving one for New Year's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "Very good! This is almost exactly like the one my grandmother used to make for holidays. But rather than cheddar, we use all blue cheese, a clove of garlic, and cut the Worcestershire down a bit. Very good, MUCH better than anything you'll find at the grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlt21185"
},
"reviewBody": "I have made this receipe a few times and it's always a big hit. I recommend adding some garlic and any kind of nuts you have around work in place of the walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "had two holiday parties to go to so i made two smaller cheese balls. Served one as a cold cheese ball and one as a hot dip. Both were GREAT!!! will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary R."
},
"reviewBody": "Easy recipe and so very good I wouldn't change a thing other than I make two smaller balls instead of one large one. Every time I serve it I get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meyer"
},
"reviewBody": "Excellent cheese ball. I served this as an appetizer at a party and everyone loved it. I was short on time so I could not leave mine in the fridge overnight so I put it in the freezer for an hour and then rolled it in the walnuts. It worked just fine this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azrefugee"
},
"reviewBody": "Wonderful! We omitted the walnuts and added garlic just out of personal preference but I could hardly roll it into a ball because my husband was snacking on it the entire time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marciamellow21"
},
"reviewBody": "My husband and I love blue cheese, but we did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie22"
},
"reviewBody": "Excellent. Makes a lot though. I cut the recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I make this same recipe, but instead of shredded cheddar, I use 7 oz of aged \"Kaukauna\" cheddar cheese spread or \"Old English\" cheese. It makes it fantastic! My entire family looks for it at every holiday. The aged cheddar spread makes it a 5 star recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joelle"
},
"reviewBody": "Love, love, love this! If you like blue cheese then this will be amazing. It's so easy yet so full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Excellent combination of flavors and ingredients, but there's too much blue cheese in the recipe, it overpowers the other flavors, cut back and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOEMOMMA"
},
"reviewBody": "Excellent, best I ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kudu"
},
"reviewBody": "To each his own, but I will not make this again. It seemed bland and without flavor. After an initial tasting and the addition of cumin, paprika and basil the dish was a little more flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Shine Riddle"
},
"reviewBody": "Made this for a Christmas get together. Everyone loved it. The only thing I changed was that I rolled it in chopped pecans instead of walnuts as I am allergic to them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "leahnwells"
},
"reviewBody": "I was kind of bored with this cheeseball. It is different than other cheeseballs, but the blue cheese was the overwhelming flavor. I prefer something with more depth. Tabasco helped, but overall, it was still pretty blah. Maybe I'm just tired of cheeseball in general."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "It's A New Day"
},
"reviewBody": "Yummy! Followed the recipe exactly. Good stuff! This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bunnyb"
},
"reviewBody": "Guests enjoyed this and asked for the recipe, but it is not my personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Made this years ago and lost the recipe. Glad to have found this again because I love it. The onion I used was strong so wish I wouldn't have used so much of it. Next time I will be more careful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spammy"
},
"reviewBody": "Even my daughter who doesn't eat cheese liked this! I rolled into 2 logs and toasted the pecans first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KASUE"
},
"reviewBody": "I got this recipe from a co-worker 30 years ago and lost the recipe card a few years ago, so I'm delighted to find this recipe here! This simple recipe makes a delicious cheese ball -- the blue cheese balances nicely with the other cheeses, but gives it an interesting flavor. For Christmas presentation, you can divide the cheese ball into three smaller ones (or roll it into logs). Sprinkle one lightly with paprika, roll one in nuts, and sprinkle the third one lightly with chopped fresh parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "*ROBIN*"
},
"reviewBody": "This is just delicious! I'm not a walnut fan so used pecans, and made the first one exactly otherwise...I also made a second and added a half cup dried cranberries and it is also out of this world delicious! This is an A-1 keeper! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tdknop"
},
"reviewBody": "Excellent! Kids loved it. Easy to make, easy to eat - will definitely be doing this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Long"
},
"reviewBody": "I have made this again and again! It is so easy and very popular with guests!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DawnF"
},
"reviewBody": "This was very tasty and I got many unsolicited compliments on it. It wasn't too strong on the blue cheese flavor, depending on how you feel about blue cheese, that may be a good thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrhecht"
},
"reviewBody": "I've been using a version of this for a stuffed jalapeno filling, except I add crumbled cooked bacon and chopped fresh jalapeno (deveined and seeded) and I omit the onion. Then I roll the ball in finely chopped cilantro. It's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This was a hit at my Christmas Party. I added some blue cheese that was pre-mixed with pear. Instead of raw onion I used red onion and sauteed it till soft, set it aside to cool and added it to the cheese mixture. The sweet caramelized red onion went fabulous with the blue cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CWING77"
},
"reviewBody": "Very good. I find that adding a pressed clove of garlic pushes the taste up to 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AshleyF86"
},
"reviewBody": "Delicious!!! Only thing I changed was to mix the walnuts in with the cheese, and I used Extra Sharp cheddar...Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NADINE"
},
"reviewBody": "This is one of my favourites. I have been making it for years. Try heating it up in the microwave for a few seconds. YUM-O!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELODYROSE"
},
"reviewBody": "My grandmother always made this recipe when I was little. I loved it so much. I finally asked her for the recipe, she gave it to me and my family expects me to make it for every family function now. We all love it!! My sisters get so mad I won't give them the recipe haha. If they only new how simple it was. I must say, I have never had it with the onions. Definitely need to try that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Good flavor but I've had better, which I'm trying to duplicate. This is close but it's missing something &amp; I can't figure out what it is. I may try it w/green onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aly"
},
"reviewBody": "I've had this recipe for 18 years. It is the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody-cup"
},
"reviewBody": "Loved this! It was a big hit at Thanksgiving. Good with Wheat Thins : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kareno"
},
"reviewBody": "We put mixture in little ceramic dishes rather than forming into balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRAMMA GORGEOUS"
},
"reviewBody": "This is great - don't substitute the cheese for something else and don't try to freeze it - making ahead means you can wrap in cling wrap or foil and refrigerate it overnight for flavors to meld."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARINKAY"
},
"reviewBody": "This was really great. I used pecans-on hand. Nuts really added to this recipe. I cut it back by about 1/3 and it made a large log of cheese. Yummy in celery too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaB"
},
"reviewBody": "Made this over the holidays. My family thought it was excellent! I used pecans instead of walnuts and also mixed them in with the cheese ball instead of rolling them on the outside. Definately a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HomeschoolMom78"
},
"reviewBody": "This cheeseball is delicious! I do omit the onions and use pecans in place of walnuts. With these minor modifications, it tastes EXACTLY like the one my late father used to make for Christmas Eve every year. I've been looking for this recipe for awhile. Thank you for posting it! By the way, it is a MUST that this chill overnight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren LaFavre Richmond"
},
"reviewBody": "Excellent, makes 2 balls or logs. No changes at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tommygirl"
},
"reviewBody": "I made this for my Christmas appetizer. It was delicious! My mom (and her discerning palate) happily munched on this and wanted to take some home with her. This is a very good sign! Will use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "My family loves this recipe. I have been making it for 10 years and my mother before me since before I was born. You have to love blue cheese and it definitly needs a night in the fridge to let the flavors mingle. I roll mine as soon as I mix the cheese up. Then I wrap it in plastic wrap, add a red bow to tie it up, put it in the fridge overnight and its ready for transport to anyones house. Thanks for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BIGoleWILLYv"
},
"reviewBody": "This has more character than and run of the mill recipe. Good with wine and better for refined palate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "This was a great base from which to start! I had feta cheese instead of blue cheese, so substituted that. I also added a dollop of sour cream and a few dashes of cayenne pepper to \"hop\" it up a bit. Turned out delicious!\n\nI'm impatient when making a cheese ball, so I don't wait overnight to finish it. You'll get a bit messy, but it's OK to form your cheese ball when it's soft and sticky and roll it in the walnuts. Then you can start eating it earlier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YELLOW6"
},
"reviewBody": "This is delicious. Second time I am making it. I did notice the one I froze crumbled when I went to roll it in the nuts so I think it is not a good one to make ahead and freeze. It is very easy to whip up. Its what others call \"a keeper\"."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/163641/blue-cheese-ball/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17192/appetizers-and-snacks/dips-and-spreads/cheese-dips-and-spreads/",
"name": "Cheese Dips and Spreads Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/404/appetizers-and-snacks/dips-and-spreads/cheese-dips-and-spreads/cheese-balls/",
"name": "Cheese Ball Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/163641/blue-cheese-ball/",
"name": "Blue Cheese Ball"
}
}
]
}
}
, "about": [
]
}
]