				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce"
,"datePublished": "2020-02-01T02:50:36.000-05:00"
,"dateModified": "2022-09-13T19:46:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "HEBEGEBE"
,"url": "https://www.allrecipes.com/cook/585534"
}
]
,"description": "Worth the effort! Tender and flavorful, great for a dinner party. Make the sauce a day ahead to cut down on the prep time."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/f4uOoJwRhnwB_cLCDYsJtroVJrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/122210-blue-cheese-crusted-filet-mignon-with-port-wine-sauce-chibi-chef-1x1-1-269b98c2f3c746ecbd623a9c98c0cf13.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5569396185001",
"description": "Elegant and juicy filet mignon.",
"duration": "PT56S",
"name": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9fe85917-5b2b-45b9-ac05-b9e39159b965/1ef1a2e9-8017-479e-a3df-a1f2793f5ad3/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T08:31:47.759-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "506"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "402 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "85 mg"
,"fiberContent": "1 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "463 mg"
,"sugarContent": "1 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 tablespoon butter",
"0.5 cup minced white onion",
"3 cloves garlic, minced",
"1 tablespoon chopped fresh thyme",
"0.75 cup low-sodium beef broth",
"0.5 cup port wine",
"1 tablespoon vegetable oil",
"4 filet mignon steaks (1 1/2 inch thick)",
"0.75 cup crumbled blue cheese",
"0.25 cup panko bread crumbs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a skillet over medium heat. Add the onion, garlic and thyme. Cook, stirring constantly, until onion is tender. Stir in the beef broth, scraping any onion bits from the bottom of the pan, then stir in the port wine. Bring to a boil, and cook until the mixture has reduced to about 1/2 cup. Set aside. This may also be made ahead of time, and reheated."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Heat oil in a cast-iron or other oven-safe skillet over high heat. Sear steaks quickly on both sides until brown, then place the whole pan into the oven."
} ,{
"@type": "HowToStep"
,"text": "Roast steaks in the oven for about 15 minutes for medium rare - with an internal temperature of 145 degrees F (63 degrees C). You may adjust this time to allow the steaks to finish just below your desired degree of doneness if medium is not what you prefer. Remove from the oven, and place on a baking sheet. Stir together the panko crumbs and blue cheese. Top each steak with a layer of this mixture."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/f4uOoJwRhnwB_cLCDYsJtroVJrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/122210-blue-cheese-crusted-filet-mignon-with-port-wine-sauce-chibi-chef-1x1-1-269b98c2f3c746ecbd623a9c98c0cf13.jpg"
}
]
,"text": "Preheat the oven&#39;s broiler. Place steaks under the preheated broiler until the cheese topping is browned and bubbly. 3 to 4 minutes. Remove from the oven, and let stand for at least 15 minutes before serving. Serve with warm port wine sauce."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAMimi"
},
"reviewBody": "Excellent recipe. Made it for Valentine's Day. Husband said it was the best meal he's had in years. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy "
},
"reviewBody": "This was an absolutely delicious recipe. My entire family ate why last morsel and they wanted more...this was two days ago and guess what’s for dinner tonight?! Lol this is definitely something we will be making more of! Perfection!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NielsenMommy"
},
"reviewBody": "So mouth watering! Best steak dish ever. My husband said this is high end restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Feldman"
},
"reviewBody": "I followed another person’s advice and cooked the onions separately. I used a mixture of garlic, onions, thyme, and shallots and caramelized them. In a separate pan, I cooked the sauce down. I used port and beef bone broth concentrate. This left the sauce incredibly thick and flavorful. The steak I made the same, except I salted, peppered, and rubbed garlic on the meat 30 minutes before cooking. I plated the onion mixture first, drizzled the port sauce on top, and placed the steak on top of the onions. Served the meal with garlic mashed potatoes, sharp cheddar biscuits, and a salad with blue cheese dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rain Soto"
},
"reviewBody": "Fabulous. I used a different cut of steak because it's what i had available. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice"
},
"reviewBody": "I made this recipe for Valentines Day. I omitted the port wine sauce but this steak was probably the best I have ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnne"
},
"reviewBody": "This was really good. I would suggest you go with either the blue cheese topping OR the port wine sauce. I made both and at the end I didn't want to pour the port wine sauce over my beautiful blue cheese crust on the fillet. Personally, next time I will skip the sauce and just do the cheese crust. I did mine in a cast iron skillet. Seared it quick (1 minute per side) in Canola oil, on gas cook top then slipped in the oven for around 12 minutes. recommend a meat thermometer test at that point. Should be at 125F minimum (the meat will continue to cook while under the broiler). Added the blue cheese topping &amp; then under the broiler for about 2 minutes. Turned out medium rare, tender with a beautiful presentation. served with asparagus &amp; baked baby Dutch potatoes. This will be a permanent addition to our dinner menu collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Howard"
},
"reviewBody": "I adapted this to fresh venison cut from tenderloin. I pounded the steaks to about 1in. I salted and peppered them before searing. I cooked to medium which venison benefits from. About 7min. I also added some brined chanterelles and a teaspoon of corn starch dissolved in some of the port to help thicken and provide some gloss. Served over garlic smashed potatoes. Only caution is to get a good brand of bleu. Make crumbles yourself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Ryan"
},
"reviewBody": "This was a home run. Well worth the effort. Served at a dinner party (for 9 people) and everyone said it was the best meal they ever had. I would rank it as good as you’d get at any 5 star restaurant. My husband thought it called for caramelized onions so we ended up adding them on top.. will be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "This had superb flavor. I did things a little different though. After melting butter I added instant minced onion, chopped garlic and thyme. Then seared my fillets in the pan. I removed them before adding the beef broth and port. After reducing the sauce, I then returned fillets, reduced heat and covered pan to cook for a little while before placing under broiler with the panko and blue cheese. After resting fillets, I placed on plate and poured the sauce from pan over them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ash Samantha"
},
"reviewBody": "Just great all around. My meat wound up being over cooked for my taste although I followed the instructions. Usually an overdone steak is a deal breaker for me but the sauce and blue cheese crust were so flavorful and delicious I barely noticed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Trainor"
},
"reviewBody": "What can anyone say other than delicious - every time. Use a good Port."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J-Coffey Smith"
},
"reviewBody": "I'm a pescatarian, so I made this recipe using tuna steaks and it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMW"
},
"reviewBody": "It was a tremendous hit with three generations at our table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VABeachcook"
},
"reviewBody": "This is a simple straightforward recipe that I found on epicurious years ago and just as good as ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eri Hoshina"
},
"reviewBody": "What an impressive meal! Panko and blue cheese make such wonderful topping with perfect flavor and texture. I am a sucker for juicy fatty meats, and also, filet mignon looked too $$pricey$$ to me, so I used ribeye steak instead and it came out great! But I do see how this could be even more impressive, sophisticated, and delicious cuisine with filet mignon. Another change was that I used red wine as I did not have port wine on hand and I am also not a big fan of port wine. Again, the wine sauce came out great, but I am definitely curious to see how different it would be with port wine. I will definitely try the same recipe with filet mignon and port wine for a special occasion next time. Thank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathy"
},
"reviewBody": "This recipe is so easy and absolutely delicious! I have made it for birthday celebrations and other special occasions and always is impressive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonard Eisenstein"
},
"reviewBody": "PERFEC+ION!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WetzelHillman"
},
"reviewBody": "Five stars across the board. Simplicity. Flavor. Style. Added some taters, my favorite veggies &amp; and some hot rolls. Perfect Saturday dinner for the game."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebecca"
},
"reviewBody": "So delicious, I can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rafumed"
},
"reviewBody": "excellent, not too complicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jawn Wms"
},
"reviewBody": "I used Venison backstrap instead of filet mignon &amp; merlot instead of port &amp; I wrapped the filets with bacon. Since I was cooking so much I also increased proportions of the panko/blue cheese mix which I didn't have to since the filets shrank so much. But it was a tasty side &amp; the left over was good on salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elene"
},
"reviewBody": "I accidentally forgot to buy the BLUE CHESSE! It was Christmas day when I discovered this huge mistake! Like any cook would do, I made it anyway without the blue cheese and it was scrumptious!!!! WHEW!!! I've made it for Christmas dinner 2 years and will again this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani"
},
"reviewBody": "Absolutely loved this. Prepared the delicious sauce in the morning and reduced it quite a bit. It was super yummies. Next time I'll cook my steak a little longer as it was a bit rare for my taste but otherwise the filet mignons were absolutely scrumptious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dave"
},
"reviewBody": "I followed the directions pretty much exactly. Though I used Gorgonzola blue cheese. I seared the steaks for 2 minutes per side on high heat in a cast iron pan. Then put them in the oven for 10 minutes. After covering with the cheese mixture, I broiled them on high for 4 minutes on a middle rack. I served them with mashed potatoes, the port wine sauce (after straining), and grilled asparagus. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerry Vermeer"
},
"reviewBody": "This was very, very good. I made one small change only so that I wouldn't have to run to the grocery store and that was I used Cabernet wine instead of Port cause that's what I had in the house:) It was outstanding. I followed everything else by the book...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Wik Chastain"
},
"reviewBody": "After reading some of reviews on sauce I was unsure but made it exactly as recipe called. We served sauce on side to try it and everyone loved it! We used tenderloin steaks cut at 1 1/2\" cooked on grill for everyone's desired temp. I also used a different recipe for crumb crust! 1/4 lb blue cheese crumbled, 1/2 cup Panko and 2 Tbsp of heavy cream, stir til well mixed and refrigerate. When steaks were cooked I packed on the crust and put under broiler til melted and crispy!! (Only a few mins) I served with twice baked potatoes and roasted asparagus! One of best meals I ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mdill"
},
"reviewBody": "So delicious!!! Also, pretty easy to make. I served the steak on top of mashed potatoes and spread the sauce all over. Had to find the port wine at the liquor store. Relatively inexpensive. Definitely a new favorite in our household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad-Victoria Hunter"
},
"reviewBody": "I did this as the directions asked but I added fresh bacon to the topping along with 2 tbl of real butter in the topping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Collin Holt"
},
"reviewBody": "OMG this is good. Had to use a cab wine and placed it on top of tri colored couscous. Everyone wanted more. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayme LaFleur"
},
"reviewBody": "My boyfriend really liked it! We both give it a 9 or 9.5 out of ten. I didn't think the sauce was necessary. Don't get me wrong, it was good, but it was work for as much sauce as you got, and it was flavorful, but didn't add to the deliciousness of the steak itself. Make sure you are using port wine and not just basic red wine. Port is more of a dessert wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "The steaks and topping were amazing, but I could have done without the sauce - it didn't need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnapoli9800"
},
"reviewBody": "I just made it this past weekend and it was fantastic! I didn't have port wine, so I used Malbec and I added mushrooms and that gave the dish a great touch! I will be making this more often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jason boerner"
},
"reviewBody": "Side dish - green beans cooked in butter 2 garlic cloves and some brown sugar. Personally I thought the sauce was a bit gross... I would consider skipping it, maybe do a coffee and black peppercorn rub or just season your steak as you like... For this reason we put the sauce on the side to try it both ways. The blue cheese panko was kinda interesting and good. The presentation of steak on top of mashed potato looks good but makes it weird to cut the steak but .. Still good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stan"
},
"reviewBody": "This recipe turned out great, but next time I'll have to shorten the cook time, my steaks came out well done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2nickels"
},
"reviewBody": "Works out perfectly and my guests were delighted (so was I). One tip is NOT to put the whole frying pan into the oven, but transfer steaks to a high quality cookie sheet or pan before putting in the oven. Then you can work on the sauce in the frying pan while the steaks cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Muterspaugh"
},
"reviewBody": "I didn't use the port sauce but the blue cheese on top of the steak was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SaraMae"
},
"reviewBody": "This recipe was ok. I added some wild mushrooms to the sauce for added flavor and it was good, although next time I think I'll skip the sauce entirely. The steaks with the blue cheese topping, all melty and crisp on top, had enough flavor without the sauce. I also used tenderloins as the butcher was out of filets, and they were just as delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lici"
},
"reviewBody": "I made this tonight and it was absolutely fantastic. I did use ribeye instead of filet and seasoned it with a steak seasoning before cooking it. I also made mushroom risotto and green beans as a side. Planning to make it again real soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "5455wherry"
},
"reviewBody": "Did the original searing on the grill then completed in the oven. Was cautious about the sauce but made it as directed anyway &amp; it was really good! Used blue cheese as directed &amp; also made goat cheese w/ panko mixture. Prepared half the steaks with the goat cheese &amp; half with the blu"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENJABBER"
},
"reviewBody": "Delish! We used NY strip. Perfect timing on the steaks. Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Finley"
},
"reviewBody": "Amazing!!!!! used a nice Merlot instead of port wine. Great when coupled with artichhokes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andi Evans"
},
"reviewBody": "Made it last night...delicious! I made this recipe for 3 and used left over blue cheese and panko to sprinkle on sauteed asparagus and garlic mashed potatoes. It was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "*Lisa*"
},
"reviewBody": "This was pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAPTORSHARK"
},
"reviewBody": "holy lord this was delicious. followed recipe exactly, I made the full amount of sauce but only 2 filets. Only thing I changed was I wrapped the filets in thick-cut bacon and secured with toothpicks, and marinated them in a mixture of Burgundy wine, worchestershire, honey, garlic&amp;herb seasoning. I also used gorgonzola not blue cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "As a Valentine's gift, I cooked this for my wife and had it ready and waiting when she got home. I followed the recipe exactly and it turned out completely perfect. It was easily the best steak I've ever prepared, and probably the best I've eaten from anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Rose"
},
"reviewBody": "Wonderful - easy and delicious. We took it out at 131 degrees and it was a perfect medium rare when done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mihaley"
},
"reviewBody": "This was delicous! I made this for Valentines day dinner. I used a flat iron steak though but followed the directions here and they turned out nice and medium-rare on the inside like I intended. Very tender and the blue cheese/bread crumb topping was delicious. For the sauce I used 1 c of onions instead of a 1/2 cup and also used a merlot instead of port. The sauce still tasted good but next time maybe I'll try with the port."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bobbies-girl"
},
"reviewBody": "I followed the directions exactly. My husband posted this on Facebook saying it was the best filet mignon he's ever had -- and he's 45 years old!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moluvjoe"
},
"reviewBody": "Awesome restaurant quality recipe! I used onion powder and garlic powder instead, but still turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bellepepper"
},
"reviewBody": "This review is for the reduction only. I have to say this just didn’t work for me. I reduced the broth/wine mixture further than specified in the recipe and still had a very liquidy sauce. I would have had a better result had I stopped reducing and thickened this a bit with a corn starch/water slurry. Consequently this just dripped off the steak and onto the plate. So, I doubt I’ll be doing this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannette Beck"
},
"reviewBody": "Nice combination. I also made the dinner for two and made the sauce recipe for four. Used olive oil on the steaks instead of vegetable oil. 15 minutes baking time is a little too long for medium rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coop's mom"
},
"reviewBody": "Simply put, this is fantastic. Loads of flavour. You have to make this. You will not be dissapointed. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ExperimentingJamie"
},
"reviewBody": "This was sooooo amazingly yummy! For as wonderful as it was, it was really simple to make. There were two of us eating and recipe calls for 4 servings. I made it as is and we have dinner the next night too. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candace Parker"
},
"reviewBody": "My husband gave this 5 stars, I would give it 3, so we will split the difference and call it 4. It was tasty, but the blue cheese overpowered the beef, and I didn't like the texture of the crumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I followed the original recipe, and it exceeded my expectations. A wonderful blend of flavors, the sauce was rich and hearty. Reminded me of a meal you'd get at a five star restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "The cheese is very, very over powering. Otherwise, pretty tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Flaherty"
},
"reviewBody": "Wonderful. Admittedly I did not follow the entire recipe but just the bones. I am allergic to onions so that was out. We didn't have blue cheese so I used fresh Parma/Reg and the sauce burnt so I ommited that completely. The meat was wonderful and the topping rocked! I wish I could have followed 100% but it was perfect anyway!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maurice GrillMaster Burt"
},
"reviewBody": "I give four stars with an asterisks. I dont know how people could cook meat in the oven with straight salt and pepper....bland bluh. I did however, go salt and pepper and cook rib eye on the grill. I topped steak after one flip with a light layer of grey poupon and the bleu cheese crust. AWESOME. I do have to note the cut I tried in the oven was a club tenderloin...a poor mans filet if you will. Nonetheless, it was not good at all...go figure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "My husband didn't stop raving about this steak. I used Sirlion instead of Filet. He said it was better than any restaurant steak he'd ever eaten! Whoohoo! Thanks for this fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeenO"
},
"reviewBody": "Easy sauce, a majority of these ingredients should be a staple in your pantry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "olivia Johnston"
},
"reviewBody": "Wow. This came out perfect. I wouldn't change a thing on this recipe. It will be a Valentine's Day tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla Manus Kuepker"
},
"reviewBody": "Wow. This was absolutely delicious and very easy. I made it for my boyfriend for Valentine's day (he LOVES blue cheese). I used a 1-pound New York Strip. After searing in my iron skillet, I baked for 10 minutes and broiled the topping for 3 minutes, which was close to perfect for medium-rare. I left it in the skillet for all three phases, which worked great. While the meat was resting for 15 minutes I broiled the asparagus in olive oil and lemon pepper, which was perfect timing. A starter of shrimp cocktail, spring mix with slivered almonds, craisins and sweet grape tomatoes in a white wine vinaigrette, and garlic mashed potatoes rounded out the meal, paired with a lovely French Bordeaux, and \"chocolate bar fondue\" finished it off. Delicious. I'll definitely do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Blackburn"
},
"reviewBody": "Restaurant quality recipe. One comment I would make is that I would double the sauce. As shown in the picture, I served it on a \"bed\" of mashed potatoes. Although, I had sauce it would have been awesome to have more sauce. Also, I used a chunkier blue cheese and didn't broil it, but baked the topping on top of the steak. It was awesome..we had large crumbles of blue cheese to eat with steak. I would use this in entertaining."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zainny8"
},
"reviewBody": "Made this for my boyfriend for Valentine's Day dinner. We both loved it! The blue cheese added an awesome flavor to the perfectly cooked meat. The only thing I changed was the amount of time I had the steaks in the oven. He likes his rare and I like mine pretty red. Other than that, I followed the recipe to the tea. A must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMK"
},
"reviewBody": "I made just the steak. Seared the steak in a cast iron skillet and then baked in 350 degree oven. Turned out better than grilling or broiling them, because they were not dried out at all. My husband likes his well done and his turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cbella"
},
"reviewBody": "super fantastic- made as directed - thyme (didn't have it). Cant wait to make again and to serve it to friends"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gsxrgirl"
},
"reviewBody": "These were wow.. my husband said he's never ever had a steak that wasn't cooked on a grill come out this wonderful and taste so great.. I also loves the port wine sauce, I read others didn't but I thought it was terrific.. I may never go to another steakhouse again!! 100 stars x infinity!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry"
},
"reviewBody": "Great meal! Port wine sauce is a great contrast with the sharp blue cheese flavor. \nI served it with roasted new potatoes and chicken broth braised bok choi. Big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Beery Dreyer"
},
"reviewBody": "The guys gave it 3.5 stars, I gave it 4.5. The wine sauce was delicious. Easy and tasty! We had it for Christmas dinner 2011 with garlic mashed potatoes, salad and homemade rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Dayle Windley"
},
"reviewBody": "Wow! Just wow! Followed the recipe exactly except no bread crumbs. Didn't have them onhand so left them out. Otherwise followed it to the \"T.\" Loved the way the flavors of the blue cheese &amp; port wine played off eachother. This is an instant favorite. Inexpressably stellar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadySaphyre"
},
"reviewBody": "Fantastic recipe. Made this for Valentine's Day dinner and DH nearly inhaled it! Also got a thumbs up from my very picky 12 yo son."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "joanniegl"
},
"reviewBody": "I was not impressed with this recipe. My advice would be to save the blue cheese for a starter salad, grill your steak, and have a glass of port."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anay"
},
"reviewBody": "Amazing recipe. I have made this twice now for my fiance and I. The most recent I made with London Broil (cheap jr high teacher), which still turned out amazing. The dish was accompanied by slightly mashed potatoes and broccoli. This is a great recipe to make for a special holiday or occasion with just you and someone you love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweetie"
},
"reviewBody": "I made without the sauce and it was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "Simply AWESOME"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "Followed recipe exactly as written. This was the best filet ever! Even if you don't like blue cheese that much, it's not overwhelming at all. DO yourself a favor and try this! It's superb! I have made this twice now and you really don't even need step one or any of those ingredients. It would be perfect without the port wine onion mix. The bread crumbs and blue cheese is all you really need."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALG"
},
"reviewBody": "Made this last night for the boyfriend's birthday. It was amazing! Roasting the filet made it unbelievably tender. The boyfriend said that he thought it was just as good if not better than what he has gotten at our local steakhouse. Next time I will double the sauce. It was delicious &amp; we wanted more for the mashed potatoes that I served it with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motherof3"
},
"reviewBody": "My ABSOLUTE FAVORITE meal ever!!! If I could give it 10 stars, I would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha L"
},
"reviewBody": "This is so delicious. I followed the directions very closely except it was dinner for two but made the entire sauce. It was delicious and looked fabulous. It actually looked like the picture (which is not always the case). Changes I made were to use slight more panko and less blue cheese since I'm not a huge blue cheese on steak fan and I only used 1 garlic clove and I used a mortar and pestle to liquify it because I hate pieces of garlic. My boyfriend who is not a blue cheese fan said it was delicious and not overpowered by the cheese. It really does taste and look like a steakhouse meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Paternoster"
},
"reviewBody": "So tasty and easy, it felt like 5 star dining. I will make this again and again, I love to grill but this is a great dish when I want beef but can't grill (that happens often up here dueto the weather) ty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DCbackyardBBQer"
},
"reviewBody": "absolutely incredible! I followed the recipe exactly and combined it with feta cheese mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zuzana Halbgewachs"
},
"reviewBody": "Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lzmama"
},
"reviewBody": "My husband made this for my birthday. It was very good, though the wine sauce was a bit salty for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sabrinacaverly"
},
"reviewBody": "This recipe was my very first attempt at making filet mignon and what a hit! I suprised myself by how well they turned out. The panko crumbs/blue cheese mixture was perfect. I wouldn't change anything about this recipe. Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphnearle"
},
"reviewBody": "Made this for my husband and I's anniversary and it was awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sus"
},
"reviewBody": "excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel"
},
"reviewBody": "Made this for my husband on Valentines Day. I had never cooked steak in the oven before, only on the grill, so I was skeptical. However, it turned out amazing. My husband said it was the best meal he had ever eaten including fine dining experiences. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keepslearning"
},
"reviewBody": "Awesome! Only thing I changed was the meat cut. Shoulder Tender Medallions were excellent for this and fit better in my family budget. I no longer have a reason to visit a steak house unless I want to pay 10x as much just to be waited on. Super easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "akajenni"
},
"reviewBody": "Wonderful!\nAll I had on hand was Merlot, but other than that I made right by the recipe. Will definitely be using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Firefly9"
},
"reviewBody": "So hubby was worried when he saw that I was putting a steak in the oven instead of grilling it. But have no fear...first bite..\"Wow, that's good......that's really good\". Never doubt Allrecipies! I made as written, added some sauteed mushrooms. Very expensive dish, but a very nice treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim B"
},
"reviewBody": "Made this for Valentine's day- not to difficult to make even for me who is not great at making steak. The only change I would make is adding more beef broth and port. It says to reduce it until half cup but just the onions take up half cup and I liked having more sauce to pour over the steak. I served it as pictured over creamy red mashed potatoes, perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krcure"
},
"reviewBody": "Outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mandalin84"
},
"reviewBody": "This was really good. Husband liked it a lot too even though he is not a fan of blue cheese. My only complaint was that the wine did not add much flavor to the sauce, tasted mainly like the beef broth. I will probably play around with this recipe, but overall really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excllent! very tender, great flavor! got rave reviews for my Valentine dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ed Grivner"
},
"reviewBody": "i made this for our valentines dinner and my wife who just likes plain steak with nothing on it raved about this recipe. the only change i made was not putting the steaks on a cookie sheet and just used the oven safe pan for the broiling. less dishes that way. there was one special treat about this recipe...all the topping that melts off the steak makes a great crispy grilled cheese when it hits the pan. mmmmm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaffreen"
},
"reviewBody": "I made this for Valentine's Dinner and it turned out amazing. It's so simple to make and the flavors are incredible. I definitely recommend making the sauce ahead of time as it's the most time consuming part of this recipe. I made garlic mashed potatoes and parmesan asparagus to go with it. I took the advice of doubling the sauce recipe and putting it over the potatoes! My fiance loved this and it will definitely become a regular recipe at our dinner table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kirkzgirl"
},
"reviewBody": "Wow! This was absolutely delicious! I did tweak this recipe just a little and it turned out scrumptious. Our grocery store was out of Filet mignon, so I used a t-bone steak. We don't drink, so I substituted the port wine with 100% grape juice. I also used a regular red onion instead of minced white... which had good flavor. When the sauce was done cooking - I strained the pieces out of it and set it aside. I cooked my steak on the stove top, and it turned out great. Also, I didn't have any panko bread, so I google searched a recipe and made my own! The blue cheese and panko mixture was a nice compliment to the sauce. I made whipped potatoes with sour cream, butter, some reg salt and garlic salt. I used the sauce to cover the steak and potatoes. I topped the meal off with a side of glazed baby carrots. My husband and I both agreed, this meal was much better than most steak houses! It was a perfect valentines dinner - for 2 :) \nI would highly recommend this meal to anyone, especially if you are looking to impress people!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/72267/blue-cheese-crusted-filet-mignon-with-port-wine-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1024/meat-and-poultry/beef/steaks/filet-mignon/",
"name": "Filet Mignon Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/72267/blue-cheese-crusted-filet-mignon-with-port-wine-sauce/",
"name": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce"
}
}
]
}
}
, "about": [
]
}
]