				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Boiled &amp; Baked Ribs"
,"datePublished": "2012-02-17T17:12:57.000-05:00"
,"dateModified": "2022-05-31T12:52:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This boiled ribs recipe from Chef John isn&#39;t supposed to replace traditional barbecued ribs — they are simply a quick and tasty alternative!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/mlIyux7sQRlwG7MEVdkbsvCZj1I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/880022-3573963737df412496dcfb8d17ed3e01.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1429829213001",
"description": "See a sensational shortcut method for making delicious glazed baby-back ribs.",
"duration": "PT5M36S",
"name": "Boiled and Baked Baby Back Ribs",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/baec2a14-b264-48de-a0f3-5823123714c4/ff3ac35d-ed41-4410-a734-92759349ff9b/1280x720/match/image.jpg",
"uploadDate": "2021-07-03T08:48:23.379-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Boiled &amp; Baked Ribs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "79"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "466 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "117 mg"
,"fiberContent": "1 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "3592 mg"
,"sugarContent": "15 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.5 cup rice vinegar",
"0.5 onion, chopped",
"6 cloves garlic, crushed",
"2 tablespoons kosher salt",
"1 tablespoon Chinese five-spice powder",
"1 teaspoon red pepper flakes",
"2 bay leaves",
"1 (2 pound) slab baby back ribs, cut into individual ribs",
"1.5 tablespoons soy sauce",
"1.5 tablespoons rice vinegar",
"1.5 tablespoons sambal oelek chili paste",
"1.5 tablespoons Dijon mustard",
"1.5 tablespoons ketchup",
"1.5 tablespoons honey",
"1.5 tablespoons brown sugar",
"0.5 teaspoon Chinese five-spice powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare ribs: Mix 2 1/2 quarts water, rice vinegar, onion, garlic, salt, five-spice powder, chili flakes, and bay leaves in a large pot. Bring to a boil; then reduce heat to low and simmer for 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Place ribs in broth; return to a simmer, then turn heat to low and cook for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with a silicone baking mat."
} ,{
"@type": "HowToStep"
,"text": "Prepare glaze: Whisk together soy sauce, rice vinegar, chili paste, mustard, ketchup, honey, brown sugar, and five-spice powder in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Remove ribs from broth and transfer into the bowl with soy sauce glaze; toss to coat."
} ,{
"@type": "HowToStep"
,"text": "Transfer glazed ribs to the prepared baking sheet. Reserve extra glaze for brushing."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/mlIyux7sQRlwG7MEVdkbsvCZj1I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/880022-3573963737df412496dcfb8d17ed3e01.jpg"
}
]
,"text": "Bake ribs in the preheated oven for 15 minutes. Turn ribs and brush with more glaze. Cook 15 to 20 more minutes, brushing occasionally with remaining glaze if desired. Remove and serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom MacEgan"
},
"reviewBody": "Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nashbash"
},
"reviewBody": "Mine turned out delicious! Thanks for this GREAT and EASY recipe! (And now I have a nice way to use up my extra Chinese 5-spice too!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcooks"
},
"reviewBody": "A little strong on the flavor while cooking in the broth, but super tasty &amp; falling off the bones coming out of the oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "G'Mom"
},
"reviewBody": "I discovered Brazilian Ribs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fleurette"
},
"reviewBody": "The perfect alternative to the sameo sameo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gatorspeed"
},
"reviewBody": "Was confused with the ingredients list as, the rib boil and the glaze both call for certain ingredients and do not give any other quantities of the spices or vinegar for either. Sorry, after reading it once more, found the ingredients were different for boil and glaze, however, the five spice was a little strong for my taste so I reduced the amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "This recipe was quick, easy and I loved it.I definitely will make it again and again. The sauce was delicious and not filled with chemicals like the bottled . I followed the recipe to a T."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Ross"
},
"reviewBody": "I use this recipe all the time! Can’t go wrong with this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammi Cole"
},
"reviewBody": "Okay, first off, I've made this recipe probably a dozen times. I have both stuck to the recipe and changed it (sometimes we want a different flavor profile). It works perfectly every single time as long as you follow the directions. The ribs are so incredibly tender and fall off the bone and the flavor is simply amazing. We dont have access to a BBQ pit or smoker. But we do have a stove top and oven. and honestly we may never make ribs another way ever again! Highly. Highly recommend trying ribs this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Serpa"
},
"reviewBody": "Unbelievable ribs!!! Don't change a thing. My side dish was homemade fried rice, the best! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "Really easy and very delicious! I had very few of the ingredients for the water but still turned out really good. I added a little liquid smoke to the water though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Don Kwasny"
},
"reviewBody": "The way I do ribs is to boil the ribs for 1 hour with salt, bay leaves, onion. Then drain. Then pop them into a metal lasagna pan, pour honey garlic sauce over the ribs. Bake for 1 hour at 350 degrees. There are no complaints and rarely any leftover at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DJ Brewmaster"
},
"reviewBody": "I followed the directions to a point. I mixed the boil, and boiled the ribs as directed. But, I did not bake. Instead I grilled them. Because the ribs had boiled grilling took much less time, but I was still able to get that great smoked flavor too. I used my own sauce (Chef John said you can, so that's not cheating). The flavor and tenderness of these ribs were outstanding. My family devoured them. Give them a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Currier"
},
"reviewBody": "I made these for a Memorial Day party. I had a large package, 8 pounds, of pork ribs from Costco. I Increased the quantity of everything by 4. My lesson: The recipe is very good. I brought the boiling spices to a boil for 20 minutes and then let them sit for 2 hours. Then reheated before adding the room temperature ribs. I think 45 minutes of simmering after the water reheats to a boil will be adequate. They fall off the bone too easily after one hour of cooking. However much you make, I would make half as much again of the actual BBQ sauce. There was really not enough to lather the ribs like I expect most guests would like with this great sauce. I did substitute Sriracha sauce for the sambal oelek chili - I found the substitution on Google."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Rock"
},
"reviewBody": "It was great! It had exactly the right amount of heat and sugar and everything came out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Milne"
},
"reviewBody": "used masala spice instead of 5 spice\n\nused some sweet chili sauce instead of honey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EvilleGenius"
},
"reviewBody": "Made as directed. Very easy, and a nice change from plain saucy ribs. Had a little after-kick to it, without being too spicy. Ribs fell apart. My husband said meat very tender, and everyone enjoyed. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darryl"
},
"reviewBody": "Did not have any Chinese Five Spice or rice vinegar in the house. When we put them in the oven, simply basted with our favorite barbecue sauce. They were delicious and we will certainly make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riggsbro"
},
"reviewBody": "altered by using dried ground serrano peppers in boil water and used off the shelf open pit sauce. was enjoyed by all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "This recipe was excellent due to the glaze in my opinion. I'd make it again and again. I followed the process just as the recipe called for EXCEPT for the onions and spices in the water to boil the ribs in, only because I was already in the boiling process when I found this recipe. Mine were boiled in a rib rub added to the water. Actually, I don't know how much flavor the recipes boiling water ingredients would add, perhaps I'll try some time. These ribs did not need any additional BBQ sauce at eating time. I used ALL of the glaze sauce basting them when in the oven cooking. Again, EXCELLENT FLAVOR and ribs were tender. One more thing, I did not put the chili paste in the glaze because I had none. If you don't care for heat, eliminate the chili paste, it is great without it. Thanks Chef John!!!!!!!!!!!!!!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loves to cook"
},
"reviewBody": "Very tender and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Ota"
},
"reviewBody": "No changes, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tom herrera"
},
"reviewBody": "I love how quick and easy this recipe is. Meat falls off the bone, some might not even be able to tell the difference! Broiling the ribs gives it that extra crispy taste as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joy Uyeda"
},
"reviewBody": "This is really a great recipe. The ribs taste like they were grilled. The sauce is delicious and can be used for other meats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimmi"
},
"reviewBody": "I liked it very much. Didnt have chili paste but had some other chili item in fridge used it. I made for me and my daughter so I only bought a small rack of ribs already cut from the store. My family came over and almost ate all of them. I will make again and adjust some of the ingredients and most certain that I buy more ribs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Boy R Drew"
},
"reviewBody": "Great ribs made exactly as written no changes. It has a bit of an asian twist on them which I like easy to make as well. Definitely making these again! Thanks Chef"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PROKOPIC"
},
"reviewBody": "Love these ribs! They are delicious and have a great texture and are not falling off the bone. After simmering I tossed them in glaze and didn't bake them until later. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dra8ota"
},
"reviewBody": "great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HAPPY_HIPPIE"
},
"reviewBody": "The family really enjoyed these ribs; they're very tasty. I must say, I love the method of preparation. I've always simmered my ribs prior to baking or grilling, but I'd never seasoned the water before. Oh man, what a difference it makes. Thanks Chef John, for sharing this awesome recipe. It'll be my mainstay from here on out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Fagundo"
},
"reviewBody": "Tender, flavorful, yummy. I actually liked them better than grilling. Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridgette Renee' Dennis"
},
"reviewBody": "These should be called \"Oh My Lawd\" Ribs. If anyone were to ask me, do I like ribs, the answer would be, not really, do I like spicy? The answer is no,and the same goes for my 19 year old son, but I do love spicy flavors without the heat! And this is exACTLY THAT! For those who don't know, what I mean is, I like the flavor of jalapeno, but not the heat. Now, my oldest son likes the heat of say, ceyenne, and jalapeno, and THAT is what made my decision to try this. I made this recipe with all the ingredients listed, as written, the only thing I did was 2tbs on everything for glaze, instead of 1 1/2, just to be sure I had enough. They were perfluctido!! that's a Dr. Seussism, for those of you not in the know. Anyway, long rate short, both me AND my son were pleasantly surprised. Thank you Chef John, another hit in the books. This will be a regular this summer! And those of you that aren't big fans of spice, this is not a recipe to fear. Very flavorful, and easy on the pallet. My son said, \"it gets so close to the burn, but it never makes it there\"! Hope you give these a try, and as always.....ENJOY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Q."
},
"reviewBody": "Very tasty and very easy. I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommycooks"
},
"reviewBody": "Wow this was excellent. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas Heineman"
},
"reviewBody": "I don't normally cook baby back ribs, but I thought I'd give this a try. My wife always boils country ribs before grilling so I looked for a recipe that took this approach. I understand this is sacrilegous to serious BBQ folks. Anyhow, I tried this recipe and substituted Sriracha Hot Chili Sauce for the chili sauce and cayenne pepper for the pepper flakes (because that is what I had). All the rest of the ingredients I had in the house. Instead of baking, I put these on the grill in a vegetable grill basket. About 7 minutes on each side. Turned out excellent. The Chinese 5 spice plus the chili paste gave the ribs a distinct flavor and kick. Loved it as a dinner. I liked the idea that the back ribs were already cut when served. Makes for easy eating. I'd use this as an entrée any day. Would be an awesome appetizer as well. Very creative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "calisunkissed"
},
"reviewBody": "I used different seasonings, but the technique for cooking the ribs worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdub"
},
"reviewBody": "These were so good - we didn't have honey, so we used corn syrup. We also didn't have chili paste, so we used Surachi. So tender on the inside, a bit crisp on the outside, and the flavor was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "glenn"
},
"reviewBody": "I'm from the south where we know BBQ and where it's a sacrilege to boil ribs. The chef did make a nice disclaimer that this is not intended to replace or compete with traditional BBQ so I'll let it slide. I would never personally use this recipe but I did refer it to my sister who cannot BBQ to save her life and it was a great improvement to all of her previous attempts to BBQ ribs. They were very good and if you are a slow and low purest just think of them as something other than BBQ ribs. Open your mind and shut your mouth and enjoy them for what they are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle"
},
"reviewBody": "I have never made ribs before but a huge sale at the local grocery prompted me to try. This recipe worked so well that my husband complemented it without me asking \"Is everything OK?\" I followed the recipe exactly and my family cleaned the ribs to the bone. Thanks for another \"go to\" in the recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. R."
},
"reviewBody": "These are fall off the bone tender and delicious. You can eat them straight from the broth you boil them in. The \"glaze\" (not sauce) is really different for ribs and yummy. Rather than baking I put mine on the BBQ grill 5 mins to a side and got that blackened edges and smoke flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Green-Wood"
},
"reviewBody": "This is simply delicious! I followed the brine recipe and the flavors in the ribs was a hit with the family. For my glace I used one that I had from before but as he said any glace will work and it certainly did. I will be making this recipe alot in the future. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmaybeegeorge"
},
"reviewBody": "Made this with 10 lbs of ribs for 10 people. Simmered the ribs in the broth for about 1 1/2 hrs., covered the ribs with a good smoky commercial sauce and baked for approx. 30 min. as per the recipe. These ribs actually were falling off the bones and were scrumptious. I also viewed the video before I followed the recipe. I found this helpful as I was not anxious about using a new recipe on unsuspecting friends. I will be using this recipe as my new favourite for ribs. Easy perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Velma Baker"
},
"reviewBody": "Keep em coming Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronni"
},
"reviewBody": "The best ribs I've ever cooked. I finished mine on the gas grill with smoking hickory chips and they were a hit! Treat youself and try this. Everything by Chef John is just beyond belief good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "john purtle"
},
"reviewBody": "These are really very good. Not tender falling off of the bone, but a very good rib. Have made several times and everyone appreciates them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mendomom"
},
"reviewBody": "Adding spice to water great idea however, this is way too sweet for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danbo6644"
},
"reviewBody": "Great recipe. But, when I clicked the kitchen view for the Boiled and baked ribs, it took me to kitchen view for baked ziti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Love this! I've made this a few times and once or twice had to adapt the ingredient list and yet, the ribs end up tasting great. I think the method, boil then bake works very well. This is my new go-to method first, recipe second, for ribs. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shane Hager"
},
"reviewBody": "These ribs were amazing. I made some (un)intentional variations on the fly. I forgot about simmering the broth for 20 minutes before adding the ribs, so as soon as it started boiling I added them. Also, I added only a small amount of salt to the broth. \n\nI used the last of my rice vinegar in the broth so i subbed Italian wine vinegar in the glaze. The rest of the ingredients were basically eyeballed, but I almost doubled the glaze to be sure I'd have enough which I'm happy I did. After glazing 3 times in 15/15/5 minute intervals the ribs turned out incredible. Just the right amount of tenderness without falling off the bone. Will make again, thanks Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "worst waist of $20.00 worth of ribs i have ever seen. could not eat them,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "a_tillis"
},
"reviewBody": "worst waist of $20.00 worth of ribs i have ever seen. could not eat them,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah245"
},
"reviewBody": "This is a wonderful recipe. I wasn't sure how to make Pork Rib Tips that were already pre sliced in the packaging quickly without drying them out. The boiling really sealed in a soft, seasoned texture. The glaze was delicious, my husband raved about it! I lessoned the sugar by the half teaspoon, and didn't have rice vinegar or the 5 spice, or the chili paste! However, I substituted the vinegar with red cooking wine and chili paste with ketchup and chili pepper. I also used some creol spice instead of the chinese spice ( only used about a half of tspn since it has salt in it). I did have to make a little extra sauce (I had bigger rib pieces then what the recipe calls for) to completely cover all my ribs. When I went to glaze again halfway through baking in the oven , I just mixed more in a bowl with the same ingredients for the glaze. Maybe next time I make it I will have all the right ingredients but it still tasted so yummy! Thank you for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pmary Novak"
},
"reviewBody": "snack table?!...you mean \"Dinner\" table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyman"
},
"reviewBody": "My wife and I enjoyed these ribs very much. The flavors were nicely mixed, sweet and sour and the Chinese five-spice powder gave it a new and pleasant taste which I had not tried before. Plus, I am not fond of messy, smoky grills. This was perfect for me! Yummy vituals. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diamond1"
},
"reviewBody": "I've boiled mine before, however never in seasonings. The method used was really good. Thank you, this is what I will always do when doing ribs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David Zagelow"
},
"reviewBody": "These were pretty good but the Tender Pork Spare Rib recipe is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cate Whitaker"
},
"reviewBody": "I have always been a boil and bake 'em rib girl. The boiling process gets rid of a good amount of fat. If you want them very tender, put the ribs in your crock pot on low for several hours instead of baking. I agree that the membranes are not an issue, scoring them is a good idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "willa"
},
"reviewBody": "Everyone at meal said this is excellent. Very tasty and should always cook ribs this way. By the way I cut down on the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. Raymond"
},
"reviewBody": "excellent ribs..possibly the best I've ever made. The only changes I made was that I didn't add in the pepper flakes in the brine and the chili paste for the glaze since I was afraid it might have been too spicy for my little ones to eat. Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jo-in-mexico"
},
"reviewBody": "We were very impressed with the flavor and tenderness of this dish. I did make a couple of changes, as some ingredients are not available here in the heartland of Mexico. I used Thai garlic chili sauce for the hot sauce and white wine vinegar instead of rice wine. Also accidentally forgot the honey, but it was a perfect mix of sweet and acid for our taste. I will definitely make again and will use the glaze for other meats as well."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220280/boiled-baked-ribs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
"name": "Pork Rib Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/997/meat-and-poultry/pork/ribs/baby-back-ribs/",
"name": "Baby Back Ribs"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220280/boiled-baked-ribs/",
"name": "Boiled &amp; Baked Ribs"
}
}
]
}
}
, "about": [
]
}
]