				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bolivian Saltenas"
,"datePublished": "2020-06-18T23:44:09.000-04:00"
,"dateModified": "2020-06-18T23:44:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "happymommyx4"
,"url": "https://www.allrecipes.com/cook/1632397"
}
]
,"description": "Like empanadas, these hand-held baked pastries are filled with spiced meat (beef or chicken) and vegetables. They make great appetizers, snacks, or lunches."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/va9sSHfikvgfnyvLVOLrnFQgDJc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/666106-8876cf8d43d448358af61cb7094b82f3.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bolivian Saltenas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "38"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "482 kcal"
,"carbohydrateContent": "59 g"
,"cholesterolContent": "108 mg"
,"fiberContent": "4 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "551 mg"
,"sugarContent": "12 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT90M"
,"recipeIngredient": [
"1 (.25 ounce) package unflavored gelatin",
"3 potatoes, peeled",
"1.5 tablespoons olive oil",
"1 onion, chopped",
"1.5 pounds ground beef",
"1 (10 ounce) package frozen petite peas, thawed",
"1 spring onion, sliced",
"0.5 cup fresh parsley, chopped",
"4 teaspoons white sugar",
"2 teaspoons paprika",
"0.25 teaspoon ground cumin",
"1.5 teaspoons salt",
"0.25 teaspoon black pepper",
"3 tablespoons jalapeno sauce",
"0.5 cup cold water",
"3 hard-cooked eggs, peeled and chopped",
"1 (2.25 ounce) can sliced black olives, drained",
"1 cup raisins, soaked in water and drained",
"6 cups all-purpose flour",
"0.25 cup white sugar",
"1 teaspoon salt",
"1 cup butter, cubed",
"1.5 cups hot water",
"2 eggs, beaten",
"2 teaspoons water",
"1 tablespoon paprika" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sprinkle the gelatin over the 1/2 cup cold water in a heat-proof dish; set aside for 10 minutes. Microwave the rehydrated gelatin for 30 seconds or until melted (or melt it over a pot of simmering water). Transfer the melted gelatin to a small bowl and refrigerate until set."
} ,{
"@type": "HowToStep"
,"text": "Place the potatoes into a saucepan, cover with water, and bring to a boil over medium heat. Reduce heat, and simmer until the potatoes are cooked but still firm, about 10 minutes. Remove from water, allow to cool, and shred into a bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the ground beef, and cook until the meat is no longer pink, breaking it up into crumbles as it cooks, about 10 minutes. Drain excess grease. Stir in the shredded potatoes, peas, spring onion, parsley, 4 teaspoons sugar, 2 teaspoons paprika, cumin, salt and black pepper, and 3 tablespoons jalapeno sauce (optional). Simmer filling until hot, about 3 minutes. Remove from heat and set aside."
} ,{
"@type": "HowToStep"
,"text": "Preheat an oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet, or line it with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Combine the flour, 1/4 cup sugar, and 1 teaspoon of salt. Cut in the butter with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the butter and flour mixture until it looks like cornmeal. Turn mixture into a bowl and proceed.) Slowly add the hot water and knead until smooth, about 3 minutes. Keep the dough covered with plastic wrap or a clean kitchen towel to keep it warm. Divide the dough into 16 pieces and roll them into balls. Keep the other balls of dough covered with a towel while you roll out each round."
} ,{
"@type": "HowToStep"
,"text": "On a lightly floured surface, roll each ball of dough into a 1/8-inch-thick circle. Whisk the beaten eggs and 2 teaspoons water in a small bowl. Lightly brush egg wash on the edges of the dough circle. Place about 2 tablespoons of the meat filling on one half of the dough round; top it with about a 1/2 teaspoon of hard-boiled egg, 1/4 teaspoon of gelatin, a few sliced black olives, and some raisins."
} ,{
"@type": "HowToStep"
,"text": "Fold the dough over the filling. Seal and scallop the edges of the dough together. To scallop, start at one edge of the half circle: fold a small piece of dough (the size of your fingernail) over the seam and press gently. Fold another small piece of dough over the seam so that it overlaps the first piece; repeat until you have sealed the half circle. (You may also seal the saltenas by pressing a fork around edges.)"
} ,{
"@type": "HowToStep"
,"text": "Place the saltena on the prepared baking sheet and continue with the remaining dough and filling. Whisk the paprika into the remaining egg wash and brush the saltenas with the egg wash. Bake in the preheated oven until golden brown, 15 to 20 minutes."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Miguel Muñoz"
},
"reviewBody": "I've never seen the gelatin used this way. When my Mom would cook it, she would add the gelatin to the filling, and refrigerate it overnight. I don't know if that will solve the problem of it being too dry. Salteñas are very juicy and messy to eat. You should always hold them over a plate. My parents would tell me that, by tradition, whoever dripped the most onto their plate would pay for everyone's Salteñas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kaelin Pastella"
},
"reviewBody": "Dry, boring, and Americanized. My dads from La Paz and the only time I’ve seen raisins in a salteña is when an American is making them. It’s no offense at all. What I mean is if you want an authentic one then this is not the recipe for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "I made these for a work potluck and everyone who had one said they were good &amp; \"different.\" We enjoyed eating the leftovers over the next week. I likely won't make again since they were a lot of work, but we enjoyed trying something different and were pleased with how the strange sounding ingredients all came together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gerry"
},
"reviewBody": "I made the Salteñas and yes, a lot of work but delicious! I made them vegetarian by substituting tofu and vegetable broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alon Reich-Zilberman"
},
"reviewBody": "Really good. Improvements I would make: increase the amount of cooked eggs to 4, use only 2 potatoes, and buy a higher fat ground beef"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mat Weller"
},
"reviewBody": "Very tasty, thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Yates"
},
"reviewBody": "This is a great recipe. I enjoyed making these and everyone enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "Will definitely make this again. It was labor intensive and resulted in a messy kitchen, but was not technically difficult. I was trying to recreate the salteñas I had years ago, and this was close-but-not-quite. I departed from this recipe by NOT draining the meat; by adding the melted gelatin to the meat mixture and letting it chill overnight; and adding paprika to the dough (instead of the egg wash) to give it the golden color. I also baked them for 15 minutes longer than the recipe called for. The salteñas I had previously had some kind of sweet spice, so the next time I make it (and I will), I will do away with the cumin and replace it with cinnamon and/or allspice and see if that doesn't do the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Natasha Frasher"
},
"reviewBody": "Little Dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ayla"
},
"reviewBody": "This takes forever to make and is really dry. Not worth the time and effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tiffany B"
},
"reviewBody": "While they did take a bit of time, I felt I was able to get them right. Though, from what I read about saltenas, they should be juicy; mine were not. I wasn't crazy about the flavor, as is, and felt more spice (maybe double) was needed. I also preferred them with sauce and thought salsa gave them a nice kick. \nI'm thinking of changing up the ingredients and adding a bit of beef broth or bullion to create a sauce and try them again. \nI do like the dough and thought it was easy to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tiffany B"
},
"reviewBody": "While they did take a bit of time, I felt I was able to get them right. Though, from what I read about saltenas, they should be juicy; mine were not. I wasn't crazy about the flavor, as is, and felt more spice (maybe double) was needed. I also preferred them with sauce and thought salsa gave them a nice kick. \nI'm thinking of changing up the ingredients and adding a bit of beef broth or bullion to create a sauce and try them again. \nI do like the dough and thought it was easy to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "souchefdozer"
},
"reviewBody": "Good recipe. This is very very close to an empanadas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gbanninger"
},
"reviewBody": "Very good, so much work! I'm beat! I added diced jalapeños, wish I added more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "malonb"
},
"reviewBody": "I'm from Bolivia and there a few restaurants which sell these here. I decided to make my own however, I have no idea why I opted out to try this recipe rather the more authentic ones from my Bolivian cookbooks. Anyhow, these turned out quite bland and unfortunately rather dry, not to mention time consuming. So I was left with a whole lot of something no one in my family was looking forward to eating. We did though for the sake of not wasting and it is edible. The dough was quite similar to the ones of hot pockets, so if I ever want to make my own... Won't be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "briarhopper"
},
"reviewBody": "need more spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "soniaO"
},
"reviewBody": "Worth making: filling flavor is excellent, but the dough lacks the soft springiness of restaurant saltenas. True saltenas when eaten piping hot drip with sauce -- that's the need for the gelatin, to make filling the rolled dough easier with cooled, gelatinous sauced meat filling. I tried 14 oz jalapeno sauce, but still not as juicy as the real thing. Next time I will put egg in the dough. Still, these are very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Growe"
},
"reviewBody": "I also used the dough disks from the store, big time saver. However I found the saltenas were dry as the doug absorbed the gravy, I found if I coated the inside with the egg wash it sealed the dough disk and made the saltena much jucier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Renner"
},
"reviewBody": "I had never made anything like this before, but my son requested it. They were fantastic! The dough for the bread is delicious - a little bit of sweetness to it. The only changes I made were to use Grillers, a meatless substitute for the ground beef. The filling is so flavorful, we didn't miss the meat at all. I also added a little garlic, and my family doesn't like olives (although I love them), so I omitted them. To speed things up a bit, I used shredded frozen hash brown potatoes, and these worked great. Those two substitutions did make the cooking go more quickly. We served them with a fruity salsa, a nice compliment to the flavors. Don't skip the egg wash either; the little pockets have a lovely shine and texture that you wouldn't get otherwise. The recipe is a little time-consuming, but the family asked me to put this in the regular rotation. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aly1296"
},
"reviewBody": "its great!!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pam7602"
},
"reviewBody": "So happy to find this recipe! I was an exchange student in Bolivia many years ago and I've been looking for a saltena recipe ever since I left LaPaz. Can't wait to try this out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lou"
},
"reviewBody": "My father was born in Bolivia, and his family ran a salteneria in La Paz when he was a teenager. I wanted to make my own saltenas, so I was happy to find this recipe. I was disapointed about how dry they came out, even following the directions to the letter. I'm wondering if I should not have drained the \"excess grease\" as the recipe calls for, and maybe left it in so it would make a sauce of some kind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "texasoma"
},
"reviewBody": "Made these today for my husband, who worked in Bolivia years ago. Added 2 cloves of garlic and omitted the raisins. Next time will use stew meat diced finer. They were a hit.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ricfera"
},
"reviewBody": "I bought the dough discs ready from the market and it worked, though the saltenas were smaller. I used beef chunks -which I diced- instead of ground beef, and cilantro instead of parsley. These saltenas do not taste quite like the ones I used to have in the South of Peru -and of course, they taste differently in different places- but they turned out really good. I Will make this recipe often since it was easy to follow and not really hard to make. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Closet Chef"
},
"reviewBody": "The flavor was excellent, but I found the dough incredibly hard to roll out. And the edges were just too hard to get sealed. I made about 10 the traditional way, and then got too tired of rolling the dough, so I made a \"saltena pie\" with the remaining ingredients (something like a chicken pot pie in design, but with saltena taste).\n\nMaybe it's not fair to give a recipe lower marks for this...but I was really hoping for an easier way to make saltenas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zedd"
},
"reviewBody": "This was really good. My other half who is very picky and hates peas and meat pies loved this! He snuck a second one. :) The only change I made was substituting cayenne and chilli powder for the paprika. We were out so I did 1/2 t cayenne and 1/2 t chilli powder. I didn't use that to add to the egg wash just the filling. thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "Great recipe. I made these yesterday, and they were a lot of work, but so worth it! Impressive!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauri Huber Nye"
},
"reviewBody": "My family loves these!! They take a little time but are well worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Schmoo"
},
"reviewBody": "This is a good saltena recipe. I live in Bolivia and can't imagine what it will be like NOT having these when I move back to the states. Also, there are so many variations, many people leave out the olives here to satisfy more pallets. Also, I have had them with raisins and olives only one time when I was at my husbands family's home in Houston never in Bolivia. Even better are the sauces that accompany the saltenas they have usually a spicy peanut sauce an olive sauce as well as a spicy salsa and sometimes a green or avacado sauce. Also, saltenas vary by region here. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie Susan"
},
"reviewBody": "Yes, they are a lot of work but they are SO worth it. The only change I made was I used beef tips cut up into very small cubes instead of ground beef. My husband's family is from Bolivia and they love these. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happymommyx4"
},
"reviewBody": "I submitted this recipe so long ago, I forgot a few things....I usually use chicken, sometimes I use shredded beef. The original recipe called for head cheese.For those of you who know what head cheese is, you know it is not a cheese at all. Not a fan of head cheese (1/2 cup; chopped), so I am meerly mentioning it for those that are interested. To be honest, I am not even sure where one would get head cheese. \r\nDon't skip the gelatin, it isn't the same without it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216872/bolivian-saltenas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
"name": "Savory Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2253/main-dish/savory-pies/beef-pie/",
"name": "Beef Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216872/bolivian-saltenas/",
"name": "Bolivian Saltenas"
}
}
]
}
}
, "about": [
]
}
]