				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Borscht I"
,"datePublished": "1999-01-28T22:32:43.000-05:00"
,"dateModified": "2022-07-14T16:31:15.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DeeDee Henderson"
,"url": "https://www.allrecipes.com/cook/24322795"
}
]
,"description": "Only one medium beet is used in this recipe for a meatless vegetable and cabbage soup which will serve a large group."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AWYi4eQ4Z79bgctqkHXuFeBXhgg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7681929-7ece7f07fa5b4d6bb6f3766253f96f71.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Borscht I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "93"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "185 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "26 mg"
,"fiberContent": "4 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "898 mg"
,"sugarContent": "5 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"6 cups water",
"0.75 tablespoon salt",
"0.5 cup finely chopped carrots",
"0.25 cup chopped green bell pepper, divided",
"0.5 stalk celery, chopped",
"1 medium beet",
"0.5 cup canned peeled and diced tomatoes",
"3 potatoes, quartered",
"0.33333334326744 cup butter",
"0.5 cup chopped onion",
"1.5 cups canned tomatoes",
"3 cups finely shredded cabbage, divided",
"0.25 cup heavy cream",
"0.75 cup diced potatoes",
"1 tablespoon dried dill weed",
"0.25 teaspoon ground black pepper to taste",
"salt and freshly ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place water, salt, carrots, 1/2 of the bell pepper, celery, beet, tomatoes, and quartered potatoes in a large stock pot over high heat. Bring to a boil."
} ,{
"@type": "HowToStep"
,"text": "Melt 1/3 cup butter in a separate skillet over medium heat. Saute onions in butter until tender, approximately 5 minutes. Stir in tomatoes, reduce heat to medium low, and simmer for 15 minutes. Remove 1/2 cup of sauce from skillet, and set aside. Stir half of the cabbage into the skillet with remaining sauce, and continue simmering 5 minutes more, or until tender."
} ,{
"@type": "HowToStep"
,"text": "Remove beet from boiling liquid and discard. Remove potatoes with a slotted spoon or tongs, and place in a bowl with remaining 1 tablespoon of butter and the cream. Mash together until smooth."
} ,{
"@type": "HowToStep"
,"text": "Return the 1/2 cup of reserved onion-tomato sauce to the stock pot. Stir in diced potatoes, and simmer until just tender but still firm, approximately 5 minutes. Increase heat to a low boil, and stir in remaining cabbage, tomato sauce, and mashed potatoes. Reduce heat and simmer a few minutes more. Stir in remaining bell pepper, season with black pepper, and serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jacqueline Muccio"
},
"reviewBody": "This was a terribly complicated recipe that was orange in colour and tasted like potatoe soup. I am currently working to save the soup because I hate to throw out my valuable ingredients and waste my time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz82"
},
"reviewBody": "Growing up Polish and eating Borscht, I can tell you this is pretty close to authentic. We use to eat this during the cold winters to warm us up. I made this recipe almost exactly as written - only I used 3 beets, 5 small potatoes, 3 parsnips, and of course added sauté onions, carrots, celery, green cabbage, and fresh parsley. Serve it with a dollop of sour cream and a lemon wedge. It is delicious! Reminds me of my childhood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuprDavR"
},
"reviewBody": "I had to rate again, because I didn’t get to add all my thoughts. 1) I use way more beets, usually 5-6 medium to large beets. I usually cut them smaller than quarters, and I enjoy the flat and texture, so I leave them in. 2) You can control how thick your base is, depending on how many potatoes you pull out to mash. Mashing some of the potato in the butter from the sautéed onions and tomatoes thickens the base, so change how much potato you use to your liking. 3) Some call it heresy, but I just tried for the first time adding in a stew beef. I seared it first, had to look up how to even do that, but then put it in and let it boil the same amount of time as the beets. Added a distinct and delicious twist to the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anidevorah"
},
"reviewBody": "I used vegetable broth instead of water and replaced the tomatoes with canned stewed tomatoes containing celery and green pepper. The family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "I used Napa cabbage, celeraic, red bell peppers 2 small fresh tomatoes and veggie stock. I kept the beet and pureed it all together. I though borscht was 'just beets'! This recipe is great - all the flavors are fabulous together, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Wildenhaus Horn"
},
"reviewBody": "This recipe is a little tricky because of all the preparations steps, but is hard to really mess up. I added a large clove of garlic, which improved the soup's mild taste, and served it with sourdough bread. The sourdough was a great addition, as was a whole branch of fresh dill. The bright pink color was hard to get over at first, but my dad loved it and even my picky 8-year old sister ate it. Even though none of us had tried beets before, this soup was surprisingly tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy K."
},
"reviewBody": "This was incredibly tasty and worked well as leftovers. However, I peeled the beets (I used several small beets) before adding, and when I removed them, I pureed them and added them back in. A bit of sour cream on the top when served made it just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TE5LA"
},
"reviewBody": "I followed this recipe to the letter, at least as far as I could, but maybe the post office was closed. There are several problems here: First, the ingredients list dill, yet there is no mention in the preparation how or when to use this. I just added it to the boiling broth. Second, it does not indicate how long the potatoes should boil on high. I left it until the step to remove potatoes. By then there was very little liquid left and the final result was a light pink \"soup\" with the consistency of creamy mashed potatoes. I had to add 2 cups of water just to make it a thick soup and it had no resemblance to borscht from the photos I've seen. The bright side is that it tasted good, but it just tasted like many potato soups. I was looking for something completely different. I have since located a classic borscht recipe on another website by an actual Russian woman that looks really good. It is far different and has meat in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "NatashaE11"
},
"reviewBody": "I am from Russia, and we do not put celery into borsht; it absolutely has to be made in beef or pork bouillon, so that veggies be cooked in it. Start with potatoes, add cabbage and onions with carrots, nothing fried before, finally add precooked and shredded beet with tomatoes, bay leaf and dill is the key; want it sour? use sauerkraut. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Martha Cochell"
},
"reviewBody": "I used mostly the same ingredients, but I didn't go through all the procedures, because I didn't really see the point of it. I just wanted to say that I roasted 3 large beets, then left them in the soup and used red cabbage AND purple potatoes! Then, after everything was soft, I used my immersion blender to puree the whole thing. This soup is the most beautiful ruby color. It's gorgeous! I'm eating it next day, cold with a dollop of yogurt, and drinking a Purple Haze from Abita, just to go with the theme. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baler"
},
"reviewBody": "Never had Borscht before -- red beets lower your blood pressure which prompted our visit. This recipe was delicious. Didn't have a few ingredients, had to use some spaghetti sauce instead of tomatoes, but still was very tasty! Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chanty77"
},
"reviewBody": "Love this borsch. I never use water making soups. I put about 10 cups of chicken broth. First I saute the onions, green pepper, celery, carrots, chopped up beets(which I don't throw out once cooked. I leave in the soup). When these are sauteed where they are not real hard, I then add the 10 cups of broth, 1-28oz. diced tomatoes &amp; diced potatoes. I then saute more onion with another can of diced tomatoes(14oz). When I've sauteed where the onion gets softer, I add 1/2 the cabbage and cook a little longer. I mash my potatoes as the recipe says &amp; add to the soup along with the rest of the cabbage. I always end up adding more of the veggies &amp; broth than the recipe calls for because my husband &amp; I love a hearty soup. The dill &amp; pepper spices of course. This is a wonderful recipe that obviously I've tweaked to our likes. It is a regular, especially in the winter at our house. I make an 8 qt. pot of it &amp; it freezes wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nickole81"
},
"reviewBody": "Very yummy...considering this was a meatless borscht. I have made before with a lamb base. Still very yummy. Shredding the cabbage finely instead of chopping added a lovely texture to the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an authentic borscht, because there are in fact different types of borscht from region to region in Eastern Europe. This borscht in particular is from the Doukhabors of Russia and Ukraine who migrated to BC, Alberta and Saskatchewan. It is meant to be orange in colour, and is actually spelled Borsch. To be called borsch, or barszcz (Polish), the soup doesn't need to be full of beets, or even have any at all. \nThis version of borscht is amazing, and not to be messed around with!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "syinger"
},
"reviewBody": "This was fabulous for a cool, rainy day. I'm lactose intolerant so I substituted the dairy products called for with LF creamer and margarine. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toytoy"
},
"reviewBody": "To Monzie...this is a traditional Russian borscht. Russian borscht uses the beet more for a bit of color and less for the making the soup to beet-like. My husband is Ukrainian, the cook the beet and dice it and put it in the soup,,,so it is alot more beet filled. My sister in law was Russian. I prefer the Russian borscht. The butter is what gives borscht it's rich flavoring. Russian borscht uses a heavy cream added at the end, so it doesn't curdle. Ukranian borsht uses sour cream...So this is an excellent Russian borscht, I use fresh dill when in season and amounts depend on personal tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KyleeOrdonez"
},
"reviewBody": "I am half russian and half native american and after studying the Russian culture I wanted to try the food. This recipe was the first one I tried and MMMM!! was i missing out! This is a regular routine in my kitchen and is my absolute favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianejk"
},
"reviewBody": "This soup is sooo good!! The mixture of ingredients creates an amazing taste! I used the same ingredients only in different amounts (4 carrots, 2 beets, 1 pint grape tomatoes, a whole celery stalk, a whole small onion, a whole red pepper, and 2 teaspoons of dill) and I left out the salt and cream. The recipe doesn't need it. I also took an extremeshsort cut by cutting up and food-processing all the veggies except for the onion, which I did saute in the butter. I also used an extra cup of water. I placed all the ingredients in boiling water, lowered the heat and covered the pot, and simmered it for about an hour. It was one of the best soups I have ever tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "butterflywarrior"
},
"reviewBody": "A great starter soup for learning to make borscht. I made it for the first time tonight and my guests really rave about it, includig a guest who intially only took a bite to be polite. I will make it again, but will definately play with modifictions. I used four small beets and did't get the color or flavor I wanted...I will definately increase that. I diced the beets this time, but will puree next time. The veggie to liquid ratio was too high for my taste. A little more water and a little less vegetables next tme."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "basbca"
},
"reviewBody": "I'll rate it after I've eaten it. BUT..this is the most disjointed recipe I've ever seen and I've used lots of recipes and done plenty of quite complicated cooking. Next time please make it easier to follow. This is not meant as a criticism because it looks as if it is going to be delicious, but don't want to put others off as I am."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Revero"
},
"reviewBody": "This is an incredibly good Borscht, but watch out for the strangely written recipe. A few alterations I'd recommend: Cut the amount of cabbage in half, use two or three beets, and don't discard the beets after boiling; instead, dice them and add them back to the stock for a heartier stew. \n\nI've made this five times and only had a bad result once, when I tried to double the recipe using the same ratios. I couldn't tell you why, but the end result was orange and tasted slightly off. The default measurements always yeild a good result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vanessa"
},
"reviewBody": "A little confusing but got through it and eliminated a few steps! A great soup!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "annieb"
},
"reviewBody": "I found this recipe confusing and at times odd (why wouldn't you keep beets in Borscht soup?) - but a good guide after reading the other reviewers comments. First,I used three beets in the stock pot and peeled them first. For the next step, I reduced the butter to a couple of tablespoons, used fresh tomatoes, and substituted shredded brussell sprouts. I removed one beet, and pureed the rest using a handheld blender. I never added the cream or the second round of butter. Then I diced the beet I had removed and added it back to the stock pot along with the onion/tom/brussel sprout mix. I then added a ton of fresh dill and let it simmer. Before serving I added fresh dill on top along with sour cream. Fresh dill makes all the difference. This was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Johnny"
},
"reviewBody": "this was my first time making borscht i thought it was excellent, id recommend using more beets and instead of discarding just dice them and put them back in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ga'chong"
},
"reviewBody": "I needed a new variation of my traditional barszcz recipe for Christmas Wigilia -- Polish Christmas Eve. This recipe is wonderful for the occasion: hearty but meatless. A few tweaks to please my personal palate, more beet and dill flavors, and this recipe is a keeper. Smacznego!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jrenee"
},
"reviewBody": "The recipe was great, but the directions were a bit odd, not very clear. I used two beets and after they softened, I diced one, pureed the other and added it to the soup as another person suggested. I also chopped and threw the leafy ends of the beets in with the soup for added nutrition. I used way more dill than called for because I love dill. This is the first time I've made this and I am very impressed with the great flavor. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Delilah"
},
"reviewBody": "I added extra butter and dill and used a pint of half and half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Schoff"
},
"reviewBody": "So Yummy, My Hubby never used to eat much for veggies till the last few years,....not sure what has come over him but it's a good thing! And now making this \"Borscht\" HE CAN'T GET ENOUGH OF IT!!! I didn't care for the \"METHOD\" so did it my way and I also used \"ALOT\" more beets ~6 Meduim Beets~! A Keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseyrose55"
},
"reviewBody": "I made this borscht today and it was wonderful! One of the best I've had. I really liked the fact that the beet flavor wasn't predominante as we aren't big beet fans. The directions were a bit odd though and I had to read them over a few times to make sure I got it; I wasn't sure where to add the dill, so I put it in the pot at the end. And, I don't care for crunchy cabbage so I sauteed the entire bunch. I also thought it needed more salt and pepper then stated, but we like salty things. All in all I loved this one. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chikp"
},
"reviewBody": "Wasn't pleased with the directions for this recipe...finished result was just good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya MacKay"
},
"reviewBody": "This soup was amazing. I loved it, and my husband even like it too! The only change I made (because I like beets) was I chopped the beets and left them in the soup. I fully suggest the dollop of sour cream; it really adds to the overall taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LovelyLauren"
},
"reviewBody": "I come from a Polish family and haven't had Borscht this good since my grandma passed away. It was absolutly delicious! I skipped the step where you take out some tomato mixture and added it later, it didn't seem nessessary. I would recommend this to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meesh"
},
"reviewBody": "I really wanted to make this recipe but I'm somewhat lazy so I omitted all the steps done in the skillet and just sauteed garlic and onions in my soup pot, added the cabbage, sauteed some more and then just added everything else in the diced/canned/liquid form (excluding the dairy). At the end, I took an immersion blender and pureed it just slightly to give it a thick but chunky texture. I quite like the flavour (it was even better the next day!), but of course I don't know what the original would have been like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KENANDLISS"
},
"reviewBody": "I didn't throw out the beet, instead I pureed half and diced half. I also left out the green pepper. Very delicious, my book club still talks about how they loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coquitlamom3"
},
"reviewBody": "This is the best borscht i have ever tasted! very very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Hewett"
},
"reviewBody": "Good. I used three beat and kept them in the soup. May have been better without all the beets (like the recipe says) It was very yummy topped with sour cream and extra dill YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie R."
},
"reviewBody": "OK, this recipe was totally yummy, but what a pain in the butt! I just finished my 2nd bowl and I loved it, but it ended up taking 2 hours to make it, a whole mess of dishes, and I'm the only one eating it! Oh well, it still tastes delicious. :) \nAlong with the other reviewers, I changed a couple of things:\n1. Tossed in beet greens and 3 beets to stockpot\n2. Reserved 1 T butter from 1/3 c for mashed potatoes and used 2% milk instead of heavy cream for potatoes.\n3. Deglazed saute pan with water and added it to stockpot to thin soup out.\nLike I said, it was delicious, but very labor intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ahoffort"
},
"reviewBody": "very good, but a lot of work required (in the cutting of all the vegies)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jiia"
},
"reviewBody": "As a Russian immigrant I have tasted many Borscht recipes and I love this one. Especially a vegetarian soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis Grant"
},
"reviewBody": "This recipe turned out really well but during the cooking, I was doubtful. Not sure how the cabbage was to be cooked in 5 minutes or did I misunderstand something. I simmered mine for a whole lot longer. I cooked the vegetables in beef broth, added 4 beets and used 1 tbsp. of butter total. Next time I will double the recipe. Six cups of water as the liquid does not serve a large group. Still an excellent recipe and I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEACHIE3"
},
"reviewBody": "This is very delicious and very hearty. My young sister and boyfriend both love it! I think it's perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YVIEJO"
},
"reviewBody": "I've never had borscht before, so I don't know how authentic this recipe is. I just made this to use up some beets--which, frankly, I don't even like much. This recipe, though, is INCREDIBLY DELICIOUS (and really, the most remarkable shade of purple/magenta when you use red cabbage...can't beat that)! I even used extra beets (2 large &amp; 3 small), then chopped them up and left them in, as people recommended (I figured it was too much work to puree or shred the beets)...and I psychotically love this soup. I think I could eat it every day. The dollop of sour cream was a great touch, too. I just had the last bowl...sniff...I think I need to get more beets and make this again. I'll try with much less butter next time, though...that was kind of an alarming amount for a vegetable soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Monzie"
},
"reviewBody": "This recipe was a good starting point, but I had to make several major adjustments to achieve something that was suitably \"borscht-like\" for my tastes. I used two beets rather than one (and next time, I'd use three) and I did not discard them after boiling. I chopped one beet into small dice and pureed the other. I added both right before service. Without the addition of the puree, the soup would have been bright orange rather than the deep ruby color I expect from borscht. \n\nOther changes I made: Added a tablespoon of dried dill toward the end of cooking, omitted about half of the butter and all of the celery (is \"half a stalk\" reallly going to add any flavor or texture?), didn't reserve the 1/2 c of tomato sauce (this step seemed unnecessary since everything gets mixed together anyway), and I used only about half of the cabbage called for and still found it to be a very cabbage-y soup (3 cups would have been serious overkill). Be sure to taste the soup before serving. I found that it needed quite a bit more salt and pepper than called for. \n\nGarnished with sour cream, of course.\n\nI will make borscht again, but not according to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "according to my grandmother, dill is the key!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anichka"
},
"reviewBody": "Great recipe, but thicker than authentic borscht I've had in Ukraine and Russia. \r\n\r\nThings I did just a bit differently... I used two beets with the stock (peeled) and when I removed them, I diced one and a half and added it back into the stock. I added a little more dill than called for, and I wish I had some fresh dill for garnish. I added just a touch of white pepper, and I topped the soup with sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was very yummy! I used one can of beef broth in place of water to boil the vegetables in at first. The flavor really seeped in without overwhelming the final soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I made this for a dinner party. I got mixed reviews. I love Borsht and I only thought it was okay. Too much cabbage in it. Reminded me more of cabbage soup instead of Borscht."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I too kept the beets and diced them and put them back in. I also added two cloves of garlic and I sauteed ground lamb in ghee and garam marsala (indian spices) along with the onions and cabbage. Forgot the heavy cream so I used a can of evaporated milk which worked just great. It turned out marvelously. I garnished with sour cream and fresh dill. No longer vegetarian but a phenomenal lamb borscht. I used ghee (clarified butter) instead of regular butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana"
},
"reviewBody": "did a couple adjustments. I'm on weight watchers so I used 1% milk instead of heavy cream and cut up the beets and kept them in. Very very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAPUNZAL"
},
"reviewBody": "There are many many different variations of borscht. This is very similar to what a Russian friend used to make for me. Definitely put a dollap of sour cream and some more dill when serving to make a great recipe even better!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alla Hirsch"
},
"reviewBody": "I've made this recipe several times. It's very good. I too chopped up the beet and put it back into the soup. I completely omit the cream and butter in the mashed potatoes. I just mashed them and put them back in the soup. I also use a 1/4 cup of fresh dill and it's very nice. I will try adding garlic next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KARIROCK"
},
"reviewBody": "It was ok, I've had better with meat, but as far as a meatless it was good.\r\nI shredded half of the beet and returned it to the pot and put all the cabbage it the skillet to soften,I'm glad I did this because the texture would have been too rough for me. This is a very thick soup, almost a stew. If I make this again I will substitute some of water with chicken broth. Also, at serving I added a dollop of sour cream in my bowl, it really smoothed out the flavour, I strongly suggest adding sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRIFFAC"
},
"reviewBody": "PS--for serving, top off with sour cream, sprinkle the sour cream with dill and garnish with parsley for a stunning display."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSISB"
},
"reviewBody": "Yummy soup! Thank you DeeDee for this delicious recipe. I know I will make it often in the future. I forgot the dill but it still tasted great. Next time will grate the beet in the soup as others suggested so I won't have to throw it away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUNATHENA"
},
"reviewBody": "The taste is WONDERFUL, although it's quite a different borscht than any other I've had! This is really thick, like a stew. But, like I said, the taste is awesome. I forgot the celery and only added the green pepper at the beginning, none at the end. A little time consuming, but easy. Worth the effort. I'll definitely be making this again - and next time, I'm going to double it so I can have some leftover!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOMEE101784"
},
"reviewBody": "Wow . . . This soup was delicious. My roommates and I are college students and we may be amateurs when it comes to cooking, but we know good food when we have it, and this is GOOD FOOD! This recipe was easy to follow and it was so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There were a couple of flaws in the recipe. It doesn't specify whether to peel the beet or not (which I think should have been done). I also added all of the green pepper in the first step because I didn't want raw green pepper in the soup. In the end the soup turned out really yummy. This was the first time my bf and I have ever tried borcht and we loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Me"
},
"reviewBody": "I also add cooked red or white beans. In the end I add one spoon sweet cream to each serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oh My Goodness! I never knew borscht could be so tastey. And the mashed potatoes are an interesting twist. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleen girl"
},
"reviewBody": "This is soooooo good. I was looking for a great borscht recipe. Found it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lightly salted"
},
"reviewBody": "After all the rave reviews, I was a little disappointed. I had never eaten borscht before, and perhaps I should try a more traditional beet-broth borscht before I make my final decision. I didn't like the tartness and the heaviness. And I followed the recipe exactly except for adding a few cloves of garlic in the onion-tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shana"
},
"reviewBody": "This is a very good and hearty soup. My favorite borscht is the one my Grandma used to make. However, her bortsch recipe used a LOT of butter (not margarine) and a LOT of cream. There was one unusual ingredient in my Grandma's borscht, beet tops. I added about 1/2 cup of chopped beet tops to this recipe at the same time as the first amount of cabbage. It was very good. I also diced the beets when cooked and added them back to the stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "backtoglass"
},
"reviewBody": "What a great recipe! There is only one beet in the recipe, so if you have never tried borscht before, don't be overly concerned that the beet flavor will overpower the other ingredients! My daughter insisted on brining some to school the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vex"
},
"reviewBody": "Very good recipe. My family loved it. I only adapted it slightly. I used a jar of homemade pickled beets, rinsed very well, and added some chopped, cooked bacon(my husband doesn't do meatless!)Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZEPHERSNOW"
},
"reviewBody": "This was my first taste of borscht and I loved it. It was work but very good and even better freezing lunch portions. Told the kids it was vampire soup and they ate their veggies! At first I forgot the dill and it was great then too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DON ROBERTSON"
},
"reviewBody": "It was great easy to make. I kept the beet in the soup and cut it up. The kids loved it. Will make again for sure . Tk's for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious. Definitely a keeper. Took a little\r\nmore effort than I would normally apply to a soup,\r\nbut I did add a step by grating the beets after they'd\r\nbeen cooked in the stock. In response to the\r\nother reviews: yeah, a little garlic wouldn't hurt\r\nbut it's fine without. And I LIKE having the cabbage\r\nin two different textures--I think that was the point.\r\n\r\nif\r\nb\r\nbut it's worth it. Wonder if I could do the mashed\r\npotatoes separatelyIn response to the other reviews:\r\nyeah,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RACHEL V."
},
"reviewBody": "I also have never had borscht but got the recipe\r\nto make for an Eastern European Themed potluck. \r\nEveryone raved about it. My husband gave it a 10. \r\nIt takes a while to make but it is worth it.\r\nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This borscht recipe is amazing. It is as hearty as they come and very full flavoured. I've made a few changes that you may like. A couple of cloves of garlic in the sauce really enhances the flavour. Also, I like to fry all of the cabbage so it is all of a consistant texture. Serve the soup with some sourdough bread and you will have a instant hit.\r\n\r\nIf any of you ever end up in the Kootenay region of British Columbia Canada you should stop by the Grand Forks Hotel. Their diner makes a wonderful example of this soup and also has many other traditional Russian dishes that you are bound to enjoy.\r\n\r\nCheers, \r\n\r\nMike"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "mmmmm,soooooo good! \r\nthe best borscht i've ever had\r\ni grated the beats into the soup instead of throwing them away\r\nthank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BARLEYMOM"
},
"reviewBody": "I was trying to find a borscht recipe as good as my friend's mom's. This is so much better. I have made it 4-5 times, and it gets better each time, as I make my own changes. This is the best borscht I have ever eaten. However, I don't discard the beet, I grate it into the soup! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CBROCKET"
},
"reviewBody": "i love it the kids hate it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BON8017"
},
"reviewBody": "This was such a yummy recipe! I've never had borscht before, but this came out so well that I will definitely make it again. And again. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the first time I have ever made borscht and it was delicious. I did make a few small changes by adding 1 cup of carrots and 2 stalks of celery. I also used butter instead of margarine and in the mashed potatoes I added light margarine instead of regular to lower the fat content slightly."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13015/borscht-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14768/soups-stews-and-chili/soup/vegetable-soup/borscht/",
"name": "Borscht"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13015/borscht-i/",
"name": "Borscht I"
}
}
]
}
}
, "about": [
]
}
]