				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Braised Corned Beef Brisket"
,"datePublished": "2019-06-06T19:52:42.000-04:00"
,"dateModified": "2023-03-06T14:16:38.851-05:00"
,"author": [
{"@type": "Person"
,"name": "mauigirl"
,"url": "https://www.allrecipes.com/cook/mauigirl1"
}
]
,"description": "A seared corned beef brisket is braised in the oven with sliced onions and garlic for an incredibly tender and juicy brisket that&#39;s well worth the wait!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uIHwhVbtZWq5j1ohXqXe1RB-1qU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231030-BraisedCornedBeefBrisket-mfs-Step4-3403-4x3-ee4922ea8cd04764b5930c86dda2aa2b.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4358618001001",
"description": "Perfect corned beef brisket is super simple to make at home.",
"duration": "PT54S",
"name": "Braised Corned Beef Brisket",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/06/15/231030-BraisedCornedBeefBrisket-is-4X3-3420.jpg",
"uploadDate": "2023-01-30T15:48:16.844-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Braised Corned Beef Brisket"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "1002"
}
,"cookTime": "PT375M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "455 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "162 mg"
,"fiberContent": "1 g"
,"proteinContent": "31 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1877 mg"
,"sugarContent": "2 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"1 (5 pound) flat-cut corned beef brisket",
"1 tablespoon browning sauce (such as Kitchen Bouquet®), or as desired",
"1 tablespoon vegetable oil",
"1 onion, sliced",
"6 cloves garlic, sliced",
"2 tablespoons water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 275 degrees F (135 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/oP66lfwjVSWE7vJqPtrQZknq1mw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231030-BraisedCornedBeefBrisket-mfs-Step1-3394-4x3-b28505554604434a832437106a32527b.jpg"
}
]
,"text": "Discard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/20uNe3r9EyjLU0d6Zh1IUAT-fQo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231030-BraisedCornedBeefBrisket-mfs-Step2-3395-4x3-8cc35ed00c2440a0a65c745fc39eb9d1.jpg"
}
]
,"text": "Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uVL_4sO9aUIXhNq6bRie48K4NG4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231030-BraisedCornedBeefBrisket-mfs-Step3-3399-4x3-0975924e8fe5448d87e317c219ccb410.jpg"
}
]
,"text": "Place brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uIHwhVbtZWq5j1ohXqXe1RB-1qU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231030-BraisedCornedBeefBrisket-mfs-Step4-3403-4x3-ee4922ea8cd04764b5930c86dda2aa2b.jpg"
}
]
,"text": "Roast in the preheated oven until meat is tender, about 6 hours."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT390M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terri crawford"
},
"reviewBody": "Made it, loved it! BUT I, being a novice at making brisket, bought a prepackaged corned beef brisket didn't read the packaging so I missed all the salt that came with it...oops. but amazingly still pretty darn good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made this today and it was perfect! I too, will never boil or crockpot cook a corned beef brisket again. I placed potato halves under the brisket and added just a bit more water and it is so delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Disaster. I got a great cut of meat, a flat, from the best butcher in town. Followed the directions, at the end of six hours it was so tough it was ridiculous. I put it in a pot of boiling water with spices, cooked an additional three hours, finally tender. Our company left hungry. Took a minimum of 9 hours to cook. Never again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmarendt"
},
"reviewBody": "Discovered this recipe several years ago when my Mrs said she wanted Corned Beef for St Patrick's day. I went out on a limb and still there, this recipe is awesome and by far the best way to make Corned Beef. I tend to follow the recipe to crowd (usually just the 4 of us) pleasing results. Thanks to the original cook who posted it... absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luannec55"
},
"reviewBody": "This was the best corned beef I've ever had, by a MILE! I cooked it the entire 6 hours and I'll admit I was nervous when it was time to take the foil off the place. But, as soon as I saw it, I knew it was going to be delicious. The fat was completely rendered and the meat was so juicy and tender that I didn't want to stop eating it. I served it with colcannon and Irish soda bread. I'll never make corned beef any other way and I'll make it more than once a year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "The best corned beef ever. I braised a three pound brisket for 3 hours, adding Guiness and water (about 1/2 cup) to the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Habanero"
},
"reviewBody": "I have made this about 4 times now. It comes out perfect every time, following the recipe as instructed. (1st 2 times and this time) I did get a salty brisket the 3rd time and we couldn't even eat it, so this time I purchased a low sodium brisket and rinsed it well, patted it dry then did the pan sear. It is soooooo good like the 1st 2 times. I thought maybe I had not put the brisket on a rack the 3rd time cause the juice that ends up in the bottom of the dish with the garlic and onions is very salty. While it looks very yummy, taste it before you are tempted to put in on anything. It's good used very sparingly. We drizzled some over the side dish of fried sauerkraut with onions and potatoes. We sliced the meat very thin and it was falling apart tender. Great meal. Thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Dennison Hanson"
},
"reviewBody": "Many moons ago when I was managing an RV Resort I decided to try this recipe out on a park full of people. I had 4 13-15 lb corn beefs going in portable roasting ovens. Had a volunteer group in the kitchen preparing potatoes, carrots, onion and cabbage. Probably had close to 10 volunteers working with me. Served 200 people, there was nothing left but scraps for my wonderful volunteers. First time ever making it and have done so every year at every resort and now know enough to not sell all the tickets or cook an extra amount for us slaving in the kitchen. Will never make my corn been any other way! No longer work the big resorts, have one in the oven right now for my family, delicious aroma is driving us all crazy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This corned beef is THE BEST I've ever had, bar none. I was a bit concerned by the small amount of water, but it produced lots of au jus, follow the recipe to the \"T\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jai Brown"
},
"reviewBody": "Superb alternative to traditional recipe. I do recommended soaking the beef in water for at least 30 minutes to decrease the saltiness. I follow this recipe to the letter but I add the seasoning packet to 4 Tbs water in the pan and quickly baste once after the first hour. You must wrap the pan tightly however or risk a dry brisket. We prefer corned beef bottom round for a tender meal. Serve with Irish Potato Cassarole for a hearty memorable meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing!! Best I have ever made. I took another reviewers suggestion and added 1 bottle of Guinness. It was moist and perfect. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPease"
},
"reviewBody": "Our favorite Corned Beef Brisket!! Thought I'd lost the recipe but thankfully found the notes with your link on it! So so so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peter Ross"
},
"reviewBody": "I suppose like me most people don't know how salty their roast is. I guessed by tasting the juices from browning. I agree that a salty roast should be cooked in water or soaked as author recommends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Gerry Wilson"
},
"reviewBody": "Easy and delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue S."
},
"reviewBody": "I've made this and a similar recipe for the last few years. Will never boil a corned beef brisket again!! NOTE: it is VERY important to tightly wrap/cover the roasting pan and DO NOT peek. You will lose steam and end up with a dry brisket."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "braids1997"
},
"reviewBody": "This was the best corned beef I've ever made! Not dried out at all, and so flavorful &amp; tender! The only changes I made were of necessity as: 1. the brisket I had purchased came with the seasonings already applied 2. My rack wouldn't fit in the pan so I rolled up foil logs to keep the brisket raised 3. I did add just a few extra tbs of water(about 1/3 C total) to avoid a dry finish, but was not necessary! The only change I will make in the future is to add more than 1 onion! They were wonderful! Everything else was according to the recipe. I did carefully seal the pan tightly with foil &amp; went with the 1 hour per pound of meat cook time and there was plenty of liquid in the pan when finished. I did bake a separate pan of carrots &amp; celery with Kitchen Bouquet® &amp; a small amount of water for the last 2 hours, and made Colcannon with cabbage kale, leeks and a roasted garlic paste, and some a small loaf of Irish Soda Bread completed the meal. A most excellent recipe I will use again &amp; again! Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tombt"
},
"reviewBody": "I will never go back to throwing my brisket into a crock pot with water and the spice packet. This recipe is simply excellent! The juices from the meat over garlic mashed potatoes are to die for. Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenieJ"
},
"reviewBody": "This has been my go-to corned beef recipe for years now. It's requested by all my family &amp; friends. Love my mom, but this is SO much better than the boiled corned beef I grew up eating. Try it... you won't go back to boiling. (I usually do 3-4 roasts. Flat cut is a MUST. I brown on the stove in cast iron and braise in an electric countertop roaster oven; wrap the foil tightly around the insert, drop it into the roaster, then set the lid on top.) Also, I think the reviewers who commented it was dry and burned must not have wrapped the foil tightly enough, or they checked it during the cooking. It should be swimming in its own juices by the end of cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PLKITTLE"
},
"reviewBody": "I have made this several times and it is always delicious. Makes the best corned beef sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmuellercinci"
},
"reviewBody": "I make this a little bit different than the recipe. I brown the brisket in my large cast iron dutch oven. then I take it out, add desired liquid (I usually use beef stock) in the bottom with minced garlic, add a colander and put the meat back in adding onions and more garlic, cover with lid - cover lid with foil - bake in oven as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Thurston"
},
"reviewBody": "This became our family’s favorite way to do corned beef. I used HP as my browning sauce and resisted the temptation to peak during cooking. We were rewarded with a moist and flavorful corned beef. I learned after the first one that it can be good to line your floor with newspaper and your stove top with foil during the browning process if you want an easier clean up afterwards. Grateful for this recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Racine"
},
"reviewBody": "This is my new go-to corned beef recipe. I wanted to try this the other day so made one boiled and this one to compare. This was ALL of our favorites! I didn't have browning sauce so found a recipe and made my own. Instead of any water in the bottom of the pan, I used the brine from the corned beef. I did add carrots and potatoes to the pan but otherwise, followed the recipe exactly. We're going to be having this in our regular rotation now. Delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anne"
},
"reviewBody": "Only changed a couple of things. I rinse the Beef off under cool water, after taking out of the packet. Other change is I added a whole bottle Guinness to the water before sealing the roaster with foil and putting in the oven. Was super tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best corned beef I've ever had. I wouldn't make this any other way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monnana7"
},
"reviewBody": "This recipe is perfect. Easy to follow with delicious results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent, the most tender,moistest, flavorful corned beef I've ever had let alone made. I wish I'd found your recipe 40 yrs ago."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shop1212"
},
"reviewBody": "I think I found this recipe about 5 years ago and haven't boiled corned beef since. My kids hated corned beef so the first time I made it I only made two four-pounders. One for the family and one for me to have Reubens for a few days after. Well, kids plowed, as did I and the wife and I only had enough leftovers for one Reuben after. This year I'm making two in the oven per this recipe but also have two on the smoker right now. I know it's a variant so plan on smoking for 60 minutes then wrap in butcher paper for the duration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichol"
},
"reviewBody": "It is very tender and juicy and very very very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Garner"
},
"reviewBody": "Winner, Winner !! By far this was the most tasty, tender &amp; delicious Corned Beef I've ever made. I followed the recipe to a tee, which proved that this recipe made the perfect Corned Beef. From now on it will be will the only recipe I'll ever use. No more boiling, or using a slow cooker. Even as old dog at 65 years old , I was able to learn a trick. Sad to think that I'd been boiling them for years, but then switched to a Slow Cooker. So it might have taken me 45 years, but I finally found the ultimate recipe for making Corned Beef.... My thanks and appreciation for this goes out to \"MAUI GIRL\", I couldn't have made it without you 😘"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebel Miles Photos"
},
"reviewBody": "The BEST corned beef Ive ever had…. Amazing! I followed the recipe and will never boil corned beef again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MBraat"
},
"reviewBody": "The best corned beef I have ever had. I am not a particularly talented cook but still, my Irish mother and German mother in law also said it was the best they ever had. They didn't even try it until several days after I cooked it. Great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CafeDude"
},
"reviewBody": "An easy winner! But - with only 2 Tablespoons of water and 6 hours of cooking time for a 5-pound brisket there are some things that can go wrong. Use Heavy duty foil and a pan that has a lip so you can get a tight seal. Don't let the brisket touch the foil, the salt will dissolve the foil allowing the steam (water). I doubt a little more water for insurance would change the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kme"
},
"reviewBody": "I made this recipe exactly as they described, with the exception that my brisket was about 3lbs. So my only advice is to know how the size of your brisket equates to the cooking time. Mine ended up a little on the dry side (albeit still very flavorable)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gridstooge"
},
"reviewBody": "Holy crap! Just made it today. Followed instructions exactly. 4 #roast cooked it 5 hours. Most tender piece of meat bar none. Making reubens tonight. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this numerous times. It's excellent every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "FABULOUS! So easy, and the best corned beef I ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "texasgirl"
},
"reviewBody": "All I can say is wow!!! I have always been a corned beef boiler but not anymore. I wanted to try something different and found this one. I followed it exactly as written and my whole family absolutely loved it. I’ll never boil my corned beef again, thank you for sharing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheLizzylen70"
},
"reviewBody": "This is now our go to way to make corned beef. It's so easy and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "supersteph"
},
"reviewBody": "Best recipe ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So I made this twice. First time I was not careful in following instructions - added too much liquid (1/3 cup) and opened foil to check meat, and thought it was done at 4.5 hrs, not. Tough. 2nd time, I carefully followed instructions as written, 2TB water. tightly sealed, no peaking, full 6.5 hours. Incredibly moist, tender and flavorful. Today I will make it for my third time, as it is now my 'go to' recipe for corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Rae Bronson"
},
"reviewBody": "I was easy and oh so delicious!!! This is now my forever recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LULU"
},
"reviewBody": "Just made it! I used the dutch oven. Added 1/2 bottle stout beer, browned the meat with worstedshire sauce. Smelled great. I didn't have a rack so used 2 onions sliced thick then put the meat on top of them. Sliced onions and garlic on top. Cooked at 275, for 2 1/2 hours, as it was only a 2 lb corned beef, grass fed and uncured. Then I put in potatoes, carrots and cabbage on top of that. Cooked 1 1/2 hours more. GREAT flavor all of it and veggies. Will do it this way from now on. Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia"
},
"reviewBody": "Definitely will do this recipe from now on. Delicious and flavorful. Loved the addition of onions to the corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy McNulty"
},
"reviewBody": "OMG winner!! I’ve been making corned beef for years, typically boil it, sometimes on the stove sometimes in the crockpot, it always turns out tender and lovely but I felt like mixing it up this year and I’m beyond ecstatic I found this recipe! The negative reviews are confusing, and do not add up but I can only assume that their pan wasn’t sealed well enough, and too much moisture evaporated therefore resulting in dry meat… I happened to have Kitchen Bouquet in my pantry, I had a 4lb brisket and followed the recipe (might have used 8 or so garlic cloves). I made a foil coil (YouTube it if you need to, but take a large piece of foil and fold it up so it’s in a long roll and then shape it into a snake like shape so the meat can sit on it) so that I could bake it inside a 9x13 glass baking dish and have it elevated. After searing I placed the brisket on the coil, added the garlic and onions and then poured about 4 oz of light beer into the searing pan to deglaze it. I let that cook around for about a minute and then poured that liquid over the roast, double foiled it and made sure it was TIGHT! That baby cooked in the oven at 275 for 5 hours. (Based on the recipe that was 6 hours for a 5lber, I kinda guessed). Smelled INCREDIBLE! Took it out to test it and the meat was basically falling apart. This recipe is far supreme to the traditional boil method. I made this one, and then one in the crock pot (boiling method)… Everyone at the table preferred this version (by a landslide) and I will be making this every year until I die! Thank you for passing this on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love2cookit"
},
"reviewBody": "I have never given a review for a recipe in my life but this one deserves it and more!! I have always made the traditional (store instructions on package) boiled forever corned beef but this year I wanted to try something new. This was the best I have ever tasted and was extremely easy too. It came out fork tender and super moist. The entire family said this will be the recipe to use from now on and I agree!!! Fabulous! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this yesterday and it turned out great. Didn't use the Kitchen Bouquet because I didn't want to add more sodium. Had a 2.5lb roast so cooked it for about 4 hours. It was very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was the best Corned Beef recipe I've ever made. I will never put one in water again. I added a bit more water but still didn't touch the meat. I also added the packet to the water. Mines was 3.79 lbs so I cooked it for 3 1/2 hours. I didn't miss the horseradish one bit. I am looking for another one to make for dinner this Sunday! Thank you so much for this recipe as it's definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Mauigirl! This was fantastic! My husband and I could not get enough! Made to have a nice, St Patty’s dinner and this exceeded our expectations! We had half the weight in corned beef so adjusted the cook time accordingly. We did get worried an hour and a half in - looked like it was drying out. I cooked in my pampered chef roaster - which has a heavy lid - so we did end up reducing oven temp to 200 for 40 min and the 250 for the last 40 min until got to 195 internal temp. Moist, flavorful and just mouthwatering amazingness! Marked as a favorite and you’re right! This should be made more than once a year! Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHARONJUL"
},
"reviewBody": "This 2nd year in a row I have used this recipe. It’s so delicious. I will never make corned beef by boiling it again. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Honeylisa"
},
"reviewBody": "It's in the oven right now but first I tried this recipe a few months ago. My husband loves corned beef so I've tried boiling it in a regular pot, boiling it in a Le Creuset dutch oven and in the Instant Pot. Until now the dutch oven was our favorite but once I tried this recipe this has been the best. I followed the recipe exactly and would not make any changes. The depth of flavor and tenderness makes the 6 hour wait worth it! Once it's in the oven I can forget about it (no peeking!) for the cook time and go about doing something else. This is an excellent recipe and something different than the same old, same old. I don't think anyone will be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "In my 70 years I've never made a corned beef that I liked as much as this one! I only had a 3lb roast so I checked it at 5 hours and it was perfect. I'll never cook my corned beef any other way. P.S. I'd post a picture but there wasn't a crumb left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "User"
},
"reviewBody": "I've been making this corned beef for several years now and there is NO better recipe. You won't look at other people's corned beef the same after you have this, it has turned me extremely snobbish on other preparation methods. The meat is VERY tender and flavorful. We make this at least monthly in our house, served with roasted potatoes/carrots/cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this about a dozen times and EVERYONE who’s eaten this said it’s the best corned beef they ever had. So simple, so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bleman"
},
"reviewBody": "Excellent Corned Beef. My husband dislikes boiled meat and won't eat it. This he loved. I will be cooking it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Mackey"
},
"reviewBody": "We have a huge Paddy Party every year, and I usually make about 9 briskets. I love to experiment with recipes, so I’ve done it all - including Corning my own brisket. A few years ago, I did corned beef 3 different ways, including this recipe, and this was the first time people have found me and asked for the recipe I used. I’ve done it this way ever since, and I’ll never go back. I follow this recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Janmaat Ackerman"
},
"reviewBody": "I loved it! My husband loved it! My kids loved it! I will never make it boiled again. It was perfectly seasoned, tender and leftovers make awesome Reubens..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Thorne Wright"
},
"reviewBody": "Delicious. best corned beef i’ve ever eaten!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Connor"
},
"reviewBody": "This is now my go-to recipe for corned beef. It was tender and delicious. After browning the corned beef, I poured about 1/4 C Baileys over it. I also put some carrots in the roasting pan. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Best corned beef I've ever made and the house smelled heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathi"
},
"reviewBody": "I will never boil my Corned beef again! The recipe was perfect. I never had success with this type of meat before until now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved! Will never boil a brisket again. The meat’s taste and texture were so much better cooking it this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is absolutely the best Corned Beef recipe ever. My office buddies and my heavily Irish Corned Beef expert sister says it's the best they've ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "optizoid"
},
"reviewBody": "WOW! I have found my favorite corned beef recipe. This is a recipe that I will continue to use. Followed directions except for reducing the amount of garlic slightly. Husband claims to “hate” garlic. Of course he only says that if he actually knows it is in there! Have made this numerous times and it has always turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gayle Shepherdess"
},
"reviewBody": "This turned out quite tender and even tasted better the second day for cold for sandwich meat. However next time I would reduce the cayenne by half or more as I found it quite hot - especially the gravy. I also had to make a lot more rub to have enough for the cut. I also reduced the salt by half and even then it was a little salty. I would definitely make this again tho!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Lappie-Reay"
},
"reviewBody": "I will NEVER boil my corned beef again!!! The only change I make is-I add more than what is called for in water. Melts in your mouth delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "I won’t make it any other way again! This is fantastic and ALWAYS gets high praise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frossate"
},
"reviewBody": "This was the best Corned Beef I've ever made. I listened to one of the other reviewers and tightly sealed the roasting pan with aluminum foil and didn't touch it for 5 1/2 hours (4 pound corned beef). The other bonus the roasting pan cleaned up easily unlike the weird film that you end up with in a stockpot after boiling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Malalang Martinez"
},
"reviewBody": "The description was correct. I will never go back to preparing brisket the old fashioned way. I did not have browning sauce, but substituted it Worcestershire sauce and liquid smoke. Like another reviewer, I browned it but placed it in my slow cooker instead of the oven because I had to leave the house. After 5 hours, I added cut up cabbage and let it cook for another hour. I made colcannon as a side dish and used the cabbage that I had added to the colcannon recipe. It is hard not to get seconds. And I am already thinking of making it again next week as it is a low hassle recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Newman"
},
"reviewBody": "So much flavor!! They’re right… I’ll never make it another way again! Having said that… I don’t even bother to braise it 1st most of the time. I just throw it all in and it’s SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharoncannon73"
},
"reviewBody": "I've used this recipe so many times- just perfect. This is a family favorite all year. Meat falls apart, so tender. Can serve with any mash, sauerkraut, sides- or slice up and make fabulous reubens. Have one in oven now and wanted to thank you for teaching me the proper way to cook corned beef brisket. I put a couple paper towels over meat in frying pan so oil doesn't spray everywhere. Make a rack out of foil if you don't own one. Cover in minced garlic and onion slices, little water, wrap tightly with foil...6 hrs. Simple perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pammyjo"
},
"reviewBody": "I have made this several times, it's my go to brisket recipe. I always trim the fat off mine, my family does not like grease. The only thing I do differently is I brown the meat first, then add pepper, the Kitchen Bouquet and garlic/onions. Always turns out delicious! I adjust the cooking time by the size of the brisket. A 2-3 lb brisket takes 4-5 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "All I can say is……YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel"
},
"reviewBody": "I've made corned beef brisket many times in my life. The included seasoning packet was its lifeline. This recipe instructs to discard it which had me conflicted to use it anyway but I listened. I followed this recipe to the letter except for having a 3.5 lb brisket so stopped after 4.75 hours. This was absolutely the best I've ever had and will use this recipe again and again! I don't know what made someone try this the first time but I am glad they did! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "This is the only way that I will ever make corned beef! I had an almost 3lb roast that I cooked according to the recipe but cut the time to 3 hours. It came out perfect! Thank you, Thank you, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ava"
},
"reviewBody": "It was great. No more boiling corned beef for me. So tender. Eat it all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Palka"
},
"reviewBody": "such tender and tasty meat! just be sure to tightly seal with foil. very easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyLimey"
},
"reviewBody": "This is the ONLY way to cook corned beef. I found this recipe a couple of years ago and am so happy I did...I cooked two this year for St. Paddy's Day -- one to have with cabbage and the second to make Reuben sandwiches the following day. EVERYONE raves about the tenderness and flavor. Thank you so much for sharing this wonderful corned beef brisket recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BPMargieD"
},
"reviewBody": "I make corned beef a few times a year as my family loves it! However I have always boiled it and then I make glaze for it. I decided to try it this way and I’ll never go back! Not only was it super tender, but there was considerably less shrinkage. Also it smelled wonderful unlike when I boil it with the cabbage!! I followed the directions and used only 2T of water and sealed the brisket in a double layer of heavy duty tin foil and put it in a baking pan. It was a larger corned beef —about 6.5 lbs— so I baked it at 275degrees for almost 7 hours. When I finally unwrapped it it was picture-perfect tender! And it had created about 1.5 C. of water! So don’t be worried that it will dry out. It creates its own juice and as long as it’s sealed tightly and YOU DONT OPEN IT UNTIL THE TIME IS UP, it will be PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Machelle"
},
"reviewBody": "Very good. I did rinse and soak the roast overnight in cold water in refrigerator. I add the packet of seasoning to the roast before putting in oven. I sliced an onion in 1/2\" slices and had the roast on top of onion while baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annfrommichigan"
},
"reviewBody": "I followed the directions exactly! I’ve been making corned beef in a slow cooker all these years and this was so much better! Tender and so flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich Mavis"
},
"reviewBody": "Excellent recipe and easy to braise it this way. No knife is needed, the brisket is fork tender. I made one change, after searing the brisket, I sautéed three large onions in the dutch oven, removed them and placed the brisket back in and covered them with the onions before braising them in the covered pot for 5.5 hours. They onions were excellent and I believe key to retaining the juices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stuart"
},
"reviewBody": "This was by far the best and easiest corned beef recipe I ever made. It was phenomenal! Very tender, flavorful, and boiled corn beef pales in comparison. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KGrant"
},
"reviewBody": "The best corned beef recipe I’ve ever made! The only thing I did differently was to put it in my Dutch oven to bake. It was so tender and flavorful. It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Fitzgerald"
},
"reviewBody": "This is the #1 recipe for corned beef. I’ve made it several times now. It is in a completely different class than the boiled method. If you really want to use the boiled method check out bon appetit. There were some comments about coming out dry. This won’t happen IF you follow the instructions. The key is to seal very well and don’t peek. Incredible recipe.. thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Smith Ordaz"
},
"reviewBody": "This was the best corned beef brisket I have ever made. I did alter the recipe slightly. I browned the meet first (5 mins each side) using Worcestershire sauce with Spicy Mustard and added some Marjoram and Tarragon. Then put it on the rack and poured remaining sauce with sliced onion and 3 minced garlic cloves and added spice packet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lamberts2396"
},
"reviewBody": "Soooooooo good! The crust on the roast is amazing. The delicious oniony broth created is really special. I’m never boiling again. If you aren’t sure of the saltiness of your flat, definitely recommend soaking as per the authors comments. Mine was slightly salty, but so delicious we overlooked it. Used the crusty ends in my colcannon for leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy-Shorewood"
},
"reviewBody": "OMG...Fabulous...Been making Corned Beef every year for the family for St. Paddy’s day for over 40 yrs. Tried multiple cooking methods and recipes. Was always underwhelmed. Found yours...absolutely tender and delicious. It was perfection. Followed your recipe to a T. Didn’t even peek. Thank you for my new go-to recipe. Made it twice since. Love love love it! Thanks, Kathy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huttly"
},
"reviewBody": "Turned out beautifully. 5 hours for a little under 3.5 lbs. Cooked cabbage (1.5 lbs, short cored and cut into 6 wedges), carrots (6 medium, cut into 1-inch chunks), and red potatoes (1 lb. halved or quartered, depending on size) in 2-3 cups of beef broth (adding the spice pack ) in a Dutch oven. Brought broth to a boil then simmered: for about 25 minutes for carrots &amp; potatoes and 20 minutes for cabbage wedges (and smaller carrot chunks), bringing broth back to a boil after each addition then lowering to a simmer/low boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dilleydoll"
},
"reviewBody": "This recipe was SOOO easy to make and delicious! I was skeptical about throwing away the seasoning packet but I shouldn't have worried! The meat came out tender and moist. I added cabbage the last hour (maybe too long for the cabbage) and it was delicious, having been steamed by the meat, onion and garlic's juices. Definitely my go-to corned beef recipe from now on! I should have taken a picture before we ate. Now all that's left is an empty pan! DELICIOUS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "This braised corned beef brisket is awesome. I'd always boiled the traditional way before, but after using this recipe and method there is no other way that compares. Using the browning sauce prior to searing adds wonderful color and flavor; putting the onions and garlic on top of the brisket adds even more flavor. I used a scant half cup water instead of the recommended 2Tbl. and it turned out great. My whole family loved it and couldn't get over how tender and delicious it was. I will never go back to the \"traditional\" boiling method - this recipe is far superior. Be sure to seal your braising pan/roaster well and line the pan with foil for an easier cleanup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Norman Hastings"
},
"reviewBody": "I had never eaten corned beef before, not even a Reuben. I made this yesterday, and to me, it tastes like ham. I thought it was good, very tender and juicy. However, it was really salty (and believe me when I say I like salt!). I did rinse the meat and dry with paper towels, before processing with the recipe. I read some reviews that said they might soak overnight in water next time they make it. I would consider doing that also, if I ever make it again. My husband wouldn't eat it, but he's funny about anything he's never eaten before anyway. Also, I might not put the Kitchen Bouquet on it. I think a good sear would be good enough. I \"braised\" it in my Dutch oven with foil and the lid on, so the moisture stayed inside the pot. Then there's also the question of how to cook the cabbage, potatoes and carrots if you're not cooking them with the meat (like you would in a boil), or with ham. Give it a try though. It really was pretty good, but consider soaking it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim"
},
"reviewBody": "After making traditional boiled corned beef and cabbage as well as various roasted versions for decades...this is THE BEST Corned Beef I've ever made! My husband said it first - \" This is your BEST yet! .\"\nFollowed the recipe as stated. I had a 2.7 lb corned beef and roasted it for 4 hrs. It sat on the stove wrapped for another 2-3 hrs. while I roasted carrots, cabbage and boiled potatoes. Served it with the juices and onions from the pan as well as sou cream and horseradish sauce. DELICIOUS!!\nAlso made Irish Soda Bread muffins on the side...\nThank you for this great recipe! \nNo need to change it people...easy, simple and DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barry Wermes"
},
"reviewBody": "I've eaten boiled corned beef all my life because that's the way I was raised so I was a bit skeptical about making it in the oven. Let me tell you that I'll never boil another corned beef again. It was so moist and flavorful I couldn't bevieve it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dobo"
},
"reviewBody": "Tasted fantastic!!! We will definitely do this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Mackay"
},
"reviewBody": "I’ll never make it boiled again: this was INCREDIBLE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "This turned out great. I did add more liquid though. I added 1 cup of sodium free chicken broth. It was excellent, and the most tender corned beef I've ever made. I added the potatoes and cabbage the last hour. My roast was 2.5 pounds so it took about 5 hours to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Payne"
},
"reviewBody": "No more boiled corned beef for this girl. This recipe is AMAZING! So tender, so delicious, just so so so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimann26"
},
"reviewBody": "I first tried this recipe about 3 years ago and now I make it every year! My 3 boys love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "123GRIZ"
},
"reviewBody": "Excellent! I omitted the water and wrapped mine in 3 pieces of Reynolds Wrap. It was tender and moist."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231030/braised-corned-beef-brisket/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/472/main-dish/beef/corned-beef/",
"name": "Corned Beef Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231030/braised-corned-beef-brisket/",
"name": "Braised Corned Beef Brisket"
}
}
]
}
}
, "about": [
]
}
]