				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Brandied Orange and Cranberry Sauce"
,"datePublished": "1999-10-06T23:50:58.000-04:00"
,"dateModified": "2022-10-06T16:33:20.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Claudia"
,"url": "https://www.allrecipes.com/cook/24322286"
}
]
,"description": "Try cranberry sauce with brandy for your next holiday meal. Brandy keeps it sweet and fruity while citrus zest and juice add extra interest."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CoXjOBEr7N2G41jYlsvgmGRoSl0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9425427-e96aa42f88104b64b2d036d9db57c467.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Brandied Orange and Cranberry Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "157"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "157 kcal"
,"carbohydrateContent": "40 g"
,"fiberContent": "2 g"
,"proteinContent": "0 g"
,"sodiumContent": "2 mg"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups water",
"0.66666668653488 cup orange zest",
"2 cups white sugar",
"0.66666668653488 cup orange juice",
"1 tablespoon lemon juice",
"3 cups cranberries",
"1 tablespoon brandy" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Inspect four 1/2-pint jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until cranberry sauce is ready. Wash new, unused lids and rings in warm soapy water."
} ,{
"@type": "HowToStep"
,"text": "Combine water and orange zest in a small pan over medium heat; cover and bring to a boil. Reduce the heat and simmer for 15 minutes. Drain, reserving all zest and 1/3 cup liquid."
} ,{
"@type": "HowToStep"
,"text": "Return zest and reserved liquid to the pan; add sugar, orange juice, and lemon juice. Bring to a boil, then reduce the heat and simmer, stirring often, for 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add cranberries. Increase the heat to medium-high and boil until cranberries have popped and a small spoonful of sauce sets on a cold plate, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the heat and stir in brandy. Pour into the prepared jars, filling to within 1/2 inch of the top. Cool to room temperature, then seal and store in the refrigerator."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Vézina"
},
"reviewBody": "The best sauce ever! Everybody asked me for the recipe! it’s a Must for the holidays"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Spice"
},
"reviewBody": "Super quick and easy. The orange zest adds lots of fragrance to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angela_jones"
},
"reviewBody": "This is at it says, the best cranberry sauce you will ever taste. Absolutely delicious and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ramona"
},
"reviewBody": "I would reduce the orange zest"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IFETAYO"
},
"reviewBody": "I have always hated that jelly stuff in a can, but I made this instead and it was a huge hit. This will be added to my yearly thanksgiving recipes. I agree with others that the brandy really makes it. If you don't have or don't want to use the brandy it really won't be as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tiggertiffin87"
},
"reviewBody": "It wasn't clear if you were supposed to leave the zest in with the remaining liquid, so I left it in. Cook time was 20 minutes, not 10. It was too sweet for me and had too much of the orange flavor. Next year I won't be adding the zest back in and will be reducing the sugar. I love my cranberry sauce a bit tart and to taste like cranberry. This tasted like orange to me. But it did gel up real nice and even sealed the jar. :) I'll try this again next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristineM"
},
"reviewBody": "I used this recipe as a guide - reduced the sugar to 1 1/2 cups, add one pear, peeled cored and chopped, and used blackberry brandy. I don't even know if you needed to add the orange zest infused water, but it was a nice touch! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael Lohr"
},
"reviewBody": "Very good sauce. Despite all the sugar, it didn't taste too sweet. I think the bitterness extracted from boiling the orange zest off set the sugar nicely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat Gustafson Haugland"
},
"reviewBody": "at my house, we call these crack berries. people have been known to skip the plate and eat them alone by the bowl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Shepherd"
},
"reviewBody": "I've made this the past couple of Thanksgivings. This is the best cranberry sauce I've ever tasted! The brandy enhances the flavor...so delicious! I never want to have any other cranberry sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I love this. Do"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "I love this recipe and have made it several times for the last 2-3 years for Thanksgiving and Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pbates185"
},
"reviewBody": "I substituted bourbon for brandy (I live in kentucky). It was a hit and I was asked to bring it again next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny"
},
"reviewBody": "I bought an OXO zester just to make this recipe and it was worth every penny! I followed the advice from a previous review and used fresh hand-squeezed juice (with minor bits of pulp) from the oranges I zested. Turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia"
},
"reviewBody": "Delicious! This is my go to recipe! I half the amount of zest, double the brandy and add it at same time as the cranberries to cook out the alcohol. My mom makes this too and has added lemon zest when short on orange zest, still delicious! You won't go back to canned after trying this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Lambert"
},
"reviewBody": "I make this every year for Thanksgiving"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Dayton"
},
"reviewBody": "The best. Love the brandy... but I poured in probably a pint with 4 bags of fresh cranberries and used brown sugars! Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tee"
},
"reviewBody": "As the others stated, I reduced orange zest to 1/3 cup and boiled it with 1 1/4 cups of water (instead of 2 cups.)\n\nI didn't have Brandy on hand, but, it still tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Collins"
},
"reviewBody": "Wonderful cranberry relish! The only thing I changed was the zest; I used half what it called for, and used fresh-squeezed orange juice (one big navel orange did it.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika O"
},
"reviewBody": "Love it, it was a huge hit. I have made it the past 2 years for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Muszynsky"
},
"reviewBody": "Added more brandy to mine, and no, I'm not a lush. The alcohol burns off and the added brandy gives the sauce a boost of an oakey flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bacosmom"
},
"reviewBody": "Homemade Brandied Orange and Cranberry Sauce vs. Canned Ocean Spray Whole Berry Cranberry Sauce.... Let's see... Everyone of my guests raved about this recipe... Even the ones who usually turn their nose up at the thought of eating cranberry sauce. Going forward, this recipe will be included on all my holiday menus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Daniel Allen"
},
"reviewBody": "I LOVE this cranberry sauce. I used just under 2/3c of orange zest for a double batch, so about 1/3c for a single. It turned out soooo good. My sister even declared it an new thanksgiving tradition. 5/5 would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Candido DiNella"
},
"reviewBody": "This is the 4th year I have made it for Thanksgiving. What a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boylanhenley"
},
"reviewBody": "one of our traditions now for thanksgiving. thanks for sharing the recipe. it's DELICIOUS and and a million times better than canned!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marmot"
},
"reviewBody": "This was a huge hit at Thanksgiving. I had fresh cranberries straight from the grower. I had so many I made a double batch. I only had 2 oranges, I used a very fine cheese grater that I bought in Italy. It's actually too fine for cheese but worked beautifully on the oranges. I didn't have near 1/3 cup but it was still very concentrated flavour. I cooked my batch extra long and kept testing consistency on a cool plate. I got the consistency perfect, I've made my own cranberry sauce many times and know you don't want runny sauce. Just keep cooking it down until it sets up nicely on that cold plate. I also used the fresh juice from the oranges and topped it off with purchased juice. I've never added lemon juice before; it made a really nice addition. This is a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valentina Rivera"
},
"reviewBody": "This was the best cranberry sauce ever! Cant wait to make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChuckTheCook"
},
"reviewBody": "Gets rave reviews every time! People really look forward to me bringing it to Thanksgiving. I'm a little concerned about calories so I reduce the sugar to 1.5 cups and it works just fine. Also, don't bother buying orange juice. Instead, use the juice from the oranges you just zested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don_Prosser"
},
"reviewBody": "A rare 5 stars, just perfect! Easy, simple but deep in essence. Take care to measure, measure, measure... then add more brandy. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kojiless"
},
"reviewBody": "Followed the advice of other users and halved the amount of zest. I still had to zest 4 whole oranges to get that much, but I was able to use the oranges for the 2/3 cups of juice required in the recipe. I'm not a big fan of white sugar, so I replaced it with raw sugar. I was worried that there might remain a raw sugar aftertaste, but I didn't notice anything amiss. I also used 1/2 teaspoon of ascorbic acid (vitamic C powder...available in many health food stores) mixed with 1 tablespoon of water instead of the lemon juice. It does the same thickening work that the lemon juice does but without the lemony flavor. Finally, I used Cointreau orange liqueur instead of the brandy for a final orange kick. It was wonderful. All in all, this was a great recipe that rewards you for the extra time put into it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MATSONL517"
},
"reviewBody": "we love this recipe and will continue to make it at least every thanksgiving"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Krista Ferrill Donahue"
},
"reviewBody": "My usual one beats this one, sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elisawick"
},
"reviewBody": "Excellent recipe. A little time consuming, but well worth it. I decreased the orange zest to 1/3 cup and it was perfect. I also cooked it about three times as long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DONNA STAMPS-FREEMAN"
},
"reviewBody": "Made this last year and it was a huge hit. I made extra, jarred it and gave it to different family members. Let's just say, my aunt didn't want to share. Only change, 1/3 orange zest, instead of 2/3's! Best Recipe Ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SeulementMoi"
},
"reviewBody": "This is delicious, much better than plain cranberry sauce. Make sure to grate the zest very finely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "American"
},
"reviewBody": "So delicious!! I added more brandy. Used raw sugar instead. Love this one. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vegan4ever"
},
"reviewBody": "This recipe is great but I use wine instead of brandy to save myself the trip to the liquor store and honestly I'd rather use my favorite winery's wine instead of random brandy. That said, there are some really funny comments on here and they are way off base. First, if you use 2/3rds orange it isn't too orangy (I'm not a fan of using too much orange personally and the first time I tried it I didn't use much and it tasted awful). Secondly, 8 oranges? Really? Wasteful. Use one navel orange or if you can even manage to locate it two small to medium organic oranges but Key West struggles on this aspect. Publix gets tangerines by the buckets but not organic oranges. So I just washed my one big navel orange really well and rinsed it well and yes, I used a potato peeler because it doesn't matter that I'm engaged to be married. I am OCD but the white part won't leave the water that bitter. You are only using 1/3rd of the water, not all of it, and the rind, the smaller it is, the more is likely to get into your pot. I just peeled in big chunks. That said this go around it came out spanktacular and I wish my family was down here to enjoy it because it is like candy it is that good. \n\nA few tips: sift through your cranberries. a quarter of my bag of cranberries were *bad* and I just bought them fresh yesterday and it was one of the more fresh bags in the store. Literally bringing back the bad ones. Don't move to Key West. lol. Oh, thanks to OP for a lovely recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3psinmypod"
},
"reviewBody": "Amazing! I have never really enjoyed cranberry sauce. I am embarassed to say I liked jellied cranberries. Not after tasting this phenomenal recipe. Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Cluney"
},
"reviewBody": "This recipe is awesome, and I've been making it for several years. It has an incredible flavor and the brandy kicks it up a notch! I usually do half the zest and the sugar, and it is still plenty zesty and sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINDYW1"
},
"reviewBody": "The best cranberry sauce I've ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phil"
},
"reviewBody": "There are many Cranberry Sauce recipes. This is one of the best and will be on my table every Thanksgiving and Christmas holiday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Katya"
},
"reviewBody": "What a perfect compliment to a Thanksgiving dinner! Didn't have any brandy, though, but was still wonderful and had people fighting over the leftovers, and who got to take it home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brook"
},
"reviewBody": "This cranberry sauce is so good. My sugar boiled over so I didn't get to simmer it for three minutes, but it didn't seem to matter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This is really good! Just be absolutely sure you don't use the pith! (the white part). I did use about half the amount of zest as others recommended, and I also added a stick of cinnamon to step two and removed it at the end. Oh, and DON'T THROW AWAY THE ORANGE WATER that you worked so hard to make!! Substitute it for water in whatever recipe might taste better with a hint of orange, or add an equal amount of sugar to it, heat to dissolve and you have a wonderful orange simple syrup. You can use it to make recipes, or even mix with your leftover brandy to make some really good cocktails (I added mine to our batch of sangria we make every year and it came out extra delicious :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveYankee46"
},
"reviewBody": "Easy and delicious. I added a little cinnamon. I was a little confused by the directions about reserving the zest and it really didn't say when to add it, I guess it was suppose to go with the reserved water. Didn't have brandy so use orange liquor. Came out fantantic. I picked this recipe because my daughter's name is Claudia also and I figured it had to be good. Thanks, already in my recipe book."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "intoJesus"
},
"reviewBody": "I left out the brandy, but it was still awesome. For someone who doesn't like Cranberry sauce I really liked it. Made it for Thanksgiving and we had no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Lynn Archer"
},
"reviewBody": "The person that said you can't go back to store bought was absolutely right!!! This was simple, delicious, quick, I can't say enough. I tried it on Thanksgiving and ended up making several jars and giving them as Christmas gifts. PERFECT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachie"
},
"reviewBody": "OMG. this was so easy and so very delicious. Every one who tasted it, loved it. will definitely be making this many times. my new fav cranberry sauce. I didnt use as much zest, only 1/3 cup was plenty for my taste. all else fit well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori VE"
},
"reviewBody": "This was fantastic! The Brandy and orange zest added a wonderful kick...the flavor did improve/mellow after refrigerating for a day or two. It was a hit at our Thanksgiving Table. We will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "This was very good and we all enjoyed it with our Thanksgiving dinner. I followed the advise of others and made it two days ahead. Good recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ManSoRare"
},
"reviewBody": "I changed mine - added chopped fresh pineapple and chopped fresh ginger. Instead of all the orange zest I used a grater on the skin of just one orange, used orange juice for all the liquid, and added one tablespoon orange marmalade. I also used half white and half brown sugar. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lprev"
},
"reviewBody": "i put less zest in it but it turned out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UWF Girl"
},
"reviewBody": "Oh my goodness!! I Just made this for Thanksgiving and it is the eve before. Just out of the pot, it fabulous. Full of flavor, I can only imagine what a day of sitting will do to the flavors. I used 4 medium naval oranges for the zest and then hand squeezed the juice of all the oranges. I alos used apricot flavored brandy..that is all I had for brandy. Just Amaziing! Thanks for a super easy recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "downeaster"
},
"reviewBody": "I used 1/3 c dried orange zest and 1/3 fresh grated orange zest with 3 12 oz. bags of large Maine cranberries. The sauce is fantastic after only one day and its still two days until Thanksgiving! Unbelievably tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SABORICUA"
},
"reviewBody": "Best I have ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dottie"
},
"reviewBody": "This has become a holiday staple. I did not have orange juice so I used the rest of the orange after I used the peel for orang zest, and put the rest of orange/s in the blender to make 2/3 cup instead of the juice. It came out fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katiekakes"
},
"reviewBody": "I am still eating this long after the turkey leftovers are gone. I put it on my bagel this morning, and I think I will make cheesecake tonight and use the cranberry sauce as a topper for that! Definitely a recipe that should be used for more than just Thanksgiving. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "InfamousQBert"
},
"reviewBody": "this is the sauce that we're REQUIRED to bring every year now. :) like most of the reviewers, we use about half the zest required, just because it takes so dang long to get that much! also, it takes us about 30-40 minutes to let all the berries pop, rather than the 10 it calls for. just keep a close eye on it so that it doesn't burn. it's SO good, though! and i just love having a signature dish to bring now. :)\n\nETA: I got a microplane this year and WOW! I did the zest in about 10 minutes and with no injuries! Get one if you love this recipe but hate the zesting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "Five star flavor!! We like our sauce *thick* and this was a little too thin for my taste. Next time all I will do is cut back on the water a little bit...but it will be back!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maliforte"
},
"reviewBody": "I have been making this for several years and it is wonderful! Be sure to take the time to use fresh orange zest and not dried orange peal - much better! I make this and can it so that we can have great sauce throughout the year. WONDERFUL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Ligertwood"
},
"reviewBody": "Absolutely fabulous!! Best cranberry sauce I've ever had. Must be the brandy !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StacieGo"
},
"reviewBody": "This is the best cranberry sauce I've ever had! The flavor and texture are amazing and compliment turkey and stuffing perfectly. I will never serve the stuff out of the can again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "Boyfriend said this was really good, but only ate one portion. The rest went to waste because I'm not a cranberry fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DELTAQUEEN50"
},
"reviewBody": "I found this to be a very good cranberry sauce, the orange flavor worked well with the cranberry and the brandy was an excellent finish. Used this at Christmas and everyone who tried it, complimented me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RLBCooker"
},
"reviewBody": "My husband wanted homemade Cranberry sauce instead of the canned kind. I don't like cranberry sauce, but after trying this, it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BYRDYGIRL"
},
"reviewBody": "I actually didn't care for this. It was way too sweet for me and I ended up tossing it out. No one else ate much of it either. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nikoski"
},
"reviewBody": "A great cranberry sauce! A bit time consuming getting the zest of 8 oranges (I did a double batch and only did 6 oranges) but well worth the effort. Also used the juice from zested oranges. Has a great orange taste and the brandy really brings it all together. I make a new cranberry dish every year but might have to keep with this one...it got lots of compliments!\nNew comments (one batch recipe): this year we didn't have any orange juice on hand so I used only 1 cup of the orange water. Also used 1 cup white sugar and 1 cup brown sugar. The bag of fresh cranberries was about 4 cups and it boiled into a nice consistancy in about 15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "Absolutely the best cranberry sauce you will ever taste. Perfectly sweet &amp; perfectly tart - it doesn't get better than this! 2 tablespoons of brandy does the trick! No disappointment here. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karickson"
},
"reviewBody": "I am not a \"big fan\" of cranberry sauce but my husband requested cranberry sauce for this years thanksgiving. I browsed the net trying to find an appealing recipe and was interested by all of the positive feedback. I made the sauce tonight as a 'trial' and will be making it again for our first thanksgiving dinner with the family (where I have to cook!) \nThis recipe has a very sweet but tart taste and the brandy brings out many pleasant flavors. Great recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Griscom"
},
"reviewBody": "This is the best! I like to try different cranberry sauce recipes, but stopped with this one. I did cut the sugar a bit, but all the zest is what makes it special. My MIL requests this for every holiday dinner since the first time she tasted it. Even all the kids like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "This is a great cranberry sauce. I don't use grated zest. Instead I use a vegetable peeler to slice some of the orange peel into long strips. After boiling in step 1, I cut/chop some of the orange peel into small pieces. I discard the extra peel. I don't measure my cranberries. I just use 1 whole bag of fresh cranberries. In step 3, I boil for a lot longer (15 mins??). I like my cranberry sauce to be very thick. I usually use an orange flavored brandy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neenorasbest"
},
"reviewBody": "Christmas dinner was the first time making this recipe what a wonder suprise, delicious. I added walnuts to recipe, yum. today is Jan.1,2008 and made with new year dinner to go with ham... everything! thank you for a recipe I will use forever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaskabetty"
},
"reviewBody": "I've made this recipe for the past few Thanksgivings and I really like the flavor. I like my sauce slightly more jelled than the 10 minute cooking time allows, so I begin checking with spoonfuls on a cold plate at 10 minutes and cook until thicker. This year I cooked it closer to 20 minutes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mdunzy"
},
"reviewBody": "flavors are good together but it is too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrankiAndPaul"
},
"reviewBody": "We found this recipe one Thanksgiving while looking for home made cranberry recipes. THIS recipe is the reason I joined allrecipes.com!!! All I can say is that I don't think I can ever go back to the canned stuff again. My husband either! I made it for him last year and he went back for seconds after years of the canned stuff. The orange zest is a bit much. We use only a tablespoon or two at most. We cut the orange juice in half as well so that the taste is not to tangy and the cranberry taste can come through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINTHEA"
},
"reviewBody": "I substituted 2-3 tsp of bottle dry orange peel instead of the orange zest. It was such a hit at the Thanksgiving table - there was nothing left. Now, that's something!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Scalice"
},
"reviewBody": "My sister and I whipped this recipe up the night before Thanksgiving and it was a winner. My taste rating is a 4 star because I thought it was just a little off, but everyone liked it so well...that I couldn't bring myself to give it a lower rating. We did have to zest the orange using a grater as I could not find my zester. Anyway, you won't miss with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Momboss Cooks"
},
"reviewBody": "This was good, but I didn't get the method of cooking the zest in 2 cups of water and then draining it to a 1/3 of a cup. Next time, I would just use less water. I also used about 1/2 the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "*NurseHatchet*"
},
"reviewBody": "Nice flavor but I like cranberry sauce with more of a orange-y flavor. I'll definitely make this again, I'll just try and add more zest to make it more to my liking. Everyone else that ate it loved it--even my kids who are 3 &amp; 4 years old!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RTrotter"
},
"reviewBody": "I have made this recipe for four years straight... my family loves it and now is requesting it for every thanksgiving! I normally add a little more brandy or a little Jack... to kick it up a knotch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "girl4chvy"
},
"reviewBody": "this is one of the best homemade cranberry sauces i have yet to taste. as i grew up my grandmother and mother always had the canned one which was good. but i made this for the first time 2 years ago and will never go back to canned again. every Thanksgiving my family requests this sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for the first time to use at our Christmas in July festivities and it was a runaway best seller!!! I was not able to get fresh or frozen berries here in Queensland Australia so substituted with 2 cans of drained berries. I also reduced the orange zest to 1/3 cup and the sugar to 1 cup. The end result was more like a jelly but I wanted it thick so I boiled it longer than the recipe suggested. The extra sugar present in the canned berries would have contributed to the jelly setting. It had a great flavour and fantastic consistency and everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy at Home"
},
"reviewBody": "I've made this recipe a few times now and it always gets rave reviews from my guests. A definate keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "I served this at Thanksgiving. Everyone LOVED it and it was easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUDYMURDOCH"
},
"reviewBody": "We love this recipe - it has become the family favourite at all the \"turkey\" holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Ann Freeman Baskin"
},
"reviewBody": "The only change I made was reducing the orange zest to 1/3 cup. It required 4 oranges to get this amt. This was an \"AWESOME\" recipe. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trisha Brummer"
},
"reviewBody": "Tip: I boil the you know what out of this stuff. That 10 minutes is not accuracte. I have made this every year for probably 5 years. The accurate boiling time is between 30 and 40 minutes, stirring constantly. The longer you boil it, the more it gels. We like our cranberry sauce very jellied. It makes it a bit labor intensive, but well worth it. Oh - and I am not a fan of orange zest so I exclude it and it is not problem; also, I have forgotten to add the brandy once or twice and it was still awesome (if you are concerned about using alcohol)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "paniece"
},
"reviewBody": "This recipe is okay but not half as good as my Cranberry Relish. I will not make this again. I will Just stick with my recipe that I sell each year at christmas bazaar's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CINCNAN"
},
"reviewBody": "this recipe was very time consuming (2/3 cup orange zest is a LOT!) I have made different versions of orange-cranberry relish before, but did not enjoy this recipe with the brandy and lemon juice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ADOYLE18"
},
"reviewBody": "Have made this several times and it's always a huge hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMKANZAKI"
},
"reviewBody": "I've made this 2 years in a row for the holidays and my family wants leftovers to take home every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SARAHMAY"
},
"reviewBody": "This is my favorite recipe for cranberry sauce now. I've made it for the last 2 years and everyone loves it. I do use less sugar than what is called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lax Mama"
},
"reviewBody": "I will never again use store bought cranberry sauce. This was excellent! I made it Christmas Eve and it was perfectly \"jellied\" on christmas morning. Wonderful alternative to the regular cranberry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MADCOOKS"
},
"reviewBody": "I liked this cranberry sauce, but my husband didn't like all the orange in it. Next time I will add a lot less orange juice and rind"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juling Chao"
},
"reviewBody": "Love this recipe. The orange zest gives it an extra kick. I've substituted rum for brandy when I've run out and it tastes great also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GUYCHEF"
},
"reviewBody": "This turned out excellent. I made it the day before and chilled it for 24 hours before serving. It allowed it to set up very good. The next time I make this, I will definitely cut the sugar in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tkroe"
},
"reviewBody": "I used half the sugar and it was still fantastic. A big hit at Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I feel this recipe is not worth the extra work. A very similar result can be achieved from a basic cranberry recipe with sugar, water and cranberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARAH"
},
"reviewBody": "If I could give this six stars I would! It was soo good and made the best leftover turkey sandwhiches ever! I remembered to cut down on the orange zest after I was already boiling all of it! So my liquid was full force buy I pulled out the solid zest and added that to the Cranberry Orange Loaf recipe I made which people had suggested more zest for. Both turned out great and created a nice balance for no waste! I alsu used some of the left over cranberry sauce (I made a double batch) for the Cranberry Pork Roast in a crockpot. Wow!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19140/brandied-orange-and-cranberry-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1260/side-dish/sauces-and-condiments/sauces/cranberry-sauce/",
"name": "Cranberry Sauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19140/brandied-orange-and-cranberry-sauce/",
"name": "Brandied Orange and Cranberry Sauce"
}
}
]
}
}
, "about": [
]
}
]