				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Brazilian Passion Fruit Mousse (Maracuja)"
,"datePublished": "2020-06-18T23:08:47.000-04:00"
,"dateModified": "2022-12-08T21:22:15.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Valeriekooka"
,"url": "https://www.allrecipes.com/cook/594492"
}
]
,"description": "This is Brazilian favorite (and an old family recipe), and takes no cooking at all. It&#39;s a little tart and tangy for those of you who don&#39;t like your desserts to be too sweet."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YWO6rOhfhbq5LtZrt3Ukv7JLPtY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/47436-brazilian-passion-fruit-mousse-maracuja-DDMFS-4x3-1-260f5b65cf144367a92476019d5e4594.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Brazilian Passion Fruit Mousse (Maracuja)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "41"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "515 kcal"
,"carbohydrateContent": "45 g"
,"cholesterolContent": "131 mg"
,"fiberContent": "3 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "22 g"
,"sodiumContent": "120 mg"
,"sugarContent": "41 g"
,"fatContent": "35 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"8 passion fruits",
"1 tablespoon white sugar",
"1 (14 ounce) can sweetened condensed milk",
"2 cups cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Break passion fruits in half, and empty contents into a bowl. Use a little water to help rinse the juice out of the skins. Mix with hands to soften pulp. Strain through a sieve or cheesecloth. Stir in sugar and sweetened condensed milk."
} ,{
"@type": "HowToStep"
,"text": "In a chilled bowl, beat cream until stiff peaks form. Fold 1/3 of the cream into the passion fruit mixture, then quickly fold in remaining cream until no streaks remain. Refrigerate for 1 hour."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Manu Em"
},
"reviewBody": "Mine was very very runny. I made it from passion fruit pulp and this was a disaster it wasn’t like a mousse at all. Then again everything I make turns into a complete disaster"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marc Laurent"
},
"reviewBody": "Too sweet. Other recipe on AR that work better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "Super easy. I skipped both the straining and adding sugar. No need for either. Also - not sure what size passion fruits to use. I had 7 small ones that worked really well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SushiLvr"
},
"reviewBody": "Super easy to make and didn't take long at all. Added a drizzle of passion fruit on top. Next time would like to add a dollop of fresh whipped cream and a mint leaf. My boyfriend gave it 5 stars and asked for seconds before finishing the first one, lol. I would serve a smaller portion if making this as a desert for company. It is very rich and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "songbird"
},
"reviewBody": "Very good! I left out the sugar as other reviewers suggested and didn't miss it. Remember to chill the bowl and the beaters before making the whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DJnLA"
},
"reviewBody": "This mousse is out of this world delicious. I followed the recipe exactly and it set up and turned out beautifully. We even used dollops of the mousse to garnish slices of guava cheesecake that I had baked. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hollie"
},
"reviewBody": "A little piece of heaven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SG"
},
"reviewBody": "Great recipe, especially when you don't have much time for prep. The tips helped. In order to give it some texture, I sprinkled roasted almond flakes and tender mint leaves. The best part is that passion fruit and lime takes away the distinct flavour of condensed milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "romo"
},
"reviewBody": "Something to note is that brazilian passionfruit are giant yellow and so bitter you can´t eat them fresh (well I can´t) so if you use a purple passionfruit it´s probably double the amount and leave the sugar out and maybe add some lemon juice. I made this as per the recipe with Brazilian Maracuya since I live in South America. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naturalbornhealer"
},
"reviewBody": "This is a great recipe, I have made it twice so far and it turned out great every time. Since passion fruits vary greatly in size, the asked-for amount of 8 passion fruits is very non-specific. After reading through the comments, I altered the recipe slightly. I used a little over 1 cup of passion fruit pulp (no seeds), added one can of condensed sweetened milk and and about 1 1/2 cups of whipping cream. I dissolved 1 pack of gelatin in part of the juice before I added it to the cream mixture. I also omitted the sugar, the condensed milk added enough sweetness and I think the tartness is what gives passionfruit its zing, so I didn't want to tone that down too much. I mixed it all up, put it all in my Kitchenaid with the whisk attachment, and beat it for a good 3 minutes until it was foamy. Then I chilled it overnight. The result was a light, sweet and tart heavenly mousse. This has become my favorite passion fruit recipe, and both times I made it, it was gone within a day - even my picky son eats it. Next time, I may serve it with a fresh raspberry sauce or as a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anamosity"
},
"reviewBody": "I made this with one of those lemon shaped lemon juices. it was the only variance in the recipe. I did follow one review that called for it to sit for a bit. Mine sat overnight and was light and sweet- tangy. I used it to fill puff pastry cups garnished with blackberries. I came out ver y well. You do notice the condensed milk flavor but I didn't bother me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "Adding 1 Teaspoon of gelatine mixed with 1 Tablespoon Hot Water, dissolve well then mix through the whipped mixture will make it set more like a mousse consistency. not bad though, can use any pulped fruit., doesn't need the Tablespoon of Sugar, loads with the Condensed Milk., and adding in Lemon/Lime Juice, will set it everytime, as per a cheesecake\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FarleyS"
},
"reviewBody": "This is a wonderful recipe! I enjoyed Maracuja mousse when we lived in Angola, Africa and now I'm enjoying it in Colombia, South America. There aren't many recipes out there in English, but this is my favorite version (no gelatin). You might want to make a Maracuja syrup to go on top. Just dissolve a cup of sugar in a cup of water in a pot on the stove. When the sugar is dissolved, add the pulp of one maracuja and boil until it reaches a syrup consistency. Spoon a thin layer of this syrup over the mousse (seeds and all) and let cool in the refrigerator. Yum-Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chezie"
},
"reviewBody": "Fantastic. We all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Oliver Jackson"
},
"reviewBody": "Oliver Jackson (Portucale's Restaurant Chef)\n\nI got it!!!\n\nSo nice, very good flavor...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "Unfortunately, we didn`t like this dessert so much. Maybe I wait more from a dessert, but this dessert was very simple for us. Maybe it were my fruits, but the mousse was lack of fruit flavor. I realized that the next day it was completely tasteless. I halved the recipe and used a little less sweetened condensed milk and cream and mine turned out almost like a mousse."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "drspear"
},
"reviewBody": "I tried two recipes, and this was one of them. It tasted good, but it didn't set up. It was just creamy. I tried it again, adding gelatin, and it didn't set up then, either. My friend told me that there isn't enough acid in the passion fruit to help it set, so I modified this recipe and it turned out GREAT! \r\n\r\nWhat I did was I added 1 can sweetened condensed milk to a blender . After straining 7-8 passion fruits through a sieve (I also added a tiny bit of water)(reserving the seeds for a topping), I put the passion fruit juice in the empty condensed milk can, and then added the juice of a lime (or lemon), until the can was a little over 1/2 full, and threw that in the blender. I also added heavy cream. It set up immediately, and it tasted great. I put the mousse in a bowl, and added the seeds to the top. I couldn't taste the lime at all. We ate half the bowl before it was chilled, but it definitely tasted better chilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bohna"
},
"reviewBody": "loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faeriegal"
},
"reviewBody": "Wow! This was amazing! Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly Nwankwo"
},
"reviewBody": "it was ok. quite sweet, even without the added sugar. i'd never tasted Maracuja before. Good way to use up the passion fruit from our garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aja"
},
"reviewBody": "OH SOOO YUMMY! I served this after an Asian inspired meal and it was a slice of tropical heaven! I served it with caramelized bananas and a freshly baked madeleine. I used 6 passion fruits and processed them in my food processor after straining, I added the juice of 1 meyer lemon to make sure there was enough juice. It was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fishoutofwater"
},
"reviewBody": "I also made this recipe for someone from Brazil, they said it was just right. I left out the sugar and for a double batch, I used one 14 oz package of Goya brand Passion Fruit pulp. I scooped it onto poundcake, everyone loved it. Goya makes many other fruit pulps, so you can bet I'll be experimenting with this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Okie Steve"
},
"reviewBody": "This is a wonderful recipe and so easy to make. For people in the US who may have trouble finding (or affording) fresh passion fruit, a good alternative can be found in Latin markets. The Goya brand makes frozen tropical fruit pulps that are 100% fruit. They come in 14 oz. bags - enough to make 2 batches of this recipe. I break the frozen pulp in half and put the extra half in a Ziploc bag to keep frozen for another day. The people who are reporting problems with texture are making one of two errors. They are either using juice which is too thin or are not beating the cream to full stiff peak stage. Stiff peak can be difficult to judge because you really need to take the cream to the edge of butter. I like to use this as the base for parfaits, layering the mousse with fresh chunks of mango and fresh raspberries (don't use frozen as they will seep water resulting in a soggy product). Goya makes the same frozen fruit pulps in a number of fruits and I have tried this recipe with their guava and mango pulps as well and both yielded wonderful results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "calimari77"
},
"reviewBody": "Yummy! I halved the recipe (only had 4 fresh passion fruits) and added about 2/3 packet of unflavored gelatin. Much nicer consistency and feels slightly lighter. I also beat it a bit more to blend better since the consistency was less creamy. A definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "316"
},
"reviewBody": "Passion fruit mousse is a favorite of mine here in Rio.\nI also find the creamy texture (which Brazilians love) to be a little sloppy. I use six passion fruit - I find blending the pulp and seeds in a baby mixer, then sieving the bits out leaves to a niced texture, but that's just me.\nBlend the juice with equal amounts of condensed milk to heavy cream. An electric hand mixer seems to get a good consistency. I also add a third to one half of a packet of gelatine, just to make it set that little bit firmer.\nIt does not need any sugar as passion fruit are sweet enough usually.\nGood luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda B."
},
"reviewBody": "This was slightly addictive. I made this using one can of frozen Old Orchard 100% Juice Apple passion mango juice and omitted the sugar. It was really sweet. Next time, I might double the cream to offset the sweetness. I refridgerated for about 5 hours and it was almost set. I recommend overnight as the others did. Brough to my latin night supper club and everyone loved it. I did use it as \"topping\" for the Grenadian Spice Cake. Would totally make again experimenting with different frozen juices. Would love to try it as an ice cream. So Easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SILVERMOONDRAGON"
},
"reviewBody": "I've made this twice now, and had rave reviews both times. The first time I used one can of passionfruit pulp in syrup, because we can't get frozen juice here, and passionfruits are too expensive. I also cut out the sugar. Mine set overnight, you also have to be very careful when folding in the passionfruit mixture not to knock the air out of your cream.\n\nThe second time I made it, I used two cans of passionfruit, and kept the sugar, and instead of setting in the fridge overnight, used my ice cream machine to make the most awesome icecream anyone in my house has tasted. Next time I make it I will go back to one can, but this is a keeper for my family. Nice mousse, brilliant ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DaraFG"
},
"reviewBody": "Wow, easy and delicious. I also used frozen passionfruit juice and followed the reviewers advice to refrigerate overnight. Mine set without a problem. Perfect make ahead dessert for a tropical themed dinner party. Beware, though--it's rich! Edited to add that it freezes surprisingly well, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeborahYael"
},
"reviewBody": "This is a great recipe and I've already made it 3 times. Three notes: one, condensed milk is already so sweet, I don't add sugar. second, in order for it to have a mousse consistency, it's best to let it sit in the refrigerator overnight (if it doesn't refrigerate long enough, it will taste yummy but won't have the right consistency). The last note is that once I didn't have enough passion fruit juice, I added lemon juice - it turned out really great! Since (as I've mentioned) condensed milk is so sweet, I'd imagine you can substitute the passion fruit with citrus/acid fruits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "Awesome! tart and creamy. i am always looking for something to do with passion fruit i gather. i agree, it didnt set, but it was still the favorite dessert for everyone at the potluck dinner party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "This recipe is wonderful! I used a can of frozen passion fruit juice instead of fresh and it was still fabulous. This recipe is a keeper. UPDATED VARIATION: I have tried this with limeade concentrate and it is great! I pour it into two graham cracker pie shells and let it sit for three hours to overnight before serving. It makes a light, tart summer treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "APOGGI"
},
"reviewBody": "This is an amazing recipe -- easy, exotic, flavorful, delicious. I was looking for something to do with the fruit from my passionfruit vine, and this is it. It's a simple yet impressive dessert to serve your dinner guests. It would also be a great ending to a romantic meal for two. If you're not familiar with the flavor of passion fruit, definitely try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hot Chilli"
},
"reviewBody": "This was nothing like a mousse. It ended up being a cream consistancy which didn't set at all. The taste however was beautiful. It would probably work better as a side dish ie. to serve on the side with fresh fruit or with a sponge cake. Passionfruit Cream would be a more appropriate name!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/47436/brazilian-passion-fruit-mousse-maracuja/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
"name": "South American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1278/world-cuisine/latin-american/south-american/brazilian/",
"name": "Brazilian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/47436/brazilian-passion-fruit-mousse-maracuja/",
"name": "Brazilian Passion Fruit Mousse (Maracuja)"
}
}
]
}
}
, "about": [
]
}
]