				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Brazilian Cheese Bread (Pao de Queijo)"
,"datePublished": "2019-04-03T23:34:38.000-04:00"
,"dateModified": "2023-01-13T12:47:50.516-05:00"
,"author": [
{"@type": "Person"
,"name": "GLOJAO"
,"url": "https://www.allrecipes.com/cook/1140057"
}
]
,"description": "Pao de queijo are yummy, fragrant, and easy to make. These cheese-flavored breads use tapioca flour instead of wheat flour, so they&#39;re gluten free."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/t1_kc78zVgR-59-2lpPrSEXAWuE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8796530-brazilian-cheese-bread-pao-de-queijo-Faith-Ang-4x3-1-2000-a00a691330fd450683950ec993b9a791.jpg",
"height": 1124,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6318615659112",
"description": "",
"duration": "PT45S",
"name": "How to Make Brazilian Cheese Bread",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/8a2811d7-5231-4fdb-a422-58b38a82e4d8/5d4f0014-527b-4e5c-b66a-39adcb9e9906/1280x720/match/image.jpg",
"uploadDate": "2023-01-14T16:52:36.552-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Brazilian Cheese Bread (Pao de Queijo)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "347"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "385 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "71 mg"
,"proteinContent": "6 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "555 mg"
,"sugarContent": "1 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.5 cup olive oil or butter",
"0.33333334326744 cup water",
"0.33333334326744 cup milk or soy milk",
"1 teaspoon salt",
"2 cups tapioca flour",
"2 teaspoons minced garlic",
"0.66666668653488 cup freshly grated Parmesan cheese",
"2 beaten eggs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine olive oil, water, milk, and salt in a large saucepan and place over high heat. Bring to a boil and immediately remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Stir in tapioca flour and garlic, stirring until smooth. Set aside to rest for 10 to 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir cheese and eggs into tapioca mixture until combined; the dough will be chunky, like cottage cheese."
} ,{
"@type": "HowToStep"
,"text": "Drop dough by 1/4 cup-size balls onto an ungreased baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the tops are lightly browned, 15 to 20 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Loveless Pratley"
},
"reviewBody": "This was a hit! I didn't realize how easy Pao de Queijo would be to make. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just add a lil more flour then perfect! -17yr old male"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe, trust me. I’ve tried maaaany. The cheese bread is soft on the inside and it gets a crunchy cheesy crust. I baked a few minutes under, so I can freeze it and pop in the air fryer for 5min breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used butter, liquidified powdered milk, and baked in a donut pan, covering the holes over, so the bottoms had an indentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lane"
},
"reviewBody": "Recipe was super easy and turned out perfect. I used butter, 1/2 cup of parmesan, 1/4 cup sharp cheddar, and substituted 1 tablespoon of garlic powder for the fresh. I would suggest splitting the quantity to one dozen instead of 6. Just a note, the grass does not rise during baking. Husband is from Amazon state and swears these are delicious with coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vsapir"
},
"reviewBody": "I made this exactly as stated in the recipe (used butter option and no garlic) and it was delicious. I read some negative reviews and I think it’s important to note that this is not your typical Cheese Bread. The inside is heavy and thick (almost seems raw), not bread-like at all. That, however, is the way Pao de Queijo is supposed to be. If you’ve had these before, you’ll love this recipe. If not, you might be confused :) Overall, super easy to make and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tampabeachpuppy"
},
"reviewBody": "Used this recipe to make popovers. Used wheat flour with tapioca starch, required a little more water for right consistency. Turned out quiet well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rolande"
},
"reviewBody": "These are dangerous if you are watching carbs. Delicious and addictive. One bite and they’re gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esra70"
},
"reviewBody": "I made it but my bread came as flat bread.. everything was going perfect until I add the eggs and it turned too liquid then I added more flour to correct it. Next time I will add eggs one by one and if one egg gives required consistency I will keep that way. Thinking to add little bit feta cheese too. But even it came out as flat bread I loved it. Great and tasty bread for the people who have gulutine problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JamieRae Hendricks"
},
"reviewBody": "They turned out pancake flat. Not sure what I did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson Bevan"
},
"reviewBody": "This is an excellent recipe. I made several modifications to it. I used 1/4 cup of butter rather than 1/2 (butter provides better flavor than olive oil) I also used 1 &amp; 3/4 cups tapioca flour to compensate for the lost butter. (You can add more milk if the dough is too dry) the recipe did not specifically mention it but you need to really mix this dough. I also replaced the cloves of garlic with 1 t. Of garlic powder as I did not want garlic powder lumps in the bread. I mixed the tapioca flour mixture the entire time that it cooled (10 minutes). Then I mixed the egg and cheese in until I could not see any lumps. I did not put any cooking spray on my silpat mat. (I would not put any on parchment paper either) I then cooked it at 400 degrees F. Until the tops were browned. They were gone within minutes! The garlic was not traditional but enjoyable! Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kalim Milak"
},
"reviewBody": "This was a great recipe I read through the reviews and used 200g of cheese and used butter not oil and it was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tai"
},
"reviewBody": "CRITICAL STEP OR YOU'LL END UP WITH CHEESE SOUP! Add liquid to flour just after it has boiled, and it's still super hot. \n\nI've made this recipe several times, and just made it with a liquid mixture that wasn't boiling hot and it came out very very liquidy. First time it failed for me.\n\nAlso, I use 1/3 cup butter, 1/2 cup water, no garlic, and 1 cup parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Goberna"
},
"reviewBody": "It's a wonderful recipe. I cook it many times 'CHIPA'.\nI am from Spain living in Argentina, but Chipa, not 'PAO DE QUEIJO', is the most popular recipe from PARAGUAY, not Brazil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina Hoefling"
},
"reviewBody": "Several times, have tried a few recipes for Brazilian cheese bread. This is the best so far. I've made 3x already. Served them, both people stopped talking and audibly \"yummed\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brock Robert"
},
"reviewBody": "These naturally gluten free buns take me back to Brazil - I tried making them as directed by heating the ingredients and also by simply mixing them in a blender. They turned out great both ways"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Ang"
},
"reviewBody": "Use more parmesan and add some mozzarella. It was very oily so I could have possibly cut down the amount of oil too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "J San"
},
"reviewBody": "This recipe ends up making a very sticky dough, very hard to handle even with oiled hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessie"
},
"reviewBody": "I had this at a Brazillian Steak House last year, and with COVID I have not been back since. I was delighted to find this recipe, but the bread did not turn out anything like the pictures. The ingredients were ultra watery, like thin pancake batter. They came out of the oven like slightly raised pancakes. Other than kneading the dough a little to better blend the ingredients, and forgetting the garlic, I followed the recipe exactly. Never seeing this made before, I'm sure I missed a few crucial steps but they were not indicated in the recipe. I also live in a high elevation area, so I wonder if that contributed somehow. Also, even after cooking minutes past the described cooking time, they never did lightly brown as in the pictures but were ultra hard on the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mackenzie Parsons"
},
"reviewBody": "Worked perfectly, AND made my house smell mouth-watering!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mar4whistler"
},
"reviewBody": "I wonder if the ingredient list is wrong....I used the 1/2 cup olive oil as directed, and they were so greasy, they were basically inedible. This is the first issue I have ever had with a recipe from Allrecipes. \nCould someone please check the ingredients ie the amount of olive oil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tauri VanDoorn"
},
"reviewBody": "They didn't cook right in the center even after nearly doubling the cook time. :( The flavor was nice with 1/2 butter, 1/2 olive oil and double cheese.. I don't know if making the balls flat and smaller might help next time but this try was unfortunately a waste of time and ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrouleau"
},
"reviewBody": "Oh so good, exact same as those I love from a well-known high-end Brazilian steakhouse. I made the following changes, highly recommend to follow these after much research. As many others have said, garlic goes bye bye. Increase the amount of cheese to one full cup and use melted butter instead of olive oil. The biggest changes are the preparation steps, but the good news is it’s even easier and quicker. Pour all ingredients into a blender except the tapioca flour. Blend well then add the flour 1/2 cup at a time and blending with each addition. You’ll now have basically a thick batter. Pour into greased mini muffin tin, about 1/4-1/8 inch from the rim. Bake at 400 for 15-20 minutes. Best eaten warm, maybe don’t make too much more food, as you might find yourself eating more of these than you anticipated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csco"
},
"reviewBody": "We’ve now been making this recipe for years and it’s our son’s favourite food. We add a small amount more garlic and sometimes double the cheese. They disappear fast, usually before they cool down. I’ve learned to measure and prepare the ingredients mise en place, then combine for less mess. If you turn on the oven to preheat after combining the flour and liquid mixture, it will reach the proper temperature at close to the same point that you waited for to add the egg and cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ckisok"
},
"reviewBody": "Didn’t add the garlic, was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristina Chen"
},
"reviewBody": "The recipe is perfect! I Just skipped the garlic and switched the cheese to Parmesan. The pao turned out to be exactly what I tried in Churrascaria. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brian Wood"
},
"reviewBody": "I bake a lot and I get this bread at a local Brazilian bakery and I love it. I followed this recipe and what I ended up with is nothing like the rolls I get from the bakery. Other reviews I see here that are good all say they had to alter the recipe. This recipe is inaccurate and makes something I would not even call a roll. Don't waste your time here, go find another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leo Feliciano"
},
"reviewBody": "Great recipe. No modification needed. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marina Ash"
},
"reviewBody": "There is a huge discrepancy in the total carbohydrate count per serving. The breakdown at the end of the recipe says 40g per serving (recipe makes 6 rolls). This seemed like a lot to me based on the ingredients. So I looked up the carb count and did the math and got 17g carbohydrates per serving. Sure enough I looked at some other recipes and they’re all around that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Byrne"
},
"reviewBody": "This was a perfect recipe! Thank you for sharing it. It is super easy and quick to make. I made them up to the point where you shape them and put them on the baking tray. I then refrigerated them until I was ready to make dinner and then baked them right before dinner was served. I will definitely double the recipe next time and freeze half of the unbaked shaped dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cecille Zarra"
},
"reviewBody": "I liked it! Next time, I will skip the garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grace"
},
"reviewBody": "This was my first time making pao de queijo, so I tried to stick to the recipe as much as possible. The differences: I used 1 clove of garlic &amp; mix olive oil with butter as I didn't have enough olive oil on hand. My oven is somehow hotter than standard temperature, so for this recipe I set the temp at 170 &amp; baked for 20mins as the recipe says. The bread came out a little browner than I had imagined but the inside was still a tad under. Perhaps next time 5 mins longer at 160deg. N more parmesan! Oh, I rolled the dough into balls instead of using ice cream scoop. After a few pieces, my palms were extremely oily. Like I had dipped my hands in oil. No exaggeration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "These turned out just like the pao de queijo in Brazil! I took the advice of another reviewer and swapped the quantities of butter and water. I also played around with different flavors and found that replacing the parmesan with cheddar was especially tasty when topped with pickled jalapenos. Definitely recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "männlicheDamme"
},
"reviewBody": "The dough was a bit liquidy and I ended up adding a bit of matzo meal because that's the flour I had on hand - added a unique and yummy crunch to the outer layer. These were yummy but have a little extra tapioca flour on hand if need be, or wait a bit longer for dough to set up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oregoncheryl"
},
"reviewBody": "No changes, used mini muffin tins to make these quick and easy! Great gluten free treat, my husband loves them and my Brazilian friends said they're authentic and tasty! Definitely will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Darlene Kong"
},
"reviewBody": "This did not turn out right, instead of being chewy and (almost gooey) on the inside, it was sandwich bread-like.\n\nI added more tapioca flour after realizing that my first batch could not rise. \n\nI think there’s too much egg (impacting texture)and oil (impacting rise) in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisakay"
},
"reviewBody": "So good!! Thanks for sharing your recipe. After reading some reviews, I used butter, Italian style cheeses, and garlic salt. Before baking, sprinkled with garlic salt and parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MarkP_Beans365"
},
"reviewBody": "I have eaten an irresponsible amount of pão de queijo in my life, from various parts of Brazil, the US and Portugal. This was the first time that I made it from scratch (I have made a ton using Yoki mix). I used butter and omitted the garlic (traditional pão de queijo doesn't have it). The dough was way too wet, with the consistency was like thick pancake batter. I added more tapioca flour, but it only helped a little. The dough should be thick enough so you can actually roll it into balls. I poured it onto the cookie sheet.\n\nThe resulting bread was okay, but not great. The texture was correct, but the shape was like a poofy pita bread. For what it is worth, pão de queijo should not have garlic or any other spices. I think if you use butter, you need to compensate for the extra liquid in the butter (e.g. less milk). Overall it has most of the right ingredients, but the ratios are off.\n\nSuggestions: \nLess liquid\nNo spices\nMore cheese\nUse tablespoon instead of 1/4 cup for scooping the dough\nRoll dough into balls"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cecece"
},
"reviewBody": "Exactly like the real thing! (Didn’t use Garlic)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana Silva"
},
"reviewBody": "I removed 2 tbs less butter and added an extra 1/3 cup of Parmesan cheese. It came out perfect! My fav recipe from now on. Some I added a piece of cheddar cheese in the center and others I added leftover pepperoni. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSADUFFY"
},
"reviewBody": "My Brazilian friends say it tastes authentic, but none of them use the garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Love these! always a big hit. I don't add garlic and I use lactose free milk... like that will help any with all the cheese but it's all good! I also go super heavy on the parmesan. Like really really heavy. You can't go wrong. You also need to get good quality parmesan.. Don't skimp out and get Kraft - trust me, its definitely not the same and won't cook or taste as good. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christine Zoet"
},
"reviewBody": "I’ve never had Brazilian cheese bread before so I didn’t know what to expect. After reading many reviews, I followed the recipe using butter instead of oil, 2% milk, and cheddar cheese instead of Parmesan because I didn’t have any. I did use the garlic because I love garlic. They did come out crispy on the outside and rubbery on the inside like they should. I’m not sure if I will make these again because of the rubbery texture but if I do I will try it with Parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HungryOne"
},
"reviewBody": "First time using tapioca flour and the texture is delicious! I used whatever cheese I have at hand - pepper jack, feta, pecorino Romano and parmigiana reggiano - shredded and mixed it all together and they turned out great. I also increased the amount of cheese to about 1.5cup. Overall the kids loved it! Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Gillette"
},
"reviewBody": "I followed the recipe exactly except for the cheese. I used cheddar cheese. They were amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cassapakis"
},
"reviewBody": "Very easy and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chasya Goutermont"
},
"reviewBody": "My 8 year old made this eighth minimal instruction from me and my kids loved it!! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Agustin Giampaoli"
},
"reviewBody": "I added 2 extra eggs and 2 times the amount of cheese. They came out amazing. I have made many many of this in the past and the garlic was new, amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kyleen"
},
"reviewBody": "These turned out excellent! We go to Fogo de chao once a year on our anniversary and I always fill up on these. I’m thrilled to have found a recipe to make my own. This recipe was quick and easy. I will be making them many more times in the future. I left them in just a little too long thinking they weren’t cooked but they were."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Trout"
},
"reviewBody": "Was great , two things don't over bake it, turn the heat down and cut the time. I also used paper cup winners not a good idea stuck to the cups real good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noemy"
},
"reviewBody": "my husband loved them! will deff make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lulu_Belle"
},
"reviewBody": "I made them and i thought the batter/dough did not come out right, so i kind of sloppily balled up half of the dough/batter and threw out the rest. Came out really GREAT!!! They puffed up just like they were supposed to and of course i regretted having thrown out half the batter/dough mix. I've been making these for the past 3 Saturdays because my son (and I, of course) both love them so much. I omitted the garlic because from youtube videos, no one put garlic in them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "Based on Brazilian restaurant and frozen Brazilian pao from the store, I think these turned out right in the end (skipped garlic, used shredded manchego cheese). But, I don’t see how the 2 cups of tapioca will make a mixture with the 1/2 cup plus 2/3 cup liquid ingredients. Mine made a clumpy dough that could not be mixed (let alone with a whisk). I persevered because the cheese and egg would add more moisture but I still had a fairly dry and not very cohesive dough- not like ricotta at all. Even though I expected “chewy” I think these were a bit dense. I would try again another time and watch the measurements, but I may also look for another recipe, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "Recipe as is tastes great, but the sodium content is\nunacceptable. It's the salt in the cheese,plus the\ntsp of salt you call for. If I make it again, I will \na) find lowest sodum content cheese available, and\nb) eliminate the added salt, ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "Update - we made it again and added about 1/3 cup more cheese and all butter. Well, here’s what happened: the bread puffed up a bit but then deflated almost right away, making the bread very flat. We might make it with half butter and half olive oil next time and maybe a bit less cheese. We may even decide to sprinkle cheese on the bread at the end and finish in the oven. Otherwise taste is very good and we still really love this recipe! \n\nWe have a place here that makes these and they’re amazing, but seem to be quite expensive - which is why we looked up this recipe. Our first try came out pretty good, though we all agreed they were left in a bit too long for our tastes. Also, we would like a bit more cheese. So next time, we will probably cut a few minutes from the max cooking time and add a bit more cheese and maybe even some garlic salt to top it off. This is a wonderful, reliable recipe that we will use for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Hernandez"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DogtownDoc"
},
"reviewBody": "fantastic, on the second batch I used a lined muffin pan...beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oliver pulver"
},
"reviewBody": "yep"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Hinerman"
},
"reviewBody": "Great recipe. More cheese is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lasagna-Yummy"
},
"reviewBody": "I add a 1/2 cup of cheese. 1/3 grated parmesan and the rest with either fresh or shredded mozzarella, depends on my cheese budget. If you can afford it, choose fresh cheese! Also, I only use 1 large egg. I like to cover cookie sheet with aluminum foil and baste it with butter to make it really nonstick, then after I take it out of the oven and baste the little bread balls with butter while it's still hot. LOVE these heavenly breads so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dondi Leigh"
},
"reviewBody": "Absolutely delicious, exactly what I expected, these are amazing and delicious. Will definitely be making again using this recipe. Because the dough is more of a batter and spreads easily, I used an oiled mini muffin sheet to contain the breads. It worked SO well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hunnaG"
},
"reviewBody": "didnt work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pvevil"
},
"reviewBody": "This recipe was incredible. I have no idea if it’s authentic but it’s delicious and super easy. My family couldn’t stop eating them, and almost immediately begged for more. They were cheesy and garlicky and the texture was just perfect. Love!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "Loved them. Easy to follow recipe and they tasted great. A little too dense, but I think that was my fault for working the dough too much. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie McBroom"
},
"reviewBody": "This recipe is so easy and amazing. Take this to any party and you will be a hit. This was the talk of the Superbowl party I brought these too, this is gonna be my new party appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rvsearcy1"
},
"reviewBody": "++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Raef"
},
"reviewBody": "Turned out great. They were very tasty just as directed. Everyone liked them in my house. I'm not sure what I could have done differently to make them smooth and round like the pictures. Maybe I needed to hand roll them instead of scooping and dropping them. Tasty either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "I used all purpose flour instead of tapioca flour, it turned out really good, but a little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "destiny9510"
},
"reviewBody": "I used the ingredient amounts as listed, aside from increasing the cheese by an additional 2/3 cup as stated in a previous review and they turned out great! I have made this several times and prefer using butter instead of oil. Awesome recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Reemsnyder"
},
"reviewBody": "I've been trying to get the perfect recipe for this, and it never comes up just right. This time, it did! I used avocado oil (but I'm sure olive oil would work great) and baked it in my convection oven for 12 minutes. Substituted grated Mexican cheese for 1/2 the parmesan. They look/smell yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Orlando Silva"
},
"reviewBody": "I really like it, i love it. the only thing was really hard to make the round shape mostly for presentation, but the consistency , flavor and quality was super. I also did not include garlic, since its not part of the traditional pao de queijo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This has become a go-to recipe for me. I love making them as a side dish with soup! The only thing I've changed is that I make them smaller - about half the size of the 1/4 cup directions, but that's just a preference thing. I should branch out to try different cheese, but parmesan is just so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa A Eberhardt"
},
"reviewBody": "great recipe, tasted great but did not look the same, will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "#Chaos"
},
"reviewBody": "These came out OK. Not even close to what is served at Fogo, but considerably better than the last attempts (recipe from a different site). Not sure what I can alter to improve the ultimate result. At least they are edible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelbi Marie Pekas"
},
"reviewBody": "When I was a kid, my family hosted Brazilian exchange students for three summers. They taught us how to make a lot of things, but pao de queijo was hands down my favorite. I hadn’t tried any in years since I didn’t have a recipe, but found myself thinking about them and the time we spent in the kitchen together. I stumbled upon this recipe, and decided to make them for Thanksgiving. It’s safe to say they were a huge hit, and my family and I couldn’t stop talking about how nostalgic those amazing cheesy, fluffy buns are. And yes, they are supposed to be “rubbery.” Hands down my new favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DNCountry"
},
"reviewBody": "I increased the water to 1/2 c. and decreased the oil to 1/3 c. Now it is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Allen"
},
"reviewBody": "Taste so good just like the ones in the Brazilian restaurants. Very easy to make, I used 1/4 cup butter and 1/4 cup olive oil to equal the 1/2 cup oil needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie McCaw"
},
"reviewBody": "Thank you so much for this recipe. I'm eating lectin-free so have not had bread in 6 weeks. These were just as good as the ones I've had at Brazilian restaurants here in LA. I'll be making them many times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vesna"
},
"reviewBody": "I will make it again and again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Toball"
},
"reviewBody": "I have made this recipe many times, and it is always phenomenal. Use different cheeses (cheddar, swiss, parmesan), add herbs, even leave the cheese out- they are always good! You can also use this recipe for pizza crust, cinnamon rolls (without the cheese), and if you make the rolls bigger, make great hamburger buns. My favorite is to make them in 1 inch balls , use extra sharp cheddar, and eat while still warm, although once they have cooled, they have an internal texture similar to croissants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best recipe until now!\n\nI made it with the minced garlic and 1 cup grated old amsterdamer cheese. Next time I’ll try to make them a little smaller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajathode"
},
"reviewBody": "Best recipe until now!\n\nI made it with the minced garlic and 1 cup grated old amsterdamer cheese. Next time I’ll try to make them a little smaller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beebu68"
},
"reviewBody": "Simple and easy recipe and turned out great each time. I left out the garlic and used half the amount of butter. I baked them in mini muffin tins for 15 mins and got 36 bite size pieces. Kids loves them so much, especially when the cheese bread are still warm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ocean Sauce"
},
"reviewBody": "Wayyyyyyy too much oil. It overflowed and caught my dorm oven on fire. BAKERS BEWARE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Oros"
},
"reviewBody": "Fabulous! It’s so great to have a recipe that is a gluten-free option for bread. I use 1/2 cup of butter, 2/3 cup of whole milk, and add extra cheese (my go-to is 2/3 cup of parmesan and 2/3 cup pecorino totaling 1 1/3 cup of cheese)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amykat"
},
"reviewBody": "I’ve made these a lot although last night was my first time with this recipe. These were really good although I’ll be making some changes next time based on how I know they should be: 1) oven temp should be higher, 400 degrees not 375 and will still take 15-18 mins to cook (bottoms will be brown when they’re done, not necessarily the tops). 2) they need more salt so add 1/4-1/2 tsp more. 3) they should be smaller, like 1/2 the size this recipe suggests. My only real complaint is that the tops weren’t crispy like they should be but it could be that I didn’t bake them long enough or I have suspicions that using half oil and half butter (instead of all butter) might do the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura M. Haberman"
},
"reviewBody": "I’m not sure if the first part was done correctly. But I’m still going forward. Smells are deliciously awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TexAnne GF"
},
"reviewBody": "Love these rolls, can't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Cox"
},
"reviewBody": "Saved this to make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DawneSN"
},
"reviewBody": "I did not read the directions correctly and let the boiled milk mixture sit for 15 minutes BEFORE adding in the tapioca, and then the cheese (I used half parmesan and half extra sharp cheddar). I ended out with a very liquid batter and so I greased my mini muffin tin and poured in the batter and baked as usual. They came out perfectly!\n\nThe next time I made them I followed the directions. Not only was it more work cuz I had to drop and shape each bread onto a cookie sheet, but they didn't come out nearly as nicely--go figure! I'll do them the next time using the \"mistaken\" method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matt Redmond"
},
"reviewBody": "I followed the recipe precisely and these flattened out like very flat cookies. They taste amazing but are flat. I'm not sure if there is something wrong with the recipe or if maybe I got an off-batch of tapioca flour. I used Bob's Red Mill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "souppotsie"
},
"reviewBody": "Although it wasn't what I was expecting (Chebe boxed mix) it turned out to be really super yummy. You could probably still make small sandwiches with these but as they are noted they really are more like a snack. The boxed mix makes 4 little sandwich buns. I was trying to find a homemade recipe so I don't have to rely on the box I might keep using this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Henry Seiden"
},
"reviewBody": "Personally, I thought there could have been more flavor, so next time I will add more cheese. Additionally, there should be less oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinformygang"
},
"reviewBody": "Made these for the first time, and my family loved the flavor! Already asking me to make more, and I definitely plan to do that!\nI do have a question for anyone who might be able to help -\nI have never cooked with tapioca flour before. I found the texture of my rolls to be pretty chewy, almost a little rubbery - didn't detract from the taste at all, but I'm wondering if that is how they are intended to be, or did I have my proportions of ingredients off? Or not cook long enough?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azilla93"
},
"reviewBody": "It was great!! we fell in love with these at Texas De Brazil and I finally found a good recipe. I followed it to a tee, but I must've done something wrong because they just didnt turn into little balls like that, they baked more flat. BUT they were a huge hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Borges"
},
"reviewBody": "came out really soft and delicious. Made a double batch, left out the garlic. My mistake for not letting the dough sit long enough, so they came out flat. But still delicious. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mnagnew"
},
"reviewBody": "I love Brazilian cheese bread and make it quite often. I keep it very simple by combining all the ingredients in a blender and pour it directly into a mini muffin pan and bake as directed. The results are just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Borges"
},
"reviewBody": "Made a couple of times already and made some adjustments to my flavor. \nAlso after baked, changed to toast (grill) the top with some grated cheese. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Buckner- Nichols"
},
"reviewBody": "So yummy and you can vary the flavor by adding different herbs and leaving out the garlic."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/98554/brazilian-cheese-bread-pao-de-queijo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
"name": "Cheese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/98554/brazilian-cheese-bread-pao-de-queijo/",
"name": "Brazilian Cheese Bread (Pao de Queijo)"
}
}
]
}
}
, "about": [
]
}
]