				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bread Machine Garlic Bread"
,"datePublished": "2000-03-23T08:10:31.000-05:00"
,"dateModified": "2020-06-18T23:00:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Nicole Ellis"
,"url": "https://www.allrecipes.com/cook/35553"
}
]
,"description": "Garlic, along with a little parsley, is baked right into this delicious bread. Slather it with butter or enjoy it plain."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MbQ49i5NdqDIYwyVo-cVUmM2vv0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5058261-d79fba52326a475fb4a942bf3386da80.jpg",
"height": 844,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bread Machine Garlic Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "286"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "142 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "3 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "303 mg"
,"sugarContent": "2 g"
,"fatContent": "2 g"
,"servingSize": "1 - 1 1/2 pound loaf"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup warm water (110 degrees F)",
"1 tablespoon butter",
"1 tablespoon dry milk powder",
"1 tablespoon white sugar",
"1.5 teaspoons salt",
"1.5 tablespoons dried parsley",
"2 teaspoons garlic powder",
"3 cups bread flour",
"2 teaspoons active dry yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Basic Bread cycle; press Start."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT190M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rioflagirl1972"
},
"reviewBody": "i love this bread. i did modify it just a little. i used a little more garlic then suggested i also added some italian seasoning/ instead of milk powder i used 2 tablespoons of milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "I read the reviews on this recipe and decided I do a few things other people did. Instead of butter I went with some good herb infused olive oil, Italian seasoning instead of parsley, 2 tablespoons of Parmesan Cheese, and 3 minced cloves of garlic. Now that's a garlic lover bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kris Kesel"
},
"reviewBody": "I made the recipe as written and found it too dry and crumbly. Will make again with oil in lieu of butter and try previous suggestions of fresh minced garlic versus powdered. I have high hopes but wasn't impressed as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MeWa"
},
"reviewBody": "Didn't rise much (others have also noted this). Dense bread with OK taste. Will try a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cassandra Anderson"
},
"reviewBody": "really disappointed, it was dry, bland (not enough garlic flavor) and it did not rise well. over all i call this one a flop"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snoopy728"
},
"reviewBody": "I made this to go with the jambalaya. I did not add milk powder. It turned out so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "This was a little dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Telley Jones"
},
"reviewBody": "I live in colorado, so bread doesn't cook the same for me. I had to add about 1/4 cup of water because the dough was a little too dry. After this correction I baked the bread in the oven instead of the breadmaker at 350 for about 15 min. Bread was I hit. Will make again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Esperanza Ash"
},
"reviewBody": "I made this tonight as an alternate for the stand by garlic bread. The recipe as written must be flawed somewhere because I followed it a T and and I barely rose, the crust was ridiculously hard and there was hardly any garlic flavor to it. I like the idea, not so much the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMATREKE"
},
"reviewBody": "Big hit!! It was perfect, good consistency, good size &amp; great taste. I did use real garlic but only a few minor adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy"
},
"reviewBody": "This is a great recipe. I just\ntweeked it a little, added honey\ninstead of the sugar, and Rosemary\ninstead of the Parsley, and half of\nthe salt. This bread goes good with\nChili or Spagetti, or even with\nfried eggs. I let it rise and baked\nin a regular loaf pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tova"
},
"reviewBody": "Like most I tweaked recipe to make it my own. I finely diced 3 cloves of garlic and it and olive oil to the water in bread machine. Flour, dried oregano and yeast. Set machine in dough program. I was surprised how sticky it was. No problem though. It fell onto a parchment lined cookie sheet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milkshake Fanatic"
},
"reviewBody": "I loved this bread! I only made a few changes. Our bread machine was missing a part so instead I made it by hand and baked it in the oven at 350 degrees for 35 minutes. Instead of using garlic powder I listened to many other reviews and used three cloves of garlic. I replaced the butter with olive oil. As I wanted this bread to be nondairy I switched the milk powder for a tablespoon of rice milk. This is certainly a must do bread, moist on the inside, crisp on the outside. Next time I will try it half and half with whole wheat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawnby"
},
"reviewBody": "I followed the recipe exactly. I put the machine on light crust. My entire family liked it. I would probably use garlic salt in place of the salt the next I make it; but that is the only change I would make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bigmac"
},
"reviewBody": "This was very good bread. I usually use the dough cycle on my bread machine and finish it off in the oven. Let the machine cook this time and it came out very goo. My wife loved it too. I thought it could have used more garlic though. Had it a few days later. Used a garlic spread on it and browned it under the broiler. Came out great. Use this bread up fast because it does not stay fresh long (due to the lack of preservatives?)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla Minor"
},
"reviewBody": "really good bread! I used some of the other reviewers advice, with the olive oil, minced garlic, &amp; seasonings. very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Bunny Chef"
},
"reviewBody": "I used a bit less parsley and added 1/2 t onion powder, 2 t dried basil and 1/2 t oregano, then needed to add an extra 2 T water because my dough was a bit dry. Bread turned out great though! We thought it was pretty garlicky. Not as garlicky as bread made with garlic butter spread on top, but the garlic flavor was definitely there. The herbs I added helped too since they added a lot of flavor, but it would have been good just as written as well. Dried parsley is more for color than flavor, anyway. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blue_eyedskittle"
},
"reviewBody": "Loved this! Keep in mind if you're Canadian, the flour is cut down by about 1/2 cup :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dbh"
},
"reviewBody": "I used skim milk instead of water and dry milk. I used olive oil instead of butter, 3 minced cloves of garlic instead of powder, and Italian seasoning instead of parsley. Tasted great- was soft and moist with a nice crust. Served this with pasta and a salad. Added a glass of red wine to make it the perfect meal. Will be making this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "So many reviewers thought this needed more garlic, but I served it with a very garlic-y spaghetti, so it was perfect. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sweetfolly"
},
"reviewBody": "We made this last night but substituted fresh garlic and whole wheat flour. We ended up having to use twice the amount of water given in the recipe to make a good-consistency dough (maybe because of the wheat flour?), but after our adjustments, the bread came out PERFECT. We ate it fresh with butter and it was garlicky and delicious, and we had it day-old today sliced with cheese melted over it in the broiler! Better than the french bread/garlic butter garlic bread that I usually make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shawn"
},
"reviewBody": "Bread came out a little harder than my personal preference, but the flavour was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jackie5_0"
},
"reviewBody": "Ive made this twice, both times I added an extra 1.5 teaspoons of garlic powder which gave it a nice but not overwhelming garlic flavor. The first time I followed the rest of the recipe. It was good but very dense! The second time I used 2 cups bread flour and 1 cup all purpose. I was much happier with it, still pretty heavy but the all purpose flour lightened it up just enough for my taste. Great to soak up red sauce or just dip in olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Belinda Carter McDowell"
},
"reviewBody": "Nice, but not enough garlic taste. I would add another 1 tsp of garlic powder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah13"
},
"reviewBody": "I used 3 T honey in place of the sugar, and 1 T garlic cloves rather than powder. I also used olive oil instead of butter. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "foley_rebecca"
},
"reviewBody": "I added 1/2 a cup of cheese to the bread. It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacki"
},
"reviewBody": "Made this bread twice, first time the loaf sunk in the middle, my fault...Second time I added more garlic and grated cheese, toasted the bread and it was wonderful. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "LOVE IT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BiencuitBrigid"
},
"reviewBody": "This turned out perfectly for us. Everyone in the family loved it, even the (somewhat particular) 16-mo-old. The only change I made was substituting a full TABLESPOON of minced garlic for the 2 teaspoons garlic powder as another reviewer recommended. Everything else was spot-on and my husband raved about it, from the crust to the taste to the texture and even how the house smelled when it got done baking. We will definitely be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bronwen"
},
"reviewBody": "My family loved this bread though I did follow a few suggestions from other reviewers before making it. I changed the butter to oil, the parsley to oregano and I used crushed garlic instead of powder. I added 2 cloves of garlic for a 2lb loaf which gave a subtle garlic flavour which I would do again when making the bread for other people however my family adore garlic and I will try doubling it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MonikaReed"
},
"reviewBody": "This Bread was very good. I made it in my Oster bread machine and it was very light and fluffy. Do remember to make sure all of your measurments are exact though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "purplemoosemom"
},
"reviewBody": "I'm sure this bread is very good, but... It never finished baking as for some reason, my bread machine started SMOKING!!! :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof3inpa"
},
"reviewBody": "Made two loaves in one day! Made first as part of dinner for a new mom. Sliced up and shared a slice with my children. Set up second loaf in machine immediately!!!! Added extra minced garlic on top of garlic powder called for in recipe just because we love garlic. That's the only change. Made entirely in machine and crust was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "I only give this recipe one star just b/c it looked like bread. This was by far the worse tasting bread I have ever made. My family would not eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SHARONLF"
},
"reviewBody": "This made a pretty decent basic white bread, but for a garlic bread it didn't pass the test. We couldn't taste hardly any garlic in it, even though I added extra garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shay Speer"
},
"reviewBody": "I followed suggestion &amp; added more garlic powder. I also prefer to bake my bread in the regular oven. This bread was very good!! I froze half for another meal, so we wouldn't eat too much bread at once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "I made 2 loaves of this for a church function and it was PERFECT! My friend called me after to rave about how the garlic perfectly balanced the lasagna it was accompanying. I was nervous because the batter looked a bit wet when it was first kneading, but it came out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pianoducky"
},
"reviewBody": "I went off of another reviewer's advice and subbed out the dry milk for 1/4 cup of half and half (best I could do). Added rosemary and basil, diced up 4 cloves of garlic AND added a bit of garlic powder (my boyfriend and I love garlic). It really needed the extra liquid, it came out PERFECTLY. I used the dough setting on my bread machine and formed the dough into a long italian loaf. FANTASTIC!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joseph Harris"
},
"reviewBody": "The texture was great, but it needs way more garlic. Next time I'm going to try doubling it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patandjohn"
},
"reviewBody": "The best french garlic bread recipe I have found. Used one reviewers modification of olive oil for butter, 1/4 c condensed milk instead of powdered and added my own fresh herbs - parsely, oregano and rosemary. Used 2 tsp minced garlic instead of powdered and it wasnt very garlicy. Maybe a little more. Put bread machine on dough cycle. Added more flour as it worked the dough. Turned it out on a cookie sheet but it was sticky and I added flour as I patted it into shape. Let it sit covered for 30 min and then baked at 300 for 50 minutes. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smitty"
},
"reviewBody": "this bread turned out very well in my bread machine...like other reviewers i added more garlic powder and did 2 c ap unbleached flour and 1 c multigrain...it was yummy and we really enjoyed it...made fresh spinach and tomato sandwiches with it (and all the trimmings)...will make it again...thanks for the recipe (oh and i always add vital wheat gluten...but i do that for all my breads)..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DavaLynn Joy"
},
"reviewBody": "I love this recipe! It is so easy. The only thing I do different is I cook mine in the oven since I don't like the way my bread machine cooks bread. I roll it out like french garlic bread and bake at 350. My whole family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Rovang"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Rancour Coulter"
},
"reviewBody": "I loved this very easy bread but changed a little, biggest changes were olive oil instead of butter, added fresh garlic and used Herbes de Provence instead of parsley. Will make again for sure!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melissa"
},
"reviewBody": "Great garlic bread. I prefer the Italian Bread from this site made in the bread machine though with added garlic. It came out well, just prefer the other one for flavor with added garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HomeschoolMom78"
},
"reviewBody": "This was pretty good. The only change I made was to use 1 Tablespoon of garlic powder. The garlic flavor was very, very light. Made a nice size loaf for my family of four."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baily"
},
"reviewBody": "I did not have active dry yeast. I used 1 1/4 teaspoons of bread machine yeast. Other than that I followed the recipe. It turned out really good. It is not overly garlic-y. I will be making this bread again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Hilary"
},
"reviewBody": "Weird crust - very hard and crunchy - like a bread stick. Flavour on inside good. Changed the following things: olive oil instead of butter, no parsely. Used the dough cycle and the dough looked and felt great coming out of the machine. Made into buns and baked 35min @ 375. Not sure I would make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JillW"
},
"reviewBody": "I really like this recipe. I have made it a few times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "EyesDeLaSea"
},
"reviewBody": "Not so great. Used fresh garlic as well as 1 tsp powdered. could hardly taste the garlic, might as well be normal bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Perfectly fluffy and flavorful bread! I used 3 cloves of fresh garlic instead of the garlic powder, and threw in a little rosemary and oregano as I didn't have any parsley on hand. Will certainly make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony"
},
"reviewBody": "Garlic bread with the perfect amount of garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BigShotsMom"
},
"reviewBody": "Not having a bread machine, I made this using my KA. I made some substitutions, 1 cup of warm milk in place of the water and dry milk and olive oil in place of butter. It came together beautifully. I took about an hour for the first rise and by then I didn't get as much of a garlic smell, so I kneaded in 3 large cloves of minced, shaped my loaf, allowed to rise gain and baked at 375 for 35 minutes. With the added garlic it was just right to please our tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AprilAllYear"
},
"reviewBody": "Mmmm. Turned out great. I confess I added some dried onion flakes, but otherwise stuck right with the recipe. The house smelled wonderful, inviting everyone to the table as they came home this evening. I served it with a plate of spaghetti with homemade pesto and a side salad. Perfect dinner. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori M. Vilagos"
},
"reviewBody": "I loved it! The garlic wasn't as strong as I thought it was going to be, however, when toasted with butter melted on top the garlic flavor was phenomenal! My husband and I were discussing how delicious it would be as a hamburger roll or sliced with steak and cheese on top toasted. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATHYB58"
},
"reviewBody": "I had no problems with a flat loaf - s a matter of fact it rose right up to the top of my machine - waiting for it to 'bake' now - smells wonderful. Only thing I added was a \"splash\" of milk as it was kneading - it appeared a bit sticky without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Willandjenn2004 "
},
"reviewBody": "Great recipe! I rated 4 because I had to make the adj. of warm milk instead of milk powder. Also I used fresh minced garlic oppossed to powder... YUMMY! We never have any left overs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "I love this recipe! I use olive oil instead of butter, and herbs of provence instead of parsley. I love it plain, or toasted with some butter. I make 2 or 3 loaves a week. It always comes out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dcs0102"
},
"reviewBody": "My fiance and I thought this bread was delicious....YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darby B."
},
"reviewBody": "This bread is the best!! You can really do so much with this recipes. Try adding some crushed red peppers, or for your everyday sandwhich bread do everything thing the same in the recipes, just leave out the spices. This makes the most moist and tastiest loaf you will ever eat. I have tred so many bread recipes and have been let down, but this one by far is the best. You can also add 1/4 cup of honey and switch the cup of warm water to milk ( leaving out the spices) and you will get the same as the milk and honey bread you can buy at the store. But back to the garlic bread, it is so good, you must try!! Serve warm with butter! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuckyCharm"
},
"reviewBody": "I made sure to sift my flour, and only used a scant 3 cups. Added a tablespoon of baking soda. Also used honey instead of sugar, olive oil instead of butter, and minced garlic (plus a couple spoonfuls of juice!) instead of powdered. Very tasty loaf, perfect with the split pea soup I'm also having tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vogue9"
},
"reviewBody": "This is an excellent bread!! I made it to go with a spaghetti dinner for my daughters 1 st b-day. It got rave reviews! I will admit, I made several changes. After reading what others wrote, and looking at a couple of similar recipes I made the following changes: Added 1/2 cup fresh grated parmesean cheese, oregano instead of parsley, about 1 tsp freshly ground black pepper, 3 large cloves of fresh crushed garlic. I still had the problem that others mentioned, with the bread falling, I think that adding about 1/4 more flour would fix that. Also, next time I will add two more cloves of garlic, it was good, but not a very strong garlic flavor. I will definitely be making this again! Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debi"
},
"reviewBody": "This recipe was great. I did change some things though. I added 1/4 cup extra water with the milk powder to make the bread moist. I used olive oil instead of butter and added 5 cloves chopped garlic (I am a true garlic lover). I also used 3 teaspoons yeast to compensate for the heavy ingredients. I used the medium setting on the bread machine and the bread came out perfect! Moist and very flavorful! I will definatley make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mommylove"
},
"reviewBody": "I did not care for this recipe. I make bread in my bread machine all the time, and it is always better than this. Maybe it needs more yeast? The bread was terribly dense and small and tough. Avoid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lani76"
},
"reviewBody": "I did not like this recipe the bread came out to hard even though I cooked it on a light bake in my bread machine. The taste wasn't all that good either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ed Mattox"
},
"reviewBody": "Everyone loved it. But all agreed to add more Garlic. Maybe a 3rd teaspoon?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AbbyS"
},
"reviewBody": "For me this just turned out okay. The crust is too crunchy. It might be my machine, but I've made it three times, and it's just okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BumperJr"
},
"reviewBody": "This wasn't exactly the garlic bread I was looking for, but it was still tasty. In all fairness, I did make some changes based on other reviews. First, I used 4 cloves of fresh garlic (finely chopped) rather than garlic powder. It may be a bit much garlic if you're not a big fan, but my husband's motto is, \"There's no such thing as too much garlic.\" I also used about 1/4 cup of sweetened condensed milk in place of the milk powder. Because it was sweetened, I left out the sugar. I made the dough in the bread machine and let it rise for an hour, then baked for 40 minutes at 300 degrees and another 10 minutes at 350 (to help brown the crust). I brushed the top with butter halfway through. The timing turned out to be perfect, and the bread has a good flavor, but I'm a little disappointed with the texture. I was expecting a crusty loaf, and while the crust was perfect, the texture inside was more spongy. I also thought it needed a little more salt, although that may also be due to the sweetened condensed milk. If you're looking for a moist soft bread, I think this is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ironchefwannaB"
},
"reviewBody": "I made some changes that took this recipe to the next level. Rather than add garlic powder, I added 10 cloves of fresh roasted garlic and 1 tbsp of cracked pepper. WOW! This will make your sandwiches rock! I can't wait until lunch..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOLLCHIQUE"
},
"reviewBody": "YUM!!!!! My S.O. and I LOVE this recipe!!! Usually, he doesn't like bread with \"stuff in it\" ... but, this was different ... I mixed this in my bread machine, then made rolls ... at first, he was like, \"What did you put in those?\" when he saw the parsley, but he gave them a chance, and he's eaten almost all of them since last night ... :) Oh, btw, I used a couple of heaping teaspoons of minced garlic instead of the dried stuff ... it was perfect ... not overwhelming, just right ... :) Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmberK"
},
"reviewBody": "This bread turned out really well, my boyfriend loved it. I also made the dough in the bread machine and let it rise about 30 min after I removed it then brushed it with melted butter. I then baked it for 40 min then I sliced it in half, brushed melted butter on inside of each half, sprinkled them with garlic powder and grated parmasean cheese then baked for 10 more min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Princess Sandra"
},
"reviewBody": "This is a good bread recipe - has a good texture and basic flavor. However, I was hoping for more garlic taste. I used my bread machine on a 1 1/2 lb loaf and light white crust and it came out perfectly. I will definately use again, but with more garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Peterson"
},
"reviewBody": "This is an awesome bread. I made it last night with our spaghetti dinner. I changed just a few things. I did 1 cup milk in place of the water AND powdered milk. I also replaced the powdered garlic with a few gloves of fresh chopped, and I used 2 1/4 tsp yeast. I set my loaf color for light. I got a soft, delicious, flavorful, and aromatic loaf. We topped each slice with a bit of butter and sprinkled with parmesan cheese. It was a perfect addition to our meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "This bread is not bad. I did add minced garlic plus the garlic powder. The first time I made this I must've somehow mixed the salt and yeast because it didn't turn out right. The second time, it turned out well. However, it didn't rise as well as most of the loaves I make in my machine. The loaf is a bit flat. The garlic flavor is good, but I can easily modify other recipes to add garlic. I liked it, but I've made other breads I liked better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracey"
},
"reviewBody": "I made the adjustments that reviewer, \"darkersolace\" had made. Instead of adding condensed milk in place of the powdered milk I accidentally put in 2% milk instead. But you know, it was great. Also with the added rosemary &amp; oregano. My boyfriend &amp; I just loved it. This I will definately make again with the made adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsnoellachristine"
},
"reviewBody": "So I didn't have garlic powder but I did use a little bit of garlic salt, I used regular flour and also for the 1 1/2 tsp. of salt, I used 1 tsp regular salt and 1/2 tsp johnny's seasoning salt. Also I put about 1/2 tsp of fresh rosemary in there too. It came out great! Thanks for posting the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This bread was okay, it smelled good baking but it was lacking flavor when done. I too added more garlic than recommended but it didn't seem to help. I will try it the way someone suggested by taking the dough and baking it as sticks in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scotdog"
},
"reviewBody": "Really tasty! I used Tones granulated garlic &amp; added more. I thought at first it was going to be too garlicky for kids but they loved it. I didn't have parsley but have a homemade italian parmesan herb blend that I was given as a gift. I have no idea what is in it but I used about 3 T. This bread did not rise very well but everyone in the family really liked the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nursejason"
},
"reviewBody": "This is really great recipe! To add additional flavor, I added: 1 Tbsp of Oregano and 1 Tbsp of Basil. This bread turns out so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CindeerellaC"
},
"reviewBody": "This recipe is simple, easy and makes a very good bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peytonsmom"
},
"reviewBody": "This recipe is AWESOME! I chose to use butter and let in melt in the warm water before I put the water in the machine. Also, instead of garlic powder I used 5 fresh chopped cloves. Use basic setting light crust. Really moist and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb V."
},
"reviewBody": "Very good texture and garlic flavor. Fresh garlic might be better, but this is very good as is too. Super easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Don Reilly"
},
"reviewBody": "This smelled great when it was baking. However, when I sliced it, it was extremely dense. I followed the recipe exactly. The only thing I can think of is that the recipe does not state the loaf size. I chose 1 1/2 lb, since that seems to be the most common size. Perhaps I should have chosen 2 lb. One thing I did that I would recommend is that, after slicing the bread, I put the slices on a cookie sheet, sprayed them with butter flavored cooking spray, sprinkled them with shredded parmesan cheese and then broiled them for a few minutes to toast the bread and melt the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakinginthesun"
},
"reviewBody": "A very yummy garilic bread. I added more garlic to the bread. It was yummy. I will be keeping this recipe on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chorn74"
},
"reviewBody": "Good recipe but needs more garlic. While the bread was cooking it had a nice garlic aroma but you couldn't taste it. So, I'll have to add much more next time. I like to \"taste\" my garlic in my bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mich"
},
"reviewBody": "wonderful recipie!one of the best so far and i've tried a lot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Coco"
},
"reviewBody": "This recipe is ok. It comes out moist and tasty. We have had a lot better though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shields, N."
},
"reviewBody": "Very good. I made a few adjustment from the beginning. I used 1 cup of warm milk instead of the water and the powdered milk. I used 1 Tbs. of olive oil instead of the butter. I added 1/2 Tbs. each of died basil and oregano. I used 2 cups wheat flour and 1 cup white flour. I also used three cloves of Garlic, minced. \n\nIt was most delicious out of the bread maker, hot, and with butter spread on the top. The only disappointing thing was waiting for the bread maker to finish baking the bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "This bread was great!! I followed the recipe exactly and it is wonderful. A great addition to a pasta dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura D."
},
"reviewBody": "My family absolutely loved this bread machine recipe! I did make the following substitutions: 1 Tbl. vegetable oil, instead of butter, 3 tsp garlic powder, and 1 1/2 tsp. of \"rapid rise\" yeast, instead of the regular active yeast. When I use this yeast, I've used an appropriate \"basic bread - Rapid\" cycle for the machine, and have had great bread as a result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "btk031906"
},
"reviewBody": "Very yummy!! Did not look pretty - the middle fell in (machine was a Christmas present, so I'm new to this). This didn't affect the taste at all, everyone loved it! I added extra garlic powder, as suggested below. Will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheoah"
},
"reviewBody": "I thught this was pretty tasty. Although it took me a while to get the garlic smell out of my bread machine. Luckily when I made other loaves, it did not taste like garlic!:) Thanks for sharing your recipe:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "William Bumphrey"
},
"reviewBody": "Not too bad. I expected it to rise a little more and be a bit larger, lighter loaf than it actually was. Also, the crust was a little too \"solid\" for my liking. Perhaps set on the light setting, it would have been a little better?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alecia"
},
"reviewBody": "We made this into a dough and made breadsticks and added some butter and parmesan cheese. I thought it was too garlicky, but my family thought it was GREAT! NO leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanielleR"
},
"reviewBody": "I actually made these into rolls. I put the ingredients in the bread machine on the dough setting. Then cut the dough into individual rolls and baked them for 15 min. WOW! I have none left! I made 12 rolls, and between myself and 3 others, we ate all of them. REALLY good warm with butter. I did add more garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Justa' Mom"
},
"reviewBody": "This was a so-so recipe. I tried it as it's written and it didn't rise well, was drier than a bone and didn't taste like garlic at all. I decided to try it again with a twist: \n\n1 c. water\n1 tbsp. EVOO (extra virgin olive oil)\n1/4 c. milk\n1 tbsp. sugar\n1 1/2 tsp. salt\n4 cloves minced fresh garlic\n3 c. flour\n1 1/2 tsp. active dry yeast\n1/2 tsp. oregano\n1 tsp. rosemary\n\nTo really get the taste of the herbs, I heated the oil slightly and added the herbs to really get it going. Then I added it in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AF Wife"
},
"reviewBody": "This bread had a lovely flavor and was excellent with my veggie spaghetti. I was a little confused when I took it out, as it had risen nicely but after baking it had fallen. It didn't affect the texture or flavor at all...honestly, it was a more manageable loaf, lol. I think next time I'll try the breadsticks like another person said they did. I also thought about making sandwich sized rolls out of this. Will definitely make it again, and with fresh basil!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "Excellent! Even better when sliced, buttered with garlic butter and put under boiler to toast. Good with Italian food."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16667/bread-machine-garlic-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14966/appetizers-and-snacks/garlic-bread/",
"name": "Garlic Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16667/bread-machine-garlic-bread/",
"name": "Bread Machine Garlic Bread"
}
}
]
}
}
, "about": [
]
}
]