				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bread Machine Calzone"
,"datePublished": "1999-05-04T21:03:21.000-04:00"
,"dateModified": "2022-08-04T11:45:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kevin K"
,"url": "https://www.allrecipes.com/cook/24325172"
}
]
,"description": "The calzone dough is prepared in the bread machine, and then it&#39;s stuffed with Italian sausage, pizza sauce and mozzarella cheese and baked until golden brown."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z8WWcRlho2Wf-aEPxs8-a5gbBWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6861365-76b54eb5b0ab47fba3f41b098b8e8796.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bread Machine Calzone"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "272"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "288 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "54 mg"
,"fiberContent": "1 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1440 mg"
,"sugarContent": "7 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.25 cups water",
"2 teaspoons active dry yeast",
"1.5 tablespoons white sugar",
"3 cups bread flour",
"1 teaspoon salt",
"1 teaspoon powdered milk",
"0.75 cup sliced Italian sausage",
"0.75 cup pizza sauce",
"1.25 cups shredded mozzarella cheese",
"2 tablespoons butter, melted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To Make Dough: Place water, yeast, sugar, flour, salt and powdered milk in the pan of the bread machine, in the order suggested by the manufacturer. Select Dough cycle. After cycle is completed, roll out dough on a lightly floured surface."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, brown sausage for about 8 to 10 minutes in a large skillet over medium heat. Drain excess fat and reserve."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Shape dough into a 16 inch by 10 inch rectangle. Transfer to a lightly greased cookie sheet, and spoon pizza sauce lengthwise down the center of the dough, followed by the browned sausage and the cheese. Make diagonal cuts 1 1/2 inches apart down each long side of the dough rectangle, cutting to within 1/2 inch of the filling. Criss-cross cut strips of dough over the filling and seal edges with water. Brush top of calzone with melted butter."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 35 to 45 minutes, or until golden brown. Remove from oven and cool for 5 minutes, then slice and serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mhagle"
},
"reviewBody": "Wow. This was fabulous. Delicious bread and crust. I added more fillings. Cooked the sausage with diced onion. Used fresh basil and fresh oregano. Diced red and yellow peppers. Little pieces of corned beef. Swiss and Monterey Jack cheese. Garlic salt instead of sea salt. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The CPA Chef"
},
"reviewBody": "This turned out quite good, however be sure you are ready to feed a tribe of people. When it was all said and done I came out with one 14 inch and two 8 inch Calzones. Also, you need to be sure to roll these very thin otherwise they will be too bread heavy. Additionally, bump up the temp to 400 - most calzones are hit with very high temperatures to achieve proper crusting. Finally, be sure to have plenty of flour on hand for the rollout - the dough was very sticky and needed more flour. The only reason I’m not giving this 5 stars is due to the portion size and that traditionally sauce is served on the side, not within the calzone itself as it would make the bread soggy. Overall, great recipe and will definitely be making it again - good for a dinner party where everyone gets to make their own 6 inch, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean mrtwo"
},
"reviewBody": "My wife braided this like a boss! I know I messed up something since I was the man with the roller... dough on top got to be too thick :( . We have only eaten the ends (a lot of bread because of how we made ours) and one slice from the \"middle\" area. I put the kitchen sink in my side, fresh mushrooms, deli sliced sandwich pepperoni, bacon crumbles, crumbled beef (all pre cooked meats), canadian bacon cut in quarters and black olives. We added sliced mozzarella and sliced Monterrey Jack cheese. We used Bertolli spaghetti sauce. \n\nThings we are going to try next time\n1. more stuff - more cheese and more layers of meat. (her side with pepperoni was only maybe 1 1/2 pieces of pepperoni per slice when all was said and done and it is too much bread for the meager amount of pep and cheese we put in.) We will layer meat, cheese maybe 4 times over next time.\n2. more sauce - not a lot more... I really appreciate Kevin giving us a starting quantity but I think maybe being in contact with the dough pulled some sauce out. It was a good amount when we started but after baking, it seemed to have gone in to the ether. I think next time, base of sandwich pepperoni and then a layer of cheese and then sauce should work well for our tastes.\n3. Bread a bit less bready. Everything worked out great but the bread we use for our pepperoni rolls may be better as it seems to not bake up as thick.\n4. Egg wash is pretty awesome on here - we use one egg with one tablespoon water mixed and brus"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick "
},
"reviewBody": "Really enjoyed this recipe. I am staying with a friend who had a bread machine and used theirs, though I think it would turn out okay with some hands work too. The dough turned out great! I used hot Italian sausage and it was a perfect sweet/spicy. The only thing I could have done was use a better pizza sauce. (I didn't have any tomato paste to make my own and didn't end up having time to pick up some pizza sauce. I improvised and the sauce I made turned out a bit too salty, but everyone liked it and I will be looking forward to making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurabarton77"
},
"reviewBody": "Amazing recipe, always turns out good. Even use this recipe to make pizza crust and Italian style bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AT Harbert"
},
"reviewBody": "Great dough recipe! I added Italian seasoning to the dough. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eliza"
},
"reviewBody": "A tasty and easy recipe. The strips were a lot of work that I don't think are necessary - it made it thin on the bottom and dough heavy on the top. Just fold over the dough and crimp the edges to create a pizza pocket. I will make this again and try different ways of working the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimboat57"
},
"reviewBody": "I made it and added tons of pepperoni, mushrooms, sausage and lots of cheese. It was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wandering Mike"
},
"reviewBody": "This a great base recipe that can be utilized to make whatever you want. I made one following the recipe, and then I made one using alfredo, baby spinach, mushrooms, onions, black olives, mozz, and some Italian sausage. I egg washed for color and also brushed the outside with garlic butter and parm to finish. I had some left over dough that made some decent breadsticks. The dough was a bit wet, so I'll probably back off of the water a bit next time. I will probably also stick to using a stand mixer for better control of the dough. But, not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "This is a great recipe for making with a kid helper. We filled with just a little sauce, lots of mozzarella cheese and pepperoni... Leaving the rest of the sauce for dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Bartlett Hart"
},
"reviewBody": "This was very good and very easy. However, I found that 1 1/4 cups of water was too much for the 3 cups of flour. I made it a second time today with only 1 cup and 3 Tbs of water and the dough looks much better in the machine. Flour moisture content can vary so I would suggest starting with a lower amount of water and checking the dough after s few minutes of kneading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany N Briggs"
},
"reviewBody": "So good! Came out perfect and my husband said its the best thing I've ever made. I added sausage and cream cheese to the recipe and put garlic in the butter. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOBBI1031"
},
"reviewBody": "Great basic recipe. Made twice now. First time I followed directions exactly. My only problem was transferring the calzone to the baking sheet after I had rolled and stuffed it. Grandkids loved it. \n\nThe second time I made it, followed directions for dough and then split it in half and rolled out two rectangles. Also rolled out on parchment paper and then just picked up the calzone parchment paper and all and put on baking sheet. \n\nBy making two, I was able to change up the filling. This is a big hit with all my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Telley Jones"
},
"reviewBody": "Great recipe that can be used as a base to include your fave toppings or innards. Works great at high elevation with a few tweaks. Decrease yeast by just a smidge. Increase water by a very small amount. I usually just don't measure the ingredients for a full cup or tsp and pour a tbs extra of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Wood"
},
"reviewBody": "This has become a staple dish in our house! We've used all different kinds of fillings: ricotta (a must for us!), meatballs, pepperoni, fresh spinach &amp; feta, mushrooms...anything works and it's perfect every time. The only changes I've made is that I swap the powdered milk (simply because I don't keep that in my pantry) for regular milk and decrease the water by the same amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RPMsMama"
},
"reviewBody": "This calzone was awesome! My family devoured it - as well as our neighbors whom we shared with. It's definitely a keeper! \n\nThe only (personal preference) changes/additions I made: added some dry herbs to the flour, brushed a buttery egg coating on the crust towards the end. Lastly, grated some parmesan on the crust for the last minute in the oven - yum!\n\nWe used authentic Italian sausage and pepperoni from an Italian market and it adds to the over all flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spiderwoman_9"
},
"reviewBody": "Absolutely the best pizza/calzone dough! It comes out perfectly every time and I have also used it as a cinnamon roll dough and WOW are those amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "Dough was meh"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "parkiesgal"
},
"reviewBody": "Loved this recipe for the ease and the variance of a pizza type meal. The bread seemed to overtake the filling flavor. Will try again but make two smaller/thinner calzones. Anxious to try Alfredo sauce with shrimp, crab,cheese, and onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahD"
},
"reviewBody": "Use it frequently - works like a charm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pegbob1750"
},
"reviewBody": "Thank you Kevin for this recipe. Very easy and very very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lacey"
},
"reviewBody": "Wonderful! We made each half with different filling and both were tasty.\r\nI have yet to use the powdered milk as I haven't had it on hand when I made this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Holden"
},
"reviewBody": "Used Exquisite Pizza Sauce from AR.com. Used 2/3 cup wheat flour because ran out of white. Cut dough into four and made rounds, filled, folded in half. Brushed w/EVOO, garlic powder and salt. Baked only 30 min. Sprinkled w/Parmesan 5 min before finished cooking. Let sit after filling if time and dough will keep rising."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lizzie"
},
"reviewBody": "This makes a great and easy dinner. I make it frequently and usually just put cheese and olives inside (and red onions in part for myself). I think it's more of a Stromboli than a calzone though. I brush the top with butter and sprinkle garlic salt on top when it has about 5 mins left of baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommyTo4QTs"
},
"reviewBody": "Very easy recipe in the bread machine. Made great calzones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lpetSmith"
},
"reviewBody": "This was very good. I tried to make it gluten free and would not recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShttrBugin"
},
"reviewBody": "This was a good recipe; I didn't have powdered milk so I used 1 cup milk in place of it and the rest water. I added garlic, onion, and Italian seasonings to the dough to add flavor. I did my own filling of breakfast sausage, bacon, pepperoni and salami with various cheeses and my pizza sauce. Was good, and I'll make again, but the dough was too wet, so I had to work with amounts of flour a bit. I had scaled for 8 servings, and had to add about 10 tbs flour, and ended up with 6 large calzones from it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Thorrougood"
},
"reviewBody": "Fun recipe. Will experiment with fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keats28"
},
"reviewBody": "This turned out really well. Braiding the top was easier than I thought it would be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "runningmama"
},
"reviewBody": "I did not use a bread machine for this recipe. Here is what I did.... I added the yeast and sugar to very warm water to my Kitchen Aid mixer bowl and l let the mixture sit for 10 minutes (until bubbly). Then, I added the flour, salt and milk. I mixed in the mixer for 5 minutes with the dough hook. Then, I covered the bowl and let it sit in a warm spot for 1 hour, punched the dough down, rolled out on a cornmeal covered pan, filled and baked. AWESOME!!! I doubled the recipe, filled 1 with ham and cheese and the other calzone with sauteed onion, garlic, spinach and feta cheese. The dough was crispy on the outside and soft on the inside. I will definitely be making these again. Super easy, too!!\nThank you, Kevin K. for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NYDadCook"
},
"reviewBody": "I used this recipe pretty much to make calzone dough in the bread machine, and I like the taste/flavor of the dough. The fillings change each time we make them. Very good for the dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gemstoneprincess"
},
"reviewBody": "OK...Let's start!! Easy!! The bread machine does all the real work...It even proofed it. I used milk instead of water because I did not have powder milk on hand. I also added teaspoon extra sugar, and a teaspoon extra yeast. I like mine with a little more yeasty sweet flavor. Also I would put this in a 350 degree oven and after 15 minutes turn it down to about 300 to 325 degrees depending on your oven, that is if you like a less dark crust. Plus I used spinach, cheeses,sausage, pepperoni, peppers, onions and drained olives, so needed the extra cooking time, for the inside to cook and the outside not be over cooked, I just turned the oven down. this recipe would make great Breadsticks...just add some herbs and garlic and onion to the mixing bowl...Very Tasty and Thanks for submitting it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I made this recipe last night. I added mushrooms. The ingredients did not spill out onto my cookie sheet which was great. I would have increased the sauce, calzone was a little dry. Making just one made it seem to bready. When I make it again, and I will, I will make two smaller one instead. Very good, very easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Lincoln"
},
"reviewBody": "We just made this tonight! Huge success. Ive never made bread before, even in a bread machine so I was nervous! It was wonderful and the whole family got in on making the calzones. We did change the insides to our own personal pizza tastes but oh man were they good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I can really only speak for the dough and cook time, because that's all I use this recipe for. When I make calzones, I cut the dough into four equal sections and fill them with cheese, veggies, and meat (but never sauce, that gets served on the side), and then cook as directed. So easy and customizable for everyone in the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saads"
},
"reviewBody": "I used this for pizza and I won rave reviews. The crust was great for holding a lot of toppings and it was nice and chewy. keeepeer!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chattiekathie"
},
"reviewBody": "We love this recipe! It has quickly become one of our familiy's favorites. It is a great alternative to ordering pizza."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Shum"
},
"reviewBody": "Absolutely awesome! I loved this recipe for calzone. It was yummy! Definitely I will make this one again! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TomeHills"
},
"reviewBody": "Delicious, always a hit! I love the braiding technique, makes them look as good as they taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Heskin"
},
"reviewBody": "This recipe is fantastic! I have to add about an extra half cup of flour to the dough mix, but otherwise it is perfect! I cook some breakfast sausage, get some mushrooms and some sweet peppers and mozz., cheese in it and it is So delicious! Thank you for the recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBastion"
},
"reviewBody": "Delicious! Made for 5 adults and still had leftovers. A++ will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Eisel"
},
"reviewBody": "This recipe was so good and so easy! I modified a bit since I did not have bread flour or powdered milk. I used all purpose flour and a tsp of skim milk in place of those items. I had to double this recipe, so I ended making the other loaf with my stand mixer with the dough hook and it worked just as well :) We also added a sprinkle of Parmesan cheese to the top of the crust .."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sdbooker"
},
"reviewBody": "This bread recipe was perfect. We all loved the taste and texture. To avoid having to seal the edges strecth the ends of the dough over the top and bottom, then just crisscross the cut edges starting from the top and working down. The edges will be tucked inside the bread making it seemless and so purdy. Will have this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Shen"
},
"reviewBody": "This was really good! I used a recipe that came with my bread machine for the dough but it's essentially the same as the one written here but without the powdered milk. I also added grated parmesan and italian seasonings to the mix. Thanks for the yummy recipe! My whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScratchCook"
},
"reviewBody": "This made a great calzone or pizza bread. I added basil, minced garlic, and oregeno for a more flavorful crust. Its a great basic crust and there is really a lot you can do with it. I think I will add sun dried tomatoes in addition to herbs as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetnleen"
},
"reviewBody": "Not only was this excellent, it was loved by my entire family. I made one with pepperoni and a mozzarella/provolone mixture that all the kids fought over for the seconds. For the adults (who are all trying to eat a little healthier these days) I used ham, green and red pepper, onion, and Swiss cheese. We absolutely loved it. One changed I made was to give the calzone an egg white wash instead of butter which work perfectly without added fat. Thanks for the great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tkd"
},
"reviewBody": "fabulous!! Use italian seasoning in bread dough - do NOT double recipe if using bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HomeschoolMom78"
},
"reviewBody": "Delicious. I used 1/2 lb pork sausage, 1/2 lb beef, and pepperoni. I cooked the meats, then tossed them and the cheese with some Italian dressing/marinade. I did not worry about braiding, just folded it all up into one calzone. Brushed with some butter. SO GOOD! Did not use any sauce on the inside of this, but served with ranch and marinara for dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jedgington"
},
"reviewBody": "I must've done something wrong, because my dough was way to wet and sticky. I have a standby dough recipe that I'll use next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynnje"
},
"reviewBody": "Excellent! The bread was superb! Slightly sweet, light and tender with a nice crunchy crust. I did not use the powdered milk instead I just substituted the water with milk as suggested by other reviewers. For the filling I also added sauteed yellow peppers and onions. I made the exquisite pizza sauce from this site and served it on the side rather than putting it in the calzone. I've made calzones and stromboli several times before and this one was definitely the best! I will look not further, but will continue to use this recipe. The braiding also worked better than the traditional rolling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chari Campbell"
},
"reviewBody": "Very good - I liked this recipe better than the other calzone recipe I tried. Like others, I used milk in place of water and powdered milk. I think this is what helped produce such a nice soft dough/crust. I only used the recipe for the dough, adding garlic powder and oregano for added flavor. I did have to bake mine slightly longer than stated, and still was able to avoid a tough/hard crust. Great recipe; thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen Cervantes"
},
"reviewBody": "Great! We used turkey, red onions and barbecue sauce. I was able to make one without the onions for my girls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZAKKIE"
},
"reviewBody": "I originally made this recipe (sans sausage, used pepperoni slices) a few years ago but forgot to review it. The dough is easy to work with and shapes up beautifully. I just made the dough only again for bread bowls (for dip and for soup). Wonderfully easy. (Of note, I used 1 T. LESS water and the dough was still sticky but workable. I also used 1 T. bread machine yeast for the bread bowls but 2 t. bread machine yeast for the calzone. I do not brush the dough with melted butter.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyful1"
},
"reviewBody": "A new favorite in our house, and the best part is the filling options are endless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greenbabby"
},
"reviewBody": "The dough was great. I don't know what I did different but it made 2 huge calzones. I filled mine with ricotta, mozzarella and ham. So good. Next time I will add some seasoning to the ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Armstrong"
},
"reviewBody": "This is very good! I would like to add that you can make this without using a bread machine! I made it without a bread machine and it was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKIN4MYFAMILY"
},
"reviewBody": "10 STARS! I have made this too many times to count over the past year. I use milk in place of the water and powdered milk, and add garlic powder and oregano to the dough. Terrific recipe for customizing with your favorite meat and veggies inside. We like this served with a zesty Italian sauce on the side and no pizza sauce inside. For a double batch, I like to make a cheese filling with 15 oz ricotta cheese, 16 oz shredded mozzarella cheese, 1 egg, black pepper and oregano. Over top of this, we layer: sauteed onions, garlic, peppers, mushrooms, diced tomatoes, rosemary, oregano, and cooked meat or pineapple and ham. The braiding makes a beautiful calzone and is easy to do. About five minutes before it is done baking, I brush it very lightly with butter and a touch of Parmesan cheese. If you make a double batch, make sure you help the bread machine get started with the mixing as it is a lot of flour, but it works in my Hitachi bread maker. Better than what you can get in a restaurant! Thank you Kevin K.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "talgal"
},
"reviewBody": "This recipe was great. I made the dough in my bread maker and added a little basil, oregano, and a sun dried tomato/Parmesan dry mixture. For the inside I used homemade tomato sauce, mozzarella, sauteed broccoli/red/green peppers/garlic. I topped the calzones with butter and parmesean before I threw it in the oven. It was AMAZING. The outside breading was so good I could have eaten it plain as breadsticks. The only thing that was a little hard was dealing with the dough because it was very sticky. It was worth it and I will definitely be making this recipe often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huskerfan"
},
"reviewBody": "These calzones were excellent. My husband said it is the best thing I have ever made(and I cook a lot). The dough tasted exactly like Pizza Hut's pan pizza. I do not have a bread machine so after proofing the yeast(mixing the yeast w/sugar and warm water for 10 minutes), I added the other ingredients and kneaded it for about 6-8 minutes. After that, I let the dough rise in a covered bowl in my oven on the lowest setting. Rolling the dough out was a breeze and the recipe is really quite simple with delicious results. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauren234"
},
"reviewBody": "Yummy!!!! We love garlic so I added some garlic powder to the butter, very tasty! The braid will take a little practice.... Great base recipe, next time I'll add some differnt fillings and I bet this will be just as great! Thanks for sharing!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUTUCREW"
},
"reviewBody": "Very easy! I just rolled it out to a 10\"x16\" rectangle, put the filling inside, and sealed it up. I made half of it vegetarian (ricotta, red and green bell peppers, onions, sliced black olives, mushrooms and mozzarella) and the other half with pepperoni. I chose to dip the calzone in marinara instead of adding to it. I may put the sauce in next time. I think the dough would make a nice loaf of bread too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melvillegirl"
},
"reviewBody": "Good! I have also used this dough on the grill as a BBQ pizza."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tokazodo"
},
"reviewBody": "being a professional baker, I do not own a bread machine. I do however own a Kitchen Aid Mixer. I made 1 1/2 times the recipes as some other reader's have done and I mixed it on the mixer. I allowed the dough to rise until double, about an hour. This dough was so yummy, we all made pigs out of our selves! It made delicious Calzones and we where each able to make our own, with our favorite fillings. I loved mine with Spinach, Mushrooms, Onions, ham and Mozzarella cheese. My husband suggested that next time, I leave some dough unused, and fry dough balls as some Italian restaurants do, and make zepoles for dessert. (small fried pizza dough balls, rolled in powdered sugar after frying)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annick1982"
},
"reviewBody": "We loved this! All four of my children ate their dinner and then we argued over who would take the leftovers for the next days lunch. I am about to make another one to put in the freezer, for a day when I am in a pinch, to save me from having to splurge and pay for delivery pizza. Thanks for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Delicious, and surprisingly easy. The braiding is a little tricky, as the directions are somewhat vague. Basically, after heaping the mixture in a line down the center, use a sharp knife to cut downward diagonally angled \"flaps\". Like this: (right side) //////// (middle) ----- (left side) \\\\\\\\\\\\\\\\ Then overlap each side, and tuck in the ends. At least that is how I went about it and it turned out nicely. I subbed 1 tablespoon of actual milk for the powdered; didn't throw off the recipe, despite the extra liquid. I also added another teaspoon of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenniferm1"
},
"reviewBody": "This recipe is awesome!! I made one change with the dough, I added 3/4 tsp of garlic. I also filled them with Italian sausage, ham, pepperoni and crumbled bacon. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDASBEAR"
},
"reviewBody": "I made this tonight. I only used the calzone dough and it reminded me of the calzones I used to eat in NY. It was great. I also made individual calzones, and I let the dough rest when it came out of the bread machine and then let it rise for about 15-20 minutes after the calzones were done. Since everyone wanted their own filling, I \"glued\" a piece of the filling (pepperoni, broccoli, etc.) to the outside so everyone would know what was inside each one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "somethingdifferentagain"
},
"reviewBody": "Dough was very elastic when taken out of the bread machine. FYI, some nice person advised me that it should rest for a few minutes before using. Also, recipe did not say to let rise after forming the calzone, but I made individual ones and the ones I did first (that had some time to rise) weren't as tough, so I would allow for some rising time also. Although pretty good, the filling was pretty basic. And leaked out anywhere I did not seal perfectly. Now that I know a little more about making these, I WILL try again, allowing extra time for the above and being much fussier about sealing the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Janell the Great"
},
"reviewBody": "Turned out tough :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scionmom"
},
"reviewBody": "My family absolutely loves this dish, we make it into individual calzones and add whatever toppings that one wants, the kids love to help make dinner! The only down side it I cant seem to get the dough thin enough, it always seems too thick and tough, if anyone has any tips, let me know please! Other than that this is a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie H"
},
"reviewBody": "Fantabulous!!! I made individual sized calzones and the family couldn't wait for the second batch to come out of the oven. I added some Ital. seasoning and some Parmesan cheese to the dough but that was the only change I made. I will be making this again real soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Starsha"
},
"reviewBody": "I just used the crust recipe for my calzones. It was easy to handle and tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2hhh"
},
"reviewBody": "2 Thumbs UP! Made this exactly as recipe stated (except used meatballs instead of sausage). I can see this becoming a \"staple\" in our house. Especially when I have a houseful of growing kids and all their friends. So many possibilities and options - a great recipe to \"tweek\". Easy way to use up leftovers! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PATTY33"
},
"reviewBody": "Oh Yum!! Everyone loved these and the leftovers are just as good the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Emanuel Myers"
},
"reviewBody": "Great recipe! Yummy, versatile, easy and kid friendly. What else could you want? I didn't have powdered milk so I replaced the water with warmed skim milk. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abbysouza"
},
"reviewBody": "My whole family loved this. It was easy and absolutely delicious. I added italian seasoning and garlic powder to the dough and used ground beef as my filling (that was all I had). I mixed oregano with the ground beef, and sprinkled oregano over the toppings once I had added them to the calzone. I also sprinkled garlic powder over the melted butter after sealing the calzone. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AndriaL"
},
"reviewBody": "I made this tonight and everyone loved it. Used the easy pizza sauce III recipe from this site and some ground mild italian sausage. Added a little more cheese inside, brushed the outside with egg beaters and sprinkled on some parmesan and italian seasoning. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tjsmith"
},
"reviewBody": "Yummy! Turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "This was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Garrett"
},
"reviewBody": "This one is a winner. Great crust, and you can fill it with whatever appeals to you. I may never make pizza again; this is easier and IMHO equally tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Mreen Holmes"
},
"reviewBody": "This was a great recipe! I substituted Canadian bacon for the sausage to reduce the fat content and it was delicious. One thing that the recipe doesn't mention is the time it takes to make the dough. Our machine takes 2 hours to make the dough so we ended up putting the dough in the refrigerator and making the calzones the next evening. We'll make this again and again! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri S."
},
"reviewBody": "We added chicken apple sausage, mushrooms, and olives. It tasted pretty good. We didn't use the receipe for the bread, just the calzone. We used a bread recipe from our bread machine book."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAMMY68"
},
"reviewBody": "This was really good!! I added a teaspoon of itallian seasoning and 1/2 teaspoon of garlic powder to the flour. Used ricotta cheese mixed with a half of a can of pizza sauce, ground beef, salami, pepperoni, mushrooms, and olives. Huge hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~chele"
},
"reviewBody": "I made mini calzones for 6 little girls at my daughters 7 year old birthday party. I asked each girl what filling they wanted i.e. cheese, pepperoni, black olive, mushroom....all 6 girls inhaled their calzone and said it was the best. I have since then made the dough into \"cheese\" sticks like we get at our italian restaurant - the family likes this bread better. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "This is very good I did not want to spend 12 dollars on powdered milk, so used 1 teaspoon milk, THis dough is the best I have had. Thanks\nI also used pepperoni instead of sausage. Will make again and all the kids loved :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CJS08"
},
"reviewBody": "Had this for dinner last night and the family really enjoyed it. I have made something similar with a slightly different crust recipe but we unanimously agreed that this crust was lighter and tastier than my other one. I did add garlic powder, basil and oregano to the dry ingredients and sprinkled parmesan on the top of the loaf as it baked. This recipe was good for 2 adults and 2 hungry children. Looking forward to trying other stuffings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveMexiFood"
},
"reviewBody": "I'm giving this 5 stars because it has so much potential. And I'm putting it on my All time favorite list. I used a pkg of Quick rise yeast and used my Kitchen aid mixer and let the dough rise for 30 to 45 minutes. I sprinkled the top with garlic salt over butter. It would be better with other stuff and maybe with cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Brunmeier"
},
"reviewBody": "This always turns out perfect. I have found that by scaling the recipe to 6 servings the amount fits in my bread machine and I end up with 2 very large calzone which is enough to serve my family. For the filling I used a mixture of ground beef and ground italian sausage. I cooked the meat and added 2 cloves of garlic. I also added some parmesan with the mozzarella. The flavor of the bread is wonderful. It is easy to put together once the dough is ready. It is good with a variety of different fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Galan"
},
"reviewBody": "I made this for dinner tonight and it was a hit with everyone, and if it's not good they'll let me know!\nthe only thing I added was pizza sauce, shredded mozarella cheese and pepperonis., then roll up the sides because I couldn't do the braiding thing, and then brush the top and sides with olive oil, sprinke on basil, parmesan cheese and salt.\nEverything was very flavorful, and I'll make it again! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gamom68"
},
"reviewBody": "I followed the dough recipe and did my own filling and this was a hit with my husband and kids. Thanks for the great recipe. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Laliberte"
},
"reviewBody": "This dough was great easy to work with and bake up to a crispy outside soft center and was bit chewy Just how I like it....I made 2 calzones and 2 small pizzas used the exquisite pizza sauce from this site and topping to suite everyones taste 35 min was perfect......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FLPOMPANO"
},
"reviewBody": "The bread came out great. In fact, better overnight when reheated in the toaster oven. I didn't have powdered milk and put in a tablespooon of butter instead. Definitely add some garlic powder to the sausage when cooking. It is also good to add some herbs on top and brush it with olive oil as others have recommended. Lastly, the filling is not quite enough. I think I will use a cup next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie H."
},
"reviewBody": "I agree with the other reviewer to use a tsp. garlic powder, and a tsp. italian seasoning. I use the dough recipe for our pizza's and my family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica S."
},
"reviewBody": "Oh my! This was delicious! My husband found the recipe and we loved it. I think I will take other's suggestions and add Italian spices to the top next time. But this is a fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma"
},
"reviewBody": "great recipe,\nI rolled it in some oregano and basil and then brushed it with olive oil just before putting it in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Morgan-Redepenning"
},
"reviewBody": "thanks for this recipe! I t was the best calzone I have had. I added italian seasons and no sugar to the dough and it was great. I also put sauted greenpeppers and onions and ham inside. yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lotrgal922"
},
"reviewBody": "This made a delicious bread mix. I made four individual calzones. I put grilled chicken and spinach in mine. I did add 1 tbsp. each of garlic powder and Italian seasoning. Will definitely use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Eastin Hamilton"
},
"reviewBody": "the dough turned out well but I wished I used olive oil with some additional spices to brush on the outside. We loved the recipe and found it a nice change from the regular routine."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18878/bread-machine-calzone/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18878/bread-machine-calzone/",
"name": "Bread Machine Calzone"
}
}
]
}
}
, "about": [
]
}
]