				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bread Machine Pumpernickel Bread"
,"datePublished": "2019-04-03T23:33:15.000-04:00"
,"dateModified": "2022-08-11T23:09:16.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ann Davis"
,"url": "https://www.allrecipes.com/cook/1268199"
}
]
,"description": "A hearty, healthy bread that combines bread, rye, and whole wheat flours with cocoa and molasses."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3RTXAsWxKMopRKm8fe2Iaco5H9A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8476938-bread-machine-pumpernickel-bread-dennyflorida-4x3-1-d633053959fe4e1f969655575d8fea9a.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bread Machine Pumpernickel Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "228"
}
,"cookTime": "PT225M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "119 kcal"
,"carbohydrateContent": "22 g"
,"fiberContent": "3 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "295 mg"
,"sugarContent": "5 g"
,"fatContent": "2 g"
,"servingSize": "1 (1-1/2 pound) loaf"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.125 cups warm water",
"1.5 tablespoons vegetable oil",
"0.33333334326744 cup molasses",
"3 tablespoons cocoa",
"1 tablespoon caraway seed",
"1.5 teaspoons salt",
"1.5 cups bread flour",
"1 cup rye flour",
"1 cup whole wheat flour",
"1.5 tablespoons vital wheat gluten",
"2.5 teaspoons bread machine yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Basic cycle; press Start."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT235M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this recipe exactly as written many times in my breadmaker - highly recommend the “dark crust” setting since the inside is so amazingly moist and chewy and it’s great with a crunchier crust. Sometimes I prefer it with a tablespoon less of cocoa and a pinch more salt, especially for sandwich bread. Definitely recommend dissolving the molasses in the warm water before adding to the machine. So glad I found this, it’s a house fave!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We liked this recipe but the flavor wasn't quite what we were going for. We followed the recipe to a T, using the optional ingredients, as well. It didn't have that 'bought it from the bakery' flavor I was looking for. Still, pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jerezita"
},
"reviewBody": "Texture of bread was good. Flavor of cocoa a bit too strong. Instead of rye flour, used half cup more bread flour and half cup more wheat flour. Used Basic setting on bread machine and baking time was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "davidjackie"
},
"reviewBody": "I did not have the gluten, followed the rest of the recipe as written. Very good bread, we enjoyed it a great deal! Keeping this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale Meech"
},
"reviewBody": "I have made this many times and it is delicious. I use it to make reubens in a panini press. Dale"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hillclimber22"
},
"reviewBody": "This is a lovely bread. I added 2 teaspoons of espresso powder, and used black cocoa powder, to get the blackest black. I also added a handful of chopped dried fruit. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHETZ55"
},
"reviewBody": "Loved it!\nSnow storm Izzy was coming so I wanted to make something that would keep me warm incase I lost power. So I made some venison stew and this pumpernickel bread. Both came out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine Harley"
},
"reviewBody": "I didn't have molasses so I used honey. I had dark cocoa so I used only 2 tablespoons. Great dough, excellent bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Begeske"
},
"reviewBody": "Made this recipe for my hubby. Didn’t have cocoa so substituted my Cacao Bliss. Also didn’t have whole wheat flour so substituted fine almond flour. Hubby said it was soft and tasted great! Making another loaf for camping this weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "almsthere"
},
"reviewBody": "Absolutely marvelous! I'd give it a full five stars but I made a few alterations based upon my experiences and other reviews. Although it's not stated this results in a 2lb loaf, I baked mine using the wheat medium crust setting. Instead of all mollases I simply used 1/2 mollases 1/2 honey and reduced the cocoa to 2T. Oil is pretty bland so I swapped it for 2T unsalted butter which I warmed in a mug with the honey mollases mixture which allowed me add room temperature water. The 4 stars are for my version which fell slightly but baked beautifully with a marvelous crumb and a amazing taste! This popped all the way to the top of my bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KerrySuz"
},
"reviewBody": "This tastes NOTHING like pumpernickel bread. We chose not to use the caraway seeds, and maybe that's the problem, but I'm super disappointed. Beyond the taste, the ingredients did make an edible loaf of bread. It just isn't pumpernickel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shade"
},
"reviewBody": "I made this bread today for the first time and I have to say that I will be making many more times in the future. I made one change to the recipe, I added 1 tbsp rye improver in addition to the vital wheat gluten. The resulting loaf is light and fluffy. Serious winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CeCe"
},
"reviewBody": "I used all of the ingredients and the amounts listed except for the caraway seeds. I used about 2 teaspoons of the seeds. The bread is delicious! It did not rise as my white bread, honey wheat bread and Hawaiian breads do, so I’m not sure about that. I did mix the molasses and water together s suggested by one of the readers.! Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Loved it. Perfect in taste and texture. Next time I will let in bake in the oven, but the breadmaker does all the hard work.\nI milled my own rye and wheat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dennyflorida"
},
"reviewBody": "Tasted great and I followed the recipe exactly. Grew texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Judy Martin"
},
"reviewBody": "This did not mix well in my machine. The molasses caused the flour to stick to the pan. I had to use a spatula to remove it from the sides so it would mix into the ball of dough. It resulted in a loaf that was rough and irregular on the top. I think dissolving the molasses in the warm water first might help with this issue. The bread was moist and tasted good. Just disappointed in the lack of height and the appearance. I did use vital gluten, and my yeast was a new package."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Newman"
},
"reviewBody": "This recipe was a success! We’ve already made it a few times. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vince Wilding"
},
"reviewBody": "3 *TABLESPOONS* of cocoa powder? That was a bit too strong. I'll try it again with a little less cocoa (maybe a tablespoon, 3 teaspoons seems more sensible)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Wesson"
},
"reviewBody": "At another posters suggestion, I used some decaff coffee instead of just water. I found out too late I was out of rye flour so I used a cup and a half of whole wheat and two full cups of bread flour. It was a little dry and took some hand kneading (I'm going to try again with an additional 1/8 cup of water or coffee) but turned out very nice. Very dense but lovely dark pumpernickel flavor. Might adjust the yeast to a full tablespoon as well to get a little more rise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elisah54"
},
"reviewBody": "Made as written and it turned out very nicely"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rabbimc"
},
"reviewBody": "I've made this recipe 3 times. The first 2 times I made it into rolls for a party (dough made in bread maschine, then shape, rise and bake for about 20 minutes) and the third time made it into a loaf and 1 roll. All were enjoyed, even though I couldn't find my whole wheat flour the last time and made it with an extra cup of rye flour instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kc"
},
"reviewBody": "Very good. Try it with pimento cheese. Amazing. No other bread will do with pimento cheese now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Welch"
},
"reviewBody": "The aroma during bake was out of this world. The crust is crispy and the bread is tender and not as dense as I thought it might be. Cant wait to make a sandwich.8. Loaf after cooling weighed in just under 2 lb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Greger"
},
"reviewBody": "Well I am making this right now so I will let you know how it goes! I am new to making our own bread. I had to go to 3 different stores to get the ingredients. The one thing I did different is that I use the active dry baking yeast rather than the “bread machine yeast” only because I could not find the bread machine yeast locally. I also use half the amount of caraway seeds. \n\nAlso my bread machine is a Cooks Essentials Breadmaker and the basic setting is 3 hrs 20 min rather then the 3 hrs 45 min that you are showing.\n\nOkay folks, I added a star! This loaf came out beautifully! It is amazingly moist and the rise was perfect. It has that pumpernickel taste that is perfect. If you follow this recipe just like it says you should get a wonderful loaf of pumpernickel bread like I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pj"
},
"reviewBody": "I made this with the intention of making a bread bowl and filling it with Spinach dip for before Christmas Eve dinner for a crowd. Sadly, I didn't thoroughly read the recipe, and missed the almost-four-hours part. The dip was ready, but not the bread. \n\nI found it fairly \"dark\" tasting, and could definitely taste the hint of cocoa. It didn't have the moistness of pumpernickel bread I've had elsewhere, but I have no idea what recipe \"elsewhere\" used. I used dark rye flour. I didn't have vital wheat gluten or whole wheat flour, so used unbleached AP flour instead of the latter. \n\nIt was certainly easy, but just ok and if I did it again I might use regular rye flour not dark rye, and omit the cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Ellis Givens"
},
"reviewBody": "This is the first time I’ve ever made bread in maker. I didn’t have my instructions for the maker but followed wet to dry making the active yeast last. I also didn’t have wheat flour and used all-purp. IT TURNED OUT AMAZING!!! I’m German and can’t find this type of bread here in there States. It is a fantastic recipe! Cooked on my maker for 3.5 hours 1.5 lb loaf and used only one envelope of Active Dry Yeast. I will submit photo too.\nThanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gsprof94"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathryn Damkroger"
},
"reviewBody": "FANTASTIC!!! Taste great. Best bread I've made so far.\n\nThe recipe is very forgiving. I made a mistake, added twice the amount of water. But, during first mix, I added more flour, yeast, etc to make a double loaf. I split the dough in 2 and baked one in the oven and one in the machine. Both turned out fantastic. The one in the oven turned out denser, which I like better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phylleri"
},
"reviewBody": "I followed the recipe except for using only 2 T. of cocoa instead of 3. I never bake in the bread machine, so this was a guessing game but I thought 350º sounded OK. Turned out great and the recipe is now in my \"go to\" file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zena Eisenberg"
},
"reviewBody": "I did not have rye flour, so used oat bran instead. I added caraway seeds and that worked out great. However, the bread came out somewhat dry.\nThe second time I made it, see pic, I followed one of the reviewers’ suggestion and added only 2 tablespoons of cocoa. I also used rye flour this time, and did not add the caraway seeds. Finally, what made a big difference, was to turn off the bread machine before the cycle was finished (basic cycle). I saw that the bread was done 30 minutes beforehand!! Result was great: soft, moist bread! Beware of the bread machine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ditch67"
},
"reviewBody": "Made this recipe dozens of times. Works equally well with store bought or home milled whole grain flour; equally well with wheat or rye."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nnzoom"
},
"reviewBody": "This was my first time using this recipe. I'm new to the bread machine thing... and I mistakenly switched the \"vital Gluten\" with the Rye flout!! (The bags were SO much alike!) I realized my mistake, but it was too late. I was afraid I'd have to throw out the entire loaf... but... miraculously, it turned out really GOOD! \nNo... I won't try this again, and I won't make THAT mistake again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovehorses"
},
"reviewBody": "Love this recipe!!! ‘This is the changes I made:\n1st: No Whole Wheat Flour, I added another cup of Rye Flour. Added 1/2 tbls sugar. Did add the Caraway Seeds.\n\n2nd: I did as others: 2tbls. Cocoa, but I also ended up adding extra 1/2 cup Water. Also, added 1tbls of Fast Acting Yeast. Also, cooked on Rapid 3 Hrs10 Min. \n\nI mixed all dry ingredients in a bowl, heated 1.1/8 cup Water mixed with 1/3 Cup of molasses too 115* added to dry ingredients mixed, then heated added extra 1/2 cup Water. Mixed in bowl, put in Bread Machine put on Rapid 3 Hrs 10 Min, Dark.\n\nCame out Flavorful, Better Texture than Store Bought, Moist, Delicious, and my husband Loves it! This will be my “Go to Recipe, For Pumpernickel Bread”\n\nI"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hope Johnson"
},
"reviewBody": "Delicious! I have made this for a party with dill dip and for my daughter who loves pumpernickel bread. It is soft and smells so good. I mixed it in my bread machine and baked it in my oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rev RW"
},
"reviewBody": "This was excellent! I can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Una Teberniece"
},
"reviewBody": "Thank you for the recipe. Did exactly what it says and it turn out absolutely delicious, even didn't expect how good and tasty was bread. Highly recommended to others. The best recipe for bread making machine I could find in the internet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Anderson"
},
"reviewBody": "I added both 2T of honey and 2T packed brown sugar, and subtracted equal amounts of flour for vital gluten added. In addition, I also used 2T cocoa powder and 1T instant coffee. I didn't use my bread maker, but instead baked it in a 400 degree oven for 30 minutes on a pizza stone. Great taste and aroma; however, I need to reduce the hydration to make it move suitable for using with bannetons/brotforms when proofing. Has anyone already done this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Woods"
},
"reviewBody": "I used the bread machine to make the dough in order to control the final rising and shape of the resulting bread. I made fifteen dinner rolls from the recipe and put coarse salt on top. I added a teaspoon of fennel in deference to my Swedish grandmother's limpa bread. Despite using a pan of water in the oven, I couldn't get quite the crusty result I aimed for, but it was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bebe"
},
"reviewBody": "This was terrific! Made as directed, no changes. Did not use optional caraway. Could have risen a tad better so I'll check out other reviews for remedy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbmcs"
},
"reviewBody": "Delicious, rich flavor. This bread has become a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela K Johnson"
},
"reviewBody": "I did the dough recipe using my bread machine. Took it out, shaped, let it rise, then baked. It was super doughy. Followed directions with only one change -- had no molasses so used honey (1/2 the amount called for molasses). That should not have made any difference. May try again when I get molasses but bummed cause this bread was for our Ruben Sandwich supper tomorrow. \n\n3 stars simply because it may have been partly my fault and I had to rate to post LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Gill"
},
"reviewBody": "After discovering I had no yeast, and the machine was already loaded with all the ingredients, except for using plain white flour instead of bread flour.\nI hopped on Facebook to express my disdain, then got a call to pick up one of my grandchildren at school...I figured I'd stop by the store and grab some yeast.\nMeanwhile, a neighbor dropped off three packets of rapid rise yeast!!!\nSo, one sick child, one very happy neighbor, and a loaf baking in he machine now that smells so good I had to rate it five stars just because of all the baloney I went through to get it made!!\nWe have two feet of snow outside, I had to drive the lumber wagon of a truck to get the kid, go to the store and be surprised at finding yeast at home when I got back!! I cannot wait to taste!!!\nI added a few Tblsp of sunflower seeds and chia seeds just because I love a crunchy bread!!\nI hope I can edit his later!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donald Bertrand"
},
"reviewBody": "Omg yummy... So very yummy... Lol first loaf for my daughter's school.. Made this morning.. Making a second as we speak.. Screw being allergic to gluten lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Delicious. Made it twice in my new bread machine, perfect both times. Canadian flour, I'm told, is different so I didn't need gluten nor bread flour. I had already bought bread flour before I knew that, so I will try it with all purpose flour when I use up what I have, and see how it goes. I only left out the gluten and caraway seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "tasted too much like chocolate. maybe the amount of cocoa should be 1 tablespoon like it is in many other recipes or optional like it is in others. will try again without the cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fancy nancy"
},
"reviewBody": "This was a really good bread. I followed the directions exactly just left out the vital gluten. I made the dough in the bread machine, then shaped it into a round let rise covered about an hour. I did an egg wash because I wanted a crispy crust. It's definetly a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "songbird"
},
"reviewBody": "Will definitely make again! Great texture. Used my bread machine. My changes were small - used strong coffee instead of water and dark cocoa instead of regular cocoa powder, and added a bit more yeast. Didn't use the gluten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothea Boyd"
},
"reviewBody": "My Kids absolutely love this bread, we make it at least twice a month. I do not put in the caraway seeds as they are optional and no one in my family likes them. I don't bake in my machine, not the recipes fault though, for some reason my machine bakes hot on all loaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Gallinger"
},
"reviewBody": "Awesome! I doubled the Caraway seed. I've cooked it as a round loaf and recently in a bread pan. I think I prefer it as a round loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie m"
},
"reviewBody": "Made this last night (no caraway seeds or gluten). It turned out lovely - not too dense at all! This was my first time trying out my hand-me-down breadmaker. I used the medium wholewheat setting, and it worked perfectly! I find the molasses a bit strong, so I will try replacing some of the molasses with honey next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "simone"
},
"reviewBody": "Made not in a machine. Great flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marcelo Jucá"
},
"reviewBody": "Unfortunately it did not worked on my machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Anderson"
},
"reviewBody": "The only changes I made to this recipe were ....\n1. I didn't have whole wheat so used regular bread flour, along with the rye flour. \n2. I used the dough setting on my machine and finished it in the oven . I baked it at 350 degrees for 42 minutes, covering the top with tinfoil the last 10 minutes. \nThis was fantastic! Nice taste,nice texture. It was a \" lighter\" loaf without the whole wheat flour but I must say we didn't miss it al all. I will be making this again. Thanks for the great recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SSwisher"
},
"reviewBody": "After reading the reviews, I used only 2 tablespoons of coco powder. In my bread machine, I have to use a bit more yeast to get a good rise, so I used 3 teaspoons of yeast. I did not have to add any additional water, however I can see why some might if they don't fluff the flours before measuring. Otherwise I followed the recipe for ingredients. I wanted a free form loaf, so I didn't bake in the bread machine. If I had, this would have gotten about 2 stars. It did not rise much at all in the machine. I removed from the machine after the complete dough setting completed (1.5 hrs in my machine), then shaped onto a parchment covered cookie sheet into a round loaf. I let rise for about 50 minutes in a warm location (it didn't quite double in size, but close) then baked at 350 for about 30 minutes. This produced a heavy, but nice tasting loaf. We had it with braised corned beef and Irish Champ (both on AR). We enjoyed the bread but next time I'll increase the rye flour and decrease the white. Just a note of caution - make sure you know your bread machine before attempting and adjust accordingly. Otherwise you most likely won't be happy with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trillby_Skinner"
},
"reviewBody": "I made it exactly as specified (only omitting the optional gluten and caraway seed) this will def be a go to recipe for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jehanne Lily"
},
"reviewBody": "This was my second attempt at using my new machine. Never made bread before actually. I had to use liquid coconut palm sugar since I had no molasses and brown rice flour instead of the whole wheat flour. Nevertheless it came out awesome! Very tasty and just perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hruns"
},
"reviewBody": "I made this bread in my bread maker and I omitted a few ingredients. I did not use wheat gluten or caraway seeds. It was a nice bread because it came out dark and it was tasty as a bread for dinner and also a breakfast bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nurse Lemoine"
},
"reviewBody": "This is my absolute favorite bread machine recipe! It is great just as the recipe is but I do like it better by replacing the warm water with my morning coffee. It adds a more robust flavor to the bread. I also add a tablespoon of dark chia seeds along with the caraway seeds. The chia is so delicious when the bread is toasted. Really gives it a true toasty flavor. Combine it with American &amp; Provolone cheese...best grilled cheese sandwich ever!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Roberts"
},
"reviewBody": "Absolutely brilliant!\n\nCouldn't find caraway seeds so substituted fennel seeds. Added 70g sunflower seeds.\n\nIt's like liquorice bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "Best rye bread I've ever eaten, bar none! Absolutely phenomenal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Holly Sweany"
},
"reviewBody": "Gave it 3 because the flavor was good. Have no idea of what went wrong but my bread machine has been spot on until this recipe. Will read reviews to get some insight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ReneK13"
},
"reviewBody": "Used some of the suggestions: Reduced flour by 1/2 cup; no caraway or wheat gluton; used special dark cocoa &amp; decreasted to 2 1/2 T; used 1/2 dark molassas &amp; 1/2 honey; mixed yeast with warm water &amp; molassas mixture. Baked in bread machine and came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ani Payne"
},
"reviewBody": "hmmm...don't know what went wrong..but, I followed recipe exactly and it did not turn out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faye"
},
"reviewBody": "Wonderful recipe.Made no changes. Will make again. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EL_GHAZAL"
},
"reviewBody": "My 10 year old made this bread this weekend without the cocoa and caraway seeds and still it came out perfect. The smell, texture and taste, all perfect.\nAlso, my machine doesn't have a basic setting but has a white bread vs. grain/wholewheat setting; as well as a rapid vs normal setting. Obviously she used the grain/wholewheat setting and normal speed for a small/medium loaf 1.5 pounds.\nShe normally would have a little bit of rye bread, but since she made this herself, now this is the only bread she wants to eat :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Familygal"
},
"reviewBody": "Did not use caraway or gluten. Used KAF white rye and pumpernickel. Wheat setting, dark. Husband loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barry Oliver"
},
"reviewBody": "Excellent. Put everything but flour in machine with 2 pkgs of yeast and then added flour. Perfect. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rose Moltisanti"
},
"reviewBody": "Horrible, it was a brick and I followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Schroyer"
},
"reviewBody": "This bread was wonderful. I made it exactly as the recipe stated, omitting only the gluten. I also stopped my bread machine 15 mins early and the bread came out perfectly. It didn't last long! I cant wait to make some to share with friends and family~"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonda58"
},
"reviewBody": "Really delicious! I followed the recipe exactly, didn't use either the gluten or caraway seeds. The loaf is a little squat-looking but tastes wonderful. Will make with both ingredients next time for comparison."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolinering"
},
"reviewBody": "Really yummy - good flavor, and not too strong. I made the dough in the bread machine and then transferred it to a greased loaf pan and baked at 350 for 45 minutes. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Outstanding!! I followed the recommendations of some others and increased the water to 1 1/3 cup, used 2 cups of bread flour and only 1/2 cup of whole wheat, and used the light crust setting. I also reduced the cocoa to 2 tablespoons. I'm also a big believer in using the vital wheat gluten. The result was a very well-risen loaf with a fantastic texture and moistness. I don't see a need to alter a thing on the next loaf from those mentioned above. Can't wait to make a sandwich with some ham, turkey, and cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JimSutton"
},
"reviewBody": "So far this is the closest thing to what I call 'real pumpernickel' that I have found for a bread machine. It turned out near perfect, except for being just the slightest bit doughy in the center. I used the basic cycle as suggested, but maybe for my machine the whole wheat cycle would be better. Still a great loaf of bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JODIBRONSONNIMS"
},
"reviewBody": "Perfect! Moist and super easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mar123"
},
"reviewBody": "This is by far the best Pumpernickel Bread recipe!! I will be making this a lot!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Excellent. Made exactly as is, and used blackstrap molasses - I will let it sit for a few minutes in the machine after it's done so it can \"finish\" because the middle was under-cooked, but otherwise it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ECampbell"
},
"reviewBody": "Great dark bread. Do NOT use the quick cycle on bread machine like another person suggested. Mine was either too moist or not done enough. I use 1/4 cup extra of water to dissolve molasis."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missnepa"
},
"reviewBody": "This pumpernickel bread machine recipe is so easy and so good, it deserves 5 stars. My bread machine makes a 1.5 lb loaf, and I would say that the recipes ingredients ended up making a bigger loaf, which had just barely skimmed the top of the lid of my machine. I wouldn't scale down the ingredients because it did fit and didn't make a mess, but it does just barely fit in a 1.5 lb loaf pan when finished. I also ran mine on a medium crust, which burned in one small spot but came out delicious anyway. I have a bread slicer to make clean cuts and then I put half of the loaf in the freezer and use the half the loaf for lunches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "consed"
},
"reviewBody": "Trouble getting this to rise enough? I have the solution for you! \n\nI originally made the recipe exactly as written, and then I made it with a few modifications to make it SUPER RISE. In fact, it hit the glass top of my breadmaker and was really light and people loved it. If you want it to SUPER RISE, do this: 1) add the full amount of vital wheat gluten. This is NOT optional! (Need I explain why? Bread rises because yeast releases CO2, but that isn't sufficient--you need protein structure to contain the CO2 and keep it from escaping, and that protein is GLUTEN!) 2) Add 2 tbsp (tablespoons, not teaspoons) of honey 3) Add 2 tbsp (packed) of brown sugar 4) Use Fleishmann's Rapid Rise yeast (NOT active dry yeast).\n\nIf you follow these 4 additional steps, and the pumpernickel is not light enough for you, I'll eat my hat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Mulyk"
},
"reviewBody": "cut the molasses in with honey. about 1/2 &amp; 1/2"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorri Dougherty"
},
"reviewBody": "great recipe, thank-you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shano"
},
"reviewBody": "This bread is fantastic....used a little less cocoa and replaced one Tbls of the molases with honey....also i always let the bread machine do the work and bake in the oven...truly a delicious bread!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "heaverly"
},
"reviewBody": "This tasted NOTHING like a pumpernickel, and even WITH the vital wheat gluten it barely rose. (and my yeast is fine, I checked) I was making this to hollow out and put spinach dip in, unfortunately I am going to have to stop at the store. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Scot Murphy"
},
"reviewBody": "Turned into a lump of clay in my bread machine. Barely rose. Crust was hard as rock. My only deviation was to add minced dried onion, and I doubt that made it fail. Maybe with more water... It also said to set it on \"Basic.\" That sounded wrong, so maybe it needs \"Wheat.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vonny"
},
"reviewBody": "This is NOT a pumpernickel. It tastes noting like a pumpernickel bread. It is an okay wheat bread. I was extremely disappointed and I will not be making this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marty Engelman"
},
"reviewBody": "Too sweet for me. Next time I'll reduce molasses.\nIt does have great texture, and color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teena"
},
"reviewBody": "This was amazing, I added a handful of whole hazelnuts, as the paddle can’t break them up so they remain whole, then when the mixing was over I threw in a few pumpkin seeds so they would scatter the top. A really good recipe. Thank you. I don’t need to buy pumpernickel bread anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "weezy1"
},
"reviewBody": "I made in bread maker at dough setting; then baked in oven. Made exactly as recipe stated, minus the optional wheat gluten. The bread turned out wonderful, but I was very disappointed with it toasted (and most of the bread I eat is toasted). I probably won't make again because of this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phyl32"
},
"reviewBody": "I MADE THIS BREAD TODAY AND MADE IT JUST LIKE THE RECIPE EXCEPT I USED ALL WHOLE WHEAT BREAD FLOUR INSTEAD OF WHITE AND 3.5 TABLESPOONS OF WHEAT GLUTEN. I ALSO TOOK IT OUT OF THE BREAD MACHINE AND PUT IT IN A LOAF PAN. IT IS A BEAUTIFUL LOAF OF BREAD AND REALLY REALLY GOOD TASTING. I WILL DEFINITELY MAKE THIS AGAIN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ANGELAHAIRE"
},
"reviewBody": "This didn't turn out as I thought. Didn't suit my taste at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherryW"
},
"reviewBody": "Fantastic...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hkmop"
},
"reviewBody": "My husband says \"Really good, definitely need to keep that recipe around.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Shahan"
},
"reviewBody": "Had to add additional water for dough to ball up in bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "christinahstroh"
},
"reviewBody": "Just ok, it turned out very dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RuthBird"
},
"reviewBody": "this is really easy and excellent. The taste and texture are wonderful. Thanks for sharing it with us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "On The Fly"
},
"reviewBody": "I made the bread last evening and it is fantastic! This bread is much better in quality and taste than what I purchased locally. I didn't add the gluten but it wasn't necessary; I also used only 2 tblsp of cocoa and the loaf turned out perfect! Thanks Marylyn; any more of your excellent recipes?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CatN36"
},
"reviewBody": "This was a very bla recipe!\nThe wheat flour overpowered it and it was grainy.\nI will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ErcyMcErcy"
},
"reviewBody": "Delicious! The texture was perfect. I left out the caraway and only used 2 Tbsp of cocoa but otherwise followed this recipe to the letter. BTW I am not a fan of pumpernickel. I made this for my husband. He loved it and I have been converted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SonoraMom"
},
"reviewBody": "I LOVE this bread. I'm not a huge fan of bread machines, so I tried this using my Kitchenaid, and it is SO good! Add ingredients in order listed, knead on low with dough hook for 10 minutes. Let rise for 2 hours and double in size. Knead gently for a few minutes, allow to bake in loaf pan 1 1/2 hours, bake at 375 for 28 minutes. PERFECT! Will make again and again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/80663/bread-machine-pumpernickel-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
"name": "Whole Grain Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15034/bread/yeast-bread/whole-grain-bread/rye-bread/",
"name": "Rye Bread"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/80663/bread-machine-pumpernickel-bread/",
"name": "Bread Machine Pumpernickel Bread"
}
}
]
}
}
, "about": [
]
}
]