				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Breaded Toasted Ravioli"
,"datePublished": "2020-06-18T23:32:19.000-04:00"
,"dateModified": "2022-09-25T16:38:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "chefspecialty"
,"url": "https://www.allrecipes.com/cook/2028448"
}
]
,"description": "Packaged ravioli are breaded and baked until hot, golden, and crispy. Serve with marinara sauce for dipping, and watch them disappear."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/jwc_7d9-ePjm1hPTQg4AcH6bm8k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/775403-breaded-toasted-ravioli-footballgrl16-1x1-1-233fde6f5c364a71bbff23050727e0be.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5802645987001",
"description": "Crispy and baked raviolis are the next best thing! ",
"duration": "PT56S",
"name": "Breaded Toasted Ravioli",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9ee8623a-8d4c-4f14-900c-415f22295524/8c86f23f-a17b-4d27-962a-86eff8dea276/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T02:15:05.833-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Breaded Toasted Ravioli"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "115"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "432 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "57 mg"
,"fiberContent": "5 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "435 mg"
,"sugarContent": "4 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 egg white",
"1 teaspoon water",
"1 cup bread crumbs",
"1 teaspoon dried oregano",
"1 teaspoon dried basil",
"2 tablespoons freshly grated Parmesan cheese",
"1 (25 ounce) package cheese ravioli, thawed if frozen",
"cooking spray" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an oven to 400 degrees F (200 degrees C). Place a wire rack on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Beat together the egg white and water in a small bowl. Mix bread crumbs, oregano, basil, and Parmesan cheese in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Dip each ravioli in the beaten egg, and then roll in the bread crumb mixture. Spray both sides of breaded ravioli with cooking spray; place on the wire rack."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/jwc_7d9-ePjm1hPTQg4AcH6bm8k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/775403-breaded-toasted-ravioli-footballgrl16-1x1-1-233fde6f5c364a71bbff23050727e0be.jpg"
}
]
,"text": "Bake breaded ravioli in preheated oven until golden brown and crispy, 15 to 25 minutes."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Leitschuh"
},
"reviewBody": "I made it and it was very very good but I've changed the recipe I bet the next time I boiled cheese ravioli 45 minutes drained it dipped it in egg and milk seasoned dip with Greek seasoning and dipped it in flour mixed with panko bread crumbs deep-fried it until it was very light brown put it in a dish with melted butter fresh garlic oregano and parsley and put it on a plate and sprinkled a lot of Parmesan cheese on it and use marinara sauce for dipping they just melted in my mouth please try my recipe now thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Carrasco"
},
"reviewBody": "Loved this recipe, made it exactly as stated. Although I used my air fryer. Nice and crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Pretty good! It is a bit dry though as mentioned in other comments. I would add the 1 teaspoon Italian Seasoning and switch out breadcrumbs for Panko for that extra flavor! I would also double or triple both the seasoning and egg portions as well as there wasn't enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valri Miller"
},
"reviewBody": "Simple and absolutely delicious. Loved that they are baked, not fried. Will make again and sgain"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa"
},
"reviewBody": "followed other's suggestions to use whole egg, add oil to the wash. I also prepared with my new air fryer. Moist, tender inside with a bit of crunch on the outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derek Clements"
},
"reviewBody": "Made it the other night using seasoned breadcrumbs and they came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "run2eat"
},
"reviewBody": "I had made these before where the recipe called for dipping the raviolis in melted butter instead of egg whites/water so I mixed some melted butter in with the egg white/water. I placed them directly onto a cookie sheet and they came out perfectly crisp and golden without flipping them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sandra"
},
"reviewBody": "Do you need to par boil frozen ravioli? I did par boil them and they were chewy.. they certainly need much more seasoning !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "The pasta came out chewy but the outside was starting to burn, and there wasn’t much flavor. It was so tedious to prepare I won’t bother making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Excellent! Fresh Parmigiano Reggiano cheese is the only cheese to use. Use olive oil and flick on Ravioli with brush. Put olive oil on grate. Increase egg whites as needed. We used refrigerated assorted ravioli flavors. Watch for golden hue then complete. Serve with Mayo mixed with gochujang sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vsr"
},
"reviewBody": "So easy and sooooooo tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruben Martin"
},
"reviewBody": "Best ravioli I’ve ever eaten"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Morgan L. Adams"
},
"reviewBody": "Great idea, bad execution on my end. I'm not sure if it was because I used butternut squash ravioli but I think I should have cooked the ravioli first as the result was way to crunchy and barely cooked. Will try again and update."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth Currier"
},
"reviewBody": "Breading the ravioli made it very dry. I think what works about breaded chicken is that it's more often fried than oven-roasted; thus retaining it's moisture. Also, be sure to thaw your ravioli if it is frozen and not refrigerated. Overall it was alright but I probably wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Stierna"
},
"reviewBody": "Easy and fun to make. This recipie delivers delicious, crunchy pasta bites and full flavour served with a tasty bolonese and some extra grated Parmesan on top. I used heaping teaspoons of basil and oregano which added some extra punch. Make sure you allow for liberal amounts of sauce because some ravioli can be a little bit dry. Next time I’m going to add a teaspoon of garlic powder for the perfect dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Coburn"
},
"reviewBody": "These were so yummy. Everyone gulped them down in minutes and left the plate empty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "champy"
},
"reviewBody": "Pretty darn good!! What a quick, yummy appetizer for both kids and adults to enjoy. I followed the recipe but used the entire whipped egg vs just the egg white. I used panko bread crumbs and added some additional dried garlic to the break crumb mix. Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alan Harris"
},
"reviewBody": "Very tasty, but probably very fattening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Bakker"
},
"reviewBody": "easy and not greasy like fried !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn Elniski"
},
"reviewBody": "This recipe was super helpful! I made two servings of ravioli and used seasoned breadcrumbs instead of bread crumbs with the other spices added in. These could have used a hint of salt, but otherwise were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tonibear82"
},
"reviewBody": "I compared several recipes for these toasted raviolis and some said to precook the raviolis, and some (including this recipe) did not. I did not precook the raviolis and they were so tough my kids could not bite through them. So disappointed that these didn't turn out, especially since it was a little but time consuming to prepare these. Next time I will precook them and hopefully they will be as delicious as everyone else said they were."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Gauvin"
},
"reviewBody": "I used Italian bread crumbs. I also toasted the breadcrumbs before coating--it made the raviolis a little crunchier. I sprayed the cookie tray first, then sprayed the tops of the raviolis. We will definitely do these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babystace1985"
},
"reviewBody": "I made this for the hubby and I and we both loved it! Totally kicked our boring store bought ravioli up several notches. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Mccaskey"
},
"reviewBody": "These were rather simple to make, I made them with seasoned bread crumbs and added garlic powder but it still needs more seasoning... I didn't have a wire rack so i used tin foil instead and it worked good, they were nice and crispy. I put them in for about 22 minutes. I used Hunt's thick and rich Spicy red pepper and chili to dip them in and it gave it a great flavor that it needed. If i were to make them again I would just try season the crumbs more and give them alittle less time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Made as written and really liked it. The panko bread crumbs sound like a good idea to try. We like to have them with Italian Salsa that I posted on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "swhite"
},
"reviewBody": "They came out to burnt and to crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Vsmiles"
},
"reviewBody": "The flavor of the bread crumbs with the parmesan and spices was good, but rest of it was dreadful. I don't recommend this recipe. I made it exactly as it calls for and it was just too dry. They were beautiful to look at, golden brown and crispy, but the inside was so dry as it was on the outside.e. I will have to tweak the recipe or cook time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "turtleheart82"
},
"reviewBody": "Honestly, I found these to be pretty bland and tedious to make. I still think the recipe has potential, though. I think a bit of salt would have helped bring forth some of the seasoning. If I made this again it would be halved recipe or bigger raviolis because it took forever to batter an entire bag."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "These were not good. And I wonder if it was my fault. I bought the ravioli that is in the refrigerated section- the gourmet kind. Not the frozen kind. I made 2 kinds. Cheese and artichoke. The were so over cooked and dry. I was thinking I should have soaked them in water prior. Lots of work for no pay off. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DENISE13"
},
"reviewBody": "These were good, but I tweaked the recipe a little bit. I added garlic powder and salt to the breadcrumb mixture and used 1 tbsp. of Italian seasoning instead of just oregano and basil. Also, I used a whole egg and 2 tbsp. of milk instead of water. (Personal preference) Finally, I used whole grain bread crumbs and also some panko bread crumbs. The combination coated the ravioli completely and added more crunch. Immediately after taking out of the oven I sprinkled them with more freshly grated parmesan cheese and lightly salted them. They were not bland at all. With these changes, they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrissybaby"
},
"reviewBody": "I made this recipe and it came out just as I expected it to. It was great and the raviolis were very crispy. Just took a while to bread each ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Schwerdtfeger"
},
"reviewBody": "Just tried these with freshly made ravioli (just use gyoza wrappers, it's easy!). I think I should have cut my baking time (18 mins) or boiled my raviolis before coating them as they were really crispy on the outer edges, like potato chips. As others have mentioned, I used Italian style bread crumbs but no other herbs were added just for simplicity. But I did use fresh grated Parmesan (a must). Nice way to get fried flavor without the fat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SweetNov88"
},
"reviewBody": "Mine turned out very dry and hard. I have made other recipes like this one from this site and I will stick to those."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Awesome! Made these for a football party, they were a big hit. Super easy and tasty. Thinking I might try beef ravioli instead of just cheese. I also love that they're baked not fried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Wonderfully easy dish. I really enjoyed this once it was finished. It did have a few minor issues though, as I ran out of egg wash half way though and didn't have another egg so the next time I will use the whole egg. These did turn out beautiful and crispy but the corners turned out a little chewy on them. Other than that I had no complaints. These were not quite as good as I get at the restaurant but they were darned good nonetheless and I will fix this again. Thanks chefspecialty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ekmarz"
},
"reviewBody": "Very good! My family loved them. I did add some garlic powder to bread crumb mixture. Didn't have marinara, so I served with pizza sauce. Worked nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen A."
},
"reviewBody": "great alternative to the fried ones. I had to eat them fast though as they started to get really tough as they cooled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Cakes"
},
"reviewBody": "I have had this recipe in my box forever! So sorry I have not made them sooner! Omgosh!! These are TERRIFIC!!! I needed a side to go with pork chops, this was Perfect! I made a dip with crushed tomatoes, sour cream, parmesmean cheese and garlic salt. I used panco crumbs and boy were they Crunchy. Thank you Chef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "These taste like baked mozzarella sticks! I made these last minute and had to thaw the ravioli in some hot water. The egg wash makes them bake crispy. My kids and husband LOVED them. These would be a fun party favor with some marinara for dipping sauce. My husband already asked for me to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spatia1Anoma1y"
},
"reviewBody": "This is such an interesting way to cook ravioli! Like other reviewers I coated in flour, used the whole egg, and used panko instead of breadcrumbs which I seasoned with garlic powder, salt, italian seasoning and red chili peppers for a kick. Unfortunately I didn't have parmesan cheese or cooking spray. They did come out dry (maybe because of no cooking spray- I'll buy some next time) but the dipping sauce (I used chunky garden spaghetti sauce) made it a non-issue. Four stars instead of five because this isn't something I would make on a regular basis. Might use this recipe again for finger food for a party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "footballgrl16"
},
"reviewBody": "I wanted to make toasted ravioli without frying, so I gave this a chance. I brushed mine with butter and used seasoned breadcrumbs. These are pretty dry so make sure you have some dipping sauce. My toddler didn't much care for them, but i thought they were a healthier option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Gilmore Sather"
},
"reviewBody": "very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah Klee"
},
"reviewBody": "This was okay, but not a favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brittany Owens"
},
"reviewBody": "Even with marinara sauce, this was quite dry....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susanfitz"
},
"reviewBody": "So good! Used panko bread crumbs because that is what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancijean"
},
"reviewBody": "This was really good. I will be adding garlic powder to the mix next time. 15 minutes seemed long enough for cooking in my oven. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JENNY-REDS"
},
"reviewBody": "These were a nice change when I wasn't in the mood for just regular ravioli. I added garlic and onion powder and salt to the breadcrumbs. They were a little chewy but I think that was my quality of ravioli (cheap!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Do not pre cook pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Ugh! I just typed this once with enthusiasm then hit cancel instead of rate... I hope to express myself as well the second time. Thank you chefspecialty for the awesome recipe! The only changes I made were panko (didn't have bread crumbs) and baked mine on a foil-lined cookie sheet because I did not have a rack to put over. Mine were nicely browned and crunchy. I set the timer for 15 mins to check and just kept resetting and checking every 3 to 5 mins. until the right golden brown. I made homemade spaghetti sauce as a dip and truly enjoyed this pre SuperBowl. Next time, I plan to add garlic powder to the breading but I will not make any other changes. Now to hit rate instead of cancel.... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SaRai87"
},
"reviewBody": "So I totally didnt follow the recipe but I used it as a guide. I used a package of artichoke &amp; Cheese Ravioli from Trader Joe's, whole wheat bread crumbs with garlic salt and italian seasoning added, and 2 eggs with a splash of milk. I dipped the ravioli in the eggs, dipped in bread crumb mix and then re-dipped in egg and bread mixture. I oiled a baking sheet with EVOO and let it warm up in the oven (400F) for a minute, pulled it out placed the ravioli on sheet and baked for 20 mins. YUM YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DITTYBEAR"
},
"reviewBody": "These were okay. I used a whole egg for the egg wash. They puffed up quite a bit and some went hollow inside, but that might as much the fault of the ravioli as the baking. Interesting finger food though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jorgy Johnson"
},
"reviewBody": "Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenwalz"
},
"reviewBody": "These were wonderful!! I did add a little garlic powder and used panko crumbs. This will be a regular at my house! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sydneysfanclub"
},
"reviewBody": "I made a few changes, I used fresh Ravioli, Panko crumbs and the whole egg I also added garlic powder I only had to bake for 10 minutes total, I flipped them half way through Very yummy and crunchy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "Added 1/2tsp Garlic salt as suggested by others. Mae my own breadcrumbs with some slices of white bread. I \"quick fried\" these in some olive oil until they were just browned and then transfered them to the wire rack and finished baking them. Served them with some warm Marinara on the side for dipping..hubby loved them :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fowler"
},
"reviewBody": "I liked this method a lot but did as many of the reviewers said and ramped up the seasonings and used flour first. Next time I'll leave off the flour and just use an Italian seasoning blend (increasing original seasoning amount) and putting more than double the Parm for flavor. I really liked the method, though, and my kids enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SisterSarah"
},
"reviewBody": "GREAT!! I used panko and italian seasoning...super great!! Served as anti-pasta and at the end of the meal it's what everyone said was the best part!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Spencer"
},
"reviewBody": "Fantastic Recipe! The ravioli are golden brown and crispy, just as if they were fried. It only takes a small spray of cooking spray to have this effect. All the taste of fried food without the drippy grease! Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetgirl"
},
"reviewBody": "This was so good that we made it two times in one week. Used Italian seasoned bread crumbs and added additional seasonings for more flavor. Used a ground beef ravioli and dipped it in a four cheese store bought marinara. This was just as good as the ones I have had in restaurants and probably healthier because it was baked. Will absolutely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cookiegal"
},
"reviewBody": "I love Italian food, and was anxious to try this. It's kind of a lot of work, and the result was too dry for my tastes. The seasonings didn't add all that much flavor either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Morgan Meine"
},
"reviewBody": "This was ok. I was overall not impressed, however if I were to make it again, I would use some different raviolis than cheese (like spinach artichoke or sun-dried tomato feta). I would make sure to take them out of the oven as early as possible, so there is a little give in each bite. I did season the breading mixture which was a good idea. I think the grated parm kind of cheapened the flavor. We did eat them, but really wasn't for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jags0982"
},
"reviewBody": "I love these! I used to live near a store that had a frozen version of these and have not been able to find them after I moved away but they are even better homemade. It gives the ravioli good flavor and a nice texture. Like other reviewers I went ahead and used the whole egg and just used italian bread crumbs with a little parmesan added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrye"
},
"reviewBody": "They were good for what they are. Yes they are a bit dry- but we would rather have that than a greasy one. Besides a dipping sauce makes all the difference! We tried with alfredo &amp; a meat maranira &amp; prefer the meat sauce. Thanks for the 'lighter' version of this great pasta dish. Did turn mine as another reviewer sugg. &amp; they came out crisp &amp; delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VMSplus5"
},
"reviewBody": "Delicious. Added garlic powder. Used milk and whole egg with yoke. My 4 kids, a 6 year old and 4 yo triplets loved them! I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abapplez"
},
"reviewBody": "With all of the other great reviews, I have to believe we bought the wrong kind of ravioli because the cheese inside was dry, like ricotta. Used panko bread crumbs and followed the rest of the recipe exact. I will try again with a different brand/cheese filling because everything else worked as I had expected and the breading is good! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bretany W. Pilko"
},
"reviewBody": "This was good - not great. My kids loved it so that counts for a lot - me? I was bored. I used fresh ravioli's that were small - so they were bite size which I was worried about - but I think that it turned out good anyway. I will most likely make again and do more spices or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foodie Family"
},
"reviewBody": "I used italian bread crumbs so i didnt use the spices,used eggbeaters and milk for the egg and water.This is very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slowcooker"
},
"reviewBody": "Great recipe! Easy and good to do with help of kids. Tasted much like Jock and Jills when they had Fried Ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHARYL4"
},
"reviewBody": "Made these last night and added some garlic powder, as we love garlic. Dipped them in marinara sauce, so good !!! Thanks for sharing a great recipe !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LareinaK"
},
"reviewBody": "We liked this even though they were crunchy. I think it was because I didn't ahvethem thawed enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were good, not great. Easy and simple. The only thing that I did different was to spray the raviolis with olive oil cooking spray. I felt that without that step they could tend to be overly dry. Also watch them as they bake; they could overcook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen McCleane Mullin"
},
"reviewBody": "These were just ok, I think the next time I'll deep fry them. I think that the taste was not as good baked vs. fried. I know that I should stick to healthy, but this one just needed to take a bath in hot oil!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith"
},
"reviewBody": "I made these essentially as directed, but eliminated the oregano and basil (just personal preference),and added garlic powder and black pepper. I used homemade breadcrumbs, and a bit extra parmesan cheese. I served them with a sesame mayonnaise-based dip. We preferred them right from the oven. Thank you chefspecialty for taking the time to post this recipe. We will certainly be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raquel Teixeira"
},
"reviewBody": "A really great idea! They were like crispy pasta bites that were amazing dipped in a bolognese sauce. I recommend having some sort of dip sauce with this (bolognese/alfredo)and using quality ravioli. I added parm, Italian seasoning to my breadcrumbs and they came out great - not a single left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robbie33"
},
"reviewBody": "AMAZING!!! my kids loved it!!!!! I have never seen cleaner plates!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "singlemomcooking"
},
"reviewBody": "didn't turn out like I'd hoped. there were good but not what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyByrd"
},
"reviewBody": "These turned out really good, better than I expected. I made them as written and served them with marinara sauce for dipping. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DRMaddock"
},
"reviewBody": "They were a bit dry and the breading didn't stick well to one of he types of ravioli I used, but I still liked it. They'd make a great side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kitten"
},
"reviewBody": "I made these as an app to go with spaghetti night. I coated them with pankp bread crumbs. I think all the reviews said they tended to taste rather bland so, I raided my new erb garden and added everything not nailed down. basil, oregano, thyme, sage, rosemary, cilantro, onion and garlic powder and a healthy amount of Parmasaen cheese, We liked them. Next time I will adjust the heat because at the 15 minute mark they were pretty crispy. I made a second batch and shortened the cooking time and they were much better. Mine were not frozen maybe that makes a difference. We will definitely have these again. I would like to get a more Italian taste to them next time. We didn't worry about sauce, we just used the pasta sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "I used both cheese ravioli and beef ravioli to make this. I used the whole egg instead of just the white. I did not really like these. I think that these needed a lot more spices in it. The beef ravioli had a lot more flavor than the cheese ones. But my family really enjoyed it though so maybe its just me. I will make them again for the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Really good. I dipped in flour first, washed with a whole egg (didn't want to waste the yolk), then dunked in the crumbs (I used Italian seasoning and garlic salt in place of the basil and whatever else it called for), then sprayed with the cooking spray. This made for a nice, crispy coating and I still felt better eating them since they weren't fried (hey, you gotta save the calories where you can)! I think turning the ravioli would be much more trouble than it's worth and I would not recommend doing so. For dipping, I made an alfredo sauce and a pizza sauce and sprinkled everything with fresh parsley and parmesan. Fantastic! Thank you for submitting this recipe chefspecialty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADZELL"
},
"reviewBody": "These were tasty; I scaled the recipe down to make a snack for myself today. I too dredged my ravioli in flour before doing the egg wash (and I used my whole egg), then dipped in the bread mixture. Since the recipe didn't specify, I used Italian bread crumbs. Didn't have cooking spray, so I skipped that step. Maybe that was why the majority of mine puffed way up??? In any case, the ones that puffed up like that ended up being slightly tough, but tasty nonetheless. I dipped them in some leftover homeade alfredo sauce that from last night's dinner. They were good for a quick little snack... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Muffin Mom N Garlic Girl"
},
"reviewBody": "This was good but it has a lot potential to be made great. I added a little garlic powder to the bread crumb mix and since plain bread crumbs were not specified I used Italian and added the spices listed. I also spray with pam olive oil spray. The egg wash didn't look to be nearly enough but it was perfect. My recommendation is to use fresh not frozen ravioli and maybe brush EVOO on or add a bit to the egg wash so its not so dry. Lastly I highly recommend turning your ravioli on the rack half way through. The underside was still a bit soft and undone with the top was perfectly browned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SWEETJAM"
},
"reviewBody": "I made the recipe exactly as written only used panko bread crumbs instead of regular bread crumbs. If I made this again I would add A LOT more spice to the breading mixture. Fresh garlic, salt and pepper. I thought it was a little on the bland side even with the parm- and I added extra. I put foil on my baking sheet for easy clean up. Thanks for sharing. My daughter enjoyed this a lot."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/148794/breaded-toasted-ravioli/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
"name": "Pasta by Shape Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16855/pasta-and-noodles/pasta-by-shape/ravioli/",
"name": "Ravioli Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/148794/breaded-toasted-ravioli/",
"name": "Breaded Toasted Ravioli"
}
}
]
}
}
, "about": [
]
}
]