				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bread Machine Focaccia"
,"datePublished": "2019-04-03T23:28:21.000-04:00"
,"dateModified": "2022-12-04T12:25:33.000-05:00"
,"author": [
{"@type": "Person"
,"name": "TVESTA"
,"url": "https://www.allrecipes.com/cook/249251"
}
]
,"description": "It&#39;s simple to make bread machine focaccia dough, then brush it with oil, sprinkle it with fresh rosemary, and bake it until golden brown and delicious."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gif94R5_waghmBapP1pZWH-kkzo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5528137-bread-machine-focaccia-shaila-4x3-1-f24cfe19fe754847a5b716c85dd95e34.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bread Machine Focaccia"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "239"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "166 kcal"
,"carbohydrateContent": "25 g"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "99 mg"
,"sugarContent": "0 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup lukewarm water",
"4 tablespoons olive oil, divided",
"2 teaspoons chopped garlic",
"3 cups bread flour",
"1.5 tablespoons chopped fresh rosemary, divided",
"0.5 teaspoon salt",
"1.5 teaspoons active dry yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place water, 2 tablespoons olive oil, garlic, bread flour, 1 tablespoon rosemary, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pat dough into a 9x13-inch baking pan or a 12-inch pizza pan. Use your fingers to dimple the dough every inch or so. Brush with remaining 2 tablespoons oil and sprinkle with remaining 1/2 tablespoon rosemary. Cover with plastic wrap and let rest while the oven preheats, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Remove plastic wrap and bake focaccia in the preheated oven until golden brown, 20 to 25 minutes. Let cool for 5 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this but with a few changes. I baked it in my 12\" cast iron pan, I used a bit of extra oil in the bottom of the pan as well as what it called for on top. I can't eat raw garlic so didn't add it but used garlic infused oil for the entire recipe. I used bread machine yeast not active dry. (Active dry should be activated in water before using in a recipe and is usually not suitable for bread machine use. Bread machine yeast is more like instant yeast and doesn't require being activated in water.) I let it rise for 30 minutes in the pan instead of 15. I ended up turning it up to 450 for the last 5 minutes to get it extra crispy. I also sprinkled some course salt on top but it could've used more and could've used more salt in the dough itself as well in my opinion. Overall not bad with the changes I made but will have to keep tweeking for the best result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol Michael"
},
"reviewBody": "I found it dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My wife likes it, I basically like to try new recipes on flat breads for my wife. She loves hard tack breads in the morning. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenkay888"
},
"reviewBody": "Amazing bread. Next time I will put the sun dried tomatoes into the dough so they don't get so crispy but seriously, this is the best bread I have ever eaten!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Amazing. Cut back on salt if you like more cheese. I've made probably 6 of these loaves now. I also wait to put cheese on until 10 min after I put it in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slszmidt"
},
"reviewBody": "Very tasty. I recommend lightly spraying the 9x13” baking dish with Pam. It is not in the directions and the bread will stick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "travis highley"
},
"reviewBody": "New bread machine, this is my first recipe. Turned out perfect! I used the crushed garlic in a jar, and dried rosemary. Also, only had all-purpose flour, which is supposed to not rise as well but it did fine :D\n\nI dip the bread in a plate of olive oil, pepper, and parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CherryJam"
},
"reviewBody": "Fantastic. I am making it a second time today. I used dried Rosemary last time and it worked well. I baked it on a pizza stone since I had one. Not sure if it helped, but it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Krizmanich"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne Martindell"
},
"reviewBody": "Yes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PracticalRD"
},
"reviewBody": "I used 2 cups bread flour and 1 cup whole wheat pastry flour, and sprinkled with a little garlic salt. It was delicious, a hit all around!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roger"
},
"reviewBody": "I followed the recipe exactly and had great results using a quarter sheet pan. I grind some sea salt over the top before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alexandra Clarke"
},
"reviewBody": "I made this recipe with fresh rosemary and a few small changes. Changes I made: \n- 1 tsp of sugar to the dough to help the yeast (you can't taste this in the final product)\n- Some olive oil, salt and extra dried rosemary and Italian blend spices to the bottom of the pan before I put the dough in. \n- I let it rise a second time before baking. \n- I left it in the oven till it was starting to turn golden, before it had all turned golden brown I took it out and brushed it with more olive oil, then put it back in. It crisped up beautifully and has a gorgeous colour.\n\nThe texture and appearance are fantastic, but I found that the recipe was lacking flavour. I think it would be improved if the salt in the dough was doubled, and if you're using fresh herbs I would double the amount of fresh herbs at least. I will try the recipe again with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana"
},
"reviewBody": "This recipe works great! Thank you for positing it. I recently moved and lost the recipe I’ve been using for a decade. I’ve tried other recipes online with no success. This is the one I’m using now, for sure. It was a hit! :-) I followed the instructions exactly except for the addition of coarse sea salt on the top prior to baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandyhh"
},
"reviewBody": "Great recipe. For Chinese flavors, I made it with 3 tablespoons of sesame oil and chopped scallions in the mix, and brushed with 1.5 tablespoons of sesame oil before putting it in the oven. Baked for 22 minutes. Perfectly chewy with a thin crust. Served with a scallion ginger dip I made and it's scrumptious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Raines"
},
"reviewBody": "This is a go to, love it. Use whatever I have on hand and change up the cheese too\n\nHighly recommended"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joiedevie"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Galvan"
},
"reviewBody": "Is a very simple recipe and it came out very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "I always make small changes. I added lots of garlic and small amounts of applewood smoked bacon on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "This was super good and easy. When I checked on my dough it was very dry. I had to add water to the machine. I used dried rosemary, 1tsp and a tsp of zatar. On top with the oil, I added another tsp of zatar, pecorino and course salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent D Coffey"
},
"reviewBody": "Great base recipe. Like others, I sprinkled Kosher salt, rosemary, and parmesan cheese on top before baking. Brushed again in olive oil as I ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Starr Welch"
},
"reviewBody": "First time I made it followed instructions exactly. EXCEPT, I was out of Fresh Rosemary, but I had fresh Tarragon and used it. (one of my favorites anyway). It came out perfect. Now I will try it with Rosemary and will use whole wheat flour for a healthier bread. Makes a great sandwich bread the next day and toasted with my salad dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Perfect taste and texture. It made awesome grilled chicken sandwiches the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aurora73"
},
"reviewBody": "So easy and so many things you can add in to do or top this with or full this with!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "horusbedhetys"
},
"reviewBody": "Great for a first-timer! Excellent results"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GoBears!"
},
"reviewBody": "Good recipe, but nothing extraordinary. Mine stuck to the pan even though I greased it with olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Watson McKay"
},
"reviewBody": "I made this dough in the breadmaker and then baked it in the oven. Split it in half and built a pizza on it. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nykol Willliams"
},
"reviewBody": "Delicious! This was my 1st attempt and it turned out beautifully. I did take the suggestions from some of the other reviews (adding more herbs and salting with kosher salt. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Casablancaise"
},
"reviewBody": "This bread came out pretty good , with few changes. I make bread a lot, by hand, the traditional way my mom taught me or in the bread machine. I knew I could improve little on the recipe. I added 1 teaspoon of sugar to help the yeast do its job and help the browning during baking. I doubled the salt. I chose to use dried rosemary and garlic powder, so 1/3 the amount of both.\nAlso, the dough needed couple more tablespoons of warm water. I shaped the dough into 4 small oval breads. I topped couple of them with sliced black olives and sun dried tomatoes pieces. And the other 2 with thin slices of onion and sliced green olives. I sprinkled some dried oregano on top and some olive oil. I covered with plastic wrap and let the bread rise a second time for about 20 minutes before baking for about 15 minutes turning the broiler on the last 2 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Put some crushed garlic and chopped red peppers on top of loaf before baking. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roseink"
},
"reviewBody": "I am back again to make this wonderful focaccia. This time I am using locally grown and milled flour from our farmer's market. What a treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "newbiebaker"
},
"reviewBody": "Very good recipe but needed a lot more salt. I followed someone else's instructions to add pinches of kosher salt on top; apparently I didn't add enough. But the garlic and rosemary was very nice. Used the dough cycle on a Zojirushi bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angelika Weaver"
},
"reviewBody": "This bread turned out really nice. Very easy. Didn't have to change anything although I thought perhaps it would be hard and flat as there was not sugar for the yeast. Not so!! It's lovely!! I would add a little more salt to the recipe or maybe in the oil that is brushed on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naz"
},
"reviewBody": "Beautiful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "muslimahAnna"
},
"reviewBody": "This is a recipe I keep coming back to because it is awesome.\n\nWith the fresh garlic it really is nice, but if you skip this step it will still be nice. \n\nBe sure to cover and let sit like the directions say while preheating the oven it will absolutely make a difference in the texture of the bread.\n\n\nSo:\n\nPut all ingredients in bread machine, dough cycle, turn out on oiled pan, shape it delicately and press with fingers, cover preheat often you're good to go"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valleygirl"
},
"reviewBody": "My 11 yo son made this in our breadmaker. We didn't pull it out, flatten, brush and bake in the oven. We made the entire loaf in the breadmaker and didn't add the rosemary topping. Next time we will add even more garlic and rosemary. Dipped in a garlic and olive oil Italian Bread Dipper mix. It was amazing. Would make great sandwich bread too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danalee Harrison"
},
"reviewBody": "I let the dough rise twice as others had indicated. I put kosher salt with the rosemary on top of the bread once it was flattened and dimpled. We like a soft crust, so as soon as I took this loaf out of the oven I brushed it with olive oil. It's one of our favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sgt. Prepper"
},
"reviewBody": "Sprinkled cheese on top. Also added an egg to the dough. Next batch I will let it rise a little so they will make good sandwich buns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vickylou"
},
"reviewBody": "This is lovely and easy! It behaves as described and works well with any topping I have tried. I switched to garlic powder as suggest by another reviewer and we all liked the even spread of the garlic flavor better than fresh. Thanks for a great recipe for any day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Graham"
},
"reviewBody": "This recipe turned out well, except I made a few changes. I made it into a large sub instead of rolling it out. Just after the water and salt were added I added 1 tbsp. of dry Italian seasoning. Then the flour and yeast. Once the dough was done I put it on a large cookie sheet, let it rest and sprinkled it with Reggiano parmesan. Bake at 350 for about 20 minutes, brushed with melted butter. Back in for another 5 minutes. Gone in no time.. A friends boyfriend actually cut the loaf she made in half, scooped out some of the inside and filled it with mustard, mayo and cold cuts.... Was so good his lunch was stolen the next day..... Lol..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin Owens"
},
"reviewBody": "This recipe is missing an ingredient - some form of sugar - about a teaspoon, and a step for the dough to rise in a warm place for an hour. And, I bake it @ 450 degrees for 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen M Thom"
},
"reviewBody": "Maybe I did something wrong. It was pretty tough in the bread machine, and almost as tough when it came out of the oven. I added some sea salt to the top as some people suggested, but found it to be too bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Really good and I followed the recipe exactly. Next time I'll brush a bit more olive oil on top and sprinkle with sea salt or maybe some parmesan since it was just a tiny bit under seasoned for my taste. The bread was perfectly baked after 25 minutes but I would have liked it a bit more brown on top but that isn't a deal-breaker. Love anything with rosemary in it and this recipe is so, so easy using a bread machine. Thanks for posting this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Croton Cher"
},
"reviewBody": "I used EVOO and didn't skimp on the garlic but for some reason I felt like this needed more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blueberry"
},
"reviewBody": "Yum, this was so good, and so easy to make. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "Oh yum, this was so good! I have made a few focaccia recipes from the site and they are just way too soft. This was more dense and closer to what I know as focaccia bread. It was so super easy in my bread machine too. I have a Zojirushi, if that helps. I used the dough cycle as suggested. My only change was using 1/3 of the suggested rosemary. I had fresh that I dried, which I find stronger tasting. I very finely minced it with a knife to spread throughout. I sprayed a little olive oil on a piece of parchment and spread it out on that on a sheet pan. When I did the topping, after adding 1 Tblsp of olive oil it seemed like enough so that is what I used. I added about 1/4 teaspoon approximately of salt to the 1/2 teaspoon of rosemary as I minced it, for the top, and then lastly sprinkled about 2 Tablespoons of finely grated parmesan on it before baking. It took 24 minutes to finish baking. TY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marty"
},
"reviewBody": "good - but not as crisp as I would like - it was a little too doughy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShirleyMay"
},
"reviewBody": "Would have given this a 5 star rating, but the bread had a hard crust, which is not very focaccia-like. Possibly it should be baked at a lower temp, or given more of a chance to raise in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nbting"
},
"reviewBody": "This bread is really easy to bake &amp; delicious. However I find it a little dense when I tried to make sub sandwiches with it although I increased the yeast to 2 teaspoons hoping it will rise more. Will definitely continue to make this but perhaps not as sandwich bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lloyd Blackmon"
},
"reviewBody": "Made this last night and it tasted great. Easy to make and I followed the recipe as written except I used dried rosemary vs. fresh.\nWill make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chandra"
},
"reviewBody": "This was super easy and delicious. I baked it in two 9-inch round cake pans for 25 minutes and it came out perfect. I didn't grease the pans and had a difficult time removing the bread. Next time I'll spray with Pam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Add 1 t sugar to make it rise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MamaFrog"
},
"reviewBody": "This had a great flavor, but mine turned out hard as a rock. I must have overcooked it, but it never browned on top. Might try again, but not sure I'm up to cleaning the mess out of the bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mrs Griswold"
},
"reviewBody": "Looks and smells fantastic. Easy to do up...however, could not get it out of the pan. I have re-read the recipe..doesn't say grease or oil or lay down parchment. I was planning on making sandwiches for our ride tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Macca"
},
"reviewBody": "Very new to bread making - tried this recipe - LOVED it !!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "white033"
},
"reviewBody": "This very well might be the best bread I've ever made and I've baked a lot of bread...I sprinkled a little sea salt on the bottom of the dish and the top of the loaf. Phenominal!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Teresa Hoffman Johnson"
},
"reviewBody": "This was the second Focaccia bread recipe I've tried. The first turned out perfect, so I'm not sure why I felt the need to try another! The bread was edible, and not bad but didn't taste like the Focaccia breads we are use to. It was much to flat in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coldfusionPaul"
},
"reviewBody": "another alternative is to cover the dough with black olives (sliced in half) before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "feinicstine"
},
"reviewBody": "Awesome recipe! The ability to start it in the bread machine is fantastic. I'm not patient enough to knead dough myself. Turns out perfectly every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TariM"
},
"reviewBody": "Comes out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette Kempton McLaren"
},
"reviewBody": "This is a great recipe. I think, as one reviewer suggested, that the recipe intends for you to use the pizza dough cycle on the bread machine, then press into pan and allow to rise before baking. The suggestion of adding a little seasalt on top with the olive oil and rosemary prior to baking is a good addition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missfame"
},
"reviewBody": "This is a spectacular bread recipe! My whole life I've been intimidated by yeast... but NO LONGER! I read the reviews &amp; heeded some advice. This is what my final recipe looked like:\n1c. warm water, 3 T. olive oil, 3 c. all-purpose flour, 3/4 tsp. salt, 1 tsp. minced fresh garlic, 1 tsp. garlic powder, 2 tsp. dried rosemary, 1 tsp. Italian seasoning, 1 T. sugar, 2 1/4 tsp. yeast. Put into my bread machine according to the mfgr recommendations, used the dough setting. Heated the oven to 400. Shaped the dough into a flat round on a metal pizza pan. Used a wooden spoon handle to poke holes throughout the dough. Brushed 2 T. olive oil over the top, sprinkled another 1T. of dried crushed rosemary on top, sprinkled coarse ground sea salt on top &amp; shredded a little bit of stinky cheese (something with Italian flare) on top of that. Baked for 25 minutes. Cut it into wedges and enjoyed the HECK outta it!!! It is so lusciously good! Try it, you'll love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bridget9903"
},
"reviewBody": "I had to add double the asking amount of rosemary. The other tip someone gave of using garlic powder really worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Mower Dodge"
},
"reviewBody": "This was really good. It wasn't dried out at all. In fact it was nice and fluffy and appropriately moist. I added some Italian seasoning, as recommended by several reviewers, as well as about a tablespoon of grated parmesan to the dough. I also added some fresh basil, parmesan, kosher salt, and black olives along with the olive oil and rosemary on the top. My husband, who is leary of focaccia because it can be dry and too hard, ate four pieces. I'm guessing it got his seal of approval! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney1c"
},
"reviewBody": "This is a regular in our house. I always sprinkle with course sea salt, in addition to the 1 1/2 teaspoon of rosemary, before baking. I definitely recommend trying this addition. I've also found that dried crushed rosemary is easily swapped for the T fresh rosemary in the dough (Sometimes my rosemary plant needs a break, lol). But fresh rosemary is best for topping the bread before baking. Great easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Yarde"
},
"reviewBody": "Excellent bread! The only change I made was to add Italian seasoning. I'm going to try this as a pizza dough next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "I found this recipe this morning and printed it and already made it for our lunch. Wonderful recipe but we don't like rosemary so I used a little coarse salt and some Asiago cheese on top. It has a little to much raw garlic taste so next time I will use just a little garlic powder but I definetly will make it again. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "historygal22"
},
"reviewBody": "I've made a lot of homemade bread but my mom declared this her favorite! I add extra garlic and sometimes switch out some of the rosemary (not a big fan) for basil. My only tip would be wait to start pre-heating the oven until the bread is in the pan so that it has time to rise before baking. Also as others have recommended a sprinkle of kosher/sea salt on top really adds to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "Wow! This tastes great and is so easy. I made it to go with the \"Gourmet Chicken Sandwich\" on this site. The dough came out perfect in the bread maker and went easily into the 13x9 inch pan. In addition to olive oil and rosemary (which by the way, I used dried because I didn't have any fresh), I sprinkled kosher salt and parmesan cheese on top. I will definitely make this again. So quick and easy. Am looking forward to serving it with a little olive oil and rosemary as a quick appetizer some time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "Wow! This tastes great and is so easy. I made it to go with the \"Gourmet Chicken Sandwich\" on this site. The dough came out perfect in the bread maker and went easily into the 13x9 inch pan. In addition to olive oil and rosemary (which by the way, I used dried because I didn't have any fresh), I sprinkled kosher salt and parmesan cheese on top. I will definitely make this again. So quick and easy. Am looking forward to serving it with a little olive oil and rosemary as a quick appetizer some time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Earwood"
},
"reviewBody": "5 stars all the way! This was amazing bread! Only thing I did different was to give it a good 30 minutes rise time once out of the machine as getting it out and stretching it caused the bread to go flat. I just laid plastic wrap over it and microwaved a kitchen towel for about 20 sec. to heat it up and help warm the bread. Not sure if it was necessary but my bread did rise nicely. This was a home run for me. Can't wait to try other herbs and veges. Update...I made a plain version of this (minus herbs and garlic) and placed the dough in a regular loaf pan, let raise about 25 minutes and baked at 375 for 25 minutes. Husband said it was my best loaf of bread yet! This recipe is versatile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tarao479"
},
"reviewBody": "Pretty good recipe, but I think I might tweak with the ingredients to see if it improves the texture or taste.\n\nNot bad for a first attempt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "My husbands words were \"This bread is Awesome!!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diana55"
},
"reviewBody": "Really good and easy make!!! I will be making this all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahAnn"
},
"reviewBody": "Pretty good. I topped mine with just halved kalamata olives, and liberally brushed it with olive oil both on the pan and on top before I baked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JavaMama"
},
"reviewBody": "This was wonderful!! I divvied up the dough into 8 mini loaf pans, allowed to rise a second time, and baked about 18 minutes. Perfect size for sandwiches, with a nice crust all around. Definitely sprinkle the top with kosher salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "baking wifey"
},
"reviewBody": "Four of us ate the whole thing with our spaghetti last night! I made the recipe as recommended except that on the top I brushed with olive oil and sprinkled with italian seasoning and parmesan cheese. This was also really easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mishamouse"
},
"reviewBody": "My husband doesn't like rosemary so I substituted Italian Seasoning (blend of dried herbs). I also used regular flour plus 3 Tbs of gluten in lieu of bread flour. Before baking, I brushed the top with olive oil and sprinkled with parmesan and kosher salt. Delicious! Especially dipped in oil and balsamic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "garm"
},
"reviewBody": "Very good and easy. I baked it on pizza stone, takes a little longer, but adds a little more crunch to crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "purpleheather"
},
"reviewBody": "Awesome results, followed recipe exactly. Really nice texture to the bread, and I baked mine in my Pampered Chef Deep Dish Stoneware...so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Used this to make pizza crust and it worked like a charm! Made exactly as written, except I omitted the rosemary and did have to add a little extra water to the dough while it was mixing. I can't wait to try this as focaccia! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbiedol1"
},
"reviewBody": "This is a fabulous bread! I shaped mine after the dough cycle, then let it re-rise for 30-45 minutes. I sprinkled grated parmesan on top after brushing on the olive oil before baking. I think it has a fabulous flavor as is, if you like a more \"herby\" flavor, add a pinch of italian seasoning in addition to the garlic and rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luvacook"
},
"reviewBody": "I was not impressed with this bread, but my family devoured it. For the ease of making it I would have given it 5 stars and I thin my family would also. As far as my own taste I would give it just 2. I did not think it had any flavor, kind of like a rice cracker. added cheese would help. It is in my recipe box and would have got rid of it, but for the fam's sake will fix it again, probably adding some cheese to the machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie B"
},
"reviewBody": "Delicious and easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelanieG"
},
"reviewBody": "I added a couple of tablespoons of sugar with the yeast (the second time i made this recipe) and found i got a bit more rise out of it. \n\nFresh herbs make this, I added a bit of fresh oregano to mine, topped it with a bit of olive oil and rosemary (as described), some cracked sea salt and shredded parmesan...freaking awesome! \n\n(have made it 3x now...no issues, just have to be sure it rises once before you start the shaping process, and it shapes better if you let it rest for about 5-10 mins after the 2nd kneading is done)\n\nNext time i'm going to spike the top with roasted garlic cloves as well. I've no doubt it will be just as good as the first few times. Thanks so much. \n\nPS...this was the first recipe i tried with a bread machine and it worked, so it has encouraged me to try more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babyblue"
},
"reviewBody": "Wonder texture and yummy flavor! I did add about 1 tsp of italian seasoning to the dough. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie Clarke"
},
"reviewBody": "Turned out awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was kind of dry. I'll search for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate Fisher"
},
"reviewBody": "I am assuming I did something wrong. For me the texture was really dry. The taste was fine but the texture not soft and tasty like I wanted. Have to try one more time and see what happens. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skrike"
},
"reviewBody": "This recipe is perfect just the way it is! As a variation I did top with parmesan cheese, but it's not needed. YUMMY:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mkd"
},
"reviewBody": "Just so-so. Can't say my family or myself found this to be very good. It was ok but doubt I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail Porter"
},
"reviewBody": "This recipe is really good. I made it exactly as written except I sprinkled coarse sea salt over the top before cooking (I recommend doing this). This bread really did come out perfect, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NANCY T"
},
"reviewBody": "This is a GREAT recipe. I tried one other yesterday, and it was not very good, very dry, and not much flavor. On the other hand this one is very nice, I used a bit more garlic and did add some kosher salt to the topping, it was far and above the other one, is now all gone!!! Did not use the bread machine, but put everything in the Kitchenaid mixer and kneaded it that way for about 5 min. Also used Spelt flour, since I have a gluten intolerant kid, but she can have Spelt. Was really GREAT. Will surely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tara S."
},
"reviewBody": "Yum, yum, yum! This is incredible bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsteeves"
},
"reviewBody": "Amazing! Followed to the letter, and it came out perfectly. Crispy crust, soft interior. I meant to take a picture, but we couldn't help devouring a big hunk of it with olive oil and balsamic vinegar as soon as it was cool enough to cut. Will absolutely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather C"
},
"reviewBody": "This is wonderful focaccia! I was so pleased with the texture of this and the flavor was great too. No changes were needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "3MCMRMOM"
},
"reviewBody": "just so-so. needs more salt and the texture was too fluffy, not chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GinaMB"
},
"reviewBody": "This recipe was tasty and simple! I used it as a pizza crust. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Thompson"
},
"reviewBody": "This turned out AWESOME! I didn't have fresh rosemary. So I used the same amount of dried, crushed rosemary, and I doubled the garlic. Served it warm with olive oil and fresh pepper for dipping! Addictive! I used the leftovers to make sandwiches today. Most delicious sandwich I've ever eaten! I'll make this again and again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25213/bread-machine-focaccia/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
"name": "Flat Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25213/bread-machine-focaccia/",
"name": "Bread Machine Focaccia"
}
}
]
}
}
, "about": [
]
}
]