				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Broccoli Salad with Red Grapes, Bacon, and Sunflower Seeds"
,"datePublished": "2020-06-18T23:54:54.000-04:00"
,"dateModified": "2022-09-05T14:07:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Coastal Roots"
,"url": "https://www.allrecipes.com/cook/3531813"
}
]
,"description": "This traditional broccoli salad with red grapes, bacon, and sunflower seeds is a nice combination of sweet and savory. Perfect for summer picnics!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/l9Giz1rDRMSvAWhKb1vDuXOwdPw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1013186-edfa2a2d65894e3bb96ebc41f2e39c54.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Broccoli Salad with Red Grapes, Bacon, and Sunflower Seeds"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "89"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "327 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "21 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "382 mg"
,"sugarContent": "8 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"8 slices bacon",
"0.33333334326744 cup sunflower seed kernels",
"1 large head broccoli, cut into bite-size pieces",
"1 cup seedless red grapes, halved",
"0.33333334326744 cup diced red onion",
"1 cup mayonnaise",
"3 tablespoons apple cider vinegar",
"2 tablespoons white sugar",
"ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Crumble 7 slices of bacon; mix with sunflower seeds in a resealable plastic bag and set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine broccoli, grapes, and onion in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Whisk mayonnaise, vinegar, sugar, and pepper together in a separate bowl; crumble remaining slice of bacon and fold into dressing."
} ,{
"@type": "HowToStep"
,"text": "Pour dressing over broccoli mixture; toss to coat evenly. Cover the bowl with plastic wrap and refrigerate for flavors to blend, about 2 hours. Sprinkle bacon-sunflower seed mixture over salad before serving; mix well."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mallori"
},
"reviewBody": "Will make again.\nFinely, finely diced red onion, so it was the size of the sunflower seeds.\nGood flavor. Maybe could reduce amount of mayo because makes a lot of dressing, but vinegar and sugar were sufficient.\nBroccoli got a bit soft/chewy, lost some of its crunch on subsequent days. Not sure how to fix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi"
},
"reviewBody": "Fantastic flavour combination, great crunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lae726"
},
"reviewBody": "I first tasted a similar salad when I traveled to North Carolina. My friend made the salad with broccoli and grapes. We poured the sauce over it. This version is now one of my go to's at my house. I did change 2 items. I omitted the onion and sunflower seeds. I added sliced almonds instead and it's delicious. I adjust the ACV to taste. Some like it heavier and some very light. Love the bacon and almonds. Just the right crunch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wmmonnie"
},
"reviewBody": "This is a superb recipe and it is in constant demand from family and friends. I have shared copies of the recipe with all my foodie friends. It is somewhat labor intensive with the chopping of the broccoli and onions plus cutting the seedless grapes in half. But my oh my the results are FANTASTIC!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Decina"
},
"reviewBody": "This salad is part of my summer sides ... everyone (even those who don't care for broccoli love it) raves about how delicious it is. really good ingredients!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael J B"
},
"reviewBody": "Assembled recipe as printed except replaced red grapes with fresh blueberries. Big hit with BBQ guests and as to legitimize the compliments many requests for recipe. Thanks Allrecipes and all contributors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Berkheiser"
},
"reviewBody": "I made this recipe as written with no changes. The salad is fabulous! Thank you for sharing this wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kazoom"
},
"reviewBody": "This is one of my favorite salads. One change I always make to it is rather than bacon, I chop up some hard-smoke salmon. I live in Alaska, so it's probably easier for me to find than people in the rest of the country, but it's a great substitution for people who don't eat pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Cairns"
},
"reviewBody": "Brilliant salad that gets better each day .., if there’s any left"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Smith"
},
"reviewBody": "This salad was delicious, crunchy, refreshing, quick and easy.I made on one of our hot evenings, so no cooking involved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Truehart"
},
"reviewBody": "Delicious! I used half the mayonnaise and no sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "So yummy and a lot like the one I love at the grocery store. What I love the most is you can sub or omit anything, except the broccoli, mayo, and vinegar, and it’s still great. I’ve made it with cranberries or raisins instead of grapes, sausage or pepperoni instead of bacon, and any kind of seeds or nuts I have on hand!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smileyiowa"
},
"reviewBody": "A fresh tasting salad with nice texture. The vinegar is not overwhelming. When you let the flavors marinate the result is tangy but not overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya"
},
"reviewBody": "My family loved this! My Dr had told me to eat broccoli more because of it’s anti-inflammatory properties. Problem isn’t I have hated it my whole life. Tasted bitter to me. But this salad changed that! I subbed red vine vinegar for the other kind and a little less red onion but other than that......this entire salad was eaten in one night so I turned around and made it again the next night. And yes, if it sits overnight in the fridge, it gets even better! This will be regular at my house now. (BE sure and keep bacon and sunflower seeds separate till right before serving.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Foster"
},
"reviewBody": "Very Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Mills"
},
"reviewBody": "I used this for a guideline but wanted to make it lighter. Subbed fat free plain greek yogurt for all but 1/4 cup mayo, used dried grapes (because I needed to use them) , green onions, no bacon, and stevia. Same basic flavors (except the bacon) and a bit healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Veness"
},
"reviewBody": "Not going to use so much sugar next time,and will use salted sunflower seeds.Been making it for years but I forgot the recipe.Hubby luved it anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swamprat"
},
"reviewBody": "Made it as is and it was great! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "D.L. Harless"
},
"reviewBody": "Ok hard to give anything that's mainly broccoli 4 stars even but this does it. I made a few changes to make it even more healthy, changing to yogurt instead of mayonnaise, honey VS white sugar and added raisins. Oh ya and I left out the bacon. Sinful almost I know but it's a lot healthier and faster to make. This is great for men past 30 to block estrogen. Fast and easy to make and take anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ccc8.17"
},
"reviewBody": "This was awesome!! Made it for a party and they devoured it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna"
},
"reviewBody": "Delicious! I substituted roasted pumpkin seeds for sunflower seeds and it turned out great! I brought it to a neighborhood cookout and it was all gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "A friend just gave me a recipe similar to this and asked me to make it for him. I checked out AR for tips and what not on prep. They are all basically the same views...which is saying that it is a good solid recipe! They vary with slices of bacon, amount of mayo, what seed, sugar, kind of vinegar, etc... So basically like any salad add more if you like it and less if you don't! Thank God for Mothers !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grm Becky"
},
"reviewBody": "I used broccoli slaw and pecans. This salad was a big hit and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laverne Hankins"
},
"reviewBody": "Excellent. I forgot to buy the grapes; used raisins. Will make it again. A great dish for singles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneInSTL"
},
"reviewBody": "I had been looking for a great Broccoli Salad recipe and found it in this one. The only changes that I made were that I added some extra mayo (the apple cider vinegar flavor seemed stronger than expected) - and I added some golden grapes and some chopped pecans to fill things out a bit (since I had a little extra sauce). I also let it marinade overnight. It was perfect for our Mother's Day BBQ and will be a staple throughout our Summer cookouts for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GSD"
},
"reviewBody": "I did not have the onion or grapes but it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marilynm66"
},
"reviewBody": "Super easy and super delicious. A little time consuming but so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary L Rakas"
},
"reviewBody": "Loved it! I added some roughly grated cheese to it - turned out excellent. Sorry, didn't get any pictures because it was devoured."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicia Hernandez"
},
"reviewBody": "Cannot make this enough, I Total Hit at every gathering. I also used powdered sugar since I was out of regular sugar, just be careful. LOVE IT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dreama Butler"
},
"reviewBody": "I have made this a few times and its always a hit! Instead of regular sunflower seeds, I use some that are \"butter toffee\". I find these at Dollar General (for $1!!) and they add a great sweet, brulee-type flavor to the salad. This year I am using \"Cotton Candy\" Grapes, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessie D"
},
"reviewBody": "this was good,but I'll add half the recommended amount of vinegar to it next time. thank you !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YankeeGal"
},
"reviewBody": "Making for a 2nd time; brought to work potluck and it was gone in no time. Left out bacon for vegetarian coworkers and I didn't miss it. This was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AzB"
},
"reviewBody": "Made it for the first time and it is very easy and tasty as heck. I used half of the large bag of pre-cut fresh broccoli, six slices of bacon instead of eight, used pecans instead of sunflower seeds and real mayo. Mixing the pecans in with the warm bacon, warms them up &amp; mixes their flavors, so I would not recommend using store-bought bacon bits. I'm reading comments about skipping the red onion, but I would say to just cut them smaller...the red onion adds so much to the overall success of this dish. It was a hit and my picky-eater son polished off the left-overs for breakfast this morning. Next time I'll initially cut back on the sugar then add to taste, but I plan on making it again tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Sharlog"
},
"reviewBody": "Easy to make &amp; delicious. I think i's just cut back on the sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndi"
},
"reviewBody": "I made this twice. The first time was a disaster and I ended up throwing a lot of it away but the second time was excellent. I don't know what I did the first time but the sauce was very runny. Instead of coating the broccoli, it collected at the bottom of the bowl. The broccoli was very bland. Take 2: I refrigerated the sauce overnight which resulted in a thicker consistency and I also only added enough sauce to coat the broccoli. Much better! Another change is that I didn't blanch the broccoli first. Ugh. Don't do that! The broccoli turned yellow overnight in the fridge and hmm, it just occurred to me that the extra moisture from cooking and rinsing the broccoli might have been what made the sauce runny. I also added a very small amount of red onion the second time around because IMO a little onion goes a long way in a cold dish like this. Lastly, despite my best efforts to wait until the last minute to buy grapes and carefully hide them in the fridge, it was not enough to prevent my children from laying waste to the entire bag in record time. So I substituted craisins instead. Grapes would probably be just fine but now I'm in love with the craisin version. It was amazing and I got lots of compliments. There it is. I hope someone else can learn from my mistakes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amar"
},
"reviewBody": "Love the dressing, made everything as is except I left out the onions (cannot stand them). Popular with the family, so delicious and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookieB"
},
"reviewBody": "Followed recipe as written. Fabulous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emsjas"
},
"reviewBody": "I got this recipe from a coworker at an office BBQ and fell in love. I doubled the amount . In doing so I found that it was saucy. I would only recommend that if you do DBL the recipe, to visually judge how saucy you like as it does not absorb into or thicken. I added every amount for this round as a test run. Kept the recipe exactly to the letter with the exception I used Light Mayo.... Just delicious!!!! Will be making again, makes a great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This is delicious! I didn't know broccoli salad could get any better! I was out of sunflower seeds so added the only seed or nut I had, pistachios. I also made another half batch and added cauliflower to use up. Both were tasty and easy! Keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roanne Brell"
},
"reviewBody": "I substitute red wine vinegar for the cider vinegar and marinate the salad in tight container in frig by turning over and allowing the dressing to permeate the whole salad, upside down.\nGood! Husband loves it, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Young"
},
"reviewBody": "Made this for a bring a dish potluck. Even though the directions state to not substitute anything for the grapes, I used apples. Turned out awesome, with zero left overs...and by no leftovers, I mean someone scraped the bowl clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Rutter Anderson"
},
"reviewBody": "So delicious &amp; different! It was well received by my husband &amp; my dad who are both a bit particular about salads. I made mine with a 50/50 mix of green &amp; red seedless grapes. Making it again today, only a double batch as the last time I made it we all had one good sized serving &amp; there was only enough leftover for one more serving lol. Try this, it's tasty. My tip is to chop up all the bacon before you cook it so you don't have to fight crumbling the fattier pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "We used pecans instead of sunflower seeds and subbed honey for the sugar in the dressing. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathie Morrison"
},
"reviewBody": "This is colourful, healthy and delicious! Impressed company!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Laing Drader"
},
"reviewBody": "Made this for supper tonight - everyone loved it and went back for seconds - no leftovers at all! Very flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "decatur foodie"
},
"reviewBody": "I love this salad just as it is, however one time I only had 3/4 cup of mayo so finished the cup with ranch dressing. We loved it, so I always make it that way now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Tripled this for a wedding luncheon. It was a hit and had multiple requests for the recipe. Only change I made was using sliced almonds and roasted them to bring out the flavor in place of the sunflower seeds because its what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Leys"
},
"reviewBody": "Added a little shredded cojack"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn McCowan"
},
"reviewBody": "I love it!!! You have save me lots of money. I have been going to a coffee shop just for this salad. lol Thanks a lot!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suth3rng1rl"
},
"reviewBody": "This is really good.I use white seedless grapes instead of the others but other than that I followed the recipe.I found this tastes better the longer it sits in the fridge :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronda Holcomb"
},
"reviewBody": "Awesome! Former co-worker brought this to a pot luck years ago and I never got her recipe! It was awesome and I have looked for this for a while! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mconnie6"
},
"reviewBody": "I used chopped smoked almonds instead of sunflower seeds and it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Fritchie"
},
"reviewBody": "Lovely, I substituted 3/4 C greek yogurt plus 1/2 c. mayo, since I used a little bit more broccoli, then I added about a TBSP of pomegranate balsalmic vinegar to punch it up a bit.Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I omitted the onion, but otherwise followed the recipe. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie V"
},
"reviewBody": "Yummy and easy to make. This dish is always a hit as a take along side dish. Substitute a raspberry vinaigrette dressing for the mayonnaise if it has to sit out for any length of time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Best broccoli salad ever! I was hoping for leftovers, but my husband cleaned out the bowl! I didn't nor wouldn't change a thing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Del"
},
"reviewBody": "The first time I made this I followed the directions exactly. The second time I diced the bacon before cooking it, Then I mixed everything together and put it in the fridge overnight. We all like it better this way. We all thought it had more flavor. I added a handful of chopped Walnuts too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christie"
},
"reviewBody": "My family and coworkers love this salad! To make it a little healthier, I double the broccoli and replace 1/2 the mayo with plain Greek yogurt. Fantastic:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scotdog"
},
"reviewBody": "Yum, I subbed dried cherries since I didn't have any grapes. No onion, so I left it out. Added slivered almonds and a sharp white cheddar. Easy to play around with and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asdda2003"
},
"reviewBody": "I love this recipe. The only thing I changed was that I added Shredded Cheddar Cheese. It was absolutely delious!! Definately try it if you want a healthy tasting, sweet and salty salad!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy in Disguise"
},
"reviewBody": "Everyone loved this recipe! I am making it again tonight and will be taking it to the next family get-together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Mellett"
},
"reviewBody": "This recipe is jsut what I was looking for!! I had everything on hand and I also added the almonds and a handful of grated cheddar. Delish!! Thank you for submitting this &amp; sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mskinue"
},
"reviewBody": "Great salad, I loved it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232720/broccoli-salad-with-red-grapes-bacon-and-sunflower-seeds/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
"name": "Vegetable Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15103/salad/vegetable-salads/broccoli-salad/",
"name": "Broccoli Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232720/broccoli-salad-with-red-grapes-bacon-and-sunflower-seeds/",
"name": "Broccoli Salad with Red Grapes, Bacon, and Sunflower Seeds"
}
}
]
}
}
, "about": [
]
}
]