				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Broccoli, Rice, Cheese, and Chicken Casserole"
,"datePublished": "2020-04-23T06:18:24.000-04:00"
,"dateModified": "2022-10-26T07:26:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Heather"
,"url": "https://www.allrecipes.com/cook/24323663"
}
]
,"description": "This chicken broccoli rice casserole with creamy soups and cheese is easy to prep for a comforting meal-in-one casserole that can be made ahead."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UP9Vkfkfi-UQs8Im9QQa8ulhmpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3878110-d597ab41f7ed457180d77fd71cf3e51f.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1886310389001",
"description": "See how to make the ultimate cheesy one-dish broccoli and rice casserole.",
"duration": "PT4M28S",
"name": "Broccoli, Rice, Cheese, and Chicken Casserole",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/60e9f1d6-b17b-435b-a0c3-4a1bd46cfe6a/2146a6be-f03e-40be-bdf0-fdbce2d9bafe/1280x720/match/image.jpg",
"uploadDate": "2021-06-23T11:02:03.037-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Broccoli, Rice, Cheese, and Chicken Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "1100"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "756 kcal"
,"carbohydrateContent": "83 g"
,"cholesterolContent": "110 mg"
,"fiberContent": "3 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "1642 mg"
,"sugarContent": "8 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups water",
"2 cups uncooked instant rice",
"2 (10 ounce) cans chunk chicken, drained",
"1 (16 ounce) package frozen chopped broccoli",
"1 pound processed cheese food, cubed",
"1 (10.75 ounce) can condensed cream of mushroom soup",
"1 (10.75 ounce) can condensed cream of chicken soup",
"1 cup milk",
"0.25 cup butter, cubed",
"1 small white onion, chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring water to a boil in a medium saucepan; stir in instant rice, cover, and remove from heat. Let stand for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Mix prepared rice, chicken, broccoli, processed cheese, condensed mushroom soup, condensed chicken soup, milk, butter, and onion in a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UP9Vkfkfi-UQs8Im9QQa8ulhmpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3878110-d597ab41f7ed457180d77fd71cf3e51f.jpg"
}
]
,"text": "Bake in the preheated oven until cheese is melted, about 30 to 35 minutes. Stir halfway through cooking to help cheese melt evenly."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wendy"
},
"reviewBody": "I used a rotisserie chicken, cream of celery soup and the cream of chicken &amp; mushroom combination soup. Also, I used a jar of Cheese Whiz. I felt like it was missing something. It was bland. As you see in the pic I love black pepper but I should’ve added garlic or something. I also added a few French fried onions at the end. I was out of milk so I skipped that step but it didn’t really need it. My mother liked it. She got seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNLKIRBY"
},
"reviewBody": "My husband loves this-add mushrooms, sometimes peas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JalapenoBob"
},
"reviewBody": "I found the recipe included too much condensed soup. Next time, I will use either one can of cream of chicken OR one can of cream of mushroom. I will definately try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I don’t usually leave reviews, but I was dumbfounded by how delicious this recipe was! I halved the recipe so I only used one can of cream of mushroom soup, I sautéed onions and a clove of garlic in some olive oil, then I added brown rice, one packet of Velveeta sauce, a bag of pre-cooked Tyson chicken, with a little shredded cheese (stirred that) Then I baked that for 30 minutes in a cast iron skillet and I added bacon and more shredded cheese on top and broiled it for 10 minutes. It turned out AMAZING! My picky son that NEVER eats broccoli even tried it and loved it. I’m telling you this will be a GO-TO recipe for our family from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "My family loved it. I added sliced mushrooms and used real chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances Ellis"
},
"reviewBody": "I bring this to our family get together and the whole family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine Fontenot"
},
"reviewBody": "What an easy delicious casserole!! I’ve made some changes and it did require a little extra steps/work, but I like to use fresh ingredients wherever I can. Instead of using one can of cream of mushroom I opted for 2 cans of healthy request cream of chicken. The healthy request doesn’t have any MSG in it. Also, I used shredded chicken from a whole chicken that I used from a homemade broth that I made. The chicken from the broth was full of flavor and extremely tender. I’m not a fan of processed cheese like Velveeta, so I opted for a block of sharp cheese that I cut into cubes. And as for the rice, I’m 1/2 Korean so I cooked my rice in a rice cooker and don’t ever use ‘instant’ rice. But for the purpose of this recipe I added olive oil and slightly less water than usual so the rice didn’t end up sticky but separate and fluffy. I chopped up fresh broccoli vs using frozen and instead of an onion I opted for a small shallot and added a couple of cloves of mined garlic. I think next time I’ll sauté the shallots and garlic before adding them. Cooking them directly with the casserole sorta made them over powering instead of ‘enhancing’ the flavors. When you take it out to stir it, you may want to check the flavor and season it with salt and pepper or whatever flavors you want to add. Next time I’m considering adding paprika or maybe ground sage which sets off the flavors of cheese! When the casserole was done I topped it off with some cheese that I shredded myself and broiled it for an additional 5 mins until it was toasty golden and slightly brown. Overall this was a hit and my family enjoyed it! I look forward to continuing on tweaking this and adding it to my cookbook of favorite recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Blankenship"
},
"reviewBody": "This was a huge hit. I did doctor it up some though. I sautéd the onion along with 1/2 c of celery, 1/2 c green pepper, 1 garlic clove and 3 tbl butter. I also only added 1 c of the block velvetta and 1 c shredded Colby Jack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was delicious. I did change up the recipe some because I didn't have some of the ingredients on hand. I used fresh chicken chopped into smaller bite sized pieces. Seasoned it with seasoned salt, garlic powder and freshly ground pepper. I also added a spoonful of chopped garlic. I cooked the rice in chicken broth instead of water. I kept the onion since it enhanced the flavor. I used extra cheese and instead of cream of chicken, I used 2 cans of cream of mushroom. I would have used the cream of chicken if I had it, but it still tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It turned out great! The only thing I did different was to use real chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Abundis Workman"
},
"reviewBody": "This came out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Bendell"
},
"reviewBody": "I have made this only I used fresh cooked chicken and fresh broccoli. It is yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "southernsparklescomcastnet"
},
"reviewBody": "I make mine with grated cheddar cheese instead of the processed cheese food. But it is delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chris Keller"
},
"reviewBody": "Even with the addition of portobello mushrooms and a sprinkle of Montreal steak seasoning, it was really bland The rice just didn't seem to belong there. Maybe without the rice, or with pasta instead, but this isn't something I'd make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EMERALDSEYE"
},
"reviewBody": "For ease of ingredients and prep time this is 5 stars. Flavorwise, I'd put that at 2.5 to 3, so I settled on 4 stars. As many others, I did make my own adjustments, mostly for personal tastes that brought this back to 5 stars for me. I halved the recipe and used long grain rice that I partially cooked with the water from the canned chicken (losing lovely flavor if you throw it out) and added enough water to make 2 full cups. To that I added one Knorr homestyle chicken stock cup (the little concentrated one), parsley, onion flake, garlic powder, onion powder 2 tbsps. butter, couple shakes of Mrs. Dash garlic and onion seasoning let it boil, added the rice, let it come to a boil again, covered and turned off the heat. Waited 20 minutes and in a large bowl, combined 1 can of chicken, 1 lb. of thawed broccoli chopped small, rice, 1 can of broccoli cheese soup (no Velveeta) and 1 soup can of milk. Once stirred I layered in half of the rice mixture topped with 4 Kraft Deluxe American cheese slices and added the rest of the rice, smoothed over the top and covered and baked for 15 minutes, took it out to stir but it was barely warm so returned to oven for 15 more minutes. I did not want it to be too cheesy, but I also did not want it to not have enough cheese either. The cheese soup and American cheese slices were perfect. I did suffer a bit of the \"soupiness\" that others encountered as well and I should have not added the milk, or perhaps a smaller amount. I will try this again with half a soup can of milk next time. I did bake mine for a total of 45 minutes, mostly trying to bake off the extra liquid, but the first 15 minutes in the oven were not enough to heat through the casserole. This was delicious. -Em"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewJerseyTexan"
},
"reviewBody": "So this is a great base recipe. Like others have commented on, I did make some changes. Didn’t have instant rice, so I used long grain. Boiled it in chicken broth. Used chicken breast that I had, cut it into bite size pieces and sautéed it with the onion. I also added the broccoli to the chicken when it was finished cooking and left it while the rice finished cooking. I only added cream of mushroom and not the cream of chicken (thought it would just be too much). When rice was finished I combined all the ingredients in a baking dish. Didn’t have processed cheese, so I used shredded mozzarella, and taco blend cheeses. I also only added 1/2 cup milk and 1/8 cup butter. Husband loved it, so it is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "The Avon Lady"
},
"reviewBody": "Way too much sodium, fat, &amp; calories per serving. I decided to make my own sauce using unsweetened plant milk, non dairy butter, flour, &amp; seasonings instead of using the canned soup. The dish came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine"
},
"reviewBody": "Fantastic recipe! I decided to stir fry rice with chopped bacon and onion- what a great addition!!!! Family LOVES this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this recipe! It's always a hit for church potluck meals. Even the pastor's 10 yr old son will always thank me for this casserole! Sometimes I use freshly boiled &amp; seasoned chicken or canned breast chicken. Only change I make sometimes is adding cheddar cheese over the top of casserole. So. Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Never made a casserole before. This was great and easy to follow. I usually don’t eat veggies but I’m trying to incorporate them into my diet more, this blended the broccoli in so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did a couple of different things, just because it is what I had available. I used most of a rotisserie chicken (shredded), fresh broccoli florets (broken into small bite size), regular rice (not instant). Forgot the butter, but that worked out ok. I added crushed chili Fritos on top. Cooked covered with foil so that the Fritos wouldn’t burn. Uncovered the last 5 minutes. Big hit with the family!!! Will probably add a little garlic salt and pepper. Didn’t do it this time. Definitely a make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy M. Thomason"
},
"reviewBody": "Good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marla Woods"
},
"reviewBody": "Good recipe, but I tweaked it of course. I browned 3 chicken breasts because I don't do canned chicken. I also did a cheese rue to make it creamier because I didn't have any condensed soups on hand. It's pretty good, kids loved it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it with fresh chicken and added onion powder instead of onions. I think it needs more soup or moisture. Other than that, it's a home run."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine A Brooks"
},
"reviewBody": "It's very good easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a half recipe and added a small can of mushroom stems and pieces because why not? This turned out fabulous, and I’m so glad not to have to wait until a large gathering to enjoy it. In fact, I may start taking this to covered dish dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved the dish!! Only thing I did different was exclude the onions BUT it was amazing! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good flavors, but I don't think the onions are necessary. Very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was delicious, I added some velveeta cheese in mine 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The change I made was with a bag of cheese sauce. It tastes so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Bell"
},
"reviewBody": "Easy, but have to cook about 20 minutes longer to eliminate soupy texture. Tastes good. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Jefferson"
},
"reviewBody": "Decent recipe. I left out onions and used onion soup mix. I added 3 cups of rice in chicken broth. I also added one extra can of cream of chicken since it looked soupy. Also used about one cup of cheddar and one cup of mozzarella cheese and mixed all ingredients together, placed in glass pan and added a little more cheddar on top. Baked for 30 minutes covered on 350 then uncovered and baked 15 more minutes on 400 to brown cheese. Family loved it. Can't add photo since it was eaten too fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blackhighheels"
},
"reviewBody": "I don't love dairy so I used about 4 oz of cheese and water instead of milk. It was a nice way to use up broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "princesslollypoo"
},
"reviewBody": "I didn’t use cream of mushroom I used two things of cream of chicken"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tyren36"
},
"reviewBody": "It is a great recipe. Tasted super great. I added mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sourpatchgirlfriend"
},
"reviewBody": "Loved it and family loved it! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peggyrae59"
},
"reviewBody": "I changed it a bit because I didn't have the ingredients but it turned out awesome! I used two cans of mushroom soup mix, fresh broccoli, fresh mushrooms and pan cooked chicken thighs. I also covered the pan while cooking to retain the moisture. But it was wonderful! Saving this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emaildonde"
},
"reviewBody": "The flavor is good, but the 1 cup of milk made it very soupy. If I make this again I will cut the milk back to 1/2 cup. Maybe even 1/4 cup to start and see how that does."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geeandrea22"
},
"reviewBody": "We liked the casserole. I made a few changes. I did not use instant rice. I use regular long grain rice, boiled in chicken broth. Substituted rotisserie chicken (seasoned), shredded colby jack cheese and onion powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Super easy and great! Made some adjustments to the recipe: added carrot &amp; celery. Blanched fresh broccoli and carrots as well sauteed onions and celery in butter. Also used shredded Velvetta cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kat Beck"
},
"reviewBody": "Rating this one star to help counter balance the \"5 star but I used actual ingredients not processed garbage\" ratings. What a monstrosity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "argent33038"
},
"reviewBody": "Excellent. I added freshly cooked, crumbled bacon the last 5 minutes of oven time. Might cut back to 3/4 cup milk to make it less soupy. I didn't use the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m3shelly"
},
"reviewBody": "I should have read some of the other reviews before trying this. I like to make exactly as written the first time, to give an honest review. I loved the recipe, and the hubby was happy too. The reason I should've read the other comments; I used fresh broccoli that needed to be used up from my fridge. I didn't even consider it different than frozen broccoli, so I didn't pre-stream it. The casserole was still excellent, but that, along with the chopped onion made it a bit more crunchy than normal. Update: I've now made this using a mix of fresh broccoli and cauliflower. I've also added some shredded sharp cheddar on the top, five minutes before cooking is completed, but I'm in Wisconsin, so there's no such thing as too much cheese. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maddie Franklin"
},
"reviewBody": "Delicious!! I did cut the recipe in half, too much for two people. Substituted the processed cheese for shredded colby. I did saute the onion and par boiled the broccoli. It was a hit. We also have left-overs for tomorrow!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisha Pogue Holt"
},
"reviewBody": "Yummy! I used left over roasted chicken and made regular rice and real cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alanna Mazekulua"
},
"reviewBody": "I questioned putting raw onion in the mix and it should be fried first. It came out crunchy. As well, recipe called for NO seasoning? Gordon Ramsay would agree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Lawlis"
},
"reviewBody": "I boiled some boneless chicken breasts and used the same water to cook brown rice. Added pepper, thyme, and onion powder. Also used half cheddar and half American cheese. Pretty tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lancer"
},
"reviewBody": "Turned out great.\nI followed some of the suggestions and used a rotisserie chicken, non-instant rice cooked with chicken broth, fresh steamed broccoli, and mild cheddar. I also used a packet of onion soup mix instead of a white onion. I tried the sliced provolone on top but that was just too much cheese for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chase"
},
"reviewBody": "Delicious! I used 1/4 c wine, 3/4 c milk and omitted butter. Topped with crushed Ritz crackers in garlic and butter. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BJJ416"
},
"reviewBody": "Great recipe. switched out Velveeta for 1 pound of shredded Cheddar/Gouda. added crispy onions as a topper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terrica Cephus"
},
"reviewBody": "Took the other reviews recommendations. Added 2 cans cream of mushroom 1 can of chicken. Steamed the broccoli and added onion mix. Pic was before baking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Regan"
},
"reviewBody": "This is a good starting point. Things I changed: fresh broccoli that was steamed first. Real chicken breast fully cooked and cubbed. Did one can cream of chicken &amp; one Dan cream of mushroom. Used Wisconsin &amp; vet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Okamura"
},
"reviewBody": "I love the creamy texture. It was even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan Bledsoe"
},
"reviewBody": "Broke college student version: instant rice, cream of chicken and cream of mushroom, bag of steamed broccoli, chopped onion, (skipped milk... Lactose intolerant. Made no difference) misc spices and classic shredded cheese. Suuuper good, will absolutely make again and it's even greater as a leftover (and lasts several meals for me and my roommate)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Stucker"
},
"reviewBody": "Lots of changes, but still happy with the result. I used chicken breast and fresh broccoli cooked head of time. I also dislike the cheese food, so I mixed in shredded cheese with heavy cream. Added a pinch of cayenne just for a little extra kick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darian Stratton"
},
"reviewBody": "Had to use mozzarella and mexican style cheese mix. Its in the oven now....so excited to eat! Already smells delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Dianne Roberts"
},
"reviewBody": "I added carrots and bell peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "This was quick and easy and a good way to use leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kristyn Fuston"
},
"reviewBody": "made it once this way, it was ok. \nI tweak it the second time - 5 stars! \n2 packets of broccoli and cheese rice\n1 C of cream of chicken\n1 can of chicken broth\n1 bag of frozen chicken\n2 chicken breast chopped up\n1pkt ranch dressing powder \nCheese on top\n375* for 45 mins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flaky Babe"
},
"reviewBody": "Made exactly as written and it was AWESOME! My husband couldn't get enough of it. I was hesitant to use canned chicken but it gave this dish a wonderful flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Dobay"
},
"reviewBody": "Took the dish to a dish to pass dinner and it was delicious. I didn't make any changes other than to use gluten free ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Robertson"
},
"reviewBody": "i took this recipie and used grilled chicken breast and brown rice cooked with chicken bouillon. tastes pretty good for a potluck but a bit bland, i won't change it today but i think some lemon juice would add some brightness, and some mushroom would add some heartiness, and i plan to toss on some potato chips and brown it right before the potluck. i think i will add some lemon juice at that point, it is just kinda bland. although i certainly did not directly follow the instructions so that might easily be my fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Gerstner"
},
"reviewBody": "Easy, fast, cheap, and so delicious! I used basmati rice, and added some creole seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gary"
},
"reviewBody": "This was a great casserole to prepare. It was easy. I use it as a side dish. On my second attempt I decided to spice it up a little bit. Instead of cream of mushroom I used cream of jalapeño soup. I also added Cayenne pepper and red pepper flakes to taste. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joshua Jojo"
},
"reviewBody": "Never use instant rice or processed cheese. Also never use canned chicken. Read other reviews. Yummy but nasty without them. Top with French friend onion. Spice it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna6017"
},
"reviewBody": "This recipe i s excellent as is! Everyone can make their changes to fit preferences, taste, etc. This fit my needs perfectly today!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nana"
},
"reviewBody": "We loved the recipe, but I gave it 4 stars because we thought it needed a little more flavor. I used 3 cups of regular white rice and a can of cheddar cheese soup instead of the actual cheeses--that could be the problem. I tasted it, when I stirred it,an decided to add some black pepper and Lawry's seasoned salt. I cooked the onion and broccoli for 3 minutes in the microwave before adding it to the rice. \nNext time, I will use 2 cheddar cheese soups, more Lawry's and pepper, add several drops of tabasco and a can of English peas. Thanks for sharing the recipe. It will make the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hallie Spangenberg"
},
"reviewBody": "I fallowed Frankie girls recipe mostly but made a few changes. I thought it was a bit thick so I added extra milk about 1/2-3/4 cup extra. And I sautéd the onions first to make sure they were cooked. And I used twelve slices of Kraft deluxe American cheese in stead of velveeta. I also added two more slices and a some cheddar cheese on top after I stirred it half way through the bake. I was delicious even my little girls loved it and they are not the biggest broccoli eaters!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathi DeSantis"
},
"reviewBody": "It was a hearty good meal on a cold winter day.\nI used fresh chicken cut in cubes. Pan seared it with fresh mushrooms and shallots in a combination of garlic infused olive oil and butter. I used fresh broccoli and par boiled it. Substituted cooked brown rice instead of white rice. I even added a bit more rice.\nI had a combination or shredded mozzarella and cheddar cheeses. \nIt was very tasty. It was not as thick as I would have liked it to be. Next time I won't add as much milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Taste great and fantastic leftover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Grady"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "It was a good casserole for kids and adults."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail Swanson"
},
"reviewBody": "Casseroles of virtually any kind are renowned for their simplicity to make, but thanks to the use of canned chunk chicken, this one was Particularly easy. Really, the most involving step in the construction was the making of the rice. The only substitution I made was green onions for the white onion. I used a good old-fashioned slab of velveeta for the cheese food and this came out wonderfully creamy and flavorful. My tip: don’t skimp on the cheese,mix everything well, and your next dinner is good to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheDivineMrs.M"
},
"reviewBody": "I had canned chicken, so I looked for a recipe to use it and made this one since I pretty much had all the other ingredients on hand, too. The recipe was so good, I made it twice in one week. The second time I tweaked it a bit. I used two 12.5 oz. cans of canned chicken as that's what I had. Also used a bag of 12 oz. broccoli florets (the recipe could easily handle 16 oz.). The florets were kind of big, so I heated them on the stove for a few minutes in boiling water and cut them down with scissors into bite size pieces. One can of soup is plenty; I find cream of celery gives it more flavor. I only use 8 oz. of Velveeta cheese cut in cubes. I love onions, but didn't like the cut-up ones in this because there is not enough baking time for it to cook down, and they are too crunchy for my taste. So, the second time I made it, I used less than half a packet of onion soup mix and liked that better. I used about half the amount of butter; milk amount was the same. Half way through baking, I stirred the ingredients as directed to make sure the Velveeta melted thoroughly. I have no problem using instant rice or canned chicken, they add to the ease of making this which is one thing I love about it. It's also great comfort food in winter with simple ingredients I usually have around. This will be a meal that goes into rotation in this household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "I made this for my family and they loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Grant"
},
"reviewBody": "Way too much cheese for this dish. It was overpowering. I also used onion soup and liked that flavor. Was a little runny also. Probably won’t make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JonesT"
},
"reviewBody": "Delicious Dish. instead I Used real chicken and real cheese. caramelized the onions first and added 2 tablespoons of sour cream. Family lived it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shimmie's Mom"
},
"reviewBody": "Used poached boneless chicken breast instead of canned and only half of the velveeta, but otherwise followed the recipe. It was delicious. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aleaha Keene"
},
"reviewBody": "Delicious!!! everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Shelton Richardson"
},
"reviewBody": "I make this all the time, I add lemon juice and garlic. I also use roastery chicken, gives it a lot of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BRANDIEWHAT"
},
"reviewBody": "Tasty and the family loved it. I did precook the rice, omit the onion, use shredded cheese instead of processed cheese, and use a packet of veggie dip seasoning for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DM03"
},
"reviewBody": "This dish was utterly fantastic!!!! My only beef with it was probably because I left an outer layer of onion on and it was crunchy when you ran into the onions. Personally I think I will saute the onions first next time. We used 3/4 lb of velveeta after reading reviews..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Not my favorite. Edible but would not cook again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mbos54115"
},
"reviewBody": "This turned out good. Next time I will either sauté the onions or skip them altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russ A Iddings"
},
"reviewBody": "Easy to make. Tasted great. I added more cream of chicken soup and cut the milk. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad Carter"
},
"reviewBody": "I used 2 cups grated cheddar cheese instead of the processed cheese food. I substituted half and half instead of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "Family loved this and will make again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kronquillo"
},
"reviewBody": "I would chop the broccoli a bit finer and sauté the onion before adding to the recipe (my onion stayed a bit crunchy)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly D B Johnson"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHEMOANGELS"
},
"reviewBody": "This was very good with the previously mentioned tweaks. Shredded cheese, real rice, some minced garlic, and I added a can of diced hot chiles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christopher Sutton"
},
"reviewBody": "Tasty and easy to make.\n I made it with bone in chicken thighs. Had to bake it for 1 hour at 350°F to reach an internal temperature of 185°F in the chicken. \nInitially was a little soupy, but after letting it sit and stirring to make texture consistent, the casserole was nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DLU"
},
"reviewBody": "No changes. I was easy and great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Arlene"
},
"reviewBody": "This is a dump casserole and it tastes like it -- made in a hurry with little effort. I used cooked fresh broccoli and cubed chicken breasts. Still tasted like an amateur made it. If it weren't for the cheese and seasoning it would be bleh. Won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue Pak"
},
"reviewBody": "A very delicious recipe, though I did make a few modifications. I just used cooked and cubed chicken instead of canned as well as cooked rice instead of instant. I only had 2 cups of cheese and that worked just fine. Sprinkling some curry powder and paprika like another reviewer suggested was a nice touch to the flavor! Next time I might experiment with adding celery or mushrooms as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Schermerhorn"
},
"reviewBody": "My family loves this easy recipe. We've experimented with different vegetables, fresh and frozen. Our favorite variation is fresh broccoli, cauliflower, and canned white corn. I also add a little more seasonings and always garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue U"
},
"reviewBody": "I used frozen chicken breast and combined the butter, milk and real cheddar in a saucepan. Added the rice, onion, broccoli and cheese sauce. It was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet Williams"
},
"reviewBody": "this was quick and easy and the grand kids liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lani Chilton"
},
"reviewBody": "Very good especially the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maggie Cassen"
},
"reviewBody": "It is a good \"all around\" recipe but I felt there was too much cheese. I made the dish according to the recipe. I would make it again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/648/main-dish/casseroles/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1971/main-dish/casseroles/chicken/rice/",
"name": "Rice"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/",
"name": "Broccoli, Rice, Cheese, and Chicken Casserole"
}
}
]
}
}
, "about": [
]
}
]