				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Broiler S&#39;mores"
,"datePublished": "2019-04-02T02:49:14.000-04:00"
,"dateModified": "2022-04-18T13:04:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MPADEN"
,"url": "https://www.allrecipes.com/cook/1047588"
}
]
,"description": "S&#39;mores, a dessert sandwich made with graham crackers, chocolate bars, and roasted marshmallows, are a campfire favorite. If you are not able to go camping or make a fire, but are craving these treats, this recipe is for you! In only a few minutes these broiler s&#39;mores will offer a mini vacation from the everyday."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/b-rhPkqOe3VG24HnZOTTTB3G0g8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8047976-a6a526d3dd6f4a7d95c077dc95648c58.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Broiler S&#39;mores"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "5",
"ratingCount": "52"
}
,"cookTime": "PT3M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "208 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "72 mg"
,"sugarContent": "27 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"4 graham crackers",
"2 milk chocolate candy bars",
"12 marshmallows" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven broiler. Line a small pan with aluminum foil and lightly coat with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Break the graham crackers in half and lay 4 of the squares out on a serving plate. Break the candy bars in half and lay one piece on each of the graham crackers on the plate."
} ,{
"@type": "HowToStep"
,"text": "Arrange the marshmallows in a single layer in the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Broil the marshmallows until the tops brown, turn the marshmallows to brown the undersides. Keep a close eye on the marshmallows so they do not burn. They will brown very quickly."
} ,{
"@type": "HowToStep"
,"text": "Remove the marshmallows from the pan and place three on each of the chocolate squares. Top with the remaining graham cracker halves."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT8M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mishel"
},
"reviewBody": "This is a very yummy alternative to campfire s'mores.\n\nThe marshmallows were toasted and gooey and delicious and I left them broiling long enough for the sugar to caramelize a little for that crunch I love from fire roasted ones.\n\nI wanted the chocolate to melt a little, so after I removed the marshmallows from the toaster oven, I put in a tray with Graham crackers topped with 2 squares of milk chocolate on each. By the time I had the marshmallows on the remaining crackers, the chocolate was melty.\n\nThis is a perfection solution for s'mores cravings when you lack a campfire!\n\n(I recommend buying good quality graham crackers though. I had cheap no-name ones and no amount of gooey marshmallows or melted chocolate could help with the dryness of the cracker.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tootsabell"
},
"reviewBody": "Thank you so much for this recipe! My 7 yr old daughter who is in Sparks/Girl Guides is attending an online campfire meeting/get together (because of the current social distancing). I wanted to help make it be as fun as possible &amp; you made that happen by providing this recipe to be made indoors. Mucho thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLogan"
},
"reviewBody": "We made this after watching an episode of Sesame Street where Elmo and Grover learn about summer camp. When Cookie Monster made s’mores in the broiler, my son asked if we could too. We had the ingredients and it was a great was to take our minds off of being hunkered down over Spring Break. They were AWESOME! We used parchment appear instead of foil and cooking spray to prevent the marshmallows from burning. We took a page out of another reviewer’s book and put the graham crackers with the chocolate bars in the broiler at the same time. My son likes his food room temperature and has the patience to wait for his s’mores to cool. Mommy and Daddy don’t. Thanks for the recipe and the fun we had. I’m sure we’ll do it again really soon! Three thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coonmarsh114"
},
"reviewBody": "easy and amazing ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chas"
},
"reviewBody": "Thank you! I put marshmallow on graham cracker broiled until golden brown (just over a minute) topped with chocolate and graham cracker. PERFECTION!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hope AR"
},
"reviewBody": "I put graham crackers broken in halves on foil lined cookie sheet with chocolate on one half and marshmallows on the other half. Put in broiler on hi for about 50 seconds until marshmallows were browned and chocolate melted. Once out of the oven, I made sandwiches with the two halves. Whole family devoured them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChantillyLace"
},
"reviewBody": "This is exactly how I had figured out to make indoor smores, I get a craving for smores a few times a month and this works really well. I make extra marshmallows to eat on the side, these smores such a delicious and nostalgic treat! They only take a few minutes too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori S."
},
"reviewBody": "These were amazing and toasted up so uniformly! I prefer these so much more to campfire smores. I can never keep them from catching on fire when I make them over the campfire, and have always disliked the charred, ashy taste. I like them toasty on the outside and gooey on the inside and these are definitely better in the oven. I put the graham crackers on the foil, then chocolate chips, and the jumbo marshmallows on top--no grease, no mess. I broiled them just under 3 minutes; adding the other cracker with chocolate chips during the last 45 seconds to melt the chocolate. The crackers are slightly softer, but oh my goodness, marshmallows have never tasted this good.... So yummy my kids were begging for more so I made two additional batches. Most definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Howie Haile"
},
"reviewBody": "We were caught off guard when our cabin's fire pit proved too inhospitable for a campfire. I took the hints to broiler marshmallow on one cracker and chocolate slivers on the other. It was fabulous! Two marshmallows on one cracker is too much and my attempt at making a Reeses flavored one was super messy (the peanut butter melted too much)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovinghappyhome"
},
"reviewBody": "Saw this recipe last year and made them. came out truly delicious. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peanut1234"
},
"reviewBody": "When I was making this at the end I covered it in marshmallow sauce and baked it then put sprinkled on it it was yumilicious and my siblings and my parents loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Who wouldn't like these?! Perfectly quick and easy, these were gobbled up as a special after-school treat for my daughter's first day of kindergarten. She loved helping me make them too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smartt"
},
"reviewBody": "Its a s'mores so of course it was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "makehistory"
},
"reviewBody": "Thank you for sharing! I have tried microwaving them before, but the graham crackers burned. This is a perfect alternative! They turned out wonderfully. We did use one bar (so each S'more received 1/4 of a bar, instead of 1/2) and one large marshmallow for each S'more. Play around and see what works for you. The toasting technique is great, and the heat from the marshmallows' heat do melt the chocolate. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "Who would think that chocolate, graham crackers and marshmallow could be so good. I could eat this everyday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanetC"
},
"reviewBody": "YUM! This worked great. Definitely going into the recipe box. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Minnesota_Girl"
},
"reviewBody": "Bought all the stuff for S'mores for recent camping trip and of course didn't get around to making them. Found this method and enjoyed the treat in the comfort of my air conditioned home. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Elizabeth Feller Williams"
},
"reviewBody": "of course the camp fire version is better but when it rained on our campfire this was a great second. The kids were really surprised. They didn't think we would be able to have genuine smores. This really fit the bill. Be careful, once the marshmallows are turned they brown really fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Just treated my grandchildren to their first s'mores via the broiler; Such fun! Thanks for the directions Mpaden :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kfehrer12"
},
"reviewBody": "This was a great idea and worked perfectly. Thanks so much for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRPUT"
},
"reviewBody": "Quick, easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "This is how I make my s'mores when I don't have an open flame to prepare them on. They are perfect everytime! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jag11300"
},
"reviewBody": "Brilliant! I don't know why I didn't think of doing this before! Using the new non-stick foil works like a dream. As mentioned by some other reviwers, it's fantastic when you're cooking for a crowd. Nothing better than S'mores in bulk. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I Love Troy"
},
"reviewBody": "My mom used to do this when we were kids :) It was my favorite treat. I've made this for the children I babysat, and now I make it for my husband. I alway leave the oven door cracked open because they love to watch the marshmallows plump and brown (even the hubs) Soon I'll make it for my little girl when she's old enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRIGGSAIDEN"
},
"reviewBody": "Awesome! I laid out all the crackers on the pan and put a marshmallow on one side and the chocolate on the other. That way they both get melted and the cracker is just the tiniest bit soft. It is like heaven, so delicious!! Will never make them over a fire again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzumiya404"
},
"reviewBody": "Really great! Tried it with my friend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa Wagner Schoolfield"
},
"reviewBody": "Thanks for the idea...I needed something quick for our pizza night=) My kids send their thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamaD"
},
"reviewBody": "great for s'more lovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Cather"
},
"reviewBody": "I remember making these around the campfire when I was a girl scout. They're so good. I used one big marshmallow per s'more and then put the whole thing back under the broiler to help melt the chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plbwest"
},
"reviewBody": "As good if not better than camp fire s'mores."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angolihib"
},
"reviewBody": "This was so good. I am preggo and was craving something sweet and QUICK it's the middle of the night!!! I didn't have any crackers so I toasted some wheat bread with brown sugar over it. I then cut into 4 pieces and just followed the rest of the steps. All I can say is my craving is satisfied and so is my baby!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie C"
},
"reviewBody": "This is great! I never thought of putting the marshmallows under the broiler. I saw this on the site right before I was heading to the gym for kick boxing class...I made sure I worked extra hard to earn a treat tonight. I used my toaster over to broil the marshmallows since it was just my husband and I also placed the chocolate on one side of the crackers and popped it in the microwave for a few seconds just to start the chocolate melting. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hilary Sonner"
},
"reviewBody": "We weren't able to have a campfire, but the kids really wanted to have s'mores and this worked great. I even had one of the marshmallows plain and it was awesome. Definitely only 2 minutes a side for our oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kareno"
},
"reviewBody": "This is a convenient and delicious method of preparing the marshmallows. I use just one large marshmallow (rather than three) and it was messy enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momi"
},
"reviewBody": "I was craving a summer treat in January, so I made these. I made mine by putting the graham cracker on an unlined cookie sheet, topped with chocolate bar and mini marshmellows. In my broiler on low: 3 minutes for light brown, 4 minutes for dark brown. Yum! Summer update: I actually enjoy these smores better than fire-roasted smores - no smoke in the face, no mosquitoes, etc. Went \"camping\" with friends and it was too windy for a fire so made these - there is no excuse for not enjoying smores year-round now! I like to use 2 chocolate squares broken apart and set the marshmellow between so it doesn't roll off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fondukes"
},
"reviewBody": "Very good, thanks for a recipe using the broiler instead of cooking outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SColv"
},
"reviewBody": "I felt like having a fun, nostalgic dessert and this did it! Can you believe my husband didn't even know what a s'more was?!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baird"
},
"reviewBody": "This recipe is great when you are cooking for a crowd! I made it for 18 kids/adults - they tasted great and the best part was that they were all ready at the same time. WARNING: Do not take your eyes off the marshmallows as they are cooking… once they start, they go FAST."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/143055/broiler-smores/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
"name": "Sandwich Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/143055/broiler-smores/",
"name": "Broiler S&#39;mores"
}
}
]
}
}
, "about": [
]
}
]