				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Brown Sugar Brownies"
,"datePublished": "1998-03-26T01:30:58.000-05:00"
,"dateModified": "2022-07-14T17:36:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Rosina"
,"url": "https://www.allrecipes.com/cook/24327790"
}
]
,"description": "For Chocolate Brown Sugar Brownies, stir 1 cup semisweet chocolate chips into the batter along with the nuts. Bake in lightly greased pan 13 x 9 x 2 inches for 30 minutes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ilcmB4sr01wscEPHqycOR3BlJ-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/881417-d2ad63c4ce11493a8cea92421e3e4168.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Brown Sugar Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "260"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "136 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "22 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "122 mg"
,"sugarContent": "11 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1.3333300352097 cups sifted all-purpose flour",
"1 teaspoon baking powder",
"0.5 teaspoon salt",
"1 cup packed brown sugar",
"0.5 cup butter, softened",
"1 egg",
"1 teaspoon vanilla extract",
"0.5 cup chopped walnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pre-heat oven to 350 degrees F (175 degrees C). Lightly grease a 9 x 9 x 1-3/4 inch pan."
} ,{
"@type": "HowToStep"
,"text": "Sift together flour, baking powder and salt and set aside. In large bowl, beat together butter, sugar, egg and vanilla until smooth."
} ,{
"@type": "HowToStep"
,"text": "Stir in the flour mixture and the nuts until well blended. Spread evenly in prepared pan. Bake 25-30 minutes or until surface springs back when gently pressed. Cool slightly. While still warm, cut into bars with a sharp knife."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Do not recommend. Was almost impossible to mix by hand, extremely heavy, and when I finally put it in the stand mixer I had to turn it off because it *would* have fried it. Ended up adding 2 cups of hot water so I could finish adding the flour, and it turned into cake after taking almost ninety minutes to bake. Only giving it 2 starts instead of 1 because the cake tasted fine, but it's not at all what I wanted to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Florio"
},
"reviewBody": "This recipe is easy and delicious! I added some white chocolate chips and pecans. Baked for 22 min at 350/convection. Great soft, brownie-like texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The ratio of wet to dry ingredients is not correct. Flavors are there but the mixture was too dry. I was forced to add more liquid based off previous experiences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I followed this recipe almost exact-I just didn’t throw in the walnuts. I had Blondies for the first time at a restaurant and was determined to find a good recipe to make them. The restaurant version didn’t have walnuts, hence why I left them out for my version. I also drizzled salted caramel and chocolate sauce over the top of mine, with a little whipped cream on the side- going for the restaurant look. But I also ate one without the drizzle, and still very yummy. I used salted butter, so maybe if I try this again, I might try unsalted butter to see if the taste is any different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "This was incredibly delicious. Did not use nuts. Baked in 7x11 pan and cut in 24 pieces. Figured calories as 97 each piece."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seeker"
},
"reviewBody": "Super easy. Used glass pan. Sprinkled chocolate chips on top. Cooked 28 minutes. Served with ice cream. Guests loved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debi Schule"
},
"reviewBody": "It was just okay. And yes, I made it exactly as written. It was very thick but that’s really no big deal. My big deal was the name. It’s called “brownies”. It really tastes like a chocolate chip cookie in bar form. So why not just make that? I wanted a brownie. So I won’t make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megan"
},
"reviewBody": "Quick and easy. Very forgiving recipe. I ran out of flour and subbed 1/2 cup of rolled oats, didn't use nuts, added a cup of white chocolate and semisweet chocolate chips (total). My husband and kids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "These are very good. I added white chocolate chips and baked in an 8x8 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saara"
},
"reviewBody": "Delicious and great balance of sweet and salty. They were eaten up within minutes. I added chopped up heath bar to make them toffee blondies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Spidle Hedge"
},
"reviewBody": "excellent just as written-a perfect bar cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I made a double recipe to fit a 9 x 13\" pan. I used a bit less salt since I bake with salted butter. I also melted the butter before mixing it with sugar and eggs. I believe that made it easier to pour and spread in the pan. Added semi sweet chocolate chunks. Baked about 26 minutes. The taste and texture are fabulous. These were supposed to be for hubby to take to share at his office tomorrow. But now he says we're keeping them. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Very good! Nice change for friends who don’t eat chocolate. I put pecans in mine,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dboss101"
},
"reviewBody": "I did make this but it did not rise as stated and it was very thick. I had to spray the spatula to spread it in the pan. Did not have almonds so I baked it plain. As as someone else said it was more like a cookie than a brownie, I have to agree. it was very tasty. Not sure if I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Very easy and delicious! I melted my butter before mixing and added white chocolate chips, toffee chips and walnuts. OMG! \n\nETA: I have made these a half dozen times now and I am convinced this is the best recipe ever. I mix and match new add-ins every time. I've used pecans, white chocolate chips, toffee chips, chocolate chips, cranberry bits, walnuts....etc. I don't think you can mess this up if you tried. \n\nMy favorite combo so far is white chocolate chips with cranberries and walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Upon reading some reviews that these turned out terrible, I decided to make them anyways. I followed the recipe and these turned out PERFECT ! They tasted delicious and didn't last long. I will definitely make these again !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Gionet"
},
"reviewBody": "Delicious! I omitted the walnuts and used almond flour. I also added about a teaspoon or two of cinnamon. Very moist and reminded me a bit of samoas in taste. Maybe that's from the almond flour?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arlene Werenich"
},
"reviewBody": "These are fantastic. So easy to make. Added 1 cup of milk chocolate chips and wow wow. thanks for terrific recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ryan Harrist"
},
"reviewBody": "They are decent. I didn’t have any chocolate chips so I’m guessing they would be a lot better with chocolate. Easy to make! The dough comes out thick but when it comes out of the oven it’s the right texture. They would also be good with a drizzle of sauce on top, maybe chocolate or a blonde brownie sauce. They are good with milk.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn Thompson"
},
"reviewBody": "I used dark brown sugar and a little less salt and they turned out amazing! I made them for a school project and everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissKitty"
},
"reviewBody": "These are amazing. I add 1/2 - 3/4 cup Skor bits to the mixture and they get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Barber"
},
"reviewBody": "I added a cup of butterscotch chips. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelabaker"
},
"reviewBody": "Oh my goodness, these are amazing! gooey and moist. I did melt the butter when mixing the batter, and I also added a bit of maple syrup extract. I put maple buttercream frosting on them while they were hot. so good :-)!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laurie Jane"
},
"reviewBody": "I made this yesterday, and while it tastes good, it is dry especially around the edges.. It probably needed a bigger pan, 11 x 7, so the batter could spread better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary W."
},
"reviewBody": "Easy to make GF. We also add sea salt on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aniqua Chowdhury"
},
"reviewBody": "Amazing brownies! I didn't think they would taste very good, but they tasted great! user cinnamon for a better taste, and doubled the recipe because it fills up one pan. I also subed out butter(cause I didnt have) for olive oil)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Litchfield"
},
"reviewBody": "These were a hit here. The texture is a brownie/cookie. The batter concerned me a little, but it tasted very good and had a nice texture. I added white chocolate chips and topped with vanilla ice cream. I made them in a 9\" round pie pan which seemed to be the perfect size dish. Baking time is also accurate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "staciep71"
},
"reviewBody": "This was fantastic! I have been looking for a good Blondie-type recipe since I don't like chocolate, and this by far exceeds anything I have tried. I followed the suggestion in one of the reviews and used melted butter instead of softened butter, which I think helped keep these moist. I also added a Tablespoon of Cinnamon to make them more of a Snicker doodle taste. I left the nuts out as no one in my family cares for them. Next time, I will try this with butterscotch or white chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luvgod"
},
"reviewBody": "I thought they were very good. I doubled the recipe and considered all the comments. Dry the second day even though sealed. I would make them again however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joan Lampro"
},
"reviewBody": "Only change was more vanilla and cinnamon and 1 T milk because it seemed too dry other than that followed recipe. Was very disappointed in taste and dryness. Sorry I usually have good luck from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JT"
},
"reviewBody": "These are delicious. I made them as an easy treat with my two young nieces. The girls loved making them, and the bars turned out well. We sprinkled them with a bit of cinnamon just because my niece wanted to, and that was a tasty alteration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Omari Daniels"
},
"reviewBody": "Just made this a few minutes ago. Wanted to try a dessert for the first time and this came out very well. Sweet, but not TOO sweet. A good, happy medium."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Krista"
},
"reviewBody": "This recipe is rich and sweet. I made it using the stevia/splenda blended brown sugar and it came out just as good as when I used regular brown sugar. The most recent attempt I actually layered mini marshmallows and dark chocolate chips between two layers of batter before baking. Tasted good, but had to let it set up in the pan overnight before cutting as the marshmallow formed a molten layer under the upper crust. Next time I will just mix the marshmallows and chips into the batter. The batter is rather thick and sticky and can be difficult to spread, but the blondies are so worth it. Just a tad thicker than my normal chocolate brownie batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reesie"
},
"reviewBody": "I doubled the recipe, all except the salt and I added 1/4 tsp . Of caramel abstract. I baked them in a 9x13 glass dish. They turned out fantastic! They were moist, chewy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "We are a dairy free, nut free family. This cake was delicious made with margarine and choc chips in lieu of nuts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AB Sweetling"
},
"reviewBody": "Delicious! The dough was thicker than I anticipated, but it ended up so delicious! I frosted it with a cream cheese brown sugar frosting after eating some, and it tastes so amazing either way. The entire family loves it.\n\nThe second time, I tried it with dark brown sugar and olive oil instead of butter. There was a richer molasses flavor and obviously it didn't have that buttery taste, but the batter was easier to spread and it turned out even moister.\n\nThe third time, I used dark brown sugar and virgin coconut oil instead of butter. The rich molasses flavor was still there, and the coconut oil added a faint and delicious taste to it, especially once it was chilled.\n\nA fourth time, I made this with two eggs. I had to cook it a minute longer, but oh my goodness! I like it best so far with an extra egg, no doubt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This is a cookie recipe, not a brownie recipe. They came out dry but tasted good. Should have added chocolate chips and formed into balls on a baking sheet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary D"
},
"reviewBody": "I've made these many times, and they're always a hit! I never use the nuts. Sometimes I'll use maple sugar in lieu of some of the brown sugar - then I really see folks smile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige Lusk"
},
"reviewBody": "These were excellent! I was a little worried about the thick consistency of the batter, but they turned out nice and fluffy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t_ricki"
},
"reviewBody": "I was craving some kind of blondies and came upon this recipe. I added some cinnamon to it to make it closer to a Graham cracker. The pan I used made it a little thinner when I placed it in so I only baked for 18-20 minutes. After I let them cool I put some mini marshmellows on it and heated some chocolate frosting for 15 minutes in the microwave to drizzle on top. BAM! Smores blondies! Thanks for your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merf"
},
"reviewBody": "Made this for a party and they were a hit! I did add chopped pecans to the batter and sprinkled the top with white chocolate chips.I also followed others advice and melted the butter. I added an extra egg but only because I used gluten free flour. \nDO NOT over-bake them...they will firm up as they cool. I left mine in the oven with the heat off for about twenty minutes to firm them up without over-baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jah"
},
"reviewBody": "These are great! I have made them with and without chocolate chips and always add walnuts. I followed everyone else's recommendations about salt and just used 1/2 a teaspoon for the doubled recipe. It is a thick batter, but if you cream the butter well it will help. An electric mixer would make it less hard work too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Talena"
},
"reviewBody": "These are really good! A great recipe that uses ingredients you already have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph D"
},
"reviewBody": "I rated this recipe a 5 because it was super simple to make. The only change i made was to completely melt the butter before mixing it into the dry ingredients. It was chewy and yummy and went well with my morning coffee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurel Nicol"
},
"reviewBody": "So yummy - family favorite. Always double the recipe and bake in a 9x13 - until just barely done. -Do not over bake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carissa C."
},
"reviewBody": "I liked the product, but it wasn't a blondie. It wsd too cake-like. I want a chewy brownie like blondie and that is not what you get from this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlin Renee"
},
"reviewBody": "Delicious! Sweetness was on point, and I added pecans (Had no walnuts) and it added such a nice flavor! I did not have the full 1 cup of brown sugar, I only had 3/4 of a cup, so I just added 1/4 cup of white sugar and it tasted great. I LOVE THIS RECIPE! I will keep this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandmadaryl"
},
"reviewBody": "Yum! I used pecans instead of walnuts (didn't have walnuts). So good! I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Walker"
},
"reviewBody": "Super yummy, lovely caramel, brown sugar flavor and a perfect base for whatever flavor chip you gave on hand. Thanks for sharing, this is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy J Floyd"
},
"reviewBody": "Baked these last night. So simple. The batter thickness had me skeptical but turned out great. I left out the nuts and put in white chocolate chips instead. I baked mine in a round disposable cake pan and they came out nice and chewy. I pulled Alton Brown's trick of pulling them out to sit for a bit and then baking them again. Great versatile base for lots of playing with mix-ins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Hughes Cormier"
},
"reviewBody": "Made this exactly as the recipe states. Used my hands to mix and pat into pan. Baked for 27 minutes. Easy,yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valm"
},
"reviewBody": "Made exactly as recipe stated except added semi sweet chips rather than nuts (allergy family). Used wet hand to pat dough into pan, which worked great. Love that the recipe only a makes an 8x8 pan--don't always need a big pan of goodies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamidelCaribe"
},
"reviewBody": "Holy Molly, these are good! Moist, dense perfection. I topped these with a little maple icing. Get you a big glass of milk, you're gonna thank yourself. Yummm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shemiyah Rainey"
},
"reviewBody": "The brownies came out dry and cake like. I didn't modify the recipe with the exception of adding spices (clove nutmeg and cinnamon). Since I don't know exactly which ingredient gives brownies their chewy texture, I don't know how to tweak this. Sooooo I will continue my search..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieB"
},
"reviewBody": "Excellent recipe. Very easy to make. I doubled it also. I added white chocolate chips instead of the nuts. I will definitely be making these in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Philip Barbour"
},
"reviewBody": "I put chocolate chips &amp; white chips in it! GREAT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reddiwip junkie"
},
"reviewBody": "Nug thought they were 5 stars, KP thought they were just OK"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Knopf Cerrone"
},
"reviewBody": "Great I had a recipe for brown sugar brownies but couldn't find it and thought this would work and it did. If you melt the butter in a pan and then add sugar vanilla and egg it will mix easier. Than add flour baking powder salt and nuts and you only used only\n one pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clama"
},
"reviewBody": "I literally just created a profile after years of using Allrecipes to say how freakin' good these blondies/brown sugar brownies/butterscotch brownies were. I made them plain and they were moist, chewy and flavorful. I melted the butter 90% of the way and it made a nice dark brown paste when I added the brown sugar so I'm pretty sure you're supposed to melt it. I baked for 27 minutes but ended up putting them back in for another like 2 minutes. My mom used to make \"butterscotch brownies\" when I was little and I tried making them a few months ago from the BHG Big Red cookbook and they were sad. These were so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Philip"
},
"reviewBody": "This is so easy and good! you have to have the chips &amp; nuts! try white chocolate ships"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy W"
},
"reviewBody": "these are awesome!!!!I doubled the batch and used a 13x9 pan. I used mini chocolate chips and pecans instead of walnuts. They are amazing!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nyamekye Henry"
},
"reviewBody": "Idk what I did wrong, but it came out like a cake. I followed exactly what the recipe said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "K2003MC"
},
"reviewBody": "I found that they tasted great but the batter was really dry and crummy. I had to press it down in the pan so hit would stick together..... I would have used only one cup of flour in stead of one 1/3 cups of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angela Reaves"
},
"reviewBody": "Doubled recipe to a T. Quite sweet and very dry. Luckily I poured Chess on top n that gave it some moisture. Won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassie Kerns"
},
"reviewBody": "as others have posted on this recipe, the batter was super dry, so I added around a quarter cup of milk to get it to consistency. Also added a bit of cinnamon. Family loved it, tastes great with ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zodia81"
},
"reviewBody": "I made these in a 8 inch pie pan and baked for 30 minutes. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melody"
},
"reviewBody": "It's great to add chocolate chips to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Az Hummer"
},
"reviewBody": "Hubby gives 5 stars for taste; I give 5 for ease of prep. I followed other reviewers using less salt and doubled the recipe using unsalted butter, mixing the chopped walnuts in with the flour mixture before adding, then sprinkling chocolate chips over batter before baking. Used the Pampered Chef bar pan rather than a 9 x 13 pan and they turned out just great. Mine baked approx. 30 min. but ovens vary so much. Oh yeah, it's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "suzeeT"
},
"reviewBody": "I reduced the amount of sugar to 3/4 cup. The flavor was good but it turned out super dry. I didn't think reducing the sugar would do that but maybe it got rid of the gooey aspect of a typical blondie bar..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookie2014"
},
"reviewBody": "Instead of 20 brownies, I cut mine into 16 larger pieces. I could've eaten the whole pan myself, but my mom frowned on that idea haha My mom had said that I have had these before, but I couldn't remember when. So it must have been a really long time. I followed the recipe exactly and it turned out great! I really love the chewy texture to them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eileen Lee"
},
"reviewBody": "Ridiculously easy! Not my favorite sweet, but they were tasty, and the rest of the family really liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissMaryMack"
},
"reviewBody": "The brownies are amazing! I did mine GF and subed super mini marshmallows instead of choc. chips. So simple yet perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bo Trapeze"
},
"reviewBody": "For those of you having trouble pressing the dough into the pan, use the wrapper that the butter came in, I first use it to grease the pan, too! I used butterscotch and chocolate chips the first time I made these, but only chocolate chips today. The batter is buttery enough. I used a 9x9 pan but think I will try an 8x8 next time. These brownies are buttery and chewy and we like them very much, also very quick and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitty"
},
"reviewBody": "Yummy! These were a hit and I was asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Little Boo's Mom"
},
"reviewBody": "Instead of butter we used crisco butter flavored......because we were out of butter we improvised.\nWe left out the salt. \nTotal cook time 35 minutes in a glass pan.\nIt was delicious! \nNext time, I m going to try ground dried apricots with applesauce with coconut oil versus the /crisco butter to get the same moist texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Very good brownie. It rose nicely, it cut nicely, and it tasted great. Soft, yet chewy, just how we think a brownie should taste! I made both versions of this recipe. As written for one pan, and submitters idea of adding chocolate chips for a chocolate version. I took them to Girls Night Out, and they were enjoyed by all. Mine were done at the 25 minute mark."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regan123"
},
"reviewBody": "I followed the recipe exactly accept used chopped pecans. These are delicious! Will deffinatly ale them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "misslemonbar"
},
"reviewBody": "I doubled the recipe and added 3/4 cup of white chocolate chips, as well as pecans instead of walnuts (or vice versa, can't remember) and baked it in a 9X13 pan for the full 40 minutes. Came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missdizz"
},
"reviewBody": "Just like Grandmas! Doubled the recipe for 9x13 pan. Used 2 slightly heaped cups of (unsifted) flour... Probably would have measured 2 1/4C... I was being lazy! Also added a bag of heath chips... Couldn't really taste them but they added to the delicious caramely flavor these bars already have. The key with these is to take them out as soon as they're set so they still have that super soft chewy texture to them once they cool. I love that you can add anything to these! Nuts, heath, chocolate, white choc, pb or butterscotch chips... Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wilkens-Harris"
},
"reviewBody": "very good. The only thing I changed was I used pecans instead of walnuts. I found this recipe because i had last minute company and wasn't able to go to the store. Fortunately I had all the ingredients for this recipe. It was a huge hit and will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "maryeric78"
},
"reviewBody": "I don't know how this turned out good for anyone. I read the reviews and was thrilled but it was not eaten. It was a thick dough, like for cookies, but I spread it in pan. It baked nicely. But was thick, dry, not much flavor. Did not even taste like brown sugar. I am very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melissafodor"
},
"reviewBody": "Nice base to jazz up. The batter is the consistency of cookie dough. But they baked up nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Brandy Carroll"
},
"reviewBody": "Not good.....tasted like cornbread :( and I really wanted them. Made them exactly the way the directions said. Very dissapointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arlene"
},
"reviewBody": "We used Hickory nuts instead of Walnuts And \"WOW\" we also added 1Tbsp.of molasses to give it a little extra richness"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "libertyfan73"
},
"reviewBody": "this is a simple i want something sweet now!!! type of recipe I personally think that adding anything to this i.e. chips or candy would make this too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "akf76"
},
"reviewBody": "Super easy &amp; Yummy too! These turned out perfectly thick and moist. I doubled the recipe and per other reviews, I melted the butter which really helped with spreading in the pan. These are very versatile too... I added Heath bar bits! Next time I will try the walnuts with chocolate chips. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danielle C"
},
"reviewBody": "This was very tasty &amp; easy to make, was a tiny bit dry so I made the sauce from Granny's Cake on this site, poked some holes &amp; poured over the top. Would make again, trying some add ins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NMChef1"
},
"reviewBody": "These were nicer than I expected, but not totally awesome. I wasn't sure what \"blondies\" were, but I did a little looking, and that's pretty much what this recipe was. I'm not sure I'd ever had blondies before, and I still love brownies more, but this was nice. I made it exactly as written, and the batch lasted me for about a week. When reheated slightly in the microwave, they were slightly melt-in-your-mouth. I'm not sure I'll make these again, but they were definitely worth trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reuben"
},
"reviewBody": "Yum! Made these because my SIL cannot have chocolate and my entire family said \"Make them again!\" :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harmoneeeeeee"
},
"reviewBody": "Mine came out perfectly, absolutely delicious! Ovens vary &amp; I only had to bake for 20 minutes. Followed recipe exactly, with the exception of adding extra vanilla (but that is just a personal preference). Yes the batter was thick, but as long as the end result is good I don't see why that would matter? If you find it difficult to spread in the pan, simply spray 1 hand with cooking spray, rub hands together, then press evenly into pan- ez pz! Just like the recipe- so easy &amp; so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Lockley"
},
"reviewBody": "I followed the recipe almost exactly, I doubled the vanilla, added about 1/4 tsp of almond extract and left out the walnuts and they came out moist, chewy and delicious! I baked for about 20 mins and they were perfect! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kidatheart"
},
"reviewBody": "Can't put it in a 9x13 with the recipe as is but it's perfect in a 9x9. I make the recipe exactly, with the chocolate chips mixed in. Comes out perfect every time. Once I swapped the butter out for coconut oil and added a touch more flour to get the right consistency and it came out just as delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances"
},
"reviewBody": "I cooked it for 24 minutes and it was absolutely moist and delicious.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Blair Henry"
},
"reviewBody": "Great recipe, brown sugary!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ponytail Goddess"
},
"reviewBody": "These were delicious! They really did have the maple flavor that other reviewers talked about and were fairly moist, even though I used applesauce in place of butter. I will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jason Gaydos"
},
"reviewBody": "I found the consistency to be a little different then what I prefer in a blondie, but the over all taste was very good. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cwbullock"
},
"reviewBody": "YUMMY!! These were some of the best blondies our family has ever tasted! perfect thickness and hardness, and the easiest to make!! wemake this recipe ALL the time for parties and different events!! Everywhere we take them they are a major hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BrookeMarie"
},
"reviewBody": "They were just OK. I would suggest adding plenty of chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mallory"
},
"reviewBody": "These were not bad but the flavor just wasn't there. I think if there was more sugar they might've been better, the texture however was nice, and they were pretty dense."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10728/brown-sugar-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
"name": "Brownie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2755/desserts/cookies/brownies/nut-brownies/",
"name": "Nut Brownie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10728/brown-sugar-brownies/",
"name": "Brown Sugar Brownies"
}
}
]
}
}
, "about": [
]
}
]