				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bubba&#39;s Jambalaya"
,"datePublished": "2019-04-02T02:46:53.000-04:00"
,"dateModified": "2022-09-24T23:42:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "FORDMAN88"
,"url": "https://www.allrecipes.com/cook/1221351"
}
]
,"description": "Easy Southern classic, with chicken, sausage, ham, and shrimp."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aw0e4HeTo-DtkwavshwCLN2KqBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3371668-bubbas-jambalaya-Todd-Mueller-1x1-1-1fa871e1c36d49f3a3f824eff4266293.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1871268626001",
"description": "See how to make this simple Cajun classic.",
"duration": "PT5M18S",
"name": "Bubba’s Jambalaya",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/6216dab8-991d-46dd-a02b-d593f2a28c0b/7e9c0f0d-f523-4cce-bb47-73dea2869a52/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T09:29:52.236-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bubba&#39;s Jambalaya"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1035"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "349 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "72 mg"
,"fiberContent": "2 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1177 mg"
,"sugarContent": "1 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"6 slices bacon, cut into 1 inch pieces",
"1 cup chopped celery",
"1 green bell pepper, seeded and chopped",
"1 onion, chopped",
"0.5 pound cubed cooked ham",
"0.5 pound cubed cooked chicken",
"0.5 pound cubed smoked sausage",
"2 (14.5 ounce) cans crushed tomatoes, with liquid",
"2 cups beef broth",
"2 cups chicken broth",
"1 teaspoon dried thyme",
"2 teaspoons Cajun seasoning",
"2 cups uncooked white rice",
"0.5 pound salad shrimp" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat a large pot over medium-high heat. Add bacon, and cook until crisp. Remove bacon pieces with a slotted spoon, and set aside. Add celery, bell pepper, and onion to the bacon drippings, and cook until tender."
} ,{
"@type": "HowToStep"
,"text": "Add the ham, chicken and sausage to the pot, and pour in the tomatoes, beef broth and chicken broth. Season with thyme and Cajun seasoning. Bring to a boil, and add the rice. Bring to a boil, then turn the heat to low, cover, and simmer for about 20 minutes, until the rice is tender."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aw0e4HeTo-DtkwavshwCLN2KqBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3371668-bubbas-jambalaya-Todd-Mueller-1x1-1-1fa871e1c36d49f3a3f824eff4266293.jpg"
}
]
,"text": "Stir in the shrimp and bacon just before serving, and heat through. If you use uncooked shrimp, let it cook for about 5 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Don’t be afraid of this dish. It’s just jambalaya, after all .... what we cajuns make to keep from wasting leftovers. Use as much, or as less, of anything that suits your taste. But, this is definitely a great place to start, and an excellent recipe, in its own right! If you like it soupy, great, just add more liquid of some sort. If you like it thicker, fantastic, might need more rice. There’s no real exact cooking time here, just make sure your rice is done. And, to those that think each rice grain has to stand on its own, I say you’re not from south Louisiana, and you don’t know jambalaya from jelly. Tomatoes, or no tomatoes. Okra, or no. Different meats, spices, vegetables, okay, just throw it in the pot. No two Cajuns make jambalaya the same. So relax! Whatever floats your boat will be mighty fine here, I guarantee! And before I forget, the suggestion earlier, to kind of solve the rice issue, to add the rice at the end of the first step, when the vegetables are almost done, is an excellent one. Just stir the raw rice in so it gets coated with the bacon grease. Then you can add everything else, except shrimp and cooked bacon. It will definitely help the rice grains to stay more separate, (but not completely / remember this is jambalaya) while still having all the fantastic flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! Wanna try this one. Thanks for sharing. Would like to share this too, Panlasang Makabayan food restaurant with a twist! Get your Pinoy food favorites and freshly baked bread only here at Ka Tunying's Cafe and Restaurant!\" https://katunyings.com/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug 87L98"
},
"reviewBody": "The rice needed 5 minutes more to fully cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WannabChef"
},
"reviewBody": "I used 3/4 cup rice and added liquid as needed. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MacDaddy"
},
"reviewBody": "Made this and got rave reviews (even from our picky teenager). It was even better the following two days as leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mann0824"
},
"reviewBody": "I thought it was delicious! I substituted medium size shrimp for salad shrimp and I used turkey sausage in place of pork sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zama2"
},
"reviewBody": "This is an awesome recipe. Made a huge batch and canned 12 quart jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "Made as directed except didn't add the extra thyme, just used the Cajun seasoning mix on this website. AWESOME flavor! We loved it and it made A LOT so we shared it and everyone else loved it too. Great recipe, will definitely make again. Thanks for sharing, it was my first attempt at New Orleans style cuisine and it was a huge hit with everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Delicious! Just added a couple jalapeños ,1/4 t. cayenne pepper &amp; a few shakes of hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ula"
},
"reviewBody": "This is an outstanding recipe. I followed the ingredients list, but I changed the preparation considerably. It takes both a frying pan and a rice pot, which is a bit of extra trouble, but worth it to build those lovely layers of flavor. I used diced chicken thighs (breast meat would be too dry), and browned them in bacon grease, removing the cooked chicken to my rice pot. Then I browned the sausage and ham, and put that in with the chicken. Next, I sautéed the vegetables. When they were almost cooked, I added the rice and spices, and stirred until the rice went slightly chalky. I stirred everything together in the rice pot, then added the broth and tomatoes heated in the empty frying pan. I don’t like stirring rice while it cooks unless I absolutely have to, but it had to be stirred when I added the shrimp—which was a good thing because the rice cooks somewhat unevenly otherwise. My pot sat on a flame tamer over a gas burner, so the rice wouldn’t stick, which added about 10 minutes to the cooking time, but kept it from getting mushy. I used jumbo shrimp, which I peeled, deveined and cut in half—and added them the last ten minutes (the 20-min mark) folding in well. It helps if when you take the pot off the heat, you let it sit with a folded cloth under the lid for about 10 minutes(or longer), but it’s okay if you don’t have the time. Be warned, this recipe feeds a small army. Five stars, all the way. Add wine, a salad and some crusty bread and you have an amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "I have been using this basic recipe since back in 1974 when my parents went to New Orleans to celebrate their 15th wedding anniversary and brought home a cook book. I was 14, haha. I hate it when people change recipes, but the real one does not call for broth of any kind! The flavor should come from the ingredients in the recipe.\nAlso, andouli sausage is what they typically use in NOLA. However, if you happen to like that smokey flavor, and I know a lot of people do, you can always put your sausage on the grill first, OR just add a capful or two of Liquid Smoke for the last few minutes and stir well. Also, I always use medium shrimp instead of salad shrimp. Only because every time I have visited NOLA, (and I cannot even count how many times it's been now), I always order R&amp;B's and Jambalaya, and that's what they use. That's just how it's made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Viki Liddle"
},
"reviewBody": "I used vegan meat alternatives and it was fabulous. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Ferrero"
},
"reviewBody": "I made exactly as written and it was a good as I have ever had. The rice did take about 45 minutes to cook, and yes, it was mushy. Next time (per advice from another reviewer) I will take into account the liquid in the crushed tomato, and maybe cut the broth down by 1 cup. Might add some Tabasco and Worcestershire next time for some extra layers of flavor. We liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rsisler"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margo Proffitt"
},
"reviewBody": "I love it.\nNever had jambalaya before so I'm not sure what it's supposed to taste like but it turned out delicious to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Scott"
},
"reviewBody": "not spicy so the kids enjoyed it too. but the flavor is spot on. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "This is amazing!! I cut out the beef broth, and used my own canned tomatoes and used my own mixed Cajun seasoning and served over Cajun cauliflower rice!! So so good\nThank you for this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Hagiepetros"
},
"reviewBody": "I followed the recipe and from what i gathered he uses par-boiled rice for the little amount of liquid he uses. He never specified which type so \nI used long grain and had to add 2 cups extra of each the chicken n beef broth,halfway through,to finish cooking the rice. \nI also had to let it go longer so the rice would cook and absorb the flavors.\nDefinitely a dish worth repeating,everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Walters"
},
"reviewBody": "Made mostly as it is started. However read the comments and made rice separate. I used fresh uncooked shrimp. Husband said it was really good and filling but needed a little more kick. Added crushed red pepper. Served with crusty bread. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnC123"
},
"reviewBody": "Very good, easy recipe! I left out the bacon and ham (but cooked the veggies in the bacon grease from breakfast). I only added half a bag of frozen cooked shrimp at the very end- next time I’ll use the whole bag. Give this a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gah416"
},
"reviewBody": "all I have to say is wow. made this exactly. wonderfull."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kendra Martinez"
},
"reviewBody": "My husband and I love this recipe! Every year doing the holidays I cook it and the whole family enjoys it. I switched out the ham and chicken for crab legs/meat and extra Cajun seasoning with rice served separately. \n\none year I thought I lost the recipe and panicked, really need to write it down lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gena Crow"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Murray"
},
"reviewBody": "My family loves this recipe! Absolutely delicious. The only thing I leave out is the shrimp because my husband can’t eat it. But I made no changes to it as I don’t feel it needs anything more, or less. Thanks for sharing this with us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ree Ree"
},
"reviewBody": "Thank you Bubba! This recipe is a keeper just the way you wrote it; However, since we’re living in uncertain times, I had to make do with what I had on hand. \n\nThese are the changes/substitutes I made: \n*used extra chicken that was marinated in mesquite seasoning and EVOO then pan seared. \n*substituted hot Italian sausage (casings removed, cut in chunks and cooked) for the smoked sausage. \n*diced dried Chorizo and soaked it in chicken stock for about an hour. \n*used a large can of San Marzano tomatoes that was given a quick spin in a food processor. \nFirst I cooked the bacon and removed from the pan. Then I added the chicken until cooked through and removed. In the same pot, I added the sausage and cooked until done and removed. Then I followed the rest of your recipe. Except for the shrimp (we have a picky eater here). Overall, it was gone in a flash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela HJ"
},
"reviewBody": "Very good! I did not have bacon, ham or shrimp . . . I'm sure this would be even better with them! I added a chopped zucchini for extra veggies and extra chicken &amp; sausage since I didn't have the other meats. We also added extra cajun seasoning, salt &amp; hot sauce to our own servings as needed, and I used brown rice simply because I don't use white rice for anything and always have brown rice on hand. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alialimichael"
},
"reviewBody": "I didn’t have bacon so I just cooked veggies and added smoked sausage and chicken breast (did not precook) Added the seasoning before tomato can and broth. Despite the other reviewers recommendations I cooked rice in the pot. Well it came out wonderful. Wasn’t sure how spicy it gets so slowly added Cajun season as it cooked. Definitely will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luke"
},
"reviewBody": "I've made this a few times. It's not a fluke...it is easy, and flavorful. Thanks Bubba!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Kendinger"
},
"reviewBody": "Family loved it. Followed recipe exactly and could not be better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicola Lange Roepke"
},
"reviewBody": "Very tasty! I didn’t use the beef broth and just used 4 cups of chicken broth. Instead of the salad shrimp I used precooked crawfish tails.. I used quick cooking rice and didn’t have a problem with it clumping. It was just spicy enough without being overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jarhead42"
},
"reviewBody": "It was excellent! I have a crockpot version I use at the firehouse that I really like and this was much better. I know people make changes to recipes but it cracks me up when they give it 5 stars and by time they’re done listing their changes it’s a whole different recipe. This one was good written, but I don’t like ham, so left that out....and used 1/2 the thyme......haha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaykeay"
},
"reviewBody": "Delicious! I was worried that there would not be a ton of flavor but there was! I made it (mostly) to recipe. I modified to accommodate all the eaters I had (some not liking seafood, and others ham).\n\nI cooked the bacon as directed, but I never added it back in (saved it for breakfast burritos the next day). The veggies still got all the flavoring from its drippings, which was great. I personally do not care for soggy/limp bacon. \n\nInstead of adding ham and shrimp I doubled up on the sausage and chicken. I think you MUST use andouille sausage for this. \n\nI cooked the rice separately, and thickened the jambalaya up at the end by making a roux with cornstarch and some of the broth. \n\nThis was great, will def be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calvin Sneary"
},
"reviewBody": "Very good recipe, which like most recipes, I used as a baseline and added and subtracted from there. I did not use bacon, I started with celery, onion, minced garlic, red, yellow, orange and jalapeño peppers. I didn’t have beef broth, so I doubled the chicken broth. I used jasmine rice, no ham or chicken, only smoked sausage and shrimp. This turned out very well; so much better and not much more work than, a box version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhelmig"
},
"reviewBody": "Very tasty. I made this exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaclyn Choo"
},
"reviewBody": "I've never had jambalaya and didn't know what to expect, maybe a meaty kind of wet rice similar to paella. Loved this recipe! I added in okra to add some crunch, and originally followed through the recipe and decided to add in onion/garlic powder, Worcestershire tobasco and Bay leafs per other user suggestion. Loveee the heat and spice! Definitely easier to cook the rice seperately and pour it in at the final stage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Dubé"
},
"reviewBody": "Will definitely make again!! I didn't add the shrimp because I don't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Butler"
},
"reviewBody": "Super yummy! I cooked the rice separately so I didn't have to worry about it getting mushy before my husband comes home to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZSunshine"
},
"reviewBody": "So yummy! You can't go wrong with sausage, shrimp, ham, bacon, chicken, etc. Everyone's taste buds are different, though. I thought it had just the right amount of spice, but my husband thought it wasn't spicy enough, while my daughter thought it was too spicy. It was delicious, though, and there were plenty of leftovers for lunch the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Burns"
},
"reviewBody": "Excellent and easy to make! Big hit with all three of my kids. Omitted the shrimp due to a shellfish allergy, otherwise followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Delicous -easier to make by cooking the rice in the broth than how I usually do it, but would use less rice for as soupier dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan"
},
"reviewBody": "I give it 12 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad McLaughlin"
},
"reviewBody": "This was really good! Great flavor with some heat. We served to over cauliflower rice for a delicious low carb and keto meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "demented"
},
"reviewBody": "added 2 tablespoons of cayenne pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Konold"
},
"reviewBody": "This became a staple after one time of making it! Its hearty and perfect for cool nights, plus it makes enough for leftovers so all my co workers were curious about my lunch. Absolutely awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "I made it tonight. Absolutely unfreakinbelievable!! We loved it!!! Thank you. Terrific recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma Joe"
},
"reviewBody": "Made this as the recipe said and my customers are loving it. I had to clean out my freezer and this was a perfect way to get rid of leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYROY"
},
"reviewBody": "great recipe, I have made some before that were too tomato based, this was just right. Also, I used my homemade sausages that I made with ghost peppers and added a few habaneros to top up the heat. Obviously I like it a little spicy, and this recipe had no heat in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYROY"
},
"reviewBody": "great recipe, I have made some before that were too tomato based, this was just right. Also, I used my homemade sausages that I made with ghost peppers and added a few habaneros to top up the heat. Obviously I like it a little spicy, and this recipe had no heat in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alison"
},
"reviewBody": "This is very good. Will need to add more kick into next time around but easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jnette"
},
"reviewBody": "Tasty and crowd pleasing. Add cayenne to kick it up a notch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "This was delicious. I deleted the ham(because I forgot to buy it) and used Bratwurst (because it was what I had)instead of the smoked sausage and it was amazing. I made the recipe for the simple cajun seasoning instead of buying it pre-made. I'm making it again tonight. It's my hubby's new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Delicious! \nLeft out ham and doubled the chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Lassa"
},
"reviewBody": "I added extra cajun seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhody"
},
"reviewBody": "We love jambalaya and I mix things up all the time. This recipe was as good as any I've ever made. I did make some adjustments though because of what I had on hand. I did not have ham or shrimp so I only used chicken and smoked sausage. I also used diced tomatoes, my own homemade chicken broth (no beef on hand) and brown Minute Rice. From other recipes I've made, I didn't feel 2 tsp was enough cajun seasoning (for our taste) so I used 2 TBSP made from a recipe here on Allrecipes. For some reason, maybe because I used Minute Rice (which only took 10 minutes to cook instead of the 20), it was REALLY soupy so I added in 2 more cups of Minute Rice and cooked another 10 minutes. It was the perfect consistency then. I added generous splashes of Tabasco sauce. Love that we have leftovers as this is sure to get even better tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Made it exactly as it was presented in the video. Turned out pretty darn good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandy mrohs"
},
"reviewBody": "I added a alittle extra rice. It came out amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gina"
},
"reviewBody": "Delicious!! Cooked the chicken in blackened seasoning. It made the dish spicy but so delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "I made this with the only exception is making the rice separate. It was OMG delicious. I’m going out of town and my husband asked me to freeze some so he can have it while I’m gone. One of my favorite All Recipes recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I needed a little more spice so I added 2 medium chili peppers.\nBut overall a really easy and tasty recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Wallace"
},
"reviewBody": "This is a great recipe. The amount of flavor it packed having so few spices was outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Patterson"
},
"reviewBody": "A family of picky eaters including gluten and dairy intolerant loved this. Great flavour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Moni"
},
"reviewBody": "Kids loved it, that is always a win"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stevechevyo"
},
"reviewBody": "Absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "This was a wonderful and easy one pot dish. Used cut-up/trimmed ham steaks, poached chicken thighs, Cajun pre-cooked sausage and fresh shrimp. Definitely will make again but probably will halve recipe (although leftovers were even better flavors!)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Morehouse"
},
"reviewBody": "kids and wife loved it. I used brown rice instead and it didn't cook them. I'll cook them first next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carpy"
},
"reviewBody": "I will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn Tackett"
},
"reviewBody": "Bubba’s Gumbo with Okra and Ground Turkey instead of ham. Excellent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krizelle"
},
"reviewBody": "this is the first time ive ever cooked jambalay! with all the available ingredients i have, it still good! i used turkey sausage, canned chicken, frozen large shrimp, bacon, roasted crushed tomatoes in can, &amp; i dont have any ham. i also used chicken bouillon instead. i added paprika in addition to the cajun but i thought it was too much so i put some water to neutralize the flavor. i should stick with just the cajun seasoning next time. brought some at work coz i cooked alot and they liked it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Merry"
},
"reviewBody": "My husband and I really liked this. I've made it a couple of times. It freezes well and makes delicious lunches with the left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim87"
},
"reviewBody": "I didn't change the ingredients. After browning the bacon. I browned the smoked sausage in the bacon grease, then the chicken, then the veges. Added tomatoes, broth and simmered for 1 1/2 hours in a dutch oven. Removed 2 cups of the broth to cook the basmati rice separately until almost done. Refrigerated overnight. Next day I heated the meat mixture, added the rice and brought to a boil. Added shrimp, covered the pot and turned off the stove. Once the rice absorbed the liquid, added bacon and packed it up and took it to church with some cornbread. Big, big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmartini"
},
"reviewBody": "This is my go to recipe for starting jambalaya. I use this as a base, but double the amount of meats I use. Usually use andouille and beef polska kielbasa, thick sliced bacon, medium shrimp. If I have ham and/or chicken, I throw that in too. I also use brown rice so I add a bit more liquid and let it cook longer. It's just the best. I love how the rice absorbs all the flavors while it cooks and it's absolutely delicious the day after. One of our family faves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Smidt"
},
"reviewBody": "I made it as the recipe describes and it was fantastic. I stirred the rice in the jambalaya twice in the first 8 minutes. I then added raw 31-40 shrimp after 15 minutes of simmering and stirred them in, then returned the lid on the pot and let it simmer for 10 more minutes. When it was done cooking I let it rest for 15 minutes so that the rice would absorb more liquid and allowed some of the water to evaporate. This was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tim"
},
"reviewBody": "very simple to make but extremely delicious would recommend to anyone who just likes jambalaya"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine McGee Sigworth"
},
"reviewBody": "Loved it, but not enough kick for us. A little hot sauce made it perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen M."
},
"reviewBody": "I made this recipe especially for my daughter who loves jambalaya. She raved about it, so I will definitely be making this again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scott"
},
"reviewBody": "OMG I love you for this recipe, I followed it exactly and I can say I wouldn’t change a single thing, my wife loved it, my son left it, I definitely will keep this in the loop for dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherri"
},
"reviewBody": "fantastic!!!! a week later my friends are saying \" Please make more\" only change I made was to throw in some diced hot Italian sausage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "npartney"
},
"reviewBody": "My family really loved this!! I will definitely make it again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Genaya Timpe Syverson"
},
"reviewBody": "Added Worcestershire sauce and did not use ham. Everyone used the hot sauce of their choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cajun Lover"
},
"reviewBody": "I didn’t care much for the bacon in it. I used plain bacon. I’ll try it again without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "njj"
},
"reviewBody": "Very good, and the (jasmine) rice was perfectly cooked at 20 minutes. I made this as per the recipe, but added 1 clove garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Nicole Pratt"
},
"reviewBody": "It's good. It makes A LOT. My only issue is it needs salt. Not a lot, but definitely some. It might also could use a bit more liquid. I know the leftovers will need something to help them come back to life, because it is SUPER thick now. I didn't have any issues with the rice. This is one of the few rice dishes you MUST stir and scrape the bottom every few minutes while cooking to keep from clumping and sticking. Overall, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. BAD"
},
"reviewBody": "Our tried and true jambalaya recipe now for about 7 years. My husband's eyes light up when I make it, and my fatger has been the receipient of it as a gift a few times bc of his love for this dish. I make it as is except I do not add shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twoods"
},
"reviewBody": "This dish is delicious. I didn't use bacon. I also mixed smoked sausage and andoulle sausage. I added crab and okra at the end. This was a big hit and I will make it again and again and again. Thanks Bubba"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Adam Hunt"
},
"reviewBody": "Yuck! Thyme? Didn’t taste anything like Jambalaya!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Smith"
},
"reviewBody": "First time making this and it was delicious! I added 2-1/2 cups of rice, doubled the Cajun seasoning since we like spice, and added garlic! Definitely making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Weaver"
},
"reviewBody": "One change didn't have ham so I doubled the sausage. This is a keeper! Everything else NO CHANGE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "indybikeman"
},
"reviewBody": "This is so simple to make. And its one of our familys favorites. I use medium or large sized shrimp instead of salad shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Miller"
},
"reviewBody": "I did as others suggested and made the rice separately. To the rice I added a beef and a chicken bouillon cube, as I did not have any broth. While the rice was cooking I prepped the rest in a large skillet, then allowed diners to mix the rice with the meat and veggies as they liked. I went light on the tomatoes as some in my family really don't like them, and added thinly sliced cabbage. Everyone enjoyed this meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Allen"
},
"reviewBody": "It was a hit! My husband loved it! This"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Mary James"
},
"reviewBody": "I made the Colorado version and it was delish. I substituted turkey for chicken as I'm an AB blood type, all natural turkey sausage and bacon for the regular as I'm looking to cut cholesterol, no shrimp, veggie stock for beef as its the law in Western Colorado, haha. And cooked brown rice separately as I'm at 9000 feet, for 40 minutes. Spectacular?? Reminds me of my Louisiana road trip y'all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Gale Kesler"
},
"reviewBody": "I make this every Mardi Gras for the fam. Very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howdy1LC"
},
"reviewBody": "Fantastic recipe, my Jambalaya loving son absolutely approved! Easy to follow and do. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "love this recipe. personally I add the shrimp with the rest of the meats because I feel that the shrimp absorbs more of the flavors that way. \nsecond time I made it I added 2 tsp cayenne pepper. it adds a nice little bite, not overpowering. love it.\nonce cooked, I like putting it in a 5 quart crock pot to keep warm especially if I am cooking for a big dinner like Thanksgiving or Christmas. this is a great addition to any meal it by itself"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lana 'Berg' Hutchinson"
},
"reviewBody": "Didn't have any peppers, so I made it without them but everything else was according to the recipe. Very tasty, and lots of leftovers! I'm going to have lots of yummy work lunches this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wattagurl"
},
"reviewBody": "GREAT recipe! Made this for a family reunion and everyone loved it. And we are in the Deep South, so I was up against some major good cookin’. This recipe won out! My son-in-law requests it every time he visits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angee"
},
"reviewBody": "Excellent recipe! I pretty much stuck to the recipe except I did what another reviewer said and I sautéed the rice in the bacon grease once the veggies were soft BEFORE I added the liquid. I also added some file powder to thicken it up. I don’t eat pork so I omitted the ham and substituted beef bacon and chicken andouille. I also doubled the chicken breast which I cooked by seasoning with cajun seasoning and sautéing. I added cooked shrimp from the store but next time I’ll cook it myself after seasoning with cajun seasoning. I had no trouble with mushy rice, but I did need to increase the heat once the rice was tender to cook out some of the liquid. Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fely"
},
"reviewBody": "Very good, not overly spicy so the hubby is good with it. I did make some changes, I used left over 2 different types of left over smoked chicken sausages in place of the chicken, used cheddarwurst in place of the smoked sausage as well as 1 bratwurst. I know its a fairly large change to still rate the recipe but everything else is the same and technically I used chicken and smoked sausage. I did completely omit the shrimp though, but seriously really good and not overly spicy it just kind sits on your tongue. Thank you FORDMAN88 for a great recipe that everyone in the house really enjoyed."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77572/bubbas-jambalaya/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1428/soups-stews-and-chili/stews/jambalaya/",
"name": "Jambalaya Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77572/bubbas-jambalaya/",
"name": "Bubba&#39;s Jambalaya"
}
}
]
}
}
, "about": [
]
}
]