				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bubble and Squeak"
,"datePublished": "2000-04-11T11:58:19.000-04:00"
,"dateModified": "2023-01-23T14:13:02.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Doreen Friesen"
,"url": "https://www.allrecipes.com/cook/334404"
}
]
,"description": "Bubble and squeak is a delicious way to use leftover potatoes, cabbage, or any veggies for a comforting side dish that makes the most of leftovers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Qj_5FOVyTTH1wZJ3VhGeugY62b8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/688333-f9cdd46e7e9849f59b49353b252c5b3a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bubble and Squeak"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "213"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "423 mg"
,"sugarContent": "4 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.5 medium head cabbage, sliced",
"3 slices bacon, diced",
"1 onion, thinly sliced",
"1 cup cubed cooked ham",
"1 tablespoon butter",
"3 cups potatoes - baked, cooled and thinly sliced",
"0.5 teaspoon paprika",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cook cabbage in a medium saucepan with a small amount of water until tender, about 3 to 5 minutes. Drain, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Cook bacon and onion in a well-seasoned cast iron skillet until onion is soft and bacon is cooked, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add ham, and cook until heated through. Add butter, then mix in cooked cabbage and potatoes; season with paprika, salt, and pepper. Cook until browned on the bottom, turn, and brown again."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Needs more flavor, pretty bland. I will add garlic and more onion next time I have leftovers to use up. But it worked for an Irish dish on St. Patty's Day, peasant food, with a cold beer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scooterward"
},
"reviewBody": "Absolutely loved it! Definitely 5 stars and definitely a keeper. Note: I cooked the bacon first so I could cook the onion and garlic in the bacon fat before adding the cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Tarpey"
},
"reviewBody": "definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri in BD"
},
"reviewBody": "Really great use for leftover ham and potatoes, esp. as I had half a head of cabbage lanquishing in the fridge. Used some chicken broth as my liquid and added a handful of green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumneyes"
},
"reviewBody": "My hubby made this for us last night. I thought it was fantastic! Next time we will add a little garlic powder and use red potatoes instead of russets,but that is it. Our neighbor came to the door and when we answered it, the first thing he said, was \"wow, It smells good in there, what are you cooking\" so we sent some home with him. You have to love cabbage, but we do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dianne Cherry Krumm"
},
"reviewBody": "My mom would make this with leftovers. From ham and cabbage. I love it. Much easier than cooking from fresh. Taste better each day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duke43"
},
"reviewBody": "Comfort food indeed! I scarfed up three helpings and my wife had two (very unusual for her). Used coleslaw mix as suggested by other reviewers. I only used a half a bag but next time (and there will be a next time) I’ll use a full bag to balance the cabbage/potato ratio when using three medium sized potatoes. Never been a big fan of UK cuisine, but this is the exception. Thanks so much for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Perfect. Wouldn’t change a thing, thank you for the excellent recipe. I would add a photo but it was gone before I could get one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Funk"
},
"reviewBody": "Gave me something to do with Thanksgiving leftovers. This recipe will definitely stay in my bag of tricks for future meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wendibird4"
},
"reviewBody": "It was ok. Wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "I made this according to directions. The only difference was I used my cabbage that I froze from my garden so I didn't have to boil it. The leftovers make a great breakfast with a fried egg on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SD Nole"
},
"reviewBody": "I loved it! The only issue I have now is not always having leftover Ham to make this more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GR8TSCOTT"
},
"reviewBody": "3 slices of bacon? Really? Well, I upped that a teensy bit, but otherwise made no major changes with one exception. Only used 1/2 cup of cubed ham since I was rather generous with the bacon. Very good dish, and I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i just actually made something similar today with pork sausage. It is a recipe my mother made back in 1972!! Cut 4 medium potatoes into quarters along with a small cabbage in quarters. Cook for 20 minutes covered in 1\" water and brown sausage at the same time in a separate skillet.. Drain veggies, add whatever seasonings and add to the sausage, cook until desired. Yum and easy. I like the potatoes browned somewhat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bohunk"
},
"reviewBody": "i just actually made something similar today with pork sausage. It is a recipe my mother made back in 1972!! Cut 4 medium potatoes into quarters along with a small cabbage in quarters. Cook for 20 minutes covered in 1\" water and brown sausage at the same time in a separate skillet.. Drain veggies, add whatever seasonings and add to the sausage, cook until desired. Yum and easy. I like the potatoes browned somewhat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Osborne"
},
"reviewBody": "Another one for the It'sa keeper column. This was delicious. I omitted the ham (I don't care for it) and increased the bacon. I cooked the onion and cabbage till it had a lot of brown caramelization. Hubbs loved it. Adding it to our favorites and will make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luckytop"
},
"reviewBody": "I liked it; I made it for breakfast and topped it with thin sliced smoked salmon and a poached egg. I found browning it without over-browning to be a bit of a challenge; over-browned cabbage is not a good thing. I will try to reduce fat content in future, as I found it to be a bit greasy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "Absolutely delicious. Easy to make. Only trouble I had was that I didn't get the crispy crust. I may have been too impatient. Next time I may try individual patties so I can flip it more easily. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lanny Porter"
},
"reviewBody": "Traditionally a Boxing Day cleanup of leftovers, however I also make it the day after St. Pat's Day to use up leftovers from Corned Beef &amp; Cabbage and I use chopped Corned Beef rather than bacon or ham, Onions, leeks or scallions are sauted in rendered fat from the Corned Beef, then add in cabbage potatoes, carrots &amp; CB. Always in a well seasoned cast iron skillet. Season to taste with salt and pepper. Serve with toast and fried eggs..... MM..MM..GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan Smith"
},
"reviewBody": "This was the first time I made it - a friend has made it for me in the past, and I found this recipe to try.\n\nRather than a head of cabbage, I used a bag of cole slaw mix and cooked it for a few minutes in a separate pot.\n\nBoiled my potatoes and used those.\n\nNext time I make it I will make small patties and fry them in a cast iron skillet, I think this would make it a better way to cook and serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britt3ns"
},
"reviewBody": "I couldn't love this recipe more. Made as directed the first time except I used chicken broth instead of water for cooking the cabbage, and I cooked the bacon for a while before adding the onions as per the reviews. This time I didn't have any bacon so I added Worcestershire sauce for extra flavor and a bit of extra butter. So wonderful to know I'm smelling a kitchen half a world away when I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flowergirl"
},
"reviewBody": "I have long wanted to try Bubble &amp; Squeak, being fascinated by all things across the pond. This morning I realized I had all ingredients on hand so I dug out my cast iron skillet &amp; had a proper fry up! I cooked the cabbage in the skillet because I didn't realize I was meant to cook it in a saucepan. It was great! tender &amp; browned to perfection. This may have been the first time I made this dish but it certainly won't be the last!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Fenton"
},
"reviewBody": "I made this for dinner tonight and we all loved it! I will make this when I ever I have left overs. My son said, he thought this would be really good with some grated cheddar cheese sprinkled across the top of it. Thanks for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmcnicho"
},
"reviewBody": "Double or triple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanandBilly Morris"
},
"reviewBody": "I read many of the reviews and realized that many of them did not \"get it\"... in England this is a way of using left overs so comments about how long to cook the cabbage or potatoes are really irrelevant. Its whatever you have so long as it includes cabbage and potatoes. I actually love it when the potato gets all sqooshed down because then it browns and gets crusty. The best bit for me! Even if I am using bits of left over ham I will fry one or two slices of bacon to get the bacon fat. If you have to follow a fat free diet so be it but 2 rashers of bacon between 4 people really is not overkill. My Dad used to make this and he would add a knob of butter too to add even more richness. If you want to keep the fat to a minimum make the mix into little cakes and brush the bacon fat on each side.... just enough to give it that crusty brown top and bottom. Brussel sprouts is amazing mixed with this and bits of carrot give it a sweetness. In our house this was part of a breakfast or brunch that would include eggs. The lovely runny yolk on the little cakes reminds me of poor mans Eggs Benedict!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CORITA"
},
"reviewBody": "I threw this together and loved it. Used thick sliced pepper bacon and drained off some of the grease. Gave it just a touch of heat. It was quick, easy, and delish. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "Just made this with left over corned beef brisket. I added chopped celery to the onion and didn't use bacon. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol Dean "
},
"reviewBody": "I've never made it with Ham... just lots of bacon and cabbage and potatoes. The Ham does make a nice addition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susied"
},
"reviewBody": "Growing up, this recipe was always made with left overs from a Sunday night's boiled corned beef and cabbage dinner. No ham or bacon, just the corned beef, cabbage, potatoes, and carrots...yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisagirl"
},
"reviewBody": "I'm with the black sheep. It was ok. Since everything is about opinions/tastes, I'm not gonna knock it. I only thought it a little too bland. I had a party a couple of days ago and had a potato bar. I had tons of leftovers and exactly what I needed according to the recipe. The paprika, salt and pepper helped, but I suggest adding your favorite seasoning to help it out. I added pepper flakes, and a little garlic. I knew my husband would add some hot sauce to his. It definitely has potential and if you have occasion to serve a traditional meal, this would do the trick. Again, personal tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattyP"
},
"reviewBody": "This recipe is comfort food at its best. I made it for New Years Day, to go along with our black eyed peas. My husband loved it and went back for seconds (which he rarely, if ever, does!) I made it in my cast iron skillet and it did stick a little, but not that much. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina"
},
"reviewBody": "family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "This is delicious as is! However, it can be made a little healthier and still as delicious: To preserve nutrients otherwise lost to the cooking water, microwave the cabbage for 2 minutes to soften. To cut back a little on fat and calories, use a small amount of olive oil to cook the onion and microwaved cabbage, and bacon that has been pre-cooked and drained of grease (but don't eliminate the bacon pieces! It really makes the dish!). I also use a higher cabbage:potato ratio. Sometimes sweet potato, sometimes no potato. Another delicious variation is to use smoked turkey or duck instead of ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Nixon Heydolph"
},
"reviewBody": "I make this with a sausage instead of ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "Yum! This is such a great throw together one pot meal!!! My dad came over and practically licked his plate! There was hardly any left for leftovers either. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Thorn Renner"
},
"reviewBody": "My whole family enjoyed this, as did a visiting 4-year-old neighbor child, who declared \"That was soooo good! I never had cabbage that I liked before!\" I was looking for a way to use up some potatoes and leftover ham, and this was perfect. I boiled the potatoes (not too long) and then cubed them. I used smoked paprika. I also used maple bacon, I love that stuff. I like the idea of using Spam instead of ham; might try that next time. Accompanying it with fried eggs also sounds good. No leftovers here!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCMARY"
},
"reviewBody": "This was really good. I used a bag of shredded cabbage (cooked it as directed). I cooked the bacon separately and drained off the grease before adding the ingredients all together. I sauteed the onion in the butter. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HOPEANN"
},
"reviewBody": "Tastes great. NEVER use nonstick pans. (Unless you want cancer)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "elfgirl1968"
},
"reviewBody": "Great comfort food dish for winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen B"
},
"reviewBody": "I really enjoyed this. I would double the cabbage though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngZ"
},
"reviewBody": "This recipe was certainly interesting but I always love eating cabbage and ham together and this was no exception. I did follow the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "coleebear"
},
"reviewBody": "Wasn't bad. My picky dad had seconds and my daughter ate it all once she picked out the onions. Took a bit longer than 30 though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Delicious! Even my husband-who hates ham and potatoes-and my 1 year old daughter loved it. I made a few changes. Because I used honey glazed ham, I omitted the bacon so that the flavor of the ham was the main focus. I microwaved the potatoes to save time. I used olive oil to saute the onion (omitting the butter), then added the ham. Also, I doubled the paprika, added garlic powder and seasoning salt in addition to salt and pepper. My potatoes were a little dry, so I added 1/4 cup of water to the bottom of the pan, covered it, and let it simmer until the liquid was absorbed-about 5 minutes. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hazel Watson"
},
"reviewBody": "I liked it, but my family didn't, so I probably won't make it again. (I have some really fussy eaters!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "motherofthree"
},
"reviewBody": "4 1/2 is what I would give if I could. I did do some changes as I had no bacon. I applied what some other users had suggested and I sauted the onions in olive oil, I added roughly 6 crushed garlic cloves (for flavor) and I had mushrroms so I cut and sauted them as well. I used the whole head of cabbage and salt and pepper to taste about 1 cup chopped carrots as well. It was pretty good. I couldn't sway my husband over to the cabbage though so maybe the bacon would have done the trick? LOL! Very good and I thank you so much for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine And-Brian Threlkeld"
},
"reviewBody": "This was awesome. My grand dad used to make this for us when we visited England. I always make a traditional English dinner with Roast Beef, Yorkshire pudding, brussel sprouts, peas.... My hubby and I wanted something \"different\" tonight so decided to make this recipe and an Egg. We changed it up just a bit by adding Peas and Conecuh sausage (a southern tradition-smoked sausage from Conecuh county Alabama). It was Excellent. Can't wait to do it again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geekmom"
},
"reviewBody": "A great way to use up leftovers from christmas dinner. You can throw in just about any veg so long as you have the right proportion of potatoes! I think the potatoes should be mashed, not sliced in order to be authentic, so that is what we used, and the result was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmatheson"
},
"reviewBody": "Absolutely delicious! I only had about a third of a head of cabbage and am glad because I thought that amount was just perfect. Next time I don't think I'd put in as much ham. We really liked this and would definitely have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "galleywench1"
},
"reviewBody": "I converted this to a casserole, &amp; loved it! Since last night we had roast pork, potatoes &amp; onions, with roasted acorn squash &amp; boiled cabbage, I made extra to try out your recipe. First, dice all the vegetables &amp; potatoes. In a cast iron skillet, fry the pork with chopped bacon (once that was frying, add a chopped onion to it) and continue frying until the meat is browned &amp; onion is transparent. Put all the ingredients into a large casserole. Make a brown gravy &amp; add salt, pepper &amp; other seasonings to it; fold into the casserole. Bake covered at 425 F. for aprox 20 minutes, then uncovered for another 10 minutes. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lilu"
},
"reviewBody": "Easy but relatively flavorless if using something besides leftovers. Definitely use with full flavored, leftover ham for (I'm guessing) a better flavor. Honestly a little boring. Did not use bacon though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Mical"
},
"reviewBody": "I make this with mashed potoates and everyone LOVES it. Surprisingly wonderful dish :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Stephens"
},
"reviewBody": "I omitted the ham and bacon and used smoked Kielbasa instead. I fried the sausage in a non-stick electric skillet first and then added the onions and cabbage, cooked til tender and added the potatoes and seasonings to warm up. A super way to use cabbage fresh from the garden - delicious! Thanks for the post."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "waterious"
},
"reviewBody": "This is such a tasty dish my husband asks for it regularly. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEP"
},
"reviewBody": "I liked this dish a lot. I wanted to find a recipe for cabbage. It is very tasty and the other members of my family liked it also. I used turkey bacon and turkey ham and it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adrian Munt"
},
"reviewBody": "Made a vegetarian version with Morning Star Bacon and chopped veggie sausages instead of the Ham. It was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I made this for lunch and even my husband, who hates cabbage, loved it. He ate 2 bowls. Not bad for a meat man."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirelle James Edghill"
},
"reviewBody": "YUM! I loved this easy and cheap recipe! I didn't have ham, so I subbed in 1 c. leftover cooked pork chops. I love that it's low in calories, as well. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Malina Bleeding Heart Morris"
},
"reviewBody": "Very simple and very good. I added a some garlic powder for a little extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "midwestchef"
},
"reviewBody": "We had Bubble 'n' Squeak in Scotland and I was pleased to find this recipe on AR. It's a good take on the real thing. I will make it again. As another reviewer said, you can add horseradish, spicy mustard or whatever you like to spice it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dv8r"
},
"reviewBody": "This ROCKS!!!!!!!!!!! It woke up some genetic remeberance in me soul! I added a little white pepper though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gena Sissy Garner Crawford"
},
"reviewBody": "I don't usually review recipes I adjusted but I saw several reviews that were trying to reduce the fat in this recipe and I wanted to share what I did. I boiled the potatoes in some ham base that I got at a local store and then I used the potato water/ham base combo to steam my cabbage. It was very very tasty and I reduced the need for bacon but still it had a great seasoned taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roberta"
},
"reviewBody": "not very tastey. I have had it with broccoli and roast beef"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronald"
},
"reviewBody": "This was very,very good. My wife and I had read about this in an Anne Perry novel so we decided to try it. We were both pleased with the results. Thanks for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GoBoilers05"
},
"reviewBody": "Great recipe! Simple and quick with great flavor. Since my husband doesn't like onions, I used onion salt and it came out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whiteorchidbloom"
},
"reviewBody": "what a tasty dish! i wanted it as a side so i only used the bacon. i did not have leftovers except for baked potatoes so i chopped rhutabagas and cooked in chicken stock till 1/3rd done, added carrots until almost done, and the added cabbage. the veggies sucked up almost all the stock so they they very tasty. i crisped bacon in a nonstick pan, took out and diced, poured off fat,and sauteed chopped onions, added garlic, then added strained and tossed veggies and chopped potatoes, the diced bacon, and chopped parsley, salt, and pepper. i drizzled on olive oil which made it down to the bottom of the pan and then smashed it down with a spatula. i browned it and used a plate on top of frying pan to invert and put back in pan to brown the other side. i then added a splash of balsamic vinegar when done. what a super combination of flavors!! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janeyc134"
},
"reviewBody": "This was a great recipe and easy! I didn't have ham so I doubled the bacon also I added about 1/4 vinegar during the cooking process. This meal was loved by everyone in the family, which is no small feat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LOACHIE"
},
"reviewBody": "I followed this recipe exactly and wish I had spent more time reading reviews. I found 5 minutes not long enough for the cabbage. I found my large pan was not big enough to brown the dish in one flip. I think I will cook this again but I will modify it. As written 3 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miss1977"
},
"reviewBody": "Comfort food! Bacon and leftover pork chops make it wonderful. Will make again for family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amethystshells"
},
"reviewBody": "This recipe was excellent. I used red potatoes and red onions. For the ham, I baked a picnic ham and used the leftovers for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thewillmanns"
},
"reviewBody": "I made this not actually thinking any one other than myself would enjoy it. My picky son loved it and still talks about \"bubble and squeak\" and my daughters and husband liked it as well. It was easy to make and cost effective as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LucyDelRey"
},
"reviewBody": "I think everyone is being a little tough on the poster. I have seen many variations of this recipe including those with east European origins. I think that this was created by \"bare pantry items\" when times were tough financially and ingredients were sparse. Like its \"cousin\" bubble and squeak was created as way of using up leftovers. There are many dishes that followed this concept during war times or the \"Great Depression\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MsTish"
},
"reviewBody": "YUMMY! I didn't think my hubby would like it, but he LOVED it! We both did! We wanted it as a side dish so I left out the ham. Instead of bacon, I used a few bacon bits crisped up in a little canola oil. I also used light butter instead of regular. My skillet wasn't large enough so I couldn't flip it over, but it didn't matter. It was still good stuff! Tastes even better with a little Texas Pete hot sauce sprinkled on top. Will definitely make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnne Flynn-Poeschl"
},
"reviewBody": "A win!! Even my 1 year old loved it! My husband made himself a sandwich, wouldn't even try it. I think it rocked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Hogue Sisk"
},
"reviewBody": "Good stuff! A little hard to believe that it only has 164 calories per serving, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BODIE358"
},
"reviewBody": "My mother was from England and this has always been one of my favorite dishes. The bubble part of the name refers to the traditional boiling of the potatoes and the squeak comes from the sound the cabbage makes when cooking. This would have gotten 5 stars if it would have used leftover mashed potatoes instead of baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DEBMCE4"
},
"reviewBody": "Great recipe. I had leftover potatoes, kielbasa, and brussel sprouts from a crab boil. I added some leftover mash potatoes, chopped carrots, peas and stirfried coleslaw with some seasoning salt &amp; pepper. I used a little bacon grease to carmelize the onions and cook the meal in. Looks a little strange, but we can't wait for lunch tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jolley900"
},
"reviewBody": "My hubbie and I liked this recipe. My only complaint was that it took me about 3x longer than the recipe states for me to make this. If I has made it using leftovers like the tradition it would have gone a lot faster. The cabbage was great and I used one of the other suggestions and added a bit of ceyanne pepper. This is totally NOT a \"healthy\" recipe though so skip it if you are watching your weight. I will make it again however I doubt it will become one of my weekiy staples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer M."
},
"reviewBody": "My family loved this. Even my husband who does not like cabbage. He even had seconds and took leftovers to work. My 6 year old liked that he could put ketchup on it. I did have some problems getting it to brown. Overall a success. We will be adding this to our menu rotation"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RosemarieSayvers"
},
"reviewBody": "My husband says it's \"excellent.\" Suits my husband's starchy taste to a \"T,\" though it's way to heavy for me.\n\nTo get it brown, I simply put the skillet under the broiler on high for about 5 minutes at the very end (keep an eye on it, though) and both sides came out nice and brown without any flipping at all. Used kilbassa for the ham, the bagged, shredded cabbage that everyone's recommended so far. Also cayanne and black pepper instead of Paprika, since we didn't have the Paprika on hand. Worth a try on a blustery winter night"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rowan"
},
"reviewBody": "I had recently made this wonderful dish for our Harvest gathering of friends. It is also the English(British) equivelent of Colcannon, according to my Half Brit/Greek other half. Anyhow I started to prepare it according to the measurement in the recipe but I did somewhat double the amounts &amp; also added one thing the recipe did not include and that was just a pinch of ground cinnamon.\nTo my surprise, it was the hit of the gathering, and even my other half still raves about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dave's girl"
},
"reviewBody": "This is great! Full of flavor. I misread the recipe and didn't have enough time to bake my potatoes, so I substituted frozen tater tots and it was a huge hit. Everyone requested this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHELS"
},
"reviewBody": "My boyfriend says this reminds him of home in England. I had never heard of Bubble and Squeak until his family introduced it to me, and though I just had to give it a try. It's now one of my ultimate comfort foods, and makes a delicious meal for lunch or dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PEEVERS"
},
"reviewBody": "Delicious, easy, and filling. A good combination as is. I did not have cooked potatoes, however with a microwave and one of those quick cook potato bags it really did not add much cook time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAFEMAN"
},
"reviewBody": "We loved this dish. I don't know where the name comes from but this is a good dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susanna"
},
"reviewBody": "I had leftover boiled potatoes and cooked cabbage. And I had a hunk of ham, so decided to try this. It was good. Not great, but a nice hearty meal I would certainly consider making again. What I did like was that I could make this in the early afternoon, pop it in the fridge and then refry the whole thing to warm it up during our busy dinner hour. EDIT: Since first reviewing this in February, we have found it has become a regular in our meal rotation, having it at least 2X a month. Good simple eating that everyone here seems to enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Wood"
},
"reviewBody": "This dish was very good, and flavorful!\nAlthough, if starting from scratch and not using leftovers, it does take quite a long time to make...More like 1 hr and 15, vs. the 15 mins it states."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROOKIE COOKIE"
},
"reviewBody": "I made this exactly like the recipe said and both my wife and I really liked this and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy G."
},
"reviewBody": "This was a different version of the bubble and squeak I do, this one using cabbage and oh is this so good. The frying of the bacon with the onion was a tremendous start and made the whole dish more flavorful. Leftover pan fry up well the next day also and my husband didn't even complain about eating that much cabbage. Thanks so much for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIM PHILLIPS"
},
"reviewBody": "Loved it... used Polska Kielbasa instead of ham and small red potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Silky"
},
"reviewBody": "Yum! I made this twice in a week! The second time i diced the potatoes instead and and grated white cheddar on top after it was cooked through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellie Callihan"
},
"reviewBody": "Absolutely delicious! The whole family loves this one, even my young boys (ages 6 and 4)! They practically salivate when I say \"we're having Bubble 'n' Squeak for dinner!\" Makes great leftovers too, but they never last long in this house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy W."
},
"reviewBody": "We love this recipe. My grandmother made somthing similiar to this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PUNKGIRL"
},
"reviewBody": "This was really tasty and such an easy way to use leftovers. I'll definitely be making it again. I couldn't get it to stick together at all, so I just kind of stirred it around. I think it would have been better if I could have gotten it nice and browned on once side and flipped the whole thing. Maybe when I have leftover mashed potatoes I'll try it with those."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "How could you not make a recipe with such a cute name? I'm usually not crazy about cabbage, but the other ingredients in this provide enough flavor that it doesn't strongly taste of cabbage. I was not able to get it to stick together in order to flip it, but just turned portions of it at a time to brown both sides. I thought the taste was delicious. It does, however, require a good bit of prep to prepare the ingredients, and it took me a lot longer than the stated time. For that reason, it will not be something I make often, but only occasionally when I have the time to mess with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NICKIG"
},
"reviewBody": "Delicious! I'm not a cabbage person but this is really yummy. Even the family can't get enough of this one. A keeper for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joyce"
},
"reviewBody": "A great addition to any main dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALLIE101"
},
"reviewBody": "This was really good. I was very sceptical at first because of the looks of it, but it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elfhelp"
},
"reviewBody": "Had some Englanders over and served this. Their only disparaging comment was the potatoes should have been chopped, not sliced. And don't forget the Paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April Mae Macdonald Rugletic"
},
"reviewBody": "Came across this accidently...I couldn't resist making it with a name like that. Ahhh...a wonderful comfort food recipe. I was hoping for more cabbage...so next time I'll used a whole head. Oh, and less ham. But these changes are just for our taste. The recipe was very good otherwise."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18854/bubble-n-squeak/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18854/bubble-n-squeak/",
"name": "Bubble and Squeak"
}
}
]
}
}
, "about": [
]
}
]