				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Buffy&#39;s Refried Beans"
,"datePublished": "2019-04-03T23:45:35.000-04:00"
,"dateModified": "2019-04-03T23:45:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Buffy Ehlers Whitney"
,"url": "https://www.allrecipes.com/cook/buffywhitney"
}
]
,"description": "These smooth and creamy beans make a tasty side for any Mexican dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z5cWl8FLh0-Mj-4ju4AN-2M-3n0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5433486-44838b33ad564becac6fae7f45a49f15.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Buffy&#39;s Refried Beans"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "101"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "282 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "7 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "439 mg"
,"sugarContent": "0 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.5 cup lard",
"3 (15 ounce) cans pinto beans, rinsed and drained",
"salt to taste",
"1 cup water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt the lard in a deep, heavy pot over medium-high heat; when the lard is hot, add the beans. Stir constantly while cooking until the beans reach a paste-like consistency. Season with salt. Reduce heat to low and stir in the water. Simmer and stir until the beans cook down to your desired consistency."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen P"
},
"reviewBody": "Very tasty! I used fat leftover from a crockpot pork shoulder. Also thinned with chicken stock Instead of water as a reviewer recommended. Delicious smoky taste. It didn’t need any salt with canned beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turned out very tasty. A great side dish, even for a basic sliced ham. While we stay home due to the pandemic, I’m trying to use our pantry stock. So this was made with canned black beans. And since I don’t have lard, I subbed coconut oil. Didn’t need much additional liquid at all and in place of salt I kicked up the flavor with some of my own blend of chili seasoning. Only made a small portion using one can (just in case), but the family liked it so it’s going into the side dish rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattisutton"
},
"reviewBody": "This turned out very tasty. A great side dish, even for a basic sliced ham. While we stay home due to the pandemic, I’m trying to use our pantry stock. So this was made with canned black beans. And since I don’t have lard, I subbed coconut oil. Didn’t need much additional liquid at all and in place of salt I kicked up the flavor with some of my own blend of chili seasoning. Only made a small portion using one can (just in case), but the family liked it so it’s going into the side dish rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cameron Becker"
},
"reviewBody": "Tasty! Substituted the Water for hot chicken broth. I recommend soaking dry beans in water overnight, but canned beans are alright"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OCDawn"
},
"reviewBody": "Delicous and easy! Definitely use chicken broth and top with shredded jack cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trkeillor"
},
"reviewBody": "Oh my goodness! So amazing! Bless you for sharing this recipe!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used garlic salt for the salt and chicken broth for the water. Cooked to a slightly chunky consistency. Very close to authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "thedailygourmet"
},
"reviewBody": "If you want a basic recipe to build from this is it. I’ll admit I cheated and cooked this in my instant pot. As simple as melting down your choice of fat (lard, oil, butter -yum!) I reduced the amount of fat I used, and used the sauté mode, and lightly sautéed for five minutes then pressure cooked the beans 7 minutes with a natural release. Then used my immersion stick blender to lightly mash the beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kizzo"
},
"reviewBody": "I made this almost exactly as written except I had to adjust ratios. I had 2 cans of pinto beans so I used 1/3 cup lard and I used 1 cup chicken broth in lieu of water. The recipe needed garlic (3 cloves, crushed) and cumin (1 Tablespoon). I finally used an immersion blender. Excellent BASIC recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdegood"
},
"reviewBody": "Very yummy refried beans. Stuck to the recipe other than used chicken broth instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cajun_voyageur"
},
"reviewBody": "This was really good, however I found that it needed more seasoning. I like things a bit spicy, so I added chopped jalapeno pepper as well as shredded cheddar. It is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwfalls78"
},
"reviewBody": "I used black beans instead of pinto, but everything turned out great. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheJulie"
},
"reviewBody": "This was DELICIOUS! I made them for Christmas (we do enchiladas every year). I was really skeptical the whole time because the lard made it smell SO weird, but once it cooked down and I added a little salt, it was SO tasty! Even with our small family of 4 (adults), I'd recommend doubling the amounts so there is enough for seconds and leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christopher Shaplin"
},
"reviewBody": "My brother was making tacos and I wanted a quick side dish with what I had on-hand. I saw a can of pinto beans in my pantry and a quick search led me to this recipe. I used some butter and little bit of drippings from the beef my brother was browning because I didn't have lard and I cut the recipe in third because I only had one can of beans. After plating it I threw some shredded cheese on top. I will make this again without doubt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "I used 1 pint jar of home canned great northern beans, fried in a few maybe 3 Tablespoons of canola oil, salted and mashed with a fork until smooth-I didn't add any water. Really creamy and really, really good! Five plus stars!!\nLOVE IT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alice Mark"
},
"reviewBody": "Good starter recipe! I used vegetable oil instead of lard. Heated oil, put in one diced onion, minced garlic, and a heap of cumin. Cooked beans and added chicken broth. At the end they needed a little zip so added some pickled jalapenos along with the juice from the jar. Kids loved them - just like the restaurant!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Connorsmommy83"
},
"reviewBody": "This a very good base recipe. I made as directed then added a few shakes of onion &amp; garlic powders to get it where I wanted it for my large gathering. Overall, very good &amp; will make again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcook45"
},
"reviewBody": "Just like your local Mexican restaurant. Make with \"Mexican rice II\" for the perfect rice and beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes cook"
},
"reviewBody": "I did not have lard on hand so used butter, not a good idea.I definitely will be trying this recipe again but using lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Oh my gosh! I can't believe I have been wasting my time cooking the beans from scratch. This recipe is so easy and absolutely delicious! I added a bit of minced garlic, onions and a pinch of oregano. I then wrapped it up in a flour tortilla, poured enchilada sauce over the top and sprinkled it with cheese. Microwaved it to heat up the sauce and melt the cheese and garnished it with shredded lettuce, diced tomatoes and scallions. AMAZING!\n**PS. Be VERY careful with the salt. I completely ruined my first batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Made 2 batches 1 with butter and 1 with bacon grease as opposed to lard. Bacon grease was much better. Bland as is but with chicken broth subbed for water and some extra seasoning, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah"
},
"reviewBody": "Made for friends and the pot was emptied! Used bacon grease instead of lard. It's all I had from the morning breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dritz"
},
"reviewBody": "I think this is the first recipe I have rated on this website. I just loved these beans, just as the recipe is written. Use the lard and don't try dressing it up with all sorts of spices and such. They are like what you'll find in a restaurant, simple and good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keith"
},
"reviewBody": "just what I needed --thanks for submitting the recipe----yum yum no changes necessary on perfection"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowbird"
},
"reviewBody": "I agree with all the good reviews. I made these as my feeble attempt for a complete Mexican dinner. Fajitas and rice were so-so but these beans were outstanding. I always prefer beans over rice but not my husband - until tonight. He ate most of them and when the bowl was empty, he took a spoon to get every little morsel. I used lard and would recommend it. I found it by the shortening at the grocery store and it was very inexpensive. \n\nI only used one can of beans but in the future, I'll make at least two so we'll hopefully have some leftovers. \n\nI wonder if there is a Buffy's Fajita recipe. Would love to try it if there is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delisa Ramos"
},
"reviewBody": "Added some garlic and cumin. Very good. Used them for nachos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chancy W"
},
"reviewBody": "They turned out perfectly! I never knew I could make refried beans at home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOTIESMOM"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "I make my beans kinda like that...I use a stick of butter, a bunch or garlic and jalapeno to taste. I keep them from getting to thick by adding a bit of stock. At the last minute I add a bit of lime juice. Delish~ Top with cheese, sour cream and avocado. Eat with tortilla chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I tried this tonight. I used the beans to make bean tostados. Instead of adding water to thin the beans, I reserved the juice from the can and added that. It gives much more flavor. I won't buy another can of refried beans again. Thanks for this great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slo_cook"
},
"reviewBody": "This is how I have made home made refried beans for 30+ years except I ALWAYS use saved bacon fat instead of lard even though they are the same thing. Yes it's ok to use rendered pork fat of some sort. I use 2 lbs of dried pinto beans soaked over night and cooked the next day with the desired Latin spices added to the cooking water. When mashing them I use some of the cooking liquid as needed to get them to the desired consistency. After mashing they go into a large cast iron skillet with the bacon fat melted and very hot. It takes 2 batches to do 2 lbs of beans but worth the time. After stirring several times I adjust seasonings for flavor, turn off the heat, let them cool and portion them into zip top bags for freezing. This way I always have ready made refried beans on hand and don't have to use canned ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael"
},
"reviewBody": "Delicious! Will never buy canned beans again. I took the suggestions from another reviewer and used chicken broth in place of water and added garlic and cumin. And I used the lard, which I think made ALL the difference in taste. Thank you for the recipe Buffy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Very easy! I started from scratch using raw pinto beans that I cooked in a slowcooker until done and easily smashed. I then fryed in pan with a little butter and garlic.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Claude Faerden"
},
"reviewBody": "I didn't have any lard so I used Bacon. It was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Banana"
},
"reviewBody": "LOVE!!! I also substituted the lard for butter because that is all I had. Turned out fabulous!!!! After it was done cooking I put it in the blender and let it mash them for me! So yummy and so much easier than crock pot versions. Printed and saved it for all of my future refried beans needs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Amaro Prince"
},
"reviewBody": "I am Mexican and this is how we have always made our beans. They are the best! But if you don't have lard on hand, you can use the drippings from fried chicken, or bacon drippings. Another thing I do (because my palate is so particular) is, go to your local Mexican Market and buy lard from them because it's fresh drippings from the pork they cook in their store, free of preservatives or other unnecessary additives that I can taste in the store bought lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manda"
},
"reviewBody": "Smooth and creamy is correct! I followed another reviewer's advice and added my water slowly, along with garlic and onion powder. I used veggie stock instead of water and it all came together beautifully. These are the most flavorful refried beans I've ever made at home. I will use this recipe again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stargrl"
},
"reviewBody": "This is IT! I won't try any other refried recipes, I am a happy girl. Soaked 3 cups dried pintos overnight, then drained &amp; cooked this morning for 1.5 hours with half an onion in it. Tossed the onion, drained beans &amp; reserved the liquid and followed the directions including lard. This is exactly like the authentic Mexican restaurants in the area... I kept sneaking back for tastes of it! I did add 1/4 tsp garlic pwd, 1/2 tsp each cumin &amp; chili pwd, and 1 tsp chicken bouillon added to my bean liquid. As others say, go easy on the salt, you can always add a bit more at the end. With the bouillon, I only needed 1 tsp salt, and could have maybe used a tad less. \r\n\r\nFor those who didn't use lard, you really should buy some. It gives it a much better flavor than just veggie oil. It's called Manteca and you can usually find a white &amp; green container of it in the Mexican aisle at Walmart or ask about it at your grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Haskins"
},
"reviewBody": "If you're looking for the best refried beans recipe ever, you can stop right here because you found it. If someone would have told me that I could make better beans at home than I've had in ANY restaurant, I wouldn't have believed it, but it's the truth. \nHere were my modifications:\nI used two cans of mixed beans (pinto and northern) and two cans of pinto beans.\nI used 1 and 1/3 cup of chicken broth instead of water.\nI added some dried cilantro, a teaspoon of home made taco seasoning, and a finely diced onion.\n\nI'm sure this recipe would have been wonderful without the modifications as well. Enjoy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joyce Adkins"
},
"reviewBody": "A little too muc lard for me, will cut that back next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wynne Leaf"
},
"reviewBody": "I loved these! I never could seem to get mine creamy. The only thing I changed was to use bacon fat instead of lard. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chip"
},
"reviewBody": "Made my own lard by rendering fat from a pork shoulder. This recipe calls for lard and this one simple ingrediant makes it great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Robinson"
},
"reviewBody": "These beans were delicious. I did not have lard on hand, so I used Crisco instead. I also added about a 1/4 tsp of ground cumin. These are the standard refried beans for our Mexican nights now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nikolette T"
},
"reviewBody": "This really didn't have much flavor. I chose to perk my beans up by adding a few spices and some quesadilla cheese I had on hand. After adding cheese, ground white pepper, a little cumin and marjoram and thyme I had a delicious filling for my Mexican dishes and a smooth and creamy side. It's a good base recipe to work from, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJGammon"
},
"reviewBody": "Made with fresh cooked beans, 2 cups to a can. Made a batch and a half. Had to use butter as had no lard... Pretty darn good but slightly, well, sweet. Added a good measure of garlic salt and 1/2 tbsp chili powder. Husband says they are the best refried beans he's ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaleenhoward"
},
"reviewBody": "i have been searching for the refried beans that taste just like the ones back home in AZ, these are pretty dang close and so simple too. thanks for posting this one!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisamarie78"
},
"reviewBody": "I used dry pinto beans I cooked, and subbed bacon drippings for lard. I mashed with a potatoe masher and let it cook for a good 1/2 hour (maybe my beans weren't cooked long enough?) Added about 2 cups of water overall, in 1/2 cup increments. They are so so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodObsessedMom"
},
"reviewBody": "Fantastic! Used butter instead of lard (no lard on-hand) and just the bean juice from the can. No salt. So, basically just 1/2 c. butter and 3 cans of pinto beans. DELICIOUS! I didn't know making refried beans could be so easy--and tasty. Thanks, Buffy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hippie_mama"
},
"reviewBody": "Hurray for lard! This recipe is awesome--exactly what i was looking for in the middle of a blizzard when my pantry was nearly bare. The only thing i suggest is to start with dry beans. Soak overnight and slow-cook until soft, then use in place of the canned beans. You'll need a bit more salt or other seasoning, but you'll save yourself some money as well as unnecessary preservatives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MakeItWork"
},
"reviewBody": "4.5 stars as I could tell recipe would be a little bland for myself but great method and jumping off point. I cook up dry pinto beans (inexpensive &amp; easy to cook in crock pot or pressure cooker) and can be done day in advance. Anyway...I did use lard (I make myself) while bumping up flavor-wise (Chili powder/cumin/garlic/coriander/minced jalapeno/grn onion). Used my reserved bean \"juice\" vs water and I 're-fry' in a large cast iron 'chicken fryer' skillet. Be mindful about adding salt until very end because as these cook down salt will intensify (especially using canned beans). I make a larger batch to portion out and freeze. Very handy to have for future uses! All in all, very little work &amp; much better then store bought. After about 15 mins of simmering/stirring I use a masher to help things along when liquid added in. Takes me about 30 minutes total. Thanks for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "waldon42"
},
"reviewBody": "So good, I don't think I will buy can refried beans again! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Naomi"
},
"reviewBody": "Huge hit! I only gave a 4 star due to minor tweeks. Instead of water I used chicken stock, chopped garlic..about 4 cloves, and 1/2 to 1 tsp of cumin. I also cooked up half a tube of churizo and added half the beans into that when they were done..very good! FYI a potato masher is a dream come true when mashing the beans!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frazzled"
},
"reviewBody": "I used a lager instead of water and vegan butter instead of lard but the results were very tasty- if the consistency isn't exactly what you were looking for just adjust the liquid or let it evaporate a bit longer. I did add a few shakes of achiote for an extra bit of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebbieG"
},
"reviewBody": "I'm not exactly an expert on refried beans, but where I live you get them out of a can or not at all. No longer! This recipe made making refried beans quick and easy. Even using canned beans this had a nice fresh taste. I used butter, as suggested by another reviewer and tossed in a little bit of salsa (small amount) with the water. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "khastings"
},
"reviewBody": "First time making refried beans and they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TAURUSGIRL"
},
"reviewBody": "I made these with lard. Used chicken broth and added garlic and a dash of cumin. These were good, but I cooked too long, thinking they would be better and they got dried out. Super easy. I will make again, but won't cook so long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mwasheck"
},
"reviewBody": "Great as recipe states."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mariannematthews24"
},
"reviewBody": "i like this style recipe for the beans better than the vegetarian ones. i don't like the idea of using lard so i substituted vegetable shortening in the same quantity...makes for a much creamier taste. also i added cumin, salt and pepper and a touch of garlic onion with a little salsa in the final mix. my girls ate it like it was going out of style. usually my recipes miss out on account of kitchen inexperience, but this one was an absolute winner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teggyce"
},
"reviewBody": "Very good recipie!! Easy quick and very tasty! I did not have any pinto beans so I used black beans instead. Also as another user had said that you could substitue butter for the lard and since I don't have any lard I used butter. I will deffinatly make this again per the instructions and I'm sure it will taste even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brittany0424"
},
"reviewBody": "These were super bland to us, although I do love how EASY they were to make!!! I used butter flavored shortening instead of the lard and added: 1 Tbs. salt, 1 tsp. pepper, 1/2 tsp. garlic powder and 1/8 tsp. cumin. We loved them doctored up and will probably never buy canned refried beans again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy"
},
"reviewBody": "I will never buy canned refried beans again. These are SO much better. I used butter instead of lard, and We like things spicy, so I added a diced jalapeno, a couple chopped garlic cloves, and some chopped onion to the butter and sauteed that briefly before adding the beans. I could make a meal just out of this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karin"
},
"reviewBody": "Mmmmm... LARD! Sorry had to say it. I cut some of the fat out and it was still way too greasy, also needed SPICES... garlic, salt, onion etc. There are other recipes on AR that I prefer... especially the 'beans without the re-fry'!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracydenese29"
},
"reviewBody": "First time attempting to make a home-made type of bean dish...this was easy and oh so delicious! In fact, we had some friends over for dinner that just raved about how delicious they were(woo hoo) I didn't have lard on hand, so my beans were made with 1/2 cup vegetable oil and the cup of water was replaced by 1 cup of the pinto bean juice heated with tablespoon chicken buillion for added flavor! I topped beans with shredded monterey jack and it was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Garrett"
},
"reviewBody": "I followed the advice of another and added butter instead of lard. This yielded terrific beans just like those in our favorite restaurant. Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HUSHPUPPY"
},
"reviewBody": "I scaled this down for 2 people, used butter and added garlic and chili powder. I left out the salt and used a potato masher to mash the beans once they went into the pot. I used hot water, as others suggested. These are amazingly delicious!! Next time I'll add some dried chilies and try it with chicken stock instead of water. I'll never buy that nasty canned stuff again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I love refried beans. I tried making them from scratch with dried beans from another recipe on this site. They took all day and they tasted nothing like the ones from the restarants. This tastes JUST LIKE the beans in the Mexican restaurants. With that being said. I scaled the recipe down to just me. With one can of pinto beans. I also used oil and not lard like a lot of posts listed. And, I used about a tablespoon or so. I heated the oil. While heating I opened and drained the can of pinto beans. Then I mashed the beans once I added them to the hot oil. With the oil you will not need any water. If you add it do it a teaspoon at a time. And, with the beans even drained they are loaded with salt, so it is not even needed. Only 5 minutes to restarant beans. Nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AggieFan92"
},
"reviewBody": "Very good -- I used butter instead of lard &amp; I liked the taste. The texture was good. Very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "raiderette74"
},
"reviewBody": "This was a great recipe that helped me find what my beans were lacking- which is plenty of liquid. I used chicken broth and they were really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Barney"
},
"reviewBody": "excellent recipe. This will be my go to refried bean recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cedez"
},
"reviewBody": "It was surprisingly good. I just needed something good enough for a side dish, but everyone loved them! I did substitute 1/2 a cup of butter instead of the lard. I also substituted chicken broth instead of water which was probably what made the recipe so good. I also added 2 cloves, and about 1/4 of an onion for flavor. It did come out a little to runny, so next time I am going to add another can of pinto beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "These were very good. Alot better than canned refried beans. The only change I made was to use olive oil instead of lard since i have no idea where to get lard. I will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Estrada Louck"
},
"reviewBody": "Excellent recipe! I hate the canned refried beans but didn't want to take the time to make them from scratch. I used bacon grease instead of lard. I also added in fresh garlic and about a half cup of onions to the grease before I added in the beans. I also followed someone else's advise and added in hot chicken stock instead of water. Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MANOMES"
},
"reviewBody": "I would have never thought about making these, except that I was out of canned refried beans, and needed them for a recipe. Wow, am I glad I did. So simple, and so much better than the soupy canned kind. I never have lard on hand, so I used canola oil instead. I will never buy canned refried beans again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "I have made this a few times now. Started with the basic recipe and in the end have made a couple of changes. The first is to replace the water with chicken broth. Added 1/2 teaspoon each of garlic powder, cumin, and chili powder. I serve it topped with shreaded mexican blend cheese, a little taco sauce, and diced green onions. I will not buy canned refried beans again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitsue"
},
"reviewBody": "VERY simple and cheap. I made mine as the main dish with corn bread on the side because well, really all I had in the house were some soaked pink beans I'd prepped a few weeks before. I used butter (no lard available) and since I'd simmered the beans in chicken stock, I just used that as my liquid. I thought I should skip the salt but didn't and think i ought to have skipped the salt, it was too salty. But that was my fault. Butter worked fine, Pink Beans worked fine, topped with cheddar (it was all I had)and went well with the Blue Cornbread recipe I found on this web site (I highly recommend the corn bread if you like sweet cornbread). Not bad. Worth the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DECAFinNW"
},
"reviewBody": "These are the best homemade refried beans ever! I happened to be cooking bacon for another use, so I used half butter, half bacon grease (no lard on hand). And, I used the liquid from the beans instead of water. Very few dishes in my kitchen escape without garlic, so a good heaping Tbsp. of minced garlic and a small can of diced green chiles sauteed in the bacon grease before adding the beans worked perfectly. And, I topped the beans with grated Pepper Jack cheese. Mmmm.... My family is still shocked that they are getting real refried beans, not out of a can, at home! We even like these better than our favorite Mexican restaurant's. Thank you Buffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Terranova"
},
"reviewBody": "For being so simple this turned out really well. I saved a bit of bacon grease from breakfast and combined that with oil in lieu of the lard. I also used chicken broth and added one chipotle pepper in adobe sauce. These were very good and enjoyed by all. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anya Howell"
},
"reviewBody": "After making these, my husband will never allow me to use canned refried beans again! These are very good and very easy. I did not use lard, because I didn't have it at the time. I used bacon fat mixed with a little vegetable oil, and they were awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "I used the general guidlines from this recipe to make refried beans from fresh cooked pinto beans that we had for dinner tonight. I used 45 oz of fresh cooked beans without broth (I cook my pinto beans in chicken broth with a ham bone for flavor). I ran them through my food processor to make them smooth and mixed them in with the 1/2 cup of butter (instead of lard). I cooked them to the paste consistency as stated, added the salt and then mixed in 1 cup of broth from the beans (still warm from cooking them). I then cooked it down to the desired consistency and froze them in 8 oz portions for later use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "I made these for a cinco de mayo party. Everybody enjoyed them. I used vegetable oil instead of and added cumin, tabasco and adobe seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rolling Alaskans"
},
"reviewBody": "This is a good simple recipe that holds true to refried beans. I didn't have lard on hand so I used butter. I've watched women make refried beans in the villages of Mexico with just plain old vegetable oil, so that is an option in a pinch too. When I cooked these I mashed them with the back of the spoon to expedite the process. Super easy &amp; tasty! To give them a little more flavor without adding texture, I added a couple spoons of the watery juice from some salsa. **update** I tried again with lard, like the butter version better. Also, a pinch of episote helps to make it a little more authentic tasting. Salt IS important. I made Texas style baked beans for my DDs B-day one year and all the neighbor kids thought the silly gringa mixed up the sugar with the salt, LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ellie may"
},
"reviewBody": "I am sure many other reviewers will mention the various ways to cut the fat, but lard is the deal-breaker that makes authentic refried beans in Tucson, AZ. I have used this recipe before and I like it, although I also add wads of fresh chopped garlic and 1 tablespoon of cumin once the beans cook down a bit. Big deal: make sure you slowly add HOT water (better yet: HOT chicken broth) when cooking beans; it significantly cuts down on the potential starchy-bland flavor that can occur (got that advice from a Mexican cooking pro). Finally, for you sodium watchers...as this recipe cooks down, the salty taste will become more prominent. Add salt in 1/4 teaspoon increments near the end of cooking; let it \"meld\" and taste often. Cook as slow as possible. This is not a recipe that you throw together, as simple as it looks. But if you are wanting authentic tasting frijoles, without soaking (and slow-cooking) dried pinto beans for hours...this is darned close to the real thing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/157854/buffys-refried-beans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/157854/buffys-refried-beans/",
"name": "Buffy&#39;s Refried Beans"
}
}
]
}
}
, "about": [
]
}
]