				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Bulgogi (Korean Barbecued Beef)"
,"datePublished": "2020-06-18T23:10:12.000-04:00"
,"dateModified": "2022-01-04T08:12:10.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Paula Stotts"
,"url": "https://www.allrecipes.com/cook/680301"
}
]
,"description": "The flavorful marinade - made with soy sauce, sesame seeds and oil, garlic, and a little sugar - gives a unique flavor to beef and vegetables. Serve over white rice for a complete meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/kl54Hae7wolMGQs4Q4Wv1ddfgBk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/201431-26f7c4094ea241cbabfe8eed62f4fc63.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Bulgogi (Korean Barbecued Beef)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "191"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "243 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "61 mg"
,"fiberContent": "1 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1055 mg"
,"sugarContent": "3 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"3 tablespoons soy sauce",
"1 tablespoon sesame oil",
"1 tablespoon sesame seeds",
"1 clove garlic, minced",
"1 teaspoon white sugar",
"0.5 teaspoon salt",
"0.5 teaspoon ground black pepper",
"0.25 teaspoon monosodium glutamate (MSG)",
"1 pound beef top sirloin, thinly sliced",
"1 carrot, julienned",
"1 green onion, chopped",
"0.5 yellow onion, chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large resealable plastic bag, combine soy sauce, sesame oil, sesame seeds, garlic, sugar, salt, black pepper, and MSG. Place beef, carrots, and onions in the bag; seal, and shake to coat the vegetables and beef with the sauce. Refrigerate for at least 2 1/2 hours. I prefer to marinate mine overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat an outdoor grill for high heat. Remove meat and vegetables from marinade, and place on a large sheet of aluminum foil; seal. Discard marinade."
} ,{
"@type": "HowToStep"
,"text": "Place on grill, and cook for 15 to 20 minutes, or to desired doneness."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT200M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eric Engwall"
},
"reviewBody": "I was disappointed. Meat wasn't tender even after marinating for 24+ hours. I also expected the sauce to be thicker. I'm going to give it another try because this is the kind of dish I love and I suspect I must've made an error or two (wrong cut of sirloin, not enough sugar, maybe?). I did skip the MSG and salt, which I think is the right call. Otherwise I made it as directed by the recipe. The flavor is promising, but it does need some additional spicing up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Howard"
},
"reviewBody": "Very good recipe. I increased the quantity of the marinde as I'd used an eye of round roast which was larger than the recipe called for. I put it in my deep freeze for 2.5hrs and ran it through my meat slicer cutting across the grain. Marinated meat overnight. Grilled. Served as bulgogi tacos with gojuchang, cabbage slaw and homemade yum-yum sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mayra Maldonado"
},
"reviewBody": "I only adjusted a few things as I did not have all the ingredients, and added a little kick! I used extra virgin olive oil, 2 minced garlic, and a 1/2 teaspoon of cayenne pepper. (Next time I will use the sesame oil.)\n\nThe meat was so tender and juicy!! My husband loved it!! He is a big fan of Korean food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet Ottesen Esser"
},
"reviewBody": "I would add several tablespoons of pear juice or a little pineapple juice for a little sweet tang."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janis Neill"
},
"reviewBody": "Love It! never get tired of this quick recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DGonsalves"
},
"reviewBody": "Amazingly good. Had to threaten bodily harm to save and protect a portion for someone who wasn’t able to join us for dinner. Followed others’ advice &amp; let marinade overnight. Added extra minced garlic - at least a half cup more. (Didn’t have the scallions.) Used a stove top grill over the gas stove flame, grilling no more than 3-5 minutes each side or when pink mostly subsided. Poured leftover marinade into small sauce pan with a cup off water for about 10 minutes on low-medium heat to cook. Drizzled that over steamed broccoli and wow! I had broccoli eaters who didn’t complain! No rice cooked, so baked 4 small potatoes...and drizzled THOSE with marinade as well. Everything was made better by the seasonings. The meat held the flavors and was just the right tenderness. Everything is gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOK"
},
"reviewBody": "The best!!!! Super Duper Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoeRik"
},
"reviewBody": "Yum! Made as written except I doubled the sauce to service with rice. Also, I? added corn starch because I? like a thicker sauce. This was so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Lee"
},
"reviewBody": "Wow! This is really good. I marinated mine (beef only) for 24 hours, then used the wok to cook it. Took a reviewers suggestion and let the liquid that collected boil away, even though it felt like it was cooking too long. The flavor was really intense and the beef still tender (due to the long marinade?). Whatever, it was really good and I will make this again many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hottentizer"
},
"reviewBody": "This was easy to make and very simple. I made a few changes based on recommendations. I used 1tsp honey instead of sugar and added 1 Tbs of rice wine vinegar. I added a whole bunch of green onions minced but no yellow onion. I did not add the carrot to the marinade. I only marinated for about 1 hour but if still came out great! I did add minced carrot to the skillet once I had it hot with sesame oil then meat mixture on top. Light and flavorful. Loved this not a leftover in sight so I will double the whole recipe when I make it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpfiedlersju"
},
"reviewBody": "Excellent. Let sit in marinade overnight. Used a tougher cut of meat and the marinade tenderized it very well, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "I love salt, but this was too salty, even for me. I would omit the salt next time. I don't have a BBQ so I broiled the meat on a roasting pan in the oven - 5 minutes one side, 3 minutes the other. Next time I would cook 3 minutes on each side. I used sirloin steak, thinly sliced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danee4tyler"
},
"reviewBody": "This was a very good marinade recipe. I thought the marinade would have more of a crispy sweet taste to it but it didn't. We cooked it on the grill and the meat was very tender and moist. I did tenderize the meat before I started marinating it. We served it with rice and the veggies and my 9 year old gobbled it up. I also used a tenderized piece of chicken in this same sauce and it was amazing. We used a very good cut of grass fed beef and chicken. That may have helped with how tender the meat was. I would use this marinade again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethannhowell"
},
"reviewBody": "I made just as the recipe indicated - it was delicious! And that cucumber salad, OH MY, it just made everything absolutely perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rach"
},
"reviewBody": "So this is the first time I made this dish, but I made a few alterations straight away just because I'm picky. I added a tsp of crushed chillies and 1/2 tbsp of teriyaki sauce to the marinade and left it for almost 8 hours.\nI live in Scotland so BBQing is a rarity and as it rained a lot today it was never going to happen, so I pan fried the beef along with bean sprouts, green onions and I served it up with white rice.... not a single drop left but only served 2 of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cheri"
},
"reviewBody": "This really didn't have much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UHcougar"
},
"reviewBody": "Really tasty! This was my first time at making Kirean food, so I don't have anything to compare this recipe to, but we lived it! The meat had a great flavor, but since it is wrapped in foil and sealed, I didn't think it had much BBQ flavor. I'm thinking it could have beef baked in the oven with the same results. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roseanne"
},
"reviewBody": "We love this recipe. I make it whenever steak is on sale. No msg and cooked in wok. Made as directed. Delicious.\n2) Ran out of soy sauce so used some hoisin sauce. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kwistina"
},
"reviewBody": "This is another keeper! My family doesn't like carrots, so those were left out. We also don't use MSG-there is enough salt in soy sauce to more than make up for it. Since I found this recipe in March, I decided to cook it in a skillet with vegetable oil. Very, easy to make since all the work is in the prep. The addition of sugar pairs nicely with all the other, more sour tastes, giving this dish a nice harmony of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mi Kim"
},
"reviewBody": "This is an excellent recipe, and will yield the results you want.\n\nMy suggestions as follow (tricks and tips I learned from the Korean mother):\n- if the meat is half-frozen, it's very easy to slice\n- can use any cut of meat, and if you get one that's a little tougher, put a Korean pear, or a little bit of very sweet pineapple through a food processor and add it to the marinade. they are natural meat tenderizers, and you'll probably need less sugar.\n\nAnd for my own modification: maple syrup!! 100% pure maple syrup works wonders!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanarocks53"
},
"reviewBody": "Great recipe. Didn't add the salt (soy sauce has lots) also used a kiwi finely minced to tenderize as recommended by another's comment. Marinaded over nite and was so so tender. Big hit!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Mayle"
},
"reviewBody": "I lived in Korea for 2 years, and this was pretty close to what I remember. I did make some changes for authenticity. Omitted carrot, added about a tablespoon of sugar, a tablespoon of rice vinegar, and served with rice in a lettuce shell. All of the restaurants that I used to go to served this as an optional way to eat, which I found to be fantastic! Great base recipe to make your own bulgogi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry L Fraser"
},
"reviewBody": "I have made it to recipe a few times just as written and I can tell you it was great. I never add the salt however, I feel the soy sauce adds enough. That, and I have a salt shaker on the table. Sometimes I do not have pear/ juice or kiwi available so I turn to the always in my kitchen, pineapple juice. Works great too. Please make sure to use the sugar, as it is really needed. I try to always let it marinade for 12 hours or overnight. We enjoy spice so we add red peppers when we do not have guests. Try the recipe and you'll know why the service men and women stationed in Korea seem to crave this dish once back stateside. Thank them for their service with this great main dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Chan"
},
"reviewBody": "I will make this again. The changes I made were really due to lack of ingredients... instead of beef I used pork, and I didn't have sesame seeds. Also, I used twice the soysauce, sesame oil, sugar, salt, pepper as the original amount seem insufficient for the pork. All in all, turned out really well. The wife enjoyed it and I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fulton Fortner"
},
"reviewBody": "I boosted the veg content, was a little meat-heavy. Also, I have some gochujang that I threw in with a dab of oyster sauce. Just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spartan"
},
"reviewBody": "Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine "
},
"reviewBody": "I cooked a little to long so it was a little tough but my husband still liked it. I will definitely try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VALOVESOR"
},
"reviewBody": "It was very good. Next time, I think I will double the meat and triple the marinade. My oldest went for seconds which is a rarity. Easy to cook up and I think will be easy for a midweek meal. I cooked it in the pan. I can only imagine how great it is over the grill. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "everything was great I added 4 green onions and more sliced onion\nSuper tender"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ga'chong"
},
"reviewBody": "I love bulgogi and kalbi, but Korean restaurants are SO expensive! Now I know why -- Korean ingredients are expensive! This is a nice alternative to the real deal, and equally tasty. But just a few tweeks: I never use soy sauce and salt together. This recipe begs for just a hint of ground fresh ginger. Amen to honey instead of sugar, and carrots add another sweetness that is essential."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Kranitz"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mizokie"
},
"reviewBody": "Taste is very good. I used raw sugar just because that's what we use at home. The sauce is more syrupy than runny. I marinated very thinly sliced beef for 6 hours and the meat was quite tender. I would make 3 to 4 times the sauce mixture next time though as it ran a bit dry once on top of rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alf"
},
"reviewBody": "Added a little ginger and left out the MSG-very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scooter369"
},
"reviewBody": "This is not bad but next time I'll add a few red pepper flakes to kick it up a bit. The meat came out very good and tender though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AprilLJones"
},
"reviewBody": "I did not care for this recipe. Prep time is crazy, the taste isn't even close to authentic Bulgogi."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "georgiarh"
},
"reviewBody": "Not good! The cooking time is way too long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Green"
},
"reviewBody": "This is a great recipe that you don't have to mess with ... except maybe either halve the meat or double the marinade. If must monkey with the recipe, do simple things like maybe add ginger or peppers or pepper flake. Adding other fluids such as juices or colas will only destroy the experience.\n\nIf you're going with a different meat, remember that tougher meats will need longer to marinade and less fatty meats are going to be dry. Stick with sirloin, ribeye or flank.\n\nAlso, if you're going to marinade this for longer than a day or freeze it ... any vegetable you have in the mix is going to be mushy. complaining about something like this in comment is pretty pointless as it isn't the vegetable or recipe ... it is your preparation.\n\nGet a jar of Kimchi, some chili and bean paste ... look up recipes for items you would find in a traditional banchan and make a good Korean style meal out of this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Ziegler"
},
"reviewBody": "LOVE bulgogi, so much flavor for so little work. Great basic recipe with great flavor. Next time I'm skipping the carrots, they don't really add anything and I'm not much of a fan anyways. Otherwise, give this one a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apbergemann"
},
"reviewBody": "This is the most authentic bulgogi recipe I've found. I can't get enough of it!\nTip: When you first throw the meat on the skillet, the fat will render out and form a liquid in the pan. Keep cooking it until ALL of the liquid has evaporated away, and the meat is searing on a dry skillet. It literally doubles the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alleybee"
},
"reviewBody": "I LOVE bulgogi and this a a pretty great recipe if you ask me. I paired it with fried rice and pita bread and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb K"
},
"reviewBody": "I have made this recipe at least 5 times. It is never boring. We always make a ton of it, serve it wrapped in lettuce with hot sauce or (in my case) sweet Thai chile sauce, then the next day it is great in a wrap, or even on a bun for lunch! I have no Korean connections so have no idea on authenticiy, it is simply delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MUIRZ1"
},
"reviewBody": "Pretty good. Don't discard the marinade as it adds some nice flavor when you top this dish over rice. Paired with Asian cucumber salad this dish was a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SGISLANDGAL2"
},
"reviewBody": "This was a delicious recipe! My husband described it as \"Wonderful\". Thanks so much for the share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bonnie"
},
"reviewBody": "Great recipe! I spent time living in South Korea and this bulgogi tasted so authentic. I used lean roast meat and had the butcher slice it into really thin pieces. I don't have a grill, so I cooked the meat and marinade in a wok instead. Served it up with steamed broccoli and some white rice--yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kspencer"
},
"reviewBody": "This was not good, the meat was still tough after marinating overnight. I had high hopes for this but it was dissapointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kalie"
},
"reviewBody": "This is easy and delicious. I may at some red chile next time for a bit of a kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I made this after seeing it on the recipe buzz a few times. I had already defrosted the meat for the recipe and was ready to make it before I realized I had forgotten sesame seeds and the recipe was meant for an outdoor grill. I went through with the recipe anyway and made it under the broiler. I had thought the carrots and onions would be no good after sitting in the marinade and I was right. The meat had nice flavor but it was way too salty and a lot tougher than I expected. I think a thicker cut of meat would have worked much better. But, I do realize I also cooked it under the broiler although it wasn't my first time using it for grill recipes. I wasn't sure what to serve it with and wish I would have read the submitters comments. I went with white rice but a cucumber salad, as suggested, would have been a really good compliment also. I have nothing to compare this to. It did all get eaten, but I think I would like to try a recipe with the meat only and that is cut after it is grilled. I think that would help with the tenderness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kamiko1"
},
"reviewBody": "Excellent recipe!!! I just added a few things according to my own taste. I added a couple cups of coke and some fresh chopped ginger and sliced the beef up and let it marinate overnight before stir frying it on the stove top cuz it was way too cold to grill outside lol!! I like to cook the beef with a little marinade so I can pour it over the rice. Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glo Carroll"
},
"reviewBody": "This is the best and simplest recipe for Bulgogi I've run across. Made the Korean Cucumber Salad as suggested with it and I wouldn't change a thing about either recipe. And, I'm fussy! These are excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gypsi23"
},
"reviewBody": "Awesome!!! My Koreans friends are missing Korea right about now and they LOVED it....he told me it taste just like Korean Bulgogi just a little too much salt...but still they loved it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "Was super good!!!!!! Didn't change a thing and wouldn't dream of doing so!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lynette Grell"
},
"reviewBody": "ok...followed it exactly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "I tripled the marinade ingredients. Left out the MSG, carrot, and onion. We are out of propane, so I could these in a frying pan. Very tasty and tender. Well liked by all. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Elaine Meyer"
},
"reviewBody": "Excellent! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "What a great recipe, will make it again. I will slice the meat a bit thinner next time. Some slices ended up 1/2 thick. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis"
},
"reviewBody": "Excellent!! I couldn't believe it was that easy to make one of my favorite dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "motherofthree"
},
"reviewBody": "I would give 4 &amp; 1/2. I used fliet magin and it turnned out pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JONTX11"
},
"reviewBody": "Just like when I was in Korea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley "
},
"reviewBody": "Very yummy! My husband tried this while duty stationed in Korea and really liked it there so I thought I'd give it a try. It was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly MacDonald"
},
"reviewBody": "This dish was delicious! I left out the MSG because I wasn't really sure what it was. I marinated the meat for about 10 hours, the stir fry veggies I bought already came seasoned so I didn't add them with the meat to marinate. Those were the only changes I made and my BF loved it!!! I will be making this again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "It's the classic. I was looking for a new way to use flat iron steak and believe me, I found it! Slice as thin as you can. If you use Kikkoman soy sauce, understand that it is good in this dish but very salty. I eliminated the salt and got a good balance. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bridget"
},
"reviewBody": "I'm not sure what i expected, but the crowd I made this dish for LOVED it. I thought it was alright."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed man"
},
"reviewBody": "You've done me a solid grneyedmustang! Follow the recipe exactly and its EXACTLY what you would want... Exactly means don't change anything. Anything means... anything :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSMOON"
},
"reviewBody": "I served this when I had friends over. This was a hit! I had great reviews. I \"will\" be making this again! THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Khrystyne"
},
"reviewBody": "Excellent! I actually used spare ribs with the bones 'cause that's what I had on hand &amp; they marinated in my fridge for like 3 days (I was sick &amp; forgot all about them!). Put them under the broiler for about 5-6 minutes per side, &amp; they turned out AWESOME! I, too, skipped the MSG altogether. I didn't add carrots or the yellow onion as I didn't have any but I don't think they were missed. Thank you for this recipe! A definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fittaraw"
},
"reviewBody": "This was amazingly good. I added a TBL of ginger and some chili paste and doubled the marinade ingredients. My husband was dubious this would be good but it was supremely excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Excellent!!I sliced the beef very thinly and removed as much of the fat as possible and marinade it for over 24 hours. So good!! The amount of pepper is perfect to offset the saltiness of the soy sauce. I also cooked it in a skillet on the stove because it was less work for the same basic result. Doesn't need the veggies either. I served my meat over white rice with a salad on the side. This will be one of the meals I make when top sirloin goes on sale!! Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jolene"
},
"reviewBody": "This was a very good and fairly quick meal to prepare. I made a couple of changes to the recipe. I added some sliced bell pepper to my mix of meat and veggies. I also wanted a little bit of heat so I added about 1 teaspoon of hot chili paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Snowlvr"
},
"reviewBody": "This is good but very different. Korean barbecue flavor is very different than what I think of when I think barbecue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "astanton"
},
"reviewBody": "My Korean sister-in-law gave this dish her stamp of approval and my husband practically inhaled it, so this is definitely going to be reappearing on our table. I had a little extra meat than called for, so ended up doubling the marinade. While I didn't do it this time around, I may omit the salt next time. I really liked the addition of the carrots. They added a welcome bit of color and flavor to the dish--and weren't mushy at all. Adding more green onions would also be a nice touch in terms of color. My sister-in-law stir fries this dish, which may be a good option for days when it's too cold to barbecue! I served the Bulgolgi with rice and Kimchi."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeepaholic"
},
"reviewBody": "Very, very good. I upped the sugar and ommited the salt per other reviews and it turned out great. I also decided not to add the carrots while cooking since they just turn to mush. I shreaded some carrots and topped the dish at the table to add the flavor and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mandy_H"
},
"reviewBody": "This recipe was good, but didn't taste like the bulgogi that we order at our favorite Janapese restaurant. It wasn't as sweet as I thought it should taste. The next time I make this recipe I will tweak the sauce so that the soy sauce isn't the prevailing taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole A"
},
"reviewBody": "This turned out great with some additions, since I can't seem to make anything without adding my own touches. I doubled the sauce recipe to have enough sauce to cover the meat. I added three tablespoons of rice vinegar as well as some pineapple juice for sweetness. I also doubled the amount of sugar. I didn't have a grill so I had to stir fry and still was great. Served with the korean cucumber salad and was one of the best dinners! Will definitely make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TIE"
},
"reviewBody": "This was OK, I let marinade over night and it absorbed all of the marinate. It was a little dry to me. I thought it would have more sauce. I served over white rice. Easy to make though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef 'Chelle"
},
"reviewBody": "Good recipe. Found the beef already sliced/packaged at an asian grocery. Husband liked it, but would like just a bit sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K_Palm"
},
"reviewBody": "It was wonderful. I added celery, an extra half teaspoon of sugar, and I reduced the salt by half. Next time I will add half of a kiwi and some spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aja"
},
"reviewBody": "I thought the amounts sounded too small for a marinade, but marinating it in a gallon size zipper bag really made the marinade go a lot farther with the meat. Flavor wise, this is as authentic a Bulgogi recipe as I've ever tasted. Absolutely delicious, and a flavor any pallet can enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JJOYB53"
},
"reviewBody": "Very good flavor, but a little bland (read: not spicy) as we thought it would be. I served this with the Korean cucumber salad, also from this site, which we found much spicier that we expected. Will use the excess red pepper from the salad to kick up the heat level of the beef next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "This was pretty good! Like a lot of people I didn't have time to marinade everything over night.. but I did for a couple of hours. I think this dish is something you have to let set over night so it can have its full flavor. Mine came out a little dry with a light flavor (but it was still tasty). I also think if you are grilling this, you should put the carrots on first because they take a bit longer than the meat and onions. I added pineapple and pineapple juice to tenderize it a little more and I also added a teaspoon of rice vinegar and an extra teaspoon of sugar. I didn't have any sesame oil, so I replaced it with vegetable oil. I will make this again! It was cheap to make and I had no left overs :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MNCookinGal"
},
"reviewBody": "LOVE this recipe! I tripled it because I had 3 lbs of steak. I marinated it overnight and it was fantastic. SO easy and SO delicious! I will be making this a lot this summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "madpotter"
},
"reviewBody": "The recipe is great as I didn't have time to marinade meat overnight like many of recipes I read. Love Korean BBQ but never made at home. Quick run to H-Mart (Korean specialty store) to pick up some broccoli, bean sprouts, mushrooms and red peppers. Bought some spicy kimchi and radish as side dishes. We didn't grill but turned this into a stir-fry. It made for delicious simple dinner. I always fret when I offer to cook but not anymore. Thanks to all the great cooks on Allrecipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Irene Y"
},
"reviewBody": "I didn't read the reviews before making this. I think it needs about 1.5-2 times the amount of sauce, depending on your tastes. But still very good overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "I made this exactly per the recipe's instructions and the meat came out very tender, but a little salty. Wish I would have read the reviews beforehand. Will try again and will use reduced-sodium soy sauce, cut out the salt, and add a little extra sugar or perhaps some vinegar as other reviewer's have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angella Theriault"
},
"reviewBody": "Awesome! I also added some honey- it was a nice touch :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolinaGirl"
},
"reviewBody": "An excellent example of some of the wonderful Korean cooking.... Exactly as I had it while living there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheRedx"
},
"reviewBody": "Taste great if you use it for Kabob marinade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SADIE1977"
},
"reviewBody": "I love this recipe. I left it in the bag over night and then just put it in a skillet and sauteed it. The only thing I did different is added more onions and carrots! LOVE IT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Hodge"
},
"reviewBody": "It had great flavor and tasted great... it just didn't taste like Bulgogi. I was stationed in Korea and had this dish there 2-3 days a week for a year. The actual dish would make a great stir fry though. I think next time I'll make the dish I'll finish it with a bag of frozen stir fry veggies and this \"Bulgogi\" in a wok for a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARATMARIE"
},
"reviewBody": "Can I just say....yum. The only change I made was I used low sodium soy sauce. Thought it tasted very close to the original. I lived in Korea for 2 years and this was my favorite thing to eat there. Thanks for reminding me why!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sailshonan"
},
"reviewBody": "I grew up eating bulgogi. My mom adds chives instead of green onions. Growing up, all our steaks were marinated in soy sauce, and so I always hated American steak. I have even been to some of the finest steakhouses in the US such as Bern's in Tampa and Gene and Giorgetti's in Chicago and was sorely disappointed in their steaks. My BF used to make fun of the fact I only liked steaks marinated in soy sauce; he railed against \"ruining\" a steak with soy sauce, until he tried bulgogi. Now he only wants soy sauce based marinades for his steaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spooky_doomdom"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NVTHIELE"
},
"reviewBody": "had this marinade overnight. Cut into 1 inch strips and in very hot pan, I quickly braised them. Served with spicy hot mustard sauce and used them in lettuce wraps. Used as an appetizer and even when they were cooled off these were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "brooke"
},
"reviewBody": "I FOLLOWED THIS RECIPE EXACTLY AND IT WAS A GOOD STIR FRY, BUT TASTED NOTHING LIKE TRADITIONAL BEEF BULGOGI."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela F."
},
"reviewBody": "Really good. I omitted MSG(its just unecessary) but followed recipe otherwise. I grilled it outdoors and served over rice. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma's cookin'"
},
"reviewBody": "Very good. Do NOT use MSG it doesn't need it at all. Bulgogi should be slightly sweet. Use 1 tablespoon rather than one teaspoon of sugar. I stirfried saving the marinade. Once the beef was done, I boiled the marinade then added cornstarch dissolved in water to thicken to make a yummy sauce then served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori A."
},
"reviewBody": "After living in Korea for two years, I love Korean food including kimchi! I marinated the meat overnight and cooked it on my George Foreman grill and served it over rice. I didn't have a carrot but I wish I did, many Korean restaurants add a carrot and it adds color and texture. I omitted the salt and MSG, you don't need it. I used low sodium soy and Splenda 1/2 and 1/2 sugar (half sugar and half Splenda). The key to Bulgogi is marinating overnight and if you freeze your meat for 30 minutes prior to slice, it is easier to get thin slices. I will definitely make this again! It is a fabulous recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms. Swan"
},
"reviewBody": "I really enjoy bulgogi, it's one of my favorite childhood dishes. This recipe was pretty good (not as good as grandmas), I found out her trick though she adds a can of coke to it... It tenderizes and makes it sweeter, and no MSG!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trinity0513"
},
"reviewBody": "This recipe was about 99% the same as my mother's bulgogi. It was delicious and very easy to make. I'm 1/2 Korean and was raised eating authentic Korean food from my mother so I have a picky taste for authentic vs. others.\n\nMe and my wife loved this and will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "renee"
},
"reviewBody": "Loved this-I threaded on skewers and grilled"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/63911/bulgogi-korean-barbecued-beef/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/700/world-cuisine/asian/korean/",
"name": "Korean"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/63911/bulgogi-korean-barbecued-beef/",
"name": "Bulgogi (Korean Barbecued Beef)"
}
}
]
}
}
, "about": [
]
}
]