				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Butternut Squash and Turnip Soup"
,"datePublished": "2020-06-18T23:43:59.000-04:00"
,"dateModified": "2020-06-18T23:43:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Rosemary Stanley"
,"url": "https://www.allrecipes.com/cook/3592922"
}
]
,"description": "This spiced-up soup is naturally sweet and chock full of flavorful veggies. Leave it chunky, or puree it for a smooth soup. It&#39;s a tasty way to warm up on a chilly day."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QFb5Wp47DXKL2hcSzOJ_wjo1UuY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1091695-e483a18f12294001a76b33f8df8dda79.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Butternut Squash and Turnip Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "118"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "204 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "24 mg"
,"fiberContent": "4 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "854 mg"
,"sugarContent": "11 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3 tablespoons butter",
"1 tablespoon olive oil",
"2 cups cubed butternut squash",
"2 cups cubed turnips",
"1 cup thinly sliced celery",
"1 onion, diced",
"3 cloves garlic, minced",
"1 quart chicken stock",
"1 bay leaf",
"1 tablespoon honey",
"0.25 teaspoon ground black pepper",
"0.25 teaspoon ground nutmeg",
"0.375 teaspoon ground coriander",
"0.125 teaspoon cayenne pepper",
"1 pinch salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the butter and olive oil in a skillet over medium heat. Stir in the butternut squash, turnips, celery, onion, and garlic; cook and stir until the vegetables just begin to brown, about 10 minutes. Meanwhile, heat the chicken stock in a large pot over medium heat until simmering."
} ,{
"@type": "HowToStep"
,"text": "Transfer the vegetables to simmering stock, and add the bay leaf, honey, pepper, nutmeg, coriander, cayenne pepper, and salt. Continue simmering until all the vegetables are softened, about 20 minutes. Remove the bay leaf before serving."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gardening Joy"
},
"reviewBody": "Absolutely delicious! I have made this soup several times and it is a very healthy, filling soup! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Herb"
},
"reviewBody": "Absolutely delicious. I used some frozen mirepoix, 2 apples, and my own garden herbs de Provence instead of the suggested herbs ( which I did not have). Added some red pepper and puréed with stick blender. Absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Thomas"
},
"reviewBody": "It was great! I omitted the honey and like other reviews I added 1/4 cup heavy cream before it was puréed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Big Al"
},
"reviewBody": "Nice recipe. Decided to puree after it cooled off. It seemed to make it taste better. Don't get me wrong, tasted good at first, but it definitely improved it in my opinion. Family and neighbours enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darya Jackson"
},
"reviewBody": "it is unbelievable! I pureed it and served hot over some lefover shredded chicken. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilieb1"
},
"reviewBody": "This soup is delicious! I love the spices. It came out just perfect. I pureed some of it as some of the other commenters mentioned they did..only because I love pureed soups. But it's nice as is, too.\nUpdate: 2nd time making it, I did not puree the soup. I think it's better without doing that! Such a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle lee"
},
"reviewBody": "I made this for my vegetarian daughter and she LOVED it! This a really interesting recipe the combination of flavors and spices that are surprisingly great together . Will definitely make this again !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RedHerself"
},
"reviewBody": "This soup was delicious. I fried up bacon to use for grilled cheese sandwiches first, and then sauteed the veggies in the bacon grease (no added oil or butter). I also used cumin instead of coriander. After cooking, it went into the food processor with about 6oz of cream cheese. Awesome...one of the best soups I've ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doggiemom"
},
"reviewBody": "I love squash and I love turnip, so this was the ideal soup for me. I also added carrots because I love those in soup too. I didn't have all of the required spices so I used half a teaspoon of garam masala. It was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Champagne Virgo"
},
"reviewBody": "Very good, and ready to do to boot! My guys liked it, and that's saying alot since they neither like squash nor turnip!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeanGreenBean"
},
"reviewBody": "I really needed to use up the storage veg I’d had sitting around since spring, so even though the turnip was a little over the hill I went ahead and made this soup exactly as written. Turnip is just about the most delicious thing you can put in soup, so I was already onboard, but still I was pleasantly surprised at the deliciousness in combination with the spices. I did think it was a bit sweet and will reduce the honey next time. This time to counter the sweetness I added just a few drops of apple cider vinegar which livened the flavor back up again. I used Better Than Bouillon vegetarian “chicken” base and it was great. I can’t wait for tomorrow’s leftovers, which will undoubtably be even more delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulette Garrido"
},
"reviewBody": "Fabulous! Left out honey and cayenne. Perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn DeBrielle"
},
"reviewBody": "added cabbage, stewed tomatoes, came out great, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Gertz"
},
"reviewBody": "I used parsnips, that is what I had, and red onion. I didn’t add the honey. I cut up a rotissery chicken and added some to the bowls before serving. I love the flavor! Thank you! Next time I will try it with turnip and maybe a dolup of sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreenScrew"
},
"reviewBody": "Not the most visually appealing soup but tastes fantastic. Made it exactly as posted however used my Instant Pot pressure cooker, using the sauté function for the initial ingredients, then adding the remainder items and set the pot on manual mode for 8 minutes. Turned out excellent! I will be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Rich"
},
"reviewBody": "I messed up and used acorn squash instead of butternut squash. (I did wonder why it didn't have much color.) that being said, my wife and I ate all of it in one sitting. It was positively delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EriNnRuss"
},
"reviewBody": "This was surprisingly good! I had no idea what to do with the extra turnips from my garden, i will plant more just for this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kent Godfrey"
},
"reviewBody": "Pretty good. It looks somewhat unappetizing, but I can imagine it would work well creamed. It needs a little something to give it more flavor, so you could take it in your own direction (just a little bit). I think it would work well as a small side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ctc"
},
"reviewBody": "the very best soup i've had in a long time! left honey out and added a couple of carrots. replaced coriander with an equal amount of curry (as others suggested) since i didn't have coriander, and red pepper flakes for cayenne. have already made it twice this month! strange sounding combination but it is really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molnarmania"
},
"reviewBody": "It was so delicious!! A lot flavor and I added extra cayenne pepper, but the honey evens the hotness out. I made a huge pot of it and it's already gone, 1 day later:)). I followed the directions pretty close, maybe adding more turnips and squash; great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alfie"
},
"reviewBody": "I cook for a vegetarian family and was looking for something different. I substituted vegetable broth. Oh my goodness. It was delicious. I may have to make more as I ate a lot of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iam pjsmith"
},
"reviewBody": "Great soup. The only changes I made was increasing all spices and used a hand mixer to make it a puree soup. Added a dollop of sour creme also. Big thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEB"
},
"reviewBody": "Absolutely delicious! Used half a good sized butternut squash and 3 good sized turnips. Made about 1/2 inch cubes and with celery and onion it really filled my largest size Circulon skillet. After all was combined in a large pot I added some left over turkey and that made it perfect (my husband likes to find meat in his soup!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yummy"
},
"reviewBody": "The first time I used butternut squash and I added kale and potatoes. The next time I used carrots instead of butternut squash and I added kale, daikon radishes, a sweet potato and green onions. Every time I make it, it's different but so good and even my kids and husband ??love it. I will make it all the time because I get my turnips and a lot of other vegetables from my local farmers market so I know they are organic and have no pesticides. Thanks for the recipe. It's 5 ??."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ljoym"
},
"reviewBody": "I made this recipe as submitted and would have rated it two or three stars at best. But, since it is unusual for me to be at odds with such a high rating I did not rate it immediately. Then the leftovers sat in the fridge for a week. Today I had the idea to puree the leftovers and see if that improved it. My immersion blender worked great and we enjoyed the soup for lunch with quesadillas. So much better as a pureed soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deborah kekone"
},
"reviewBody": "This soup is delicious! Like other people, I added more butternut squash than it called for (about three cups). I also omitted the onions and garlic due to a family food allergy and halfway through the 20 minute cook time, added two cups of chopped kale. When it was done cooking, I pureed it with an immersion blender. It was velvety, creamy (although there is no cream in it), hearty, and had wonderful flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsten"
},
"reviewBody": "Very tasty. I added some quinoa in order to make a bit more hearty and filling. My 10 year son and husband willingly ate turnips!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anniegolden"
},
"reviewBody": "Thanks for the recipe. I would never have thought to put turnips and butternut squash together, but the flavors are great. 2nd time I made this I added parsnips and roasted the veggies first with a little olive oil, salt and pepper. The parsnips add a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wvetrone"
},
"reviewBody": "This turned out great. I also removed the cayenne. My kids do not like heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Anthony"
},
"reviewBody": "I've been using Allrecipes for years but joined just to review this soup. I made it with Better than Bouillon vegetable base, forgot the celery, used crushed red pepper because I did not have cayenne, and used rutabagas because I did not have turnips. This was one of the most DELICIOUS meals I've ever eaten. It had a warming, smoky-sweet flavor that my husband and I loved. It paired well with poppyseed challah. We're making this one a staple. Looking forward to trying it with turnips and celery, and on a cold, chilly night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Mihalo"
},
"reviewBody": "This was a good recipe. I added 1 large diced potato to the recipe and increased the amount of squash and turnips to about 3 cups each. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzy"
},
"reviewBody": "Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyG"
},
"reviewBody": "I was pleasantly surprised that it turned out yummy! I used a large sweet potato, vidalia onion, carrots and a bag of small turnips. I didn't purée it like some said in their post. Loved it the way I made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pippi"
},
"reviewBody": "I added boneless, skinless chicken thighs, and a splash of apple cider vinegar. I forgot the honey, but didn't miss it. Due to allergies, I skipped the cayenne. I may try adding ginger next time to give it a bit of kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Elizabeth"
},
"reviewBody": "This soup was a delicious symphony of flavors! The honey and cayenne are a perfect relationship, my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Great recipe! Have made it several times and has always been consistently good. I did use an immersion blender to purée it a couple of times for my husband who isn't big on a lot of different textures and it was also wonderful puréed! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssalahshoor"
},
"reviewBody": "I'm giving this recipe 5 stars for being a great base soup to build upon. I recently read about the health benefits of turnips and purchased some at my local dollar store to try in a recipe. I modified this recipe quite a bit based on the ingredients on hand. Instead of butternut squash I had spaghetti squash and used that. This is what I did and it turned out fabulous!\n\n\n3 turnips peeled and cubed\n1 spaghetti squash, baked 40 minutes, shredded then added to turnips, garlic, celery, and onions cooking till slightly browned. To the chicken stock, I added a pkg of Knorr Vegetable soup mix and 4 cups of water along with all the spices indicated in the original recipe except honey as others suggested. In addition, I added turmeric, and madras curry powder to give it a little kick. I added fresh cilantro instead of the ground coriander. I had some cooked yellow split peas (about 2 cups) that I needed to use up and added that to the soup mix along with the browned veggies. I simmered the soup for about an hour and then strained the vegetables from the broth and pureed them in a food processor. I added the pureed ingredients back to the stock and got rave reviews on the outcome. The soup had a nice thick consistency without the need to add dairy products for thickening making it low cal. This recipe is definitely a keeper and super healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RockerChick"
},
"reviewBody": "Needed to use butternut and turnips received in my CSA and don't particularly like turnips. I have to say that this was delicious, one of the best butternut soups I've tasted. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katzmagick in the Kitchen"
},
"reviewBody": "I had leeks that needed to be used so I replaced the onion with about 2 leeks. I doubled the chicken stock so I had more broth, which is very good. I'd make it again. Maybe double the celery and add carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myra Golden"
},
"reviewBody": "Thank you so much for sharing this recipe! I found it after picking turnips from my father's garden. It was delicious! I love the taste, depth, color and healthy ingredients. I'll definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Norman Martin"
},
"reviewBody": "I used a butternut squash from our garden and an Eastham Turnip locally purchased. The results were just what I wanted, delicious. I found that it took a long time to sweat the moisture out of the ingredients and get them to brown even slightly. It took about an hour. Worth the effort. I will serve it pureed with a dolop of sour cream. Norm on Cape Cod."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Lapierre"
},
"reviewBody": "LOVE this!!!!! My changes are only due to personal preference: vegetable stock (instead of chicken stock) , a little extra cayenne pepper, no honey and less fat (only 1 TBSP of grapeseed oil, no butter). What a great flavor!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjl1"
},
"reviewBody": "I made this as written except I left out the honey because I prefer the bitterness of the turnips. I felt like it was missing something so I added the curry that other reviewers suggested but then it was too bitter. I added the honey after all and it was good but not great. I decided to let it simmer for another hour and then it was delicious! The leftovers were even better and I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "undertheliveoaktrees"
},
"reviewBody": "The turnip is still quite bitter, even when mixed with the sweeter squash. I think we just don't like turnip! But I'd make this again with the squash only."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorrie"
},
"reviewBody": "It was awesome. Yo can not make a mistake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vero Olson"
},
"reviewBody": "Just because I love to make a recipe my own I did add 4 small red potatoes to it. I also used pureed squash and only 3 cups of broth and disregarded the salt. I have to say, I AM very happy with this one. Turnips in a sweet soup WHO KNEW !!!! BTW if you add a pinch of cumin and paprika it adds a SW splash to it. I can see this one in our future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roycooper"
},
"reviewBody": "Made it as suggested and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emilyadonovan"
},
"reviewBody": "I really liked this soup! I had never had turnips before and was given two giant ones from the neighbors garden. I didn't really measure the vegetables just chopped up one squash and one big turnip. I pureed half of it, but wished I would have left the chunky texture. I would definitely make this for guests as a first course. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JulieGA"
},
"reviewBody": "I had butternut squash and white turnips from my CSA share and I was clueless as to what to do with them. This soup filled the bill nicely. I enjoyed the soup, I would have given it four stars but my husband and kids were not nearly as enamored with it as I was. I guess this means it might not be the best choice for picky eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitzi"
},
"reviewBody": "This worked really well. Made a great savory soup. I didn't have celery or coriander on hand but otherwise used just what it called for. Used veggie stock instead of chicken. Did blend it instead of doing it chunky but didn't end up adding any cream. The flavor was excellent! It is delicious with a dollop of Greek yogurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sec"
},
"reviewBody": "Prior to making this soup I had made a butternut squash soup which is pureed-it has apples &amp; Indian spices in it. I had leftover squash and I had turnips so I tried this soup. On it's own it is delicious, but I decided to combine the two soups and it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HeatherLilly"
},
"reviewBody": "Very tasty, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bean3934"
},
"reviewBody": "I've never cooked turnips before and needed a recipe to try, so glad I came across this one! I did not have a butternut squash so I substituted delicata squash instead, also was out of honey so used agave in the same amount. I used vegetable broth instead of chicken broth but all the spices I used as written. When the soup was just about done I removed 2 cups of the vegetables then pureed the rest of the soup in the pot with my immersion blender, then added the 2 cups of veggies back in and simmered another 15-20 minutes. This was AWESOME, wonderfully sweet flavor! This soup looks impressive but was so easy to make. Will be making this many times more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rosyshell"
},
"reviewBody": "Not bad! I didn't measure my veg, but used one whole small squash and the 4 turnips I had. Following advice I added 4 oz cream cheese and buzzed this with the immersion blender before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kory Mitchell"
},
"reviewBody": "I added Shitake mushrooms, b/c I love them, and this was a great soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret E."
},
"reviewBody": "I was looking for the butternut squash soup and came upon this one. We loved it, even took it to work for soup day today. Most people who like these kind of things really liked this soup. I might try to add some cubed cooked ham next time. Very tasty though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Haynes"
},
"reviewBody": "I can understand why some people would call this \"Bland.” It does not have any flavors or ingredients that stand up and scream “TASTE ME!” This is a subtle, mildly flavored, harvest soup that will bring back memories of your Oma, if you had one. Try it as written or try it pureed as some have suggested. This IS comfort food without the calories. It reminds me of my Gangee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ParadiseKris"
},
"reviewBody": "Wow! Absolutely loved it. Will make this a lot this winter and it was so easy to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annastasia Webster"
},
"reviewBody": "This was pretty good. Certainly better than my husband expected. I mashed it with a potato masher before serving. I also added cream cheese. It make enough for 4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SoRad"
},
"reviewBody": "This was a pretty good soup. I followed the recipe pretty closely - just added more veggies. I would have liked a little more flavor in the broth, but would still make it again - especially w/ so many turnips and butternut squash in my CSA."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylanoel"
},
"reviewBody": "This soup turned out fabulous ! This is a must try ppl ! I accidentally used 5 cups of chicken broth so i added cup and half of sliced carrots, and little more turnip.No worries, it turned out great! And I omitted the coriander. Be careful of adding too much cayenne and black pepper. You don't want this soup to taste too spicy. Thanks for sharing ! I will definitely make this recipe again !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMcClellan"
},
"reviewBody": "Really enjoyed the soup. We pureed the soup,added a can of condensed milk and a pound of chorizo. This will definitely become a regular at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyger Schonholzer"
},
"reviewBody": "Instead of stock I used half beef broth and half white wine. And I left out the butter, honey and coriander. I didn't need salt either . It was delicious! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keebdaisy"
},
"reviewBody": "This was great for a cool night. Was looking for a Butternut Squash Soup recipe and found this one and since I had some turnips on hand, I decided to try. I read all the comments about adding curry or heavy cream, but I always like to try the recipe the way it calls for the first time. I must say, it was excellent! I don't know what anyone was talking about when they said it was bland. In no way bland, they must have done something wrong. I did use a hand blender at the end to about 75% of it. It had so much flavor, I will make again! No changes needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CaceyMalone"
},
"reviewBody": "It turned out great! I made it without celery but I browned some ground beef before adding in the vegetables to the skillet and it turned out delicious. This is also a good base and you could switch up different ingredients and it'll still be good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wmh221"
},
"reviewBody": "Made this tonight. Delicious!! I think next time I'll add a bit more cayenne, maybe omit the honey ... but it's delicious as is!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "So tasty and filling without being caloric! We omitted celery and added one large cubed apple. Delish! Will make again and again all winter long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ardenia"
},
"reviewBody": "I love this recipe! I have made it once with squash and once with sweet potato and both times the recipe turned out lovely. I'm always trying to find ways to use turnips and this is a keeper. My only suggestion is to try pureeing this once the veggies are soft as it blends all of the wonderful flavours together. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandmarsh"
},
"reviewBody": "I can't really comment on THIS recipe, because I inadvertently used parsnips instead of turnips. (That's how my brain works (or doesn't) lol) But this was the best soup I've ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer M. Davidson"
},
"reviewBody": "I had some leftover roasted veggies with squash, parsnips, potatoes, carrots, red onions and rosemary in the freezer. After adding the regular veggies, I sauteed those up in a little more butter in the same pan and plopped it right in. The flavors on the bottom of the saute pan did not go to waste. That pan was deglazed with some liquid from the simmering stock and put back in. I didn't have enough chicken stock, so I used vegetable stock and added Organic Better Than Bouillon Chicken Base. That was salty enough. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Andersen"
},
"reviewBody": "Great soup! I didn't have any celery on hand, so I substituted about 3 Tbs. of fresh parsley. (I know - a weird substitution, but it worked really well!) After cooking, I removed about 1/4 of the soup, then pureed the rest, and put the removed part of the soup back in. (That way there were a few chunks of veggies, but the smooth, creamy puree was still there.) Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anniebdc"
},
"reviewBody": "I like this recipe. The turnips help balance the sweetness of the butternut squash plus the chicken stock gives the soup a heartiness that is great for chilly winter days. I don't typically like butternut squash soups because they are too sweet, so this is a really good option. Plus it's a great way to use excess turnips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vhawarden"
},
"reviewBody": "I just add the chicken stock to the pot, add some heavy cream, and blend with an immersion blender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Haslam-Larmer"
},
"reviewBody": "Yummy! Would strongly recommend -even if you don't like turnip or squash!! (I am not fond of turnip). \nI didnt measure the veggies - I was given a big squash and a few turnips from a neighbours garden (used 1/2 of the large squash, whole small turnip). Also used fresh from the garden spanish and sweet red onion.\nOmitted the honey, but did use all the spices. Also threw in a bit of chili powder, and red chili peppers. Pureed with sour cream once all veggies were softened. Amazing! \nCooked in a crock pot for ease, then pureed with hand blender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dixiechickbs"
},
"reviewBody": "I have made this several times. Sooooo good. I kick it up a bit more with crushed red pepper but it is delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Valerie Brunmeier"
},
"reviewBody": "I prefer straight up butternut squash soup over this but it wasn't bad. Even though I added at least an extra cup of squash, the parsnips muted it, not just in color, but in flavor too. It was quite bland and really needed the optional salt and I also added about 1/2 teaspoon curry powder to give it a flavor boost. I used my immersion blender to puree it. The recipe really should include this step. However, if you are looking for a way to use up parsnips for some reason - this would work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pelicangal"
},
"reviewBody": "This was just okay for us. I even added a little more cayenne but it was very bland. I followed other reviewers suggestions and pureed the soup an added a little cream. Still didn''t do it for us. Sorry. Thanks for posting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "asapdarlin"
},
"reviewBody": "I loved this soup. I smashed my veggies to make it a little more creamry. When pumpkin eggnog is out next fall I'm going to add that for 1/2 of the chicken stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Burns"
},
"reviewBody": "Delicious. Followed recipe exactly and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MatternFamily"
},
"reviewBody": "a wonderful recipe for our first soup. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Stoner"
},
"reviewBody": "LOVE IT! Great winter soup! I did a pinch of cayenne and a pinch of sweet curry. Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ELLEES920"
},
"reviewBody": "I've made this soup twice, and personally enjoyed it both times. Very satisfying and comforting for the cold weather season. First time, subbed veg stock (low sodium, boxed) used half the turnip, and added the equivalent amount of carrots, and added a little heavy cream . Everyone who tried it loved it. The second time I followed the recipe more closely as written, with the exception of adding some carrots and using sour cream as one reviewer suggested. This second try didn't get the rave reviews: some thought the turnip was overpowering the other flavors. I will try again with the veg stock to see if that offsets the stronger turnip flavor. That said, I personally love the turnip flavor, but I think the veg stock might be better. I'll update my review at that time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megzmc"
},
"reviewBody": "This soup is absolutely delicious!!! Made it without celery, added a little curry powder as per a previous comment, and pureed it with some light sour cream! SO GOOD!!!! I will definitly make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hester"
},
"reviewBody": "Delicious! Perfect for solstice soup this year. I was out of butter, only used olive oil, and it was just fine. Also added about 1/4 cup heavy cream. I especially like the coriander."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faithirene"
},
"reviewBody": "This was amazing! I realized after I started, I didn't have all the spices and so followed another users suggestion of curry powder- I did about 1.5tsp for a large batch. I probably had 4c squash with 2c turnips and 1c carrots (just cause they needed to be used up). The squash soaked up the flavor amazingly! I will be making this again and will try it with the called for spices to see if it is much different. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelle Benson"
},
"reviewBody": "First off... I think I have \"reviewed\" maybe one other recipe in all the years I have belonged to allrecipes... and I look at recipes everyday... we are a large family of 10... so I cant say I followed it to a t...hehehe I filled my large stock pot! I followed advice from others and pureed it towards the end... and I added a pkg of cream cheese to the stock... everyone liked it... even my 2 yr old... We grow 80% of our food so it was a great way to use up winter squash and turnips... and rutabagas... lol nothing better than soup in the winter... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kina"
},
"reviewBody": "This was incredible. Even the picky eaters in my family loved it! I had to make another batch because it was gone so quickly. I normally don't really like turnips but I was given several pounds of them and had to find something to do with them. I will now go out of my way to acquire turnips just for this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristincsw"
},
"reviewBody": "I had leftover butternut squash and a turnip from other recipes and stumbled upon this one. I have to say I wasn't too sure as I prepared it but I did enjoy this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjpack"
},
"reviewBody": "Amazing! I added cream cheese and pureed it. We ate it with rosemary bread. My 3 and 1 year old even loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "todlambe"
},
"reviewBody": "Great soup for a cold rainy day here in Dublin. Was nice with the cayenne pepper to give it a little kick, but I might try blending it next time and using some cream to thicken it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "texsis46"
},
"reviewBody": "My grandson is on a very low carb diet and we tried this soup for him. It was a hit with mom and granny, too. We didn't have all ingredients, so used curry powder instead. Next time, tho I'll cut down on the oils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Hogan"
},
"reviewBody": "4 stars! Good use for turnips and chock full of healthy ingredients. Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had both turnips and rutabagas that needed to be used, and they were great in this recipe! I roasted the squash first (cut in half, flesh-side down on a cookie sheet, 45 min. at 375) which made a thicker base. And I omitted the honey. Not as good as \"Butternut Squash Soup\" also on this site, but definitely healthier without the cream cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Alvarez"
},
"reviewBody": "Really good. I doubled the recipe and used extra squash and turnips because it seemed silly to stick a cup or so of each back in the fridge to go bad. I didn't have any celery but nobody missed it.\r\n\r\nAdded a little bit of turmeric and garam masala to ramp up the curry flavour and pureed the whole pot with a stick blender. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "auntjulz23"
},
"reviewBody": "I made this tonight and it was so good! It doesn't call for much cayenne pepper, but it was a bit spicy for my family so I will prob use less or omit it next time. Maybe use a little less pepper. I didn't put honey in i didn't think it needed the sweetness since the turnips are already sweet. Loved it and love the new use for turnips &amp; squash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "I used more butternut squash and turnips than called for, subbed vegetable stock for the chicken stock, and omitted the honey. Great soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenna"
},
"reviewBody": "This was the first time I have ever ENJOYED turnips! I didn't even measure anything, just threw it in and it was absolutely delicious! So, I ended up using a whole squash (didn't measure out 2 c). I also didn't heat the broth separately or add the salt. Sweet and tangy! I will definitely make this again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216700/butternut-squash-and-turnip-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/14734/soups-stews-and-chili/soup/vegetable-soup/squash-soup/",
"name": "Squash Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16370/soups-stews-and-chili/soup/vegetable-soup/squash-soup/butternut-squash-soup/",
"name": "Butternut Squash Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216700/butternut-squash-and-turnip-soup/",
"name": "Butternut Squash and Turnip Soup"
}
}
]
}
}
, "about": [
]
}
]