				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Butter Snow Flakes"
,"datePublished": "1999-12-10T14:31:55.000-05:00"
,"dateModified": "2022-07-14T17:53:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Linda"
,"url": "https://www.allrecipes.com/cook/24325758"
}
]
,"description": "A wonderful Spritz cookie with cinnamon in it. These freeze very well."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Nypj05zkgRjYCpOeDr4oYAnnEdA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/55648-79ce147caec04e1695ca32b8812ad474.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3923905802001",
"description": "These delicate cookies taste festive and rich.",
"duration": "PT2M1S",
"name": "Butter Snowflakes",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2964e488-729d-4b97-a6ed-2ee5424040b1/c08fded1-3898-44e4-b95f-95fcb476f5bd/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T02:34:22.514-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Butter Snow Flakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "496"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "105 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "22 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "60 mg"
,"sugarContent": "6 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.25 cups all-purpose flour",
"0.25 teaspoon salt",
"0.25 teaspoon ground cinnamon",
"1 cup butter",
"1 (3 ounce) package cream cheese, softened",
"1 cup white sugar",
"1 egg yolk",
"1 teaspoon vanilla extract",
"1 teaspoon orange zest" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour, salt, and cinnamon; set aside."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together butter and cream cheese. Add sugar and egg yolk; beat until light and fluffy. Stir in the vanilla and orange zest. Gradually blend in the dry ingredients. Fill a cookie press or pastry bag with dough, and form cookies on an ungreased cookie sheet."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Nypj05zkgRjYCpOeDr4oYAnnEdA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/55648-79ce147caec04e1695ca32b8812ad474.jpg"
}
]
,"text": "Bake for 12 to 15 minutes in the preheated oven, or until the cookies are golden brown on the peaks and on the bottoms. Remove from cookie sheets at once to cool on wire racks."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The taste is good but the batter is MUCH TOO THICK! I couldn't get it to extrude through anything but dies with the biggest holes. I added an additional egg yolk and they were no better. So I added 2 ounces of water. Still no better, then I added the whites from the eggs and again - no better. I wouldn't use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I liked how the cookies were light and delicious! I’ll have to make them at parties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kittenstar501"
},
"reviewBody": "Made this recipe but with a twist, I left out the orange zest and the cinnamon then replaced it with 1 tsp lemon extract. The dough tasted phenomenal and the cookies baked fairly well. My cookies were unfortunately rather uneven since I used a piping tool and not a cookie press. But overall definitely would do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Pavlovic"
},
"reviewBody": "I had more success with these spritz cookies than I have ever had with any other recipe. As many do, I made some very minor changes. I added 2 1/4 flour and 1/4 cup of dry milk for softness. I also used 1/2 almond and 1/2 vanilla. They came out perfect. I am now a convert. I will make spritz cookies every year. My press has been collecting dust since I bought it several years ago. No more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Scherrer"
},
"reviewBody": "Followed recommendations of upping to half a teaspoon of cinnamon and a quarter teaspoon of nutmeg. This works great in my cookie press. Didn’t have orange zest but no one missed it. Definitely holiday favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilvsnow524"
},
"reviewBody": "Finally a spritz that works in my cookie press. Most recipes just don't stick to the pan. I followed the recipe almost. I only had a tub of whipped cream cheese so I guessed on the amount and I had no orange zest so I zested a clemintine and added a little juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi"
},
"reviewBody": "Love this! Perfect as is! Super tasty and the orange zest makes them unique!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yoursonly77"
},
"reviewBody": "Made several times with pretty much every extract I could find and also added a bunch of spices like cinnamon, cloves, nutmeg, and ginger. They come out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Andersen"
},
"reviewBody": "Delicious, buttery cookies. Make sure you don't use parchment paper or anything - the cookies should come right off without using any sort of liner. If you're using a press, chilling the pan beforehand may help the cookies detach from the press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISABETH3"
},
"reviewBody": "My new favorite cookie! Perfect. Increased cinnamon to 3/4 tsp. Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jaymie Swallow"
},
"reviewBody": "We've been making these at Christmas for a few years now. It's always way to thick to pipe or use press. Just add a splash of milk or heavy cream a bit at a time until it's thin enough. Great flavor we always have people wanting more of these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Miller"
},
"reviewBody": "These are absolutely delicious! I don't have a cookie press, so I used a piping bag and a star tip. I sprinkled green and red sugar on top since these were for Christmas gifts. As with a lot of recipes I had to adjust the bake time to 8-9 minutes. They were perfect. \nAfter I finished I was reading some of the other reviews, and I will be making these again using some of the other suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Keim Scheurer"
},
"reviewBody": "I used half a tsp of vanilla and 1/2 tsp almond extract because I ran out of vanilla. Everything else I did exactly like the recipie called for. Next time I may add even more almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Darlene Williams"
},
"reviewBody": "Taste good but a big disappointed in getting the press or bag to get cookies on a pan I ended up spooning on to my pans are you sure we should have chilled the dough so it might press I am 80 and just do not have the strength maybe it can be rolled out and cut"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy7905"
},
"reviewBody": "This is the easiest spritz dough to work with I have ever encountered, and I have encountered a LOT. I didn't have an orange so I used lemon zest and glazed some with lemon and sugar. Very happy, this is definitely a FIVE STAR recipe. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delphiniumblue"
},
"reviewBody": "These are scrumptious ! It's a recipe to treasure. I, too, doubled the cinnamon and added extra orange zest. 10 minutes in my oven. \nA must try!! You'll love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Peterson"
},
"reviewBody": "this cookie was amazing! first, I should point out a few things. I wanted a cookie that I could use my cookie press with. I wasn't paying attention to the cream cheese amount and put 8oz in. I assume this is what caused it to be too sticky for cookie press, but not sure. that was a delicious mistake honestly! then, I left out all flavoring called for and added lemon extract. this was delicious! I am going to make the cookies again today for a pot luck. will see the difference, when follow recipe correctly. all in all, this is a great recipe. cookies were very light and fluffy. I'd even go so far as to say, Baker quality"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy, P&C Mom"
},
"reviewBody": "Made it per the recipe. Solid recipe that was super easy to work with, but my family didn't love the orange flavor. I will make it again without the orange."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOK471"
},
"reviewBody": "Got a new spritz gun so looking for a great recipe to go with it and I found it. These are tender and light. I sifted the flour with the dry ingredients and I highly recommend that. I baked for 14 minutes at 350 and they were perfect. I used the dough right after mixing and it went through my gun perfect. I enjoy the cream cheese flavor. I added vanilla and almond flavoring with a little orange peel. Now I'm ready for Christmas baking but these should be eaten all year long. I always use parchment paper when baking cookies but this said not to so I put them on a dry cookie sheet but then had to try them with parchment paper and they were great that way also so I will continue to use parchment paper for easier cleanup and cooling down the cookies. They say they freeze well but I don't think that will happen in our family. Eat and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doxies Rule"
},
"reviewBody": "For a cookie press cookie which cannot be gooey, chewy or filled with chocolate and nuts it is the best. They are small, crisp and flavorful. The only caution is that they are highly addictive. I could eat these everyday and never get tired of them. The flavor combination is outstanding. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "The cookies are the best! I omitted the orange zest because I didn’t have any in the house and like other reviewers wrote the cookies turned out fine. I used a Christmas tree and wreath design from my cookie press along green sprinkles for a very pretty and yummy Christmas cookie! I received lots of compliments on this recipe! Highly recommended!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Cullum"
},
"reviewBody": "Delicious! I left out the orange and added almond extract with half the vanilla because that’s what we prefer. No problems with the dough and the cookie press so this is one to keep."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAC in WFB"
},
"reviewBody": "Great taste! If you use a cookie press, don’t chill the dough in advance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshine"
},
"reviewBody": "Every year my husband asks for the Spritz cookie with cream cheese that he ate as a child. i used his mothers (original recipe with cookie gun from 1950s), my mothers recipes, internet, etc. to no avail. So i tried this one.\nTHIS IS IT! he loves them. The dough is easy to work with, no issues with cookie press, moist, etc. Thank you !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey T"
},
"reviewBody": "I didn't use cinnamon or orange zest. I added 1/4 tsp almond extract. I also 1/2 cup of powdered sugar and 1/2 cup of granulated sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Used orange peel and no cinnamon (my grandkids don't like cinnamon - weird, I know). They were absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Max"
},
"reviewBody": "These were great! Everyone loved them. I doubled the cinnamon and omitted the orange zest as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "evascooking"
},
"reviewBody": "Turned out great! Love the recipe!\nMinus one star because the batter did get too thick to use comfortably in a cookie press. My hands were bruised by the end but the cookies were delicious :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "v6nittany"
},
"reviewBody": "I made this recipe as written. They are quite good. My husband loved them! I prefer a more buttery flavor with less citrus. We divided the dough into thirds and made some with red and green food coloring for the kids. The prettiest were the regular dough with red and green large grain decorative sugars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale Plasek"
},
"reviewBody": "I replaced the cinnamon with freshly ground cardamom pods. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitten"
},
"reviewBody": "love this cookie super easy to make and taste amazing it passed for store bought!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Manning Frost"
},
"reviewBody": "Cannot stop eating these cookies. So delish! I increased cinnamon to 1/2 tsp and put in 2 tsp orange zest. I used the Oxo cookie press. I did put sheet pans in freezer, although not sure that was necessary. Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronda"
},
"reviewBody": "5 stars with changes. This is one truly yummy tasting cookie dough and it works perfectly in a cookie press. As suggested by other reviewers, I increased the cinnamon and the orange zest. I added 1 full teaspoon of cinnamon and the zest of one whole orange to the dough. I made these cookies for Christmas and the extra cinnamon and zest added to the traditional holiday flavor. The stickiness of the dough is perfect for use in a press. It worked very well. As others have said, the trick is to NOT chill the dough before use and to NOT use parchment or silpats. You need to press the dough directly onto the cookie sheet for this to work well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Followed the recipe as listed, the cookies came out fabulous. Easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Akhtar"
},
"reviewBody": "Turned out great, I love cream cheese in my cookies. The zest was a nice light flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dolphin147"
},
"reviewBody": "These taste good. I didn't add the cinnamon or zest, because my girls like more vanilla. When the dough got too warm, it would not peel from the cookie press. I will continue to play around with the recipe. Liked these cookies so far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teacher76"
},
"reviewBody": "PERFECT! These cookies were easy to make and tasted rich and tender. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stick"
},
"reviewBody": "I love this recipe. I took the advice of others and used1/2 tsp of cinnamon. Instead of orange zest I used 1/4 tsp of organge extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly2"
},
"reviewBody": "I busted out the 1962 MIRRO cookie press that I'd scored at a garage sale and wanted to find some reviews for comparable recipes to the ones in the little booklet wrapped around it in it's box. This is identical to the \"Butter Snow Flakes\" recipe they provided. I made a half batch, (refrigerated half of that to make closer to Christmas) and got 22, 2\" pinwheels with the 1/4ish chunk I used. I didn't use /have the orange zest. I had to add a little more flour to get them to release from the press, but otherwise I found it pretty easy for my first try at these vintage goodies. I found it helpful to express/ crank the dough fully on the cookie sheet then express a little more after lifting the press slightly off the cookie, as it make for a thicker cookie with nice ridges/ relief. These held their shape well in the oven. I got rave reviews from co-workers, who said they found spritz cookies frustrating so this recipe is a keeper. I also made shortbread (which I expected to be my favorite) and lemon crisps and have to say that this is my favorite. I love the little cream cheese tang and melt-in-your-mouth texture. This is the one I will make every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candice"
},
"reviewBody": "I made them and will be making them again . I had no trouble using my gun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "These are very rich and very good. I made them as directed and doubled the recipe. I would not double the grated orange rind as it is a little too overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tuesday Healy"
},
"reviewBody": "Lovely recipe!!!This cookie has wonderful texture and the dough was easy to work with. I will make them again but I will not add cinnamon but will double the orange zest. That's just me though, everyone else loved them just the way they were."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vern"
},
"reviewBody": "These cookies were lovely. Instead of orange zest, I added a bit of ginger essence for a little spicy kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Firstladynard"
},
"reviewBody": "Very good cookies! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alison M"
},
"reviewBody": "These were ok. Made as recipe said. Personally I didn't care for the orange flavor but both my kids and husband loved them. Used food coloring and made green Christmas trees, red hearts and white snow flakes. Added sprinkles and decorations and then flash freezed them and then froze them unbaked. Froze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Huston"
},
"reviewBody": "This is a great recipe. I also made some with almond extract instead of the vanilla extract and they were delicious. These are easy to make and there are so many different variations that you could do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurie"
},
"reviewBody": "So easy, and delicious! I used orange extract instead of vanilla.\nYummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brennylou"
},
"reviewBody": "This was perfect for the cookie press. This a keeper! \n\nI did change a few things. Doubled the batch and used a 8oz package of cream cheese. I didn't have an orange so used lemons instead and replaced the cinnamon with fresh nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkm"
},
"reviewBody": "Delicious little butter cookies! The cinnamon and orange flavors are very subtle, but I like the slight tang from the cream cheese. Next time I will bake them for a slightly shorter time, I did the full 15 minutes this time and they were slightly too crunchy for my taste. I sprinkled them with a little colored sugar before baking, and I didn't feel like they needed anything else. Simple, but delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marissa Morrison"
},
"reviewBody": "Love the flavor of these cookies, the orange zest is what makes these cookies perfect! The only change I made to the recipe was taking previous posters advice and doubling the cinnamon. After the bake I was so in love with the orange flavor that I decided to play on it and I glazed half the batch with an orange glaze recipe I found on the site. Definitely a five star cookie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "12-22-15 ~ Very tasty spritzer cookie. I made these for our cookie/candy exchange of 2015. Recipe is very easy to work with and one I would make again. I made this twice and made the recipe as written - but I can see where this would be very easy to change up the flavors. We liked the texture when the cookies were just a little brown on the bottom. It makes them a little crisp. (4-stars)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Patty"
},
"reviewBody": "Revised review -- I'd delete the review if I could because I didn't get to taste them as per directions. The cookies spread on the sheet and didn't taste good and I realize now that I didn't put the full amount of flour in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Chavie"
},
"reviewBody": "I will definitely use this recipe again. The only thing I changed was not adding the orange as I didn't have that on hand. They turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Capri"
},
"reviewBody": "INGREDIENT 'CHANGE:' I didn't measure the zest amount, because why bother? I zested two oranges and called it good. \n\nCOOK TIME CHANGE: I think spritz/butter cookies should be soft and melty, so I only baked them 6-7 minutes per batch. 7 minutes for big wreaths, 6 minutes for little flowers. Even my big wreaths were not very big. My cookies only barely browned on the bottom, everything else was still completely pale. \n\n---TIPS---\n\nDONE-NESS (very soft cookies): Touch the top of cookie with fingertip. If the top is just hardened (like an impossibly thin shell of done-ness over completely soft insides), I take them out of the oven. Seriously just touch, don't put pressure. The only browning was super duper light on the bottom. \n\nTRANSFERRING: Let them cool on the cookie sheet. It won't take long. Then, gently twist them by the base and they'll release. Mine did not crumble or break. One fell on the floor and didn't break.\n\nNOT RELEASING FROM PRESS: put a drop of nonstick spray on the outside of the cookie press plate. Make sure the baking sheet is not hot (just a little warm is okay). Wipe down the baking sheet with a barely damp paper towel between batches.\n\nCRUMBLY COOKIES: You really need to incorporate the ingredients. This is best accomplished by mixing well. Whip up the butter and cream cheese to fluffy. Mix in the egg and sugar and whip until fluffy. After all the flour is incorporated, whip it up in a mixer on high for a couple minutes. \n\nEXTRA YUM: Melt very dark choc"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine Buescher Clemmons"
},
"reviewBody": "Love these even without cinnamon.\nAnyone have info on a 3oz cream cheese pkg? I've only ever seen the 8oz"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sizzlin' Swizzler"
},
"reviewBody": "I added about 3 T of cocoa powder to half the dough &amp; made chocolate ones as well. Turned out great. May try twist or half &amp; half ones next. Perfect recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lynette"
},
"reviewBody": "The dough was a huge sticky mess and didn't work in the press even after about 1/2 c of additional flour. Ended up adding more flour and rolling them out. They did rise up nicely but my family all thought they tasted not only lackluster but like \"Play-Doh\". Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane Angell"
},
"reviewBody": "Not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "Great cookies,but 375 degrees is the better temp. Otherwise they burn on the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eabanks"
},
"reviewBody": "Very nice flavor and texture! Addictive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chantelbp"
},
"reviewBody": "Added same amount of almond extract as orange zest an they are soooo delicious will make again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "This same recipe has been used in my family for years, and is a favorite. With the frosting recipe from the back of a powdered sugar bag and some cinnamon dots, they make great little wreaths and Christmas trees for the holidays! They're very addictive, especially when you freeze them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rae Costa-Pierson"
},
"reviewBody": "I didn't use a cookie press, but instead made these into thumbprint cookies filled with strawberry jam. I thought they tasted good, but without the jam, they were a bit bland. I will probably make these again and use a cookie press and add a bit more cinnamon like some of the other reviewers recommended. Overall, a good cookie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I omitted the cinnamon and added a little coconut extract... These are now a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princessgertie"
},
"reviewBody": "These are soooo good. It is hard to stop eating them, so I make my husband take them to work with him the next day so that I wont eat them all myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christopher Debrisay"
},
"reviewBody": "Looks wonderful and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Martin"
},
"reviewBody": "These were good but something went wrong. I think it might have been my fault (my flour was pretty old) but my baked cookies had a tiny bit of a sour aftertaste. My butter and other ingredients were fresh, but I don't bake a lot so the flour may have been past its prime. I am unfamiliar with baking spritz cookies and it didn't say in the instructions, so I cooled my dough like I do with sugar cookies. BIG MISTAKE! If you haven't made spritz cookies before, the dough needs to be sticky so it can stick to your cookie sheet (cookie sheet has to be cold, dough warm. Once I got the dough warmed up, it went fine. I also was unaware how tiny spritz cookies are. When I was reading the reviews about how you can make 6 dozen cookies, I was astounded. Spritz are one, maybe two bites, so 6 dozen doesn't last long. \n\nAnyway, they were good but I need to try again with fresher flour to see if the bitterness was the recipe or me. It might have also been the orange zest, but I WILL try again. Oh, and mine took EXACTLY 12 minutes to bake perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashleyjean"
},
"reviewBody": "Not 100% sure if I'm lovin the orange hint - definitely needs more cinnamon - yum :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean S"
},
"reviewBody": "Absolutely delicious...my two toddler girls enjoyed helping me make them as well as eat them. I pretty much stuck to the recipe although I added a tad more cinnamon and sugar based on other's comments. I also used premium ingredients such as Saigon cinnamon, Madagascar vanilla, and fleur de sel. I figured what the heck, I had it all and was only baking once this Christmas. Definitely don't skip the orange peel as this really gave a new dimension to the cookie and the complexity of flavors is indescribable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doroshenko's"
},
"reviewBody": "These are the BEST cookies I've ever made! I doubled the amount of cinnamon and they came out amazing. They worked perfectly in my cookie press as well. This is my new Christmas cookie recipe! So delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzzyq"
},
"reviewBody": "my husband said if the butter cookies dont taste like the bought ones then he is going to go to Walmart and buying himself some but there was no need to everyone LOVED them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHRISM1205"
},
"reviewBody": "Good recipe but I needed to use about 1/2 cup more flour so it would go through the presser and I only baked them for 10 minutes since they were very small cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "This was my first time attempting a press recipe and it was perfect! I followed it to a T with the exception of upping the cinnamon to 1/2 tsp as others recommended. This is a definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sghwitx"
},
"reviewBody": "Delicious cookies! This was my first attempt at making cookie press cookies, and I read lots of recipes and reviews before deciding to try this one. I followed the recipe exactly (which was hard for me because I almost always make a few adjustments)and they tasted great! Very subtle orange flavor; really couldn't taste the cinnamon. Good texture. My teenage son and my dad loved them too. You do have to be sure that the cookie sheet is completely cool and not greased, so that the cookies adhere to the pan. I used my mom's old Mirro cookie press and the dough went through it just fine. I would recommend this recipe to anyone wanting a flavorful cookie press cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Definitely not the best spritz cookie I've ever had. I liked the orange zest but thought there was way too much butter, they came out greasy and flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ddianae"
},
"reviewBody": "I've searched high and low for a spritz cookie recipe that has flavor. I didn't have orange zest so I left it out. I did follow some of the suggestions and doubled the vanilla, added 1/2tsp of almond extract and 1/4tsp ground nutmeg. They were a hit. I used two different cookie sheets - on one sheet the cookies baked in 5mins, 8mins on the other sheet so watch the cookies carefully to adjust your baking time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gladys"
},
"reviewBody": "Wow, I made this recipe using the ingredients exactly and I was very disappointed in the results. I put the dough through a cookie press and they did not hold their shape, went really flat, and are crispy and not chewy like others have mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulette Prézeau"
},
"reviewBody": "I have made these cookies many times for family and friend and they love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "I have to say, this is the BEST sprtiz cookie I have ever tasted! I skipped the orange zest. I used red food coloring and made hearts. Once they were cool I spread raspberry jam on the back of one and made little sandwich cookies. Then I dipped half the sandwich cookie into some melted dark chocolate. Put them in the freezer to set. These are for my husband for Valentine's Day, he loves Spritz Cookies, I can't wait to give him these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MandyCooks"
},
"reviewBody": "This is a great base recipe, and tasted even better with a few changes- I took out the cinnamon, and orange zest and added the zest of 1 medium lemon and 2 teaspoons of lemon juice. It sounds like a lot of lemon, but it actually creates the perfect delicate flavor! Huge success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "I would like to give these a 3.5, but there's no way to do that. I wanted something similiar to spritz, but yet different. I thought this recipe would fill the bill. I wish I would have added some orange juice or orange extract as other reviewers did, I think it would have given it a more distinct flavor. There is a not-so-nice aftertaste to these cookies that makes me go to brush my teeth afterwards...the only way to get rid of it. I finally concluded that the culprit is the cream cheese in the cookies. I agree with a few of the other reviewers, I don't know how anyone could add an entire 8 ounce package of cream cheese to these...they would be just awful. The next time I think I'll stick to my old spritz recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adelina Dudda"
},
"reviewBody": "Great recipe. Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherril Miller"
},
"reviewBody": "I have a cookie press that belonged to my husband's grandmother. This recipe worked nicely in the press. However, I didn't like the sour flavor the cream cheese gives them and I only used the 3 oz. as the recipe states. I can't imagine how awful they would be with 8 oz. Also, it could probably have used more cinnamon and maybe some almond extract. The vanilla was overpowered by the sour flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "Good and easy to make. Dough was easy to work with in the cookie press. Increased cinnamon to 1/2 tsp otherwise made as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Desiree"
},
"reviewBody": "Yummy recipe! I made it exactly as the recipe stated. I colored half the dough with green and used my cookie press to make trees &amp; wreaths. I used the egg white to brush on top of the cookies for glue and used colored sugar and sprinkles to decorate them. They look great! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Corianne"
},
"reviewBody": "Added the extra cinnamon like reviews said....... The flavor of these is delicious! Made the mistake of using a whole egg instead of just a yolk - still turned out ok!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariabilljp"
},
"reviewBody": "Love these cookies. I hadn't baked in 15 years but\nFelt this year was my year to try and I wanted to make a spritz cookie. Great recipe- just needed to adjust temp a little lower for convection oven. Took to 2 parties and received many compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker@Heart"
},
"reviewBody": "I have been using this recipe for years. It is definitely my \"go to\" spritz recipe. Whenever I make them I get people that comment on how they don't normally like spritz but these are very good. \n\nI do usually omit the orange zest. My spritz usually get done in 9 to 11 minutes so don't wait until 12 minutes to check them or they may become over done. Also, make sure they are COMPLETELY cooled off before storing them in an air tight container or they will lose their crispness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I just made these cookies for a cookie exchange and they are WONDERFUL! I've owned a cookie press for years and never had the nerve to try making some. I followed the recipe exactly and they turned out exactly as I hoped. I will definitely be making more of these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sugarc00kie"
},
"reviewBody": "I liked these cookies well enough for a tasty little butter cookie that was a good filler in my holiday cookie platters. Unfortunately, the dough would not cooperate with either of my two cookie presses (manual pampered chef, nor an electric one) so I just used a small scoop, flattened with the bottom of a glass and pretty colored sugars. I did not alter the recipe at all so my rating is based on the recipe as posted, and reading reviews I see many reviewers increased either the cinnamon or orange zest. If I tried these again I would definitely do that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Judkins"
},
"reviewBody": "Fantastic Recipe! The only change I made was to increase the cinnamon to 1/2 tsp as other reviewers mentioned. The orange zest is perfect! It gives just the right touch of flavor to this cookie. My cookie press gave me fits and for some reason I could not get them to form, so after thinking on it for a while, I rolled the dough into small balls, baked for 14 minutes and drizzled with semi-sweet chocolate. Probably the best cookie I've ever made! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Kaylor Butcher"
},
"reviewBody": "Oh ... these are GOOD! The only thing I did different was double the cinnamon - we like cinnamon. These turned out light, buttery and had the perfect texture! I did have to bake them for the full 15 mins to get them to lightly brown on the tips. But you would have to adjust time according to your oven as everyone's is different. ;) I had no problems pushing this dough through my $10 cookie press! Worked perfectly! Well ... almost .. I need to bake MORE because we ate them up too fast! LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Haas"
},
"reviewBody": "so good. I followed the recipe exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anita Gordon Palmer"
},
"reviewBody": "Was to sticky for the electric press I have to do with the flower disk, so I had to use the tube instead. Not a good recipe for a cookie press. But they did test good. I was only disappointed on not being able to put them through the press=Anita"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sophiem"
},
"reviewBody": "delicious!! my kids love these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melisa Galanti"
},
"reviewBody": "Very good. Omitted orange zest. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paras"
},
"reviewBody": "Pleasantly easy with a very buttery flavor. Didn't have an orange on hand so I added a splash of OJ instead (something my grandmother used to do with her butter cookies) and they came out delightful. Great reason for me to take out that cookie press that I haven't used in years. Dusted them with white crystal sugar for an added texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Gruppuso"
},
"reviewBody": "One of THE BEST cookies EVER. I made some with the press and a batch as thumbprints too. I tried raspberry preserves and apricot preserves. They were ALL so delicate and YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geordie in Canada"
},
"reviewBody": "oh my goodness, these biscuits are really amazing. I didn't have a cookie press but I took another viewers advice and rolled the dough in coconut and they turned out so incredible. Thanks for sharing this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15235/butter-snow-flakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15057/desserts/cookies/butter-cookies/",
"name": "Butter Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/858/desserts/cookies/butter-cookies/spritz-cookies/",
"name": "Spritz Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15235/butter-snow-flakes/",
"name": "Butter Snow Flakes"
}
}
]
}
}
, "about": [
]
}
]