				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cajun Sweet Dough"
,"datePublished": "1998-11-23T02:46:52.000-05:00"
,"dateModified": "2022-12-28T20:19:54.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Julie P"
,"url": "https://www.allrecipes.com/cook/24324713"
}
]
,"description": "This dough is traditionally used for turnovers but it can be used as pie crust. It is sweet and delicious and bakes up beautifully!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BtQyRF0jRrBlsmm1UjRBuKylYnU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3189140-cajun-sweet-dough-footballgrl16-4x3-1-a89200645b254122832fa9e6cf39d90c.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cajun Sweet Dough"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "55"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "163 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "19 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "119 mg"
,"sugarContent": "9 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"0.75 cup unsalted butter, softened",
"1.3333333730698 cups white sugar",
"1 teaspoon vanilla extract",
"1 egg",
"4.5 cups all-purpose flour",
"2 teaspoons baking powder",
"1 teaspoon salt",
"0.5 cup milk",
"1 (12.5 ounce) can cherry pie filling",
"1 egg white (for egg wash)" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sift together flour, baking powder, and salt. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat butter in a separate bowl, then add sugar a little at a time. Add vanilla and beat mixture until it is nice and fluffy. Beat in egg. Stir in flour mixture alternately with milk."
} ,{
"@type": "HowToStep"
,"text": "Chill dough in the refrigerator for at least 2 hours, or overnight."
} ,{
"@type": "HowToStep"
,"text": "To make turnovers: Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll dough out to 1/4 inch thickness on a lightly floured surface. Cut into 3-inch squares. Spoon about 2 teaspoons of pie filling into the center of each square and fold over to form a triangle. Pinch seams to seal or press with the tines of a fork. Place at least 2 inches apart on a greased baking sheet. Brush with egg white."
} ,{
"@type": "HowToStep"
,"text": "Bake for 12 to 15 minutes in the preheated oven, or until golden brown on the top and bottom."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jada"
},
"reviewBody": "Disaster. Probably just me, but could not roll the dough out thin enough and two teaspoons filling on three inch squares? All filling squished out. I'm not cajun, but hillbilly, and have made fried pies several times. The dough is more like biscuit dough and not so dry. I think I will stick to fried pie dough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joyce F"
},
"reviewBody": "Wasn't quite the sweet dough I remember. Maybe something I did wrong, but the dough was very dry and hard to handle. I couldn't get 2 teaspoons of filling in a 3 inch square without it oozing out. They were more like pop tarts, but the taste was great though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a basic Cajun sweet dough recipe. It’s not flaky like a pie crust because it’s not supposed to be. It is sweet like a sugar cookie. Thank you for the wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "Thank you for posting! For the ones complaining: it's a cajun recipe, so unless you grew up and your mamom baked these sweet dough pies, you will never understand! This is like eating a piece of heaven. My mamom always made: chocolate, vanilla, and blackberry sweet dough pies. \nI'm from the Lafayette area myself(a bit further south), and am so grateful for FINALLY finding this recipe. My mamom passed away 18 years ago, and haven't had her sweet dough pies since. Now, I can finally make them! Thank you again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tami Hawksley Gorman"
},
"reviewBody": "Took longer to cook then it said but overall very good..I made mine with a homemade apple compote filling dusted with cinnamon and powered sugar..yummy with coffee.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FeeFieFoeFum"
},
"reviewBody": "The dough tasted good, but it’s so hard to handle. I used it to make a sweet potato pie and it was alright."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "It taste pretty good but The amount of time it takes to prepare and the amount of time it takes to chill prior to rolling, cutting, filling, folding, and baking isn’t really worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LVERIZZI"
},
"reviewBody": "We used this dough to make sweet potato hand pies by adding 1/4t Nutmeg and it worked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rich04042"
},
"reviewBody": "Made them with Nutella!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "connie cormier"
},
"reviewBody": "A lovely sweet dough crust that I very easy to pull together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James M Houdaille"
},
"reviewBody": "love it!! Very forgiving but it makes a lot dough....but it freezes well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ed Klopfenstein"
},
"reviewBody": "It's a very good recipe. It does taste like a cookie. It also doesn't create 30 pieces if you're really using 3 inch square. I found it very difficult to get to that number. However it tastes good. I would agree with the people who said that you have to use a lot of flour when you're working with it. Also make sure you put the turnovers on the very top rack. Mine burned because I went to the middle rack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making this recipe for several years now since I made it for my highschool French class and it is always a people pleaser. It's delicious and everyone loves it so much they come back and ask for more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daddysis 101"
},
"reviewBody": "it was delicious, my family LOVES it and its so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "radergirl1"
},
"reviewBody": "makes great berry cobbler topping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nena Rivas"
},
"reviewBody": "I use this recipe all the time. Makes a great pie crust. Portions are large. Yummy taste, not too sweet. Two thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Dunston"
},
"reviewBody": "Great recipe. I added a bit more milk. Dough needed to be worked with a bit of flour after refrigeration. As mentioned by others it's not a flaky dough. I left my dough thick to create a sweet shortbread like topping over a caramel apple cobbler. \nEveryone loved it. I will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Schexnayder"
},
"reviewBody": "they are the best!! loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Troth"
},
"reviewBody": "The recipe is very good. I made cherry turnovers with this recipe and shared with a neighbor to test. She willingly sacrificed herself to test any other recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Velma Delcambre Charles"
},
"reviewBody": "We love it can't get another of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Candice"
},
"reviewBody": "It tastes good. I read the reviews so I realized the crust would not be like a pie crust. I followed the recipe with the exception of I baked longer to get golden tops. They were great that night. But those I stored in closed Tupperware were soggy the next day. Like wet bread. They were completely cool before I closed them up. Any tips on storage to prevent the soggy-ness?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Serina"
},
"reviewBody": "Finally, I've found it! I've been searching for a needle in a haystack and found this. It us the best dough recipe there is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rachelbradley98"
},
"reviewBody": "This is a great sweet dough recipe. I used it several times. I am giving it four stars because it always comes out different each time. I am not sure if it's the humidity or the time I beat the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Princess Barbie"
},
"reviewBody": "This dough is soooo good and easy to make! I made the pies yesterday and they are GONE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "grainfreegirl96"
},
"reviewBody": "My dad requested cherry turnovers for breakfast so I decided to try this recipe. I was in a hurry to make it and completely messed up the instructions. Instead of creaming the butter and sugar in a separate bowl, I accidentally mixed everything together. This resulted in very crumbly dough, but I was able to salvage it through the addition of extra milk. I filled the dough with cherry pie filling and then drizzled a simple glaze over it after baking. My dad said that he didn't like the taste of this recipe at all, but most everyone else thought that it was good. I would probably not make this again as I don't feel that it is worth the effort. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This is the best recipe if you want to make blackberry pies! Thank you for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelie1007"
},
"reviewBody": "I can't rate this because I haven't tried this yet - but for anyone that has not tried sweet dough - this is wonderful (do not confuse this with sweet breads). The dough has a wonderful sweet flavor to it. I've never had it with fig - though I remember my grandma's fig preserves...soooooooooo good! My grandma used this as a pie crust and baked it - then filled it with a rich chocolate custard filling. I'm glad I saw this recipe. It brought back so many memories of my childhood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "East Texas Son"
},
"reviewBody": "This dough is awesome...! It's a little hard to work with, so don't try to compare it to others, but it's worth the extra effort. I made tarts, mini pies and turnovers using this dough and they all turned out great! Dough is forgiving on cooking time thank goodness. I filled with berries, pumpkin, mincemeat, lemon and even chocolate. All fillings worked...! I fridged my dough overnight then let in sit out for about an hour before rolling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dzone"
},
"reviewBody": "Julie P thank you this is a treat that we ate in Louisiana too. I had bits and pieces of the recipe and you made it complete. These are the best little pies, I like to add a little nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "I live in Lafayette, LA. I've had sweet dough pies all of my life, and love them. For those who are expecting a flaky crust, this is not the recipe for that. Sweet dough isn't supposed to be flaky. If it were, this recipe wouldn't be called Cajun Sweet Dough...it would be called Turnovers. This is a very authentic recipe. Absolutely wonderful!! Thanks for sharing! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie Clark Schultz"
},
"reviewBody": "OUTSTANDING! Native Louisianian,and I love this. Tastes like a mild sugar cookie. We made tiny pies using the top of a large glass to cut circles, 1tsp. fig jam for the filling, fork crimped the edges and sprinkled with sparkling sugar after egg white brush. Y-U-M!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tsuyako"
},
"reviewBody": "I liked this recipe as a cookie but for a turnover, I don't know, I find it a bit sweet. This could have been my filling choice, though. I'll make it again as tea cookies but not for turnovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna G."
},
"reviewBody": "OH MY GOD!! IT'S WONDERFUL!! THE PERFECT DOUGH FOR TURNOVER and maybe also for cookies! so crispy but also tender inside, you don't feel butter at all, very tasty and perfect! I follow the recipes exactly and they come out perfect! I fill them with apple briefly cooked with cherry jam, nuts, brown sugar and marsala, but you can fill it with everything you want, such as chocolate and nuts, figs, custard and so on..I will definetly use it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarfoot"
},
"reviewBody": "For most of my life I disliked pie crust. Dry, somewhat tasteless...a sad ending to a piece of pie. Then I tried Julie's recipe. It's amazing!! I use it for anything pie, anything turnover. You can't go wrong! Everyone is wowed by it..even my Mom who was happy with her crust. It's little like sugar cookies. Thank you for sharing it! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyle"
},
"reviewBody": "Really yummy! Added a bit of pumpkin spice and filled with pumpkin pie filling. Cinnamon and sugar sprinkled lightly over the finished product made it extra sweet and delicious!\n\nGreat snack to get in the Thanksgiving spirit! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MISCBILLS"
},
"reviewBody": "I love this recipe, so sweet and soft. Fluffs up nicely and I put any thing in it and taste great. Just followed the direction of putting together. I just 350 and check for browning. After that, all is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina Excell"
},
"reviewBody": "This made GREAT turnovers! I followed the recipe exactly as directed, EXCEPT, I had no butter on hand, so I used a stick and a half of margarine instead. It is a sticky dough when you remove it from the fridge. To remedy this, only roll half the dough at a time, and use a medium-heavily floured surface to roll it out, keep your rolling pin floured well also. If it doesn't work out well on the first roll, knead the extra flour in that stuck to it, then try again, it will be easy to work with then.I made small turnovers, about 4\" across when unfolded. They baked nicely at 350º for 23-25 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Leslie Sullivan"
},
"reviewBody": "I didn't like this at all. I made it wil my usual turnover recipe and it sucked up all the liquid and the dough crumbled very easily. I won't make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ali"
},
"reviewBody": "This dough was very sticky and hard to work with. My turnovers did not come out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VIRGOVICKY"
},
"reviewBody": "how long and what temp. do you bake this At??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EJGADDI"
},
"reviewBody": "I was pretty disapointed with this recipe. The other review was right, it is more like a cookie. I was also frustrated trying to figure out how long and how high to bake it. I am not an expert baker so I had to guess. Maybe I need to roll the dough out thinner. I also found it difficult to roll- it was very sticky even after chilling for a long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KER0WYN"
},
"reviewBody": "This crust was almost like a sugar cookie, sweeter than I expected. It was very tasty though and worked really well as apple turnovers because it held its shape very well and didn't have a bunch of filling leaking out. Refridgeration is a must though, because the dough is very soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEEBUNNY"
},
"reviewBody": "I made some small apple empanadas with this recipe, and my boyfriend is still bringing it up in conversations with strangers weeks later. He swears it's the best thing he's ever eaten. This recipe is a jewel. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerre Gadoury"
},
"reviewBody": "best pastry dough I can find, use it for all my pies and tarts now. It is terrific with meat inside for an elegant dinner, just Absolutely yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MZMUDD"
},
"reviewBody": "I used this for apple turnovers. My hubby's favorite. He says 'they are the beat he has ever eaten'. We have been married for 30 years, this is BERY high praise. Thanks for sharing,MzMudd"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tasty dough. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Marks Bullis"
},
"reviewBody": "great recipe for apple or cherry turnovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I grew up in La. and my grandmother made sweet dough fig pies every year for the Christmas holidays. This recipe tastes as good as my memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roberma"
},
"reviewBody": "This crust is not flaky, so if your looking for fluffy turnovers dont use this. The crust is real tasty."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12480/cajun-sweet-dough/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12947/desserts/pies/fruit-pies/cherry-pie/",
"name": "Cherry Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12480/cajun-sweet-dough/",
"name": "Cajun Sweet Dough"
}
}
]
}
}
, "about": [
]
}
]