				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cajun Chicken and Sausage Gumbo"
,"datePublished": "2019-04-02T02:49:03.000-04:00"
,"dateModified": "2022-05-19T06:19:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jodi Hanlon"
,"url": "https://www.allrecipes.com/cook/859997"
}
]
,"description": "This chicken and sausage gumbo uses a roux as the thickening agent in this traditional Cajun-style gumbo that&#39;s rich and hearty with lively seasonings."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hdp1YAraLD2xEu9DMzKNlZ75GLk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1088072-fee9dfee87474d378d769b3177bf176a.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5803243975001",
"description": "A southern Louisiana inspired gumbo full of flavor and history.",
"duration": "PT1M38S",
"name": "Cajun Chicken and Sausage Gumbo",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0e847566-87ca-438f-90d4-489cb3bc1452/cc8aa2e8-675b-4069-aca5-52902b6e988e/1280x720/match/image.jpg",
"uploadDate": "2021-07-05T11:51:11.703-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cajun Chicken and Sausage Gumbo"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "632"
}
,"cookTime": "PT150M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "480 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "56 mg"
,"fiberContent": "1 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "1183 mg"
,"sugarContent": "2 g"
,"fatContent": "40 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 cup vegetable oil",
"1 cup all-purpose flour",
"1 pound andouille or smoked sausage, sliced 1/4 inch thick",
"2 celery stalks, chopped",
"1 large green bell pepper, chopped",
"1 large onion, chopped",
"4 cloves garlic, minced",
"salt and pepper to taste",
"1 pinch Creole seasoning, or to taste",
"6 cups chicken broth",
"1 bay leaf",
"1 rotisserie chicken, boned and shredded" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a stockpot over medium heat; whisk in flour until roux is smooth and has cooked to the color of chocolate milk, about 8 to 10 minutes. Be careful not to burn the roux. If you see black specks in the mixture, it&#39;s best to start over."
} ,{
"@type": "HowToStep"
,"text": "Add sausage, celery, bell pepper, and onion into the roux; cook and stir 5 minutes. Add garlic; continue to cook and stir another 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Season with salt, pepper, and Creole seasoning; stir well to blend. Pour in chicken broth and add bay leaf. Bring to a boil over high heat; reduce heat to medium-low and simmer, uncovered, for 1 hour, stirring occasionally."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hdp1YAraLD2xEu9DMzKNlZ75GLk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1088072-fee9dfee87474d378d769b3177bf176a.jpg"
}
]
,"text": "Stir in the chicken and simmer 1 hour more. Skim off any foam that floats to the top during this time."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT195M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just letting others know that Olive Oil worked great for the roux ( possibly healthier ) I let it color slowly with the flour to a nice dark reddish brown - about 20 mins or more stirring very frequently. Also, I added uncooked chicken tenders in the first hour and then roughly cut and returned to broth before serving. I also added ground hot Italian sausage instead of the Andoulie - added before the 2 hour simmer. I use the Creole seasoning from 'all recipes' and keep it in a jar for next time. I used about 2 tsps and it was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i loved using this recipe it was simple and easy will definitely be using it in the future"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it was ok for simple and easy dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this recipe several times. It gets better every time. I finally got the roux to a chocolate milk color. It took me a few tries to get it dark. This is my go to on a cold day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The roux described here is too oily for a gumbo. Try 2 c flour to 1 cup oil ... an equal parts flour/oil roux is far too oily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JaneDough"
},
"reviewBody": "My go to for over 5 years!! The only things I change: 1. Add okra last 20 minutes of cooking. Its not Gumbo without it. 2. Use 1/2 cup oil and flour instead of 1 cup 3. Add shrimp the last 5 minutes. Or cook on the side and garnish with it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichelle Perera"
},
"reviewBody": "This was very good, followed a reviewer's suggestion of 1/2 cup oil and 3/4 cup flour. The roux took about 30 mins. Note: This takes 3 hours so start early!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Truss"
},
"reviewBody": "I have been making this for years. My family absolutely loves it. I add more flour to the roux since we like ours a bit thicker. I also substitute for smoked turkey sausage. I usually throw a couple chicken breast in and remove them to shred and throw back in as an alternative to the rotisserie chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tex Mom"
},
"reviewBody": "This gumbo was very good. I added 1/2 ts of garlic powder, cayenne pepper, chili, pepper and a 1 ts of salt. Making the roux took a little longer. Everyone loved it! Most of my family had seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It came out horrible. Some mistakes my own, but honestly, this could've all been resolved if the recipe writer Jodi decided to put the very important fact of \"you don't need a whole cup of oil and flour, half a cup will do for your roux\", in the comments. Since if I saw that in the recipe, I'd have probably made an excellent roux out of the bacon and meat grease I had, plus the small amount of veggie oil I had as well. (Someone used my huge thing of oil and didn't really do much, so tragic.) But, I also messed up the rest nonetheless, lol. I'll admit my mistake: I thought \"How much is a cup of oil anyways, it seems like it'll be a lot?\", and proceeded to use olive oil (no other oils on deck) and a *lot* of it, sadly measuring by guess (bad call). Aaaand then trying to balance out the flour and the oil was wack. It came out a flavorless disgusting gravy abomination, an Eldritch horror in the pot. I wish I had video. It was horrible. No amount of chicken broth, seasonings, or anything could help. Me and my bf's first responses upon tasting it.... \"The.... meat is good!\", followed by retching and a bad aftertaste I could not shake. Too creamy. Very bland. Just.... so much wrong with it. Eating plaster of paris might be better, honestly. I made a gravy with no soul to it, a soul-stealing gravy that takes most of your joy and passion for cooking with it. An expensive embarrassing mistake in so many ways... But even if I did get it right, it did seem too creamy nonetheless. Take my review as a vent and a grain of salt. I'll take the L. But pleaaaase put the 1/2 cup of flour and oil statement in the recipe, not the comments. It mightve made all the difference. (Aside from the 3 other mistakes I made of too much oil, too much flour, and olive oil as the choice as well.....) TL;DR: should've done it differently or used a different recipe, or just adjusted the flour to oil myself and winged it risking a slightly less thick/'by the book' gumbo, versus the \"this is kinda by the book im trying my best\" worse winging method and making the most nightmarish meal i have ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terry"
},
"reviewBody": "OMG this is soooo delicious! I've made roux many times and I take mine to a darker brown than chocolate milk, but that's just a matter of taste as roux goes. Putting this one in my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peter Cartella"
},
"reviewBody": "Very good! I well make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added jalapeno sausage for a little extra heat. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Schamberger"
},
"reviewBody": "This was my first time making a roux and gumbo and it turned out very good!! I followed the recipe exactly. My Dad and husband complimented it several times and I have enough for leftovers tomorrow! Making the roux was very easy but I watched a couple “roux making” YouTube videos just to be sure. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "I added shrimp, sausage, and okra to the recipe. We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erin"
},
"reviewBody": "Not pretty to look at but tasted AMAZING! We will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Pringle Hepting"
},
"reviewBody": "It was very tasty. It’s not exactly quick, but it came out very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vikki Chowns"
},
"reviewBody": "I finally stepped out and found a Gumbo recipe that was so simple and so tasty that it will be used again. Okra was added and extra celery and the Cajun and Creole spices were put in freely as we like the heat to kill those inside winter germs. Challange on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle LeMire Power"
},
"reviewBody": "Just made this with a few changes and it was a huge hit! First of all, the roux takes a long time, go slow, it was probably close to 30 minutes to get to a dark brown. I sauteed the andouille in a separate pan, and then sauteed the veggies in the grease from andouille. I used chicken breast that I cut up into bite size pieces and sauteed that as well. I then added to the roux. It was a little oily but after cooking for a while and adding extra stock, it turned out fine I also added a can of Rotel with mild chilis and a bag of frozen okra and threw in a whole jalapeno that cooked down and added depth. Served it over yellow rice and made a sweet cornbread,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jhchristie"
},
"reviewBody": "I’ll let you know when we eat it tonight, but so far, it smells wonderful! I first made gumbo a few years back—not this recipe—and was disappointed, probably because I didn’t get the roux dark enough. This time I persevered; it takes more than 8-10 minutes, more like 15-20. I didn’t want it to burn and I have a very powerful stove with gas burners…I baked chicken drumsticks and thighs, made my own Cajun seasoning, and two kinds of sausages—andouille and a milder kind. I intend to thrown some shrimp in at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used canola oil instead of vegetable oil, gives it better flavor. I also used boneless skinless chicken thighs instead of rotisserie chicken. It is a very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mkirby"
},
"reviewBody": "Most amazing. Thanks Jodi :) \nI added hot sauce and shrimp"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen8817"
},
"reviewBody": "What a great recipe. I sautéed my veggies, then sausage separately, baked chicken breast covered, low and slow so it fell apart, put all this in the crockpot while I made the rue. Then poured rue into crockpot, added the stock, bay leaves and Cajun seasonings and lots of black pepper. Simmered and it is amazing! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teeboutt"
},
"reviewBody": "Delicious! Very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Kraft-Wetter"
},
"reviewBody": "It was delicious! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdeal2014"
},
"reviewBody": "I did end up adding an extra 2 chips of broth about half way thru and I used celery salt instead of celery. I also used 2lbs of chicken breast shredded but it turned out amazing in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "This recipe is great. I browned my sausage first because we like a little crunch. I also went ahead and threw the chicken right in after the broth. (Remember I browned the sausage first) Simmered for a little longer than a hour and it was delicious. We served it over rice. Magnificent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Boatright"
},
"reviewBody": "Great recipe enjoyed making it with my niece who is leaning to cook"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terryrandall"
},
"reviewBody": "This is an excellent relatively easy recipe as gumbo goes. Enjoyed it very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobby"
},
"reviewBody": "It was a great starting point for me. I have a jar of roux in the cabinet but since I started making it on the fly I haven’t opened it yet. I like it better this way. I did cut back to 1/2 cup of flour and oil. Overall I’m glad I found this one, it has helped me to personalize how I like my gumbo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Sobel"
},
"reviewBody": "It was good, however I did add okra"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crustina"
},
"reviewBody": "Excellent recipe! This was my 1st time making a roux and gumbo. I followed the recipe exactly except I cut down the oil and flour to 1/2 cup each because of the comments I read about it being too thick and/or greasy. This ended up being bad advise in my opinion. It was way too thin. I should've stuck with the recipe. The only other advice I would give is let it cool a little before serving. It was sooo good my family was wanting to eat it fast but couldn't because it was so hot. We were all drooling trying to hurry up and blow on it to get another bite in lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "d-momof4"
},
"reviewBody": "Absolutely delicicous! I don't use bell peppers and celery is only used if I have it. I use Conecuh smoked sausage and it turns out great every time! You can't mess this up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicia Hardesty Stanfield"
},
"reviewBody": "This recipe is so good! It was my first time making gumbo, but it sure won’t be the last! \nI made a few very slight changes, based on comments and what I had on hand: used 1/2 c. oil and 3/4 c. flour, used some chicken thighs I had on hand, didn’t have a bay leaf, and I added about 4 c. of sliced okra.\nFor the creole seasoning, I used a recipe I found on this site (cut the salt in half), and added 3 T. of it to the gumbo. \nServed the gumbo over rice, and our taste buds were happy, happy, happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry D"
},
"reviewBody": "The recipe was simple and the Gumbo was good. I added a little cayenne pepper to make it a little spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "silver"
},
"reviewBody": "Yeah this is really good ..make this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Engwall"
},
"reviewBody": "Pretty easy to make and very tasty. The creole seasoning packs a punch, so taste as you go on that. This recipe, just as it is, will be in our rotation of go-to meals from now on. Great to make ahead and bring for lunch during the week. Really good served with brown rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mark rocklin"
},
"reviewBody": "not sure why this got such good reviews. Didn't have much flavor. Kept adding Cajun seasoning but really didn't do much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel33"
},
"reviewBody": "I have nothing to compare this to as far as authentic gumbo, but I think it turned out pretty amazing! The only things I did different was using a red pepper ( because I don’t care for green ) and I used just regular chicken breasts. I also made my own creole seasoning from a recipe I found on here. Added 1 spoonful and I felt that was enough since I’m a wuss and can’t handle too much heat! Perfect! If I wasn’t so afraid of burning the roux I probably would have cooked it a bit longer..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillian"
},
"reviewBody": "So SO good! This reminded me of the \"proper\" gumbo that I've had in LA when visiting family. I was always so confused when I went to a restaurant elsewhere and their \"gumbo\" didn't resemble this. I started second guessing myself and wondered if my family just made it different.\n\nFor the seasoning I used 1.5 TBSP of Zatarain's creole seasoning and I wish I had some gumbo file to add as well (the original recipe doesn't mention it but some other reviewers do.) I also prefer a darker roux so I cooked mine for about 30 minutes and babied it to ensure it wouldn't burn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Way too much oil. Next time 1/2 c. Oil and flour. Cannot stress enough the need for patience when cooking roux. I may try oven method. Creole seasoning to taste? I started with 1 TBS. and put Tabasco on the table. Otherwise, good flavor. Result was VERY thick. Again, reason to reduce roux quantities. Not sure I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cailyn"
},
"reviewBody": "Very yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha McDaniel"
},
"reviewBody": "Only saying 4 stars because the roux is too much oil and flour - 1/2 cup oil and flour is plenty. Otherwise? Crystal hot sauce, good rice - perfect meal. Have made this many times. I usually use a combo of thighs and wings to get a good broth and soft meat. Dark roux makes it exceptional. No tomatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lia"
},
"reviewBody": "First time making gumbo. It was amazing! I made it with 1/2 sausage and 1/2 ground turkey and added okra and 1 jalapeño. Everyone in the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva "
},
"reviewBody": "Awesomeeeeeeeeeeeee !! Hubby went back for 3rd's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Had reservations about making this because of the amount of oil used, I was right. Can’t see making this again. We typically do not eat fried foods so that oil to make the roux is a big turn off to us, not to mention the house smelled like a deep fryer for two days. Also really didn’t care for the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madison"
},
"reviewBody": "I made this (almost) exactly as written! I used 2 lbs of sausage instead of adding any chicken because my husband doesn’t like chicken? And it was sooooo good!!! Next time I might add some okra from the garden just because I like okra and see that others have added it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C Pollock"
},
"reviewBody": "I make this once or twice a year and it’s always a hit in my family! My husband wished there was some sort of seafood in it but it not me so I’m OK with it LOL the only thing I wish was different with the amount of creole seasoning that’s advised. I knew tastes are different but the guideline would be helpful. Not ever having gumbo before this, I don’t really have a preference as to how much or how little and supposed to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kismit"
},
"reviewBody": "Excellent recipe!! I make my own stock though and use pickled okra instead of fresh"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hwade"
},
"reviewBody": "Followed exactly and it’s amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric W."
},
"reviewBody": "This recipe is absolutely delicious!! It came out better then I expected and my mouth is watering just thinking about how good it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Reed"
},
"reviewBody": "My family and I really enjoyed this. I added shrimp as well but followed the recipe as written otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty Bernal"
},
"reviewBody": "We loved this gumbo! I sautéed sausage to get a bit charred on the edges, then added some creole seasoning whole diced onion till caramelized. Removed from pan added oil ( I would suggest using 1/2 or 3/4 cup, 1cup was too much in the end of it all). I left out the bell pepper but used 5 celery sticks, 4 carrots then added sausage and boiled as suggested.finally I added 1/2 of the rottisserie chicken (saved the other 1/2 as back up) and 1 can of corn with juice also added 1 Serrano pepper then cooked that together for 20 mins... done! I made rice and corn bread as sides and when putting it away added the rice to the gumbo. This recipe was so easy and I got the kiddos from my Texan SO! This is perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kittycat"
},
"reviewBody": "I followed the recipe and left it in the crockpot overnight on warm and it was so delicious today!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Brown"
},
"reviewBody": "Anyone saying this ends up oily didn’t cook the roux correctly. The gumbo also needs to be cooked for the specified cooking time or longer to ensure the flour cooks and the gumbo thickens correctly. Delicious recipe. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyn Jemison"
},
"reviewBody": "I’ve made this 3x and each time it gets better. That roux takes WORK, that’s for sure. It’s not oily and it’s not thick at all...I’m not sure what others are doing to make it that way. Next time I’m adding shrimp and more jalapeños"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malika Norris"
},
"reviewBody": "I loved it but I added okra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Neekluc"
},
"reviewBody": "This recipe is great! We loved it as did our guests. I used 6+ boneless skinless chicken thighs instead of the rotisserie chicken and added a pound and a half of cooked medium (peeled and deveined) shrimp. I had a hard time getting the roux to the \"color of chocolate milk\" and being brown enough for a gumbo. So the second time I made it, I used mushroom broth because it is brown and added to the color. I'm also going to add some jalapenos to the gumbo for a bit of a bite. The recipe makes a lot! We will definitely be having this meal again...and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John P. Cornelius"
},
"reviewBody": "I have made this recipe many times. It always comes out fantastic and is a favorite of the entire house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Benji Robinson"
},
"reviewBody": "This is the first time I've made gumbo. After I had gumbo in New Orleans in 2018, I just had to try making it myself and I'm so glad I found this recipe because it's so easy and so delicious! I'm a new-ish cook and I use this app for literally every recipe I've made and I haven't been let down yet. Bon Appétit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi from the plains"
},
"reviewBody": "It was my first time making gumbo and it was a lot easier than I thought it’d be. My 8 year old rated this as a 20 out of 10. She loved it; we all did. I followed the recipe except I used Cajun Seasoning instead of Creole Seasoning and I cut the Simmer times (50 minutes the first time and just 30 minutes the second time). I also just used beef sausage to help cut down on the heat for my kids. It worked well to just used two dashes in the gumbo and then I just left the Cajun Seasoning on the table so my hubby and I could add the extra heat. I will absolutely make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HRSawyer"
},
"reviewBody": "This was my second time making the recipe. Both times have turned out great! I’ve found that the roux doesn’t need to be perfect to yield good results. Nonetheless, good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Bontrager"
},
"reviewBody": "Awesome! Authentic! I am not a Cajun, but have eaten with many good Cajun cooks, and using this recipe, I think I could give them a run for the money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaniz Home"
},
"reviewBody": "I have picky eater in my house, boys are not fans of different. I took a chance on this and it was a success. I did add shrimp to give it a more authentic taste and used chicken breast I cook with olive oil and creole seasoning so slight mode to original recipe. I’m no cook and was worried the roux would be the hardest part but nailed it on my first try. Excited and happy with the outcome and with my boys experience with enjoying it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jatedder"
},
"reviewBody": "This is sooo delicious! I added a lot more creole seasoning and some cayenne pepper since we like a lot of spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sierra Grandma"
},
"reviewBody": "Everyone in my family likes this recipe. I cut down oil to half a cup &amp; flour to 1/3 cup (the sauce got too thickened last time I cooked) as I like more thinner sauce. I don't have Creole seasoning, so I used Cajun's Choice blackened seasoning, also add cayenne and paprika. I don't have celery &amp; I used organic red bell pepper. I don't have enough time, so I simmer the first part for 45 minutes, then put rotisserie chicken in to simmer for another 45 minutes. Serve with basmati rice and side salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrpour Itup"
},
"reviewBody": "Amazing recipe! I added seafood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Poer"
},
"reviewBody": "I have been using this recipe for 6+ years and family can't get enough! I have tried several other gumbo recipes and this is closest I can get to what we had in LA. My only change is to add okra and boil my chicken breasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Wonderful recipe! I added shrimp in the last 5 minutes of cook time, but otherwise cooked it as written. Thank you for an excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy A"
},
"reviewBody": "I loved this gumbo but I did something a little different, I put raw chicken legs in the gumbo and let them cook with all the seasonings and everything. It turned out so good and had so much flavor!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Cane"
},
"reviewBody": "Amazing! I used alligator sausage! I did feel like I needed to add alittle more broth before serving. I also suggest adding some okra in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Schroeder"
},
"reviewBody": "Love this recipe!!! Made this recipe twice already, one with Hillshire Farm smoked sausage and one with Conecuh sausage. If you can find it, use Conecuh —the difference is like night and day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monical"
},
"reviewBody": "Excellent! Lived in Louisiana for a few years and this was an authentic recipe. Love, love,love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Jowett"
},
"reviewBody": "Very good dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustComfort"
},
"reviewBody": "Never had Gumbo before. Never made a roux. Thank you for telling me the color the roux should reach. Spend time on the roux. Spicy but oh so good! I added more celery and worcestershire sauce. Will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joey"
},
"reviewBody": "I liked the recipe very much. We like our food spicy however I did not put enough creole in. The rue was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeepchick305"
},
"reviewBody": "Easy and yummy. I made it as written, and skimmed oil off the top while it was simmering and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany Benning"
},
"reviewBody": "I didn’t add the spinach and I made my own broth. My family thought it started off to be a little bland, so I added some seasoning salt, basil, oregano, and a Garlic and Herb seasoning which gave it excellent flavor and everyone enjoyed every bite. Will be making this again. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vkeb10"
},
"reviewBody": "First I will say that I did not make this recipe. But I wanted to say that I have been making gumbo since I had to stand on a chair to reach the pot. I grew up in south Louisiana. This recipe is pretty close. The only thing I would change is to use raw drumsticks. I use drumsticks because there are no little bones kids can choke on. You need the raw bones to add flavor to the sauce. This is what is called a file gumbo. So if you want you can add shrimp, crab, and or oysters in the last 15 minutes of simmering (not sooner or they will fall apart). I remove the drumsticks from the gumbo and let it cool enough to handle and remove meat from bones and add meat back into gumbo. Throw bones away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Brooks"
},
"reviewBody": "I love this..I used this recipe but added craw fish, shrimp, and corn ( instead of okra)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodger"
},
"reviewBody": "I just made this and doubled the recipe, it turn out absolutely delicious. What can I do to make it a bit thicker.( I doubled everything but the oil and flour, I only used 1 cup of each)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tadpole84092"
},
"reviewBody": "Awesome! Just follow the directions, I used a bit less stock and substituted crab meat for chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adamc"
},
"reviewBody": "I added some Tabasco sauce, a bit more creole seasoning and lump crab meat. Turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Caldwell"
},
"reviewBody": "Fabulous recipe! I did follow a suggestion from another and made my roux in the oven - it was fabulous! Used 2/3 cup of vegetable oil and 1 cup of flour. Mix on the stove with whisk - oven on 375 - then place in the oven. I did so for two hours stirring every 20 minutes. It was perfect. As with other reviewers, I swapped green pepper for cut okra (frozen 14 ounce) the last 30 minutes. I did have to add some additional broth and one cup of water for my desired consistency as it simmered. It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe C"
},
"reviewBody": "I boiled my own chicken and made my roux darker. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shefflyn McNew"
},
"reviewBody": "Followed instructions, turned out great, new family favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gregkeeney"
},
"reviewBody": "Followed the recipe other than used Maryland blue crab and shrimp because we don’t eat sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mae"
},
"reviewBody": "Such a delicious recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ramos"
},
"reviewBody": "Delicious Gumbo recipe. Me and my family absolutely loved it. I would definitely make it again. I made a few minor changes. The roux was very thick so I used 8 cups of chicken broth instead of 6. Also, I fried a whole chicken and deboned it instead of using a rotisserie. Finally,I threw in some frozen Okra about 30 min before the gumbo was done. I will definitely be making this again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Garrett"
},
"reviewBody": "I made it exactly as written. It turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christi2900"
},
"reviewBody": "Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katann"
},
"reviewBody": "I made this pretty closely following the recipe, with the exception of using chicken breasts because I had them. My son rarely comments about the meals but he loved this! Very simple to follow. I cooked my roux until it was about caramel color due to time restraints. I’d like to try to get it really dark next time, but I think it’s going to take a lot longer than the contributor says"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aprilita Briggs"
},
"reviewBody": "This was a big hit for my family. This was my first time making it an the whole family had seconds wish I could of took a picture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Mark"
},
"reviewBody": "I used this recipe as a base for my experiment...I made some homemade ancho Chili, rosemary, fennel seed, sun dried tomato beef sausage and decided to use that instead of the andouille. Instead of chicken, I used 16-20 peeled prawns. I didn’t have any Tabasco on hand, so I used what I had, black pepper, sriracha and vinegar to mimic the Tabasco flavor. The sausage gave it a hearty, savory, beefy flavor to it, while the prawns gave a slight sweetness and snapping texture to it. I also added some unsalted butter to the roux because butter makes everything taste better...combined with the celery, peppers, garlic and onions, there was a little bit of sweet, a little bit of heat, a little bit of tang and little bit of savory meat....food experiment was a success..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn"
},
"reviewBody": "I’ve made this recipe a few times and it’s one of my family’s favorites!!! It’s super easy to make and it’s absolutely delicious. When making it I did decrease the oil/flour to 1/2c like others did. Thanks for sharing this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hayden Bourque"
},
"reviewBody": "A real Cajun gumbo does not use bay leaves so I opted out of that ingredient. If you find your gumbo is “oily” you have not skimmed the oil off. You really gotta be patient and skim off as much oil as possible. If you don’t your meal will be oily. This recipe is on par with what my grandma makes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nic Perry"
},
"reviewBody": "This was absolutely perfect! Watch out for the creole seasoning that you get, as some come with quite a bit of salt. This was just the best version of classic New Orleans gumbo that I have had forgotten outside of the 9th ward. I don’t have enough hands to give this as many high fives as it deserves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenya"
},
"reviewBody": "This is a wonderful dish."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/141114/cajun-chicken-and-sausage-gumbo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
"name": "Gumbo Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/141114/cajun-chicken-and-sausage-gumbo/",
"name": "Cajun Chicken and Sausage Gumbo"
}
}
]
}
}
, "about": [
]
}
]