				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cake Mixes from Scratch and Variations"
,"datePublished": "1998-05-25T10:32:25.000-04:00"
,"dateModified": "2022-08-08T11:37:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Janet"
,"url": "https://www.allrecipes.com/cook/24324029"
}
]
,"description": "A convenient substitute for commercial mixes. Quick, easy, and yummy. Best of all, YOU control the ingredients!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/q4u4FiD83_kea6SqTNl8HaFYSdk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5571476-cake-mixes-from-scratch-and-variations-Christopher-Crouch-4x3-1-4f487b62473e4cd08709cf5b39cb4d1f.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cake Mixes from Scratch and Variations"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "766"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "142 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "144 mg"
,"sugarContent": "13 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2.3333332538605 cups all-purpose flour",
"1 tablespoon baking powder",
"0.75 teaspoon salt",
"1.5 cups white sugar",
"0.5 cup shortening",
"2 eggs",
"1 cup milk",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "For a Yellow Cake: Sift together flour, baking powder, salt, and sugar. Cut in shortening until fine crumbs are formed. Add eggs, milk, and vanilla. Beat at low speed for 1 minute, then high for 2 minutes, scraping the bowl frequently."
} ,{
"@type": "HowToStep"
,"text": "Pour batter into greased and floured 9x13 inch pan. Bake in preheated 350 degree F oven (175 degrees C) for 25 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Variation for a White Cake: Prepare as for the basic cake except use 3 egg whites for the 2 whole eggs. Whites may be beaten separately and added for a lighter cake."
} ,{
"@type": "HowToStep"
,"text": "Variation for a Chocolate Cake: Add 1/4 cup cocoa powder to the basic cake mix prior to adding the milk."
} ,{
"@type": "HowToStep"
,"text": "Variation for a Spice Cake: Add 1 teaspoon cinnamon, 1/4 teaspoon ground cloves, and 1/4 teaspoon ground allspice to the basic cake mix."
} ,{
"@type": "HowToStep"
,"text": "Variation for a Pineapple Upside Down Cake: Melt 1/2 cup butter in the bottom of a 9x13 pan. Add 2/3 cup brown sugar, stirring into the butter. Arrange pineapple slices in the pan. Top with the basic (yellow cake) mix recipe. Bake 30 to 35 minutes, cool 5 minutes, and invert to serve."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Raices"
},
"reviewBody": "Made the pineapple variation and came out delicious. Very high and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Lewis"
},
"reviewBody": "I love the recipe and I am gonna go to it as much as I can. It's super easy and very yummy and better than any brand off the shelf. I was truly impressed with the recipe and the flavors were very good. Great recipe I would highly recommend it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maly2u"
},
"reviewBody": "Yes created it into a peach turn over"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missie Jane"
},
"reviewBody": "The texture and consistency was excellent! I used olive oil and a little water instead of shortening. My family and I loved the dessert I made with this. However, it needed more flavor. I was going to use a store-bought box mix and there are more chemicals and flavoring in there (not healthy, I know, but a rare \"treat\") When I make this again I will be using butter. I use butter in most of my scratch baking and there is a huge difference in flavor. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dusty Livas"
},
"reviewBody": "Absolutely awesome !!!!\nHave made this several times \nworks good with store bought egg whites \nvery easy to make try subbing other flavors instead of the vanilla we like strawberry with a little red food coloring added"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodcrazee"
},
"reviewBody": "Cake batter waffles! I was in a hurry and made it as is this time, even though I usually make my own adjustments. It’s a good thing I did, for what I was making. We waffled the yellow cake recipe as a test run, and it was amazing! The waffles were crispy on the outside and fluffy inside. I read reviews afterwards and saw some were adding extra sugar. Wow! I had actually considered cutting the sugar next time. I can’t wait to try it again, with a few tweaks and some of the variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zofiazofia"
},
"reviewBody": "I reduced the sugar. I always reduce the sugar, however this is not the type of recipe where you want to do that. I can really taste the flour and the baking soda now. I’ll know better next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Frank"
},
"reviewBody": "It was very excellent. My 11 year old daughter made the pineapple upside down cake and we both love it. We used pineapple chunks instead of the rings and it tasted absolutely marvelous and we plan on making it again very soon! It has rich, delicious flavors that melt into your mouth and it was the best pineapple upside down cake I have ever tasted! I definitely recommend this recipe as it is very exquisite and divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "I am not sure if this should be a 3 or 4 star. It is a great recipe as far as easy (and everything tastes better than a box). But I think butter would greatly improve the flavor. Also, while we got good cupcakes from this, I am pretty sure next time I will use the standard cake method or creaming the butter and sugar, then alternating wet and dry ingredients. I do love that this is from scratch (a real recipe) and I like the variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker@Heart"
},
"reviewBody": "This recipe yields a perfect cake. It's as firm as a box mix &amp; simply delicious. I followed the suggestions of using oil instead of shortening &amp; the additional milk. I also added a heaping dollop of sour cream. I'll be using this recipe for a long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nelda Jo Speed"
},
"reviewBody": "I needed a cake mix to make a pineapple upside down cake so decided to try this. I used butter instead of shortening and a mix of coconut milk and pineapple juice for the liquid. I had extra batter so I used a couple of small individual size loaf pans. I chose this out of the numerous recipes I searched because it called for less sugar. Even so I believe next time I will cut the amount of sugar. The mix was excellent for the pineapple upside down cake and the extra cake was great. The plain cake with no icing would be perfect with berries or fruit and cream. I will keep this recipe handy to use instead of box mixes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teddy Lowe"
},
"reviewBody": "I used macadamia milk instead and it was moist and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shirley carr"
},
"reviewBody": "I'm eating my cake now. Easy and didn't have to shop .Everything I need to make the cake was all here .It is sooooooooooooooooooooooooo good.Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lenesset"
},
"reviewBody": "In the past I always have used a cake mix because I live in a city at 3000 feet and could not get cake recipes to work. I was very impressed with this yellow cake recipe. I added the package of pudding mix, used cake flour, used 3 eggs and oil, and increased the milk to 1 1/2 cups, as others suggested. The cake rose beautifully and tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "easy and delicious. added an extra egg and a little almond extract yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "I made the vanilla cake and it was delicious! I loved how light it was, I did use oil instead of shortening/ Also frosted it with a from scratch frosting everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martie"
},
"reviewBody": "Great basic recipe! \nI then made the chocolate cake with these tweaks\nUsed 1 C flour &amp; 3 Tbls of cornstarch, Used 1 C sugar, sub-ed oil for the shortening, 1 1/4 Tea b. powder, 1/4 tea baking soda, added 1/4 C fresh coffee, i did whip the egg white &amp; used almost 1/2 C cocoa. with buttercream frosting was divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana V"
},
"reviewBody": "I made it as is, Except that I used oil instead of shortening and sifted dry ingredients. The cake is a little dense, but the taste is delicious. I would not add anymore sugar and next time I will add the additional 1/2 cup of milk so the cake won't be as dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marianne527"
},
"reviewBody": "I used oil instead of butter. But it came out very dense. \nTasted OK. But not a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Nohra"
},
"reviewBody": "I love that this recipe is so easy to follow and there were so many option to adapt and customize it. I will be going back to this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elena Everson"
},
"reviewBody": "was soooooooooooooooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JWJWJW"
},
"reviewBody": "Turned out great! I made two, one with shorting and one with oil. The one made with shortening turned out MUCH better! DO NOT use oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keisha"
},
"reviewBody": "It's great my family and friends love it only thing to do is to replace shortening with 1 1\\2 stick of butter and it's all good and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Parks"
},
"reviewBody": "I am glad I found this recipe, as this is the one I used to make my children's birthday cake in June. Made a chocolate cake, made sure to read reviews and I am glad I did. After reading over the recipe and reading reviews, I changed up the ingredients as another reviewer suggested and the cake that was the end result was much lighter in color compared to box mixes. However it smelled like heaven, it smelled nothing like box mixes and certainly did not taste like one either. It was moist, crumbled just enough and my kids and family enjoyed it. I will not be buying box mixes again unless for some reason I have too. I definitely recommend this recipe but also recommend reading reviews first. They come in handy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BobE"
},
"reviewBody": "Taste Like a sugar Cookie - Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "Easy recipe and great taste! Just remember it's not a mix with preservatives, so you want to eat it much quicker. That shouldn't be hard to do - this is a very good, dense cake :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri'"
},
"reviewBody": "I made this exactly as instructed for the yellow cake, made the pineapple upside down cake, but substituted rhubarb for the pineapple. Absolutely wonderful! Great cake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this cake and it turned out great! I only had one problem with it, I had to double the batter for it to fill the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth Honey B Brice"
},
"reviewBody": "this is the first time I made a cake from scratch. I really enjoyed it however, the recipe is asking for too much sugar. If you dont want it too sweet, 2/3 of sugar will do. I substituted the sugar with cane sugar also. You can use 2% milk if it is too lumpy add another half cup. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam B."
},
"reviewBody": "I made this cake with butter flavor shortening, 3/4 c milk and 1/4 c pineapple juice. I didn't notice the pineapple upside down variation till I had already melted my butter and added the pineapple and brown sugar. put it in an 8x11 pan by mistake. Even though it was thick, it was very moist and yummy. It did crack when I took it out of the pan. next time I'll use the correct size pan. My husband and I both think it's delicious, much better than boxed for sure. Will be making this again. If I had had a yellow cake mix I wouldn't have tried this. So glad I did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenn Salsman"
},
"reviewBody": "The yellow cake was moist and had good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Connorsmommy83"
},
"reviewBody": "Overall, pretty straight forward &amp; I had all the ingredients on hand. I read from another reviewer who's been making this for years to substitute oil, but I wanted to make this as stated before I tried that method. I melted my shortening to avoid any lumps (not making a biscuit here :) ) Note to self, next time cool shortening slightly before adding to room temperature egg, otherwise, it will slightly cook the egg. Haha! I made the chocolate cake &amp; the only complaint I had was that when I went to frost it, my top layer (made 2 layers) started falling apart which I had to add extra frosting to make up for my error. I baked it for 25 minutes. I may try &amp; cook it longer next time (an extra 3 minutes or so) to make it firmer for frosting cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I have used this recipe many times over the last few years. It always turns out wonderfully. Thank you very much for posting this one!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pattie Haney"
},
"reviewBody": "I followed recommendations and used oil and cake flour. It came out much to dense. The only thing I could think of as to why was maybe stirring it a tad to much. I know better than over stirring so if I did it was not much over. I will try again and be more careful. I was lucky in using cake with strawberry purée and white chocolate cream. It seemed like I purposely made it that way because strawberry short cake is usually dense. I was lucky that's all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kthomas1"
},
"reviewBody": "Good idea in theory, but wasn't impressed. Even after reading other reviews, I decided to try the original yellow cake recipe before making many adjustments, except in cupcake form. I did adjust the cook time slightly to accommodate the smaller size and used oil instead of shortening, based on previous baking experiences. It isn't quite as sweet as I was expecting, but I liked that because I often make very sweet icings. Unfortunately, it was very dense, almost pound cake-like. And it stuck to my cupcake wrappers. They peeled away in tiny pieces! I would expect it to badly stick to pans, even after flouring. I'm not sure I'd make this again, but if I did, I would certainly add more milk, as other reviewers suggested. \r\n\r\nAlso tried the chocolate version, and it was more dense than the yellow cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "I made this cake and poured over strawberries, raspberries that had been sauteed in butter and brown sugar. It's kind of like an upside down cake. I usually use a boxed yellow cake but didn't have one. This was much better as it is thicker than boxed and absorbed the fruit and juice without becoming soggy or underdone. The flavor was delicious. I changed nothing in the basic recipe. Excellent texture.\nI do thin it with a little more milk when not pouring over butter, brown sugar and fruit.\nI have also used coconut oil as my shortening. I melt butter when using it as shortening. Best cake ever and easy. Tonight's my first chocolate cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexicakes"
},
"reviewBody": "I made an almond version of this cake using 2 teaspoons of almond extract. I made 2 changes to the recipe and it was a hit. 1) Use 2 cups of sugar. 2) Use 3 eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allyn"
},
"reviewBody": "It's a super spongy and delish cake. I made the regular yellow following the exact recipe. My boys loved it but to me it tasted too much like muffins. I might modify the original recipe a bit by substituting/modifying a few ingredients to give it a more cake like taste and airy texture as this was a bit dense for me. I'll definitely try the other variations. Other than that, it was easy and yummy. Definitely making it again! No more cake box mixes for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Crawford"
},
"reviewBody": "I wish I would have found this years ago. This is the only cake recipe I need. It is so versatile that others simply aren't needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "I used this recipe to make a cake mix for the Yummy Pumpkin Cheesecake Bars recipe on here, so I didn't actually make the cake. However, the mix worked perfectly well in the recipe and tasted great. It was very easy, too, and I'm saving this to my recipe box for when I next need a cake mix but have no mix in the house. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany M Flores"
},
"reviewBody": "I changed it a bit its super good. I used oil and a cup in a half of milk. I made the pineapple upside down cake came out perfect. I always use crushed pineapple makes it look a bit modern and pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lavern Mignott-Henry"
},
"reviewBody": "Tasted cakelike, but not like traditional Yellow Cake Mix. Cake was disappointingly heavy; no fluff whatsoever! Will try again though using the 1 cup Milk as oppose to 1 1/2 suggestested in reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Urso"
},
"reviewBody": "I just made the pineapple upside down version of this receive except I substituted the cinnamon for cake spice.I also used oil instead of shortening but let me say the cake tasted wonderful it tasted like a spice cake married a pineapple upside cake and the marrying of the two is delicious!!!!! Went over very well at my Xmas part must of gave out at least 50 links to this site along with can pies of my substitutions .I give it a 10"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Hendrix"
},
"reviewBody": "Super simple and great to play with! I used it as the base for a lemon-poppyseed cake and it turned out divine! Best part is you can sift together the dry ingredients and then store them for later use. It's my own easy, convenient cake mix, without the fear of soy or dairy lurking within the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KupcakesByKiyomi"
},
"reviewBody": "Absolutely love this recipe!!! One recipe made 4 dozen mini cupcakes, they tasted amazing!! Everyone loved them! And not to mention they have the perfect amount of density. Not too heavy but heavy enough that people will eat 1 or 2 mini cupcakes and be satisfied!!! Very Very happy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma McJ"
},
"reviewBody": "This recipe and all it's variations are delicious and a perfect replacement for those who are tired of cakes from boxes. Try the white cake with candy sprinkles for a confetti cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Steph RD Clair"
},
"reviewBody": "This cake is gross and a waste of eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hollinhead77"
},
"reviewBody": "I made the spice cake variation. I was super easy and delicious!!!! Made a wonderful cake for my husband's birthday. I can't wait to try the other types. A great alternative to the boxed stuff in the store and not too complicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Tresham"
},
"reviewBody": "This is a lovely cake recipe. Every time I have baked it the results have been delicious--including multiple variations. It is never like boxed cake mixes, thank goodness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole Gross"
},
"reviewBody": "My cake is cooking currently and it smells and looks amazing. The only problem is that I just realized that I misread the variations for the white cake and instead of using only 3 egg whites I used 3 egg whites and 2 whole eggs! I misread what she wrote. I hope this doesn't mess up my cake lol. I added extra milk an extra half teaspoon of vanilla. And I reduce the sugar to 1 and 1/4 cup. also I used oil instead of shortening. with all these changes I can only give 4 stars. *update*so I tried it today and it tastes exactly like a pound cake was a little bit less sugar so I just sprinkle some powdered sugar on top and it tastes great. Too bad I messed up the recipe I just wanted a plane in white cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hungarygrrl"
},
"reviewBody": "I have tried both the yellow and the chocolate variations. Both turned out great! This yellow cake has become my go-to need a cake in a pinch recipe and living in a country where hospitality is paramount, that is really saying something! Thanks for the easy to follow recipe featuring simple ingredients which are truly available just about anywhere!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ProfLeapstrum"
},
"reviewBody": "Be sure to either use less flour or more liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "acdm97"
},
"reviewBody": "Yum - made with 1.5 cups milk. Otherwise just as written for the chocolate variety. Yummy. Not dense, no problems. And best of all simple with standard ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "summersbreeze"
},
"reviewBody": "WOW I cant believe my cake worked !!! Im so shocked ... My cakes never work out not even the boxed ones.. Im glad this one worked cuz its my birthday and I baked it for me and the family !! First I sprayed my pan with nonstick spray then mixed 1 stick of melted butter with 2/3 cups of brown sugar and poured onto the bottom of the pan..topped the sugar/butter mixture with pineapple rings..then I thought I messed up the cake batter beacuse I thought I added only a 1 tsp of baking powder instead of a 1 tablespoon either way it looks so good.. I did however use 1/2 cup milk and 1/2 cup of pineapple juice in place of the 1 cup of milk.. 1 stick of real butter instead of shorting.. 3 eggs instead of 2..mixed the dry .. then the wet.. then combined both dry and wet..then into the mixture I added a smashed over ripe banana.. set the cake mixture asside...and wow it looks so beautiful I cant believe I baked that!! gonna run to the store pickup some cherries and place cherries in the pineapple rings.. Because this came out so good I I created a password and userid now im a member !! LOL added this to my Recipe Box I love this !! Thanks so much.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funiygirll"
},
"reviewBody": "omg very good recipe exactly liked box mix. You can manipulate this and make a ton of cakes w/ this. I will most definitely use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBY"
},
"reviewBody": "This is a very good recipe. If you want it moister go for an extra egg. Plus I found if making chocolate cake mix, baking soda seems to make it better. Use hot h2o to bloom the cp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef Miller"
},
"reviewBody": "I've used this yellow cake for 4 yrs now. Last year, I tried the pineapple upside down cake variation for my husband's birthday &amp; he's asking for it again this year. It's always turned out moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna Desonia"
},
"reviewBody": "My 9 year old won a first place and a reserve champion ribbon using this recipe for her 4H baking contest. Easy and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetsue"
},
"reviewBody": "So glad I found this recipe for my first from-scratch cake! The only thing I did was add a 1/2 cup milk as per many other reviews. It is so delicious and I have already used it twice in a week! I will never make a box cake again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tia"
},
"reviewBody": "This has been my go to recipe for three years now. My first cake came out a little rough, but a lot of practice, patience, and butter, I've been creating wonder and delicious cakes. \nRecently, I've being adding Greek yogurt in to my milk, and olive oil with to my butter (I do not believe in shorting and I absolutely refuse to ever use margarine.) Neither takes away or changes the flavor of the cake, and the yogurt helps with make the cake moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella cooking babe"
},
"reviewBody": "Simple. Quick. Tasty. Easy for anyone to make and bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kay Bee in Texas"
},
"reviewBody": "I made this in a bundt pan twice in one day (chocolate variation) for my two girls' birthday parties this weekend. I may never make a box mix cake again, although I have to make note of my changes to both directions and ratios. \n\nIn a large bowl, I sifted flour, 1/3 c cocoa and baking powder together with salt. In mixing bowl I blended oil (instead of shortening), sugar, 1-1/4 c milk, and 1/4 c creme de cacao. In a small bowl I whipped the eggs to a froth. \n\nAfter slowly adding flour mixture to oil mixture just until blended, I folded the frothy eggs into the batter and turned the whole thing into the greased and floured bundt pan. Baked at 325 for 40 minutes, it came out moist and bursting with personality. \n\nI'm hoping the birthday party guests don't eat all of it, because kids can't possibly appreciate this as much as I will, after the end of the second party with a glass of champagne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KacyKayB"
},
"reviewBody": "i am revising this recipe down to 1 3/4 cup flour, and replacing shortening with 3/4 cup unsalted butter. also a dash more vanilla and a sprinkle more sugar. \nso... if you are DEAD set on using this recipe listed above, please be cautious of your flour... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Big Kans"
},
"reviewBody": "I made the Yellow cake, took the suggestion from another review to use oil and 1 1/c cups of milk, and it turned out great. I've mad a few cakes from scratch, and this one was the best so far. I think however the cake it self needed a little more sugar, but everybody else seemd to think it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Made The Pineapple Cake.Not Sweet Enough. Would Add more sugar.Just an OK Cake.\nI Adjusted with Cake Flour,I used 3 eggs,Used 1/2 c oil,cut milk in half and added 1/2 c drained pineapple(crushed)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thenazarios"
},
"reviewBody": "Ive used this recipe about a million times. thanks!!! Its the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer"
},
"reviewBody": "goodbye boxed cake mix! I made the chocolate version. Only change I made was to use canola oil instead of shortening. It tasted like it came from a bakery...fresh, perfectly dense, yet moist. I made 6 jumbo cupcakes (Wilton's 6- 2 piece cupcake pan) and just put frosting between the layers &amp; on top cause the sides didn't need to be \"hidden\" by the delicious tasting cake! This recipe is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monalisa"
},
"reviewBody": "Awesome Recipe. This cakes tastes like it came from the bakery! Reminds me of a European recipe or wedding cake. It is a denser cake but comes out delish! I made no changes to this recipe and it made a beautiful birthday cake! Can't wait to try out some variations, i.e. lemon, or chocolate. thank you very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oldschool"
},
"reviewBody": "I made this recipe today [yellow cake with organge extract] but I made one important change: the way the batter is mixed. I hate to cut in and thought there might be a way to avoid it. Here is the streamlined version: Wisk together/stir together/sift flour, sugar, salt, and baking powder in a large mixing bowl. Make a well in the center and add shortening, milk, extract, and eggs. Mix on low for 1 minute, scraping bowl as needed. Increase mixer speed to high and beat two minutes longer, scraping bowl down as needed. Pour into prepared pan and bake. The cake was light,moist, and tasty. Adding more or even double the extract is not a bad idea; my cake was very lightly orange flavored. I read a number of reviews and have some suggestions for those of you who had trouble with this recipe:\n1. Check your baking powder. Is it outdated? Also shake your baking powder before measuring it or it may not leaven correctly.\n2. Time yourself when mixing. You may think you've mixed the batter for 2 minutes, but have you really?\nTry this recipe--you may never open another box of cake mix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dora Salinas"
},
"reviewBody": "THIS WAS SO GOOOOD!!!! MY family loved it. I did as the directions said for yellow cake. Because I saw the blended batter a little thick I added 3/4 cup of pear juice (I was originally going to add the pineapple for upside down pineapple cake but I only had canned pears.) DELICIOUS!! I cooked it for 35-38 minutes. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "As mnay have already pointed out this is a great base recipe on its own, however for a tastier and less dense versions changes are best . For me, I used the cake flour and sifted it along with some of the dry ingredients. I increases the sugar by half a cup which I added to the dry, the remaining sugar I creamed with 1/2 butter and 1/2 cup of oil. I then added 3 eggs and 1 tsp of pure vanilla. The I added the wet to the dry and folded them together, just adding enough milk to get the right consistency, definentialy not a cup of milk, 1/3 at the most. note the consistency was smooth and on the runny side. turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennbunb29"
},
"reviewBody": "i gave 4 stars because i put my own spin to this. i did 3 substitutions all the same amount though. i traded the shortning for butter, vanilla extract for almond extract and white sugar to brown sugar. turned out amazing and ohhhhh so yummy! it's got a great sweetness to it, especially if you're not the biggest frosting fan like me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "divinedani"
},
"reviewBody": "For Independence Day, we decided to make a cake -independent from a box! (we also forgot to buy cake mix and my kiddos were begging for a cake)\n\nWe made the yellow cake, substituting Saffron oil for the shortening and added a bit more milk (soy milk, actually). The cake fit in one 9\" pan and needed about 33 mins in my electric oven (I lowered the heat to 325 after 28 mins)\n\nTopped it off with icing from scratch (no-egg butter cream, which was awesome) and it was huge hit. Denser than the typical box cake, but delicious! We're never going back to the box!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "qween"
},
"reviewBody": "Recently made the yellow cake and changed it to what previous reviewers said (1 1/2 cup of milk, vegetable oil instead of shortening). It was really good and really"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jason Vancouver"
},
"reviewBody": "the cake recipe is good but I found it didnt fluff up like packaged mix's. for the upside down cake I use a packaged mix but use the pineapple recipe given. It turns out awesome everytime!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hobbies1934"
},
"reviewBody": "THANKS!!!just what I wuz lookin' fer---made peach cobbler and used the recipe on the peach can and not near sweet enough this is PURRRFECT---since on low sodium diet can skip the salt and also use fake suggah, yes I can spell, was in spelling bee in school, just love playing with words---yep and skip all those chemicals that we have NO idea what the hec they are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NorCalRN"
},
"reviewBody": "I followed this recipe to a \"T\" for the yellow cake, except that I added 1 beaten egg white and I mixed dry and wet ingredients separately and then gently mixed them right before baking. I baked it all in a single round cake pan and it came out beautifully- most tasty cake ever!!! WAY better than boxed mix!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bethw"
},
"reviewBody": "I've been using this recipe for about 4 years now and I love it. I wanted to have control over the ingredients. I follow Janet's directions but add in some of the comments from reviews (such as adding more milk, using oil or butter in place of shortening, combining ingredients in separate bowls and then gradually together, beating the egg whites) I usually make the white cake for birthdays and Easter cupcakes. Thank you Janet for providing this good recipe! And thank you reviewers for the tips you've left. I'm rather inexperienced so it helps to know what changes I can make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharlaine"
},
"reviewBody": "Tasty! I was a little skeptical when tasting the batter, but the end product is very good. I made the yellow cake into cupcakes. Yes, I would make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmj1993"
},
"reviewBody": "I thought this was a very simple and good recipe. I did use oil instead of shortening because I had none in the house but it still worked out quite well. My main concern with mixes is the moistness so I did add an extra egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "I did not have a box cake mix on hand and really wanted to make a cake for our St Patty's Day dinner. This recipe worked great! I used egg whites, half Spenda for sugar, half applesause &amp; half oil for the shortening called for. I also added 1/2 cup of amaretto and subbed almond extract for vanilla to make an amaretto cake. I baked in a bundt pan for 50 minutes (bit too long), and used a drizzle for frosting. This worked just as great as a box cake - thanks for saving me in a pinch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SDPhelps"
},
"reviewBody": "3 stars? Not crazy about this recipe, didn't care for the taste or smell, but they came out of the oven perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squirkie1"
},
"reviewBody": "I've used this recipe for quite some time now and have never been disappointed. My favorite is the pineapple upside down cake variation. :) Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiff M-L"
},
"reviewBody": "Wow! Very good and very versatile!! I took the advice of a reviewer and did it with oil instead of butter/shortening, and it was truly delicious. I topped with powdered sugar, and for some, I dropped in a Hershey's Kiss. Simply lovely.... but seriously, use oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeri"
},
"reviewBody": "This was very easy to make and was really good. My husband doesnt want me to use cake mixes anymore, he wants the cake from scratch. It was dense but it was still good. I made the homemade peanut butter frosting from this site with the white cake and it was awesome awesome awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "phyllis"
},
"reviewBody": "i followed this reciepe to the letter and i did not like this at all. it was very dry and tasteless. hopefully some other reciepes are better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SusanW."
},
"reviewBody": "I am puzzled by some of the reviews here. Why would anyone want a cake that tastes like a cake mix? The only good cake mix is a dead one. Is the goal to make an inedible cake???!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jordie"
},
"reviewBody": "I made the chocolate variation of this cake, it was the most flavorless homemade chocolate cake I've ever had. I upped the cocoa and used oil instead of the shortening, so that I would have a moister cake. I had to smother it in chocolate ganache to give it flavor (chocolate ganache makes everything better) I'll never make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristineM"
},
"reviewBody": "This was excellent, although if I were to ever make one cake out of this I would use 3 eggs. I also used butter flavored shortening, and was so pleased with the results that I will stick with that next time, too. The reason I suggest 3 eggs is that my 6 year old wanted to make \"chocolate, vanilla and strawberry\" cupcakes with the baking set she got today that included a mini-muffin pan. So, we split the dry batter (flour, baking powder, sugar and shortening) three ways: added a heaping tbsp. of cocoa for the chocolate; about 2 tsp strawberry gelatin (we used the kind with sugar - if using sugar free, you would obviously reduce the amount) for the strawberry and left the plain as is for vanilla. Added one egg, 1 tsp vanilla and close to 1/2 cup milk to each batch. Seriously, the best-tasting, moistest homemade cupcakes I have ever made. And so easy, my daughter could do most of it herself! We actually beat everything by hand until the batters were a smooth, pourable consistency. We got twelve mini-cupcakes of each flavor, plus had enough batter to make a 6\" vanilla, chocolate &amp; strawberry marble cake (for Dad!) So my advice - use three eggs, a little more vanilla, butter-flavored shortening and probably closer to 1 3/4 cup milk total. Tastes nothing like a box mix, but a great homemade (and EASY!) cake recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THUNDERKATZ"
},
"reviewBody": "I tried this recipe for a baby shower and everyone raved about it. Definitely a keeper!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LovetoBake"
},
"reviewBody": "I was looking for a cake recipe that i could make from scratch and get a box mix type of flavour and texture, but as other reviewers i have to agree its not like the box mixes at all. I used oil and increased the milk to 1 1/2 cups.. \nthe result...\nthe cake rose beautifully, was golden brown on the outside and white on the inside\n\nflavour= fresh out of the oven it tasted like flour, oil and eggs, kind of sticky although when i checked to see if it was done the toothpick came out clean... 2 days later, the flavour was MUCH better, not at all like it was the first day.\n\ntexture= very soft and moist\n\nin the end i think if i ever make this again i will make it a day or two before i need it coz it really changes the flavour to resemble a box cake to some extent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RISSE89"
},
"reviewBody": "Terrific base recipe. I baked the yellow cake today to take to a church function and it was a huge hit. I used 1/2 cup softened butter instead of shortening and added 1 cup of sour cream to the mixture and baked in a bundt pan at 325 for 50 minutes. The cake was so moist it was falling apart! I also made an orange glaze and drizzled over the entire cake. This recipe is so much better (and cheaper) than buying box cake mixes and it takes no time to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Super delicious pineapple upside down cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anastasia Fiske"
},
"reviewBody": "I add 1 package of vanilla pudding and increased egges to 3. Very good cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tiffany"
},
"reviewBody": "This wasn't exactly what I was looking for. It had a dry taste and texture. Wasn't as fluffy of a cake that I would have liked. Sorry, maybe I will try again later and see how it turns out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "marper3"
},
"reviewBody": "Followed the recipe except for substituting oil for the shortening, raw in the middle, tasted like flour will try again with shortening. I have been problems with baking white cakes lately due to high humidity. This time i used a different oven just in case."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Good recipe, I used it to make a yellow shaped cake and it rose nicely. I did as one reviewer suggested and changed shortening for oil and increased the milk. Perfect for when you don't want to or don't have time to get a cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy of Cooking"
},
"reviewBody": "Awesome recipes and yes I too recommend the oil instead. This recipe has helped me to make other cakes as well..such as spice cake, fruit cake.ect. This cake recipe is so much better than the box and alot safer too. Thanks...here's a big 5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "starrynite"
},
"reviewBody": "I just baked the cupcakes using yellow cake recipe. I added extra 1/2 cup of milk and used oil instead of shorting like other reviewers had suggested. I cut down 1/4 cup of sugar and added 1/2 cup of mini chocolate chips into the batter. I put all the dry ingredients and whisked them together then made a well in the middle and pour all wet ingredients except eggs and beat them till incorporate then put eggs one by one beat them each time till smooth. It came out nice and moist! I iced them with chocolate whipped cream mix-in crushed Oreo cookies. It was not too sweet, just the way we like it:)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8063/cake-mixes-from-scratch-and-variations/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
"name": "Yellow Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8063/cake-mixes-from-scratch-and-variations/",
"name": "Cake Mixes from Scratch and Variations"
}
}
]
}
}
, "about": [
]
}
]