				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Campbell&#39;s Cheesy Chicken and Rice Casserole"
,"datePublished": "2007-10-16T17:19:15.000-04:00"
,"dateModified": "2022-09-15T14:23:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Campbell's Kitchen"
,"url": "https://www.allrecipes.com/cook/campbellskitchen"
}
]
,"description": "This chicken, cheese, and rice casserole is loaded with mixed vegetables for a hearty and flavorsome meal the whole family will enjoy!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FiSjC9R-RqfDhiO-kkgE6yZec3c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/892142-0d12e0c0d7d248f5a03fc7a4592f2284.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Campbell&#39;s Cheesy Chicken and Rice Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "395"
}
,"cookTime": "PT45M"
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 cups fresh or frozen vegetables",
"1 (10.5 ounce) can Campbell's® Condensed Cream of Chicken Soup (regular or 98% Fat Free)",
"1.3333333730698 cups water",
"0.75 cup uncooked regular long-grain white rice",
"0.5 teaspoon onion powder",
"4 skinless, boneless chicken breasts",
"0.5 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix vegetables, condensed soup, water, rice, and onion powder together in a 12x8-inch shallow baking dish. Arrange chicken breasts on top; cover."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until chicken is no longer pink and cooked through, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Top with shredded cheese and serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Lou Spence Giles"
},
"reviewBody": "was exactly what I was looking for. I did the Italian style, but changed the cheese to Mozzarella, and used boneless thighs. Added salt, pepper, and a little garlic powder! Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Recipe didn't say to add salt to rice or to season the chicken so it didnt have flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Zarkovic"
},
"reviewBody": "this is exactly what I was looking for! easy and delicious. I used bone in chicken and baked it for 30 minutes at 400 and then turned it to 375 for another 40 minutes. Make sure to season the chicken! will make a gain"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerry Ramsdell"
},
"reviewBody": "I loved it and definitely recommend this tasty recipe to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven"
},
"reviewBody": "Very easy to make and so delicious. I added a little more veggies and seasoning. It's now one of my favorite meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily & Chris Jones"
},
"reviewBody": "Made this recipe for the first time last night, but with a few changes.\n\nBone in, skin on thighs and legs instead of chicken breast. \n\nSubstitute chicken broth instead of water. \n\nHeat up broth, soup, and lightly sauté veggies on the stove before mixing into casserole dish (used frozen veggies and it took the rice an hour and a half to fully cook in the oven, even with me heating up the soup and broth).\n\nSeason soup, rice, broth, and veggies with approx. 2 tbsp of McCormick Montreal Chicken seasoning. Mix until broth and soup are homogeneous and seasoning is spread throughout mixture. \n\nLightly season chicken pieces with the Montreal Chicken seasoning.\n\nOnce rice is fully cooked, top with the cheese and breadcrumbs. Continue cooking until a light crust forms.\n\nAfter eating, switch to loose fitting sweatpants and sack out on the couch. Note: pants are optional."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fee"
},
"reviewBody": "This was very good and filling. I used chicken stock in place of water and used cream of chicken with herbs. I also seasoned the mixture first otherwise you’ll have bland rice. I added an additional 20 mins of cook time to finish cooking the rice. I used chicken breast, but the next time I will used chicken thighs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Frye"
},
"reviewBody": "Great base for an easy weeknight dinner! I make it with milk instead of water, cube the chicken and mix it in with the shredded cheese. I also like to sauté onions, carrots, and celery to add to it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Depew"
},
"reviewBody": "we liked it, added cheese into the casserole instead of just on top. Next time will add a little more rice, it's juicy enough to do that and I love rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tarr0011"
},
"reviewBody": "Made as-is, this would maybe be a 3, but I wanted to make this incredibly kid friendly, so I omitted the vegetables completely (they would make it way soupy too!); then instead of raw chicken breasts on top, I cubed and sautéed a breast of chicken, then mixed all the ingredients together plus about a half a cup of cream cheese and a half a cup of mozzarella to make up for some of the missing bulk. I stirred it all half way three and st the 45 minute mark generously sprinkled cheese on top for an additional 10. Will definitely be making again !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peachiepie"
},
"reviewBody": "This was really great. easy to make. I made it with the Parmesan cheese and Italian spices. I would also add some Parmesan cheese to the chicken soup mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debi Pavelko"
},
"reviewBody": "I made a few changes, and it turned out really good! I didn't pre cook anything. I used long grain rice, frozen broccoli/cauliflower, and I added a can of mushrooms (drained). 2 cans of soup (1 can of cream of chicken, 1 can of cream of mushroom) I used 2% milk instead of water, and mixed a handful of shredded cheese into it as well. I placed the raw boneless chicken breast on top, and seasoned them. The last 10 minutes of cooking, I added French fried onions, and shredded cheese over the top. It was really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "alyssap55"
},
"reviewBody": "I dont know how a recipe that looks so simple and good can turn out so bad. I had to cook for an hour and 10 minutes. The rice was not done, there was no flavor. My husband finished his plate but told me not to make it again. I couldn't finish my plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "con"
},
"reviewBody": "Took forever to get done. The liquid would not absorb. Chicken was not done at 45 minutes. I had to raise temp. and cook another 30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cmarines3289"
},
"reviewBody": "This came out really good but I altered it I baked the chicken with seasoning and then cubed it I added 1 cup rice 2 cups chicken broth 1 an of cream of chicken and cheddar cheese. My husband and daughter love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Always a winner with my kids. Quick and easy to make. I fillet my chicken so it cooks throughly. Other than that I just follow the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystale"
},
"reviewBody": "Very good! I added more cheese then called for ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Celeste Stratos"
},
"reviewBody": "I made this with Italian Seasoning, garlic salt, pepper, and chicken seasoning. I would probably use 2 cans of cream of chicken next time. I did not use cheese and it was still delicious! Canned carrots and green beans were used as vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Parr"
},
"reviewBody": "I used thighs instead, it's what i had on hand. It termed out very well. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Mickell"
},
"reviewBody": "I added celery peppers and onions!! Always bake with veggies!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamajama"
},
"reviewBody": "My favourite comfort dish. I make it with pork chops and cream of mushroom soup too, minus the cheese. I occasionally put the chicken or pork and other ingredients minus the rice in a slow cooker for the afternoon then add Minute Rice when I get home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Szwarc"
},
"reviewBody": "very yummy recipe. I cut chicken into cubes like other reviewers recommended I thought that was a great choice. I also added a scoop of \"better than bouillon.\" it's like I Chicken bouillon Cube but better lol and I cooked it for an hour and 20 minutes, put the cheese on and put back in the oven for another 5 minutes so make sure cheese is melted. I tried uploading my picture but I'm having issues."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clara"
},
"reviewBody": "Great base for a meal. I doubled the recipe, and it wouldn't have been enough for our family of 3 of I hadn't. I also used chicken thighs (boneless, skinless) that a cut in half. I just prefer dark meat. And for the 2nd can of soup I used cheddar cheese soup rather than a 2nd can of cream of chicken. I added 1 tsp italian seasoning, 1 tsp garlic powder, 1 tsp pepper, and kept the onion powder the same. I did not use veggies in it. Next time I'll use minute rice instead of uncooked because it took an extra 20 minutes and another whole cup of water to get the rice cooked all the way. I also sprinkled paprika on the top before baking and used chihuahua cheese instead of cheddar (taste preference)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Louchart"
},
"reviewBody": "I have made this three times before and received compliments on it from guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Richard Horack"
},
"reviewBody": "Came out very bland. Needed to add some spices to kick it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melindark"
},
"reviewBody": "Used velveeta-type cheese.\nSauteed fresh vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joey Sanchez"
},
"reviewBody": "Very good , affordable to make , kids enjoyed it , quick easy recipe , Personally I love recipes like this as a single father it’s hard to always healthy meals for my kids but with recipes like this It makes eating good easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ty Ford"
},
"reviewBody": "Chicken was still raw. Needs more seasoning too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Swing"
},
"reviewBody": "Super simple, super inexpensive, filling and very good if you have picky little ones. Now, its bland, but I like comfort, cheesy stuff. so, if you need something you can throw into oven in under 5 minutes and have it come out yummy later - this is a standard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Glynn"
},
"reviewBody": "Used frozen peas and carrots as well as jasmine rice. Instead of water, used chicken stock and stirred in garlic powder with chives. Coated chicken with garlic powder, Italian herbs, and paprika, covered and baked. 3/4 through cooking time, checked rice, needed more time so I took the chicken off the top, set aside and stirred well. Cooked rice with the top on for another 15 minutes, then replaced chicken on top of rice and used provolone cheese slices to finish for another 15 minutes covered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ann"
},
"reviewBody": "My guys absolutely love this dish every time I make it. It's definitely becoming a favorite in our household. \nThe only thing I changed was that I added an extra can of cream of chicken soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly Petry"
},
"reviewBody": "I cut up the chicken in bite sized pieces, added extra veggies and cheese. I cooked covered in foil for the specified time and removed foil at the very end to crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KateinFuquay"
},
"reviewBody": "As many other reviewers did, I chopped the chicken breasts (1 1/2 lb.) into large chunks, seasoned with garlic salt, pepper, and herbes de Provence. I let the meat mixture “mingle’” while I chopped half a red pepper and 3/4 cup celery. I steamed the celery for about 5 minutes. Next, browned the chicken adding in the red pepper chunks for the last 4 minutes. In a bowl, mixed the white basmati rice with 1 C chicken broth, 1/2 C sour cream, and the soup. Next, combined everything and poured into a casserole sprayed with vegetable oil. Covered with foil and baked in a 375 degree oven for 45 minutes. Uncovered and topped with 1/3 C shaved parmigiana. Next time, I would add an additional 1/2 C broth. It was a little drier than I would like although the rice was cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marquette Brooks"
},
"reviewBody": "The family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig"
},
"reviewBody": "I made the the mexican version and it was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Bermudez"
},
"reviewBody": "Large Baking Dish:\n \nOne and a half large diced Vidalia onions, 1 teaspoon of garlic powder, half teaspoon onion powder, BIG pinch of salt &amp; pepper to taste, mix with clean hands. Add one cup of rice, one large family size Campbell’s cream of chicken soup, a large can of diced tomatoes, and a can of Ortega chiles mild or spicy to taste, and three quarters of a cup of water mixed together with spoon until well combined add chicken tenders salt and pepper each side and then place on top, half submerged in mix and put in the oven.\nCook 375 for 1 hour COVERED, then top with Mexican Cheese &amp; Broil it for 10 minutes! \n\nAmazing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "I used long grain rice instead of brown rice, otherwise I made no changes. I checked it after 45 minutes and the rice wasn't done. I added about 10 more minutes. Uncovered and added the cheese. The rice by then was mushy. The flavor was good. I will definitely try it again with brown rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkln911"
},
"reviewBody": "Everyone liked it! not much flavor though so next time instead of using water I am going to use chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carla Coffee"
},
"reviewBody": "I followed the receipt and used whole chicken breast. They took longer than 45 minutes to cook and that made the rice mushy. I would cut the chicken up like others suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belinda B."
},
"reviewBody": "So yummy and so quick to put together!! My husband loved it!! Very Feel good comfort dinner!! I mixed the ingredients all up in a bowl first to get everything soaked thoroughly. I used chicken broth instead of water and I did lightly season the chicken. I also added some pats of butter on the bottom of the baking dish and on top of the chicken. I baked it for an hour and the chicken was moist and wonderfully flavored!! Thank you for sharing this recipe with all of us!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TiffanyA"
},
"reviewBody": "My family really liked it. I listened to a lot of the reviews that said to use chicken broth instead of water and baked for 1 hour instead of 45 minutes. I also added about a cup of Campbell's cheddar soup and 1/2 tsp of garlic powder. We will definitely have this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Dillard"
},
"reviewBody": "Added a few ingredients but was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kenyatta"
},
"reviewBody": "Yes I make this again for my family they love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HARLEY HOME COOKING"
},
"reviewBody": "I used boneless chicken thighs (hate breast) and boil them in chicken broth for richer flavor and saved broth in place of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Marquez"
},
"reviewBody": "I love this simple and hearty recipe! I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rachel Marie"
},
"reviewBody": "I made this. I followed the directions to the T except I added more seasoning. When it was done was disappointed the rice was not fully cooked and even after a little extra seasoning I found it to be a bit bland. All in all I think it's a great quick meal except I know to use instant rice and more seasoning next time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "I cooked everything before hand and baked at 350 for 35 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Post"
},
"reviewBody": "If I could rate 0 I would. Baked for almost 90 minutes at 375 and the rice was still not cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pádraic"
},
"reviewBody": "Ideal dish to make if you've had a hectic day and need something good, and quick. Instead of long grain rice, I use converted. Also, I use 1 cup of chick stock and 1/3 cup of water instead of the 1 1/3 water. Finally, I add garlic powder along with the onion powder. Add 10 to 15 minutes to the cooking time, and you've got a food dinner without a lot of fuss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "zamirak"
},
"reviewBody": "The recipe is really bland once it’s done and it takes FOREVER. By the time the rice and chicken were cooked it was two hours. Tips would be to 1. Pre-season chicken. 2. Use thin chicken breast or chicken tenderloin. 3. Use cooked rice instead of uncooked rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany"
},
"reviewBody": "Prior to making this, I read through the other reviews. I used chicken broth, added a bit of organic chicken bouillon, and tossed in a bit of Italian seasoning. I also cubed the chicken breast instead of laying it on top in one piece. We used regular rice, but cooked it in the instant pot on the rice \"less\" setting, then put all ingredients in the oven, to ensure the rice cooked fully.\n\nMy advice would be to precook the veggies just slightly, as they don't cook all the way within 45 minutes. Ours were very hard still, way past \"al-dente even\". \n\nWe will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenT"
},
"reviewBody": "Great recipe! I did use a package of Broccoli &amp; cheese rice - the side dish - and a bag of the instant white rice...both uncooked. Cooked for one hour and it was super yummy! I only had cream of celery soup and that seemed to work fine. Used Montreal Chicken seasoning on top of the chicken and it turned out great! A quick I-don't-wanna-cook go to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChysMom"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "This was easy to make and quite flavorful. I didn't have 4 breasts so I cut 2 into chunks and saute them in some olive oil, salt &amp; pepper before adding to the casserole. It was still plenty of chicken for the dish. Everybody LOVED it!! Definitely will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jomathis7 @verizon.net"
},
"reviewBody": "Made as recipe specified. An easy and good basic dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linda eubanks"
},
"reviewBody": "Add more cheese seasonings and sautéed onions..Can be blah without..Lightly brown chicken and cook rice slightly before combining..Sprinkle w paprika to make pretty..Creole seasoning and onion salt makes even better..Salad on side and some type of bread..Otherwise will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OneJamminMama"
},
"reviewBody": "I used 2 cups of rice, chili powder and a 12 ounce bag of peas and carrots. baked for 45 minutes, uncovered and put cheese on top of chicken then back in oven until melted. it was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicia tumlin"
},
"reviewBody": "It's such a fast and easy meal to make and everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kiri Korycinski"
},
"reviewBody": "My mother has made this for as long as can remember and it's now become a staple for a quick weeknight meal! Pro tip: cut the chicken breasts into stew-size pieces. I generally use a scant 1 1/3 cup of water as I'd rather have the rice firm as opposed to mushy. I also prefer to use more than the recommended amount of veggies, shredded SHARP cheddar and added salt to bring out the taste of the cheese! My cook time is usually 50 minutes @ 375 on the dot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sophipa"
},
"reviewBody": "A family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasman"
},
"reviewBody": "Everyone liked it, will make again. Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "londonlinn"
},
"reviewBody": "Impromptu guests and this recipe made a winner tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "This was so yummy. Better than I anticipated"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "So easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linny"
},
"reviewBody": "I used yellow rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yasirah Kulháneková"
},
"reviewBody": "This is a recipe that I enjoy and will make when I do not want to do a lot of prep. I do not add the cheese, though. Pretty good dish that fills a few people up. Great to bring for potlucks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Creighton"
},
"reviewBody": "Love this! Added a packet of taco seasoning to it as well as an extra 1/2 cup of water so good kids love it. You can also do it in the crock pot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "toriela"
},
"reviewBody": "Simple, filling, and it tastes good. I use chicken broth instead of water, an extra can of cream of chicken soup, Italian seasoning, salt, pepper, and some garlic for flavor. I also chunk the chicken instead of putting breasts on top. I cook for an hour and a half not 45 minutes because my rice is never done in 45 minutes. With my little changes it's a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "This was awesome. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiko Lopez"
},
"reviewBody": "It's a rather quick and easy dish when I want a comfort meal. The reason I rate this so high is that as the only female in a house full of men, they always ask for more and most of ingredients are already on hand. Pop can be picky, but this dish has him going back for seconds and thirds. Throw some biscuits in the oven to bake, meal and bread can be completed in one swoop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leshayb"
},
"reviewBody": "I browned the chicken, cut it up in small pieces and cooked the rice for 10 mins before transferring to pan. I also used 2 cans of cream of chicken &amp; chicken broth instead of water. Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zannie"
},
"reviewBody": "My whole family loves this recipe!! The only thing I alter is that I add black pepper and salt. I also season the chicken itself with salt, pepper and onion powder to them before putting them on top the casserole. It is really super easy to make and taste delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracie Brown"
},
"reviewBody": "This is so easy and has become a favorite in our home. Sometines we use cream of mushroom instead of cream of chicken. We are also cheese loves so we use a little more cheese. I also put soup soup on the chicken. It is one of the most requested quick dishes in my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joann Rutherford"
},
"reviewBody": "My grandmother used to make this for us all the time. I had to refresh my memory (I'm a great grandma myself now) to be sure I remembered it. I left off the cheese (because grandma didn't use it) but will try it with the cheese next time. Yes I will continue to cook this for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "The kids didn't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wynn"
},
"reviewBody": "A winter favorite. I use cream of chicken with herbs &amp; add salt, pepper, table blend, paprika, celery &amp; chicken seasoning. &amp; a can of veg all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Margaret Russin Flahive"
},
"reviewBody": "Awful. Rice didn’t cook , chicken not browned. Nor cooked\n Fried up the chicken , &amp; made another batch of steamed jasmine rice \n Hubby was pretty exhausted after work &amp; wasn’t happy\n Don’ t use a thick chicken breast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Littleton"
},
"reviewBody": "This dish is really good and easy. The only thing I changed is I used Chicken broth instead if water. More flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Pramagioulis"
},
"reviewBody": "Easy, basic kind of bland....but kid friendly and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Morris"
},
"reviewBody": "It was amazing I did add a little more chicken broth to make it a little creamier"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "G33ch"
},
"reviewBody": "It was pretty good. I used chicken broth instead of water and garlic powder instead of onion. Will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendelyn Shoaf"
},
"reviewBody": "My granddaughter raved about how good it tastes. Just heard from my daughter &amp; she says, \"very good mom!\" We will definitely have again! I did change up the chicken bcoz I was already cooking chicken breasts in the crock pot when I found this recipe so combined the juices from that with the water &amp; I also shredded my chicken breasts &amp; added to the casserole. Oh &amp; I added half a stick of butter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne Clay"
},
"reviewBody": "I used skinless Thighs &amp; Mexican cheese....turned out really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leon Folson"
},
"reviewBody": "No changes, it was good and filling, easy to prepare. Yes I would make it agin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cillam"
},
"reviewBody": "I made it for dinner tonight and it is great did have room cook longer due to rice not cooking under chicken all the way but other than that it was delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marshafisch"
},
"reviewBody": "I will definitely be making this again!!!! I had to improvise - doubled the recipe and only had one can of mushroom soup. So, I emptied the can of mushroom soup and substituted the other can with Tostitos Con Queso Dip. (Keeping my fingers crossed!) I also took someone elses suggestion on this site and covered the dish with foil - and baked for 1 hr. 20 minutes. OH MY GOSH! This was fantastic!!!!!!!! We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ellen"
},
"reviewBody": "Winner, winner, of the newly loved chicken dish in the house. Young and old just gobbled it up. I like the ideas to try different cheeses and spices to give it a slightly new taste.\nKeep coming up with these wonderful dishes for people like me that are re-learning my way around the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erica323"
},
"reviewBody": "Was quick and easy, but very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohana40"
},
"reviewBody": "Made many times and loved it but to feed family I double the rice, use 1 can cream of celery and 1 can cream of chicken. I use 4 cups water and/or chicken broth. Yes, that's for 1 1/2 cups long grain white rice. I add 1/4 tsp garlic powder, salt pepper and 1/4 tsp paprika. I've had the most success cooking rice in 9 x 13 dish covered tightly with foil and cooking at 400 for at least 1 hour. I check at 45 minutes and may need to stir and add more broth/water. I bake seasoned chicken breasts on sheet pan for last 20-30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jef Rouner"
},
"reviewBody": "There needs to be some significant amendment to this recipe. The chicken came out severely undercooked and the rice not done at this temp and length."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla McCuan"
},
"reviewBody": "This was fast and easy, I used fresh broccoli and it was amazing. To kick it up a notch I topped it with 2 table spoons of zero calorie ranch, turkey bacon and 1/2 a cup of mozzarella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frenchie"
},
"reviewBody": "Decided to chop the chicken and mix into dish. Super yummy and a new family fav!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "womanlywoman"
},
"reviewBody": "I've made this many times and receive compliments every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetoeat"
},
"reviewBody": "I've been making this casserole for some years now and it's always great. My family and I love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessica Donnelly"
},
"reviewBody": "Sorry didn't care for this. I guess you need to add chicken broth or milk to the mix in order to give more flavor. It took way longer than 45 minutes and it was a let down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MA"
},
"reviewBody": "The rice was not cooked in time allotted. Had to leave it in for another 45 min. I used frozen which was ok but I think Fresh vegetables would have been much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debi Warner"
},
"reviewBody": "Quick and easy dish. Even my son, who normally doesn't like rice had seconds! A definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinslve"
},
"reviewBody": "Very easy...cook time was off, rice was not even close by the time the chicken was done, however the flavor was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dhardin70"
},
"reviewBody": "Whole Family Loved It!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/151689/campbells-cheesy-chicken-and-rice-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17562/dinner/",
"name": "Dinner"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/151689/campbells-cheesy-chicken-and-rice-casserole/",
"name": "Campbell&#39;s Cheesy Chicken and Rice Casserole"
}
}
]
}
}
, "about": [
]
}
]