				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Campbell&#39;s® Slow-Cooker Chicken and Dumplings"
,"datePublished": "2020-06-18T23:37:48.000-04:00"
,"dateModified": "2022-09-26T18:02:08.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Campbell's Kitchen"
,"url": "https://www.allrecipes.com/cook/campbellskitchen"
}
]
,"description": "The slow-cooker simmers chicken, potatoes, carrots, and celery in a creamy sauce made with Campbell&#39;s® Condensed Cream of Chicken Soup, to be topped with tender dumplings made easy with baking mix."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/G8P5gtCZJNw2Qclh9SgKVfMqZ4A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/980157-67ed70a70c7b4ab096ace8c9510101b8.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Campbell&#39;s® Slow-Cooker Chicken and Dumplings"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "129"
}
,"cookTime": "PT480M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "331 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "52 mg"
,"fiberContent": "4 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "994 mg"
,"sugarContent": "4 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 pounds skinless, boneless chicken breasts, cut into 1-inch pieces",
"2 medium Yukon Gold potatoes, cut into 1-inch pieces",
"2 cups whole baby carrots",
"2 stalks celery, sliced",
"2 (10.75 ounce) cans Campbell's® Condensed Cream of Chicken Soup (Regular or 98% Fat Free)",
"1 cup water",
"1 teaspoon dried thyme leaves, crushed",
"0.25 teaspoon ground black pepper",
"2 cups all-purpose baking mix",
"0.66666668653488 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place the chicken, potatoes, carrots and celery into a 6-quart slow cooker."
} ,{
"@type": "HowToStep"
,"text": "Stir the soup, water, thyme and black pepper in a small bowl. Pour the soup mixture over the chicken and vegetables."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on LOW for 7 to 8 hours* or until the chicken is cooked through."
} ,{
"@type": "HowToStep"
,"text": "Stir the baking mix and milk in a medium bowl. Spoon the batter over the chicken mixture. Turn the heat to HIGH. Tilt the lid to vent and cook for 30 minutes or until the dumplings are cooked in the center."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT500M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "its soup"
},
"reviewBody": "Too many carbs. Would leave potatoes out since there are dumplings and add peas instead. It tasted good but it’s definitely a cool weather meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Cantor Moore"
},
"reviewBody": "I have made chicken and dumplings many times with many different recipes but after having this one tonight I have to say that it is my favorite. I didn't change anything on the recipe. My Fiancee also loved it. Can't wait to have the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Dickson"
},
"reviewBody": "Love this recipe, it's one of my winter go to foods"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie "
},
"reviewBody": "Excellent recipe, quick to prepare! I cut the recipe in half for the two of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timlou"
},
"reviewBody": "I have made this four times now. It turns out excellently every time. I make extra for my"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl White"
},
"reviewBody": "I love it. I added a few alternate ingredients. Instead of canned soup- 1 T Better Than Bullion \nadded to Chicken Bone broth and herbs with same potatoes, celery and carrots. Made my own baking mix per the recipe on AllRecipes. Garnished with parsley. I love these dumplings - fluffy on the inside but so easy to make. Just drop spoonfuls on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chairjockey Charlee"
},
"reviewBody": "This is a great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose Woolley"
},
"reviewBody": "Made this today for dinner I was super excited to taste it however it needed more seasonings. My husband dislikes celery so left that out an added frozen peas 1 hour before dropping the biscuits. I will make this recipe again but I will add my own seasoning and maybe some onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Beth"
},
"reviewBody": "We loved it and it was super easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Miller"
},
"reviewBody": "Awesome! Super easy!! I added extra cream of chicken soup turned out perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nancycej"
},
"reviewBody": "The stew was very cook but I will never add the dumplings again. They wouldn’t cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin Smith"
},
"reviewBody": "Made it tonight, didn’t want to make the dumplings so instead I added in half a bag of egg noodles with about an hour left to cook. Soaked up a bunch of the extra liquid. Really easy and good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "One of my comfort food favorites! I accidentally used buttered biscuit dough so my dumplings were gooey, more than supposed. I added extra veggies and made it a bit heartier. Will try again with the right biscuit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamara Haislip"
},
"reviewBody": "Surprisingly yummy, suggest you turn over dumplings half way through cooking. We will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Great dish, not to heavy but very satisfying. Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruth Bell"
},
"reviewBody": "Next time I make it, and I will make it again, I will add peas to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I added more carrots and will leave out the potatoes next time. It was was almost as good as my mom's recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sugarfreeee"
},
"reviewBody": "I’ve been making this for years and my family loves it. I recommend cooking in crockpot on low. I’ve changed a few items here and there over the years depending on what I have on hand. Used different cream soups but prefer cream of chicken and cream of mushroom. Use chicken stock instead of water and add small amount of finely chopped yellow onion and fresh garlic. I also add more chicken, potatoes and ground black pepper. Learned that using Bisquick mix comes out the best for the dumplings. When done, Cover the top with the mix and make sure to tilt the lid a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany Horton"
},
"reviewBody": "This recipe was actually pretty good with a few changes. I would recommend adding seasoning for sure. I added salt and pepper, then garlic powder and onion powder. I spread the dumpling mixture over the top like a crust and it was perfectly cooked in 30 mins. I will for sure make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "twallsol"
},
"reviewBody": "I made this and it turned out really good. The only thing I want to note is that is took more like and hour for the dumplings to cook to my liking, where they weren't doughy. Other than that I enjoyed it and so did my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doreen Goodyear"
},
"reviewBody": "Since I did not have chicken breasts, I used 4 skinless &amp; boneless chicken thighs . I cut the recipe in half as there are only 2 of us; we found it creamy &amp; delicious. I made NO changes nor did I tweak the recipe other than to halve it and omit the dumplings as we are not dumpling fans. The chicken was tender and moist &amp; I served it with rice, vegetables &amp; a salad. It is definitely a keeper &amp; I will certainly make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Natashia Camacho"
},
"reviewBody": "Living in Asia, I had to make my own bake mix. I followed all of the amounts this recipe called for and found it just too salty and biscuit-heavy. It *could* have been my mix, but I also found the sauce to be too salty. Can't honestly say i'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Monica Miller"
},
"reviewBody": "I loved it but husband thought it was not so good. The creamy part was very soupy and the dumplings a bit dry but overall yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harpy1969"
},
"reviewBody": "My family loved this. It is a keeper. The crockpot was cleaned. I did add onions, corn and peas. It was like a wonderful pot pie. I also used boneless skinless thighs instead of the breasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tazzi"
},
"reviewBody": "made this and it was good. hubby said make it again. did leave out the thyme and put in a teaspoon of Italian seasoning. followed other reviews and cut refer biscuits in quarters and rolled dough slightly. wasn't brown when done but still good. I did make sure to put dumplings in one at a time. putting in several together causes them to lump together. also the size of the. slowcooker can make a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Henderson"
},
"reviewBody": "This is very good - I make it for my daughter for her Birthday every year as this is one of her favorite dishes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haagendoggy"
},
"reviewBody": "Great for a potluck. The only thing I did differently was add a few chopped onions. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wj879"
},
"reviewBody": "I used yellow potatoes and one can of cream of celery, one can cream of chicken, added 2/3 cup of milk to the crock pot and instead of water I used chicken flavored cooking stock. Wonderful dish very easy to prepare and very filling! My 1 year old son loved it! Will definitely make this again and thinking about adding peas and green beans next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "This was a great easy recipe for chicken &amp; Dumplings. The only changes I made was I doubled the recipe and added onions. Perfect comfort food on a cold winter's night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "calisunkissed"
},
"reviewBody": "This was great! I added an extra can of soup mix and cup of water though, this way there is more room to cook the dumplings in the broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "waterflowers"
},
"reviewBody": "The first time I made this was in the beginning of November and was already the first of a very cold winter in Minnesota. I made this a lot and It was a smashing success. My husband tore it up, his brother tore it up, the kids tore it up, and I managed to get a bowl too. I used 3 cans of cream of chicken, instead of 2. I never add water to anything, so I used a cup of chicken broth instead. I added onions, minced garlic, and sage. I didn't have any problems with the dumplings. They tend to look like they're going to form a cover, like one big solid biscuit. So after 5 minutes I used a butter knife and sliced thru them and continued to do that few times as they were cooking. Once the bottom and sides hardened they kept shape. I doubled the biscuit mix (hubby loves him some biscuits) and got 10 biscuits out of it. My house smelled so amazing all day. With the dumplings, I cooked them for 35 minutes. By then the Chicken stew was done so I turned it to \"keep warm\" and took my daughter to her Physical therapy appt and when I came back a little over and hour later, they were perfect! This became a staple over our -50 degree winter when we were all pretty cold, and this warmed us up so nicely. I will be making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misha888"
},
"reviewBody": "I add a can of Cream of Celery too, everyone in my house loves a little extra 'gravy'. I do omit the potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "brykate"
},
"reviewBody": "Recipe has potential... The dumplings were a challenge to get cooked through all the way and were fairly slimy and tasteless. As written; it was just too bland for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mray2010"
},
"reviewBody": "The chicken and veggie mixture itself was delicious. I added a few more herbs (rosemary and parsley) just to add a bit more flavor w/o any salt. I couldn't seem to get the dumplings the way I wanted. There may be too many variables with the premade baking mix. I definitely going to go for homemade next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teri Gray"
},
"reviewBody": "I tried this last night. This is the first time I ever attempted to make chicken and dumplings. It turned out really good. I used leftover turkey instead of uncooked chicken breasts and added it the last hour of cooking. I used broth instead of water. I also added 2 tsp. jalapeno juice. I was really impressed with myself. When I make it again, I will probably add more broth and make less dumplings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ky McNamara"
},
"reviewBody": "Delicious! The only change I had to make was cooking the dumplings longer. They actually took a little over and hour to cook. But the meal was easy and very flavorful. Good for a cold Sunday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Maggi"
},
"reviewBody": "I really did not like this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Schnauzermom"
},
"reviewBody": "I love this recipe only thing I did was instead of fresh Vegs. used frozen mixed and it was great also no thyme just some adobo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kentuckygirl"
},
"reviewBody": "I followed the recipe as written, except I used torn pieces of canned biscuits for the dumplings because I was running short on time. The taste of the vegetables and 'sauce' was just okay, not enough to make me excited about making this again. I really believe a big part of the problem is the amount of thyme. It was overpowering. Maybe less thyme, and adding something else. I will be looking for other chicken and dumpling recipes to try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "breezy75"
},
"reviewBody": "My family, even my picky daughters, loved this dish. I did take the advice of some of the other reviews and used refrigerated biscuit dough, cut each one in half (mine were small) and just gently rolled them up and dunked them in...it took about 1 hour to cook the dumplings, but they were heavenly, slightly browned on top and now mushy at all!! Next time, for my families taste, I'll cut way back on the carrots, dice the potatoes much smaller and add alot of mushrooms...it's kind of a great \"make it your own\" recipe! It's been added to our 'regular' dinners! I served with Jasmine Rice, but egg noodles would be great too, or even mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Too much dumplings, not enough liquid, it felt like I was eating condensed soup with tasteless dumplings on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichole Bollich"
},
"reviewBody": "Amazing the whole family really enjoyed this... However husband and I wanted to add more flavor so we used a can of Campbell's Cream Of Mushroom Soup and one can of Chicken Cream Soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linniepoo48"
},
"reviewBody": "I have made this several times and we love it!!! I do add fresh parsley and leeks for added flavor. I have also made the dumplings herb dumplings by adding fresh rosemary and tyme"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "This was easy enough to put together, and the slow cooker made it effortless to have dinner ready on a busy day. But it wasn't anything my husband and I really enjoyed. I probably won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "Family loved this. Didn't have stalks of celery so I substituted one of the cans of Cream of Chicken with a can of Cream of Celery. Husband didn't care for the dumplings and want me to add more potatoes. What can I say? He is a meat and potato guy! I will make this one again. Even got my teen-age grandaughter to eat this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpyle"
},
"reviewBody": "I thought this was very good, I added salt, garlic &amp; onion powders along with the thyme and pepper and it was very flavorful. I put the dumplings in way early after reading all the reviews about them taking over an hour to cook, but they were done perfectly in 30 minutes. The only thing I can think would make a difference is turning the lid of the slow cooker slightly to vent so they don't get soggy from the moisture. I wasn't going to vent the lid, thinking it would just add to the cooking time, but went ahead and did it just to see and it worked perfectly. I vented it very little, just barely turned the lid so there was a little gap. This recipe will definitely be in my dinner rotation now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashelteredtown"
},
"reviewBody": "This was delicious. I first followed a recipe on here for slow baked whole chicken and used the left overs in this.\n\nMy only issue was with the potatoes, I cut them smaller than suggested and still they took an additional hour to two hours on HIGH i order to get them even edible. I suggest cutting them much smaller to ensure everything is cooked through.\n\nI used cooked chicken left overs from my roast chicken and added them about an hour before I turned the cooker off, just enough to warm the chicken.\n\nI skipped the dumplings because the recipe is very filling on it's own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katie Urmann"
},
"reviewBody": "The dumplings did not work out for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theryvet"
},
"reviewBody": "This is a very good recipe.Set it and forget it. Everything is used was frozen. Frozen onions, mixed vegetables, even the chicken was somewhat frozen. The potatoes were not frozen. I dropped the dumping in when I got home and dinner was done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Layton"
},
"reviewBody": "Very good chicken and dumplings, and easy. I added salt and more pepper, other than that its good just the way it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gruszyja"
},
"reviewBody": "This was delicious, I used cream of mushroom and added mushrooms and chicken thighs instead of breasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shotwench"
},
"reviewBody": "We love this! I usually don't have celery around but I use one can of Cream of Chicken and one can of Cream of Celery and it still turns out great! It's so easy to throw together and let cook during the day. Great recipe to keep on file!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hthomas"
},
"reviewBody": "My family LOVED this recipe! I agree that it was drier (not as soupy) as I would have loved and my cooker was not big enough to hold everything. So, when the veggies and meat were finished, I pulled them out and added a cup of water (would add at least 2 cups next time) to the remaining liquid and then put in my dumplings. The kids couldn't wait to devour the leftovers in their lunch boxes the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi"
},
"reviewBody": "I will make this again because my husband thinks it's great. BUT I will decrease drastically the amount of thyme. I couldn't eat it - just too strong. AND I substituted canned biscuits for the baking mix. I used 6 or 7, and quartered each one, forming them into little balls. I let them cook 'til they were a golden color, and they taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DADAY"
},
"reviewBody": "I'm rating this with four stars since it was so incredibly easy and very good. I love to cook but after a long day at work it was so nice to have this waiting on us! I pretty much made this as directed but did add a can of peas (at the very end), a chicken boullion cube and quite a bit of garlic powder. The thyme was not overpowering to me at all. My only reason for not rating this with 5 stars is the trouble with the dumplings. I was afraid to try to cook them in the slow cooker and I did not want to wait an extra 30 to 40 minutes for them to cook so I took someone's advice and made them on this side with chicken broth. They just weren't that good however the chicken mixture is ok by itself. I will try the slow cooker next time for the dumplings... I will make this again due to the very easy preparation and really good taste. Just have to figure out the dumpling part!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Heffelfinger"
},
"reviewBody": "Since some said it was bland, I added some poultry seasoning as it cooked. I also cooked it on high all day and had no problem with the dumplings cooking in about 45 minutes. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JaneyC"
},
"reviewBody": "Only gave it a 4 because I didn't make the dumplings....cause we had cheese buns from the bakery....but it was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thedailygourmet"
},
"reviewBody": "This lacks flavour like crazy. It's simple enough to fix tho - thus the 5 star rating! Add 1 tsp minced garlic and 1/2 tsp lemon herb seasoning. Instead of using the carrots &amp; celery use a mixed veggie blend (frozen) and add about 1 hour before serving. Use a can of Pillsbury biscuits instead of bisquick dumplings...it still will turn out right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Hutchinson"
},
"reviewBody": "I loved the home pot pie flavor. I cooked on high for 2 1/2 hours then added the dumplings and finished cooking for 1 1/2 hours with the lid vented. I also seasoned the chicken a little with webers beer can chicken seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny_Mac"
},
"reviewBody": "Sounds divine! Seems to me, however, that if two steps are swapped, it would save some time and clean-up if the soup, water, and seasonings are mixed in the slow-cooker crock first, then add the chicken and vegetables, then proceed as written. I also like the idea of simmering the dumplings in a saucepan of chicken stock, then adding to the plated dish. Also, the chicken flavour can be boosted by using chicken stock in lieu of the water called for. \n\nLooking forward to making this for my sweetie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chefdaddy"
},
"reviewBody": "I have read several other reviews and some posted some unhappy reviews.I would tweak this as I make it.I would add frozen peas and corn.I would use chicken broth instead of water for added flavor.I would leave out the celery but add a large diced onion instead.As far as the dumplings go,one reviewer had a horrible mess with hers and trashed her whole dish.She said the dumplings made her dish too starchy.Maybe so.What I would do is this:in a separate pot,get two or three cans of chicken broth boiling and add your dumpling dough to that and cook them until done.Then add the dumplings on top of each bowl of mixture served.This will prevent starchiness or having to increase cooking time in crock pot just to get the dumplings completely cooked without possibly scorching the mixture in the crock pot.it never hurts to cook some items separately and then bring them together at serving time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kellya87"
},
"reviewBody": "This was ok--my husband wasn't impressed. Won't make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is very similar to a recipe that my mother has made for years, but with some alterations. No potatoes (the dumplings provide enough carbs!), and thighs instead of breasts, which stand up better to long cooking. Instead of the baking mix dumplings, she used a can of biscuits, each cut into quarters, flattened, and stirred in during the last 30 minutes of cooking. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gregory N Melanie Maerki"
},
"reviewBody": "Awesome recipe, I've made it 3 times and its gets better every time. I used refridgerated biscuits quartered, cooked on high for the last hour and it turned out great. Be careful not to stir it much after you put the biscuits in though, I did the first time I made it and it came out more like a chicken pot pit instead of dumplings. :-) But still tasted wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GETWET"
},
"reviewBody": "meh!, although it was very easy, it was bland and it almost burnt in my slow cooker. I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phoebe"
},
"reviewBody": "Added a huge chopped onion and alittle bit of poultry spice. Was running short of time so finished of the dumplings in the oven. My Mother told me to stop making her such good things, lol!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erik Hoover"
},
"reviewBody": "I did not care for this one. My family loved it, and it was quick and simple....but it just didn't do the trick for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sugarvargas"
},
"reviewBody": "This lacked favor and wasn't good at all. Sadly it was a waste of food and I took out of my collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kittylover25"
},
"reviewBody": "So yummy. No problem with the dumplings. The only thing is instead of 30 minutes for dumplings is it takes an hour and they are perfectly cooked through!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tapa"
},
"reviewBody": "Not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking4Gavin"
},
"reviewBody": "This was excellent. I ended up flipping the dumplings part way through cooking to speed the process. I will make this again for sure but probably tone down the Thyme which was too strong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kizkizibt"
},
"reviewBody": "very good, added onion and savory garlic philly creamers, subbed 1 can cream chicken with herbs 1 can cream chicken and mushroom, cooked the dumplings for 50 min came out just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belum"
},
"reviewBody": "This.... was..... AWESOME!!!!! I read the reviews before making it. I used chicken stock instead of plain water. I also added a can of peas for colour. I used Herbes Fines in place of the thyme, since I didn't have thyme. It was amazingly delicious. I will DEFINITELY be making this again and again. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PetieMouse"
},
"reviewBody": "My Husband said he has never had better chicken and dumplings this was the easiest I have ever made thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chelleby13"
},
"reviewBody": "This was not that good to me. Not a fan of the \"dumplings\". I followed the recipe and dropped the baking mix dough into the crock pot, vented the lid and continued baking on high for half hour. The dumplings turned to runny dough while eating and were kinda gross I thought. As for the rest of it...I really didn't think it was that great...just ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dodlen"
},
"reviewBody": "used cream of aspra soup..cut chick breast in half excellent......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Best I've had, even though I forgot to add the celery. I used 1 can Cream of Chicken and 1 can Cream of Celery soup and added 1 chicken bouillon cube. Also cut back on the thyme to about 1/4 teaspoon and upped the black pepper to 1 teaspoon. I used refrigerated canned biscuits for the dumplings, simply because I ran out of time. Very flavorful and so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busybaker"
},
"reviewBody": "Thanks to another reviewer I made spaetzle instead of the dumplings and served on the side. There were no leftovers. Added peas, garlic powder and onion flakes to the recipe since some said it was bland, also substituted poultry seasoning for thyme since i didn't have any. Had to thicken the broth at the end with cornstarch. Awesome and easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tperry1234"
},
"reviewBody": "Okay recipe. I attempted to spread a crust of dumpling batter on the top since one reviewer wrote that worked well for her, but my batter was too sticky. I, instead, placed very small spoonfuls all on the top to be like a crust on top. They got mostly cooked, but by the time I stirred it around to serve, almost all my liquid soaked up. The dumpling taste predominated. I suggest making half the amount of dumpling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris From Kent, WA"
},
"reviewBody": "Very good and easy to make. I added one large chopped onion and used Poultry Seasoning instead of thyme. It was pretty thin so next time I'll put a little Wondra in at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Beckie"
},
"reviewBody": "I wasn't too impressed with this one either. The dumplings would not cook for me. I spent about an hour and finally threw them out. The stew was ok but nothing I'd try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "This had no flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I added 2 tbsp of flour to sauce before putting the dumplings in to cook. I also sprinkled some garlic salt and stirred the chicken. I think next time i will add some frozen peas as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrideToBe"
},
"reviewBody": "We love this recipe!! It is easy and smells so delicious... and tastes even better!! Instead of water, I add chicken broth and a little white wine and it comes out perfect. This is comfort food at it's best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Huntington mom"
},
"reviewBody": "Just made this recipe....I sauteed carrots, celery and one diced up onion in a little olive oil and then followed the recipe exactly...I also added some chicken base while it was slow cooking to give it some more chicken flavor...enjoyed by the whole family....will be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tonia Seymour"
},
"reviewBody": "I thought this was horrible! I made the dumplings smaller because people were saying it took longer to cook them; but they were still raw in the center after an hour. I scooped them out but they made the rest of the stew super starchy it wasn't even edible. I ended up throwing the whole thing away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WatneFam"
},
"reviewBody": "Ok, but not exceptional"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chitowncook"
},
"reviewBody": "Like other reviewers suggested, I added one chicken bouillon cube and peas, as well as mushrooms. The dumplings take at least 45 minutes--even if you spread them out. Tasty though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nealsmom"
},
"reviewBody": "The family loved it - I added peas and doubled the recipe so we would have leftovers and by the time they were done I was glad that I did - only had a small container full left. I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chairman James"
},
"reviewBody": "This is better than a lot of slow-cooker chicken &amp; dumplings recipes I've tried, but it still doesn't capture the taste I remember growing up with. This might be a good start, 'though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kajjames"
},
"reviewBody": "I made this for my boyfriend the other night, he said it was so good he almost ate the whole pot of it all by himself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Mastropiero"
},
"reviewBody": "Outrageous. This is the best chicken and dumpling recipe on here, in my opinion. I personally don't care for this type of dumpling, however, so I use spaetzles instead. You can find the recipe on here. Just a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HollyN82"
},
"reviewBody": "So easy and so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missjey"
},
"reviewBody": "Great comfort food. I didn't put as much thyme as it called for and I added some parsley and lots of pepper. It took an hour for the bread mix to cook. I did as other reviewers suggested and just put it all across the top instead of dumplings. I also put a chicken bouillon cube in the water to add flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SNACKATERIA"
},
"reviewBody": "This was very easy to put together. I used whole frozen breast and before I added the dumplings I sliced the chicken into pieces. The dumplings took an hour and probably could have gone a little longer but it smelled so great we had to eat. I would cut back the thyme just a bit but it also needs a little something, it was a tad bland. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Valure"
},
"reviewBody": "This is a decent stew. I've had some trouble getting the dumplings to cook through, but the second time I made it I spread it on top like a crust instead of balls for dumplings, and that did the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cora M"
},
"reviewBody": "Way to much tyme in the recipe and the dumplings were not that good. Seemed like there was not enough juice could of used more water or soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MsEmilyAnn"
},
"reviewBody": "Tried this and followed the recipe exactly. I was very disappointed, it was very bland. I was unable to eat much of it, and ate something else for dinner."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/177708/campbells-slow-cooker-chicken-and-dumplings/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
"name": "Chicken Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14723/soups-stews-and-chili/soup/chicken-soup/chicken-and-dumplings/",
"name": "Chicken and Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/177708/campbells-slow-cooker-chicken-and-dumplings/",
"name": "Campbell&#39;s® Slow-Cooker Chicken and Dumplings"
}
}
]
}
}
, "about": [
]
}
]