				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Campfire Foil Packs"
,"datePublished": "2006-05-21T15:37:39.000-04:00"
,"dateModified": "2022-08-10T11:18:33.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Natural Chef Michelle"
,"url": "https://www.allrecipes.com/cook/1907836"
}
]
,"description": "For this campfire meal in foil, chicken, potatoes, mushrooms, and peppers are wrapped in foil and cooked over the coals, making cleanup a snap."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4jVIXsGY7z2oWRxddkmk44lNwaM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4541441-campfire-foil-packs-Allrecipes-Magazine-4x3-1-42878fb07e2e4d8fb516db6830c10fb6.jpg",
"height": 750,
"width": 1000
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Campfire Foil Packs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "95"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "437 kcal"
,"carbohydrateContent": "44 g"
,"cholesterolContent": "66 mg"
,"fiberContent": "7 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "92 mg"
,"sugarContent": "7 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pound skinless, boneless chicken breast meat - cubed",
"2 onions, diced",
"1 (8 ounce) package sliced fresh mushrooms",
"1 yellow bell pepper, seeded and sliced into strips",
"1 red bell pepper, seeded and sliced into strips",
"4 cloves garlic, sliced",
"4 small potatoes, cubed",
"0.25 cup olive oil",
"1 lemon, juiced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Build a campfire and allow the fire to burn until it has accumulated a bed of coals. Rake the coals into a flat bed on one side of the fire."
} ,{
"@type": "HowToStep"
,"text": "Combine chicken, onion, mushrooms, peppers, garlic, and potatoes in a large bowl or a large resealable plastic bag. Pour in olive oil and lemon juice and toss to coat."
} ,{
"@type": "HowToStep"
,"text": "Evenly divide the mixture between 4 large sheets of aluminum foil. Top each with another sheet of foil and roll up the edges tightly. Double wrap each packet with another sheet of foil."
} ,{
"@type": "HowToStep"
,"text": "Cook over the preheated coals until chicken is no longer pink in the center and the juices run clear, about 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hank Richards"
},
"reviewBody": "cooking time is about right when you’re cooking it on hot coals. You absolutely must flip it over halfway through though. everything on the bottom layer (which was about 75% of my meal) was charred and completely inedible. had i flipped it, it would have come out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kikikim"
},
"reviewBody": "As written this recipe was very bland on the grill for my hubs and me tastes buds. I had some frozen veggies I needed to use up so tried this recipe a 2and time this time using the oven. My meat of choice was cubed chicken breasts with added lemon lemon pepper seasoning, garlic salt and 1 clove of chopped garlic with real bacon bits on top. I used red,yellow,green peppers with green beans,( frozen) and made and covered a sheet pan in foil. Baked 45 minutes in a 375 degree oven and came out much better this time with the added seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen P"
},
"reviewBody": "We left out the mushrooms since we aren’t fans of them and no lemon as we were unexpectedly didn’t have one. \nGood and everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "We have often made these \"Tin Foil Dinners\" using a variety of meats, vegetables, herbs, seasonings and even fruit (pineapple with chicken, apples with sausage, peaches with pork!) at cookouts for youth groups. This dinner is easy to prepare, easy to clean up and easy to tailor to everyone's food sensitivities and fussy choices.\n\nWhat we have discovered over the years is by adding a layer of wet newspaper (just soaked in water) between the layers of tin foil, the food package steams, is less likely to burn and takes less time. \n\nWrap all food with large piece of tin foil (do not wrap tightly; the package needs room to expand), sealing all seams well - wrap completely in wet newspaper - then again in tin foil.\n\nWe do pre-cook the meat to avoid any possible undercooked food danger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I've made this plenty of times. Husband loves it. I like cooking mine with sweet potatoes as well as white potatoes. Instead of oil I use Italian dressing. More flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev"
},
"reviewBody": "These are so amazingly delicious. I used to make these when camping with family but live alone now and still like to make these. They are very easy to bake or take out to the grill. I can't believe all those who complained about them being bland. Use you imagination! Season them to your liking. It's your own fault they are not tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leta Betor"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Batten Monce"
},
"reviewBody": "Oh my goodness. Yes my boys and I did the campfire meals on a campfire, however it's summer and extremely hot. So PROUD I am able to cook in the oven. LOVE IT??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith N"
},
"reviewBody": "Great recipe for camping meals. We made this with whole chicken breasts. You can be very flexible with seasonings, veggies and even meats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RebeccaO"
},
"reviewBody": "Great dish. It could use more seasoning. I adapted this to indoors by putting it in a baking dish and covering in foil. I added more veggies and minimized the meat content. I added salt, pepper, basil, rosemary, sage, paprika, cayenne, and a tiny bit of chicken broth. I still think I went a little light on the seasoning so we all drizzled balsamic vinegar over the finished product, and my husband used some HP sauce. But it's certainly a keeper as it is easy to prep the night before and when you get home you can just pop it in the oven! I baked it at 375 deg F for an hour. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Izzys Mommy"
},
"reviewBody": "My daughter loves this. We don't follow the recipe to a tee though. We make taco packs, hamburger packs and/or my favorite - pizza packs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Family LOVE LOVE LOVED this. I used steak-cooked in oven for 1hr20min on 380. Spray your foil before putting everything on it so that nothing sticks. and the 2 pats of butter made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Cooked this recipe last night for the first time and it won't be the last! I removed the lemon juice, peppers, and mushrooms....but added carrots....and a little red pepper flakes...it was awesome kids loved it! Thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brandon Yates"
},
"reviewBody": "Definitely needed more seasonings. I added some salt, pepper, basil &amp; adobo. The cooking time was perfect &amp; everything came out great. I included carrots &amp; celery in mind as well. The celery really added some good flavor. I'd definitely make sure again for our future camping trips!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "I love these but adjust the veggies for personal taste. I leave out mushrooms and lemon juice, and I only use green peppers rather than yellow and red. I add salt/pepper, and use 2 TBS butter in each packet instead of the olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilith"
},
"reviewBody": "I put in steak instead of chicken and instead of peppers I used carrots. Threw them on the grate above the fire and after 20 minutes they were done. The beef juice made a gravy that was really good. Delicious and I'll definitely make these again! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reesie"
},
"reviewBody": "This was so delicious... we made it in a smoker it took about 25min and came out Perfect... Prepared it directly like the recipe. family love it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shelia s "
},
"reviewBody": "Pretty good, added green beans to it and boiled my potatoes and carrots before putting them in the foil, nice easy recipe, will try with other meats and veggies, does stick to the foil though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afairgrieve"
},
"reviewBody": "Made some this weekend and they were so good! We were camping a few nights so we brought the veggies in 1 bag and brought frozen chicken tenderlions in another. Just tossed chicken in the veggie/sauce bag at lunchtime and foiled them at dinner time!! Thanks for this new camping favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Harty"
},
"reviewBody": "I have not tried this exact recipe but, I make these with my Girl Scout Troop and we love them. Each girl can make her's the way she wants and it is always a hit. They do not all like the same things."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judi"
},
"reviewBody": "This is just like one of the recipes I recreated at home from my years of summer camp in the '60s. It's a great go-to when you have a house full of people or disjointed schedules.\n\nA few tricks. We often have veggie trays with dinner and make foil packs, using the leftovers, the next night. If it don't have leftovers to use, I cut up a variety of vegetables ahead of time and put them in individual plastic bags. Everyone makes their own.\nWe just double heavy duty foil and do it envelope style.\nPotatoes cook best if they're on the bottom of the pack.\nSeason to your individual tastes. Salt, pepper, taco seasoning, chili powder, chicken seasoning . . . \nUse chicken, ground pork, beef or chicken/turkey - whatever you like - but crumble it at the top of your pile and place a small ice cube on top.\nYou can add ketchup, steak sauce, taco or enchilada sauce to the top before sealing and .cooking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mompeggy"
},
"reviewBody": "Could have used a little less onion and garlic and more veggies I think but we all enjoyed it and I was easy to warm up over the fire"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dandri"
},
"reviewBody": "This is such an easy and fun camping meal. I like to prepare a selection of cut-up meats and veggies and bring a couple of different sauces, like teriyaki and BBQ. You can set it out buffet-style and let people make their own creations. Use plastic forks and you have a delicious dinner with ZERO dishes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vivian Evans"
},
"reviewBody": "I make something similar but I put about 3 or 4 ice cubes on top of the mixture before sealing up the packages this reduces the chances of anything burning. The ice cubes melt and creates steam which also cooks the ingredients. As for making it more spicy add seasoning salt or any other spices. I must add I have never added chicken or any other meat to the foil method of cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie Heim"
},
"reviewBody": "This was ok, it definitely needs seasoning as it is really bland. Maybe some fresh herbs or some seasoning blends. Will try again but next time seasoned up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl's Cooking Now!"
},
"reviewBody": "This is so easy and delicious! You can add.substitute any veggie you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anissa McCoy LaVelle"
},
"reviewBody": "Ok, I did something wrong. I tried this this week while on vacation and it burnt so bad you couldn't get the foil open. I put it \"in the coals\" like it said and checked it after 20 min. and it was awful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taranoelle"
},
"reviewBody": "Love this! I learned about this because Cracker Barrel has it as a special its called Campire Chicken..so i had to search for it! But the chicken was so tender and juicy and everything had great flavor and clean up was nice and easy! Also i made it in the oven at 350 for 45 min"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luv2bake2010"
},
"reviewBody": "I have made these many times, every time we go camping! I do have changes though that make it really good. I use hamburger instead of chicken. I also use potatoes, green peppers and onions. Lastly, I do not use oil, it makes the food really oily, I put a little butter and 2 ice cubs in the foil, this keeps everything really moist. I will put some of each in nonstick foil, throw in fire...and you have a fantastic dinner. Add some corn on the cob and you have a mighty fine dinner with almost no cleanup! Try it on the grill too, just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "laurie"
},
"reviewBody": "We use chicken thighs, which protects the chicken and gives a great flavor. we also add a drop water and a pat of butter, leave a little air for expansion when wrapping, and turn over on the coals when you start to smell the food cooking. we also use everglades seqsoning. it is really good and a standard meal for our camp trips"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmf109"
},
"reviewBody": "This came out great! I kept it in the coals for a good 40 minutes, resulting in some of the food getting blackened, which actually improved the taste. I also ended up using about 5 sheets of foil, 2 sheets just wasn't stronge enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashleyellen_08"
},
"reviewBody": "My grandma taught me to make this when I was in middle school. I've always just cooked it in the oven. Since I have such a sweet tooth i use Dorthy Lynch dressing instead of the oil and lemon juice. I also use baby carrots(sliced in half if they are very thick) instead of the mushrooms. My grandma would also make them with a hamburger and some ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HOFFER5353"
},
"reviewBody": "delicious flavor but found the potatoes were a bit soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Janet Cormier"
},
"reviewBody": "needed more flavoe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Holt"
},
"reviewBody": "I altered this recipe with lemon &amp; pepper and cooked it in my oven @ 500 degrees for 50 minutes to glorious results. I will use it again &amp; highly recommend this version of a timeless classic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharipassey"
},
"reviewBody": "This recipe is Awesome! I have seriously been waiting all winter to go camping again to make it. The only thing we changed and this was just on our vegetable preference, we added Zucchini, more mushrooms and 2 yellow bell peppers instead of the one red one. I'm getting hungry just thinking about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrspender"
},
"reviewBody": "I left out the peppers because no one here likes them but my family loved this one so much we don't wait till we're camping to make it. I do it right on the BBQ grill!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gswoody"
},
"reviewBody": "Kind of bland, definitely better with salt and a little pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ccool18"
},
"reviewBody": "This recipe did not have enough flavor. Very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scarlett"
},
"reviewBody": "Good! I changed it a bit as it was too cold for outdoor cooking. Baked in 400 degree oven for about an hour. Had to use minced onion as I was out of fresh. I felt it a bit bland and was in need of salt. Once that was added, it tasted pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jpo"
},
"reviewBody": "Loved it! So easy to make when you are camping and also for entertaining a large crowd. You can tweek it any way you want and it will be awesome no matter what."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "I made these &amp; my family thought it was so bland &amp; boring. Definitely needs to be spiced up a bit - even just salt &amp; pepper would help"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaina2"
},
"reviewBody": "Awesome!! I added green beans, oregano &amp; red pepper flakes! I will definitely be making this one again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "autumny"
},
"reviewBody": "Perfect camping food. I cut up the veggies ahead of time, and take a bag of frozen boneless/skinless chicken (usually thighs). Everyone puts what they want, along with fresh rosemary and slices of lemons. The bag of frozen chicken is no muss-no fuss in the ice chest, and then I don't worry so much about thawed chicken getting too warm if the ice is melting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nbever72"
},
"reviewBody": "We do these on the grill a couple times a week. Instead of the olive oil, I use either Light Balsamic Vinegrette or a Mediterrean Vinegrette. I also marinate the veggies and meat in the dressing before grilling. The vinegrette breaks down the meat and makes it tender and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "It's a great idea, but we found them very bland. I'll definitely try again using different veggies and seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Siqueiros Stoutner"
},
"reviewBody": "I make these everytime I go camping. Just put everything together, throw it in a cooler and cook when we start the fire. Great and healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ricksmom"
},
"reviewBody": "This has always been one of my favorite camping and easy dinner recipes. I change it around depending on what I have on hand. It's great with fish, too. We use orange roughy. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Witten"
},
"reviewBody": "These were great! We prepared them at home before we left and threw them in the cooler. It was nice that we could customize what each person wanted in their foil pack. We cooked them on the campfire while we finished setting up camp. They were a great time saver for the first night of camping!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMLVS2COOK"
},
"reviewBody": "Very good! I added some extra veggies, like green beans, carrots, ect. My husband hates green beans, so let me tell you, I was absolutely shocked when I saw him eat one and say he thought it was really good! So any recipe that does something like that for my husband deserves a five star rating! Instead of smaller sheets of aluminium foil, find the extra long, heavy duty foil. We only used two long sheets of it. Very, very good recipe that we will use again when we go camping (or just over the hot coals of our grill)! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelee"
},
"reviewBody": "I cooked it on the grill and it came out really nice. Very flavorful and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Jim Salyer"
},
"reviewBody": "The kids thought this was such an adventure while we were camping, It was a easy way to start off our trip. With 6 kids with us every one could create their pack the way they liked it. I pre-cut the veggies,that made it real fast when we got to camp. The best part was everyone put it on a paper plate so no dishes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clairvis"
},
"reviewBody": "These were very good, it just took me a couple tries to figure out the right amount of time to put it in the fire. My first attempt (trying the suggested cook time) came out completely burnt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Haines"
},
"reviewBody": "I made this over the weekend for my husband while we were camping in northern Arizona. I cut the recipe in 1/2 because it was only 2 of us. He loved it. Next time I'll use the whole recipe because he said their wasn't enough. One thing I will do, is remember to turn the packed over every 10 minutes so it won't burn. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PUBEENE"
},
"reviewBody": "I made this for a group of 10 while camping. It was nice to be able to make it in advance - I added the potatoes along with everything else, but didn't add the mushrooms until before putting on the grill because I didn't want to chance having them turn brown. Since I had 12 packets, this was kind of a lot of work, and I would really prefer not to have to do it that way again. Next time I may chance having the shrooms turn dark! This was very good, and everyone aged 10 through 66 liked it very much , but personally, I thought it was a little bland. Make sure to add some kind of seasoning. I added salt, pepper and Montreal Chicken Seasoning, but I think it could have used even more of something. Very good, but just needs a little \"oomph\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "handbanana"
},
"reviewBody": "Didn't care for the lemon juice. I've been making this for many years and thought I would actually follow a recipe this time. It was edible but the lemon flavor ruined the overall dish. Might just be our personal taste and not the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STROAST"
},
"reviewBody": "I do this recipe at home ALL the time :) Instead of peppers I usually do zucchini and a little of Emeril's BAM spice! Awesome!! I have even used couscous instead of potatoes when I do it on the stove!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WanderingEx"
},
"reviewBody": "A nice &amp; easy camping recipe. I added a little salt and pepper (or seasoning salt) and served with a tasty bottled sauce. On our grill, it only took 25-30 min to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddie's mom"
},
"reviewBody": "I made these for a camping trip but i used cube steak instead of chicken. Delicious! We put them right on the Q grill and kept flipping them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gundo13"
},
"reviewBody": "Very good and very easy to pre-prepare for any trip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zucchini"
},
"reviewBody": "I made this for my boyfriend and he ate three of the four! He loved it! I made it in the oven at 375 degrees for about an hour. I also added mushrooms and left out the carrots. I'll have to double it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Ryskamp Wightman"
},
"reviewBody": "Yum! These were so good, and so easy. I would definitely make them again. Cleanup was a breeze with this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andreaahvcom"
},
"reviewBody": "GREAT... We call it HOBO STEW... and we use 2 tbl spoons of butter, stew meat, potatoes, carrots and oins...just throw it on the fire and 20 min there done... then we add sour cream and hot sause... YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie A."
},
"reviewBody": "This meal was easy to throw together and was the perfect meal after a day of boating and fun in the sun! Full of flavor too. Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynthia Gaub"
},
"reviewBody": "we always masde this when I went camping as a kid...but we would use hamburger, onions and carrots (subbing for the chicken and peppers) and keeping all the rest of the recipie. LOVED it every time... I have made it at home in the oven too, never as good as on the campfire though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SELEA"
},
"reviewBody": "Since campfires are not an option for us, I either grill these packets, or bake them in my oven. My only change is to leave the chicken cubes out of the packets--but not out of our meal. If grilling, I cook the chicken on skewers, and if baking, I stir-fry the chicken until lightly browned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alison"
},
"reviewBody": "very good. I've never really like bell pepers, so I didn't do the yellow bell peppers, but it was still really good. yeah, don't cut back on the olive oil or lemon juice. gives you results that aren't really that edible. Thank You!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOSTHERMIND"
},
"reviewBody": "We did these on the grill at home, everyone loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aussiemum"
},
"reviewBody": "We used frozen hashbrowns and they were great! We did as suggested and just left them in the cooler, it was a nice change from the usual camping food...thanks for sharing!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/106584/campfire-foil-packs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
"name": "Vegetables"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/106584/campfire-foil-packs/",
"name": "Campfire Foil Packs"
}
}
]
}
}
, "about": [
]
}
]