				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Candied Pecans"
,"datePublished": "2020-06-18T23:52:43.000-04:00"
,"dateModified": "2022-08-05T16:43:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Alix"
,"url": "https://www.allrecipes.com/cook/2386348"
}
]
,"description": "Candied pecans are an easy, make-at-home holiday gift. Baked in a sweet cinnamon coating, these tasty pecans are great to have on hand for snacking."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/tXDXVij6yQchB02HlLugCFe1M84=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/230557-candied-pecans-daniellek-1x1-1-b0b3381c3e884c85833c521e47ce6c85.png",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4412134844001",
"description": "Delectable sweet, salty, and crunchy roasted pecans.",
"duration": "PT1M38S",
"name": "Candied Pecans",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/01/29/230557-candied-pecans-daniellek-3x2-1.png",
"uploadDate": "2021-03-10T10:35:15.160-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Candied Pecans"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "836"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "342 kcal"
,"carbohydrateContent": "13 g"
,"fiberContent": "5 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "54 mg"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.333 cup white sugar, or more to taste",
"1 teaspoon ground cinnamon",
"0.25 teaspoon salt, or more to taste",
"1 large egg white",
"1 tablespoon water",
"1 pound pecan halves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 250 degrees F (120 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix sugar, cinnamon, and salt together in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Whisk egg white and water together in a large bowl until frothy. Toss pecans in the egg white mixture to coat. Slowly pour in sugar mixture and stir until pecans are evenly coated. Spread onto a baking sheet."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/tXDXVij6yQchB02HlLugCFe1M84=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/230557-candied-pecans-daniellek-1x1-1-b0b3381c3e884c85833c521e47ce6c85.png"
}
]
,"text": "Bake in the preheated oven for 10 minutes. Stir pecans and rearrange into a single layer. Continue to cook, stirring every 10 to 15 minutes, until pecans are evenly browned, another 30 to 50 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loralynn"
},
"reviewBody": "I used the air fryer setting on my BREVILLE. Turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the original recipe instead of the “newer” one. The only thing I changed was using pure vanilla extract in place of the water. I will be making more of these just to have around the house for everyone to munch on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ASexy43babe"
},
"reviewBody": "Ohh my... these are addictive 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa M."
},
"reviewBody": "After my sister in law gave us a big Ziploc bag full of shelled pecan halves (from their tree's in Wakefield, Virginia) at Christmas, I knew I had to make a recipe like this one. My hubby and have always purchased these kind of pecans when we go to a flea market, and when I saw how easy this recipe is, I knew it'd be perfect. I didn't really know what the weight was of the Ziploc bag, but I followed the same ingredients, and instructions, and they're absolutely freaking delicious! They're toasted, salty and sweet, with that tiny hint of cinnamon! I wouldn't change a thing, and I plan on making this in the future. Thanks for sharing this! 😁"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Geri Leigh"
},
"reviewBody": "Altered the recipe after I read the reviews and went with the multiple suggestions to increase the sugar and use a brown sugar/white sugar blend as well as using vanilla extract. Such a delicious treat. I am happy with my results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I should have read the reviews. I hate spending time and money on recipes that produce a bland result. And this recipe did just that. Don't know who recommended the reduced the sugar amount but it didn't work, at least to my taste. My sister-in-law made these as Christmas gifts and I decided to do the same since her were so good. Won't be giving these as gifts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I believe this is the recipe I used back when originally making these. Lots others online are more of a liquid candy base. I think it should be the original recipe of 1C sugar though. I used the reduced amount this time and it didn’t have the same coating like it did previous times. Still, this is a phenomenal base recipe. I like to do variations like substituting some light brown sugar and a little cayenne pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "I agree with other reviewers, this recipe definitely needs more sugar. Next time I will go with 1 cup sugar. I lined my cookie sheet with foil rather than placing the pecans directly on the surface. Easier clean-up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maria King Santopoalo"
},
"reviewBody": "I wish I would’ve read more reviews and made the original recipe instead of the current one. I never made these before and was so excited. My health not hubby even said that they needed more sugar, and I totally agree. I think you should go back to the original version and list the updated recipe as. “Lite Candied Pecans”."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "New \"Updated\" recipe almost ruined my Christmas. Why ruin a good thing?! OLD RECIPE IS 5 STARS!!! I HATE cooking, but I make this recipe every Christmas for teachers, family, friends, and co-workers. I get asked for the recipe every year and everyone loves it. So, even though I HATE cooking, I make it every year. I missed the part about the recipe update and ended up with 4 lbs of slightly sugar flavored pecans. I couldn't figure out what was wrong. I went back and read the recipe only to discover that the sugar has been cut by 2/3 and the salt was cut as well. What was a yummy, sweet and salty Christmas treat was reduced to boring pecans with a very slightly sweet flavor. Definitely a stretch to call them candied. Luckily, I was only able to do half of my 8lb batch at a time, so my second 4lb batch made using the old recipe is 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kelly Holzberger"
},
"reviewBody": "The old recipe 5 stars plus! This new and improved only 3 stars. Change it back to the old recipe that was originally posted and make a note for those that want candies nuts with little sugar, not the other way around. Candy is SUGAR. Candies means covered with sugar... not a light coating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Costello Weiss"
},
"reviewBody": "Danger: so good you may wind up eating the whole pound and then carry around lots of guilt and calories for a few days afterwards!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this for several years. I prefer the original 1 cup sugar recipe. 1/3 is not enough to make candied pecans, just a bit sweet pecans. The pictures of the completed recipe must be using the original 1 cup. With the 1/3 cup you do not get that thick candied coating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I use this recipe every year for the Holidays. In 2015 I started replacing the water with Drambuie whiskey. Adult gifts only."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dkbicjan"
},
"reviewBody": "This is a wonderfully easy and extremely tasty recipe. All of my neighbors love to get these from me at Christmas time and they are also appreciated at any other time of the year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making these for years as a Christmas treat gift. Everyone loves them!! Today I tried less sugar 1/3 cup with 1 tbsp vanilla and 1 tbsp water. Not as good as original recipe. So I'm making my second batch and made as recipe calls for and will mix the two batches. Love this simple easy recipe when I'm down to the crunch at Christmas. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "I was very hesitant after reading the reviews. I decided to use the original measurements (1 cup sugar/1 tsp salt) except I cut the recipe in half because I didn’t want to waste pecans if it was terrible. I’m so glad I followed the original recipe. The pecans were sweet and salty but not too much. In fact, they could have stood to have more sugar, salt, and cinnamon. My daughter in law’s recipe is better; hence, the 4-star review."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fmxfzk5fkg"
},
"reviewBody": "This is the 2nd Christmas season I have made this recipe &amp; everyone can’t get enough of these candied pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattiC"
},
"reviewBody": "Great recipe! I'm glad I read reviews- - taste-tested before last oven round, and then added more sugar. Next batch, used 1 cup sugar and 1/2 tsp salt. I also did 1/2 tbsp vanilla and 1/2 tbsp water with the egg. Definitely yummy, and gift-worthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Sandusky"
},
"reviewBody": "Wonderful! people have said it has too much sugar - I think the amount is perfect - that is use 1 cup of sugar and 1 tsp of salt. Did split it 2/3 white and 1/3 brown and did substitute vanilla for the water. If you are concerned about the sweetness - add more nuts! But this is better than you can get at any store!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Love it easy and fun to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I previously had DOUBLED both the cinnamon (2 tsp) and salt (2 tsp) and used 1 cup sugar. I was exceedingly happy. I noticed the change of recipe …. too late. Lesson learned, if you find a recipe you like, download it. I would re-title this recipe ‘Sort of Candied Pecans’ Too bad I made a double batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Sweet Cucina"
},
"reviewBody": "This is the easiest recipe for candied pecans. The only thing I did different was add an extra teaspoon of cinnamon, we are a bunch of cinnamon lovers here. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1010lisalynn"
},
"reviewBody": "\"An enjoyable snack that could become addictive\" according to my husband. I added 1/4 teaspoon pumpkin pie spice and it was very tasty. To make these recipe even more irresistible I would a little more salt and sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hopefully you read the editor's note and the latest reviews. The original recipe was a huge hit in my family. I came to print out a clean copy and noticed the ingredient amounts had changed. It was perfect before! Why fix what is far from broken?? Use 1 cup of sugar, 1 teaspoon cinnamon, 1 teaspoon salt, 1 egg white, 1 tablespoon of water, and 1 pound pecans. This revised version will be a waste of time. If you don't want sweet and salty then candied pecans are just not for you. It should be changed back."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made these for Thanksgiving. OMG, they are delicious! I used 2/3 cup white sugar, 1/3 brown and 1/2 tablespoon water 1/2 tablespoon vanilla extract. Followed recipe exactly. I locked it among my favorites! Thank you so very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy and very good! I also swapped the water with vanilla. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I substituted Spenda brown sugar and regular sugar for my diabetic husband and he loved it!! Great treat for all of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dfoy13"
},
"reviewBody": "I loved this recipe as originally written. I made the modified version not realizing it had been changed, and they were fine. Not even close to as good as the original though. Happy I found the notes about the original amounts so I can continue to make them that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I wish I had read the Editor's note about reducing the sugar and salt! I used to revised recipe and it was blaaa! I am going to make another batch with the original recipe and mix them with the blaaa batch and hopefully they even out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally McDonald"
},
"reviewBody": "This is an amazing treat! As with others, I tried it as is first, then tweaked a bit. Used vanilla instead of water, and just used a very small amount of salt. My co-workers loved them, so now I'm the candied pecan person for holiday treats. Very easy recipe, and very good! 11/3/22 - update - just saw that an \"editor\" reduced the sugar from 1 cup to 1/3 c. Don't do that. Just....don't. They are candied pecans, not \"kinda sweet but not really\" pecans. I mean...you do you, but that seems like a bad call."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this so many times and is a HUGE hit. Just made it again and couldn’t figure out why it tasted so bad and bland this time . After reading reviews I noticed the sugar was cut ….. just wasted all morning and 2 lbs of pecans…. It would be nice if the editors note would be placed at the beginning of the recipe or next to the sugar modification so people don’t make the same mistake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jasmin Aurand"
},
"reviewBody": "I thought I was going crazy. The sugar was reduced and I ended making a whole tray of very plain pecans. I would say at least do 3/4 cup- 1 cup. Otherwise, the recipe works."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roselyn Lutjen"
},
"reviewBody": "I make these for my son-in-law who, absolutely, loves them! They turn out perfect every time! I did, however, use the original recipe that calls for 1 cup sugar! This recipe is not sweet enough and certainly not candied!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Go big with the sugar. I made this before with the full cup of sugar recipe, and it kicks butt. The editor who reduced it to a third is doing you no favors. These aren't healthy, they're delicious! Full cup, people!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve been making these pecans for my family for the last year and they were a huge hit! I made the new reduced sugar recipe and it was was a great disappointment. My family hated them. These are called candied pecans because they are supposed to be very sweet…like candy. Please change the recipe back to the original one cup of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ilmo"
},
"reviewBody": "Terrible. I made these before and they were most amazing. Now I see the \"editor\" changed the recipe which in effect means it is not the same recipe. A note was below so not above saying to look below. To go from 1 cup of sugar to 1/3 explains why I thought these were so \"wet\" as I was turning in the oven. They taste terrible and they are not candy shelled with coating. Dirty trick. I just wasted a lb of pecans!!!! Re-made with original measurements and delicious see att pic. Be sure to see editor note below recipe for orig recipe measurements."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Earlene"
},
"reviewBody": "Very easy to follow. I also added vanilla and used pumpkin spice seasoning. My first try and I am very pleased with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So easy to make. Absolutely delicious. I make them to add to a wedge salad and there is always plenty left over to snack on. Better then the ones in the store and cheaper to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "DELICIOUS!!! So simple to make but they make a big impression."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time making them so I followèd the recipe ....think the next time I will add a bit more cinnamon and other than that...they turned out perfectly...and such an easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINNY"
},
"reviewBody": "Excellent! Made them to top sundaes for an ice cream social tomorrow if I can get the hubs to stop munching on them! Loved the bourbon idea and will try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely deliciously wonderful . Usually buy them from Costco but had a 2 lb. bag of pecans &amp; decided to try your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tucson Connie"
},
"reviewBody": "I've been making this exact recipe for years and everyone loves it. I have a pecan tree, and use some of the candied pecans in a snickerdoodle recipe - so good! Anyway, I don't get people changing the recipe, then rating their own version. Totally useless to me, since I want to see multiple high ratings of any recipe I will try. This recipe as is, is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this one and my parents, love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela K Burke"
},
"reviewBody": "So 👍 good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisaj433"
},
"reviewBody": "These came out exactly like the ones you buy in the shops!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cnikkole84"
},
"reviewBody": "Amazing!! Added an extra 5 min to mine, came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4DK"
},
"reviewBody": "Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Benazir Siddiq"
},
"reviewBody": "It was great and crunchy! I added an extra egg white and did a mix of white sugar and brown sugar. Great for yogurt toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rickeg223"
},
"reviewBody": "I took them to a party and everyone loved them and wanted the recipe. And a super bowl party is planned and I was invited if I brought the candied pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csrq8tmptd"
},
"reviewBody": "They were amazing! I did the exact recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fortnermatt"
},
"reviewBody": "This is a great recipe as it is written, but it's definitely a launching point for so much more. I decreased the sugar to 3/4 cup, not because it's too sweet, but there's more than can be adhered to the pecans. Substituting brown sugar is a great change, as is adding some cayenne and maple syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Carlile"
},
"reviewBody": "This is a fantastic recipe as it is! It's easy to make and is a crowd pleaser. The pecans store well in a sealed container though they won't stay around for long!!\n\nMy personal tweak: use bourbon instead of water and add a dollop of molasses. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super easy and super good. Changed nothing. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "electricpegi"
},
"reviewBody": "I halved this recipe just to try it and I can hardly wait for it to cool. It’s super easy to make and absolutely delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leesakyr1234"
},
"reviewBody": "Love"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Weber"
},
"reviewBody": "These Pecan were delicious. I halved the recipe and they were a hit. Delicious in a salad as well as snacking. I will definitely make again. I did add vanilla in place of water as recommended- delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "I made it and now all my friends are asking for \"my\" recipe! The pecans are great but be careful, they go fast;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Galizia Garretson"
},
"reviewBody": "I have made these many times and they are the first request I get when company. They are so easy and really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hankvanhorn"
},
"reviewBody": "The only thing I changed was changing the water to vanilla extract and they turned out awesome. Followed everything else to a tee even the amount of salt and I don't taste any salt in it. They taste just as good if not better than the ones that come in the little expensive tin I got for Christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle K."
},
"reviewBody": "My family and I are all obsessed with this recipe! It is balanced and flavorful. We have them out as holiday gifts, but they are amazing for year round snacking. These will become a regular recipe for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phyllis"
},
"reviewBody": "I added the vanilla in place of the water as others suggested and I did not cut down the sugar. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "90% of reviews changed this recipe so why rate it at a 5 star?\nIs way too sweet most everyone reduce the sugar to 1/2 cup. It also needs the cinnamon doubled which most people did.\nShould be an extra rating for adjusting the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindawah"
},
"reviewBody": "These are addicting and the recipe is easy! Don't overbake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Webber"
},
"reviewBody": "These are amazing!!! Made them to put in a salad, but we couldn't stop eating them before dinner. I put in a half tsp of cayenne pepper to give them a little kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naomidrayton23"
},
"reviewBody": "Perfect! Delicious! I used coconut sugar instead of white sugar and wow, amazing and so simple, Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PalmettoPlantation"
},
"reviewBody": "Perfectly simple, reduced the amount of everything and doubled the amount of pecans. Came out great! Tried some in the smoker... will continue to experiment. Thinking about a little cayenne pepper for a spicy version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Tuttle"
},
"reviewBody": "Loved this recipe. Simple and yummy. I added a little bourbon with the egg…??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maishelle Heath King"
},
"reviewBody": "Yummy. Every one loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Rutherford"
},
"reviewBody": "Love this! Like the others have said, I reduced the amount of sugar to 1/3c granulated cane sugar and 1/3c brown sugar. Everything else remained the same and they are DELICIOUS. \n\nThe key is to get a good whip on the eggs and toss them lightly to keep the froth. It gives the nuts a lovely glaze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Simmons"
},
"reviewBody": "I make these every Thanksgiving and they are always a hit. I even use them on top of other desserts like pumpkin cheesecake or an easy trifle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shoponline"
},
"reviewBody": "I have made this recipe over 5 times. I'm not a baker and this is so easy to make. The friends I have given it to just love them. They prefer mine over the store-bought ones. they say my candied pecans just taste fresh. I've printed the recipe and attach it to the jars I give away. I highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "The only change I've made is to substitute Vanilla Whiskey for the water. Easy, and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NannyN13"
},
"reviewBody": "I can’t stop eating these! I love sweet and I love salty so followed the recipe exactly and they are amazing. I was eating them before I even put them in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Ann Hicks"
},
"reviewBody": "These pecans are wonderful. I made these for work and they turned out so good. I followed some others' advice. I had a 2 lb bag of pecans so I doubled the recipe. I used 1/2 tsp of salt, 1 cup of sugar and replaced the water with 2 tbsp vanilla. These are so good. Can’t wait to share them. Will be making more for Christmas at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janastanfill"
},
"reviewBody": "I only had 5 oz of almonds and I used swerve instead of sugar. I guesstimated on the amount of ingredients. Not too brag but I'm very happy with results. ????. Swerve may be a great alternative to the reviews that say these are too sweet. They were not too sweet but just the right amount. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcartheuser"
},
"reviewBody": "These are great and very simple! You can’t eat just one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Thomas"
},
"reviewBody": "I added some cayenne pepper but otherwise kept the recipe as written. I also sprinkled just a little extra coarse kosher salt on top. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharonalexander2"
},
"reviewBody": "I wanted to make these for Christmas this year but with fewer calories. I substituted the sugar for monk fruit and it was amazing. Also used vanilla in place of the water. Now I have to package them up before I eat them all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine chase-lamont"
},
"reviewBody": "Super easy to make! Used parchment paper to save on clean up. Delicious and addictive - you cannot eat just one or two! I think they would also be a cute little gift if put into mini glass jars with ribbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Little"
},
"reviewBody": "Easy and so good. Great to take to holiday parties"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jccampbell97"
},
"reviewBody": "These are fantastic and so easy to make. All my family and friends love them!! Thank you for a great recipe. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nettylovespaul"
},
"reviewBody": "It's great! I omitted the cinnamon and put a heaping teaspoon of cayenne pepper then used half white and half brown sugar. I added a cup of dried cranberries. And right before I pulled it out of the oven ground some black pepper over the top and it is amazing! I guess it's not the same recipe anymore ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hbrown02300"
},
"reviewBody": "Delicious!!! I love how salty and sweet these are. Wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATHY"
},
"reviewBody": "I used monk fruit sugar. I have diabetes and the monk fruit is 0 calories. I like them in a salad. My first try seemed to be a little overcooked. Will try only for 45 minutes or lower oven to 225 next timd"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csspurling"
},
"reviewBody": "Delish! Replaced white sugar with brown and only used 1/2 cup. Relativly healthy. Great holiday snack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "Holy sweet lord.... MAKE THESE AT YOUR OWN RISK. They are seriously addictive. \nI always love getting the candied nuts at the Rockies games so I thought why not make them at home. Found this recipe and I have made it five times already. Only thing I changed was reducing the amount of sugar a little bit. Seriously so good. \nI like to do half of these candied pecans and roast some plain pecans at the same time. I then lay them out on a piece of wax paper and mix them together then drizzle (more like drench lol) with melted semi sweet chocolate chips. It is heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "I made this recipe as written and y'all. It is SO good. It is definitely sweet-and-salty and amazing. Adjust the sugar and salt to taste, but I'm here to say that this is amazing as is. I may try subbing vanilla for water and brown sugar for some of the white sugar. But honestly, this recipe is fantastic. We'll definitely be making these again for teacher and neighbor gifts at Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sadie"
},
"reviewBody": "Made these Candied pecans several time. Super Yummy. I make a festive jar it Makes great giveaways at Christmas. I most of the time they never make it home. I add vanilla to mine. You Just can't eat one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corazon Fjord"
},
"reviewBody": "I love this candied pecan recipe! I use it all the time! Sometimes I like to make it spicy by adding some cayanne pepper to the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stan"
},
"reviewBody": "We had a turtle brownie sundae at a restaurant that had ice cream hot fudge and caramel and candied pecans. Using this recipe we duplicated the sundae. We put them on all our sundaresan now. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Blackwell"
},
"reviewBody": "Easy to prepare and bake. I used walnuts, and used them to garnish a banana cream pie, yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenPChappell"
},
"reviewBody": "I adore this recipe. My daughter in law has given me a jar of these a few times. They are just the best. I finally asked her for the recipe so I could make it more often. Who knew?? It was a recipe from my Allrecipes site all along! They have the right amount of crunch and sweetness, along with light spicyness. I like them out of the jar or broken up on a salad. They are really addictive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay James"
},
"reviewBody": "I never ever leave reviews but these turned out absolutely amazing! Followed exact recipe, they were delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCarlson"
},
"reviewBody": "This recipe is really great. The first time I made it, I followed it exactly and although it was good, I didn’t like the salt and it was a little too sweet. After making it several times, I now know the amounts of the ingredients that I prefer. I skip the salt, lower the sugar to 3/4 cup, substitute 1/2 T vanilla extract for the water. I love making these candied pecans to give to people at the holidays because it is something other than cookies and is gluten free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri Kellerman"
},
"reviewBody": "This recipe is amazing! It is definitely a keeper! After reading some of the other comments the only thing I changed was reducing the sugar a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa"
},
"reviewBody": "So good and easy to make. I loved using this in a simple strawberry salad with arugula, cut up strawberries, red onions, tossed with olive oil, add a few pieces of candied pecans and drizzle with balsamic glaze. Yummy! Thank you for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yanksgrl98"
},
"reviewBody": "These are delicious. Forgot to add the cinnamon and they still came out amazing. Will definitely make again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230557/candied-pecans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/114/appetizers-and-snacks/nuts-and-seeds/",
"name": "Nuts and Seeds"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230557/candied-pecans/",
"name": "Candied Pecans"
}
}
]
}
}
, "about": [
]
}
]