				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Caraway Rye Bread (for the bread machine)"
,"datePublished": "2020-03-05T00:10:23.000-05:00"
,"dateModified": "2022-08-11T22:48:37.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BramptonMommyof2"
,"url": "https://www.allrecipes.com/cook/8565160"
}
]
,"description": "This light rye loaf for the bread machine has lots of caraway seeds and is sweetened with both brown sugar and molasses."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DNkLHOphz9Sfv-ZW0vjn5p212lo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1026465-caraway-rye-bread-for-the-bread-machine-Melissa-Goff-4x3-1-ff13e31269e74491a839407f7c49619e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Caraway Rye Bread (for the bread machine)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "47"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "93 kcal"
,"carbohydrateContent": "17 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "218 mg"
,"sugarContent": "5 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.25 cups lukewarm water (100 degrees F/38 degrees C)",
"2 tablespoons dry milk powder",
"1 teaspoon salt",
"2 tablespoons brown sugar",
"2 tablespoons molasses",
"2 tablespoons butter",
"0.75 cup whole wheat flour",
"1.75 cups bread flour",
"0.75 cup rye flour",
"1.5 tablespoons caraway seeds",
"1.75 teaspoons active dry yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Put lukewarm water, milk powder, salt, brown sugar, molasses, butter, whole wheat flour, bread flour, rye flour, caraway seeds, and yeast into the pan of a bread machine in the order suggested by the manufacturer. Select the Grain setting and 2-pound loaf size."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT250M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "MAE. I gave it four stars because I haven’t actually made this yet. It does sound promising. However I have a few questions. Do you have a gluten free version of this bread. Also can I use almond flour instead of rye ? Would appreciate an answer. Thank you. Celiac since 2003."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Raphael"
},
"reviewBody": "Just amazing. Used dough cycle and let it rise an hour. 30 min at 350 and—be still my heart—this rye is a dream. Thank you so much for the recipe. Made EXACTLY as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "v54kqj4gxg"
},
"reviewBody": "Came out beautifully and is delicious. Didn’t have caraway seeds so used everything bagel seasoning. Used dough setting , formed loaf and put on cookie tray with cornmeal on bottom. Cooked 30 minutes at 350 . Cook was perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Classic rye with good taste and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious ! The only thing I left out was dried milk powder as I did not have any on hand I used king Arthur flour and King Arthur yeast Rose beautifully and tastes so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This bread was DELICIOUS! Will be making it again!! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Sproc"
},
"reviewBody": "This was my first try at making rye bread. It made such a beautiful, flavorable loaf. Thank you for sharing the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "almsthere"
},
"reviewBody": "Just made this this morning and it was amazing! After reading reviews I just made 2 small adjustments. In order to keep it moist I used 2T honey instead of brown sugar and, to keep it light I added 2T of vital wheat gluten. I set my machine to 2lb wheat on the light crust setting and crossed my fingers. I have to tell you it took all my will power to let it cool and dry (leave it in the machine for 1hour after baking and the bottom will crust better) because the smell made my mouth water even before it was baked! Please let it completely cool and let the crust dry a bit before slicing. The crumb was amazing and it filled my entire machine with the added gluten. Better than basically every rye bread I've purchased in a store and much cheaper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I Love Spatula"
},
"reviewBody": "My modifications : 1 Tbsp of coconut sugar instead of brown sugar; only 1 Tbsp of blackstrap molasses; only 1 1/2 tsp of yeast; substituted 1Tbsp of water for unfiltered apple cider vinegar (When added to baking, unfiltered and unpasteurized Apple Cider Vinegar helps to strengthen the dough, making it more springy in the way that regular bread is, and allowing it to rise much more easily). I lined the baking pan with parchment paper and I baked it at 350°F covered for 30 minutes and then, uncovered for another 10 minutes. The bread is extremely moist and soft like a good sandwich bread. We loved the caraways seeds — it added flavor to the bread. Thank you so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Excellent recipe! It produced a nice sized loaf. Texture was moist and the bread was flavorful without being overwhelming. I made it on the dough setting. When finished, put it in a 2 lb. loaf pan and let rise for about 45 min. until it had risen 1 1/2 times its size. Baked it at 350 for 35 min. Will definitely add this to my recipe collection. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LeoC4"
},
"reviewBody": "The result was too dense; need to try variations on the amount of yeast, flour, etc as well as baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Meredith"
},
"reviewBody": "It is a nice mild rye and turned out perfect first try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tennisgale"
},
"reviewBody": "Followed the recipe except for sugars. Used 1 tablespoon honey, 2 teaspoons brown sugar and 1 teaspoon molasses. Used bread machine to mix and after 3rd raise, baked in oven at 350 for 31 minutes. Really good texture, nice crust and not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MATLUCK"
},
"reviewBody": "Sweet but it works!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roxy"
},
"reviewBody": "Good evening. My husband &amp; I are making this recipe. Its our 1st loaf in our new breadmaker. The middle collaped. We followed the recipe exactly. Any info would be greatly appreciated. Thank you kindly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Johnson"
},
"reviewBody": "Superb. I make twice a week for ourselves and for my in-laws. I do not alter a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "akyra"
},
"reviewBody": "Great recipe however No bread machine.\nFirst rise 2 hours, knead a little second rise in pan 1.5 hours and baked with a pan of water at oven bottom.\n35mins at 350. \n Second batch cut sugar in half and it was perfect. Definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Gaspich"
},
"reviewBody": "This bread was amazing. I made it for Reuben sandwiches. The recipe is a keeper. The only change I made was to switch Olive oil for the vegetable oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndi Konopka"
},
"reviewBody": "My rye bread never turns out, it’s always 3” high and solid as a rock... but this was fabulous! I did add 1/4 cup of gluten. However.. I always add gluten to my bread machine recipes, they just aren’t light and fluffy if I don’t. I also used King Arthur Flour. So excited I found a recipe that works!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phylleri"
},
"reviewBody": "This is my go-to recipe for rye bread. I do not bake it in the machine, but form into two loaves and bake in the oven at 350º. Just had a BLT using slices of this bread and it was great. I also love just a simple slice of cheese on it for a snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Slightly chewy and crusty on the outside. Moist and yummy on the inside. I sprinkled poppy seed and sesame seed on top. SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "Besides caraway seeds I add flax, sunflower, pumpkin seeds. About one tablespoon each (or a small handful of each).\n\nI use the dough cycle and form into a loaf and let rise about 30 minutes before I bake at 350 degrees F for 30 minutes.\n\nThis is a go to family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime"
},
"reviewBody": "Made as directed and it turned out great! My husband loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anthony D"
},
"reviewBody": "I learner that I don't care to much for caraway seeds.\n\nLooks nice though. Made by hand as per reviewers recommendation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britt Verstegen"
},
"reviewBody": "I reduced the caraway to 1 Tblsp. and the brown sugar and molasses to only 1 Tblsp. each. Very good! My German beloved loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chippy194"
},
"reviewBody": "Made this today and extremely happy with the results. I didn't have molasses but exchanged for malt extract. Love the light fluffy texture and taste. Caraway seeds offer a subtle flavour. This is a keeper. Thank you so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItNeedsMoreGarlic"
},
"reviewBody": "11/2017: This bread was PERFECT - moist, amazing flavor, used 2 lb wheat bread setting on my bread machine, baked right in the maker. I had bunch of substitutions because some of the ingredients I didn't have on hand, but it seemed to work out great!: \n-used scalded milk instead of water + milk powder\n-used bread flour instead of wheat flour\n-added 2 tsp vital wheat gluten to help texture w/ the rye flour \n-used 1.5 T brown sugar instead of molasses.\n-went heavy on the caraway, but I love the flavor.\n\n Update 12/31/17\nMade bread for new year's eve dinner - turned out amazing again! I used the recommended flours and molasses this time - turned out even better. Moist and great texture. Still added vital wheat gluten and subbed scalded milk for the water + dry milk, heavy on the caraway again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Fairfield"
},
"reviewBody": "This is the first time I made this recipe. It was awesome I added for teaspoonfuls of vital wheat gluten to make the volume higher and I used olive oil instead of butter. It was fantastic my bread machine is a Cuisinart convection breadmaker and it worked really well on the 2 pound setting with a light crest setting on the whole wheat number three setting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike H"
},
"reviewBody": "Great bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elies"
},
"reviewBody": "My new go to bread machine recipe! \nDon't believe anyone who gives this less than a 5-star review. \nIt's soft, fluffy, and has great light flavor from the rye and molasses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen M Smith"
},
"reviewBody": "A good rye bread, I am pleased with it - the mixture of flours works well. I subbed splenda for the brown sugar and also added about 1 T ground flax seed. I think next time I make it I will cut the splenda subbed for the brown sugar in half, maybe it is sweeter than brown sugar. Using just the molasses was enough to help the yeast rise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Kane"
},
"reviewBody": "It was good, the combination of flours provides a great texture and moisture in the finished loaf. The toast is real good. Kinda crispy. It's dense. It's great with peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tinaindenver"
},
"reviewBody": "I made this recipe, but I left out the brown sugar, used 1 1/2 cups water, because it didn't sound like enough liquid and used a 1/4 cup more whole wheat (and a 1/4 cup less bread flour). I used the order of ingredients that my bread machine instructions recommended (all dry first, then wet). I also used the whole wheat setting. It came out very well. I was happy because I made one from another website the night before and it didn't rise well and was misshapen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bambam"
},
"reviewBody": "I am so happy I finally tried this recipe. It is so good! I had forgotten how much I like the taste and smell of caraway seed. It brought back sweet memories of my dear Mom. This bread is wonderful toasted and buttered. BramtonMommyof2, I hope you'll forgive me for the one substitution I made with your wonderful recipe. I did not have any molasses as it is not a flavor I enjoy. I read on-line that a suitable sub is pancake syrup so I used that instead of the molasses. I used this bread to make patty melts from another recipe found on this site (sponsored by the Clorox company). What a wonderful combination of flavors it was! Thanks for sharing your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susanegc"
},
"reviewBody": "Delicious and easy to make. I substituted EV olive oil for the butter and honey for the brown sugar. Love that this recipe used some whole wheat flour, as not all do (and no gluten which I was out of)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love to cook"
},
"reviewBody": "Lovely bread, even with leaving out the milk powder, as I don't have any in the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "Outstanding simple recipe. Best I've found. I make the dough in a bread machine using the dough setting. This does all the hard work. Then I transfer it to a breadpan to rise for about 3-4 hrs depending on temperature. When I like the size I then bake at 350 for 30 minutes. Great for Reuben's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GW"
},
"reviewBody": "I make this by hand as I don't have a machine. \nI use whole milk equal to volume of water and powder. \nI mix dry ingredients in bowl except yeast, warm milk, molasses and butter to 100 degrees F, then add yeast and stir in. In about 10 minutes when frothy, I pour into dry ingredients and stir with big spoon until no lose powder is left. I let sit 10 minutes before kneading for 10 minutes adding flour as needed to keep from sticking.\nCover with damp towel for about 2 hours until doubled in size. I then punch down and knead another 2 minutes and place in loaf pan to rise for about 2 hours until way above the pan top. It looks cooked at this point. Bake for 35 minutes @ 350 F. I live off this fabulous staple. I have subbed in Fennel Seeds when Caraway were scarce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Double L"
},
"reviewBody": "I just pulled this bread out of my bread machine. I had to stop myself from slicing it one piece at a time and devouring it after slathering each piece with butter. It is amazing. I used one cup of scalded milk with 1/4 cup of water. I did not have molasses, so I used 3 Tablespoons of brown sugar. It is completely amazing. I will make this bread many, many times I am sure. Very flavorful and delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Goff"
},
"reviewBody": "one of the best bread machine recipes, I've come across in a long time. I've never used caraway seeds and so I was a bit cautious. I of course made this recipe in the middle of the night to occupy my time. And when I woke up, wah-la it was done and cooled. The loaf was super airy, sturdy yet soft and nearly store bakery quality. Using an electric bread knife to cut even slices, turned out just beautifully. I was rather impressed. I was worried about the flavorful but it was very nice as well. I will try this recipe with other seeds or herbs and without as well. Very good, very good...a wonderful keeper for sure!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "Very moist. I really liked this bread even though l left out the milk powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Nice! I have some milk to use up that's edging toward spoiled, so I left out the milk powder, added a bit more flour, and used 1 cup of the milk and 1/4 cup water. Used the dough setting on the bread machine, then let it rise in a pan and baked at 350 for 40 minutes. Turned out flavorful and soft, and pretty. :) I like the seeds in here, but I know some people don't like seeded bread--I am sure you could grind them if you don't like seeds in your teeth. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri"
},
"reviewBody": "yes i tried this and its awesome !!!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231774/caraway-rye-bread-for-the-bread-machine/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231774/caraway-rye-bread-for-the-bread-machine/",
"name": "Caraway Rye Bread (for the bread machine)"
}
}
]
}
}
, "about": [
]
}
]