				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chakchouka (Shakshouka)"
,"datePublished": "2008-12-30T07:58:21.000-05:00"
,"dateModified": "2008-12-30T07:58:21.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Ben"
,"url": "https://www.allrecipes.com/cook/2859688"
}
]
,"description": "Shakshuka is a Tunisian dish of fried eggs simmered in a flavorful sauce of tomatoes, onions, bell peppers, garlic, chile pepper, cumin, and paprika."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-DLKCvxdGIVtC1RvRIjaaL0yDDA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2273713-chakchouka-shakshouka-lucy-1x1-1-a05f8534ec944c77b294538d0fc6b6d2.jpg",
"height": 850,
"width": 850
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3793652248001",
"description": "Learn how to make this wonderful Middle-Eastern breakfast with a spicy tomato sauce and eggs.",
"duration": "PT2M15S",
"name": "Chakchouka Shakshouka",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ed2b010a-7fa1-4c22-8be7-6899bc971201/46abcf39-2ef1-486b-986d-5b4ea8355a44/1280x720/match/image.jpg",
"uploadDate": "2021-07-07T14:27:36.509-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chakchouka (Shakshouka)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "386"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "209 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "164 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "654 mg"
,"sugarContent": "7 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3 tablespoons olive oil",
"1.3333333730698 cups chopped onion",
"1 cup thinly sliced bell peppers, any color",
"2 cloves garlic, minced, or to taste",
"2.5 cups chopped tomatoes",
"1 hot chile pepper, seeded and finely chopped, or to taste",
"1 teaspoon ground cumin",
"1 teaspoon paprika",
"1 teaspoon salt",
"4 large eggs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat olive oil in a skillet over medium heat. Stir in onion, bell pepper, and garlic; cook and stir until vegetables have softened and onion has turned translucent, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, mix together tomatoes, chile pepper, cumin, paprika, and salt in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Stir tomato mixture into onion mixture. Simmer, uncovered, until tomato juices have cooked off, about 10 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-DLKCvxdGIVtC1RvRIjaaL0yDDA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2273713-chakchouka-shakshouka-lucy-1x1-1-a05f8534ec944c77b294538d0fc6b6d2.jpg"
}
]
,"text": "Make 4 indentations in tomato mixture; crack eggs into indentations. Cover the skillet and cook until eggs are firm but not dry, about 5 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari Anne Moseley"
},
"reviewBody": "My kids can't handle spicy hot so I replaced the hot chile pepper with a teaspoon of chili powder instead. I really loved the flavors of this but it didn't make enough for everyone. I will double the recipe next time and use a larger skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. A"
},
"reviewBody": "I've made this three or four times now and my family loves it! I do have to cook it quite a bit longer than the recipe calls for, we do like our eggs cooked hard and that 5 minute cook time just is not enough for what we like. BUT it is delicious and well worth the wait."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "The eggs didn't cook right. The top of the eggs were under cooked and the bottom of the eggs were overcooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good. I used red pepper flakes, 3/4 teaspoon, and that was enough heat for me. I also had to cook the sauce a little longer than 10 minutes to get the the water out the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lady Mel"
},
"reviewBody": "Excellent recipe - minimal prep and maximum flavor! Made as directed using a large can of original Rotel as suggested in the editor’s note. Adding as a regular into my breakfast/brunch rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fab recipe. I added a few more spices like Corriander powder, Cumin, Cinnamon, Star Anise, Nutmeg. (Go very light on these heavy spices) Create deep well in the crused tomato to break the eggs. Garnish with paprika and Arugula leaf around each egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bevkei"
},
"reviewBody": "This is an excellent recipe, but I have one addition that, I believe, elevates it to the best it can be and that addition is goat cheese. I learned to make this after first having it at a wonderful restaurant owned by Israeli’s in Oaxaca, Mexico. Their recipe was almost identical to this one with the addition of dollops of goat cheese which get added just after the egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidi"
},
"reviewBody": "Oh, my goodness! Breakfast heaven! I hardly had any tomatoes, and this still turned out absolutely delicious! The caramelization of the onions and peppers lends an amazing fruity sweetness which complements the eggs perfectly. I made one serving: Used half an onion and half a yellow bell pepper (about 1/4 c. each), half a jalapeño, and about 5 cherry tomatoes. Sprinkled on the seasonings without measuring, and more or less cooked as directed in a little cast iron skillet. After cooking the eggs for a bit, threw in a handful of fresh baby spinach and about a tablespoon of grated sharp cheddar and replaced the lid. My yolks cooked too much, unfortunately, (my fault for getting distracted), but it all tasted so delicious anyway! Served with buttered toast. Absolutely will be making this again… maybe even for company! Highly recommend this recipe! Why is this not served at breakfast restaurants????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles Pascual"
},
"reviewBody": "Terrific dish! I've been collecting shakshouka recipes for some time (a lot of similarities among them but each is a riff on the basic recipe). Then I came across this one over the weekend and decided now is the time to make shakshouka. Straight-forward and easy to follow - came together quickly - all the ingredients are things I typically have on hand. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaska Jenni"
},
"reviewBody": "Delicious! Didn’t have any spicy peppers so used cayenne and scooped it up with lightly toasted flatbread. I also made a whole recipe of “sauce” although I am single and 4 eggs is too much. I reserved half of the sauce in a small fry pan and I will try reheating it and will cook up fresh eggs to make another meal out of it on a weekday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teresacshuler"
},
"reviewBody": "I made per the recipe. Used two Serrano chilies. Started out in my 10” pan and realized that it would be better in the 12” pan. I also used a can of drained 28oz San Marzano tomatoes instead of fresh tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly BvK"
},
"reviewBody": "My husband and I were Peace Corps Volunteers in beautiful Tunisia (lo, these many years ago…) and this recipe is spot on. However, because my Dutch-Indonesian-born hub can no longer eat the spicy foods of his youth, I omit the hot peppers and put a jar of Tunisian harissa on the table for those who like a little more heat. I also break from tradition by frying the eggs separately to accommodate family preferences, which makes storing leftovers easier if I make a large batch. Many thanks for this delicious recipe from the REAL Tatooine! May the force be with you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just made this for breakfast, fresh tomatoes, peppers and hot pepper from the garden. The only change I made was I did 5 garlic cloves instead of 2, and left the seeds in the hot pepper. This was crazy awesome!! The directions say to cook the eggs about 5 minutes, the video says, I think 8. Did them for 7 minutes and they turned out a bit to done for me, will go with the directions next time and cook them for 5 minutes. Will make again for sure, it was so dang good! Served with naan bread. YUMMY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Easy to make, easy to clean up. Tastes great and low net carbs. Great recipe - thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladytattoo7"
},
"reviewBody": "Used other recipes for this dish too....and have added turkey sausage crumbles. Absolutely wonderful dish!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "GREAT RECIPE.I MAKE THIS OFTEN. I SUB WITH VARIUS INGREDIENTS THAT I HAVE ON HAND."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My fresh tomatoes were huge and very juicy heirloom do took a little longer to cook down but the flavors of all ingredients once done was delicious. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pbisho"
},
"reviewBody": "It is terrific! My husband makes this for me on the weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Cantrell"
},
"reviewBody": "I used to eat this everyday in Palestine and have made it often since returning to the states. This recipe is as close to how it was prepared as any I had. I eat it not only for breakfast but dinner and have served at brunch to race reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Smith"
},
"reviewBody": "Really good! Use homegrown tomatoes if you’ve got ‘em, but I’ve made this with good quality canned tomatoes and it’s still delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonde44"
},
"reviewBody": "This was awesome! Very good tasty and satisfying. We loved it and will continue to have it for a long time. Thank you so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamajenn1313"
},
"reviewBody": "I made this for my husband. He has been a professional chef for over 30 years! I was nervous because I was the one cooking it. He had never even heard of this dish. HE LOVED IT! I added some spinach and he wanted it over rice. I am so glad I found this. I am going to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Brenneman"
},
"reviewBody": "Delicious non-meat recipe with lots of vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Wade"
},
"reviewBody": "Love this dish anytime of day. I use can diced tomatoes with Chile peppers. I also heat tortillas and eat with this dish. You can backed them and melt a little cheese onnit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sid"
},
"reviewBody": "This was delicious, and easy to. I will make this again. I sprinkle just a little Parmesan cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Stagg"
},
"reviewBody": "This is wonderful! Fresh ingredients make great meals. I have made several times now and it still is a wonderful recipe. I like flavour, and lots of it! This recipe delivers. Add heat. Subtract heat. Ripe tomatoes. A beauty! Follow the recipe and you won't go wrong. I serve as an easy dinner, with hash browns on the side. A filling meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Dunphy"
},
"reviewBody": "This is a fine recipe, for a group. I adapted this for one person, since I live alone. I use one tomato, some frozen pepper strips, half an onion diced, and a dash of creole seasoning, and oregano. after the sauce is to the texture I like, I add the eggs, I use 3 in an 8 inch, cast iron skillet. Sometimes in lieu of toast points, I add a handful of seasoned croutons right into the sauce, when I add the eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasmj0503"
},
"reviewBody": "Very easy to make and tastes great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefPeanut"
},
"reviewBody": "Healthy and delicious - great dinner option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abaddon Mainyu"
},
"reviewBody": "Added a tsp of garlic. I was skepticle at first but for being so simple, this is sooooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nasml828"
},
"reviewBody": "This is not an Israeli dish. It predates the first Israeli settlements by centuries. It is eaten is Israel, that does not make it Israeli. Croissants are eaten in Israel and I haven't seen anybody call them Israeli. Calling it, and countless other Arabic dishes like hummus and falafel Israeli is deeply misleading and erasing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "man1951"
},
"reviewBody": "I made this for brunch today and loved he simplicity and ease. My guests were wowed and asked for the recipe. I used fire roasted tomatoes and felt that added a nice touch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lori"
},
"reviewBody": "The only change we made was using diced tomatoes with green chilies. We loved it!! Can't wait to make it again. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris CC"
},
"reviewBody": "I made this using all the ingredients listed except for the chili pepper, as I have a wimpy palate. (I detest the incessant burn left when heat is too high!) I've got a medical condition that makes it somewhat challenging for me to chop a lot, but I'm very determined, so I did it all, just in a lot longer length of time than I expect most would take to accomplish it. Having checked the tomato-onion mixture at the time listed, I ended up cooking it for maybe twice as long in order to cook down the juices, (Perhaps more detail as to range setting might clarify?) Nevertheless, I did end up with an amazingly flavorful, deliciously different meal, which my husband also very much enjoyed! (As my hubby's taste buds are a lot more robust, I suggested that he try some salsa on it. We both ended up sprinkling it with Trader Joe's Hatch Chile Salsa, which we both love as it's not *too* hot!) I will definitely make this tantalizing veggie offering again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GIGI"
},
"reviewBody": "I followed the recipe for the most. I enjoy protein with eggs, So I added slices of farmer sausage. \nThis is a good, quick and easy recipe to put together. I use my own (caned) homemade marinara sauce then added some fresh tomatoes, peppers and garlic.\nWould make it again this time adding cubed chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "77rodneybyrd77"
},
"reviewBody": "Excellent recipe! I left out the chili pepper and it was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DelightAde"
},
"reviewBody": "Very good!!! I served it with potatoes. I wish I had made a bigger batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Nolan"
},
"reviewBody": "It was great . Very easy to cook and very cute idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lawrie Davidson"
},
"reviewBody": "This was delicious. My wife and I ate the whole skillet the first time I tried to make it. Taste is super. Going to take it camping with us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "Tasty dish and different then other dishes so a unique change from same old."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Stephens"
},
"reviewBody": "This is a second Shakshouka recipe I've tried and they're both pretty similar. This one required fresh tomatoes which is a plus during those summer months with tomatoes rolling in. We eat this for dinner as a delicious vegetarian dinner. Toasted Naan bread along side is a must!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vaz"
},
"reviewBody": "This was delicious and not difficult to make. I partially covered the pan to make the eggs cook faster and helping keep the juices in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wappa"
},
"reviewBody": "Made half a recipe and garnished with cilantro. It was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Peteren"
},
"reviewBody": "I made no changes and don't think I would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danielle Cannon"
},
"reviewBody": "I truly enjoyed making this dish with my daughter, loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "opus-boris-natasha"
},
"reviewBody": "Really good. I followed the recipe almost completely. I added a tablespoon of curry powder for extra kick. Served with toast. I will make it again and will serve with breakfast potatoes. Yummy!! Big hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elly"
},
"reviewBody": "Delicious! I made it just as written and we loved it. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Norton"
},
"reviewBody": "Made it exactly as written and it was awesome. I will be making this often!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tigerkamc40"
},
"reviewBody": "It's so delicious!! Thank you for sharing that recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvmsmdw6gn"
},
"reviewBody": "Didn't change a thing. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wiferellaprime"
},
"reviewBody": "I made it as directed. It was excellent. Chakchouka will be part of my regular menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knitter"
},
"reviewBody": "My husband made this for lunch today along with hash browns. It was delish! He used canned tomatoes because we didn’t have enough fresh ones. It was a nice break from bacon and eggs or omelets. Will definitely cook again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eddie Coyle"
},
"reviewBody": "I had this often travelling in the Middle East, this recipe holds up well. It is most similar to the Italian (or Italian American) \"Eggs in Purgatory\". Saved some time, canned diced tomatoes work just as well. Getting a good crusty bread is what makes this dish, don't fall down on that crucial item."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Wow! This recipe - from ingredient amounts, to cooking temps and time - spot on and fabulous!! My ONLY deviation was jalapeño for the red chili as I didn’t have any and it was 8:30am when I started this. Amazing flavor and easy to make. Next time; I will have. Everything chopped and prepped the night before (except maybe the tomatoes) for an easier meal in the am. Cannot wait to make again!! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "P Saunders"
},
"reviewBody": "A firm favourite with my daughter. I serve it either with Rachel Fives Quick Morroccan Cous Cous or with thin slices of garlic toast. Just shovel that shak onto the toast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "Added impossible meat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tuco! Tuco! Gas! Gas! Gas!"
},
"reviewBody": "This turned out really nice. I sprinkled a little feta on top and served it with Korean manuljong (pickled garlic scapes)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suegibson1960"
},
"reviewBody": "We loved this dish. it is a keeper. most time consuming was the prep of chopping the onions and slicing peppers and tomorrow’s. however that was barely 25 minutes. The aroma in the house was awesome. Next time i’ll add just a bit lore of the cumin and paprika"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "When I don't know what to have for dinner, or when I'm out of ideas, I like to have breakfast for dinner. This was great! I cooked up some bacon and oven home fries to go along with the main event. I used canned tomatoes, juice and all, and reduced the cumin a bit. DH loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rod"
},
"reviewBody": "A great way to start the day .. spicy and unique !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patrick Babin"
},
"reviewBody": "Delicious for any meal and low on calories"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Harvey"
},
"reviewBody": "Pretty straightforward and good for any meal. Lean with good protein."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "astrorrachel"
},
"reviewBody": "Ate a lot of this wonderful Palestinian dish while living in Amman! Thanks for sharing the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "I thought this tasted really good. Healthy and fresh. No one else in my family liked it, so sadly I probably won’t make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fluffhead77"
},
"reviewBody": "I added some mushrooms, used orange bell peppers and used a 28oz can of diced tomatoes, lightly drained. So I had to cook a bit longer at each of the first 2 steps to boil off liquid. Result was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimpishme"
},
"reviewBody": "I have a new favorite go-to easy recipe and it’s this. Being a veg-head I added mushrooms and chick peas to it.Live the spices, deliciousness, and high city veggie content."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "my 3 sons"
},
"reviewBody": "Had to cut ingredients down for one but it is absolutely great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terra Smith"
},
"reviewBody": "I had to wing it on a couple ingredients because I decided on a whim to make it and it’s still one of my favorite dishes. Instead of a chili pepper I used chili flakes and a dash of cayenne, I had some cilantro so I garnished with that and added a couple dollops of Greek yogurt. If I had feta or goat cheese I would have sprinkled that on top too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anne A"
},
"reviewBody": "I have made this 3 times and love it. So easy and quick and a great make ahead meal. Fresh tomatoes are preferred but if decent tomatoes are not available, canned diced tomatoes works fine. I also added a can of Ro-Tel and skipped the chili. Smoked paprika is a good option if you want a slightly smoky flavor. Served over a hearty grain and a tossed salad on the side for a dinner option. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ed Dodson"
},
"reviewBody": "It was really good and I will fix it again. I used a 28oz can of Contadina diced Roma tomatoes but chopped everything else fresh. The peppers looked so tiny that I used two and the heat was fairly high and persistent but not unplesant. It reminded me of Sam Levinson's comedy routine about how hot his mother's cooking was. I liked it and my wife tolerated it. Next time I will try one pepper and up all the other seasonings like I always do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idiomie"
},
"reviewBody": "I added chicken stock and two bay leaves while cooking. I plan on adding mushrooms next time and slightly reducing the amount of bell peppers; it's mostly a texture issue for me, which I expected going into the dish. I wanted to follow directions as closely as possible for the first pass, though, which is why I didn't do that this time. Overall, it was very good, and the dish will be making a regular appearance on our dinner table.\n\nIt took slightly longer to make than the recipe suggests; while part of that is just unfamiliarity (I always estimate a new recipe taking 10-20% longer anyway), I think I also spent more time sauteeing the base (over ten minutes, rather than the estimated 5) and reducing the liquid after adding the tomatoes (I wanted a much thicker consistency, so I let it simmer for almost 20 minutes), and will continue to do so. That means it takes closer to an hour than the suggested 40 minutes, but it's not a very laborious dish, so as long as I keep an eye on the clock, it's not a problem.\n\nI do wish I'd thought to take a picture before serving it, it makes a very photogenic dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thutil"
},
"reviewBody": "Serving it with something starchy like rice really helps to give the dish some body. Easy to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Ellerby"
},
"reviewBody": "The seasonings make it so delicious. The first time I ever experienced this dish was when an Israeli chef made it for us at a B and B in Hawaii. The flavors from this recipe were a wonderful memory of that trip. The only thing I would do differently next time is chop the bell peppers into smaller pieces. We always have more fresh garden tomatoes than we can handle every summer, and this was a perfect way to make use of them. An additional step was I needed to strain out some of the excess water because they are much juicier than store bought tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Ann Martinez"
},
"reviewBody": "This was fantastic! After reading all the reviews I dare to add a can of chicken. It was superb! Going now for my second! The hubs kept saying “this is good! This is good!”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Lisha"
},
"reviewBody": "Excellent! I love the combination of spices and vegetables. I will probably try this combination, minus the eggs, and cook this with some type of white fish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IFortuna"
},
"reviewBody": "This is generally how I make mine but I don't drain the tomatoes. I use canned stewed tomatoes that have onion and green pepper already added. I chop the tomatoes, pour the entire contents of the can into my pan, add 2 to 3 Tbs. of Kerrygold butter, add Basil or Oregano, parsley, and white pepper, stir well. It is critical to add the butter; it makes the dish. Then put 4 eggs in a dish then slide them into the tomato mixture after the liquid boils. Lower heat. When the tops are opaque, I flip each egg so the tops are cooked. I serve this over 6 steamed (in the microwave 10 sec. per tortilla, so 1 min.) *corn* tortillas. This is one of my favorite breakfasts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy R"
},
"reviewBody": "Fantastic recipe. Used canned tomatoes and red pepper flakes instead of fresh. We also sprinkled with cheese at the very end. This was a big hit and will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clf75"
},
"reviewBody": "Fantastic! It was my first time making it and we love it! Excellent cultural merge of flavors for me (Greek) and my husband (southern African). Delicious and easy recipe - recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Graff"
},
"reviewBody": "Added mushrooms and chopped spinach just because. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beanobob"
},
"reviewBody": "I love this recipe, it is a staple in our recipe rotation. However, I adjusted it to be a dinner meal. I sauteed eggplant in the beginning and added it to the recipe. Having Naan bread or rice with it is excellent and it is an easy and flavorful weeknight dinner. \n\nI love that this recipe is so versatile and can be used for so many different recipes adding different components to it (eg shrimp or cannelloni beans) and its vegetarian is fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mitchfurman"
},
"reviewBody": "Came out great. Made mine over hash browns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A M"
},
"reviewBody": "This was so easy and full of great flavours. Even my eight year old son loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FingerLakesGirl"
},
"reviewBody": "This was beyond fabulous! Super easy and delicious. I used drained canned diced tomatoes instead of fresh and used smoked paprika. I made black eye peas (slightly on the mushy side) in the Instant Pot and used the bean broth to make the risotto. Served the Chakchouka over the rice and beans to make a fantastic healthy and filling dinner. \nThank you for sharing this amazing dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gilliebeans"
},
"reviewBody": "I blend the onions and peppers together first to make the pieces much smaller. Then blend the tomatoes (with juices) on their own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bilal Maassarani"
},
"reviewBody": "Good, but I will make changes next time. I put mushrooms for my first try, and a delicious fresh red chili and basil mix instead of the hot peppers. I had to add a bit of water as the tomato was not juicy enough. Garnished with parsley. Adding a bit of cheese tasted good.\n\nI felt the cumin flavor was too strong so I will experiment with that. maybe with less cumin and/or more spices like turmeric and black pepper. Also, I think it can handle a bit more garlic and at 1-2 more eggs. I didn't like serving with pita bread or another carb. It kills the delicious flavor for some reason."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish Newberg"
},
"reviewBody": "Flavorful and delicious. Even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo-Anne"
},
"reviewBody": "different and delicious. Just spicy enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vetro31"
},
"reviewBody": "Came out great...delicious just like I remembered it from my childhood!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Noyb"
},
"reviewBody": "This amount serves two for dinner, with a salad. I usually double the veggie/sauce and use 6 eggs to serve 4 people, with an Israeli/Lebanese salad and pitas. To kick up the “heat”, I sometimes use a poblano pepper and a sweet pepper (or just poblano)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilly Tripp"
},
"reviewBody": "Instead of a chili pepper I used sliced Jalapeno. This dish was better the day after. We will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "figa49"
},
"reviewBody": "Made without the chili peppers and it was delicious . I made it with and without the chili peppers. Since I'm a wimp when it comes to spicy foods, I liked the version without the chili peppers better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jjanett Sschneiderr"
},
"reviewBody": "Great flavor!! Used green Chile peppers because that's what I had on hand and added some corn. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T'Leah McQuade"
},
"reviewBody": "Delicious. I added some chorizo as well and served it with toasted italian bread. It didn't last the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suziematoozie"
},
"reviewBody": "Delicious!!! Because I grew up in the south, I love grits and decided to serve this over them! Masterpiece!! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabriela"
},
"reviewBody": "It came out absolutely delicious!!!! I followed exactly step by step and it’s perfect ! I let my eggs cook a bit longer than 5 minutes because I like them firm !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aw2day"
},
"reviewBody": "This recipe was easy to make, delicious, and filling. As per another reviewer's suggestion, I made extra sauce, so that all I have to do the next time is to warm it, and cook the egg. I added 1 shredded carrot, sliced mushrooms and chopped kale just to add more nutrition. I used 1-15 oz. can diced tomatoes in place of the fresh tomatoes. I didn't have a hot chile pepper, so used 1/2 tsp. cayenne powder. This was just right for me, but I will reduce it to 1/4 tsp. when I serve it to others. I will also increase the cumin to 2 tsp. I totally omitted the salt. Thanks for the delicious recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Baker"
},
"reviewBody": "My husband and I enjoyed this recipe. I made flat bread to go with it. The timing on the eggs should be a bit shorter, the egg should be runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrena Slawich"
},
"reviewBody": "Great healthy and unique dish!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213717/chakchouka-shakshouka/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213717/chakchouka-shakshouka/",
"name": "Chakchouka (Shakshouka)"
}
}
]
}
}
, "about": [
]
}
]