				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cheesy Baked Grits"
,"datePublished": "2018-06-08T09:24:22.000-04:00"
,"dateModified": "2018-06-08T09:24:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ABBYLADYBUG"
,"url": "https://www.allrecipes.com/cook/1183460"
}
]
,"description": "I had this at a party at a colleague&#39;s house. I&#39;ve loved cheese grits for years, but these are by far the best I&#39;ve ever had."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ocZ6lMh5ZnJrwLDE5S7gki_A6AA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5443172-d621996cab3e43ba9f2015fe49f11cea.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cheesy Baked Grits"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "88"
}
,"cookTime": "PT70M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "267 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "56 mg"
,"fiberContent": "0 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "453 mg"
,"sugarContent": "4 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 quart milk",
"0.5 cup butter",
"1 cup uncooked grits",
"1 teaspoon salt",
"0.5 teaspoon white pepper",
"1 cup shredded Cheddar cheese",
"0.33333334326744 cup butter",
"0.5 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bring the milk to a boil in a pot over medium heat. Melt 1/2 cup butter in the boiling milk. Gradually mix in the grits, and cook 5 minutes, stirring constantly. Remove from heat, and season with salt and pepper. Beat with a whisk or electric mixer until smooth. Mix in the Cheddar cheese and 1/3 cup butter. Transfer to the prepared baking dish, and sprinkle with Parmesan cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake 1 hour in the preheated oven, until firm."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been eating grits since I was a baby I'm from South Texas fried grits eggs and bacon. But this recipe was really great because it's a mess frying grits in a skillet baking medic so much better and the milk I enjoyed it add an egg slightly beaten it was kind of like a souffle southern style. Some cornbread to fried eggs over medium bon appetit thank you for your recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bathenamarie"
},
"reviewBody": "OMg before I even put them in the oven they were delicious. Now with slow cooker short ribs we are going to be falling and full tonight. This city girl is a big fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple. Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Using the basic recipe, I thought it exceptional. I have since experimented with other additions, such as adding more garlic, adding aged British cheddar and also adding a solid tablespoon of chicken base to the initial liquid. One may also add jalapeño or chipotle to give it all a kick of spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Cut recipe in half to serve as a side dish with ribs. Usually have mac n cheese but wanted something different. Skipped last butter ingredient and used only cheddar cheese. Really liked it! Sat heavy in the belly like any homemade Mac n cheese. Will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This recipe is my go-to! I wasn’t really a fan of grits until these found their way to my mouth. Now when I make these I keep a spoon in the pan! \nI did make a couple of adjustments because of preference - the recipe still gets all 5 stars! I added two eggs, as others suggested. I add 2 small cans of chopped green chiles, drained. Lastly I use Bob’s Red Mill Yellow Grits/Polenta because they have a stronger corn flavor - like corn tortillas. If I’m being fancy I use only smoked gouda &amp; sprinkle crisp bacon on the top before serving. They freeze well. They half well. They double well. They don’t keep well because they’re eaten too quickly. Delicious for breakfast, lunch, dinner, snacks, even if you’re not hungry. I’m finished typing - off to make a pan of this yumminess. \n\n*Honestly, I struggle with reviewers who give a 1 or 2 star rating simply because they adjusted a recipe to fit their taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Illenberger"
},
"reviewBody": "Perfect just as written! Thanks, I expect to make this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tddimmick"
},
"reviewBody": "I followed the recipe except I didn't bake it. It was delicious and creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bwprice"
},
"reviewBody": "I've made this over and over for friends and family. It's always a hit! 5 stars every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon from florida"
},
"reviewBody": "I made today for an Easter Brunch. Best grits I have ever made. I adjusted the recipe to make 18 servings. Only a a spoonful left. Made it as written. Yum Yum....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie L"
},
"reviewBody": "I will definitely make them again. Used instead of plain grits for shrimp and grits with creole sauce and it was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MYWOOBIE"
},
"reviewBody": "Way too much butter. I could have done without the last 1/3 cup in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mdepuy"
},
"reviewBody": "Delicious. I added two eggs and a large spoonful of sour cream like other reviewers suggested. I found it a bit heavy so next time I won't add all the butter. But overall very yummy-my family gave it two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DelawareCooks"
},
"reviewBody": "This is the best recipe we have ever found for cheesy grits. It is smooth, creamy and everyone dives in for a second helping and there are never ever any leftovers!\n\n NOT a diet recipe, but we always make these Cheesy Grits when we are wanting to celebrate friends and family on those special nights - to heck with the diet :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrandeeMyatt"
},
"reviewBody": "Wonderful!A huge hit at my house.I did add two eggs before baking though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shauna85"
},
"reviewBody": "For the cheese portions: I used 1/3 cheddar and 2/3 gouda. I used 1/2 cup butter total (doubled the recipe). I cooked the grits in 6 cups milk (which is 1.5 quart...remember I doubled the recipe), and I used the other 2 cups milk as the needed liquid to help blend the cooked grits with the nutri-bullet (in batches). \n\nAfter blending but before pouring in pan, I stirred in finely chopped green onions and 1/3 cup sour cream. The baked result was more of a delicious polenta consistency...very dense, creamy and smokey-cheese delicious. I wish we'd had baked ham for a salty companion! \n\nNo need for an egg because it baked perfect, it was like slicing cheese cake.\n\nEdit to add: I made another batch and let it cool in fridge. We cut \"bricks\" about 2.5\"x4\" each and froze them. Now it's a clean, easy, savory, filling, hot, delicious breakfast! I wrap one in a paper towel and microwave 2.5 min. I use the same paper towel to hold/eat, then to wipe my mouth. \n\nAs I type this, I'm bubbling diced sweet potatoes in coconut milk to use in coconut grit bricks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nightfall"
},
"reviewBody": "I made these as directed, aside from adding 2 whisked eggs just before pouring into the casserole dish, and my family loved them. I confess I've never made grits before, not have I really eaten good ones, as I am from New England and they aren't popular there. I made them because I received a sack of red corn grits in my CSA share this week, so I gave this recipe a try. It was easy and undeniably delicious, if a bit heavy on fat and calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kac2research"
},
"reviewBody": "Really good. The addition of all the cheeses add good flavor. I've eaten cheese grits for years, but this is a nice variation on the basic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lms367"
},
"reviewBody": "when I got 2lbs of grits in my farm share I thought oh man, what am I going to make? I came across this recipe. after reading reviews I made the following changes\n*mixed parm and cheddar cheeses and put 1/2 cup of the mix on top\n*instead of 1/3 cup butter I used two eggs and about 1/4 cup sour cream\nmy husband and I were both eating this with a spoon out of the dish! I have a lot more grits left so I see more of this in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sparkle"
},
"reviewBody": "People always ask me for this recipe. Perfect accompaniment for nice Sunday brunch, or sports Sunday. I like garlic in my grits, so added 1 fresh minced clove. Also used 1/2 cheddar and 1/2 Monterey jack cheese because Monterey Jack melts smoother without the oily residue that cheddar often produces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Jenkins McFadden"
},
"reviewBody": "We LOVED this. I had to adapt a bit -- was almost out of milk so cooked the grits in half chicken stock, half milk, rather than all milk. Reduced the amount of butter a bit, and went a little heavy on the cheese. Came out wonderfully, with a rich creamy flavor, and all that wonderful crispy Parmesan crust on the top -- decadent! Served it with chicken creole and the family went back for seconds ...and thirds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Jukes Roach"
},
"reviewBody": "I just made this for supper and it is without a doubt the best baked cheesy grits I have ever had! Two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Pagel Boysen"
},
"reviewBody": "The only reason I didn't give this 5 stars was because it was a bit greasy. It was also a bit labor intensive with boiling then baking. Lots of butter which makes it taste great but too greasy. It got rave reviews from everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "Made it exactly as shown. It was a hit with the whole family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TBone Hunter"
},
"reviewBody": "Excellent meal. It's been a staff favorite every year, including this year's cook who at the beginning of the year said, \"there is nothing that could make me like grits.\" Gotta use sharp cheddar. Is even better with about a pound of lean breakfast sausage added. If you can stand spicy-hot, add a couple teaspoons to a Tablespoon of Tony Cachere’s Cajun seasoning in lieu of the salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Perfection - smooth, cheesy inside surrounded by a crunchy outside. These are what I want when I want cheese grits!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boomama40"
},
"reviewBody": "I cut the servings to 8 and used two eggs as many recommended. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "QUINLANQ"
},
"reviewBody": "Delicious but WAY too much butter! I will cut in half next time. Don't see the need to add an egg (as suggested by other reviewers), I liked the consistency. Might try with 1/2 milk and 1/2 water next time to make even lighter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENCONGER"
},
"reviewBody": "This is a fantastic recipe. I made a couple of tweaks because I didn't have white pepper. I reduced the salt to 1/2 tsp. and added 1 tsp. Worcestershire sauce. I also added half the parmesan cheese to the mixture and used the other half to sprinkle on top. I also deleted that final 1/3 cup butter because the 1/2 cup I already had in there seemed like enough. It came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "louavullgalv"
},
"reviewBody": "Took this to a monthly potluck and it disappeared! Got several requests for copies of the recipe, too. I now keep a dish in my freezer to have on hand if needed. A keeper in my repetoire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "buzzsau"
},
"reviewBody": "I will never again make grits using milk. Didn't like the taste of the grits. Prefer using water or chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorsonline"
},
"reviewBody": "Really liked this alot and my husband raved. Served with pork chops and succotash. I didn't have alot of real butter in the house, so I used margarine for the 1/2 cup portion and real butter for the 1/3. Used shredded cheddar/jack cheese. Turned out great--really delicious, I recommend. Followed the rest of directions to a T and the dish is a keeper. (I used Paula Deen's grits.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Hansen"
},
"reviewBody": "This was delicious! I added chopped green onion and red bell pepper and it turned into a great breakfast for a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hkm1998"
},
"reviewBody": "Good recipie! My mom makes baked grits every year for Christmas morning / brunch ( I think because she can bake them the nite before, and then just heat them up). This recipie is very close to hers. I def think it needs at least one egg. The Parm Cheese is a nice touch, but I prefer cheesier - so I added extra cheddar. My kids LOVE baked grits. Happy cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "McCrearyacres"
},
"reviewBody": "I love grits &amp; my kids hate them, so I am constantly trying new recipes to entice them towards my way of thinking. This is the closest I've come to getting them to \"like\" grits. Really good flavor, not too runny (one of their previous complaints) &amp; the baking adds a nice crunchy golden brown topping. My only downside to the recipe is that the liquid amounts (for the grits I used) was off. I had to add about a 1/2 cup more liquid (I used chicken stock) to make them creamy enough so that the baking didn't dry them out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenifer"
},
"reviewBody": "The only change I made to this was to add some shredded parm right into the mixture. I never measure cheese, so I just added to taste. I didn't add any eggs.....if you cook it long enough, it isn't needed. I was scraping the pan and licking the spatula after putting in into the oven.......these are SO good! I'm serving with saute of shrimp, tri color peppers and onions. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "morgan"
},
"reviewBody": "These were quick and easy. I baked them for an hour and the middle still wasn't set up. I took them out anyway because I like my grits a little soft and the top was very brown. I used non-fat milk and only 2 Tbs of butter. I used 1 cup of cheddar mixed in and about 3/4 cup parm/asiago mix on top. I also grated 1/2 an onion and 2 cloves of garlic, which I cooked until translucent before adding the milk, butter, etc. They turned out great and I didn't miss the extra butter. However, next time I will use sharp cheddar for a stronger cheese flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "squawk93"
},
"reviewBody": "These are trouble (in a good way). I liked that I could make them ahead, and that they were easy to assemble. They were a welcome alternative to mashed potatoes. Tonight I served them with braised oxtails. The only change I made was to omit that final 1/3 cup butter at the end....the first 1/2 cup already felt like pushing the envelope butter-wise (I did use whole milk, though)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Tung"
},
"reviewBody": "So yummy! I make it regularly to go with pork chops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "These are a little more time-consuming than regular grits, but worth it. The cheeses, especially the parmesan were a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Coile Galloway"
},
"reviewBody": "A BIG hit. I also used 2 eggs. I added more Cheddar and put in a little Swiss rather than Parmesan. And, I added a little bag of real bacon crumbles. It was REALLY good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani S."
},
"reviewBody": "Great flavorful side dish! The entire family LOVED them!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkaeekj"
},
"reviewBody": "My husband and kids enjoyed this...I used it as a main dish and served with steamed broccoli. I also only used 4 tbsp of margarine (not butter) in the whole dish and didn't add any extra when the cheese was mixed in....wanted it make it a little lighter, plus I was worried that it would turn out greasy. I also didn't have time to bake it until it was firm....I had it in the oven for about 35 minutes, and it turned out fine. It's a economical dish when used as a main course, and not too terribly unhealthy if adjustments are made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHARON8799"
},
"reviewBody": "100 STARS! These are definitely the BEST grits I've ever had, and I credit that to cooking them in milk. I can't believe in all the years I've been making grits, I've never cooked them in milk. Dee-lish and makes such a difference!! I had to substitute American for the Cheddar (all I had on hand) and mixed the Parmesean in since others said it got crusty on top. This is now my only way to prepare grits, and I WILL have Cheddar on hand next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin"
},
"reviewBody": "This casserole was GREAT! I've been searching for a grits casserole that isn't runny and think I have found my \"keeper.\" I doubled the recipe and followed exactly, only substituting asiago for the parmesan. It fed 17 college students with only a spoonful left. They all gave it rave reviews! I noticed several reviews recommended adding eggs - I didn't find this necessary. The grits were firm and had a perfect consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funnydutchess"
},
"reviewBody": "I am from the south and have never developed a taste for grits. My Yankee husband, however, is enamored with southern cuisine. I made these just for him, and now this is one of my favorite recipes. I absoultely loved this. The flavors are rich and the texture is perfect. They went great with crabcakes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Glendon"
},
"reviewBody": "Next time I'd cut the butter down by quarter. Otherwise, this was incredible as the base of a short-ribs plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "best grits EVER. I'm not a grits fan at all, but my hubby sure is.. I made them as treat for him and I ended up devouring them! I plan on making again as a side dish. I scaled down the recipe to 6 people and the conversion was perfect.. this will become a household fave.. the fresh parm on top was the best, nice and cruchy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angel"
},
"reviewBody": "I used broth opposed to milk, adding great flavor and reducing the cost. I also added garlic and paprika!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "This was just ok to me. I wouldn't make it to serve company unless I knew someone absolutely craved grits. I will keep it on hand for that reason, until I would find a tastier replacement."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Utley Pepin"
},
"reviewBody": "Excellent! I also bake it in a 9x13 pan and cut into squares to serve as an appetizer!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCUTRIGHT"
},
"reviewBody": "Really liked this as a side dish for dinner. Didn't have the parmesean, but had an Italian blend for pizza, which I substituted on top. That crunchy cheese layer on top added a lot of flavor. I think this really needs to cool off quite a bit in order to taste the cheese flavor of the grits, so I recommend cooling for a good 15 minutes before serving. I will definitely be making this again and maybe adding chopped bacon and scallions next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kendra"
},
"reviewBody": "I scaled this recipe down to about three servings. I think this makes it firm up more, because there's no need for an egg. The only thing I would do different is reduce the amount of parmesan, and put some extra cheddar on top. Maybe it's because I didn't have fresh parmesan, only the kind that comes in the plastic bottle. Anyway, this deserves bonus points because it's so easy and inexpensive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FlamingJune"
},
"reviewBody": "I'm giving this 4 stars because I might make it again if I'm looking for something a little different, but this recipe wasn't a big hit. It did get eaten, but no real \"yummy\" comments. It seemed really dry to me, so next time I might add a little more milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melzee"
},
"reviewBody": "Absolutely Delicious! \nThey are officially a Thanksgiving tradition now... everyone loved them! \nAnd a plus for being SO easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brulu01"
},
"reviewBody": "This is delicious. I followed others advice and used an egg (haven't tried the recipe without it). I also use smoked cheddar. My husband and friends love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOELASSES"
},
"reviewBody": "I've made these multiple times now. My boys love them as an alternative side dish to mashed potatoes or rice. They don't like the cheese melted on top, so I incorporate it into the grits before baking. Even then, they are inclined to scrape the little bit of \"crust\" that develops anyway. The cheesy layer tastes good to me, but for whatever reason, they both have an aversion to it. This is a great and versatile recipe. You can try different cheeses and experiment with different spices or flavorings. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "YUM!! These are awesome! To reduce fat I omitted the first round of butter and only added about half of the second. I also wonder if it couldn't partially be made with chicken stock to reduce fat. \n\nAdded 1 egg (I scaled recipe to 9) and mixed some of the parmesan into the cheddar as well.\n\nServing with Grilled sausages and brocolli. Will update when I make with chicken stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANASTASIAJANE"
},
"reviewBody": "Excellent sidedish casserole! I added 2 eggs and a big dollop of reduced fat sour cream. It cooked in about 35 minutes. Even the kids liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxy"
},
"reviewBody": "These are awesome! I didn't make any changes and they turned out yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULIAJOHNSON"
},
"reviewBody": "loved it! I also added 2 eggs like a previous reviewer mentioned. grits couldn't get any better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHELS"
},
"reviewBody": "This was my first attempt at making grits, and for the longest time I haven't known what they are -bear in mind I am from Canada's East Coast-. We didn't have fresh parmesan on hand, so I improvised and used grated asiago, and ended up cooking this in a casserole dish. Still tasty even with the alterations, thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennifer"
},
"reviewBody": "EXCELLENT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Very good. Though I did add additional cheeses and a little garlic powdered for an extra kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I modified and made with polenta--was good and very rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mochi Puffs"
},
"reviewBody": "These were pretty good. I used two eggs as suggested (it definately needs them) but other than that, made the recipe as is. I will definately make these again but next time I think I will divide the parmesan, mixing half of it in with the cheddar cheese and using the other half to sprinkle on top. I thought the cheese on top was much too thick. Overall, a great dish! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaykay"
},
"reviewBody": "I prepared the recipe for 8. I baked it in a 2.5 quart casserole, so it was pretty thin. I tested for doneness with a toothpick and cooked it for 45 min. My guests raved about it...next time, I'll put more parmesan on top and may try adding 2 eggs as another reviewer suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melody"
},
"reviewBody": "Intersting texture, but very good. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Navy_Mommy"
},
"reviewBody": "These are good, but I have had better baked grits recipes so I didn't give them five starts. I reduced to 4 servings and baked in a 8 inch loaf pan. I also used fat free milk and 50% low fat cheese, I forgot the parmesan. The grits do have a firmer texture than they normally would and they were great where the outside and top got crispy. My 4 yo who loves cheese grits wouldn't eat them though because she didn't like the crunchy parts (where I thought they were best). My husband refuses to even try grits. He took a bit of these and said, he would eat them again. However, he still ate a baked potato for dinner rather than the grits. I will probably continue to look for another recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATEFOODFUN"
},
"reviewBody": "This was pretty good, I'm glad it used real cheese and not processed. My husband gave it 5 stars, which is high up in his ranking, as his mom is truly southern and makes cheese grits for every one of his birthday celebrations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cardamum"
},
"reviewBody": "Interesting and yummy. These weren't runny like grits I've had before (let me freely admit now that I've only rarely had grits; I have no idea how they're \"supposed to\" be). I can see why the previous reviewer added eggs and I think that'd be a good addition, but it turned out fine without. I served these with breakfast foods, but I think this would also be good for dinner with pork or chicken or even on the side with chili instead of corn bread. I also think this recipe would be good with some hot peppers or hot sauce added to spice it up. Thanks for the recipe, you've convinced this yankee to make grits again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ELFINDANCER"
},
"reviewBody": "I really love this recipe. I moved to the South a few years ago and have been looking for a good recipe like the cheese grits they serve at some restaurants here. The only change I made was stirring in 2 eggs before cooking. My family just loves this recipe - great comfort food!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76181/cheesy-baked-grits/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/223/side-dish/grains/",
"name": "Grain Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16769/side-dish/grains/polenta/",
"name": "Polenta Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76181/cheesy-baked-grits/",
"name": "Cheesy Baked Grits"
}
}
]
}
}
, "about": [
]
}
]