				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cheesesteak Egg Rolls"
,"datePublished": "2019-04-02T02:49:10.000-04:00"
,"dateModified": "2019-04-02T02:49:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "brandi380"
,"url": "https://www.allrecipes.com/cook/1955549"
}
]
,"description": "This appetizer combines two great favorites. It&#39;s a crispy egg roll on the outside, with a delicious cheesesteak filling on the inside."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v9GIayPAecTZVk56KW36Gxk6Oec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1437348-a5c8efb414854c1d9858fac03c118f33.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cheesesteak Egg Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "82"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "779 kcal"
,"carbohydrateContent": "66 g"
,"cholesterolContent": "106 mg"
,"fiberContent": "3 g"
,"proteinContent": "39 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "1213 mg"
,"sugarContent": "6 g"
,"fatContent": "39 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"1 onion, chopped",
"1 (12.5 ounce) package frozen sandwich steak meat",
"1 (14 ounce) package egg roll wrappers",
"4 slices American cheese, halved",
"2 cups oil for frying, or as needed",
"0.25 cup ketchup" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat skillet with the tablespoon oil over medium heat. Add onion; cook and stir until onion is translucent, about 5 minutes. Break frozen steak pieces into skillet; cook and stir until steak is no longer pink, about 10 minutes. Remove from heat and set aside."
} ,{
"@type": "HowToStep"
,"text": "Arrange egg roll wrappers on a flat surface; place a half slice of cheese on each one. Layer an equal amount of steak mixture on top of each cheese slice. Roll up egg rolls according to package directions, and seal edges, wetting with water if necessary."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 inch of oil in a large skillet, or preheat a deep-fryer to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Fry the rolls in the hot oil until golden brown on all sides, about 5 minutes. Remove; drain on paper towels. Serve warm with ketchup for dipping."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oalphacash"
},
"reviewBody": "One of my favorite and plus the kid loved them .she ate 6 I only had 2 lol.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Xavier Walker"
},
"reviewBody": "Awesome recipe! Used Airfryer!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RusoJap"
},
"reviewBody": "These were decent but not great. I would have rated it lower except I couldn’t follow the directions as is since I wasn’t able to find egg roll wraps. I used the spring roll wraps as suggested by others but it just wasn’t very good. They were pretty bland and definitely needed seasoning, and only half of the room even tried them because they looked so bad. Granted, mine turned out looking nothing like what was in the pictures. Two of the people who ate them said they really enjoyed them, but very few people had more than a bite. But I don’t imagine I’ll ever try making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djdsouff"
},
"reviewBody": "Just used the recipe as a guide as far as ingredients but it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GrumpyD"
},
"reviewBody": "I make these and cook in an air fryer. They are wonderful, I use ranch dressing to dip in but other then that no change. You can use any cheese that you like I have even graded the cheese and mixed with the meat. Great for an appetizer or combine with something else for a meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene Buchina"
},
"reviewBody": "These were fabulous. Big hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CheffM..."
},
"reviewBody": "Made these tonight,came out pretty good. Tweeking the recipe slightly. Once I prepared the filling and rolled them up ,I put them in the frig for 15-20 mins. They fried up well , and wasn't oily at all. I actually made two kinds, pastrami and Swiss, and Philly cheese steak. Both were a hit if I must say. Next time I might add sourcrout to the pastrami with Russian dressing,to give it a Rubin flare..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Klorer Jagneaux"
},
"reviewBody": "Fairly easy to make, and tastes great! My husband loved them. It took me a few hours to put them all together and then fry them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charmae bautista"
},
"reviewBody": "These were amazing! Only difference is I added some peppers. I would add more cheese, as they dried out a little and wrap the steak around the cheese so it doesn't stick to the wrapper and has a more gooey texture. Overall really great! Served with ketchup as well as sriracha."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lostlittlefairy"
},
"reviewBody": "I wish I could've found some spring roll wrappers to make this instead but unfortunately, those are hard to come by in the typical grocery store so I stuck with regular egg roll wrappers. These were great. I also tried using the Steak-umms Chicken instead of steak and it was even BETTER! I used cheddar instead of American cheese. Thanks for great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ant W"
},
"reviewBody": "I'm from Philadelphia and tried almost every famous steak place in the city. So I decided to try these and they did not disappoint. I followed the recipe exactly and it came out perfect. This recipe will be a must for game days at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cturner0132"
},
"reviewBody": "I recommend slicing these in half after they come out of the fryer, and then squirting some cheese sauce on them! Gives it a more authentic flavor than just stuffing with sliced cheese. And I wouldn't use american cheese, use cheddar and provolone, or cheddar and Monterrey jack, for a little kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WonderWoman"
},
"reviewBody": "Big Hit! Easy and oh' so yummy! Will absolutely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "staciw"
},
"reviewBody": "I liked this, but would not use the \"fake steak\"-would take the time to chop some sirlon etc. up. Added red peppers and onions. The eggroll wrappers are a little big. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "Very, very good! The recipe was easy to follow and the rolls came out excellent. The only thing different I did was to use different cheeses and they all were excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "starbucks68"
},
"reviewBody": "Just made these for dinner. They turned out perfect. I used two wraps, added red and yellow bell peppers, sharp cheddar cheese and quality chipsteak meat. Fabuloussssssssss"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Fantastic! I made these the way I like my cheesesteaks of course, and I used fresh shaved steak, added pickles and extra cheese. These are a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "I did not fry them and used chicken cheesesteaks.....just plunked the mix on a toasted roll....the family scarfed em down and was looking for seconds. Chicken cheesesteak is kinda bland....cooking the onion up with it is just what it needed. Instead of dipping in the ketchup I just put the ketchup on the sandwich. Big hit here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "My hubby loves these. They don't sell frozen steak sandwich meat here, and it was really hard to find a meat to use instead. I ended up buying about 6 packs of the thin raw beef used for \"rouladen\" and seasoning it with salt and peper before cutting into strips. I then put 1 onion, chopped into my slow cooker and topped with the meat and one more chopped onion. Then added a head of garlic, minced mix with 1/4 cup water and a pkg of beef boulion. Then I slow cooked it on low for about 4 hours. Then I drained the juices (saved to make gravy or beef stock for something else) and filled the egg rolls as stated, using cheddar cheese. Then to cut back on fat I baked them at 350 for about 18 mins. Good will do again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "Wow, this a great appetizer...the only change I made was to serve it with pizza sauce instead of ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "YUM! I used 3 'Philly style' steaks and added the onion, green pepper and a can of sliced mushrooms. I seasoned it with salt pepper, and garlic powder while it was cooking. I used a combo of mozz. and provolone cheeses. this was super fun and different and we all loved them! Served w/ a side of ranch and 'Roasted Onion Mayonnaise' (from this site) for dipping. Will make again! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msty_bzr"
},
"reviewBody": "Made for New Year's and they were delicious. Will be using this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babytia"
},
"reviewBody": "These egg rolls are awesome,and for those of you who don't know how to cook, you have to really drain the grease out of the steam-um's before filling the egg rolls. I also cut up some green peppers &amp; onion and cooked them until they were soft and tender and added them to the meat prior to rolling in the egg roll wrappers. My family enjoyed them and I also carried them to work and they were a big hit. You can use Ketchup or Miracle Whip as a dipping sauce or whatever else you might like to dip them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nellie"
},
"reviewBody": "This was wounderful! The family loved it! I never heard of this before and I went to the store and got the ingredients spring roll skin was all I could find. I also used steak ums from the freezer aisle at frys. I added green pepper some jalapeno and salt pepper garlic salt to the onions. I used pepper jack cheese and provalone sandwich the meat mix in the middle of the cheeses. Then fryed it. we use aujus for dip it was great! The family ravedddddd about it! They went back for more! This is something great for house party we are loving it and give it thumbs up!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Foster"
},
"reviewBody": "Perfect for football Sunday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "merina"
},
"reviewBody": "Yum! I added mushrooms, used mozzarella and used spring roll wrappers but however you do it, you can't go wrong! I had at a restaurant before and they definitely compare!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jctnact"
},
"reviewBody": "I rate this recipe 3 stars as written. I added mushrooms and bell peppers to my meat and I rolled in spring roll wrappers. I also baked them instead of frying. I dipped them in a ketchup/mayo dip and they tasted awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "microwavequeen"
},
"reviewBody": "I changed it up a bit. I sauteed onions, garlic and red and green bell pepper(if I had mushrooms I would have used that too), sliced leftover steak and used shredded cheese. It was delicious and so easy! My husbands co-worker was asking for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Girlofmayhem"
},
"reviewBody": "These eggrolls were delicious and got rave reviews. But next time I will add more cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessica gomber"
},
"reviewBody": "WOW!!! These were great!!! My family loved them. I used egg roll wrappers only because I couldn't find spring roll wrappers. I deffinately want to find some and try those, I bet they would be even better. The egg roll wrappers were a little much, but they were still great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Robyn Nadler"
},
"reviewBody": "Way too greasy. I couldn't even eat them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Tinker"
},
"reviewBody": "I made these and added muchrooms and Montreal Steak seasoning..I also used provolone cheese. These were the best..Thx for the recipe. Out of all the recipe sites I have visited on the internet, AllRecipes is the best. I have used soooo many great recipes from here. This recipes is just one great example."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARAPPII"
},
"reviewBody": "These were really good! Both of my kids, one of which who can be really pick ate them too! Mine didn't turn out greasy at all. I made sure to drain the meat mixture before adding it the wrappers. I did add garlic seasoning, pepper and just a little onion powder. Next time I think I will try adding green peppers and jalapenos to give them a little extra kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lrbanks"
},
"reviewBody": "I made these last night, and they were a big hit! I changed a few things; I used thinly sliced select cut steak, seasoned and sauteed on a bed of onions, green &amp; red bell peppers. I heated the oil while rolling the egg rolls.(make sure your oil is extremely hot) I used spring rolls, and the crispness of the thin roll was absolutely delicious. I also used mozzarella as well as provolone and brushed the ends of the roll with egg so it would stick, deep fried it until golden brown.. Served with ketchup and a beer. Amazing!!! Definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Pep"
},
"reviewBody": "My local grocery store didn't have egg roll wrappers so I used won-ton wrappers. Some were ravioli shaped (square), some were triangles, and some were actual won-tons. No matter what shape they were, they were delicious!!! I omitted the onion and just used steak and American cheese. They didn't last long enough to be dipped in ketchup! Will definitely make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "middleGAgirl"
},
"reviewBody": "My family thought I was crazy when I first told them what I was making but they were all singing a different song once they tried it. They were very good. I need make some changes after reading the reviews. First of all, I can't have a Cheesesteak without bell peppers so I added chopped green bell peppers to the onions. After reading a lot of people saying they were very greasy I drained my meat mixture in my strainer. Then, to make sure I got as much grease as possible; I placed the meat mixture on stacks of papertowels with another stack on top. Absorbed as much grease as possible. I then add salt, pepper and garlic powder to taste. Glad I did, think they would have been bland without it. I also used provolone cheese. I was going to make half with egg roll wrappers and half with spring roll wrappers to decide which one we liked better. However, my local Asian market only had spring roll wrapper. They were prefect with the spring roll wrapper, wouldn't think of changing it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragraced"
},
"reviewBody": "Awesome! Since I added sliced mushrooms to the pan I used a little bit of butter instead of the oil (I think mushrooms taste better in butter). I also added a little garlic, seasoning salt and ground red pepper. I then used mozzarella cheese instead of American. Next time, I might add a little diced green bell pepper or I may use some canned Cheez Whiz like some of corner eats in Philly ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Erwin-Larson"
},
"reviewBody": "I used Swiss Cheese and it was soooo good, great recipe Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jetnang"
},
"reviewBody": "Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamelp1"
},
"reviewBody": "cant rate them for I have not tried them, I will they sound good. Just wanted to comment on a couple of bad reviews for them being oily or greasy. If those people learn to fry by getting oil to proper temp. before cooking they probably would have had a much better experience, dont knock someones recipe cause you cant cook that is your fault not theirs. Thank you...............I gave the recipe 5 stars so not to damage the average"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnny Fuentes"
},
"reviewBody": "TIPS: For the best results; deep fry &amp; ensure oil is at least 350 degrees raising temp as you add more to keep temp at this level; use frying thermometer. Stuff with your choice crunchy peanut butter, jam, bananas, or other fruit for dessert egg rolls. For Italian, use \"Italian\" components; Mexican, same. By using this method your egg rolls will not come out soggy and oily. Great recipe for kids &amp; parties. Must eat immediately, will not hold!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "After reading the comments about greasiness I wonder if you could spray them well and bake in the oven. I have done this with regular eggrolls and it works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly21602"
},
"reviewBody": "Very good, and VERY easy to make. My only problem extremely greasy, but I kinda knew it would be like that anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Grocerygirl71"
},
"reviewBody": "I work at a restaurant who has Philly cheesesteak egg rolls. I absolutely love them and have been looking for a recipe that's similar. I know they won't be exactly the same but i made these tonight and really did not care for them. They were extremely oily. I hate to give a bad review on someone's recipe but I think they would be better if you used thinly sliced ribeye steak. Better luck next time. Sorry.:-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetNov88"
},
"reviewBody": "Used Steak-ums for the meat. Added some onion and mushrooms. Used mexican cheese with jalapenos. Super yummy. Many different ways to change it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knightzag"
},
"reviewBody": "Delicious. Only difference is that I made in air fryer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Very easy recipe to make. The only thing I would do differently next time is I would make sure I secured the egg roll wrappers better. Some of them started to open and then the insides were oil-logged."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ealanna"
},
"reviewBody": "I was actually looking for a recipe for cheeseburger spring rolls that I had tried at an event I recently attended. I could not find it anywhere- so I substituted 1 lb of ground beef for the steak meat and spring rolls for the egg rolls and wow! Exactly the delicious taste I remember! Very easy to make and quite a hit with the entire family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Yummy! First time making any kind of egg rolls. Easy to make, kids loved them! Very filling, I could only eat one and a half. Kind of oily, maybe I didn't drain them well enough? Kids say it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ren Causley"
},
"reviewBody": "Easy to make and pretty tasty made the whole pkg and they were gone in no time, I did follow others and added a little more seasonings and used provolone cheese that I needed to use up thanks for sharing will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRYSTROM"
},
"reviewBody": "These were yummy and very simple to make. You can do so much with them. I followed the recipe exactly this time but next time I want to try using flour tortillas instead of the egg roll wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion Reynolds"
},
"reviewBody": "I made this for the first time and everyone loved them! I did make a couple of changes. I used roast beef(deli) and provolone cheese. These were fantastic! Will definitely make again, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Seal"
},
"reviewBody": "My husband and I loved these! We have tried it all diff kinds of cheese!! I put them in a big bowl so they can drain really well for a few minutes and I get mine with horserashish sacue it's awesome it deff gives it a kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IndyKaren"
},
"reviewBody": "YUM! I added mushrooms and used mozzarella cheese. Holy cow, these were good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Valdovinos"
},
"reviewBody": "awesome recipe!! I have 2 grown men at my home and they completely loved these rolls!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlyn"
},
"reviewBody": "These. Are. Amazing. I did a few things differently: I added mushrooms, I used Mozerella cheese instead of American, I wrapped them in spring roll wrappers instead of egg roll, and I dipped them in Ranch. They were incredible!!! The Ranch really brought it together, I highly suggest giving it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Chizik"
},
"reviewBody": "I made these for my son's first birthday. The theme was sports, so our foods were foods you'd find at a sporting event (we live in Philadelphia). So I loved the twist on the classic cheesesteak. They were fabulous! I couldn't keep the plate stocked fast enough. Everyone was raving about them. A few tips - make sure your oil is VERY hot. My first batch came out a little soggy inside because the oil wasn't hot enough. Also, for a party if you don't fry them ahead of time, you're going to spend a lot of time in front of the stove and not with your guests. These could easily be made ahead of time and then put in the oven for a few minutes to warm up. SUCH A GREAT RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Buttafuoco"
},
"reviewBody": "This one made me giggle! I never made egg rolls before and now I think I will try and stuff those wrappers with everything &amp; anything I can get my hands on. It was sooooo easy. First with this recipe I added garlic &amp; bell peppers along with some garlic sauce and A1. I usually add some Pizza sauce but I didn't have any. I also used two wrappers for each roll and I will defintely be doing that again. This recipe gave me some inspiration. IT is a basic recipe that you can easily make yours by adding what you enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMMYC"
},
"reviewBody": "I made these for a New Years Eve Party and they were absolutely delicious. Every one wanted more. I used provolone cheese and a three pepper/onion blend. I made ahead and reheated before party and they were excellent. I plan on making several to freeze and have on hand. We served ours with ranch dressing to dip them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I made these for a super bowl party last year and they were a huge hit! I added garlic powder and salt and pepper when I was frying the meat to add a little something. And I made a dipping sauce with mayo and horseradish to go along. So delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pinupmama09"
},
"reviewBody": "This was really good me and my husband enjoyed it! I just fryed the steak and added chadder cheese, only because my hubby cant have onion or other veggies. it was simple and really easy, took no time.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Jones Bulsza"
},
"reviewBody": "I liked this recipe, but found that the egg roll wrappers were a little too thick. I used the thinner spring roll wrappers brushed with egg yolk, and put steak umms, onion, provolone and american cheese in the middle. This was a great start, but I think the choice of the wrapper makes all the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "speaktrue"
},
"reviewBody": "I used small pieces of diced steak left over from last nights meal. added red onion and shredded pepperjack cheese.\nspectacular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookin'mamma"
},
"reviewBody": "A great idea! I never thought to put 'something else' in an egg roll wrapper.. I sauteed onions &amp; garlic then added the jullienned beef to warm. I used provolone cheese and served them with au jus. So many possibilities.. The men loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather595"
},
"reviewBody": "These were delicious! When I made them I added a few things. I added some chopped mushrooms and minced garlic to the onions as they were cooking. While the beef was cooking I seasoned it with some seasoning salt. I also substituted provolone cheese for the American cheese. All in all very tasty!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/142404/cheesesteak-egg-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
"name": "Wraps and Rolls"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16366/appetizers-and-snacks/wraps-and-rolls/egg-rolls/",
"name": "Egg Roll Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/142404/cheesesteak-egg-rolls/",
"name": "Cheesesteak Egg Rolls"
}
}
]
}
}
, "about": [
]
}
]