				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cheesy Amish Breakfast Casserole"
,"datePublished": "2020-05-06T22:13:53.000-04:00"
,"dateModified": "2023-02-27T11:42:24.108-05:00"
,"author": [
{"@type": "Person"
,"name": "parothstein"
,"url": "https://www.allrecipes.com/cook/parothstein"
}
]
,"description": "This Amish breakfast casserole has bacon, onion, hash browns, eggs, and 3 types of cheese baked into a hearty, comforting dish, perfect for a crowd."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UFs7ZHHY628v7C38IpU-qwsQrho=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/229150-cheesy-amish-breakfast-casserole-mfs-69-50581a15cf934f868f070807b0f2b363.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2612426752001",
"description": "See how to make a cheesy breakfast casserole with bacon and hash browns.",
"duration": "PT2M59S",
"name": "Cheesy Amish Breakfast Casserole",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/02/18/229150-cheesy-amish-breakfast-casserole-mfs-65.jpg",
"uploadDate": "2020-12-03T08:40:38.018-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cheesy Amish Breakfast Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "917"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "314 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "188 mg"
,"fiberContent": "1 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "609 mg"
,"sugarContent": "1 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound sliced bacon, diced",
"1 medium sweet onion, chopped",
"9 large eggs, lightly beaten",
"4 cups frozen shredded hash brown potatoes, thawed",
"2 cups shredded Cheddar cheese",
"1.5 cups small curd cottage cheese",
"1.25 cups shredded Swiss cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat; cook and stir bacon and onion until bacon is evenly browned, about 10 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Transfer bacon and onion to a large bowl. Stir in eggs, potatoes, Cheddar cheese, cottage cheese, and Swiss cheese. Pour mixture into the prepared baking dish."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UFs7ZHHY628v7C38IpU-qwsQrho=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/229150-cheesy-amish-breakfast-casserole-mfs-69-50581a15cf934f868f070807b0f2b363.jpg"
}
]
,"text": "Bake in the preheated oven until eggs are set and cheese is melted, 45 to 50 minutes. Let stand 10 minutes before cutting and serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this many times over the years and it never fails to satisfy. i work in construction, and often have to leave early in the morning and have long drives to work (2 hrs). as a result i have very little time to eat at home and have to eat on my drive. i can cut this into 6 square portions, refrigerate or freeze it, and have it ready to go in the morning. it holds together very well and can be hand held. gives me a good breakfast before work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikemaritch"
},
"reviewBody": "My family absolutely loves this dish! I have made it three times since discovering the recipe, last month, and I think my favorite thing about it(besides it being delicious)is how versatile and customizable it is. I have used different cheese, used ham instead of the bacon once and use a shallot instead of an onion to give it a more subtle flavor. don't be afraid to make this dish and play around with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily B"
},
"reviewBody": "This is incredible! I do not usually like the texture of these type casseroles at all, but this one was different. I read lots of reviews and ended up making 2. The first one I used the \"crispy crowns\" air fried until very crisp and then added to the bottom as a \"crust.\" I cooked a small amount of spicy sausage and onions and then added drained rotel, onions, garlic, green chiles, dry mustard, white pepper, and the \"real\" bacon pieces from the bag (because I didn't have regular bacon) in a skillet. I added the eggs (9), cottage cheese, mozzarella in place of cheddar because that's what I had, and topped it with sliced colby-jack in place of the swiss. In the second one I omitted the potatoes to keep it low carb and plan to use low carb tortillas and add colby pepper jack when I warm them and use the casserole and Cholula chipotle sauce to make spicy breakfast burritos! Thanks for the flexible recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cuozyswissies"
},
"reviewBody": "I made this for a company buffet and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "I make it on Christmas Eve and I cook it Christmas morning. Everyone loves it!!! I use sausage instead of bacon. It’s became a family tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Goke"
},
"reviewBody": "This has been one of my solid go-tos for years. I use it at holidays, potlucks, and brunches. It's always a hit. I fnd that the recipe as presented is a little too bland. I always fry up the hash browns &amp; cool before combining with other ingredients. I also add a couple Tbsp chopped fresh garlic, salt, pepper, paprika, and McCormick (?) Montreal steak seasoning blend. I've changed up the meat to include turkey or regular sausage, bacon, or ham. I've done all 3 at once to total up to 1 pound of meat. Depending on what I have in the kitchen, I try to add some veggies for color, texture, and flavor. I've tried red or green bell pepper, mushrooms, green onion, parsley, and fresh chopped green chile. I add &amp; cook these with the onion and garlic and spices, then cool. I add more eggs and/or cheese to adjust if mix becomes too thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca"
},
"reviewBody": "This is my go to recipes for tailgates, holidays, vacation. I follow the recipe as is, but make it with breakfast sausage as my family prefers sausage to bacon. I also add pepper and Tony's for a little extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing! My family is always asking me to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dunncook01"
},
"reviewBody": "Was very bland. I used fresh shredded potatoes. Perhaps that's why. It has all the perfect ingredients to be awesome. Mine just wasn't :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty2007"
},
"reviewBody": "This was outstanding! Very creamy, cheesy, and delicious! I was wondering about the whole cottage cheese thing, but it turned out wonderfully -- I'm guessing because that provided the dairy to the eggs that you normally get with milk or cream. Everyone had 2nds when I took it to work, and the 6 person team ate an entire 9X13 pan. I will definitely make it again! I added an 8 oz pkg of sliced mushrooms to the party (sauteed first), and did mine with 1/2 bacon and 1/2 sausage. Because I added items, I also added 3 more eggs for an even dozen and it worked out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful flavor. So easy to make. Only addition I made was a tsp of white pepper and tbsp of dried minced onion and 3 cups instead of 2 cups of shredded cheddar. Made it for brunch and everyone loved it. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was one of the best overnight casseroles I’ve ever made ! Followed the recipe exactly except I browned the hash browns before cooking and used them as the crust and I also added salt and freshly ground black pepper to the mixture. Absolutely OUTSTANDING… the whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "Something about the texture of the shredded potato was odd to me and I had trouble getting past it. I'd recommend using diced hash browns instead (maybe precooked a bit to make sure they're completely done). For some reason I think I expect shredded hash browns to always be nice and crispy, and this felt like it was shreds of cheese that didn't melt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Love that you can add anything you have on hand and it still turns out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was really nervous about the cottage cheese but it def helped the texture and moisture. This really wasn’t that cheesy so some cheese on top could help because it was actually a little dry but maybe I cooked too long? Awesome base recipe to use and add your own fixings to. It’s really not a lot of meat either so I ended up throwing in some pre cooked sausage crumbles (about a cup) just to make sure it was hearty enough. I served with tomatoes, green onion, and avocado on sourdough with Louisiana hot sauce. I did also broil the top at the end cuz the bottom felt done but the top hadn’t gotten that nice color yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Always Hungry"
},
"reviewBody": "Pro tip: Saute a poblano with the onion to add a little smokey heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Absolutly love it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonclark"
},
"reviewBody": "I make this exactly as stated every time, and it's perfect. One of the few recipes I haven't changed / modified. Everyone who eats it loves it and asks for the recipe :) Thanks for a great breakfast recipe that is hearty / filling, and it never gets old."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Miles"
},
"reviewBody": "This is so delicious and easy. I used ricotta cheese instead of cottage and it was truly exceptional! Will make again! And again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Loved this, made a few additions.. Added a little Jimmy Dean Sausage I had left over, sautéed a red pepper with the onion, used 12 eggs instead and used pepper jack instead of swiss. Boys loved it and there is hardly any left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karole BertramCarroll"
},
"reviewBody": "Heading out this week for a month in AK. So this was our PLUMBER breakfast. It did just that...everything in our fridge but the kitchen sink...everyone raved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this last night and made no changes. We all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "Great for company! Delicious! I cut the recipe in half, perfect for 5-6 people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vdeel"
},
"reviewBody": "Huge hit without everyone I’ve made this for. Quickly becoming a go to receipe. Always received with great compliments and easy to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy J Hahn"
},
"reviewBody": "It turned out amazing. One of the best simplest casseroles I’ve made. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grammie"
},
"reviewBody": "Found this when looking for a gluten free recipe for guests. Amazing and will make frequently. Made some changes as previous reviewers suggested - used sausage per hubby's request, added a few chives for color, used potato rounds instead of the hash browns, and 12 eggs. I layered potatoes, sausage, cheeses and poured eggs over. Would definitely combine eggs and cheeses next time - didn't like the finished look. 50 minutes was perfect baking time in glass 9x13."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super easy and really really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MC"
},
"reviewBody": "I made it for Easter breakfast and we ate some for three days after! My husband loved it! Easy to make! It was a good change from my sausage casseroles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So good! Assembled the night before and cooked the next morning. Will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bjensen369"
},
"reviewBody": "I love, love, love this recipe! I have made it now 3 times; each time I change it a bit (different meats or cheeses). This Easter my husband suggested cubed hashbrowns instead of shredded; he was right! The casserole was amazing, again! So glad we double the recipe, it's just as good reheated the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMMIE HERT"
},
"reviewBody": "This is definitely one of our favorite breakfast casseroles! I will change it up and use sausage or ham or sometimes all three!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome recipe used bacon, next time I may try sausage or both. Could not find Swiss cheese so I used cheddar cheese and Monterey cheese. Also used hash brown potatoes with peppers and onions, all together shredded in freezer area at store. This recipe is so transitional, you could add any other ingredients to make it impressive for your guest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Hickman"
},
"reviewBody": "Definitely precook the hash browns a bit until they start getting a bit brown edges. I added in a half of an orange bell pepper and half of a tomato both diced and cooked with the onion bacon mixture. It added a bit more depth and well help clear out my fridge at the same time. Super easy! The precooking of the hash browns took off about 8 minutes of my cook time once the egg mixture is added. Since I precooked the hash browns while I was working on the onion mixture it didn’t take any extra time in the kitchen. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "If I showed up on Easter Sunday without this casserole I’d be sent home! I’ve made it about 15 years in a row. It’s the best I’ve ever had as a breakfast casserole, and a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Traditional Christmas morning breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Lowry"
},
"reviewBody": "Hearty and makes a bunch. My personal favorite is sausage so the next time I’ll likely switch out the bacon for it. Directions are spot on from the user that said if made ahead to increase the cooking time to an hour. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "resy"
},
"reviewBody": "Cooked bacon first, used grease to soften onions after. Semi-precooked hash browns. Bottom layer 1/2 hash brown, mixed rest in egg mix. Delightful. (No pics, we ate it too quick)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Brown"
},
"reviewBody": "Made as directed except added a couple extra eggs as suggested by others. Was a huge hit with everyone at our birthday Club brunch. Everyone wanted the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aizausa17"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenzie"
},
"reviewBody": "I make this about once a month for my son. He loves it and it's great heated up before he goes to work. I do add a little pepper, paprika and sprinkle of parmesan (his preference) but it is wonderful as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookie"
},
"reviewBody": "I have made this casserole many times and everyone loves it. I have used a pound of diced ham in place of the bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donna c"
},
"reviewBody": "Followed recipe and was a hit Christmas morning! Used frozen hash browns with peppers. Next time will change meats and some cheese but never the cottage cheese. We hate cottage cheese but makes this recipe :)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JMac"
},
"reviewBody": "Made it twice. The flavor was good but both times it turned out dryer than I expected compared to the video . The serving in the video was cheesy and looked to have more moisture to it. I thought that maybe I did something wrong the first time so that is why I gave it another shot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sterling_dreams"
},
"reviewBody": "Made it exactly as directed by recipe. Delicious. I did forget to thaw the hash browns but that didn’t seem to matter, thankfully. I think they are thin enough that they start thawing as soon as they hit the egg and cheese. \nI’m actually making it again tonight to put in fridge and pop in oven in the morning. I hope that works out. Maybe just need to bake a smidge longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "350F"
},
"reviewBody": "My family loved this. Made day before and baked Christmas morning. Used thick sliced bacon and cooked in small portions along with small onion portions. Felt bacon would cook more evenly. Also got regular cottage cheese and it was fine. I did think it served more like 10 and not 12 but hard to tell with everyone digging in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jmhexx"
},
"reviewBody": "This recipe is a keeper! My entire family raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dvirgei"
},
"reviewBody": "Definitely a five star recipe as is. I made some slight changes due to family preferences; I replaced half the chopped onions with half of a chopped green pepper. I also replaced the swiss cheese with more cheddar cheese (only because my daughter hates swiss - I love it and would prefer keeping it in this recipe) ... Thx for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bridgit"
},
"reviewBody": "I am not a fan of dried-out egg casseroles....but read the reviews on this one and it is awesome!!! My whole family ate it. Even my non-egg eaters. I will definitely be making this again. Next time I think I'll add a can of green chiles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacci Zicker"
},
"reviewBody": "I was skeptical of this casserole because the picture looked like it might be soggy. BUT I MADE AND IT WAS AWESOME!!!! I made a much larger one than the recipe calls for upping the amount of ingredients. I also put both Bacon &amp; Jimmy Dean HOT breakfast sausage in it. It took about an hour and a half to cook so I covered it in foil until the last 20 minutes. I took it to work and put out salsa, jalapenos, corn &amp; flour tortillas, Sour cream and cilantro. I went to my desk to get my phone to take a picture of it AND LITERALLY... IT WAS GONE IN 10 MINUTES!!!! Excellent recipe!!! 10 stars!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattyJo"
},
"reviewBody": "we loved it willmake again for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darline"
},
"reviewBody": "Made this for the family last Christmas and they are already making sure that we are having it this Christmas!\nFollowed recipe exactly!\nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Davis"
},
"reviewBody": "This has become a go-to recipe! Always a hit, and I mean ALWAYS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heinz57american"
},
"reviewBody": "Was really good, I've tried some different breakfast casseroles and this is my favorite. I followed the directions for ingredients, but used sausage instead of bacon and sprinkled some onion salt &amp; pepper into mix. I made it night before &amp; baked it next morning. Next time, I'll use more sausage &amp; a couple more eggs. Mine wasn't as cheesy as video, but maybe that's because it sat overnight. Definitely DO NOT SKIP COTTAGE CHEESE! I couldn't tell it was there, but I believe that is the reason this one is my favorite. This would be very good with ham too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TaraNScott"
},
"reviewBody": "Very good! Easy. I made lots of modifications and substitutions: *5 slices of brioche bread (but any white bread would do) instead of hash browns *added 12 oz diced chiles. *used low-fat cottage cheese and low-fat Mexican shredded cheese mix * used turkey bacon since I prefer that to pork * only used half of small yellow onion (my husband is sensitive to onions) Some seasoning probably would have helped give it a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janlee445"
},
"reviewBody": "This is the breakfast casserole I am asked to bring when I am invited to a brunch. It is always on the Saturday morning menu for breakfast for girl's weekends. I don't change it one bit - it is awesome as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jtglover"
},
"reviewBody": "Made this Sunday. It was good. I added seasonings…Italian, garlic powder, ground black pepper, etc. I also did 12 eggs. Besides the eggs, I added a can of mushrooms (didn’t have fresh) and 3 small sweet peppers. It was quite dense. Next time I might add more eggs…leave liquid in mushrooms…add milk or 1/2 &amp; 1/2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Welch"
},
"reviewBody": "I skipped bacon as we were having bacon separately and it was still yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EIng"
},
"reviewBody": "This was great! Made it with what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Too bland. Like eating cheese mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "My wife and I really liked the recipe. Next time I may try to add some more meat (e.g. sausage) to see how it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Galvao"
},
"reviewBody": "I either have to scorch the bacon until it’s completely crumbly or I substitute the bacon for a pound of maple sausage. Both are great! This is a regular recipe in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LunaSea76"
},
"reviewBody": "Fantastic! I am the only one who eats breakfast casseroles in my house so I cooked it in a muffin tin and froze them. It made 24 servings. Now I can have them all the time! And I can heat up as many as I need."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joan"
},
"reviewBody": "Easy to make. Everyone loved it. Warmed up the last three pieces the next morning. Still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lakegirl24"
},
"reviewBody": "Made the night before and refrigerated, turned out delicious! This also works great if you want to sub sausage for the bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "Really good. Added mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Egerer"
},
"reviewBody": "great for large group.\nI removed the onion and cottage cheese was replaced with muenster cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "troutonsteroids"
},
"reviewBody": "Tasty and will serve a lot of people. As per some reviewer suggestions, I fried the hashbrowns to make them a bit crunchy. I placed at the bottom of pan and added the egg mixture on top. I didn't have Swiss cheese so added some Parmesan cheese instead. Added Jalapeños for some kick. Will likely make again and try alternative ingredients, including adding some salsa. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Nilssen"
},
"reviewBody": "I freshly shredded potatoes myself and it turned out great. Good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "Definitely a keeper recipe! I make breakfast casseroles often for my office and everyone raved over this one. I added some salt, pepper, cayenne pepper and for the last 5-10 min I added some shredded cheddar to the top to melt and get slightly crisp. When I removed from the oven I poured country pepper gravy over the top for a little added flavor. Will definitely make again! Didn’t last long!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deluvina"
},
"reviewBody": "Awesome! Used the country hash browns, didn't drain the bacon/onion drippings. Next time, I will substitute sausage and add peppers. Very versatile recipe! Loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "Sooooo good,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phlbst"
},
"reviewBody": "I liked it and made it as stated except for adding half a green pepper that I had. It took longer than I thought to let the hash browns defrost so I will be more prepared the next time. Also I may do as one reviewer did and prepare it the evening before. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Handy"
},
"reviewBody": "I used low sodium bacon (not turkey) and 2 1/4 cup of egg beaters. I also replaced the swiss cheese with jalapeno/habanero jack cheese. So good! I am sure the original is just fine, too. I have read that others froze their leftovers and I will do the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VICKI35"
},
"reviewBody": "Delicious! After reading reviews, I used 1.5 lbs bacon and 12 large eggs. I lightly/partially browned the hash browns in some remaining bacon grease, lightly salted and peppered. Then I added 1/2 t ground mustard, 1/2 t garlic powder, 1/2 t salt, a few shakes of black pepper and a pinch of cayenne to the eggs. Unlike those who make a crust with the hash browns, I mixed them with the eggs and cheese as directed in the recipe. I might go slightly heavier with seasonings next time, but it was delicious as prepared. I made the casserole the night before and popped it in the oven the next morning for my company, which is as simple as it gets. They went back for seconds. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenSista"
},
"reviewBody": "I loved this recipe and it tasted wonderful. I left out the Swiss cheese because I didn't have any on hand. will try it the next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grannysgoodies"
},
"reviewBody": "This was a huge hit! We were having company over Sunday and I wanted something easy. So on Sat. I fried up the meat and onion and shredded the cheese. In the morning I just whipped up the eggs, stirred it all together and voila it was ready! I was using a bigger pan so I used a dozen eggs. I also used O'Brian hashbrowns. This is a keeper for sure and will be used again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Baker"
},
"reviewBody": "Great recipe! I will be making this again! My husband is a very picky eater! He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "249"
},
"reviewBody": "I added a can of mushrooms I chopped. Other than that....followed recipe and it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cory Hayes"
},
"reviewBody": "This is our family's go-to lazy-day recipe. It covers anything from a brunch with friends, the Christmas, or today (a snowy day in Colorado). We'll regularly swap out the bacon for sausage depending on the local sales and to mix it up, we'll replace the swiss cheese with munster or something similar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "temp655"
},
"reviewBody": "This was fantastic! I didn’t change anything at all and will continue to use this one as is! Thank you for the wonderful recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pete"
},
"reviewBody": "I made this for my church men’s group. The guys loved it! I used the cubed potatoes Obrian type of hash browns and also some extra salt and pepper. I don’t usually like breakfast casseroles but even I had seconds. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "1 of 3 kids under 6 ate it. May try again in 7 or 8 years. I made a half recipe, baked it for 30 minutes, and it came out with a consistency like quiche. Would definitely shave some time off the cook time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miladys Velez"
},
"reviewBody": "This came out a little dry didn’t have enough cheese so used what I had I definitely will make it again as well as using the cottage cheese which I substituted with cream cheese and it was delicious but I will stick to the recipe next time I just purchased all the ingredients to make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefanie"
},
"reviewBody": "This was so good and I was relieved that the cottage cheese was absolutely NOT noticeable at all and definitely left it moist. I followed the recipe to the letter... but felt it lacked a little flavor. (I'm from Texas, so maybe that's a southern thing.) We topped our servings with some salsa, and it made all the difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yvo"
},
"reviewBody": "This was the best breakfast casserole I've ever had. Much moister and very cheesy, I did add an extra egg because I often find these casseroles dry but I don't think it was needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I love this dish!! We're not a fan of cottage cheese so I replaced it with whipped heavy cream. Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie-Leigh Plentus"
},
"reviewBody": "I made this for supper....it was gone before breakfast!! Everyone ate it, had seconds even. I followed the recipe as is and there was no need for adjustments. Kid and adult approved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Peirce"
},
"reviewBody": "This made plenty of servings! I added spinach and diced tomatoes for a bit more nutrition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvz2cook"
},
"reviewBody": "This recipe was incredible! I used 1/2 lb sage sausage in addition to the pound of bacon, 12 eggs, only 3 cups of potatoes and added a teaspoon of salt per other reviews. I put everything together on Christmas eve and baked Christmas morning. It sat on the table, covered with foil before we cut into it which made it incredibly easy to slice and serve. It was also still warm. My youngest daughter (7yrs old) who is a very picky eater, could not get enough and has asked that we make this every year for Christmas morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "janet"
},
"reviewBody": "Didn’t like at all. Too bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I made this for Christmas morning and I followed the recipe exact. I almost substituted the Swiss cheese for any other cheese I had around because it made me nervous. It turned out amazing! Everybody loved it. The Swiss cheese, onion, and bacon made this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebecca"
},
"reviewBody": "My father doesn't like sausage so this was an excellent casserole for brunch on Christmas morning. You know it was pretty good when my mom actually asked me for the recipie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nananurse"
},
"reviewBody": "Made this casserole for a post Christmas breakfast,was very well received! Have tried many in the past with less than stellar reviews from my family (a few generations) and have found this one pleased them all! Thanks for posting! Did the bacon n onion prep night before, so just warmed it enough to mix them w/other ingredients! Less stress in the morning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this for Christmas morning and it was a huge hit. I will definitely make this one again...it was delicious! I used cubed hash browns because I couldn't find shredded and they worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabrielle Innis"
},
"reviewBody": "Followed exactly and it was awesome! looking forward to trying again with some adaptations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Birckbichler"
},
"reviewBody": "I used loose breakfast sausage instead of the bacon. Had it for brunch Christmas morning. It was a huge success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "westdesrock"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Tolson Pugh"
},
"reviewBody": "I made this after reading many of the reviews. It was suggested by several to place the Hash Browns on the bottom and then pour the mixture on top. I also added 3 more eggs as was suggested, and added both salt and pepper. Both my mom and I thought this was really exceptional and it was a very pretty dish too. I cooked it for a full 60 minutes with the additional eggs added. Cannot wait to try this with leftover ham from Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rfegan"
},
"reviewBody": "I used 1/2 lb of cubed ham instead of bacon, everything else was per recipe. We all loved it and now it’s gone."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/229150/cheesy-amish-breakfast-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
"name": "Potatoes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/229150/cheesy-amish-breakfast-casserole/",
"name": "Cheesy Amish Breakfast Casserole"
}
}
]
}
}
, "about": [
]
}
]