				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Beef Goulash"
,"datePublished": "2013-01-23T16:49:59.000-05:00"
,"dateModified": "2022-08-09T19:04:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This Hungarian-style goulash is a thick beef stew that is great served over buttered noodles and garnished with sour cream."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uesGqOg2zBPB6vUxy9NeI_jaEfs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/962384-chef-johns-beef-goulash-Baking-Nana-1x1-1-8c368e0d1c994e0d9263af2f1d568dc8.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2096160677001",
"description": "See how to make succulent, saucy beef goulash.",
"duration": "PT5M55S",
"name": "Chef John's Beef Goulash",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/bfb006a1-fb62-4225-b674-ecc8f6ebdd7b/26040734-33b6-4158-af9a-46e33658aaff/1280x720/match/image.jpg",
"uploadDate": "2021-07-14T19:05:47.877-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Beef Goulash"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "497"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "573 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "134 mg"
,"fiberContent": "2 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "1757 mg"
,"sugarContent": "8 g"
,"fatContent": "41 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2.5 pounds boneless beef chuck roast, cut into 2-inch cubes",
"salt and ground black pepper to taste",
"2 tablespoons vegetable oil",
"2 onions, chopped",
"2 teaspoons olive oil",
"0.5 teaspoon salt",
"2 tablespoons Hungarian paprika",
"2 teaspoons caraway seeds, crushed",
"1 teaspoon freshly ground black pepper",
"1 teaspoon dried marjoram",
"0.5 teaspoon ground thyme",
"0.5 teaspoon cayenne pepper",
"4 cups chicken broth, divided",
"0.25 cup tomato paste",
"3 cloves garlic, crushed",
"2 tablespoons balsamic vinegar",
"1 teaspoon white sugar",
"0.5 teaspoon salt, or to taste",
"1 bay leaf" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Season beef with salt and black pepper. Heat vegetable oil in a large skillet over high heat; cook and stir beef in hot oil in batches until browned on all sides, about 5 minutes per batch. Transfer to a large stockpot and reserve drippings in the skillet."
} ,{
"@type": "HowToStep"
,"text": "Return skillet to medium heat; stir onions into the reserved drippings, drizzle olive oil over onions, season with 1/2 teaspoon salt and cook until onion has softened, about 5 minutes. Transfer to the stockpot with beef."
} ,{
"@type": "HowToStep"
,"text": "Combine paprika, caraway seeds, black pepper, marjoram, thyme, and cayenne pepper in the skillet and toast over medium heat until fragrant, about 3 minutes. Add 1 cup chicken broth and stir; transfer to the beef and onion mixture."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uesGqOg2zBPB6vUxy9NeI_jaEfs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/962384-chef-johns-beef-goulash-Baking-Nana-1x1-1-8c368e0d1c994e0d9263af2f1d568dc8.jpg"
}
]
,"text": "Stir 3 cups chicken broth into beef mixture. Add tomato paste, garlic, vinegar, sugar, 1/2 teaspoon salt, and bay leaf; place stockpot over high heat and bring to a boil. Reduce heat to low and simmer until a fork inserts easily into the meat, 1 1/2 to 2 hours."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Alcott"
},
"reviewBody": "I used beef broth instead of chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookingdude99"
},
"reviewBody": "This was fantastic! Yes, it is on the spicy side but I will make this again and again. As per the usual, well done Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love your videos! This recipe is pretty close to the one I've ended up with after several years of experimentation. I usually start with 3 or 4 pounds of chuck, equal amount by weight of onions. I add sautéed mushrooms and 2 diced raw carrots before putting everything together to simmer. I use much more sweet paprika--1/2 cup, more garlic also. And I have found that it takes more like 3.5 hours for the beef to get to that fall-apart stage I love so much. So good to see that my tinkering with this has ended up so close to yours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "s stan"
},
"reviewBody": "The cayenne pepper ruins this otherwise really good recipe. If you make the recipe without the pepper, I'd give it 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This goulash was brilliant. Cooked in slow cooker for 8 hours. The house smelt delightful. Husband and Son raves about it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "breakfixit"
},
"reviewBody": "Very good dish but very hot due to the cayenne pepper. Cut the cayenne pepper down to one quarter tsp and make sure you have sour cream as a side"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna J."
},
"reviewBody": "What a nice surprise. (Picky husband loved it. I didn't use the word \"goulash\" until he confirmed that he loved it.) I followed the directions aside from using a pork shoulder (It's what I had in the freezer.) To compensate, I did use beef broth rather than chicken broth. Be patient and let this cook for many hours uncovered. I let it cook for 3-4 hours and the meat was so very, very tender. You can't go wrong letting it gently simmer for hours, the meat will only get more tender. In the final half hour, I added some rough-chopped mushroom and 1/4c of sweet red wine. Again, simmer UNcovered since you want the vast majority of the liquid to boil off. The consistency should be similar to a ragu. I plated this by ladling the sauce over spaetzle, then I put a big blob (1-2T) of sour cream on top to swirl into the sauce. I used half the suggested amount of cayenne as hubs doesn't care for much heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dks"
},
"reviewBody": "What a top notch recipe! Our only changes were to use 1.25 pounds of stew meat and added vegetables during the last 30 minutes as we are trying to eat less meat as we get older, increase fiber with vegetables, reduce expenses and reduce costs as well. The spices gave us a slight burning taste afterwards but I added a spoon of unflavored greek yogurt on top of mine. We couldn't crush the caraway seeds but I will find a way to next time to get the full flavor. Definitely, a recipe that I want to make again and for company as well. Looking forward to leftovers now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmetzgerca"
},
"reviewBody": "I love this recipe so much, it's so hearty and has a unique flavor. It is definitely spicy which I love! For the hungarian paprika I use one tbs sweet paprika, 1 tbs hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "so very good will serve it for company, no changes made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Hebert"
},
"reviewBody": "Great recipe! A house favourite now.\n\nI added more garlic (4 cloves) because we like it. Also, it seems to work to put carrot in it if you want to add a little sweetness without putting sugar in it. We didn't have balsamic vinegar, but apple cider vinegar seemed to work out fine for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonos2000"
},
"reviewBody": "This stew looks absolutely scrumptious once it is all put together. I have authentic Hungarian paprika I bought at a small market and the stew looks red and absolutely divine. My father was Hungarian and this stew was made sometimes, always my father's favorite, but all the kids loved it too. It was so good it never lasted more than one night even though a big batch was made. My mother made the actual dumplings to pour this over but the broad noodles will do in a pinch. The caraway is an absolute game changer with this stew, and the bay leaf flavours it subtly with its taste. I love this stew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gaby Sonnenberg"
},
"reviewBody": "We are from Germany and we love this recipe. Very authentic Hungarian goulash, especially when you get Hungarian paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Taz"
},
"reviewBody": "We love this recipe! May this years ago and forgot about it. That I just rediscovered it have made it 5 or 6 more times in the last 3 months. I omit the Cayenne pepper cause I do not like my mouth on fire. I do however add some vegetables like carrots and celery and we serve it over buttered egg noodles and garnish With sour cream and any fresh Herb I have laying around. A must try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big fan"
},
"reviewBody": "Really good, will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This was soooo delicious! And easy to follow! We loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David T"
},
"reviewBody": "Followed the recipe and it turned out great. Didn't know my wife loved this while growing up. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angela Johnson"
},
"reviewBody": "Not for us. While we all had a nice time coming together and making this, it wasn’t a nice time eating it. There were many flavors that were new to us, and it just didn’t work out flavor wise. We usually cook the meat much longer in a slow cooker, and this could be a part of it. Too different for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "notmissinout"
},
"reviewBody": "This was wonderful!! My hubby, who is super particular, loved it. I always love Chef John's recipes and go to them first. Sometimes they're a little more complicated but they always come out fabulous. This one will definitely go into the regular rotation. The only thing I changed was leaving out the cayenne, for that picky husband I mentioned. Plenty flavorful without that bit of kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy"
},
"reviewBody": "Freaking tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMM"
},
"reviewBody": "Very Good. Followed recipe except added diced carrots left out cayenne. Beef was very tender, excellent flavor. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Bell"
},
"reviewBody": "Incredibly tasty and not very hard to make, just a little time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrenCo"
},
"reviewBody": "This was delicious!! My family loved it. I will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Wilson"
},
"reviewBody": "I make this all the time now! Perfect for fall/winter (especially with football)! I typically skip the stockpot and go to a crockpot, and I thicken it with a little cornstarch but it’s really perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cpdubs"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Bowman"
},
"reviewBody": "I grew up eating a recipe of Hungarian Goulash made from paprika, ketchup, Worcestershire sauce, brown sugar, water, and a little mustard. I made this because I wanted to try a more \"authentic\" recipe. I saw that several people mentioned that it's too spicy. If you use sweet Hungarian paprika, or some just labeled \"paprika\", it should be fine. I bought the hot stuff to try out and it's about as spicy as cayenne...The only alteration I would make is using more tomato paste and maybe just a little more sugar to balance out the peppery flavor. Since I missed the window to add tomato paste, I mixed in some ketchup and it worked surprisingly well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STRUDELQUEEN"
},
"reviewBody": "I am Austrian and I loved it! Great flavors and the meat was very tender. PS: Chef John points out that the “real” goulash is more liquid. There are two kinds of goulash. The goulash which can be served over noodles or polenta and the goulash soup, which is more liquid. Soup is served with a Semmel (kaiser roll) or a hardy farmers rye bread. Definitely will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daily Bread Bryan"
},
"reviewBody": "FABULOUS!!!!!! Dont change a thing......just dont. This recipe is purrrrrfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lu8019"
},
"reviewBody": "Delicious! I have made it twice as written. We’re trying to avoid carbs, so it’s perfect without noodles with sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rena5797"
},
"reviewBody": "The taste was very different, but I loved it! Especially for my first time cooking it. Definitely will be one I will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This was a great recipe! Even my husband, who generally does not like beef, loved it. It is a bit spicy for us, but the flavors were wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly"
},
"reviewBody": "Made this &amp; totally delicious! Chef John never disappoints. Did not have caraway seeds so substituted with fennel seeds as similar taste profile, also no balsamic so used apple cider vinegar instead. Added some sautéed carrots with the onions &amp; green peas last few minutes to make it a complete meal. Inspired me to make homemade noodles and the end product was outstanding. The sauce thickened beautifully as it reduced. Spice level spot on! Really loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharyl"
},
"reviewBody": "Sooo much flavour and very spicey. Maybe not child friendly but delicious for us. Mouth watering tender pieces of beef. Cooked for three hrs in slow cooker. Goes a very long way with lots of mashed potatoes. Don't forget the sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam O"
},
"reviewBody": "This one really hits it out of the park. I've cooked practically all of chef John's recipes and this is no doubt one of my favorites. Be careful with the salt though as I used better than bouillon for my broth and it's rather salty so I would hold off adding salt early and wait till it's all together. I followed the recipe almost exactly except I cut the cayenne and the black pepper in half because I'm a wimp, and I like my goulash like a thick stew so I added one tablespoon of flour to the one cup of broth. And lol to those complaining about cooking times. especially the one who said she's going to find a recipe that is more tender and cooks longer. Why don't you just cook it longer? Point being, depending on the size of your beef chunks, the amount of marbling, the heat of your stove, cooking time will vary and it is up to you to keep an eye on it. Cook it longer if it's still tough, cut it in small pieces if you are short on time, and keep an eye on it and don't let it cook so long that it falls apart. And to the reviewer who said that the 'vegetables' fell apart, I guess the onions, that's what happens in low and slow stews like this. They are supposed to disintegrate and become part of the gravy.That's why you don't add the vegetables that you want to eat until the last 30 minutes or so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jb cordova"
},
"reviewBody": "By the time I remembered to take a pic,it was almost gone.lol It turned out fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Vill"
},
"reviewBody": "Easy to make and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "Very good and comforting served over garlic mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celpeterson"
},
"reviewBody": "Made it in the Instantpot and it fell apart like butter! Used red wine to deglaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jersey boy"
},
"reviewBody": "wonderful flavor...will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen Vandeveer"
},
"reviewBody": "WAY too much onion and caraway for us. Would likely scale back to one onion and 1/2-1 tsp caraway. I did appreciate the complex flavor, but even after 2 hrs, the beef was still not tender and the onions had boiled away to nearly nothing. Had I keep simmering trying to tenderize the beef, the rest of it would have scorched. On the advice of others, I used beef broth instead of chicken and omitted the cayenne due to kids. I think next time I'd also increase the broth by 1 cup to give a little more time to tenderize, and add a bit more tomato paste and balsamic. I also did this stovetop this time, but may try it in my instant pot or slow cooker next go-round. Still, a good base to work from, and it was tasty even though we didn't quite get there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sidtaylor"
},
"reviewBody": "I have made this recipe several times and the family enjoyed it very much. The only changes I make are to reduce the paprika to 1 tablespoon hot Hungarian paprika and only use a pinch of cayenne pepper. If you like it very hot, go for it as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Homira"
},
"reviewBody": "I made it the first time as written and it was very good. My family said it felt too meaty. They suggested I add vegetables in. I appreciate that doing so alters the recipe but I thought I’d share for those who wanted to try a variation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeni Mellinger"
},
"reviewBody": "This was excellent! I used my pressure cooker to make sure it was good and tender. I served it over Semmelknoedel with Gurkensalat for Christmas dinner! Fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Burinda-Estrada"
},
"reviewBody": "This is definitely not a traditional gulyas, however, it is an excellent recipe, and more like a hungarian porkolt (beef &amp; onion stew). Very good. Highly recommend trying. Is a bit spicy so omit or reduce amount of cayenne if serving children. I am of hungarian descent and my family loves this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HELEKE"
},
"reviewBody": "Super yummy! Like others have mentioned, this was very spicy! I had someone bring me Hungarian Paprika recently and I used a teaspoon of the Hot and a teaspoon of the sweet paprika and glad I didn’t go with the tablespoons as instructed. —maybe this paprika is spicier than the usual stuff in the pantry?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Kiser Doubek"
},
"reviewBody": "We have loved all of Chef John’s recipes, but this is our favorite! Rich, spicy and delicious! The stew got even better the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gina"
},
"reviewBody": "DELICIOUS!! I followed the recipe, and didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "george"
},
"reviewBody": "AMAZING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Zhao"
},
"reviewBody": "Thumbs up from polish friends! Recommend to slow simmer for 2.5 or 3 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sean B Murray"
},
"reviewBody": "Overall, it's a good recipe but not a wow recipe for me. Tip: If you find it difficult to cut fresh chuck roast, put in the freezer for 10 minutes or so and it'll be easier to portion. I followed the recipe with slight exceptions: I used a bit more garlic than it calls for, and I added about a half of a green bell pepper which I cooked with the onions. As the caraway and marjoram flavors were outside my usual tastes, the novelty was good but I don't find either to offer a wonderful flavor. I appreciate a bit of kick, so I likely should have increased the cayenne and/or left the sour cream off ("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry P Jones Jr"
},
"reviewBody": "Found Chef John on YouTube; trivets lot of his recipes. All are good, but this one is a fan favorite of everyone that I’ve made it for...\nToday I’m trying it in the slow cooker..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Hickman"
},
"reviewBody": "This looked and smelled amazing served over egg noodles. Leftovers didn't last and were good - AH enjoyed the meat more than the noodles, SH and I liked this a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Callum Mitchell"
},
"reviewBody": "I did mine in an multi cooker/pressure cooker just added beef and salt gave it a stir then added all the other ingredients plus some sliced mushrooms and chopped sundried tomatoes gave it another mix then set it for 40 minutes and done it was so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klmoon"
},
"reviewBody": "I just made this today (seems kind of weird, since it's summer, but it sounded so good I just had to make it). This was delicious. Who knew something so simple could be so good. The only thing I changed was I omitted the caraway, as I just don't like it. Other than that followed the recipe exactly. Hubby said I can make this one again so, I know he loved it! LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "I love this recipe. The only thing I changed is I reduced the amount of caraway seeds to 1 teaspoon. I felt it overwhelmed the other flavors. Other than that it is my mother's goulash from Germany!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julian Toby"
},
"reviewBody": "Been doing this recipe for awhile now and I and everyone that I serve it to can't get enough. It's simply the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Solomon Grundy"
},
"reviewBody": "I made this recipe yesterday, and it was delicious. I wasn't sure, because the smell of the caraway seeds was a bit over powering for my tastes, but it turned out great. Especially with the sour cream added at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mark Baldwin"
},
"reviewBody": "The only thing I did was to cut down on the onion otherwise made per recipe. I made it for 40 people and they loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Absolutely delicious !!! Followed the recipe exactly and it turned out great, and tasted just like the goulash my mom used to make (maybe better). Only thing I omitted was the bay leaf. Thank you Chef John !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Uncle Jefe"
},
"reviewBody": "I made this also, &amp; Yes I put my own spin on it as well. I never liked American goulash, but this is the Bomb. I will make it again and again. Sadly i didn't think about taking a photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "This was delicious. I don't normally like caraway, but knew this needed it for the right flavour. It was so rich and good, the only change I made was to cut back the cayenne pepper a bit. I served it over buttered noodles, with a salad and fresh buns and my husband almost licked his plate clean. Thank you for sharing Chef John, I feel like your recipes are always reliably good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mainecoon789"
},
"reviewBody": "* Disclaimer: This is no doubt a 5-star recipe as written; my tweaks are due only to personal preference.\n\nWow, so good. I toasted the spices and herbs (no caraway seeds) in a dry skillet while the onions were sauteeing in the beef drippings. Also used red wine vinegar in place of balsamic. \n\nThanks as always, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunji144"
},
"reviewBody": "This turned out wonderful! I used a cheaper cut of meat and slow cooked everything (for 8 hours on Low), rather than simmer. I also added one green pepper. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WONDERWIZ"
},
"reviewBody": "This was really good! My grandma used to make it after she watched one of her childhood friends make it (no written recipe). It tastes just like what I remember. This was easy to make &amp; the long, slow cooking made it even better. Thanks Chef John for another great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coronagirl89"
},
"reviewBody": "I have made this recipe a lot, it's one of our favorites. Recently becoming a mom of twins, I don't have the time to follow the orginal instructions for preparing. So tonight for the first time I tried this is the slow cooker, nothing browned or toasted just thrown into the pot and it turned out perfectly. I was worried not following the steps would change it, but it didn't. Only thing I changed was I added a little easy blend the last half hour to make it a bit thicker, as I serve it over spaztle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josef P"
},
"reviewBody": "A+ I've been cooking my mom's Beef Goulash recipe for 25 years now, but this one is hands down the best. Being German and born in Yugoslavia, her recipe is authentic. Slight changes I made: No sugar, 1/3 the called for caraway seeds, and finally I added an entire 12oz jar of Trader Joe's Fire Roasted Red Peppers, pureed in a food processor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick Magrady"
},
"reviewBody": "I made the original recipe and it became a family favorite. The flavors were awesome. This is the best meal I have made with chuck roast for sure. Chef John is a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Robillard"
},
"reviewBody": "Superb flavors. Didn't have Caraway seeds but otherwise followed recipe exactly. I did thicken it up some with cornstarch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carlafromnh"
},
"reviewBody": "We loved this, but a couple of us thought it was too hot (spicy). Served it over rice and with a dollop of sour cream, which cut down on the spicy. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosieone"
},
"reviewBody": "The flavors were wonderful, the beef so tender, but my broth was too thin. Not sure what I did do wrong, but will try next time with less chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smgionfriddo"
},
"reviewBody": "This is our special Sunday or Birthday dinner. Soooooo good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bambi10000"
},
"reviewBody": "5 star rating! This is delicious, I added some carrots after about an hour of simmering and added a little more stock as I like it a little soupier (at Chef Johns suggestion). My neighbours are drooling at the smell drifting out to the hallway!! The cayenne really does have a kick but I like it spicy so all good. I suggest you half the amount called for if spicy isn't your thing. Every recipe I've tried of Chef Johns is a winner, his recipes are my go to when I need inspiration for dinner. Thanks for another great one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Gunarsons"
},
"reviewBody": "Outstanding. I made it with beef tenderloin. Best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANN"
},
"reviewBody": "No changes at all. MY family loves it.\n I'm thinking about using a version of this recipe to make vegetable ,beef and barley soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetspirit96"
},
"reviewBody": "The best beef stew recipe I've made, ever. I threw everything into a slow cooker instead of a stock pot, and the onions were like butter, and the meat was tender soft velvet. I took the advice of some others and increased the onions for a more authentic taste. It certainly brought back memories of my time in Budapest!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgios Pongas"
},
"reviewBody": "Marvelous recipe. It was delicious. Highly recommended recipe. The spices combination is perfect. Takes time but it’s worth it all the way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Gagliardi"
},
"reviewBody": "First time I have made it. My mother recently went to Hungary and brought me paprika which lead me to search for a recipe using this spice. Turned out perfect and wonderful. Everyone raved about it, my mother even loved it and she had authentic comparisons. Next time though i will add vegetables which this recipe doesn't include."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pamjames"
},
"reviewBody": "Oh my. So good. I made a few changes but stuck close to the recipe with regard to seasonings which is the main thing. I added two carrots, to celery sticks and 1 1/2 small green peppers. I added about 1/2 T paprika and 1/2 tsp marjoram and 1/4 tsp thyme. I may have needed the extra seasoning because I am on a low sodium diet and reduced salt by half and used a very low salt broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eustace42"
},
"reviewBody": "Wow - Pretty much stuck to John's recipe with only tweaks where I was lacking the ingredients or that complemented the dish (i.e. no chicken broth, so I used a mix of beef and veggie broth). Also added a few mushrooms and about a 1/3 of a green pepper, both sauteed with the onions. Served over buttered egg noodles with sour cream. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Halamish"
},
"reviewBody": "Fabulous! Chef John is always a winner in our home. He makes me look like a great cook....thank you so much!\nFrom Israel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Burgen"
},
"reviewBody": "I didn't have tomato paste so i used crushed tomatoes. I thickened the broth with a little bet of corn starch mixed with cold water. I also added about one half cup of sauteed mushrooms to the recipe when I added the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aida Kleffmann"
},
"reviewBody": "Used to a traditional simple family recipe, this Goulash was an amazing improvement that has now replaced my old recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ali"
},
"reviewBody": "This is my husbands favourite dish. I can’t even count how many times I have made this. Even with substitutions (fennel, oregano and beef broth) this recipe still turns out great. This is incredible over fresh spaetzle. A five star recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoxAmidon"
},
"reviewBody": "Very yummy! We watched the Hungarian a Grand Prix and had the goulash to celebrate. It was really tender and tasty. We used Spanish paprika as that what we had. The sour cream was a very nice compliment. It was over noodles, and next time we might try mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Actually it turned out better than I thought it would. Tried it liked it. Already recommend it to others"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lo"
},
"reviewBody": "AMAZING! I love these REAL recipes that use good spices and good eastern Euro flavor! thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate O'Neill"
},
"reviewBody": "Wow, this is delicious! Only change was fresh marjoram in place of dried. Otherwise did everything without tweaking. Picky eater husband went back for seconds - no leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sangita Treacy"
},
"reviewBody": "I didn't have Caraway seed so just substituted with fennel. I thought it was just as great. Wow! what a great recipe. Will be making this again and again and again......\nThank you Chef John for a wonderful recipe to add to my list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerry"
},
"reviewBody": "Your recipes never disappoint! This was so incredibly flavorful and delicious! We just finished eating and I'm still drooling thinking about the leftovers for lunch tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molbio"
},
"reviewBody": "Wat too much cayenne, and I like spicy food. Unless your tongue is challenged or the cayenne is stale, unlike mine which was fresh from a well-know purveyor of spices here in NYC, I'd say that you safely cut the amount by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmags17"
},
"reviewBody": "This is probably my favorite recipe that I've ever found! Exactly as instructed, it is flavorful, tender, and delicious. It has just the right amount of spice and, with egg noodles and a little sour cream, it's literally perfect. Chef John Is the bomb!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandr"
},
"reviewBody": "I didn’t use the paprika or other spices because my mom isn’t a fan of anything spicy. It’s still good even without it. My first time, I used chicken broth, and it was alright, nothing fancy, but this last time I used beef broth and egg noodles, and it came out way better. I also added a little extra tomato paste, and again, left out the spices except for salt and pepper, but this is something I’ll make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shane O'Neil"
},
"reviewBody": "Followed the recipe exactly and it came out stellar. We like spicy so we were happy this had a bit of a kick to it. Served it on a bed of egg noodle which went over well. The sour cream topping really rounded out the flavor. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosanna"
},
"reviewBody": "Really liked the rich and bold flavours of this recipe. Used half pork and half beef stew meat. I found the stew a level too spicy for my liking, so will reduce they cayenne by 1/2 next time I make this. My husband loved this dish and we served it with potato dumplings with sauerkraut for our Sunday dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tylers Girl"
},
"reviewBody": "Amazing. Followed the recipe exactly as stated. The best goulash I’ve had. Even better the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronald Romancik"
},
"reviewBody": "Great Recipe! Very tasty . The only thing I added was a 1/4 cup dry red wine. Love Chief John's recipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Hincz"
},
"reviewBody": "I think I had quite a tough piece of meat because it required over 3 hours cooking time but the end result was heavenly!! Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "icklemewho"
},
"reviewBody": "Followed the recipe exactly and it was wonderful. Next time I will make sure to have some French baguette bread for soaking up the juices. SOOOOOO yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shimstock"
},
"reviewBody": "Made it exactly as described and it was fantastic! Can't wait to make it again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231009/chef-johns-beef-goulash/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17046/soups-stews-and-chili/stews/goulash/",
"name": "Goulash Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231009/chef-johns-beef-goulash/",
"name": "Chef John&#39;s Beef Goulash"
}
}
]
}
}
, "about": [
]
}
]