				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Chicken Cacciatore"
,"datePublished": "2012-02-08T13:44:30.000-05:00"
,"dateModified": "2022-11-06T09:02:52.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "This simple Italian dish is packed with chicken, peppers, mushrooms and herbs for a satisfying one pot meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WVCzf1E-4VjoXoi2pyfzJn3sY2s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/833246-chef-johns-chicken-cacciatore-pelicangal-1x1-1-3648cf4f280b4ac1bf99c565d32fc0d8.jpg",
"height": 1200,
"width": 1200
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1183718323001",
"description": "Chicken Cacciatore - Hunter's Chicken Stew",
"duration": "PT3M25S",
"name": "Making Chicken Cacciatore",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/af3af09a-1846-4601-980d-e325debf128f/f6736d36-3b43-44c6-bfa3-0dade76b18a5/1280x720/match/image.jpg",
"uploadDate": "2021-07-02T22:51:21.898-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Chicken Cacciatore"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "262"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "513 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "149 mg"
,"fiberContent": "3 g"
,"proteinContent": "50 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "401 mg"
,"sugarContent": "6 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 tablespoons olive oil",
"1 whole roasting chicken, cut in quarters",
"1 large onion, sliced",
"8 ounces fresh mushrooms, quartered",
"1 pinch salt",
"1 pinch ground black pepper",
"4 cloves garlic, sliced",
"3 sprigs rosemary",
"1 teaspoon dried oregano",
"0.5 teaspoon red pepper flakes, or to taste",
"1 cup tomato sauce",
"0.5 cup water",
"salt and ground black pepper to taste",
"2 red bell peppers, sliced",
"2 green bell peppers, sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Heat olive oil in a large Dutch oven over medium-high heat; add chicken and cook until browned on the outside. Remove to a bowl to capture the juices."
} ,{
"@type": "HowToStep"
,"text": "Stir in onions and mushrooms; cook for 5-6 minutes until soft. Add a big pinch of salt and pepper. Stir in garlic, rosemary, red pepper flakes, oregano, tomato sauce, and water."
} ,{
"@type": "HowToStep"
,"text": "Place chicken pieces and any juices that have accumulated in the bowl on top of the cooked vegetables. Add more salt and pepper. Place pepper slices on top of the chicken."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WVCzf1E-4VjoXoi2pyfzJn3sY2s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/833246-chef-johns-chicken-cacciatore-pelicangal-1x1-1-3648cf4f280b4ac1bf99c565d32fc0d8.jpg"
}
]
,"text": "Cover and cook in the preheated oven for 1 hour 15 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn Lynch"
},
"reviewBody": "Pretty tasty. I did add a generous amount of garlic and Italian seasoning. Chicken was very tender but I would have preferred it to be cut up. Too messy to pick up bones with all that yummy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneP"
},
"reviewBody": "This recipe is worth six stars! I made with homemade roasted Roma sauce and homegrown garlic. Instead of a whole chicken, I had boneless skinless chicken thighs on hand which I halved before frying - about 8 to10. The aroma was amazing as the cacciatore baked in the oven. MDH adored it, and another Chef John recipe goes into the make again pile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DONAMARIE13209"
},
"reviewBody": "Absolutely delicious! The only things I did differently was I seasoned the chicken with salt, pepper &amp; garlic powder before browning. Instead of tomato sauce I used a large can of crushed tomatoes and also added a few glugs of white wine. Instead of putting in the oven I simmered the covered pan on the stove top for almost an hour. Served over rigatoni. My husband went crazy for it. Thanks Chef John! I'm going to be making this dish often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So easy and tasty. It's become a regular dish around these parts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Tom Dot Com"
},
"reviewBody": "Another winner chicken dinner! I love these kind of recipes. The cook gives the viewer a fair amount of leeway in preparing the dish, and this hit the spot with so much ooh-my-ma-me favors!! ;) I never considered myself a \"foodie\", but I grew up around food being cooked, eaten, hauled home (from the farm as my parents often bought in bulk), or prepared, so I kinda had a \"common sense\" around basic everyday dishes. This dish is perfect in everyday cooks like myself can personalize it to their tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kblakk"
},
"reviewBody": "This is a great and simple recipe, a staple when I used to live in Italy. At least once a week most households had a variation of this wonderful recipe. Well maybe I'm exaggerating about once a week, but I know it's made often. The only thing I changed is I added diced jalapeno for more kick, and, as in most households I've sseen it made in, I used wine for deglazing the pan, but then I got confused about the putting the peppers over the pan part. I made it the way I know and blended it all together. that way the flavors of everything came together. Remember, this recipe didn't seem to call for seasoning of the chicken, so I added more seasoning and herbs so that they could absorb into the chicken so it wouldn't come out bland. Especially when you're using breasts, but in my case I used thighs because they render more oiland flavor, which is good for the sauce and the chicken. As usual, Chef John smashes with another great recipe. Guests loved it, no leftovers for me!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Simpson"
},
"reviewBody": "Sautéed the garlic with the chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Fontaine"
},
"reviewBody": "Great Recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "This was the first time that I cooked with a Dutch oven! The recipe gets 5 stars because of the phenomenal taste of the fatty, spicy, savory, vegetable-flecked tomato sauce and the fall-off-the-bone chicken, but I did run into some snags: First and foremost, There were some issues with the sauce thickening. When I took the dish out of the oven, the sauce was extremely thin. I ended up adding another cup of tomato sauce (because it was much thicker than the actual sauce at that point) and simmering only the sauce for another 35 minutes, which did the trick, but we were super hungry by that point! It’s possible that some of the issues may have had something to do with the size of the chicken and subsequent amount of juices. My whole chicken was definitely a lot bigger than Chef John’s, and I actually only ended up using 3 of the 4 pieces because otherwise it would’ve been too much. Also, my pieces took twice as long to brown during the first step, and even then, they didn’t get very brown. A couple other changes: used 1 full tsp red pepper flakes, and substituted Italian spice for the pure oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gretchen Phillips"
},
"reviewBody": "I found this recipe to be almost too greasy to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ldw7932"
},
"reviewBody": "I loved this so much! I know I can always count on chef John's recipes. Thank's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Taggart"
},
"reviewBody": "I followed the recipe as written, well almost. I used bone-in thighs only. They came out amazing! So tender. My only issue is that the final product seemed a little greasy. Not sure why. Overall, it was great, very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Harris"
},
"reviewBody": "When I make this again I will use more of the spices since it was rather bland. I used bone-in thighs which turned out great . Definitely will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Stagg"
},
"reviewBody": "This was excellent. First time I have made this recipe. \nFlavors are wonderful. \nIf you are cooking boneless, decrease the time.\nIf you feel you have to much liquid and or too watery, take the lid off for a few minutes. \nEasy tasty and really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa Baxendale"
},
"reviewBody": "Delicious! I added a jar of cherry peppers (drained), and let it cook along with the rest of the ingredients. It’s such a simple, yet robust and flavorful recipe. We love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdftexas"
},
"reviewBody": "Loved it!!!! loved it!!!! was looking for a replacement for the sauce that was hard to find in the stores. Love it!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancy1754"
},
"reviewBody": "Easy. Tasty. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunny Jim"
},
"reviewBody": "I have made chicken cacciatore from many recipes. I like this one best. So does my wife. This recipe does not end up with too much liquid to reduce. Sauteing the onions and mushrooms in the chicken fat is a big plus. The only changes I made to this recipe was to spoon out a couple of tablespoons of fat before throwing in the onions and mushrooms, exchanging red wine for the water, and reducing the number of bell peppers since my wife is not fond of them. I think that those Italian hunters probably used rabbit but American shoppers find chicken easier to find. Thank you Chef John for another great lesson. Congratulations on your new place! Your videos are looking quite finely turned out these days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eaf78"
},
"reviewBody": "I used thighs and drumsticks. Wine I instead of water and a jar and a quarter of sauce because I used a lot more chicken than the recipe called for. It was delicious. Absolutely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Louie"
},
"reviewBody": "Amazing of course."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used some boneless chicken breasts and some boneless chicken thighs rather than deal with a whole chicken. It came out well, but not spicy enough. Next time I would definitely use a lot more grated red pepper flakes. I also think that chicken cacciatore should be in a tomato sauce. Mine was not robust enough, perhaps because I had played fast and loose with the amount of chicken I used. I would use more sauce next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John S. Orlitta"
},
"reviewBody": "I made this per the ingredients in the recipie. The only thing I did different was cook it on top of the stove in a large deep pan. Came out great! My wife said that the addition of sliced potato would probably be a good addition to this recipie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwillvbullock2021"
},
"reviewBody": "Awesome recipe! Due to to the shelter in place I had to adjust to what I had in the fridge and pantry. I used fresh tomatoes I peeled and chopped, green onions and shallot for the onion, 3 table spoons I’d mushroom soup concentrate as I had no fresh mushrooms, and 3-4 table spoons of tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "willbullock"
},
"reviewBody": "Awesome recipe! Due to to the shelter in place I had to adjust to what I had in the fridge and pantry. I used fresh tomatoes I peeled and chopped, green onions and shallot for the onion, 3 table spoons I’d mushroom soup concentrate as I had no fresh mushrooms, and 3-4 table spoons of tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Sole"
},
"reviewBody": "WOW! I've been making Chicken Cacciatore for many years &amp; it has never been this good.\nI often look for ways to improve on my 'old' recipes and this one did not disappoint!\nI followed the recipe, but I added some fresh tomatoes as well as canned diced ones and also added a fresh jalapeno pepper.\nServed over spaghetti to many YUMMMMS going around!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I loved this. It was easy to make though took a good amount of time. Made exactly as written except that I didn't have mushrooms so eliminated them and I used thighs and drumsticks instead of a whole chicken. Served over Chef John's perfect polenta recipe. LOVE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shermannah Lee"
},
"reviewBody": "This recipe was very good. I cut up a whole chicken and next time I will just use thighs or breasts so we don't have to deal with small bones falling into the mixture. I will also reduce the red pepper flakes to a quarter teaspoon as a half teaspoon made it too spicy for my families liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce"
},
"reviewBody": "I thought it was delicious! My bf doesn't care for rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vincent Brown"
},
"reviewBody": "modified this a bit by using 1/4 cup sherry after onions, garlic and shrooms soft. added fresh basil, oregano, and 1/2 tbs ground chili peppers. simmered and reduced. added sauce, and large can crushed tomatoes. brought to boil. placed chicken with peppers and baked for 45 min, covered in mozzarella and baked for 15 more minutes. served over vegetable pasta. spice was just right, just enough heat to bring a bead on the forehead without sacrificing the flavor. a keeper of a recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "OMG, SO GOOD!!! Probably the best tasting food I've ever cooked. No msg, no wine, needs nothing. I am trying to lose some weight so removed the skin, and I can't stand olive oil, so swapped out for avacado oil. Green peppers for yellow, because I don't like green peppers. Otherwise, I followed all the steps. But there's no need to mess with this recipe. If you think it'll be too wet, just leave the lid off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beans"
},
"reviewBody": "Simple yet delicious, this was a great meal to round out the week by clearing the fridge/pantry of any older veggies. In addition to the ingredients called for, we also added tomatoes and squash. To compensate for the extra ingredients, we added extra seasoning once the vegetable medley was ready for the oven. Once out of the oven, the meal was so fragrant, we could barely wait to eat. I can't wait to use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Bello"
},
"reviewBody": "Amazing!! I added a poultry seasoning and it gave it just the right amount of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal S."
},
"reviewBody": "My fiance and I loved making this recipe together. It was delicious, bright and restaurant quality. The whole house smelled yummy too, after cooking this dish! I substituted chicken stock for the water and made rice and and crusty Italian bread to go with the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pete"
},
"reviewBody": "I made this exactly per the recipe and it was delicious! With a large chicken this makes a lot of food. Maybe next time I’ll try it with maybe 3 chicken breasts as there’s just the 2 of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Gumpert"
},
"reviewBody": "The chicken was tender and delicious. The sauce was a little watery. I would leave out the extra water from the recipe and add more tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Carriles (Yankee Enginee"
},
"reviewBody": "Very good eats, I substituted white wine for water and used baby Belle mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nday"
},
"reviewBody": "I made this recipe with wild rabbit and it turned out great. Will try it with chicken thighs next. I loved using my cast iron Dutch oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate King"
},
"reviewBody": "This recipe was so simple, you just need time. \nI used chicken leg quarters, and I used our cast iron skillet covered with foil instead of a dutch oven. \nI also substituted red wine for the water. It made a big impact! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Kay"
},
"reviewBody": "Followed direction using chicken legs. It was great. Recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FOREVER YOUNG"
},
"reviewBody": "This recipe was okay, using the oven to bake the chicken was the key to a nice meal, the prep is the thing that takes the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly Layton"
},
"reviewBody": "Terrific! Don’t rush this dish. Totally worth the effort. Use WINE and not water. Season chicken well before browning. Enjoy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise Nissenbaum"
},
"reviewBody": "This was an easy dish to recreate in my kitchen. I did make an adjustment or two. I used skinless, boneless chicken thighs (8 of them)seasoned them with Mrs. Dash original and a light dusting of garlic powder, then put them in the frying pan (coated with EVOO) and let them brown on both sides. I removed them to a plate and added the onions, mushrooms, garlic, hot pepper flakes (only about 10), oregano and a pinch of salt (I omitted the rosemary, as I did not have any). I let this cook about 8 minutes and added the tomato sauce (with 2 chopped up plum tomatoes in it) and a full cup of low sodium chicken broth. I added back the chicken cutlets and laid the pepper strips on top of them. Since it is summertime and very warm, I opted cover the fryer and simmer the recipe on top of the stove, checking on it every 20 minutes to make sure nothing was sticking to the bottom of the pan. It came out yummy . I lowered the total fat content as there was no chicken skin, and yet it was tender and juicy because I used thighs and not breasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lore Keegan"
},
"reviewBody": "Added diced tomatoes and garlic, family loved it ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M S"
},
"reviewBody": "I have made this a few times . Turns out prefect every time . I go right by the recipes . My whole family loves it .Thank you so much for this recipe. Having it tonight can’t wait till it’s done . Five stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mini travel"
},
"reviewBody": "No changes to the original and yes i would def make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katherine Hedrick"
},
"reviewBody": "We love this. I used diced tomatoes instead of tomato sauce and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vincent V"
},
"reviewBody": "Very good. I swapped wine for water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CLK"
},
"reviewBody": "Made it with chicken breaths and it turned out lovely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billy"
},
"reviewBody": "Very good. Easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne Collins Reinhart"
},
"reviewBody": "Very good. Sauce was great. Will use with other dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef arturo"
},
"reviewBody": "I added kalamata olives to the dish 15 minutes before the end of oven time. Fantastic dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "111"
},
"reviewBody": "So easy and SO good. Followed the recipe exactly! Wouldn’t change a thing. Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "This is fantastic and since it's just the two of us, we had it for lunches, and dinners. I can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terry"
},
"reviewBody": "Very easy and quick. If you have to use dry rosemary instead of a sprig I wouldn’t use more than one and a half teaspoons. I thought 1 tsp per sprig but that was too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ezcook"
},
"reviewBody": "I used me Dutch oven for the first time. This dish came out wonderful, definitely will make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna Ben"
},
"reviewBody": "Very good, substituted white wine instead of water and ragu instead of tomato sauce. Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Allen"
},
"reviewBody": "Absolutely delicious and rustic taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely delicious and rustic taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maeella1"
},
"reviewBody": "This was a very easy dish to make. It had lots of flavor from the peppers.\nI did use bottled pasta sauce instead of the tomato sauce , which worked just fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laura"
},
"reviewBody": "This was such a hit! Next time I don’t think I’ll brown the breasts as long or not at all. The sauce was amazing but the breasts were dry. The dark meat was perfect. I used suggestions of deglazing with red wine and adding wine instead of water. I also rubbed the chicken with Adobo before browning. I used a lot of garlic when I sautéed the onions and mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene Downs"
},
"reviewBody": "It probably isn't really \"this\" recipe anymore since I'm a big \"tweaker\" when I cook. But the base plus my extras made this our favorite version to date. I added a can of diced tomatoes and used white wine in place of the water. And I was heavy handed on the seasonings because we like a lot of flavor. The end result was very good and we'll definitely have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I didn't make any changes to the recipe and it was fantastic. We had over linguine. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mjr"
},
"reviewBody": "Definitely will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chev Mimi"
},
"reviewBody": "I used boneless, skinless thighs in lieu of a whole chicken. Cut then into wide strips, eliminated the flour, sautéed them and followed the recipe as written from that point except I cut the cook time down to 30-35 minutes. Everybody loved this recipe. I will definitely be making this again. It was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is seriously one of my favorite go-to recipes. I use boneless skinless thighs and it’s heavenly! Even my kids like it, and they hate everything. Well done, Chef John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Woodward"
},
"reviewBody": "Simple and delicious! It was a hit at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leslie"
},
"reviewBody": "It was fabulous! I made it as is, but used garlic powder instead of fresh and had a heavy hand with rosemary cause I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YaMi"
},
"reviewBody": "Thanks to Chef John. Another simple, taste good dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia G"
},
"reviewBody": "I love this recipe! So easy, and it is full of flavor! I made it in my cast iron Dutch oven, and everything cooked beautifully. \n\nThanks, Chef John! Your recipes always turn out perfectly. I appreciate your videos, too. If you watch them, there aren’t any surprises or questions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Wow....this was really good!!! I used one large orange and one large red pepper. I also used a whole jar of prepared sauce and boneless chicken breasts. The poultry was so moist and the peppers made it taste fresh and yummy. I served it over noodles. This is a definite keeper and a great way to use peppers when they go on sale. Thank you Chef John for another stellar recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dorrll"
},
"reviewBody": "I added too many pepper flakes. It was too spicy. So I added more pasta. Then my husband felt it was too bland. I will make again and follow the directions exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TerriLeeAnn"
},
"reviewBody": "We just made this for a family dinner and everyone loved it! I used boneless chicken breasts for time saving and serving flexibility. We sautéed veggies and chicken in electric skillet then put everything in a cast iron Dutch oven with a can of basil seasoned crushed tomatoes and simmered on the stovetop rather than in the oven. We served with curly pasta-cavatappi-salad and crusty bread - It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ThreeTwo32"
},
"reviewBody": "This is an awesome, easy recipe. I highly recommend it. Although I have to be honest for some reason I didn't read the directions and I just put everything in my Dutch oven and put it in the oven. It turned out great! - thank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "This was a very good recipe, easy to make. I wanted to follow the recipe as closely as possible, which I did with a few changes. I used boneless skinless breasts, and added a can of tomatoes and some baby carrots. I did not use the red bell peppers or pepper flakes, and used ground marjoram in place of the rosemary. Also, I was using the oven for something else and so cooked this on top of the stove. Husband and daughter both liked it very much. There was plenty of juices which were great for dipping bites of chicken into or spooning over vegetables. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam Z."
},
"reviewBody": "I used chicken stock instead of water, and had to add about a half hour to cooking time with the lid off.. It turned out great, would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "I didn't have fresh rosemary so I used dried, about 1/2 t. I also used crushed tomatoes in place of tomato sauce and water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TrainChef"
},
"reviewBody": "The family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Fitzgibbons"
},
"reviewBody": "Everyone in my house loved this recipe. I added 1/2 cup of white wine instead of water and used chicken quarters. Also, no pepper flakes or rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "achauhan"
},
"reviewBody": "Turned out great and was super easy to make! I followed the advice of other reviews and made sure to add spices along the way. I also used fire roasted crushed tomatoes which really added a nice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "I used chicken breast. 1/4 tsp dry rosemary (personal taste). My husband said delish. And had seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sabrina Rose"
},
"reviewBody": "Very tasty! The only thing I did different was I added yellow and green zucchini and a tad more red pepper flakes. I did drain some of the chicken grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Won’t make it again — at least without changes. This recipe was a little bland for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Andres"
},
"reviewBody": "Delicious! I used boneless skinless chicken thighs and chicken stock in place of water. also used dried Rosemary. It is super flavorful! I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We had chicken cacciatore for our wedding reception. So for our anniversary I decided to try and make it myself. So glad I did. It was very easy to do and as delightful as it was at our wedding reception. Thank you chef John for always making great informational videos that are entertaining to watch. A five star recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Prewitt"
},
"reviewBody": "Used skinless thighs and breasts for this. I was stellar! Lovely robust flavors. I used a delicious red wine and some fresh squeezed orange juice that added a lovely depth and sweetness that played of the rosemary and Italian seasonings beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avery"
},
"reviewBody": "A few small changes: Since I'm cooking for two I used four bone-in thighs with skin rather than a whole chicken, and I reduced the quantities of other ingredients appropriately. Also since we have fresh thyme in our garden I added a couple of sprigs and since I had some chicken stock on hand I used that rather than water. I used canned diced tomatoes instead of homemade tomato sauce (forgive me!). And I don't think it mattered, but it was too hot in our house to cook in the oven, so I put the dutch oven in the gas barbeque outside and tried to keep it at about 350F. \nAccording to my customer (my wife) it was excellent. I'll definitely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob C"
},
"reviewBody": "To spice it up I used a jar of ragu marinara and a jar of ragu w/mushroom with 15 pcs of chicken. I did use the salt and pepper and only tbls of Italian seasoning. Onions and peppers I still followed. Covered in Dutch oven at 350deg for 1 1/2 hrs. Froze 3 meals for 2 of us. simple and taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniela Miller"
},
"reviewBody": "This was amazing and so easy. A new favorite in our home. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Szczecinski"
},
"reviewBody": "This is basically how I usually make it except use fresh sliced tomatoes and some wine instead of tomato sauce. Great over mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oogliboog41"
},
"reviewBody": "The flavor was fantastic as it beat my wife's other recipe for chicken cacciatore which I always thought was the best. This recipe beat it 2 to 1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brog"
},
"reviewBody": "Great recipe. I replace water with wine and add tomatoes as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beauxceghus"
},
"reviewBody": "Loved it! Restaurant quality! I had a large Publix Greenwise roasting chicken cut into 10 pieces. Followed the recipe EXCEPT no red pepper flakes 'cause I didn't have them. It was easy prep, into oven, easy clean-up, worth $30 in any restaurant. My 97 year-old mama liked it, my wife (who doesn't like anything) liked it, and even her cat, Trixie, liked it. Chef John is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "As with all Chef John's recipes, this did not disappoint. Followed the directions exactly and enjoyed a really delicious meal. Made it again for company a week later. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Bailey Finn"
},
"reviewBody": "I made this recipe using chicken thighs and it was really good! Easy enough to do and very impressive with all the colors! Would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luan28"
},
"reviewBody": "Made it with chicken breasts they were so tender. I thought the sauce was a little thin next time I make it I will add some cornstarch during the last 15 minutes of cooking to thicken the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Bleakley"
},
"reviewBody": "I think this recipe is delicious! I agree with a previous poster that it would have been good to be advised to drain most of the fat/oil after browning the chicken. It was a little greasy. Next time I will drain the fat. For those saying the sauce is too thin, use your imagination! I served with rice, but also a great crusty bread to mop up the sauce. It was wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KinyaMcNeil"
},
"reviewBody": "This was very good. We used chicken drumsticks and omitted the mushrooms. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Rodriguez"
},
"reviewBody": "Made this tonight. I followed the recipe almost, I didn't have tomato sauce so I used jarred marinara sauce and I used canned mushrooms because I didn't have any fresh ones. It was absolutely delicious, not bland or under seasoned! My husband loved it, this recipe is a keeper! He's a chef and loves when I make a good dinner. Nice for him not to cook! Thanks Chef John your recipes are always good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julie palmieri"
},
"reviewBody": "used chicken broth instead of water a few more mushrooms, over pasta amazing and boneless skinless thighs\nvery tender and tasty also added white pepper"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220130/chef-johns-chicken-cacciatore/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17553/main-dish/chicken/chicken-cacciatore/",
"name": "Chicken Cacciatore Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220130/chef-johns-chicken-cacciatore/",
"name": "Chef John&#39;s Chicken Cacciatore"
}
}
]
}
}
, "about": [
]
}
]