				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Make-Ahead Turkey Gravy"
,"datePublished": "2012-11-07T19:16:39.000-05:00"
,"dateModified": "2023-01-03T10:12:19.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Flavorful turkey fond is used in Chef John&#39;s fantastic recipe for simple, make-ahead Thanksgiving gravy that&#39;s rich, smooth, and a huge timesaver."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bihM-ElkzUNgPqAB044kTn5wzB8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4222637-ac06e358fb754e29948f2676c04cf644.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1949141467001",
"description": "Save your Thanksgiving Day sanity by making rich turkey gravy in advance!",
"duration": "PT5M36S",
"name": "Chef John's Make-Ahead Gravy",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/a532a753-2c39-4b54-b3fb-8de0231931ef/31711322-f7a0-48db-a8bd-2d03dbd87166/1280x720/match/image.jpg",
"uploadDate": "2021-06-25T20:25:07.206-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Make-Ahead Turkey Gravy"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "476"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "115 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "92 mg"
,"sugarContent": "2 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 large onion, chopped",
"2 carrots, chopped",
"2 ribs celery, chopped",
"2 teaspoons vegetable oil",
"2 large turkey wings",
"2 tablespoons cold water",
"10 cups cold water",
"4 sprigs fresh thyme",
"2 cloves garlic",
"3 tablespoons butter",
"0.5 cup all-purpose flour",
"1 pinch cayenne pepper, or to taste",
"salt and ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine onion, carrots, celery, and oil in a large roasting pan; toss to coat. Place turkey wings on top of vegetables."
} ,{
"@type": "HowToStep"
,"text": "Roast in the preheated oven until turkey wings are browned and vegetables are caramelized and softened, 45 to 60 minutes."
} ,{
"@type": "HowToStep"
,"text": "Transfer turkey wings and vegetables to a large stockpot. Place the roasting pan over a stovetop burner set to medium heat. Pour 2 tablespoons cold water into the pan and bring to a boil, scraping up any browned bits. Pour mixture into the stockpot and add 10 cups cold water, thyme, and garlic."
} ,{
"@type": "HowToStep"
,"text": "Bring turkey wing mixture to a boil. Reduce heat to low and simmer, uncovered, until meat falls off the bone, about 3 hours. Skim off turkey fat throughout the process, reserving 2 tablespoons."
} ,{
"@type": "HowToStep"
,"text": "Strain turkey stock and reserve 6 cups stock; discard all solids."
} ,{
"@type": "HowToStep"
,"text": "Heat butter and reserved turkey fat in a large saucepan over medium heat. Whisk in flour and cook until it smells like cooked pie crust, 2 to 3 minutes. Slowly pour in reserved turkey stock, whisking constantly."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bihM-ElkzUNgPqAB044kTn5wzB8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4222637-ac06e358fb754e29948f2676c04cf644.jpg"
}
]
,"text": "Increase heat to high and simmer gravy until thick and warmed through, about 5 minutes. Season with cayenne, salt, and black pepper."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT255M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very disappointed. Had no flavor at all. Ended up having to make gravy at the last minute. Not what I wanted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Penque"
},
"reviewBody": "My husband and son made this in advance which saved a lot of time for us on Thanksgiving day. They doctored it up a bit by adding in some cooked up giblet/neck stock when they reheated on the day served. Took a lot of time, but many thought it was worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "playz88"
},
"reviewBody": "Gravy was just okay with good consistency but I’d never make it again. VERY time consuming. Not worth the effort! I love Chef John but this was not great! Didn’t have as much rich flavor after all the time I spent. Still added turkey drippings to it for more flavor. Just easier to do last minute when turkey rests. Never again! Very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsmac"
},
"reviewBody": "I made this exactly following the recipe except for 2 changes. Since I spatchcocked our turkey, I added the back with the 2 wings to the pot. My stock pot would only take 8 cups of water instead of 10. At the end I added 1 tsp. of salt, white pepper and the pinch of cayenne. I still got 2 quarts of gravy using only 8 cups of water. It is excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dennilee"
},
"reviewBody": "I love having the gravy done ahead of time! Getting a Thanksgiving feast on the table is a lot of work and the gravy has always been the last component after getting the turkey out of the oven. I used two turkey wings and four turkey necks. The only other thing I did differently was to use two 32 ounce cartons of store bought turkey stock and two cups of water, instead of ten cups of water. I followed the rest of the recipe as written. When it was done, I ended up with 7 cups of delicious, silky smooth gravy. I have no doubt that this gravy is so much better than the gravy I would be scrambling to make after my turkey comes out of the oven! Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen Minervini"
},
"reviewBody": "I have used this recipe several times and just love it. Chef John is the best. Whenever looking for a recipe, I google him first. This time I uses homemade vegetable stock that I had made with leftover veggie scraps. The flavor was delicious. Thank you again Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie J"
},
"reviewBody": "Outstanding! Perfection! I’m thrilled that I was able to make gravy that tastes soooo good. Smooth and pretty to look at, as well. Thank you, Chef John👏🏻😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Moller"
},
"reviewBody": "The usual Chef John deliciousness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Shaknis Zarzycki"
},
"reviewBody": "I have made this gravy recipe exactly as is for many years and it has always been delicious! Now that I have a Dutch oven, I wondering if I can roast the wings uncovered in the Dutch oven first in my kitchen oven and then continue the recipe in the Dutch oven on the stove top. Has anyone tried this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susancezanne"
},
"reviewBody": "I have never had so much gravy. We had 11 for Thanksgiving AND leftover gravy. And it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BaKirsch"
},
"reviewBody": "Thank you for giving us this fabulous gravy recipe! I made it for Thanksgiving dinner, and it was awesome. This will now be my go to recipe for turkey gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rarely Give a 5 Star :)"
},
"reviewBody": "I made this and the other Make Ahead Gravy. We (8) like the other slightly better and since it is easier to make with less ingredients, we choose that one. This was good, just a lot more work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camille Bailey"
},
"reviewBody": "This turned out A-MA-ZING!! I have not been one to make decent brown gravy, until now! Chef John is a ROCK STAR! Explains things so easily and so unassuming that I was completely confident in my ability to make it. It is hands down the best turkey gravy I have ever made or had. I did in two stages, roasted everything &amp; cooked the stock one day, strained and put stock in fridge to get as much fat (from the top) as possible the next day. Perfection! Even my hubby, who isn't a huge turkey gravy fan, said it was dang good. ??? Try it, you'll love it. Use the left over veggies and leg meat for a pot pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Spicequeen Carter"
},
"reviewBody": "My gravy turned out phenomenal! I followed the recipe but like several people I split the liquid between chicken stock and water. I'm 68 years old and from what I'm told a pretty darn good cook but I never could get my gravy quite right I'll be using this recipe the rest of my life thank you chef john!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann Stoops"
},
"reviewBody": "I have made this for Years! My family's favorite traditional gravy. Just heat and enjoy on Thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mr Moose"
},
"reviewBody": "I have been making this gravy for 10+ years. I have shared this recipe with dozens. I use low sodium chicken broth (8c) and water. Season with garlic and onion powder. Tuesday night gravy is done. No stress. Thank you, John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DonnaSue"
},
"reviewBody": "Found It okay but in need of modification I use 3-4 Turkey Wings and season them with the same dry spice rub I use on my turkey. I make this stock in advance, adding a bay leaf, more garlic clove and thyme sprigs to the recipe. I will use 4C unsalted chicken broth and 6C water and a splash of white wine. I put the neck in the pot as well. Then the stock is perfect. I can use some of it to baste the turkey. I often will make the gravy while the turkey rests, mixing some of this into the drippings. I also using some of this for my dressing/stuffing. So that’s my way. Chef John is a go-to guy when I’m looking for ideas and this was a great tip and trick with the added modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Enyeart"
},
"reviewBody": "Excellent recipe as written. I thought adding 10 cups of water would dilute it, but it didn't. Plus, as the carrots cook down, they add a slight sweetness to the favorable gravy. This recipe is worth the time to make it. Next time, I'll double the recipe to ensure I always have some on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trishak17"
},
"reviewBody": "My 16 year old son made this 11/17/2021. He brought to his youth group Friendsgiving. The adults were so impressed. When ask, did you make this. He replied with a big smile, I did. It was so tasty that everyone came to his table for hot Chef John's Turkey Gravy. Wow!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "D Marie Bernardo Dobbles"
},
"reviewBody": "It soooo good. Make ahead and warm slowly in a small pot. It's worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pikklls"
},
"reviewBody": "When you're roasting the vegetables and the wings you'll think you've gone to heaven! Smells so good and taste great. I've even doubled the recipe and once used smoked wings because that's all I could get (still good, but I wasn't a fan of the smoke flavor)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "OMG! I love Chef John…. Please help. I did everything according to the recipe except the grocery store only had turkey thighs which is what I used. It was absolutely awful had a sweet strange taste. I wish I knew how to email chef John and ask him what went wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AuntBecky"
},
"reviewBody": "Have used this for the last 3 years, since I found it, and have solved the age-old problem of \"not enough gravy for leftovers\". Thank you, John! This is a lifesaver!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dogmomamma"
},
"reviewBody": "LOVE this recipe. I use chicken stock/broth instead of water &amp; use more veggies/turkey drumstick, wing/neck than recipe calls for. I freeze portions and use throughout the year when having chicken dinners &amp; mashed potatoes. I also make enough so I can send some home with my girlfriend with other Christmas dinner leftovers. Beat gravy I’ve made/had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda klopatek"
},
"reviewBody": "Wow! Just wow. This is fantastic. A little time consuming but the end result is worth it. Reheats beautifully with no lumps. I did reduce the liquid to 7 cups of stock. And couldn’t find Turkey wings so used 6 chicken wings. This will be my go to gravy. Thank you Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G Eaton"
},
"reviewBody": "I've been trying to find a reliable, tasty turkey gravy recipe for years. This one was my last attempt. Success! Velvety smooth and delicious. I am rating this 5 starts even though I made some adjustments. And I think Chef John's video was very helpful. NOTE: there *seems* to be a discrepancy between the ingredients proportions in the video versus what's listed in the printable recipe. In the video he says to use 2 parts onion to 1 part carrot and 1 part celery. The printed recipe says to use 1 large onion, 2 carrots, 2 celery ribs. Large is an objective term. I chose to use the video proportions. I'm wondering if this possible difference is why some people said their gravy was not very tasty. Also, I used 3 wings and 1 drumstick (for extra meat that I give my dog). I also decided to cook it in turkey broth rather than water and I added salt in this stage rather than waiting until the end. This guaranteed a very intense flavor and a lot of turkey fat, essential to a flavorful gravy. This will now be my go-to gravy for turkey forever. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaina Gutierrez"
},
"reviewBody": "This gravy is definitely worth the effort!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Marlow"
},
"reviewBody": "I make this every year and freeze it. It is really fabulous just the way the recipe is written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyLady"
},
"reviewBody": "This was absolutely amazing! I will do this every time I prepare a turkey. I cut off the wings from the turkey I had brined the night before and used a dutch oven so I didn't lose a drop of the roasted goodness from oven to stove top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jo Gibson"
},
"reviewBody": "My family fries the turkey so there is never any drippings to make gravy so this recipe is great. This will be the second year that I will have it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Leinbach"
},
"reviewBody": "Worked great with Turkey on the smoker. Didn't want the smokey flavor in the gravy so I made this as an alternative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "graile"
},
"reviewBody": "I used turkey thighs and legs, no wings available at the store. Thanksgiving just got tastier and easier at the same time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marcy"
},
"reviewBody": "Perfect! Had abode amount from this method, and made another amount from the roast turkey itself. One needs to remember that “ gravy is not a beverage.”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Candels"
},
"reviewBody": "Make ahead gravy is brilliant! It saves so much time and hassle on the holiday itself. Just reheat and you are ready to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I have been making Chef John’s recipe for quite a few years now. About the only thing I’ve changed is I add about 1/2 white wine to the gravy. Everyone raves about this gravy. It does freeze perfect so when you cook the turkey, having the gravy made ahead of time makes me feel less rushed. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUEGIRL5"
},
"reviewBody": "I made this last night for next week’s Christmas dinner, and it is in the freezer as we speak. Sure, it was time consuming, but not labor-intensive—it’s the kind of recipe where you perform a couple of steps, wrap a few gifts; perform a couple of steps, watch a little football...that kind of thing. The result was a silky, smooth, mildly flavored gravy that I can doctor up if needed on the day of the meal. Oh, BTW, my main course will be chicken, so I followed the recipe but used 10 chicken wings instead of turkey. I also used 4 cups of chicken broth and 6 cups of water. I ended up with exactly 6 cups of gravy, as predicted. Looking forward to serving this on Christmas Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "Excellent! Used turkey legs instead. Served it for our friendsgiving yesterday and everyone raved about the gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chocomom"
},
"reviewBody": "I would definitely make this again. Very pleased that one job is done for the Christmas dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MTD"
},
"reviewBody": "great. i (I have made it before) I used two turkry thighs instead of wings though. Used the turkey meat later for a savoury pst casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LVTurner"
},
"reviewBody": "Simply made the meal. Thanks Chef John for another great recipe and instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael Larese"
},
"reviewBody": "To be honest this just wasn't worth the up front effort to me. I feel like I might as well have just made the gravy the day I cooked the Turkey like I normally do. What you would expect Turkey gravy to taste like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy Fennell"
},
"reviewBody": "I rated this a 4 not a 5 simply because the amount of fat shown in the video from 2 turkey wings was misleading. I followed the recipe pretty much exactly except my store had no fresh thyme so I substituted fresh sage. I kept cooking and cooking my stock but barely any fat would bubble up! I wondered what was wrong. Thought maybe the sage somehow reacted with the fat and broke it down-I could have accidentally discovered the next diet craze, haha. Anyway I decided to refrigerate overnight so I would have some fat to skim off, thus defeating the main purpose of the recipe. I still had just a thin layer of fat, more like 2 tsp than 2 tbsp. I had made an herb butter to rub on my turkey and that recipe said to set aside the excess (the stuff that was NOT in contact with the turkey, just to be clear &amp; avoid giving people salmonella) for your gravy. I made the roux as directed by CJ, added the herb butter w flour for more roux, added the stock-it was probably pretty concentrated because I’d cooked it longer due to my no-fat problem-and thinned it a bit with potato water from the mashed potatoes. Then seasoned as directed. So I still was able to make the gravy before taking turkey out of oven, just not the day before like I wanted. It was very good, everyone complimented it, a beautiful dark color, no Kitchen Bouquet needed! and very herby from the herb butter. Regular butter would serve as well.But if you want to use all turkey fat, listen to other reviewers &amp; cook more wings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pegharris"
},
"reviewBody": "Worked like a charm the hard part for me is making sure the Rue is right otherwise easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pegharris"
},
"reviewBody": "Worked like a charm the hard part for me is making sure the Rue is right otherwise easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizzyt"
},
"reviewBody": "Made this for Thanksgiving dinner. Making it ahead of time is genius!! I would suggest a couple of changes. I saw other reviewers talking about the amount of water vs. the amount of turkey meat. I used 4 cups chicken broth and 4 cups water. I also increased the turkey wings to 4. It still needed more flavor. Next time I will use all broth and will probably add some turkey legs or thighs. Overall this was fantastic and a real time and stress savor for Thanksgiving day. I added the drippings from the turkey that day and it was fantastic. This will be my gravy from now on. I gave it four stars as written but with the adjustments it's definitely a 5 star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Ehrentreu"
},
"reviewBody": "Everything worked great. But after cooking the stock for three hours I had only 8 cups instead of 10. So I had to make more stock. Lucky for me I have an Instant Pot. The flavor of this stick is great and I used the reserved turkey fat for the roux. Then I combined the original stock and the Instant Pot stock to make the gravy. Since I used giblets for the IP gravy I chopped and added to it. Came out awesome and I had enough for dinner for 5 and two more dinners. I froze the rest about a cup and a half. Loved doing this ahead of time. Roasting the wings gives it such flavor and I added some pan juices. Too. Next time I will add more water while cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Valles Cevallos"
},
"reviewBody": "I made no changes and I will definitely make it ahead. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenWeber"
},
"reviewBody": "This was fabulous. It took our turkey dinner up a few notches. Granted I was never especially good at making gravy from pan drippings and this year the turkey was being made on the grill so I would not even have pan drippings. I followed the recipe. It took longer than expected but was very simple and the reward (the incredible tasting gravy) was worth it. I used the 10 cups of water and in the end only had 5 cups of gravy. Not nearly as much left as expected. Would have liked more leftover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaw Kitty"
},
"reviewBody": "I made this gravy 2 days before Thanksgiving this year. Yes, it did save time for the big day--all I did was reheat it on the stovetop. And I was very grateful. Of course, it took some time the evening I made it. It had to roast and then simmer for 3 hours. But the flavor was very good, somewhat subtle rather than WOW. I let some of the water evaporate while simmering to intensify the flavor. Will do this again next year. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "We will make this again next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "I would make it again but I would use at least 2 more wings\nLD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephicohu"
},
"reviewBody": "Make sure the meat falls off the bone about 4 hours. I used store bought turkey stock to give it more flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marybeth"
},
"reviewBody": "Perfect gravy! Made the day before. Excellent flavor and one less thing to do day of Thanksgiving!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Miller"
},
"reviewBody": "awesome! messed up and bought 4 chicken thighs, and it worked great, just required more water to cover which resulted in more broth. Threw the giblets in too since I'd started bry-brining the turkey already. I made the stock the day before Thanksgiving, and refrigerated it so I could prepare the gravy fresh while the turkey roasted. It worked wonderfully! I still only used 6 cups of broth for the gravy (froze the remaining stock), but found I needed 2 tbsp. more each of butter/flour to get it to the right consistency. Best gravy I've made over the years, and way less stressful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Proctor"
},
"reviewBody": "OH MY GOD! I could drink this it is so good! Followed the recipe to a tee. Perfect silky gravy. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Brewin Moncla"
},
"reviewBody": "I will use this as my go to gravy from now on. I do think I'll add either turkey stock or chicken stock instead of some of the water next time. I did use 4 turkey wings instead of two and I seasoned it well with lawry's seasoning salt and fresh ground pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTfreebird"
},
"reviewBody": "I have been using this recipe for a number of years, sometimes with variations. This year I couldn't find turkey wings, but got abut 5 necks to work with. The result was still the same... the best Turkey gravy! Ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ebeth"
},
"reviewBody": "Don’t change a thing about this recipe! It is amazing just as CJ intended! This is my second Thanksgiving making this and it is coming again next year. I’m notorious for ruining the gravy the DAY OF...this recipe is 100% redemption for back up jars from Thanksgivings past!!! Don’t be afraid of the cayenne. Flavor does not have to mean heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "It's delicious. I made no change to the recipe. If I needed to O would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chuck Garman III"
},
"reviewBody": "We doubled the recipe and cooked three large Turkey wings from the market. I’m just cooking those wings took over two hours. Her than that we follow the recipe right to a T. Fortunately he could use some kind of seasoning to kick it off. It only tasted like turkey gravy but I could’ve used a little more kick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "giggletush"
},
"reviewBody": "WOW!!!! I needed a gravy with no onions as I just found out I am allergic them. The only thing I did different was omit the onions and I had 4 turkey wings as that's what came in the package I bought. This came out FANTASTIC and I plan to save it for the next couple of days for Thanksgiving. THANK YOU!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine"
},
"reviewBody": "Love it - so easy to make ahead -"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Antoinette Katora"
},
"reviewBody": "Made it as written and it turned out great. Have my husband a taste and said he could drink it. Instead of throwing out the solids, I threw away the bones and, over a couple days mixed it in with my yellow lab’s dry food and she demolished it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tamara"
},
"reviewBody": "Great make-a-head gravy. I use chicken legs because that’s what I had in the freezer, about 10 of them. I doubled the recipe so I had to use 20 cups of water five of which were chicken stock or broth and two of which were white wine simply because I needed to use up the bottle of wine. Everything else was the same. I cooked the chicken legs for about two hours on 425. I’ve been simmered the broth for a good three hours maybe 3 1/2 hours. The consistency is smooth. The flavor is there. Not too overpowering not bland. I added a teeny bit of salt at the end along with pepper and a splash of poultry seasoning. This is a great recipe that anyone can alter to their taste buds and preferences. I think as long as you get the base right which is cooking the chicken in the oven for an appropriate amount of time for there to be a bit of “ char“ at the bottom of the pan then you’ll be fine with the rest. During the three hours that the broth is simmering you should taste it to make sure it tastes good. That is the point where you should also add a bit more seasoning to your liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dhallman"
},
"reviewBody": "This is definitely worth the time. It makes an extremely flavorful gravy that gets rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deanna's recipes"
},
"reviewBody": "This took a long time to prepare and like some others, I lost a lot of liquid while it was simmering. I added more water so that I could have 6 cups at the end. I also substituted white wine for 2 cups of the water. After I let the gravy simmer to thicken, I had to add salt and cornstarch to get the finished product. But I will have to say, I’m glad we won’t be making gravy on Thanksgiving Day-it’s already done!! So it was worth the trouble!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nlengel"
},
"reviewBody": "Fried turkey wings in buttered skillet with veggies, then placed everything in crock pot on low for 18 hours. One year I doubled recipe and used 1 recipe for making crock pot stuffing. Everyone loved that stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GL"
},
"reviewBody": "I've made this ahead now 2 years in a row as last year this gravy was a hit. The only thing i changed was to add the pan drippings from the turkey, lightly apple wood and hickory smoked on the grill and grilled to temperature.\n\nThe gravy is outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Suske"
},
"reviewBody": "Totally impossible to find turkey wings so I used a couple of chicken quarters. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Roberts Stamp"
},
"reviewBody": "Ok here's what I do. I make the gravy according to Chef John's recipe except, instead of adding 10 cups of water, which I feel is too much, I add 8 cups of Swanson (Swanson is best) turkey broth or chicken broth. That would be 2 of the 32 ounce boxes of broth. I also use 4 wings instead of 2, and add an extra 2 Tablespoons of flour to the roux. You want it to be quite thick because you will add the whole thing to your pan drippings later.\nOnce made, I taste it and, if I want more turkey flavor, I add a heaping teaspoon of the Better Than Bouillon turkey base. Mix it in and taste it again. I keep adding a teaspoon at a time until I like the flavor. On Thanksgiving, I take the turkey out of the roaster, pour all the drippings in a gravy separator (Oxo makes a great separator), throw out all the grease, then I add the drippings (minus the grease) back into the roasting pan. Then I take the make-ahead gravy and dump it into all those delicious drippings and mix it in as I heat it up. Make sure you get all the delicious stuff that has stuck to the pan mixed in. Believe me, your guests will be raving over your delicious gravy!! My husband calls my gravy \"the nectar of the Gods\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Was excellent, use this recipe all the time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve C"
},
"reviewBody": "Great recipe, It was cheaper to just buy a second turkey at .68 cents a pound rather than buy turkey wings. Winter time meals later on........Threw the neck and back bone in with the wings to roast. Had to strain out one lumps of flour but no big deal. Flavor is great. Salt and pepper and a pinch of poultry seasoning added. plus some of the roasted meat shredded up, a family tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neofoodie"
},
"reviewBody": "Just made this ahead of time for Thanksgiving, and it is excellent! The only thing I added was some chicken base since others thought it was a little bland with just water, and simmered for 4 hours instead of 3. Came out perfect and very tasty. I made quite a mess, and you have to commit the time to be around to keep an eye on the stove, but to save time on the most hectic cooking day around, no contest. Thanks again Chef John for another winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GAYLE521"
},
"reviewBody": "I have always struggled with the gravy on Thanksgiving, even to the point of buying it from the country club (big mistake). This was very good. I did use low sodium chicken broth instead of the water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lonn Kilstrom"
},
"reviewBody": "Excellent worth the extra effort. I make extra stock for my stuffing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "llvann"
},
"reviewBody": "This gravy is wonderful. It’s a fair amount of work, but it’s a great way not to have so much to do on Thanksgiving Day, especially at the last minute. I also feel it has nutritional value, whereas there really isn’t that much in the gravy you make at the last minute from pan drippings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perfessor"
},
"reviewBody": "Don't need to make any changes to this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gotrecipe?"
},
"reviewBody": "I made this gravy last year and I have to say, it saved the day! I had so much going on that it was wonderful to have this made ahead and it was really tasty. I may have tweaked it here and there (as I am in the habit of doing!), but basically stuck to the recipe. Thanks Chef John. Think I will be using this recipe a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Redwine"
},
"reviewBody": "This was a perfect solution to the problem of making turkey gravy from the turkey drippings after the turkey has been roasted. I often did not have enough gravy. I made 2 quarts of gravy from this recipe, and everyone was satisfied. I was able to use the gravy for several meals after Thanksgiving. \n\nI will try to spice it up more the next time I make it. (I don't use garlic, so have to use different combinations of pepper flakes and herbs to create a spicy dish.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Rogalski"
},
"reviewBody": "Love doing gravey this way tastes great and is a real time saver when guests arrive and it’s time to put dinner on the table. I was amazed at how great my gravy turned out. I’ve used this recipe for turkey and pork both are perfect , thank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "Been making this for the last 3 times I've roasted a turkey for the holidays. I use whole turkey wings that include the drummette, wing, and tip. I found that carmelizing the vegetables during the roasting process produces a richer flavor and color to the gravy. I add cooked chopped giblets to the gravy. This is the gravy I serve with the bird for the big meal. After guests are gone and the kitchen is mine again, I make traditional gravy from the roasted bird drippings. This way there's less panic and plenty of gravy for leftovers and pot pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debs55"
},
"reviewBody": "Love this gravy! It’s a little bit of work but would rather do it the day before than on Thanksgiving Day. Thanks for posting this one!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catiejan"
},
"reviewBody": "No changes needed. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken Schroeder"
},
"reviewBody": "5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lolly"
},
"reviewBody": "I made this for Thanksgiving and it was surprisingly good. I had 2 large wings and a back, which I oiled and put in a jelly roll pan at 350. An hour or so later, I added the vegetables and roasted it for another hour and a half or longer until it was a lovely golden color. I did keep an eye on it. Then I followed the directions as written, though I didn't have fresh thyme. Simmered it a long time until the meat was falling off the bones, then I strained it and let it cool. Put it in fridge overnight, skimmed off the fat, heated it up, strained it thru cheesecloth, and continued with the recipe. It was very good. The meat from the bones was a hit with the dogs and the gravy was a hit at the table. Will do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Brennan"
},
"reviewBody": "Excellent receipt. I usually try to make it exactly as listed, but I was not able to get turkey wings. I used turkey thighs and I also used the neck. I did add a table spoon of better then bullion chick stock. My wife, who is not a gravy fan, loved it. Easy to make and full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trink"
},
"reviewBody": "I used 5 turkey necks instead of wings (they were cheaper at the store)...GREAT flavor. I didn't have fresh Thyme, so used 1 tsp. thyme leaves. I also added 1 tsp. minced garlic, 1 bay leave and 1 tsp. chicken bouillon to the stock. \n\nI cleaned off the meat from the necks and used it for my bread stuffing (let's not waste). \n\nI was worried that the gravy wouldn't reheat well (I was afraid it would break down and be runny). I was pleasantly surprised...I had rave reviews. \n\nMaking the gravy ahead of time, took a lot of stress out of getting everything on the table at the right time and I enjoyed more time with my guests. I love homemade gravy and will not buy that stuff that they sell in jars at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "netryder"
},
"reviewBody": "My grocery store was out of turkey wings so I substituted turkey legs. That was the only change I made to the recipe. The gravy received rave reviews from all my family and guests. \"The best you have ever made.\" I made the gravy two days ahead of time. Reheated it and voila, fantastic gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goldpanman"
},
"reviewBody": "Excellent gravy! Takes a while to make it but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missmoxy"
},
"reviewBody": "The only change I made was 4 wings instead of two, and that's only because that is what I bought and I wasn't about to let the wings to to waste.\n\nDelicious gravy, there was none left. My only complaint is that next year I have to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimagility"
},
"reviewBody": "Perfect way to take stress off Turkey Day! I only had bread flour, but it turned out very well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Timmons"
},
"reviewBody": "Good flavor but the gravy came out grainy. I’m not sure if it was the recipe or me, to be honest. I did triple the recipe to make a larger amount for Thanksgiving - it was way too much. I probably would have been fine with the original serving size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Kersh"
},
"reviewBody": "My husband loved this gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gregg"
},
"reviewBody": "This was the first Thanksgiving that, 1 I had plenty of gravy for everyone and some left over, 2 did have to go crazy trying to make gravy after smoking and frying turkey. Tasted amazing and everyone loved it after putting a few personal touches to it before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Brown"
},
"reviewBody": "Best turkey gravy we ever had. The turkey wings we bought were really very large, so we used 2X the mirepoix veggies and all the water listed. We had to use dried thyme which turned out fine (but might have been better of course if fresh was available). Roux directions were really helpful. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindykay"
},
"reviewBody": "So good this is the recipe to use I didn't add cayenne but did everything the recipe said I had 8 adults and 3 children and everyone wanted some to take home with the turkey I will definitely double the recipe next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBRIS3447"
},
"reviewBody": "If I could I would give this recipe 10 Stars. I’ve made it 3 years in a row, it is perfect. My family and friends call it Liquid Gold. Although it takes a long time, it’s simple and easy and worth it. I will never make any other turkey gravy. Just DELIS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evgeniya Bell"
},
"reviewBody": "Used this recipe for my first gravy. I used smoked turkey stock that I saved from cooking split pea and smoked turkey. I followed the rest of the recipe. Used garlic. Absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martha Stepnowski"
},
"reviewBody": "Particularly impressed with how smooth it is, and it's hours before the turkey dinner and the gravy is ready! Want to know how it will be when i add in some turkey drippings too."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230049/chef-johns-make-ahead-turkey-gravy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
"name": "Gravy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16857/side-dish/sauces-and-condiments/gravy/turkey-gravy/",
"name": "Turkey Gravy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230049/chef-johns-make-ahead-turkey-gravy/",
"name": "Chef John&#39;s Make-Ahead Turkey Gravy"
}
}
]
}
}
, "about": [
]
}
]