				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Lasagna"
,"datePublished": "2013-07-29T17:54:41.000-04:00"
,"dateModified": "2022-11-26T12:02:56.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Chef John&#39;s lasagna is made with layers of a thick, hearty meaty marinara and a super cheesy mixture of ricotta, Parmesan, and fresh mozzarella."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KvlyUb1xJQyJYg9A5L_W2jKMWfs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5062146_original-69829af4bfc143228d1c5a3970e554d1.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2560206301001",
"description": "Discover the two keys to a great lasagna.",
"duration": "PT6M22S",
"name": "Chef John’s Lasagna",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/10/14/5062146_original.jpg",
"uploadDate": "2021-06-30T23:46:19.768-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "436"
}
,"cookTime": "PT195M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "730 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "159 mg"
,"fiberContent": "5 g"
,"proteinContent": "43 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "1514 mg"
,"sugarContent": "14 g"
,"fatContent": "39 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1.5 pounds lean ground beef",
"1 pound bulk Italian sausage",
"1 (8 ounce) package fresh mushrooms, coarsely chopped",
"1 teaspoon salt",
"0.5 teaspoon freshly ground black pepper",
"0.5 teaspoon Italian seasoning",
"0.25 teaspoon red pepper flakes",
"6 cups prepared marinara sauce",
"0.25 cup water, or as needed",
"1 (16 ounce) package lasagna noodles",
"2 large eggs",
"2 pounds whole-milk ricotta cheese",
"8 ounces fresh mozzarella cheese, diced",
"0.66666668653488 cup freshly grated Parmigiano-Reggiano cheese",
"0.25 cup chopped fresh parsley",
"1 teaspoon salt",
"0.25 teaspoon freshly ground black pepper",
"1 pinch cayenne pepper, or to taste",
"4 ounces fresh mozzarella cheese, diced",
"0.5 cup freshly shredded Parmigiano-Reggiano cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make the sauce: Cook and stir ground beef and sausage in a large saucepan over medium heat until browned and crumbly, about 10 minutes. Stir in mushrooms, salt, black pepper, Italian seasoning, and pepper flakes. Increase the heat to medium-high and cook until mushrooms have given off their juices and the bottom of the pan is almost dry, 4 to 6 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour marinara sauce into meat mixture. (If using jarred sauce, add a little water to each jar and shake to get all sauce out of the jar; add to meat mixture.) Reduce the heat to low and simmer until meat is extremely tender, about 2 hours; add more water if sauce becomes too thick. Skim fat, then season sauce with salt and black pepper. Turn off the heat."
} ,{
"@type": "HowToStep"
,"text": "When the sauce is almost finished, make the pasta: Bring a large pot of salted water to a boil. Cook lasagna in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain and rinse lasagna noodles; set aside in a bowl of cold water."
} ,{
"@type": "HowToStep"
,"text": "While the pasta is cooking, make the filling: Whisk eggs in a large bowl, then stir in ricotta, mozzarella, Parmigiano-Reggiano, parsley, salt, black pepper, and cayenne."
} ,{
"@type": "HowToStep"
,"text": "When the sauce, pasta, and filling are ready, preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Divide sauce into fourths, noodles into thirds, and filling in half for layering. Layer ingredients in a 10x15-inch baking pan, spreading out to fill the pan, as follows: one part sauce, one part noodles, one part filling. Repeat once more. Add one part sauce, then tap the dish lightly on a sturdy work surface to settle the layers. Continue with one part noodles and one part sauce. Sprinkle remaining fresh mozzarella and Parmigiano-Reggiano over top."
} ,{
"@type": "HowToStep"
,"text": "Cover the baking dish with aluminum foil, making sure it doesn&#39;t touch the cheese. Place onto a baking sheet to catch any spills."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KvlyUb1xJQyJYg9A5L_W2jKMWfs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5062146_original-69829af4bfc143228d1c5a3970e554d1.jpg"
}
]
,"text": "Bake in the preheated oven for 30 minutes. Remove the foil and continue to bake until golden brown and bubbly, 30 to 35 more minutes. Let sit for 20 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT240M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debkatherine"
},
"reviewBody": "My family loves this lasagna. I used to make the World's Best Lasagna recipe until I tried Chef John's. It'a notch above. The only thing I do differently is purchase 2 (8oz) packages of the soft round ball type mozzarella, one for the ricotta cheese mixture and the other to shred (yes it will shred) for the top. I found 4 oz for the top was just too little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItsmeChickadee"
},
"reviewBody": "This lasagna was spectacular! I didn't have any jarred marinara, so I made my own. Lasagna is always a time consuming recipe, but this was so worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alycen Farrell"
},
"reviewBody": "This was incredibly simple and delicious. I made half the recipe with a pound of Italian seasoned ground turkey , a little more mushroom and a few cups fresh spinach, added to the sauce a few minutes before assembly. My husband and teenage boys devoured, Cheers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "It was perfect and my husband said it was my best lasagna ever. No need to cook all the noodles though. I cooked a 16 oz box per the recipe and used about 1/3. I don't overlap as much as Chef John. Only change is what I always add: cooked and well-drained spinach is added to the ricotta filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dasher"
},
"reviewBody": "Only 3 layers? Come on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There is no better recipe for lasagna on the planet! I made the World's Best Lasagna recipe on this site and Chef John's is better. I've made many lasagnas in my day. One thing that I do is to drain the noodles individually on paper towels. Otherwise the water from the noodles can weaken the flavor of the sauce. You can't go wrong with this recipe. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "Best Lasagna I ever made. Just the right amount of heat too. Thanks Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I actually bought my first lasagna pan to use for this recipe. What a difference. I love it! Also I love that mushrooms were incorporated into this recipe. Yum! I did not use pork sausage (I don't like it). I used lean ground meat (97% meat 3% fat) with jarred marinara sauce that I doctored up to my taste. If you use tasteless marinara sauce, the taste of your lasagna will reflect this. Also I did not add water. The mushrooms did that for me. This is a great lasagna recipe! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimlackey"
},
"reviewBody": "This is the best recipe I’ve ever tried. If you gave it less than five stars then you need to try a better marinara than the one you used or you did something wrong. My family loves this lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Price"
},
"reviewBody": "This was amazing. Used deep dish lasagna pan and it was filled to the brim. I always round up. 2# ground chuck + 1# spicy Italian sausage. 2/3 c cheese, I had 1+ cup. It was delicious. Highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mishy"
},
"reviewBody": "I added 1 tsp fennel, fresh chopped basil, Italian parsley, and 1 cup of wine to the sauce and it gave it a rich depth of flavor. Please use only whole fat Ricotta as the flavor was far superior. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a perfect recipe for a Sunday dinner in the fall. Very easy to make and quite flavorful. I think I might have skimmed off too much fat in the process as it was a bit dry. I learned my lesson and will let it go in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "This turned out delicious. The instructions were great and easy to follow. The video was entertaining. I used my own homemade meat sauce but supplemented it with a jar marinara. Instead of making one big dish, we split the noodles in half and baked it in two smaller casserole dishes so we could freeze one immediately. We didn't use mushrooms and also eliminated the salt and cayenned in the ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurel Anne"
},
"reviewBody": "This was amazing! I made it with no boil pasta and it turned out perfectly, no changes needed. I am after all, the Asta, of using my favorite pasta! I skipped the mushrooms and added a little bit of garlic powder and I might use a little more Italian seasoning next time - but overall, this is a winner and will be in regular rotation now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I always find a great dish when I use Chef John’s recipes. This is the BEST I have ever constructed and my family and friends celebrate me every time. However I must admit I had to add celery, onions and plenty of garlic to John’s recipe to make it my own and celebrate Italian cuisine! Also good after frozen and reheated, just add a bit more sauce during the reheating. Goes great with a lovely Chianti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cr6432"
},
"reviewBody": "Added a fourth layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dylan Josselin"
},
"reviewBody": "I kinda combined this recipe with the worsts best lasagna recipe also on allrecipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Jim"
},
"reviewBody": "Chef John is the best! Amazingly tasty as always. Making it again next week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoeN"
},
"reviewBody": "I made Chef Johns's lasagna for a friends birthday and it was delicious. Prep is easy and the flavors are delicious. I will be making it again this week for a dinner party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! Has anyone tried with no cook noodles?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monrovia"
},
"reviewBody": "This is melt in your mouth, fine restaurant quality lasagna. I make this for 2 of us and we eat it for many days, sometimes lunch and dinner. I used cheap Ragu sauce and it was just great. I think with the super long simmer, that it's all about that sausage and beef. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Metzger Lloyd"
},
"reviewBody": "Amazing! I will be definitely be making this for company again! Everyone loved it. Like other people, I made the sauce the day before. Easier to prep that way! One question though. Why does the recipe call for 2 lb of mozzarella when you only use 1 1/2 lb?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassondra Kaczmarczyk"
},
"reviewBody": "Not all lasagnas are created equal. This is the lasagna you will crave above all others. I made this recently for a luncheon, and I wanted to bring it from home so it'd be warm, so I insisted in driving it there right before the luncheon. So I live in a big bustling area and right as I was getting off the freeway the vehicle in front of me suddenly stopped there had been a fender bender. There'd also been an accident in my car well I managed to save most of the lasagna the topping was done the noodles were every which Way in the wonderful layers I had so carefully made now look like a tangled mess of brain in a pan. So with my funny story I left lasagna with my partner the luncheon was for him. All that said and damage done- five people asked for the recipe. Make this and if you're taking it somewhere drive carefully accidents happen and even after an accident this was still the best lasagna anyone in the room had ever eaten. Can't go wrong with Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely divine. It is the world’s best lasagna hands down. It’s my go-to lasagna during Christmas gatherings as well as a delicious dinner when we have guests over. Try it out, doesn’t disappoint!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Edgar"
},
"reviewBody": "Everyone loved it. Next time, I would make more sauce and maybe make it a little bit spicier - personal preference. This took me longer to cook than I expected. I used the app on my phone so I think 205 minutes didn't translate easily to 3 hours and 25 minutes in my mind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Hand"
},
"reviewBody": "I make it all the time. My Family always asks me to make it at Christmas. It really is the end all be all lasagna in my opinion. 😎👍"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "My family loves this recipe! Used ground pork with beef for one pan and 100% beef for another. Both were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slayen"
},
"reviewBody": "John, I hope you are happy as you've ruined store bought Lasagna for me. An absolute banger of a recipe. Can sometimes be a bit tricky eyeballing to make sure you portion out right for the layers, but even when you mess up a bit it still is one of if not the best Lasagna my family has ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pearl"
},
"reviewBody": "Sauce: My go-to for all Italian recipes that call for red sauce. Lasagna: perfection! My Italian in-laws approve!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Dumouchel"
},
"reviewBody": "Family said it was the best lasagna they'd ever had and they weren't just yanking my chain! Fit perfectly in my Detroit pizza pan, right to the top. Well done, Chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WannabChef"
},
"reviewBody": "I liked this recipe because you add mozzarella to the ricotta mixture which makes in more cheesy with each bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Redd"
},
"reviewBody": "This was the best lasagna I’ve had. I didn’t have pork so I used more ground beef and as we hate ricotta I used cottage cheese instead. My husband hates lasagna and he loved it. The lasagna didn’t look pretty but it tasted great. Chef John, I am NEVER disappointed with your recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "auntbeast"
},
"reviewBody": "I've never made lasagna before and it didn't occur to me that the noodles would soak up so much. Any flaws were to be blamed on me, the recipe is fantastic. I will make it again, but make the sauce soupier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Broome"
},
"reviewBody": "Best taste. Just added a small can of tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Maule"
},
"reviewBody": "Ohmygosh, Chef John! I just waddled back to my spot to eat thirds, and I’m definitely going to gain a solid ten pounds because of this recipe. This doesn’t fit in my regular 9 x 13 inch pans, so if you try that route expect it to boil over into the oven. That would be a sad, sad waste of this amazing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "Great comfort dish with easy-to-follow instructions. The family keeps asking me to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mas"
},
"reviewBody": "My family really liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thanks, Chef John. I made this - it was not the first recipe of yours that I've loved, but my daughter mentioned today that I should browse Chef John's recipes more often. This was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Figard"
},
"reviewBody": "I made this recipe and it is amazing. I am not much of a fan of mushrooms so I skipped them but I did add one medium fire roasted diced red pepper, a couple of big pepperonis in the middle and 4 more on top. Can hardly wait for it cool and dig in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boone K"
},
"reviewBody": "This recipe is amazing. Only change was to add garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nitrous dude"
},
"reviewBody": "excellent! the mix of cheeses is great! My only two changes... 1) added a bit of fennel seed (the sausage likely has some - more is sometimes better!) and 2) a bit of sugar. \n\nThis recipe is a clear must, if you need to help out a friend/neighbour during these trying COVID times...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "Dear Chef John - I have tried several of your recipes and every single one of them has been delicious! Your Lasagna is superb! Everyone who has tried this lasagna has asked for the recipe! And I am always happy to refer them to All Recipes and Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Ineman"
},
"reviewBody": "Unbelievable lasagna!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecile Crowley Zurawa"
},
"reviewBody": "Best lasagna I ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Butterfield"
},
"reviewBody": "Love this! My new go-to lasagne!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Moot"
},
"reviewBody": "Fabulous recipe. I have been making lasagna for years and years, but my husband said that this was the best ever. I followed the recipe, except for adding a few more mushrooms. Also, I made it a day ahead, so it took a bit longer in the oven, but I expected that. Do try it, you will be very satisfied."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene Jackson Hollomon"
},
"reviewBody": "It's the perfect recipe, like my mother use to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucie"
},
"reviewBody": "Made this to the directions. Only difference was I made the noodles rather than store bought. Absolutely delicious and all my family loved it! It does take time but worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb “Deb” M"
},
"reviewBody": "Absolutely love this recipe. My family does prefer a meatier lasagna so I use 1 lb of turkey on top of the sausage and hamburger. So good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renny2fast"
},
"reviewBody": "This is the best lasagna I have ever made. I omitted the mushrooms. Used 2 jars of Roa's marinara sauce 32oz each. I only let meat sauce simmer for 30 minutes. 1 pd beef and 1 pd sweet Italian sausage. I did not boil my noodles. Just layered regular uncooked noodles and baked 50 minutes. This will be my all time favorite recepie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shirl"
},
"reviewBody": "Sooo yummy....I did have a couple personal adds of minced red pepper, onion and garlic....rest was as stated....\nMy pan was a bit too shallow but didn’t alter the taste,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J S"
},
"reviewBody": "I followed the recipe exactly as shown and it was delicious. Everyone loved it; I will definitely make it again. This is now my \"go to\" lasagna recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stinker47"
},
"reviewBody": "This is one our favorites! We usually make it in two smaller pans with one using a tofu based ricotta substitute (needs to be dairy free) and goat cheese instead of mozzarella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki R"
},
"reviewBody": "Well my version of Chef Johns Lasagna did not turn out as \"pretty\" as his but is was without doubt the best lasgana I've ever made. I would post a photo but I don't know how to make my photos small enough for this format. Oh well, I made it and followed the recipe using only top of the line and fresh ingredients. Served it to my husband for his Christmas Eve dinner and he wants it again all week! Thank you Chef John for sharing your great talent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kerri"
},
"reviewBody": "This recipe was wonderful, I made it exactly as written. The video was so helpful. You must use a 10 x 15 inch pan, this is huge. Will make this again for sure. Would have taken a picture, but it was gone before I thought about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "Really a good recipe. Everyone thought it was delicious, even the foodies in my family. Just noting what I did so I know how to replicate. Followed the directions, but added 1/2 onion, 4 cloves of crushed garlic, extra 1/2 tsp of Italian seasoning, and splash of red wine to meat sauce. Added 1/4 tsp of nutmeg to the cheese sauce. Soaked the noodles in hot water for 10 minutes before putting it together. Baked covered at 400 for 45 minutes, then uncovered for 350 for 25 minutes. Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FRITZIE"
},
"reviewBody": "I made a couple minor changes but LOVED this recipe. Instead of using parsley in the cheese filling, I had a small amount of frozen chopped spinach leftover from another recipe so I thawed that and added it. I also added about a teaspoon of sugar to the sauce towards the end. Other then those minor changes, I followed the recipe as written. It was very very good and I will definitely make again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quiqui Dagle"
},
"reviewBody": "Absolutely the best lasagna I’ve ever made and eaten. I doubled the sauce and filling recipe, made one with regular noodles and one with gluten free noodles. I had no choice but to make a change. I didn’t have enough ricotta cheese so I added a full container of sour cream. I adjusted the seasonings to my liking and wow! Perfection. I’m never disappointed with your recipes even when I have to tweet them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin L."
},
"reviewBody": "Absolutely delicious! Whole family ate it. Used \"Stephanie's Freezer Spaghetti Sauce\" recipe on this site for my marinara (which is my go-to sauce for my abundance of summer garden tomatoes). Added onion to the beef/sausage while browning, and just a tad more sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Campbell"
},
"reviewBody": "Well thought out recipe. My own reason for 4 stars instead of 5 is the commercial marinara sauce. Fresh herbs and cheese and all this work deserve a home made sauce. I made my own sauce for this using tomato paste, crushed tomatoes, tomato sauce, Italian seasoning, garlic, red pepper flakes and red wine. Changes I made: omitted salt from the cheese mixture and added 1/2 c. diced onion while meat was browning. I also noticed the ingredients call for a total of 16 oz. of mozzarella but only 12 were used in the recipe. I just topped the lasagna with the other 4 oz. A little more cheese on lasagna is only an added perk! I used uncooked noodles for the first time ever and was impressed with the texture. I had to purchase two, 12 oz boxes though, to get them to fill my 10 x 15 lasagna pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Graham-Melville"
},
"reviewBody": "I used canned whole tomatoes instead of marinara- I like the textural interest.\n\nChef John, you have created a lasagna better than my grandmother’s, a feat I would not have believed possible. Bravo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "radraye"
},
"reviewBody": "I’ve made this lasagna a lot oh times for my family and my fiancé. I don’t eat it but they love it. When I told my niece I was making Chef John’s lasagna she said yummmm I love ur lasagna. She’s coming over tomorrow to get some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristina"
},
"reviewBody": "My family always asks me to make the lasagna - this is the recipe I use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mya Hickok"
},
"reviewBody": "This was a great lasagna recipe! I did add an additional cup or so of sauce on top of the last layer of noodles because we like lots of sauce. Next time I’ll add onion &amp; garlic to the meat when cooking. It reheated great the next day too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Breslin"
},
"reviewBody": "This was a phenomenal meat sauce recipe. I did only use 1lb of beef, as that was all I had on hand, and it was still an incredibly flavorful lasagna. I served this with an eggplant spinach lasagna for a dinner party and it was a huge hit. I’m sure I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Crocker"
},
"reviewBody": "I have made many of Chef John's recipes and they have all been really good!! this lasagna recipe is over the top delicious! I freeze leftovers in single servings to make it easier for family members to grab and go or heat in the microwave. thanks as always Chef John for another great recipe! !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "questans"
},
"reviewBody": "I used brown rice lasagna noodles and liked their silky texture. Also added a bit of chopped pepperoni. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Bauer Thompson"
},
"reviewBody": "Perfection. I used 1 lb. turkey breakfast sausage added Italian seasonings, 1 lb. ground beef to instant pot frozen. Pressure cooks for 20 minutes. Broke up small pieces then added all the sauces ingredients to that and sautéed for about 15 minutes. Added a little sugar and 1 small can of tomato paste to thicken, layered in Pamper Chef crock large lasagna pan with the crock doomed lid. Let sir and settle then put on my pellet grill at 325* for 45 minutes. Took off like for 20 more minutes. Golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Quinones"
},
"reviewBody": "It was the best lasagna Ive ever tried, everyone loved it, received many compliments"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arlene Nash-Hanner"
},
"reviewBody": "Loved this recipe! Made sauce the day before so preparing it, though usually a cumbersome task, was very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bladebrown"
},
"reviewBody": "This dish is a HIT in my family. Made it a couple times for different family events and everyone loves it. Whenever I search a new recipe I always check to see if Chef John has a version available lol. \n\nAlso, I ALWAYS follow the recipes to a tee on however suggested. However, only thing I settle for is the whole milk ricotta. For some reason the grocery near me has 32 oz (2lbs) skim milk and a 28 oz whole milk ricotta. I always settle for the 28 oz and it still comes out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLWScottsdale"
},
"reviewBody": "Delicious!!! I made one little substitution - used shredded mozzarella rather than fresh mozzarella to make it more budget-friendly. But it was seriously yummy! I can only imagine how wonderful it would be with fresh mozzarella!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keeler"
},
"reviewBody": "This is the first Lasagna I have ever made, and it is the best one I have ever eaten!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "old fashion cooker"
},
"reviewBody": "At first I didn't like this so much, then, the more I ate, the more I liked it. The flavors grew on me with each passing day, I suspect, when I take out the second dish from the freezer, it will be the best Lasagna of all time! Even though I eat fresh mozzarella, I had never cooked with it, now I will never buy the \"other\" kind again.. So, give it a go, make what ever changes you want, just stick with the basics and it will be good. Next time for me, less meat, more veggies and cheese, cheese, cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Truman Bernhard"
},
"reviewBody": "No changes, Wife and Mother-in-law loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow this is absolutely the best Lasagna I have ever made. Cooking the meat and sauce for a couple hours was the key. Several other recipes I tried leave a runny lasagna. My husband does not love Lasagna but he actually said this was really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tclark1865"
},
"reviewBody": "Wow this is absolutely the best Lasagna I have ever made. Cooking the meat and sauce for a couple hours was the key. Several other recipes I tried leave a runny lasagna. My husband does not love Lasagna but he actually said this was really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amore"
},
"reviewBody": "Yes I substituted ground turkey for the ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coley Emde"
},
"reviewBody": "Do yourself a favor, cook it a little less time a day ahead and then reheat for about 40 minutes at 350 degrees covered with foil. The flavors have blended together, sooo good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Thomas"
},
"reviewBody": "No changes. Simply awesome. \nAnd it gets better on days 2-5 as leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyMarie"
},
"reviewBody": "This is the third lasagna recipe I've tried, and I finally found a winner. I did use my own meat sauce that lets me sneak extra veggies in and only used half the ricotta because I'm not a big fan. And both my boyfriend and I loved it. Next time I need to cook my meat sauce down a bit more so there is less liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyMarie"
},
"reviewBody": "This is the third lasagna recipe I've tried, and I finally found a winner. I did use my own meat sauce that lets me sneak extra veggies in and only used half the ricotta because I'm not a big fan. And both my boyfriend and I loved it. Next time I need to cook my meat sauce down a bit more so there is less liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skvgrg"
},
"reviewBody": "Made it just as directed... Family really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gertie"
},
"reviewBody": "Best ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Lake"
},
"reviewBody": "It was so easy and the taste of it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susannel7888"
},
"reviewBody": "Loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Freshcorn Dever"
},
"reviewBody": "Chef John, do you put cayenne pepper in everything? I love it! As usual, I wouldn't change a thing. Just be careful with the sauce. Mine was too dry, my fault. Plus be sure to save enough sauce to cover the top layer.\nI am going to make another to freeze while I have the cheeses!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Heady"
},
"reviewBody": "I really enjoy Chef John's recipes and this is no exception.\nI didn't have lasagna noodles but had rotini which stayed together despite. I like my Italian food saucy so I added sauce on top to my plate. Yummy!!! Hubby ate two giant pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "One of the two best recipes for lasagna I've found (the other was in Bon Appetit using smoked mozzarella and proscuitto). Rather time consuming to make, but such wonderful results! Worthy of company!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nifty Deb"
},
"reviewBody": "Made this while \"quarantined\" because I had time to kill and all of the ingredients. I did make and use a homemade tomato sauce, best lasagna we've ever had. Recipe posted under NiftyDeb"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pkelly"
},
"reviewBody": "Love this lasagna! Great flavour, nice texture. Takes a bit longer but well worth it. Added a bit of spinach to the cheese layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ron"
},
"reviewBody": "I used left over boneless chicken thighs from the night before, seasoned with onion powder paprika ground, cayenne pepper. Italian sausage, and I added 1 1/2 cups more of Rocca cheese. to the cheese mix.\nmade my sauce with s &amp; w Mexican recipe tomato's. and tomato sauce cooked the sauce for 2 hours before adding the meat. after adding the meat cooked an additional 2 hours.\nwow. no left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Followed the recipe from beginning to end. It turned out beautiful and tasted delicious! Served it as Friday night supper to 14 family members. Everyone loved it! It took a while to prepare, so make sure you have ample time. I did mine in advance and froze it; reworking it for the dinner. I’ll definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hastypuddn"
},
"reviewBody": "This recipe was very flavorful even though I didn't include the sweet sausage. I used 2% cottage cheese and packaged grated mozzarella and it was still delicious. Mixing the cheeses into the cottage cheese nicely simplifies the recipe. I used a tablespoon of Italian seasoning and mixed spinach into cottage cheese. I used \"oven-ready\" noodles, though left the top layer of noodles off fearful that they'd be too crisp. Used half the salt and it was still salty. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shiela Linkroum Baudendistel"
},
"reviewBody": "I make it just as written. The secret is simmering the sauce. Don't cheat on the time. It's worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "123goodfood"
},
"reviewBody": "We made this lasagna and it turned out pretty great! The meat sauce was AMAZING, but there should have been a bit more. The ricotta sauce was good. We used no-boil lasagna noodles. They were slightly overcooked. Next time, I would make more meat sauce, and boil my own noodles. Overall, it was pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aimeeintx"
},
"reviewBody": "My 12 year old daughter asked me to teach her to cook. Her first dish she wanted to make lasagna. This is the recipe we chose. It was easy for her to follow and she did a great job. We didn't change a thing. I just recommend simmering your sauce for a few hours. Like my grandma taught me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "angelinamarie3"
},
"reviewBody": "I adore most every recipe Chef John publishes! This one was no different, but, needs a little tweak or two. First- what kind of Italian dish doesn’t include garlic?! That is a MUST! I added in 2 minced cloves. And, the sauce turned out to be way too watery. I opted not to add any water to begin with, even though it calls for it, and still ended up removing over 2 cups of excess liquid from the simmering sauce after 2 hours. So, I don’t recommend adding any water at all! You’ll need to strain out what is already liquid, to begin with. The ricotta sauce was plentiful. But, I feel an additional egg should be added- it was a little dry. I only ended up using about half of the noodles. And the pan was well overflowing- definitely need that drip tray! Hindsight- place tinfoil down!! I also felt the cheese was a little weak. The recipe didn’t say what to do with the remaining 8oz of fresh mozzarella, so I dumped ALL of the remainder on top and that was a fantastic move! It created the perfect, slightly browned but melty top layer. The final result was delicious! There is definitely something to be said about letting that sauce simmer for 2 hours! But- add some fresh garlic &amp; use ALL the cheese! And don’t add any additional water! The flavor is fantastic &amp; I will definitely make this again with the tweaks."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/233661/chef-johns-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/233661/chef-johns-lasagna/",
"name": "Chef John&#39;s Lasagna"
}
}
]
}
}
, "about": [
]
}
]