				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Caramel Apple Pie"
,"datePublished": "2012-04-04T17:23:57.000-04:00"
,"dateModified": "2022-11-10T19:27:04.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "A classic caramel apple pie recipe with a twist! The caramel filling sauce is poured over the lattice-top of the pie, giving it a more intense flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RN_8wmjXhEymFMBQ8VDPKgLmJx4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3939816-chef-johns-caramel-apple-pie-Chef-John-1x1-1-d699b2ac222c451492cd2282c143a617.jpg",
"height": 910,
"width": 910
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1183664231001",
"description": "Caramel Apple Pie - The Best Apple Pie Ever!",
"duration": "PT3M39S",
"name": "Chef John's Caramel Apple Pie",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/3dd1af78-7b48-4528-b260-ae1cf852c9b4/f3938f6b-5c62-4e37-b8e9-cd567adabf60/1280x720/match/image.jpg",
"uploadDate": "2021-06-24T20:28:03.287-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Caramel Apple Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "468"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "336 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "3 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "142 mg"
,"sugarContent": "35 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 cup white sugar",
"0.5 cup brown sugar",
"6 tablespoons unsalted butter",
"0.25 cup water",
"0.25 teaspoon cinnamon",
"1 pinch salt",
"1 pastry for double-crust pie (see footnote for recipe link)",
"5 apples - peeled, cored and sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine white sugar, brown sugar, butter, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices."
} ,{
"@type": "HowToStep"
,"text": "Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal."
} ,{
"@type": "HowToStep"
,"text": "Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RN_8wmjXhEymFMBQ8VDPKgLmJx4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3939816-chef-johns-caramel-apple-pie-Chef-John-1x1-1-d699b2ac222c451492cd2282c143a617.jpg"
}
]
,"text": "Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Have been making this for years, thanks Chef John !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Jacobs"
},
"reviewBody": "everyone loved it. I didn't make any changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I made this on the weekend, exactly as instructed. Other reviews suggested that the pie had a 'soupy' consistency, so I was a bit worried when I forgot to coat the apple slices in flour, as was suggested in some of the reviews. I made the pie late in the morning and we had it in the evening. The caramel soaked in perfectly and there was no 'soupy' problem. I think it has to really cool for several hours in order to avoid excess liquid. I'll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Miller"
},
"reviewBody": "This pie comes out stunningly perfect every time. I do follow Chef John's instruction to toss the apples with a couple of Tbl's of flour so that the cooked filling is a little more \"saucy\" rather than runny. It's so good and SO EASY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin M"
},
"reviewBody": "Did it over Christmas doing it again today I like the thicker sauce so wet the apples and and tossed in a colander with some flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dre"
},
"reviewBody": "My husband made this for a Christmas gathering. Not only was it so easy to make, it was delightfully delicious!! Thanks for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce McAdams"
},
"reviewBody": "I have made this many, many times. yes it is soupy but people don't seem to mind. I did roll my apples in corn flour , this helps some. People love the sugar crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E the G"
},
"reviewBody": "This pie is so incredibly yummy you'd never guess how simple the ingredients &amp; process are! Everyone I've served it to has totally loved it &amp; I'm frequently asked for the recipe. Do I dare share, Chef John, my go-to, my secret ace up my sleeve for all things exceptionally delicious???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was really good. I pre cooked the apple's so it wouldn't be watery but I don't think enough. It was still a little watery. I think I will try using corn starch next time to avoid it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Pendleton"
},
"reviewBody": "This pie tasted great. I read all the reviews first. I made the syrup and thickened it as suggested in the reviews. Still ended up soupy and the crust didn't look cooked even thou it was. Next time, I will add the caramel BEFORE the lattice top, People loved it, even though it didn't cut well and looked soupy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Hanson"
},
"reviewBody": "This is amazing. I added three tablespoons of flour to the sugar mixture . It came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not impressed with how the recipe communicates the technique. As written the recipe is not fool proof. Even after reading the comments here and taking the added precaution of letting the glaze cool completely, the glaze still ended up partially dissolving the lattice. My dough was pretty cool too. Moreover, the glaze (at room temp) was pretty thick, resulting in a lot of glaze just piling up on TOP of the lattice. And when I tried to \"nudge\" it down through the lattice and into the pie, the process ended up smearing some of the pie dough. While still edible, the pie looks very sad. So basically, I think the recipe (as written) is trying to seem a little too effortless when in reality a few extra--and simple--steps would make it more foolproof. The additions I would try next time: 1) Combine the syrup and apples in a bowl before filling the pie. 2) After pie is filled and the lattice is in place, add a tiny bit of water (1-2T?) to the bowl that the apples/syrup were in to make a thin \"glaze\" out of what was left in the bowl. Bush this gently over the lattice stipes right before pie goes into the oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Pruitt"
},
"reviewBody": "This is absolutely the best apple pie recipe I have ever made! I used Johnathan Apples from Edward Gay Family Farm in Arkansas, that are the best for apple pie, in my opinion. Sweet and tart, the flavor is perfection! I only added a tad of nutmeg and extra cinnamon, love everything spiced up! Thank you Chef John, Thanksgiving will have the perfect ending to a perfectly wonderful day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this recipe a couple times. Every time people love it and it doesn't last long at all. It is easy and delicious. A perfect apple pie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I usually don’t like apple pies but this one is so delicious and it’s the only one I’ll eat. I use 2 different kind of apples (Granny Smith &amp; Honeycrisp). I also make extra Carmel sauce, using more cinnamon. Getting to be my assignment to make this pie every year for Thanksgiving/Christmas. Last year my 6 yr old granddaughter helped me make it. While carving pumpkins on Halloween, my granddaughter (now 7) asked if we were going make the pie this year? I said yes and she said good, we’re making it as a family tradition. ❤️❤️❤️"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shawnathon"
},
"reviewBody": "I make this pie every year around the holidays, people keep asking me to make it! It very good! I think the key is to get the right kind of apples, golden delicious are my go to so they aren't too soft and mushy after baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanhenglo"
},
"reviewBody": "I have made this apple pie several times. and it has been a wild success each time. I also use Chef John's Easy Homemade Pie Crust recipe, which also has been a success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Masala"
},
"reviewBody": "I love this pie so much! It's delicious and not terribly difficult to make. I dont' always do a lattice crust, sometimes I just cut out shapes with a cookie cutter. Since you need gaps AND need to pour the caramel over the top crust, it doesn't really matter if it's a lattice or not. The video shows the apples unpeeled, though I'm not a fan of unpeeled apples in a pie so I always peel them. This has become a family favorite, I highly recommend giving it a go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebH"
},
"reviewBody": "Hy husband LOVES apple pie, but is very picky. He gave this a 5 star rating himself. I agree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryanna Mcgann"
},
"reviewBody": "Stuck to the recipe. Looked like a good pie to slap together. It has been baking 10 minutes over the time as to try to cook it down more, still soup on the back side for sure. I didn't know to sift thru the reviews to find the answer so I hope my pie isn't soup too! Okay I pulled it, checking at 5 minute intervals after the 40 minute mark. I am 97% sure it will set when cool, probably into a thinner sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Lynn Hauck"
},
"reviewBody": "I have tried this pie several times. The first time, the filling was runny. The second time, I used chunks instead of slices of apples. I also added several teaspoons of cornstarch, mixing it in with the sugar for the filling before adding liquid. This extra addition made for a great filling! The flavor of this pie is amazing with the caramel sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Delicious. Thank you for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gem"
},
"reviewBody": "Delicious and fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Monteria"
},
"reviewBody": "everyone loves my apple cobbler. I double this recipe and I add apple pie spice same measurement as the cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookHunt"
},
"reviewBody": "I love recreating Chef John's recipes. They always turn out great. As dis this one. This pie is absolutely fantastic. Thanks again Chef John for another wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "During the Covid outbreak of 2020 when everyone had to hibranate for 3 months was the first time I learned to make apple pie with Chef John's Caramel Apple Pie recipe and have been making it ever since. The two things I like about the recipe is the delicious flavor of this pie from pouring the filling mixture right over the crust and also being able to use Pillsbury dough crust makes it so easy. I alsoalittle caramel sauce drizzle on top.I have made this pie for family and friend get togethers. LOVE IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jayniii"
},
"reviewBody": "The flavor was great but I followed the recipe exactly and it was very soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rene2817"
},
"reviewBody": "Was easy and came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "davidsonden"
},
"reviewBody": "Someone help me. I did a lattice crust and STILL got super thin soup plus apples that weren't a bit soft. Followed directions exactly. What does the caramel sauce need to LOOK like when it's considered done? And how cool does it need to be?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karrieschasteen13"
},
"reviewBody": "Super good recipe! Everyone loved the pie. There were a couple alterations I made as I was worried, like many others that the recipe would be too runny. I bought the premade pie crust which was delicious and easy. I buttered the pan and sprinkled it with flour to help the dough soak up any moisture. I sprinkled more flour to the top of the pie crust before I added the apples. As for the apple mixture, I added a little sugar, cinnamon, couple table spoons of flour and half the syrup mixture to the apples and tossed them in it. I then placed the apples in the crust and drizzled the apples with some ice cream caramel topping sauce. I placed the top crust on the apples and drizzled the remaining syrup mixture on top. Cooked it for the first 15 mins then added tin foil to the outer crust for the remainder time to ensure the crust didn’t burn. I did let the pie completely cool and refrigerated it as I made it a day before it was to be served. Everyone loved it and it was thick and creamy. Oh and I used Envy apples. They are the best apples for anything, they are crispy and sweet, and huge!! They are expensive but the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JoiaBela"
},
"reviewBody": "I followed the directions to a tee. Made sure to use the \"right\" kind of apples (Braeburns). My crust was perfectly latticed. The \"caramel sauce\" turned to soup when the apples baked down. Tasty soup, but soup nonetheless. It ended up being just a really soupy apple pie that, frankly, didn't taste particularly caramelly at all. I was disappointed.\n\nIf I want a caramel apple pie in the future I will make actual caramel to top the apples with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lv2cook"
},
"reviewBody": "Chef John, I can always rely on your recipes. Thank you. Only thing I added was an 1/8 tsp nutmeg. \nI'm a Realtor, and I am pretty sure, if I bake this in one of the homes I am selling, the house will sell right away! Smells SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mertzie03"
},
"reviewBody": "I would give 5 stars for the taste of this pie- it is very delicious. I used the author's attached pie crust recipe which totally deserves 5 stars. My issue is that even after spending the night in the refrigerator, there is a lake of liquid sloshing around in there! I followed the directions except for adding a few tablespoons of corn starch to the apples prior to putting them in the pie (per a review I read). I used a lattice for my top crust and cooled my caramel prior to pouring over the crust to try to avoid this as well. What a bummer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauracostanza88"
},
"reviewBody": "I made this pie as the recipe called for. Although I did add more apples slices. I have to say this is one of the best apple pies I have ever made. My family owns an apple orchard so we are always trying new recipes. This was by far a great apple pie. \n I did not find it too syrupy as others have noted. It may have been my extra apple in it. This pie was amazing! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "HUGELY disappointed in this pie. Followed directions to a t and the apples weren't cooked at all. I don't think it is worth keeping it. It was horrible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chloesstore"
},
"reviewBody": "This is the easiest and delicious apple pie recipe that I’ve come across. I made it as instructed and OMG DELICIOUS. My husband enjoyed it so much I had to bake it for some of his friends and family. Again. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TxSue"
},
"reviewBody": "This is about our 6th time cooking this wonderful pie! Thank you Chef John! It gets better each time and is super with blueberries and apples!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Goodcalves"
},
"reviewBody": "The caramel sauce was tasty but was watery the yumminess did not stick to the apples. I decided to trust Chef John’s expertise so I didn’t add the flour to thicken the sauce like some reviewers suggested however I wish now that I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cinnamon"
},
"reviewBody": "I LOVE this pie !! I make mind with HoneyCrisp &amp; Cosmic Crisp apples! It is amazing even with my Pillsbury crust. I add a little extra cinnamon to the crust before the apples are added. This recipie is for 'The divine pie'."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drkrisztina"
},
"reviewBody": "Super easy and delicious! I don’t usually cook or bake so for me it had to be easy. My apple pie loving hubby gave it two thumbs up, and I had to fight to have one piece left for me to try. It’s a definite winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rigger7"
},
"reviewBody": "Excellent like all of Chef John’s recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura Elizabeth Austin"
},
"reviewBody": "It was good but it’s just a typical apple pie, not particularly anything that screams caramel about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAGary"
},
"reviewBody": "My favorite apple pie recipe!\nI did make a couple of changes, first my apple of choice is Crimson Crisp, I just core them and slice them real thin on the mandolin then stack them up and cut the stack in half. I also let the peel on. I then saute' them in a little butter to start the cooking process. Rave reviews from everyone who has sampled them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "I replaced ice cream for the water as liquid for the caramel sauce. Heavy cream is fine too. Both add fat and sugar but we’re talking pies here. It was actually like real caramel. Also, pie crust needs some lard. But to get the flakiest, least likely to burn on the edges of crust top try adding a table spoon of vinegar to the water used for the pie crust...stir it into the water mixture to dilute it. This pie crust recipe is ancient and is used in Eastern European recipes where they make pies out of everything. Try it and I believe you will use a splash of vinegar forever when making pies. All the changes I added here are simple chemistry...how molecules of certain ingredients react with each other in different temps and amounts. Cream reacts very favorably in caramel sauce...I was surprised it wasn’t an ingredient in this recipe...and lard has no water (like butter) so the pie can take higher temps and make flaky layers...pure butter is an emulsifier in pie crusts. The water content does not quite allow for true flakiness and the vinegar is acidic so it tries to create layered flakes...sort of like how acidity affects layered limestone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenice"
},
"reviewBody": "I tossed two tablespoons of flour in the apples and it wasn’t watery at all! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Hulsey"
},
"reviewBody": "I've been making this recipe several years exactly as written. I always get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AliveNCooking"
},
"reviewBody": "I made this with a group of kids (the pickiest kids on earth), ages 5 to 11, and every one loved it. \nThis is my new favorite caramel apple pie recipe. I threw all my others out. The same with the pastry recipe, which is included in a link.\nThe only thing I would change is to double the crust recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise"
},
"reviewBody": "Awesome recipe! I have made this several times and the result is always the same, a great pie with a nice golden crust. I use Granny Smith apples because the tart apples are a great balance to the sweetness of the caramel sauce. I always serve it with whipped cream or vanilla ice cream, just for a little creamy richness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wimp"
},
"reviewBody": "No changes at this time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Rose"
},
"reviewBody": "This pie is absolutely fantastic. I make it about every year during apple season, and the again sometimes at Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vanderson"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtyler12"
},
"reviewBody": "After reading all the reviews saying it turned to apple soup, I followed the directions exactly but then tossed the apples in flour to lightly coat them. Perfect apple pie! So easy and am making again tonight to freeze. We had gone apple picking with the children and got Macintosh apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Hance"
},
"reviewBody": "Wonderful flavor, but my filling turned out a bit \"runny\" even though I brought the mixture to a boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darci Spilman"
},
"reviewBody": "So simple and delicious! Serve it warm with vanilla ice cream and everyone will be singing your praises! Second day.... AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILikeCooking"
},
"reviewBody": "The entire family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ARLENEAMANDA"
},
"reviewBody": "Made this before and I remember making a change to it but I couldn't remember what. SO I just decided to wing it and make it as is. I ended up with apple soup pie. Very disappointing. Add cornstarch to either apples or caramel mixture next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley "
},
"reviewBody": "this is the best pie I've ever made, that is apple. my apple pies usually turn out like soup but I used the flour in the caramel sauce that was suggested in the reviews, it definitely helped because I do not have consistent apple pieces. so if you arent super good at even slices use the flour! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Della H"
},
"reviewBody": "A little too sweet and sticky for me and my guests, so I would use less sugar if I make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rizza Malabanan"
},
"reviewBody": "I’ve been using this recipe for years now and my husband really love this. Thank you chef john for a very yummy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eatsleepSWIM"
},
"reviewBody": "great flavor, but too watery"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Tagliaferro"
},
"reviewBody": "I have made this, and its always awinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "Awesome pie! I did a solid crust and put a bit of cornstarch to make sure it was thick enough although probably didn't need. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doctorkilljoy"
},
"reviewBody": "I loved this recipe. I took the advice of a few other commenters and mixed the apples with some flour and then with the sauce before putting them in. I used an egg wash for the crust but rather than sprinkling with just sugar I used a 3/4 sugar 1/4 cinnamon mix. I also added more cinnamon to the sauce and a pinch of nutmeg. All in all delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry-Jennifer Robinson"
},
"reviewBody": "I made this recipe using 5 gala apples tossed in 2 tbsp. all-purpose flour and Chef John’s homemade pie crust recipe. It turned out so delicious. My husband had two helpings after dinner! Paired with some quality vanilla ice cream, you don’t get much better. I almost drank the caramel sauce before the pie had a chance. I will definitely be using the caramel sauce for other dessert toppings as well. Thank you for yet again a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Grow"
},
"reviewBody": "Absolutely the best apple pie I’ve ever made! I don’t peel the apples so mine has some texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Earthgal"
},
"reviewBody": "Most amazing recipe for a quick apple pie on a pinch! Thank you so much!! Now to top with a few scoops of old fashioned vanilla ice cream. MMMmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHERYLSKITCHEN"
},
"reviewBody": "This was a very good pie. I did not have the \"soupy\" issue like others had. I simmered the sauce longer and let it cool to where I could handle the saucepan without a mitt. My family said it didn't have enough non-apple filling (sauce and spice flavors). I also sliced three large Granny Smith's really thin (1/8\" to 1/4\"); I don't think I could have fit one more apple in the 9\" pan, as it was piled high. I did completely cool this pie, and even refrigerate for a good hour to avoid the \"soup\" issue. I will likely make again but make adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Inskipt"
},
"reviewBody": "I am not the world's best baker when it comes to pie because, frankly, I don't like pie. But my family does. I always have luck with Chef John recipes so I turned to him when an apple pie was requested for a birthday. He did not disappoint. Super easy recipe. Using pre-made crusts makes it that much easier. I just made 3 for Easter. I found this recipe last year and am so glad I did. I love the butter mixture that stops just short of being caramel. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "marty c"
},
"reviewBody": "Dont make this pie unless you want to drink it after it bakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sloopie1"
},
"reviewBody": "I had a couple of apples I needed to use so what better way than put them into a pie, right? So....after watching the video and checking my ingredients, this was “the one”. Because there are only two of us, and I had a small pie pan on hand, I cut everything in half. I must say I have never made caramel sauce before and this was very easy. I did make my own crust, using the recipe included and it turned out very well. I cut my apples into quarter inch slices and tossed them with about 1/2 tablespoon cornstarch (they were Figi’s &amp; I knew they would produce lots of juice) to thicken the juice. Bottom crust was piled high with the apples and then I did the lattice top as indicated and poured the caramel over and down into the pie. It looked a bit weird but smelled delicious. I baked it per the instructions and cooled it completely before slicing. I cut the first two slices and Oh my goodness, IT WAS DELICIOUS! Hubby gave it a “thumbs up” and said this recipe was definitely a keeper - I agree. Five full star rating because the ingredients are always in my pantry, caramel sauce was super easy as was the pie crust, the recipe was easily “cut in half”, and was absolutely delicious! I will definitely make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jng5645"
},
"reviewBody": "I have made this pie three times in the past few months. Its great, didn't have any problems at all. I made both with a lattice top and a solid crust with cutout designs. Got lots of compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manuel E"
},
"reviewBody": "I made a no sugar added version, substituting splenda for sugar and swerve brown sugar substitute. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Fresh"
},
"reviewBody": "I used 4 extra large Honey Crisp apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dustin Jones"
},
"reviewBody": "Made it 4 times. First time, great perfectand not watery the next 3 times disappointingly water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnMac"
},
"reviewBody": "This apple pie is so easy, requested all the time when I go to parties and my family gobbles it up. A winner!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Shipley"
},
"reviewBody": "Too runny, need to add thickener to the sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "I had never made a homemade apple pie before and this was a hit!! My husband was upset, there was'st any left to bring home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Home Chef Rita"
},
"reviewBody": "Delicious. This is my go-to recipe. I use a mix of apples and pears."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Smith"
},
"reviewBody": "This pie came out AMAZING. First off, it doesn’t matter what apples you use. I only had MacIntosh apples, and yes they’re soft...but worked out. I made only 2 changes to the recipe. First make sure your apples aren’t cut to small, especially with a softer apple like I had. I added about a tablespoon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donak"
},
"reviewBody": "Love Love Love and it’s not out of the oven. I might have to make another"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbie Drury Griffith"
},
"reviewBody": "I made this pie this week, and it was my first attempt ever at an apple pie. The flavor was wonderful; however, my pie was very soupy, as others have posted. I would like to know the secret to a non-soupy version of this. I had leftover apples, so I am going to attempt to make tartlets today, using this recipe but modifying it a bit. We will see how it goes. My hubby and daughter loved this pie, soupy and all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TK the Foodie"
},
"reviewBody": "First time baking an Apple Pie and this was delicious! After reading the reviews, I followed the instructions exactly. I will wait even longer next time for the caramel to cool down a lot more than I did. My husband could barley contain himself, he cut into a hour out of the oven and loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nellycct"
},
"reviewBody": "My family loved it! This was my first time making an apple pie and it was so easy and delicious! Chef John makes such easy to follow recipes. My caramel was a little watery, I think I need to let it simmer and thicken longer next time. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leigh Anne"
},
"reviewBody": "Loved this recipe. It was simple and so delicious!! The only thing I did different was to sprinkle dry wassail mix over the top of the pie before baking to give it a little extra oomph. My hubby said it was definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Carrington"
},
"reviewBody": "This is a great recipe I made once before and the whole family loved it, one thing make sure to use a pie shield or tin foil to protect the crust. \nWe loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis"
},
"reviewBody": "No changes at all. The very best Apple Pie ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrowe2"
},
"reviewBody": "followed directions, no substitutions, did use 3 kinds of apples. BEST apply pie I(and wife) every tasted. Did have presence of mind to put pie on baking sheet to catch overrun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norma Cutbill"
},
"reviewBody": "I haven't made this yet. I just noticed that the apples were put directly on the bottom crust. I always mix some flour and sugar just enough to coat the bottom crust before putting the apples in. No soggy crust and the flour helps to thicken the filling I will give it a 5 because it sounds delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "denisec272"
},
"reviewBody": "I used this recipe with my granddaughters helping. Instead of Fuji apples we used fresh apples that we picked at their other grandmother's house (next door). We then took the apple pie as dessert for a family dinner and it was a huge hit with everyone. Love the memories we made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trevag"
},
"reviewBody": "best apple pie ever....got so many raves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Clark Ron Clark"
},
"reviewBody": "No changes. Very good recipe, must bring sauce to boil, some mention its runny, the sauce must boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Williamson"
},
"reviewBody": "My husband loves apple pie, and when he was eating it, he stopped, tapped me on my shoulder and said, \"Honey, this pie is really good, I mean, really good!\" He has never said that about any other pies I have made, so that is saying a lot! Definitely a keeper, the recipe, and the husband :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SpecialK"
},
"reviewBody": "I loved it, turned out perfect. Wasn’t watery at all. I however didn’t count the number of apples since the size can vary so much. I just made sure to fill my pie crusts completely full of apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgbringo"
},
"reviewBody": "Outstanding"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "Made a tad more sauce and it was so juicy and good. Easy to make too. Yummmm. This pie is so delicious! Will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cej713"
},
"reviewBody": "The recipe by itself was outstanding. I did dredge the apples in flour and oatmeal which sort of made it a carmel apple crisp pie. My wife and daughter who are not apple pie fans both loved it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snappydresser"
},
"reviewBody": "Used Sanders Carmel topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Parker"
},
"reviewBody": "Added the flour to absorb some of the juices...love this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "skmpgoods"
},
"reviewBody": "The pie did turn out with quite a bit liquid as mentioned, I cooled the sauce before pouring and made a lattice top, still juicy. Taste is fantastic, it's not soupy but I would still try to thicken it further and add more apples as it flattened out. Foil to protect the crust edge. \n*I used gala apples this time"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220997/chef-johns-caramel-apple-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
"name": "Apple Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220997/chef-johns-caramel-apple-pie/",
"name": "Chef John&#39;s Caramel Apple Pie"
}
}
]
}
}
, "about": [
]
}
]