				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Refried Beans"
,"datePublished": "2017-02-08T01:09:39.000-05:00"
,"dateModified": "2022-11-07T23:06:13.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Chef John says the key to great refried beans is to make them with lard. Serve on, with, or in nachos, layered dips, quesadillas--the possibilities are endless."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/HNnlSHlCpopCG2kMD2FKSBy1wiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4473186-chef-johns-refried-beans-Chef-John-1x1-1-a9f0234cc0834643ae15da9b08bde239.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5321955011001",
"description": "Homemade refried beans make everything better!",
"duration": "PT8M44S",
"name": "Chef John's Refried Beans",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/24d35471-269d-4445-abf3-e038e1a5e23e/bd83e1a2-d860-4679-86ee-f687713c0900/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T06:54:42.578-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Refried Beans"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "80"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "317 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "12 mg"
,"fiberContent": "12 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "491 mg"
,"sugarContent": "2 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound dry pinto beans, soaked overnight",
"4 whole garlic cloves, peeled",
"0.5 teaspoon dried epazote",
"9 cups cold water",
"0.5 cup lard",
"1.5 cups diced onions",
"2 teaspoons kosher salt",
"2 tablespoons minced serrano chili pepper",
"1 teaspoon ground dried chipotle pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Drain soaked beans and transfer them to a stock pot. Add garlic, epazote, and cold water. Place pot over high heat and bring to a boil. Stir. Reduce heat to low. Simmer uncovered until beans are soft, 1 1/2 to 2 hours. Drain the beans and reserve all the liquid."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/HNnlSHlCpopCG2kMD2FKSBy1wiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4473186-chef-johns-refried-beans-Chef-John-1x1-1-a9f0234cc0834643ae15da9b08bde239.jpg"
}
]
,"text": "Melt lard in a large skillet over medium-high heat. Add onions and salt; cook until onions start to brown, 10 to 12 minutes. Stir in serrano pepper and chipotle powder; cook 1 minute. Transfer drained beans into skillet. Mash about half the beans with a potato masher or back of a spoon. Ladle some bean cooking liquid to skillet. Continue to mash and stir beans as you gradually add more liquid. Mash until the beans have reached your preferred consistency and texture. Taste and add more salt, if desired."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT730M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this for Mexican themed lunch- everyone loved it! Best refried beans I’ve had- bar none!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Been using it for over a year and keep coming back! These beans are fantastic ! I marinade many types of meat for different tacos and burritos - was in need of a good beans recipe to bring it all home. Came across his YouTube channel, loved his demeanor, and the five recipes I’ve tried of his are all GREAT! These are awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Peteren"
},
"reviewBody": "I've made this several times and hope to never buy canned frijoles ever again. I made it according to instructions but next time I'll leave out the serrano pepper. I like it just fine but it's too spicy for my wife. I use an immersion blender to get a smooth consistency as I like them nice and creamy. I save some of the remaining bean water to use later if the frijoles seem a little thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Chef John's recipe for Refried Beans is the best I've ever made &amp; tasted. I substituted the epazote with dried oregano and the minced serrano chili pepper with minced jalapeno pepper. Didn't have dried chipolte pepper &amp; subbed with smoked paprika. Only change I'd make is use a little less salt. Lard is the key ingredient. They are divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Riley"
},
"reviewBody": "Made as written, but used crisco for my vegetarian daughter in law. I do believe it would be better with lard, so I am looking forward to next time. I used a blender for smooth creamy beans. Thank you Chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shan Shan"
},
"reviewBody": "I’ve tried several refried bean recipes and this is the best one! I doubled the recipe and it worked out great. I didn’t have chipotle powder and used less lard and they still tasted great. I also used a deseeded jalapeño for less spiciness to suit my family’s heat preference. My family also prefers smooth beans so I used my immersion blender. Next time I may make them in the Instapot. Definitely recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renate"
},
"reviewBody": "Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Carnine"
},
"reviewBody": "This is exactly as refied beans shoud taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marla Rowley Olson"
},
"reviewBody": "Tried this today, and we all loved it! I lucked out and found fresh epazote at a local market. I used lard for the first time and highly recommend. I used jalapeño this time for guests, but I’ll try the Serrano next and step up the heat. The flavors were rich and textured. I was in a hurry at the end so I used my emulsion blender. It was fast, and I got the almost creamy texture I was going for. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Inch"
},
"reviewBody": "No more canned refried beans.. EVAH! \n\nFamily loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow, I have been wanting to make Refried beans for awhile now and I always check to see if Chef John has the recipe I am searching for and in this case he did! It took me awhile to find the epazote but I ended up going to a Mexican grocery store and they had plenty. This was amazing! It takes awhile but totally worth the work. Next time however I will cut my peppers down to one tablespoon instead of two. I am not a fan of heat. This by no means would be hot for anyone but me. Definitely will make this again! Thanks Chef John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith R"
},
"reviewBody": "Unlike Chef John, I actually would sit down and just eat a bowl of this...\nVery, very good. \n\nThe whole family loved it, too. The color was not what they're used to (I've made RFB in the past with kidney and / or black beans - never Pinto). They said it looked \"gross.\" They were skeptical &amp; didn't dive right in like they normally would have. But once they tasted it, they were hooked.\n\n I used Goya pinto beans. Soaked overnight, then 30 min at high pressure in the instant pot was perfect. I used some fresh oregano from the garden in place of the Epazote, and one chipotle pepper from a can, instead of the powder. I also added a bit of cumin. '\nOh, and I used bacon fat for lard. That, I believe, and the pintos were the keys to success here. It really was good. That's it. Super quick, easy &amp; wonderful. \n\nMy big take-away was this: I was really surprised how much better the pintos are than other beans I've used, in texture &amp; flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingoatmeal"
},
"reviewBody": "Outstanding!!! I didn't have epazote, serrano peppers, or chipotle powder. I substituted 1 tsp oregano leaves for the 1/2 tsp of epazote, 2 tbsp of minced jalapeno peppers for the 2 tbsp of minced serrano peppers, and 1 tsp of smoked paprika for the 1 tsp of chipotle powder. A family member is vegetarian, so I also substituted 1/2 cup of vegetable oil for the 1/2 cup of lard. Oh my goodness, these were outstanding! Four teens gobbled these up and wanted more. So for our family, I will need to at least double the recipe. Hubby and I got only a couple of bites. (After soaking for a day, I cooked the pintos, garlic, oregano, and 9 cups of water in my instapot using the \"bean\" setting which is 30 minutes of cooking time after pressure is reached. I used 9 cups of water; next time I will likely only use 6 cups to reduce that amount of time to come up to pressure and to make a more concentrated broth. I imagine had I cooked these on the stove top, the broth would have been reduced by evaporation.) Again, the recipe is outstanding, even though I had to make close substitutions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teri B"
},
"reviewBody": "This is the besi I have tried. Use plenty of peppers and onions. not so much lard. It also freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Michael"
},
"reviewBody": "This was good (WITHOUT the lard). I used to eat swine, and when I did feel the same way as Chef John does. No longer eating this animal due to my desire to please the Lord, I am happy with the coconut oil (and a little butter) that I used. \n\nI really like adding the well-sauteed onions at the end and pouring out but saving the liquid after the beans are cooked to softness (so that it can be put back in)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROSEB1"
},
"reviewBody": "DO NOT BUY CANNED BEANS, because this one is so easy and so delicious! I use a can of diced chili peppers instead of the serrono and I sub avocado oil for the lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chickn_Tika"
},
"reviewBody": "This recipe is incredible. My entire family loved it. I made it exactly as the recipe was written. We've been making leftovers into bean dip and chips and bean and cheese burritos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott_cooks79"
},
"reviewBody": "Fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikal Trahan"
},
"reviewBody": "I have been looking for the PERFECT refried bean recipe and this IS IT! I couldn’t find dried ezapote so I used fresh (fresh smells super strong and bad but it doesn’t affect the taste of the beans). Also, I could not find dried chipotle so I used canned and cut it up very fine. Added excellent Smokey flavor that I have been missing in my previous tries at refried beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bfr610"
},
"reviewBody": "What I liked about this recipe is that you can make it as thick or thin as you would like as well changing the heat level to your taste. I hate those canned re-fried beans, you have no idea of what's in them, here you are in control. My only change was I used cardamon leaves and oregano instead of the epazote ( didn't have any on hand). Froze the batch in 1 1/2 cup containers for easy meal preparation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buck"
},
"reviewBody": "I came up thinking lard was the worst, so I never used it. This recipe is so good I am rethinking all my other recipes. I live in northeast USA and know nothing about spicy peppers s I just used a jalapeno, but I doubt it matters what kind of pepper you pick. The reviews convinced me to go with lard, and I've never had beans this fantastic. Thanks Chef John and thanks to all who reviewed this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Cezar"
},
"reviewBody": "Delish!\nI pureed in food processor real quick.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taco"
},
"reviewBody": "They were awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronda Carpenter"
},
"reviewBody": "Absolutely perfect! Almost identical to my mother's recipe. Lard or (as I prefer), bacon grease IS critical. Also if you like them a little \"cheesey\" flavored, add a bit of buttermilk in place of the liquid while mashing the beans. A staple on our table. I also use these in our taco meat to hold everything together. Now I'm hungry!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Delicious! I have been looking for a really good refried beans recipe for years. I have finally found it! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake"
},
"reviewBody": "I live in South Texas on the Rio Grande and this recipe rocks! I cooked the soaked beans in the crockpot for 3 hours on high and one hour on low. (Rinse the soaked beans well before putting in the crock pot to get rid of, well you know, gas).\nI like a coarse mash with some texture, but still needed to add some reserved bean cooking “liquor”. Use an immersion blender for a creamier product. Top with finely chopped green or white onion and serve - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lanette Smith"
},
"reviewBody": "These were crazy, lick the plate good! I liked the level of heat but I think next time I might use jalapeños for those that do not like as much heat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "This was really good, I did add in some chicken stock and 2 slices of crumbled bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcoots89"
},
"reviewBody": "These were so good! I used black beans and leftover bacon grease rather than lard but it was still just. Really good. For myself I would reduce the amount of grease/lard from 1/2 a cup to 6 Tbsp because it was a little too much for me. I would also recommend cutting the initial salt in half to 1 teaspoon and then going by taste from there. You may end up adding the same amount but for myself I have a lower salt preference and so the original starting amount was too high for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "southerncook"
},
"reviewBody": "THIS! I followed the recipe exactly. We absolutely LOVED these refried beans! They were even better heated up! They weren't spicy, just had a wonderful flavor.\n\nIf you save some for leftovers, save the extra liquid and add a little each time you heat some up.\n\nWay to go Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hungry "
},
"reviewBody": "I followed this recipe exactly with the exception of making it in the instant pot. I sautéed the onions, pepper and garlic in the lard, added the rest of the ingredients and cooked 35 minutes--High pressure, Natural release. They are so tasty! I think it's all that lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish Linville"
},
"reviewBody": "Delicious! Didn't have lard so used butter. I will be making these again soon. Next time I will buy lard!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elaine Dunn"
},
"reviewBody": "Made it as described and really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reidsdad"
},
"reviewBody": "Simply fantastic. I do vary slightly, using filtered bacon fat instead of lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Hope"
},
"reviewBody": "I can never eat refried beans from a can! This is a wonderful and simple recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryanne"
},
"reviewBody": "Way better than caned beans!!! We loved it a lot. But instead of the leafs on top we put Mexican sour cream and it was DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leann Langfitt"
},
"reviewBody": "Perfect. Never buy canned again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Renee S"
},
"reviewBody": "I made mine with pork broth from when I boiled ribs for dinner the night before (saves time in the oven and makes them really tender). Came out yummy. I tried using Crisco this time because I didn't want to buy a huge thing of lard and thought the pork broth would make up in flavor. They were a little salty, but I think it was from all the salt in the broth. I think I did a pretty good job for a first attempt making refried beans and also not following the recipe to the T. Next time I would like to try with lard and follow the recipe exactly. I'll update my review again when that happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CycloneFan"
},
"reviewBody": "Great refried beans! Only changes I made were cooked beans in a pressure cooker and sometimes adjusting spice to accommodate my young kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These beans turned out so yummy! I used bacon fat I had stored because my store didn't have lard. Online people said bacon fat works so I went for it, not disappointed at all. I want to say this is either the 6th or 7th recipe of Chef Johns I have tried, not a single one has been disappointing, they've all been great so far. Got so many more to try next."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I will make this again. Because I live in a country where lard is not obtainable, I used something similar to Crisco and I thought it worked just fine but one day when I am back in the states I will definitely try it with lard. And because of a time crunch between finding this recipe and having to make the dish for a Christmas celebration, I used canned black beans. I could obtain only jalapeno peppers here and they substituted well. To make up for the lack of taste from lard it did add extra onion and garlic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eatme"
},
"reviewBody": "there great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chase Smith"
},
"reviewBody": "I didn't have epazote, nor the serrano chili peppers, so I had to do without, but it was still amazing!! We love these beans, and will never go back to canned refried beans again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizomaha"
},
"reviewBody": "These are delicious. SO much better than store bought canned beans. I have also made these in an instapot with \n4 1/2 c water on the bean setting. You must use lard as others have stated. It's what makes them tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eugene perkins"
},
"reviewBody": "What can I say?? Listen to Chef John. The man will not steer you wrong. This is not diet food people. This is traditional cooking! IMO, portion control of good food is better than bucketloads of healthy food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Breanna Omundson"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashagang"
},
"reviewBody": "These are the real deal. They also freeze well, so I make a batch and freeze some to use for burritos and wavos rancheros."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steevogrande"
},
"reviewBody": "I made some changes to suit my taste- I was able to obtain fresh epazote and I put a quartered onion in with the boiling beans, both of which I strained out of the water at the end. I then used jalapenos in the lard 'cause I didn't want that much heat; perhaps I needn't have worried, but I loved the result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael D Johnson"
},
"reviewBody": "It's personal, but for my next batch I'll probably drop to one Serrano instead of two. Of course, the Serrano's I bought we're rather large. Excellent and easy recipe. I doubt we'll ever eat canned again. I cooked the beans in a pressure cooker, so I didn't need to soak them overnight and it only took 45 minutes to cook the beans. I highly recommend a pressure cooker. My wife is still raving about how delicious this recipe is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Lewis"
},
"reviewBody": "We spent a year in Mexico on our sailboat and when we returned to the US I had more or less given up on getting the excellent refried beans we had enjoyed so much south of the border. I just kept trying to doctor up canned refried beans from Costco. \n\nI should have known better. Any refried beans that advertise themselves to be fat free sort of miss the point. \n\nWhen I looked at Chef John's recipe it looked like a lot of work but it was a rainy Sunday so I persevered. Fortunately I had some manteca (lard) on hand because I was planning on making some tamales.\n\nThese beans are absolutely incredible and as good as we had in Mexico. They are not as much work as I anticipated but you do end up with a lot of beans. I am trying to freeze some in vacuum sealed bags. If that does not work Ill pressure can them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Casey Nugent Roberds"
},
"reviewBody": "I have been trying to make beans for 10 years and they have been so so. I stumbled on to this recipe and tried it and it is to die for. It has to be the lard that makes the beans so good. I have made this according to the recipe and once I used green chiles and it was just as good. I would rate this 10 stars if I could."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "studmuffin"
},
"reviewBody": "Chef John ROCKS!!\nUsed canned beans and hid the can of lard (what they don't know...)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michell"
},
"reviewBody": "These were by far the best refried beans ever. I will never eat them from a can again. Chef John is my new cooking guru."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeGosney@maccom"
},
"reviewBody": "My family will never eat canned refried beans again. This was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family will never eat canned refried beans again. This was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wittymagpie"
},
"reviewBody": "OK, the lard is IT. I could wax poetic about the interesting way lard can take heat (medium high), the wonderful smell while frying, the insane flavor of the refried beans, and on and on... I followed this verbatim and usually I use recipes as more of an 'idea'. So, having had lots of homemade refried beans, let me say that these are spot-on. I do love Chef John's recipes. Bravo!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JaneeJ"
},
"reviewBody": "Loved them and making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaumarie Tanner"
},
"reviewBody": "Excellent refried bean recipe! I made this for a trip to the family ranch with my parents, siblings, their husbands, and kids. Everyone loved them. The only thing I changed was the amount of diced Serrano peppers. My husband and my sister can't handle the heat. Despite that, they were still quite warm. But very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Rose Caire"
},
"reviewBody": "Wayyyy better than the canned stuff, and super easy. I love homemade options over store bought. After we ate dinner I froze smaller portions for future taco nights, nachos, or whatever we may want received beans for. I love chef John's recipes, keep up the good work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "samantha505"
},
"reviewBody": "Delish!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/257150/chef-johns-refried-beans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/257150/chef-johns-refried-beans/",
"name": "Chef John&#39;s Refried Beans"
}
}
]
}
}
, "about": [
]
}
]