				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Corn Tortillas"
,"datePublished": "2018-03-24T03:03:10.000-04:00"
,"dateModified": "2019-04-04T00:11:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Practice makes perfect corn tortillas out of this simple 3-ingredient recipe that&#39;s super quick to learn using any equipment you have on hand."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/56v4HeUb4KxXixC8_9t6XQrVZ3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5262200-6a38a75b190f4478b6467c582d1f41f5.jpg",
"height": 1153,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5758495239001",
"description": "",
"duration": "PT10M21S",
"name": "Chef John's Corn Tortillas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/680eefe0-4404-490a-a6f8-29347815f183/550d4986-641a-464c-b838-4b35865b77bb/1280x720/match/image.jpg",
"uploadDate": "2021-07-27T18:48:22.622-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Corn Tortillas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "43"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "42 kcal"
,"carbohydrateContent": "9 g"
,"fiberContent": "2 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "97 mg"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup masa harina, or as needed",
"0.5 teaspoon kosher salt",
"0.75 cup hot tap water, about 130 degrees F (55 degrees C)" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Add masa harina to a large bowl. Sprinkle in salt and add hot tap water. Stir mixture with your fingers until dough starts to pull together."
} ,{
"@type": "HowToStep"
,"text": "Knead for a few minutes to smooth it out until texture resembles modeling clay or putty. Add more water if dough is too dry and more flour if too wet."
} ,{
"@type": "HowToStep"
,"text": "Place a damp towel and over the dough to keep it from drying out. Let rest for 20 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Cut a zip-top bag into 2 rounds the same size as your tortilla press. Place 1 round on the bottom of the press."
} ,{
"@type": "HowToStep"
,"text": "Place a clean kitchen towel over a pie dish for holding the cooked tortillas later."
} ,{
"@type": "HowToStep"
,"text": "Pull off a little piece of the dough, enough to roll into a 1 1/2-inch or 1-ounce ball. Remove the top round of plastic, place dough ball in the center of the bottom round, and press down lightly. Cover dough with the top piece of plastic."
} ,{
"@type": "HowToStep"
,"text": "Fold the tortilla press over, apply pressure to the lever arm until tortilla flattens to your desired thinness."
} ,{
"@type": "HowToStep"
,"text": "Peel off the top piece of plastic. Line up the index finger of your dominant hand with the edge of the tortilla; flip it over into your other hand. Carefully peel off the plastic."
} ,{
"@type": "HowToStep"
,"text": "Gently slide tortilla, palm-up, into a hot, dry pan over medium- to medium-high heat. Cook first side for 30 to 45 seconds. Turn over and cook second side for 1 minute. Flip and press once or twice with a spatula until tortilla puffs up slightly. Cook for 30 seconds more. Flip one last time and cook for 5 to 10 seconds."
} ,{
"@type": "HowToStep"
,"text": "Quickly transfer tortilla to the pie dish and fold the towel over to wrap it up. Repeat pressing and cooking the rest of the tortilla dough, stacking and wrapping as you go."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/56v4HeUb4KxXixC8_9t6XQrVZ3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5262200-6a38a75b190f4478b6467c582d1f41f5.jpg"
}
]
,"text": "Leave the stack of tortillas wrapped until soft and supple, at least 15 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maydog"
},
"reviewBody": "This is a five star recipe for taste, ingredients, and directions. The only reason I deducted a star is for the serving quantity. I followed the recipe exactly as written and it made only 8 small tortillas (approx. 5 to 6 inch diameter). I used a tortilla press and if anything they were a little on the thin side. I’m not sure how many tortillas equals a serving, but unless it’s less than one whole small tortilla, I would recommend that this recipe (using one cup of masa) adjust the quantity down to 4 ?(2 tortillas to a serving…you can’t eat just one) or 8 maximum. FWIW, I used Bob’s Red Mill organic masa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yummers"
},
"reviewBody": "Followed the recipe exactly. The only thing I would have to say is the “10 servings” is a LIE because between myself, my hubby, my 5 year old and 2.5 year old, these tortillas were GONE in 10 minutes. No way this is meant to serve 10! Unless it was 10 ultra small tacos…which with these I could eat dozens of… so yeah, only complaint I have is that they disappear too quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Dunn"
},
"reviewBody": "This recipe was perfect. This was the first time I have ever made homemade corn tortillas. I followed the directions to the “T” and it was a success. Like John says....it takes a little practice but by my 4th tortilla, I caught on. I will definitely make these again. I always look for Chef John’s recipes because I totally trust him. Thanks John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apathy1967"
},
"reviewBody": "So simple and delicious!! Thanks again Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laverne"
},
"reviewBody": "I will next time cut the salt 1/2. My technique will improve but directions were good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jajam"
},
"reviewBody": "These puffed like a balloon! So good that I’ve ordered a tortilla press. My grandkids loved them, a big bonus in this household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isheeta Rahman"
},
"reviewBody": "I've made tortillas using this recipe about 6-7 times now, and my tortillas have turned out wonderfully every time. I will NEVER purchase pre-made corn tortillas again! They are so easy to make, and SO much better than the pre-made stuff in a bag. A few things I have learned: 1) I've made this recipe both resting the dough and not resting the dough. Personally, I haven't seen a very perceptible difference, and I actually like the flavor better immediately after mixing the dough. It seems to retain more moisture. 2) The temperature of the water is not too important as long as it is warm to the touch. 3) Salt is REALLY important in this recipe! Don't be afraid to add salt! 4) Be sure to use a DRY cast iron (or other) pan. If you grease the pan, the tortillas will absorb the grease and they'll be more likely to fall apart. 5) You don't need to purchase a tortilla press for this if you don't want to, your hands plus a rolling pin works fine - but you NEED to sandwich the dough between two pieces of plastic (a cut open gallon ziploc bag works great)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bianca Wojcik"
},
"reviewBody": "Awesome! My 11 yo daughter really enjoyed kneading and pressing, and cooking was super easy! We don’t ever want tacos with store bought tortillas again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EriNnRuss"
},
"reviewBody": "I made this with my homegrown heirloom corn. Flavor was outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liliana Magdaleno"
},
"reviewBody": "Great recipe for quick and easy tortillas BUT they need some UMPH! I looked at other recipes that use all purpose flour and cornmeal SO I want to try that next BUT with masa harina instead of all purpose flour and cornmeal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Gallo"
},
"reviewBody": "easy to make taste great bought a press now super easy I have used broth and spices to the mie great un and make great masa noodles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ritaverissimo"
},
"reviewBody": "I love Chef John's recipes!!!! This is my second recipe from Chef John.....keep coming you are the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love Chef John's recipes!!!! This is my second recipe from Chef John.....keep coming you are the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al & Sandy"
},
"reviewBody": "This is the only recipe/technique that I've had success with ever. TY Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHERYLSKITCHEN"
},
"reviewBody": "Chef John nailed it again! These were simple to make and easier to cook than expected. I doubled the recipe and it was perfect for 2 adults and a hungry college student. I only had coarse Kosher salt so I used 1/2 of this along with 1/2 of fine-ground sea salt; I can't say that there was any difference, but I am going to buy fine ground Kosher for next time. We don't have a press so we used a pan (not the easiest, but worked), but I am ordering a press since I'll be making this recipe on a regular basis. We loved the fresh flavor and after looking up the ingredients on a popular store-bought brand of corn tortillas, I am happy to not be feeding my family all of those unhealthy preservatives and binding agents. Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonita"
},
"reviewBody": "These turned out great! I followed the recipe to the letter, and even watched the video. I was so sick and tired of buying corn tortillas that literally fell apart. I don't seem to have that problem anymore!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jung-Ah Yum"
},
"reviewBody": "I've tried Chef John's recipe and the recipe on the Masa bag....Chef John's is WAYYY better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ravzie"
},
"reviewBody": "Followed the recipe exactly. Great outcome, but investing in the Victoria tortilla press made all the difference in presentation. Make sure to get the precooked corn meal. I used the Goya masarepa. I made some Beef Barbacoa in the crock pot, home made pico de gallo, all the usual taco fixings. Sopapillas for dessert. Great meal! Thanks for showing me how to do it, Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "This recipe for flour tortillas is so good! Chef John is right about not wanting store bought after making your own. To speed up the process, I used a food processor to crumble the butter into the flour, then transferred the flour to a bowl, and followed the rest of the instructions. The tortillas turned out so delicious. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "This is my first time ever making my own tortillas from scratch. I watched the video a couple of times to make sure I had the right consistency. They were perfect. They were easy to make and wonderful to eat. I'll be making my own from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BethK"
},
"reviewBody": "These came out good and were easy to make with my new tortilla maker. There will be a lot of time to work out my technique with this simple recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dani8x7"
},
"reviewBody": "It takes me right back to my childhood in Miami eating hot, fresh tortillas, slathered in butter with some cinnamon. If you want to press out more at a time and only have one skillet for cooking, use more slips of parchment so you can press them out all at once and then fry them super quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Barnes"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joanna"
},
"reviewBody": "Super easy..and the video really helped out. Turned out great for little tacos &amp; they do taste better homemade"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LauraF"
},
"reviewBody": "These were totally delicious! I made a 5x batch and froze a few stacks. I didn't have a tortilla press but pressing down with 2 big cookbooks worked just as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marsha Gillespie"
},
"reviewBody": "I followed the recipe precisely. However, I noticed later that he seems to be using white corn masa harina; whereas, I used yellow corn. I think the white would have tasted nicer, but mine turned out pretty well for a first time. I had to add a little more of the masa harina. I used a plate for pressing. I thought it was tricky to try to time it before flipping, but I think with practice, I will just go with my instincts on that. The yellow corn did not get \"poofy\" but the looks and tastes seemed fine. I will make this again with maybe a bit of experimenting what I eat with it. Thank you for the clear instructional video."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roofrazz"
},
"reviewBody": "AMAZING. Never buying store bought again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "First time making homemade tortillas, and it won't be my last! My BFF, Jenny, gave me a tortilla press for my birthday, and I finally got up the nerve to try it! Chef John's video really helped. These were fun to make, and really tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Westgal"
},
"reviewBody": "Great recipe! Tortillas turned out beautiful! I cut the water a tiny bit and added the juice from one lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed"
},
"reviewBody": "Made this exactly as the video. These were super easy and came out great. I dont have a press so i used his heavy pan method. Will make these all the time. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grannysu"
},
"reviewBody": "We love Chef John's videos. He adds a bit of fun to cooking and his tips are spot on! The tortillas turned out great - so much better than the packaged ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SZYQ1"
},
"reviewBody": "These tortillas were perfect and homemade is far better than store bought! The texture and taste is just like the homemade corn tortillas I get from a small local Mexican restaurant where the mother makes these daily. The texture is soft, almost near wanting to melt in your mouth good while holding your taco fillings without crumbling apart. I had a few leftover and they reheated nicely for a few seconds in the microwave the next day without drying out. A tortilla press makes these easier to make (just lightly press), but does take some practice...at least for me in removing the tortilla from the plastic without tearing them, but my husband had no problem doing so. Definitely will continue to make these tortillas! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lea"
},
"reviewBody": "I followed this recipe and video exactly and the tortillas were the best I've ever made. So helpful - thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ricky P"
},
"reviewBody": "We have made many different tacos with this recipe. We’ve used yellow masa so far but just got white to try next!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colette"
},
"reviewBody": "Excellent instruction! I rarely watch the videos, but don't skip this one. I've made flour tortillas for decades, but corn tortillas aren't easy. This method works!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/263455/chef-johns-corn-tortillas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15855/bread/quick-bread/tortillas/",
"name": "Tortilla Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/263455/chef-johns-corn-tortillas/",
"name": "Chef John&#39;s Corn Tortillas"
}
}
]
}
}
, "about": [
]
}
]