				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Almond Biscotti"
,"datePublished": "2020-06-19T00:24:45.000-04:00"
,"dateModified": "2021-11-15T08:18:55.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This version of the classic Italian dipping cookie is made with almonds, but you can add hazelnuts, pistachios, and any type of dried fruit."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Poge0IUvDj9NL1E5S3wlZwctLNo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5679265-870e665405d445cd963fa6e9c2c492d9.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5584747607001",
"description": "The perfect quick cookie for entertaining season.",
"duration": "PT9M19S",
"name": "Chef John's Almond Biscotti",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/80afd571-efeb-4acb-bd17-3c410daf60c9/d658720b-0836-4441-aa77-edf5e001f7f8/640x360/match/image.jpg",
"uploadDate": "2021-07-15T12:25:54.716-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Almond Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "74"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "200 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "81 mg"
,"sugarContent": "15 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"1 teaspoon baking powder",
"0.25 teaspoon fine salt",
"3 tablespoons unsalted butter, room temperature",
"1 cup white sugar",
"1 tablespoon white sugar",
"1 tablespoon olive oil",
"2 large eggs",
"0.25 teaspoon vanilla extract",
"0.75 teaspoon almond extract",
"0.5 cup whole roasted almonds",
"0.5 cup chopped roasted almonds" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk flour, baking powder, and salt together in a mixing bowl."
} ,{
"@type": "HowToStep"
,"text": "Place butter, 1 cup plus 1 tablespoon sugar, olive oil in a separate mixing bowl. Mix together thoroughly until mixture has a creamy texture. Add 1 egg; mix into butter/sugar mixture. Whisk in 2nd egg, vanilla extract, and almond extract; whisk until smooth. Add flour mixture. Mix until flour is incorporated. Add whole almonds and chopped almonds; mix in evenly. Cover bowl with plastic wrap; refrigerate 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with a silicone mat."
} ,{
"@type": "HowToStep"
,"text": "Divide dough in half. Place each half on a length of plastic wrap and shape into a log. Wrap with the plastic wrap and press into a shape about 3 or 4 inches wide and about 1/2 inch high. Transfer both pieces to prepared baking sheet leaving about 3 or 4 inches of space between them to allow for spreading."
} ,{
"@type": "HowToStep"
,"text": "Bake in center of preheated oven until turning golden and a toothpick inserted into the center comes out clean, about 30 minutes. Let cool 15 minutes before slicing."
} ,{
"@type": "HowToStep"
,"text": "Reduce oven temperature to 325 degrees F (165 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cut each piece at a slight angle into 1/2- to 1 -inch thick slices with a serrated knife. Transfer pieces back to baking sheet in a single layer. Bake 12 minutes; remove from oven and flip pieces over. Return pan to oven and bake until biscotti are golden brown and crunchy, about 20 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Poge0IUvDj9NL1E5S3wlZwctLNo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5679265-870e665405d445cd963fa6e9c2c492d9.jpg"
}
]
,"text": "Transfer biscotti to a cooling rack; let cool to room temperature."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James W"
},
"reviewBody": "I have to bake about 20F lower. Added lemon and orange zest. Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChrissyintheKitchen"
},
"reviewBody": "I use an organic spelt flour. All organic ingredients and I sweetened with monk fruit and some coconut sugar. I added anise. I love the video which really helped. The mixture came out too dry so I added some melted butter and heavy cream. The dough sat for two days in the refrigerator, the cookies came out at fantastic. I used pecans and cranberries so this recipe is really a good shell for creative ambitions! Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gm5t2x7vjr"
},
"reviewBody": "I have been making this recipe for the last few years and became a Christmas staple in my home. Easy and delicious. I love so many of chef John’s recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So far so good- second bake in oven. I used a wooden spoon like chef john and one bowl. Add ins were chocolate covered almonds, orange zest, and cranberries. I used 60% of sugar and found that I could probably go less but hopefully won’t affect texture. Loved the video!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I've made a lot of Biscotti, but never an almond version. This recipe was simple and baked up well. I adjusted the quantity to make 50 pieces, but only netted about 30 pieces about 3\" each. Next time I will increase the initial bake to about 40 minutes to ensure the centers are fully cooked and don't stick to the knife when slicing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stewart"
},
"reviewBody": "I have made this recipe many times and given to neighbors and friends. I live in California and sent a box of biscotti to an Italian immigrant friend who lives in NYC. Here is his comment. I consider it the ultimate compliment! Dear Stewart! How are you? I hope all is well with you!!! I’m back in nyc and today I had your delicious biscuits.....they blew my mind!!! The best ones I ever had!!!!!! Thank you, Chef John, for making me look so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SundanceMom"
},
"reviewBody": "Forgot to mention dipping in tempered chocolate and drizzling on top, made these over the top.\nSundance Mom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "What a wonderfully crunchy biscuit! I made this for Mother's Day with some modifications, as my wife is allergic to almonds. \n\nI replaced the 1 cup of almonds with lightly toasted chopped pecans, doubled the vanilla, and replaced the almond extract with about two teaspoons of dried English lavender buds. Pairs very nicely with Earl Grey tea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Maria Tammaro"
},
"reviewBody": "Easy and delicious! I added 1 Tablespoon of cinnamon to the flour. My favorite flavours: Almond, Vanilla and Cinnamon....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gomezxsm"
},
"reviewBody": "amazing!!! Best cookies I have made so far ! and so straightforward. I followed the recipe exactly except I didnt chopped the almonds just used them whole . My boyfriend loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Montano"
},
"reviewBody": "I loved these almond biscottis. I did have one problem with toasting them in the oven. I followed the directions turning down the temp and baking them for 20 minutes on the second side. They came out burnt. We still ate them but the next time I took them out after 15 minutes on the second side. They were crunchy and looked much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G Lee"
},
"reviewBody": "First time making biscotti made as directed. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kitchen Passion"
},
"reviewBody": "The taste of olive oil was way too strong. Won’t be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs Rox C"
},
"reviewBody": "This is the first time I made biscotti and they turned out wonderful! I added nutmeg and cinnamon to the wet ingredients. \nI never go wrong with Chef John's recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLDREYER"
},
"reviewBody": "best biscotti recipe I have tried, as written.\nMy favorite twist is to add about a cup of dried cranberries, half a cup of finely ground almonds and a few tablespoons of Amaretto. \nI also toast almonds until nice and brown before I add them to the dough. Mine never need to bake as long as directed after they are cut, so keep an eye on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dave kenny"
},
"reviewBody": "Delicious. Perfect hint of almond flavor. Just the right amount of crunch after a quick dip in coffee. Chopped up all of the almonds, didn't feel that the individual pieces were big enough to support the whole almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TallMBA"
},
"reviewBody": "These taste and crunch perfectly. I followed the video for the loaf &amp; baking. The reason I gave 4 out of 5 stars is the serving size is for 15 @ 2 each. When cut the recommended size I yielded 18 slices not 30 as indicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Robinson"
},
"reviewBody": "Chef John's recipes are always the best! This is an example of that fact. Thank you, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eugina"
},
"reviewBody": "The taste is very good. Instructions easy- see video. And as others have stated the cooking time is way way off. My oven is accurate. Per other reviewer, I coarsely chopped all the almonds about 3/4C. Then toasted them. This kept almonds from falling out while slicing logs. After the first bake, as soon as I could handle the logs, I sliced them. Had I waited per instructions, I would have had a crumbly disaster. Easy peasy and no big crumbly mess. After cooking slices for the second bake, trying to get them golden NO NO NO. Takes too long, Wish I had listened to other reviewers and used my \"instinct\" to not cook this as long until golden. These will break your teeth after they cool!! Need a java dunk! I will make again BUT the logs will get a simple egg wash prior to first bake to get golden. And the second bake will be about 6 - 8 min/side keeping an eye on them. Nice authentic taste and not heavy or too dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patty"
},
"reviewBody": "My family loves this recipe. It is very tasty. This is such a great recipe that you can add and change the flavors. Today I made 2 batches. I put orange zest and used orange extract along with some orange bits. This one also has mini chocolate chips. I always get rave reviews from friends. We have actually shipped it across country to our son who loves getting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "seeds"
},
"reviewBody": "I'm making these again using your recipe.\nI have to tell you that you're my favorite chef. BUT, you've got to stop using the term \"I'm going to go ahead and\". Because if watch your biscotti video while mixing ingredients, you said \"I'm going to go ahead and stop\". WHAT? C'mon John, please \"GO AHEAD AND STOP!!!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "QUEENSHARON00"
},
"reviewBody": "It was pretty good although I have to substitute stevia or splenda for sugar when I bake and use Whole Wheat Pastry Flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mqnmama"
},
"reviewBody": "Great! My first effort was yummy but a bit too browned on the bottom. (My error). After that it’s fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky55e"
},
"reviewBody": "Just tried this recipe after a couple of tries with one of the simpler ones here. They've just come out and I can already tell that I like the flavor better. I add considerably more flavoring than the recipe calls for. I don't know if it is old taste buds wearing out or what, but it seems we need more flavor than most recipes called for.\nI wound up incorporating the last of the salt mixture by hand as whisking wasn't picking it up. This is chock full of almonds. Some of the whole almonds fell out when shaping the loaves and others when slicing. I might try more sliced almonds and fewer whole ones next time. I still get considerable crumbles when slicing and will continue to try techniques that overcome this problem as I hate to go to the trouble of making them only to have so many wind up as crumbles on my cutting board. This may be the recipe that I use to go off on biscotti flavor adventures!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat bell"
},
"reviewBody": "This recipe turned out great. It was fun to make; I used hazelnuts because I didn’t have almonds; next time I will use almonds. Love dipping them in my cappuccino! Video was very helpful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacquidbw"
},
"reviewBody": "I've tried numerous biscotti recipes over the years. This by far is my favorite. Everyone in my family loves them. It's a super easy recipe with delicious results so give it a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lori Perkins"
},
"reviewBody": "I’ve now made it twice. I won’t try again. They are too dry. Too hard, and waaaay too sweet. . I’ve tried a few different things, but they still aren’t very satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RevZak"
},
"reviewBody": "This is an almost perfect basic recipe. I will tweak it a little but being able to do so is a tribute to a simple recipe. My guess is that he knew this. I will add a little more Almond extract and possibly a bit of anise. I may also add a touch more sugar and no olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanti"
},
"reviewBody": "I'll be making this again. Biscotti came up perfect and softened just the way I like when I dunked them in my morning coffee. You do not need to use plastic. I put a lid from one of my pans over the bowl when I let the batter sit in the fridge and I spread a bit of flour on the counter when I rolled out the batter and they came out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathryny"
},
"reviewBody": "These cookies are wonderful! Thanks Chef John for your videos that make me feel brave enough to try something like this recipe! I have made it twice now and everyone loves these cookies. I dipped them in melted chocolate and then sprinkled with sprinkles :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rain68"
},
"reviewBody": "These Biscotti's are devine and addicting. I wouldn't deviate from the recipe. It's perfect. Thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Rainier"
},
"reviewBody": "I made these just how the directions said. They were delicious I added crushed almonds and raisins, and crushed almonds and toffee bits yo my second batch. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happypoa"
},
"reviewBody": "Just made this to give to my neighbors for Christmas. First batch I cooked for 30 minutes, but it was a bit undercooked. 2nd batch I left in for an extra 5 minutes; turned out better. I also left it in longer to golden brown for the toasting period. Great recipe, only thing I would change next time is the amount of sugar. I'll play around a bit as the cup and a tablespoon is too sweet for me.\n\nDipped in white and dark chocolate for presentation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stantonstreetkid"
},
"reviewBody": "Recipe as-is is just deeeeeeeeeeeelish! I made no changes, but I did, as Chef John mentions in the video, go with a little lemon zest. I can see myself making them daily as they’ll disappeat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aege"
},
"reviewBody": "These were so easy and soooo good. I did large chop all my almonds because whole almonds are a little hard to slice through. Excellent with coffee. I can't wait to make them for this Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Cicchelli Britton"
},
"reviewBody": "Absolutely delicious! I added some walnuts to my sliced almonds, otherwise it was as the recipe directed. Next batch, &amp; there WILL be a next batch, I’ll bake them a few minutes less so there not quite a crunchy, but they are definitely delicious!!!!! I highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "Another fabulous recipe from Chef John. I made this recipe exactly as written. Perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marebear"
},
"reviewBody": "I added 1 tsp vanilla to wet ingredients. I then split the wet mixture and 1/2 the flour mix to make two doughs. To one I added 1tsp almond extract and 3/4 c whole almonds and a 1/4 c sliced almonds and formed a loaf.\nTo the second mixture I added 3/4 c each of chocolate chips and roasted hazelnuts and formed that loaf (using floured hands). I will use this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MonsieurB"
},
"reviewBody": "Delicious and Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Justesen"
},
"reviewBody": "Love the recipe. Family and friends love them. I made Cran raisins and pecans and another batch was toffee and pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Brown"
},
"reviewBody": "I added dried cranberries and orange zest to my version and it was amazing. I love all Chef John recipes!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joanna Borelli Ramos"
},
"reviewBody": "Only change I made was adding a splash of Anise extract and I omitted the zest. 2nd time making these. I love biscotti so I save money making them at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slicksrants"
},
"reviewBody": "Amazing. First time I’ve ever made biscotti. Amazing. I just didn’t put it back in oven after wards so it wasn’t as crunchy. I’ll be making tonnes for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "I used chopped hazelnuts in place of the almonds, and kept everything else as stated in the recipe. I loved the tips in the video about shaping the loaves in plastic wrap. I've made biscotti many times before, but always used a floured board and floured hands to shape the logs. The plastic wrap trick worked great! These are delicious dipped in a nice cappuccino for a mid-afternoon snack! Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KristalWithaK"
},
"reviewBody": "Delicious and easy to make. I might try using a bit less sugar next time. They’re not overly sweet. I just like my biscotti less sweet than, say, a cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "Used pistachio nuts but otherwise didn't change anything. Really good biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I never made biscottis before but they’re my moms fave so I wanted to try them out for our coffee and tea. I don’t even like biscottis but these are delicious! I did t have almond extract so I just did vanilla in place of it. Mine came out a little darker than I would have hoped but I didn’t have a silicone mat either so I’m sure that was the reason. I definitely want to make these again! Thanks for the helpful video!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb8766"
},
"reviewBody": "Straight forward recipe,easy to follow and turned out delicious ( I added cranberries for the flavor and texture )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail_Rose"
},
"reviewBody": "I've made this a couple of times now and these always turn out wonderfully. I've made them with just almonds as well as with white chocolate and macadamia nuts and both variations were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Deubler"
},
"reviewBody": "These are the best Biscotti, the flavor is terrific, the crunch is great, with a good cup of coffee nothing better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larry"
},
"reviewBody": "i made a couple of changes but they came out very good - since i have diabetes, i used half the sugar and half sugar substitute - also i was short on flour about 1/2 cup but it didnt make any difference - wife doesn't like sugary food but wolfed them down and told me to make more - gotta make mama happy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muthanna Yacoub"
},
"reviewBody": "I also tried it with a couple experiments, with the following results:\n- Whole grain wheat flour: works well\n- Coconut oil: about the same, but a little less crunch\n- Brown sugar: you lose a lot of crunch, more of a cookie texture\n- Flax seed \"egg:\" good vegan mod, but you lose some crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriS"
},
"reviewBody": "I L-O-V-E. John’s narration of his recipes! Gonna bake this one today just because of it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis R"
},
"reviewBody": "This recipe came out exactly has Chef John indicated and taste superb. Far better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia"
},
"reviewBody": "Fabulous! I have made this 3x now, exactly as written. I doubled the recipe the last time because the first two batches I made were gone too quick! Thank you for another great recipe, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Bruegger"
},
"reviewBody": "First time making biscotti and this recipe was so easy to follow. I didn’t have roasted almonds so I used chocolate covered almonds and crushed those... worked great! I put them in the oven the second time for less then the recipe suggested. One I have a “hot” oven and two I don’t like them so dried out. Thanks for another great and easy recipe to follow Chef John. The videos are always helpful to watch before making the recipe too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura ~"
},
"reviewBody": "Excellent recipe, as are all of Chef John's that I have tried so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia Shadler"
},
"reviewBody": "Made these almond biscotti and they turned out delicious! I followed the recipe accordingly and followed Chef John's instructions per the video and couldn't be happier with the way these turned out. The instructions were easy to follow and the breaking process matched the results of the video. I will definitely be making these throughout the holidays. I am thinking of dipping these in chocolate for added flare but all is said and done, really happy with this recipe and would definetely recommend this recipe to anyone looking for easy recipes for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MYSTICL"
},
"reviewBody": "Made these thinking if they turned out i could give them as Christmas gifts. They turned out but they never made it to life as a gift. Now I have to make more. I followed instructions exactly and my biscotti turned out amazing and looked just like the photo. My almonds were raw so I roasted them for 15 minutes at 350' to dry roast them before using in the recipe. really good even without coffee but dipping them took them to a whole new level of delicious. Exactly as advertised and easy to make I am going to make my second batch this afternoon in hopes of some making it under the tree ... wish me luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bootie"
},
"reviewBody": "Fun to make, love his videos. He gives great pointers. These turn out fantastic as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kjmussat"
},
"reviewBody": "I have made these twice in the last month...they are wonderful I like to add diced apricots. MMMM GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taylor Neighbors"
},
"reviewBody": "These biscotti have just the right amount of sweetness. I was a little bit worried with how much almond extract was going in because it has a really strong smell, but once it's all mixed it's the perfect amount. It seemed like mine were getting a little too much color in each stage of the baking, so next time I'll try going at a lower temperature."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/260575/chef-johns-almond-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/845/desserts/cookies/international-cookies/",
"name": "International Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14707/desserts/cookies/international-cookies/italy/",
"name": "Italy"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/260575/chef-johns-almond-biscotti/",
"name": "Chef John&#39;s Almond Biscotti"
}
}
]
}
}
, "about": [
]
}
]