				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Falafel"
,"datePublished": "2015-03-13T21:54:18.000-04:00"
,"dateModified": "2019-10-10T00:52:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Craving falafel? You need to soak the chickpeas a full day before you actually want to eat. After that, it&#39;s simple to make. Serve with Chef John&#39;s tahini or tzatziki sauce and pita bread."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iTnzG-KF3EokQHMwZgUcHfQ5MrA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2222246-070ed71ae2ab44d289066da24f2d5cf5.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4114710068001",
"description": "Try this crisp, tender, all around yummy recipe for falafel!",
"duration": "PT6M22S",
"name": "Chef John's Falafel",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/8965f1cf-98e8-47ed-9dea-9e08f526dc78/3df79f1f-e9d4-40b2-b6b9-77463bd853b9/1280x720/match/image.jpg",
"uploadDate": "2021-07-16T20:38:54.796-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Falafel"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "153"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "271 kcal"
,"carbohydrateContent": "24 g"
,"fiberContent": "7 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "646 mg"
,"sugarContent": "5 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup dry garbanzo beans",
"0.5 yellow onion, diced",
"0.5 cup chopped fresh flat-leaf parsley",
"4 cloves minced garlic",
"1 tablespoon all-purpose flour, or more as needed",
"2 teaspoons lemon juice",
"1.5 teaspoons salt, or to taste",
"1 teaspoon ground cumin",
"0.5 teaspoon ground coriander",
"0.25 teaspoon baking soda",
"0.125 teaspoon cayenne pepper",
"oil for frying" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place garbanzo beans into a large container and cover with several inches of cool water; let stand 12 to 24 hours. Drain."
} ,{
"@type": "HowToStep"
,"text": "Blend garbanzo beans, onion, parsley, garlic, flour, lemon juice, salt, cumin, coriander, baking soda, and cayenne pepper together in a food processor, scraping down the sides of the bowl as necessary, until mixture is finely ground and holds together when pressed. Transfer garbanzo mixture to a bowl, cover with plastic wrap, and refrigerate until flavors blend, 1 to 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Divide dough into 12 portions and roll each with moistened hands into a ball."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iTnzG-KF3EokQHMwZgUcHfQ5MrA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2222246-070ed71ae2ab44d289066da24f2d5cf5.jpg"
}
]
,"text": "Working in batches, cook falafel balls in hot oil until browned and crispy, about 5 minutes. Transfer to a wire rack to drain."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT750M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "The flavor was great, although a bit salty. I would cut the salt in half next time. The big problem for me was that about 1/3 of the falafels broke apart in the oil when fried. I did use canned chickpeas, which I drained and dried with paper towels. But this would not explain why only 1/3 of them fell apart. I believe the problem is that your scooper must be tightly packed. I will make them again (with less salt and more tightly compacted) because it is a vegetarian dish that my carnivorous husband loved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "So proud of how these turned out! Made no changes to the recipe. Used about 1/2 an inch of oil to fry patties in. Ate with cucumber sauce, baby spinach, tomato slices in a pita. Delicious and looking forward to making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim McLeod"
},
"reviewBody": "Five stars for a delicious recipe. Five stars for Chef John's videos - he is hilarious! At almost 49 years old I still have never used a food processor - so I used a Vitamix blender on pulse and it worked out great. I hate having too many appliances and gadgets - we'll see how long I last until i cave in. Anyway, after refrigerating for a few hours I ended up adding a couple extra tablespoons of flour as the mix seemed a little too wet. Fried them in a pan with avocado oil on level 6 (just above medium) for 3 minutes a side. Perfection! The kids loved them, and they loved the accompanying tahini sauce. We scarfed them all down and are already planning to make these regularly. Thank you, Chef John! You're the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauri"
},
"reviewBody": "I’ve never had falafel before and I can’t say enough good about this recipe. I made it before watching the video. After watching the video I think I may have over processed mine, but honestly the taste was still fabulous. I made a Greek yogurt sauce with lemon juice, lemon zest, olive oil, garlic, parsley and some spices, and then served with diced tomatoes and Persian cucumbers marinated in lemon juice. Absolutely fabulous! I cut the balls in half to better fill out the pita pocket. I’ll be making this regularly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Douthett"
},
"reviewBody": "Okay, I sort of made this, and sort of another recipe. I followed someone's suggestion about drying canned chick peas, and that seems to have worked. I otherwise pretty much followed Chef John's ingredients and directions, except I used our air fryer instead of deep frying. I doubled the proportions here and got 17 pingpong ball sized falafel. It was fun, pretty easy, and the falafel were very flavorful and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timothy Burgess"
},
"reviewBody": "Added about twice as much lemon juice and an extra Tbsp of flour. Came out delicious and paired well with chef John's tzatziki."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monkeymom5"
},
"reviewBody": "I had two batches of garbanzos lying around. Both started out as dried beans. I soaked one batch for 18 hours in cold water. After which they were still quite firm, kind of raw-tasting and had a bit of crunch to them. \n\nThe second batch, I had used for hummus the day before and had been cooked to the point of being much more tender. Firmer than canned beans, but more similar. \n\nMy plan was to make a load of these in my deep frier and freeze some for later. I used canola oil, heated it up to 350 and in they went! The first batch I put in were made with the cooked garbanzos. What ensued was a culinary horror show. They literally disintegrated in the oil, right before my eyes. It was like the scene in a Pirates of the Carribbean movie, where Blackbeard meets his end in the Fountain of Youth. Completely gone. I was so disappointed, I nearly shut everything down and gave up. The sadist in me, decided to put one of my soaked bean falafels in, just to see if it met the same fate. \nLo and behold, it kept its perfect round shape and fried up beautifully!! In fact, my family said that these were on par with some of the very best falafels we'd eaten in NYC. To recap:\n\n*Use soaked garbanzos ONLY*\n*Add salt slowly.*\n\nFor us, 1 tsp. of salt was perfection. I added the full 1 1/2 tsp of salt to my disintegrating felafels and felt remorse as I tasted the saltiness of the unfinished product. \n\nMade these into wraps with lettuce, fresh veggies and tzatziki sauce. My dinner table is a circus"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichole Dow"
},
"reviewBody": "Definitely use dried chickpeas and follow the video's instructions - these are superb"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raeandlars"
},
"reviewBody": "I've made these several times they are the best falafel recipe I've found! I've used fresh parsley (the best), but dried parsley when I didn't have fresh and still excellent! Just use one third the amount if using dry. They also freeze well, best warmed up in the oven to keep them crispy, but even from the microwave-delicious! I make them into the small patties so we can have them in homemade pitas with tzatziki sauce and chopped tomatoes and/or sweet red onions. You have to try these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Vinícius"
},
"reviewBody": "This tastes great and freezes very well. I like to make a double batch and freeze some balls for later.\n\nTips: \n- Make sure your chickpeas have soaked are soft all the way through after soaking. I always soak them for the full 24 hours. I found that 12 was not enough for the beans I buy and I'd get some annoying hard bits after processing.\n\n- Don't process the chickpeas for too long, or they final texture will be a bit mushy and you won't get that nice rough exterior on the fried balls. It took me a couple tries to get this part right.\n\n- DO NOT bother with canned chickpeas. Those are pre-cooked, so you are essentially cooking them *again*, which will inevitably make them mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Khaled Saleh"
},
"reviewBody": "Delicious, \nI've added leek to the mix (Egyptian recipe). \nI had difficulty shaping into a ball, it'll not hold. Adding one egg to the dough and mix well did the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fitzy"
},
"reviewBody": "This was wonderful. I haven't had falafel in about 20 years and this was so good and just like I remembered, only better because I made it at home. I made tahini sauce as well and there were virtually no leftovers. I used a red onion since it was what I had on hand, and we served the falafel in pita pockets with grape tomatoes and leaf lettuce. The next time I make this, I will use the mini naan bread since naan is softer than pita bread. Thanks for another great recipe Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "metalman"
},
"reviewBody": "I've made this several times. great flavor and texture. Chef John never fails with his recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lexiiscool"
},
"reviewBody": "I would not process it as well as I did, it was too smooth. Next time I will make it a little bit chunkier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was amazing but I used canned garbanzo which held more liquid therefore causing me to use more flour. Probably added too much because it was very doughy instead of chunky veggie how a normal falafel should look. Was worse the next day. Next time I’ll follow the recipe to the T. All the defects were definitely my fault but the flavor was DEFINITELY there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladydi"
},
"reviewBody": "My first attempt at homemade falafel. So yummy. I used some chopped mint and cilantro to make up the 1/2 cup herbs. Mostly parsley though. When you heat your pita in the oven, place a ball of tin foil in each half to keep them open while they heat. Much easier to fill that way. Thanks Chef John! I always check your recipes before trying anything new."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tallylynn"
},
"reviewBody": "I followed the recipe, easy and delicious!\nI shallow fried half, and used my air fryer without oil with the other half, and far preferred the air fryer falafel. \nI served with warmed pita, tomato, lettuce and Tzatziki! \nWill definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abril Cordoba-Hernandez"
},
"reviewBody": "Didn't turn out as good for me as I think I processed it for too long and was more pasty and used a bit too much cumin but still tasted very good when topped with mayonnaise. Gonna try again in the future to perfect this but still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asspadtycoon"
},
"reviewBody": "Outstanding recipe! Very fresh tasting, and just the perfect consistency. When you fry these babies up, they are brown and crispy on the outside, and soft and fluffy on the inside. We made delicious gyros."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelle"
},
"reviewBody": "I have been making these for over a year and they never disappoint. Chef John is the best and his videos have helped me with so many of his great recipes. My confidence in the kitchen is growing with every recipe I make. Thank you Chef John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kboniface"
},
"reviewBody": "Loved this! I made patties rather than balls so I could serve it in pita bread. Also made Chef John’s tahini sauce to serve on top. I didn’t change anything and would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Register"
},
"reviewBody": "I adore falafel but have never made it myself. When my favorite Lebanese restaurant closed and I've not been able to find another substitute that comes close I decided to give my own a try. Chef John's recipe is amazing! Everyone who tries these says they are restaurant quality. I've also found that you can make a large batch and just freeze the mixture in small baggies to feed however you want to divide it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GaelVee"
},
"reviewBody": "This recipe was followed exactly and was absolutely delicious. I really like my falafel and this was the easiest recipe I've seen yet. It's definitely my go-to. I do, however, ask if this would be equally delicious if alternate dried beans were used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Eckstein O'Neil"
},
"reviewBody": "I forgot to soak the chickpeas, so I cooked them in the instant pot when I got home. Using cooked chickpeas caused them to fall apart while frying. Another website said to add more flour when using cooked chickpeas. I added a couple of tablespoons of flour and the rest of the falafels stayed together. Didn't have parsley, so I used cilantro....which was great...I will always use it instead. Pan fried in deep oil. Fit well in the pita pocket bread. Didn't have tahini. Wanted to make cucumber sauce, but didn't have cucs either. Lightly fried small cubes of zucchini and onion. Added lemon juice, dill, and cubes of raw tomato and served with plain Greek yogurt. They were a big hit here. We are stuffed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mims "
},
"reviewBody": "Authentic and absolutely delicious!!! Will definitely save this recipe. Thank you, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Testing123"
},
"reviewBody": "very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Checkett Farver"
},
"reviewBody": "I've made this recipe several times now. I recently went to a local Mediterranean restaurant and declared to my friends that my falafel is better (thanks to Chef John, of course)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Jones"
},
"reviewBody": "Fabulous and easy! I added just a little extra garlic and parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Gibbons"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GardenGirl"
},
"reviewBody": "This is an excellent falafel recipe!!! Reminds me of my favorite little falafel place in Philadelphia. I used fresh dry beans(old super dried out beans don’t rehydrate as well). I added 1 tablespoon of chopped dill, went slightly heavy on the amount of cumin and coriander, and did not add any wheat flour.For frying, I used a heavy, high sided 3 quart sauce pan and had no splatter. Fried the falafel 5 at a time. After dropping balls one at a time into oil, give them 20-30 seconds to form a crust before moving them around occasionally until nice and dark golden brown. If your oil smokes, it’s too hot! I kept my burner around medium- medium low heat, adjusting as needed. I didn’t watch the clock, but I think each batch took about 5-6 minutes to cook. Excellent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seashell Seashore"
},
"reviewBody": "My vegetarian nieces love these, and even my meat eating nephew! I've been recruited to make them every time I visit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JackieVZ"
},
"reviewBody": "Made it twice, it's really delish. The first time was more successful holding together in the fry pan then the 2nd attempt: we will keep trying to get that texture just right. Again: delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crys Nik"
},
"reviewBody": "Sooooooooo good!!!!!!! As soon as we ate them, I went to the store to buy more chick peas to make them again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbagnall"
},
"reviewBody": "My husband needs to eat gluten-free, and this is an easily convertible recipe (we just substituted cup-for-cup gluten-free flour for the all-purpose flour in this recipe, and it worked great). Very delicious and easy recipe! Be careful not to over-blend in the processor, or the mix can get too liquidy and difficult to form and drop into the hot oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "I must admit, I love Chef John, I don't care what he's making, I'll watch it and smile at his food innuendos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ray"
},
"reviewBody": "I made this several times. Although I followed the instructions to the \"T\" they keep falling apart. Nothing I do they won't keep their shape. If you have any ideas let me know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "This was great. Made it 2 days in advance and fried in oil just before serving. Had to modify the tahini sauce— added water, lemon, vinegar, cumin, salt, cayenne"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BB J"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jbb Jackson"
},
"reviewBody": "quick, easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Cummings"
},
"reviewBody": "I have made this recipe many times and it never disappoints. I do add an extra tablespoon of flour because mine seem to fall apart without it. Other than that I follow the recipe exactally. I highly recommended this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "These are the best ever, followed the directions to the letter ....... So good ! I live with vegetarians so I am always looking for meatless meals. My 7yr old granddaughter has been raised vegetarian since birth. She absolutely loved these falafel, so full of protein. We are also a fan of chef John's lentil burgers. These are a must try !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lani Johnson Castro"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scot Needham"
},
"reviewBody": "This was a Home-Run! Turned out amazing. The hardest part was getting the dry garbanzo beans. I used an ice cream scooper to drop the mix in the oil ant turned it once with a long fork. Thanks will save for the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle C"
},
"reviewBody": "These were really delicious! Even my meat-loving husband commented on how good they were and said we should have them again for dinner. I followed the recipe exactly, with about 3 hours of chilling time before forming patties, and I had no problems with the mixture staying together as I pan- fried them. They turned out perfectly crispy and went great with a simple tsatziki sauce in homemade pitas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April ZEO"
},
"reviewBody": "Delicious!!! I was all out of cumin, so I subbed savory. Definitely a winner!!! Thank you for sharing the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STrumbore"
},
"reviewBody": "Challenging recipe but worth the effort. I have made this several times because you can depend on a better texture and flavor when you make them yourself. Great for guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mica"
},
"reviewBody": "Made exactly as written and it turned out great. This recipe is now in regular rotation in my house. For even cooking, the mixture should be brought to room temperature before frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Brian"
},
"reviewBody": "They came out amazing, but I didn’t have baking soda and substituted a 1/4 cup of self-rising flour. I also couldn’t find Tahini sauce, so I used plain greek yogurt and seasoned it with the same ingredients as the falafel mix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Fraser"
},
"reviewBody": "Sooo good! Didn't change anything. However, I will only use half the salt next time because they were way too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Wow! We really enjoyed these! I’ve always loved falafels, but never considered making them myself. I’m so glad I did. The uncooked balls are a bit delicate, so handle them gently. Once they’ve been frying for a minute, you’ll be able to bump them around. Starting with dried garbanzos is the way to go. Following this recipe exactly, the end product is just like those you get from your favorite falafel joint! I paired them up with some tzatziki sauce made from scratch and fresh tomatoes. My fryer is loaded with peanut oil so that’s what I used. These are very filling, so I might not make these again — until next week ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovethekitchen"
},
"reviewBody": "Amazing recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Hassenzahl"
},
"reviewBody": "Tasty falafel! Great for lunches! Plus you can double the recipe and make an entire week's worth of lunches. I've had falafel before but never made it before and I'm not experienced with frying anything, but they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jillypoo"
},
"reviewBody": "Fallafels were mushy. Followed recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron Jenson"
},
"reviewBody": "Living in Houston there is no shortage of places to get falafel. But getting a really GOOD falafel is another issue. This recipe is among the best I have had!! Go Chef John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ish3891"
},
"reviewBody": "Delish! I didn't make any changes. I used the pan fry method. This was my first time making falafel and they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andy Braithwaite"
},
"reviewBody": "No changes and I will make it again. I'll probably use a little more flour as they didn't bind together quite as well as I'd have liked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dean Stresing"
},
"reviewBody": "Wow! These were a great tasting, crispy, yet tender on the inside meal addition. I must caution that I did have some difficulty locating the dried chick peas in my neck of the woods, but that was really the hardest part. I doubled the batch and added more flour after an initial test of rolling them into balls. They were a little too loose still, so I deep chilled them in the freezer before dropping them into the deep fryer. After the chilling, I think that they held together well until they formed a nice crust to hold them together. I mentioned I made a double batch, and then froze the uncooked leftovers for the future. I think that they will do just fine in the deep fry from a frozen state. Totally worth the effort. We ate them all up. FOLLOW UP - Yes, I did indeed use the frozen ones about two weeks later, and they came out great. It was an unexpected gathering and I was able to pull these and directly fry them up in an electric deep fryer and they turned out GREAT. I impressed my guests and it was so easy to just reach in the freezer and have them on the table in a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "We loved this. It was so fresh and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "A few tweets, but most importantly I made the flattened balls and put them on a cookie sheet and froze them so I could bake them 2-3 at a time at 400° for 20 minutes. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "george kouroupis"
},
"reviewBody": "This recipe is pure perfection! I've tried making falafel in the past and something always went wrong: wrong texture, wrong spices, wrong ingredients that made the balls fall apart or stick to the pan. These little guys tasted just right with a little kick of cayenne and all the other stuff. My biggest fear when I started frying them was that they will stick because it looked like they would, but no, everything went well. I stuffed them into tortillas (it's a heresy, I know) with thinly shredded purple cabbage, pickles and greek yogurt and had a very happy family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FlorrieMarie"
},
"reviewBody": "Super easy and VERY tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Louis"
},
"reviewBody": "Omg so good! I’ve tried a few recipes before and none have been this good!! Plus they worked well baked too!! I made a double batch, formed them, and froze them on a cookie sheet before packaging them up better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gee Gee"
},
"reviewBody": "This was fantastic. I followed Chef John's suggestion and used half parsley and half cilantro. I'm currently eating low carb so the only thing I did differently was use almond flour instead of of regular flour. Just follow the directions exactly as written and please don't use can beans. Just don't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Haun"
},
"reviewBody": "This falafel was SO EASY!! It was also delicious. I followed the recipe exactly (including adding just a little more flour to help the dough form into balls). I was testing out this recipe to see if I want to serve it to my friends and I definitely will. I only had to deep fry mine for 4 minutes, otherwise they would have been overdone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "Oh Dear Heavens!! Turned out absolutely perfect. Crispy, moist, savory...it hit all the checkboxes. I served mine with a revved up tzatziki sauce, also made with Chef John's recipe. I just added Tabasco sauce. Absolutely love the stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jbritt"
},
"reviewBody": "Completely fell apart in oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ibscarry"
},
"reviewBody": "Made according to recipe. Results were meh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookin'"
},
"reviewBody": "The first time it was extremely salty and inedible, but since I'd only fried a few balls from the first batch I made a 2nd batch without salt and mixed it with the remainder of the first batch. Then it was delicious, although I used dry parsley.\n\nFor the 3rd batch on the following week I used only 1/2 teaspoon of salt, fresh parsley as called for in the recipe, and chickpea flour instead of regular (wheat) flour. I also added a tablespoon of tapioca starch to hold it together. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abbiel"
},
"reviewBody": "These were great - moist on the inside, crunchy on the outside, good flavor. This recipe only made 8 falafel, though - enough for 4 people, not 6."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bibbs"
},
"reviewBody": "This recipe is excellent as is, but I found great results swapping rice flour in place of regular flour to make it gluten free and swapping the parsley for cilantro out of personal preference. Thanks, Chef John, for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luis"
},
"reviewBody": "First time making it and it was delicious! Loved the flavor.\nThe only problem was that they fell apart while frying, one almost dissolved completely. I took a chance with canned garbanzo beans (my bad) even after reading others that attempted it. \nI even tried to dry them out in a 350 deg. oven for 10 mins after breaking them up in the food processor, still wasn't enough.\nDefinitely will make again but to the \"T\" next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margo"
},
"reviewBody": "You Can Use Canned Garbonzo (Chickpeas) in this recipe. \nRinse canned beans, dry on paper towel for a bit, then put in 200* - 250* oven for a few minutes to dry out. Let coast after turned off oven, till dry!\nTo get more of a lemon kick, I also process in some lemon rind\nI always make small rounds and pan fry in my large cast iron skillet. \nSometimes my mixture is a little dry, so I add 1/2 beaten egg so patties stick together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kathy Pereda"
},
"reviewBody": "The falafels fell apart in the oil. It was a mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Zaccone"
},
"reviewBody": "mixture was quite damp and difficult to fry, we don't have a deep fryer, but with the help of my wife we got it done. Sample was tasty and we'll see how our vegetarian daughter rates them! Made according to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Buzzkat"
},
"reviewBody": "Incredibly bland. Two stars for simplicity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andyjj"
},
"reviewBody": "I made these, following the recipe exactly. Turned out great...\nTo you guys using canned beans or altering the recipe and then giving poor reviews, shame on you. If you follow the directions to a T, it will turn out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "I was nervous to make this for some reason, but Chef John always gives such thorough directions it ended up being easier than anticipated. Tasty! Served in a pita with hummus, lettuce/tomato. Next time I'll try the tahini sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BG"
},
"reviewBody": "My kids even ate it. Delicious. Made Chef John’s tahini sauce with it, which was the saving grace as far as the kids were concerned anyway. Followed recipe with exception of a heavy pinch of cayenne. Will def make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "This is my first time reviewing a recipe and I am now because I was so happy with how these turned out. They are exactly like the falafel from the Mediterranean restaurant I go to. The directions were spot on and I'm excited to be able to make these at home. My only change would be to half the salt next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chittman"
},
"reviewBody": "So easy, and sooooo awesome!!!! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jodi"
},
"reviewBody": "These were great. I used flax seed meal instead of flour. Super easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lanie122"
},
"reviewBody": "I love falafel but had never tried making it myself. This recipe is easy and all of the ingredients were staples in my pantry (except for the parsley). Since it was just for one, I halved the recipe but still had enough for 3 meals. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ayla Higgs"
},
"reviewBody": "Amazing crispy and flavorful falafel! I couldn't believe I had made it. Just stick to the recipe. The video also helps a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sweet Tee"
},
"reviewBody": "I followed the directions, but I found the falafels to be rather undercooked and on the drier side. I let the beans soak for 24 hours and noted they were still a little hard to the touch, but since I didn't read anything in the reviews about it I proceeded to put them in the food processor. I waited for the oil to be hot enough as suggested by reviewers, but then I lowered the flame to avoid the outside being burnt with an undercooked inside. Couldn't finish my meal. The flavor was on point (I did add more salt than suggested along with a bit of Adobo seasoning for richer flavor). I'd love to read tips on how I can improve what I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "eBeth"
},
"reviewBody": "I used 1/2 tsp salt. I don't know what went wrong. It disintegrated in the deep fryer. I'm gluten intolerant so I used GF flour. This was very tasty falafel so I'd like to bake it sometime. I'd give it more stars but the big energy waste of preparing this for a party only to have it disintegrate in the deep fryer was a downer. I pan fried the remaining dough over the next few days in olive oil and that was very good so I'll keep the recipe in my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This was a great recipe. I had leftovers from the night before in case my daughter and friend didn't like it but to my surprise they loved it! I made it in a fry pan in a patty style using 2 Tbsp of mix per patty. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maxine"
},
"reviewBody": "Just made it, first time ever trying. I followed the recipe exactly and made my own tzatziki sauce yesterday (All Recipes again) and this was fantastic! Very filling and delicious. Thank you for sharing Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallen0072"
},
"reviewBody": "awesome flavor and super easy to make. the hardest part was finding dry chickpeas in my area of Ohio. once I had those it was smooth sailing. Delicious authentic flavor. for great cucumber sauce mix a 6oz plain yogurt with 1 Tbsp of mayo, plus half a diced peeled cucumber. Salt and pepper to taste and a dash of cumin and refrigerate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Koko"
},
"reviewBody": "The taste was great but I used canned chickpeas which turned out very moist and crumbled in oil. I coated then with additional flour before frying, but was still crumbly. I didn't used salt or baking soda, and added a littler more cumin and a lot of flour. May coat them with breadcrumbs next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Dreibelbis Family"
},
"reviewBody": "In the essence of saving time, and because I forgot to soak the beans, we used 2 cans of garbanzos instead of fresh. The falafel was delicious, with just the right amount of garlic and spices. The kids tore it UP!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma D"
},
"reviewBody": "Made these for my women's group this week and they were a big hit. Plus, my teenagers enjoyed them too! Thanks Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spiffo"
},
"reviewBody": "Excellent recipe! Chef John is one of my personal heroes. Other posters saying not to used canned garbanzo beans are absolutely correct. I did and regretted it. They fell apart while frying. I have made this several times since and soaked my beans overnight like Chef suggested and it works beautifully. Thanks Chef John! You are awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GentleTopHat"
},
"reviewBody": "I couldnt get the same texture as John but in the end the falafels were just as good im sure. Keep up the recipes John. Thanks! I give 4 stars because even if I followed the recipe, the texture wasnt there but hey it still did the thing, the patty were falling appart a bit. I used them to make a pizza style dish with a yoggurt/cucumber sauce, tomato, jalapeno, lettuce and green pepers on a nan bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kpizzle"
},
"reviewBody": "Fantastic! Loved the texture of these once cooked. The patty method was easy to do and they were crunchy on the outside, moist on the inside. My falafel mix sat in the fridge for 2 days which probably improved the flavor. Might try these as veggie burgers. Dry beans all the way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassiopeia"
},
"reviewBody": "This was so, so good!!!! For anyone who has neither a deep fryer nor a thermometer appropriate for measuring the temperature of the oil, this might be helpful to know: on my gas stove, a tiny bit hotter than medium heat was perfect. (The first couple fried up too dark because I had the heat too high. There was a little bit of a charred taste, but we still ate them--that's how good this recipe is!) Hope that helps someone else!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LikeAStar"
},
"reviewBody": "The only change I made was to reduce the salt to 1 tsp. I also made patties instead of balls so I could serve the falafel in pitas. Yes, this takes some preparation, but to my mind it's worth it when the end product is restaurant quality and adds to my arsenal of simple, accessible vegetarian and vegan recipes :). Thank you, Chef John! I will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tdackemann"
},
"reviewBody": "We thought they turned out even better than the local Mediterranean restraunt. We are placing this on our go-to list. Try the sauce too...delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison"
},
"reviewBody": "This was a great recipe as written. Thanks chef john for the awesome vegetarian option. My family thought this was the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cynshear1123"
},
"reviewBody": "Yum! I followed the recipe exactly but for the cooking portion I chose to pan fry in vegetable oil. The outside came out nice and crisp. Going to make more tomorrow but will double the recipe since I have a few cups of beans remaining:"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/241705/chef-johns-falafel/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
"name": "Everyday Cooking"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
"name": "Vegetarian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/241705/chef-johns-falafel/",
"name": "Chef John&#39;s Falafel"
}
}
]
}
}
, "about": [
]
}
]