				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Crab Cakes"
,"datePublished": "2012-04-10T12:23:11.000-04:00"
,"dateModified": "2022-01-13T08:27:00.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "These crispy fried crab cakes are packed with sweet tender crabmeat. Enjoy with lemon wedges or tartar sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9qyQ7ihXop60Mr_ZFkX0Q0Q5778=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/871730-ac87e372f68440219d80dfa6df68e578.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1525096760001",
"description": "See how to make a cakes recipe that really shows off quality crabmeat.",
"duration": "PT3M16S",
"name": "Chef John’s Crab Cakes",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d060711b-ccc1-4545-92c6-03f3353467db/aa3197c3-49ef-4e83-a23c-ff21e8ec81ad/1280x720/match/image.jpg",
"uploadDate": "2021-07-02T22:31:36.817-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Crab Cakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "571"
}
,"cookTime": "PT8M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "297 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "151 mg"
,"fiberContent": "1 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "728 mg"
,"sugarContent": "1 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"8 saltine crackers, finely crushed",
"2 tablespoons mayonnaise",
"0.5 teaspoon Dijon mustard",
"0.5 teaspoon seafood seasoning (such as Old Bay®)",
"0.25 teaspoon Worcestershire sauce",
"1 egg, beaten",
"salt to taste",
"1 pinch cayenne pepper",
"1 pound fresh crabmeat, well drained",
"0.25 cup dry bread crumbs",
"2 tablespoons butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix saltine crackers, mayonnaise, Dijon mustard, seafood seasoning, Worcestershire sauce, egg, salt, and cayenne pepper in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Stir in crabmeat until mixture is combined but still chunky. Cover and refrigerate for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle breadcrumbs on a plate."
} ,{
"@type": "HowToStep"
,"text": "Shape chilled crab mixture into 4 small thick patties; coat completely with bread crumbs."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9qyQ7ihXop60Mr_ZFkX0Q0Q5778=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/871730-ac87e372f68440219d80dfa6df68e578.jpg"
}
]
,"text": "Melt butter in a skillet over medium-heat; cook crab cakes until golden brown, about 4 minutes per side."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT83M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beso"
},
"reviewBody": "I followed this recipe with the exception of using Ritz crackers instead of Saltines. I also don't measure everything (like the mustard and Worcestershire sauce) but simply \"eyeball\" the quantity. I used fresh Dungeness crab, which has the best and sweetest meat in my opinion. While the recipe indicates 4 crab cakes for a pound of crab I found five or six would still provide a healthy sized crab cake. I fried the crab cakes in clarified butter. As Chef John said, these are basically just crab. I did find that chilling the crab cakes prior to frying helped to maintain their shape and keep them together. I served these with Chef John's Tarragon Aioli. Delicious and highly recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WAS A LOT OF TROUBLE BUT WORTH IT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Corey"
},
"reviewBody": "It was delicious and easy to make. I added about 6 large shrimp cut into pieces to add to the crab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zara Ford"
},
"reviewBody": "My family absolutely loved these. They were fantastic. Later, I talked with a man about crab cakes, and I asked him if he was familiar with Chef John's crab cakes. \"No, I just buy them in the frozen food section.\" Ick. Seasoned breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious and so easy to make. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen1000"
},
"reviewBody": "This was great. Everyone loves the taste. I use fresh crab meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karelene Olson"
},
"reviewBody": "Best recipe for crab cakes I've made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rorey"
},
"reviewBody": "This recipe for the crab cakes is absolutely delicious .I have made these cakes twice and making them for the third time today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angela Fletcher"
},
"reviewBody": "As I sit writing this review my dear husband is jumping up and down. He said I hit one out of the park with these crab cakes. I substituted the half a teaspoon of Bichon mustard for a quarter of a teaspoon of hot sauce and a quarter of a teaspoon of yellow mustard. I also put the patties in my freezer for half an hour instead of chilling them for the full hour. We also like heat so I added approximately a quarter of a teaspoon to a half a teaspoon of cayenne pepper. The flavor profile of these is on point. I may add a few extra crackers just because they were a little flakier than I care for. My husband is looking forward to Future crab cake meals!!!! Make them you won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alainamc3"
},
"reviewBody": "I never rate recipes but I had to because it is all sorts of wrong. The end product tasted good but as is the cakes do not stay together. Some bread crumbs should be added to the mix as well as crackers. I increased the old bay by about 3x the amount due to personal preference as well as feeling it lacked taste otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "William Bebout"
},
"reviewBody": "I'm giving it a four because my wife really liked it. I followed the recipe for ingredients but sometimes I don't measure things. It turned out ok. Maybe I am just not a crab cake person. I probably won't make it again unless she requests it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shelley Treherne Chrystal"
},
"reviewBody": "Broil them! Im born and raised in MD . I would add 4 crackers , double the Mayo and all the other ingredients except bread crumbs . I would add a pat of butter on each crab cake and broil until golden brown 😘"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "Delicious.. This recipe is a keeper. agreat recipe by Chef John. I Substituted the Saltines for Ritz crackers as that’s what I had. I didn’t refrigerate for an hour either and the cakes held together perfectly. Also added a dash of old bay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WLee0414"
},
"reviewBody": "Since we live on the water and have access to fresh crab, we decided to try making our own crabcakes. I always try a new recipe verbatim. In this case, completely missed the breadcrumbs in the recipe and I was out. So I just used cracker crumbs. We ended up picking 4 pounds of crab meat, thus quadrupling the recipe. This recipe is simple and so wonderful! Huge hit and enjoyed the time with my husband cooking in the kitchen. Definitely saving this recipe for future guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Woodrum"
},
"reviewBody": "These were perfectly seasoned and simple to make. I used crushed oyster crackers instead of saltines and canned crab meat. Treat them gently while cooking. I might try to add a second egg next time for better binding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Tolley"
},
"reviewBody": "My husband said this is the 2nd best crab cake he's ever had! (The best was made with actual fresh crab, haha). I highly recommend watching Chef John's videos before making any of his recipes. He always explains processes and gives helpful little tips you don't get by just reading the steps. I made 4 cakes, as the recipe instructed, however I think next time I'll make maybe 6 smaller cakes to get them a little crispier. DEFINITELY keeping this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron A"
},
"reviewBody": "Simple recipe and turned out great! Used Ritz instead of saltines and a combo of Ritz and panko for the crust. Crab shined through and couldnt have been better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanL"
},
"reviewBody": "Tried this recipe with lions mane mushroom instead of crab-hand shredded. It was a delicious vegetarian option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TrayD"
},
"reviewBody": "Substituted Fresh Lion's Mane for the crab...the end result was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "The flavor was excellent, but the cakes completely fell apart! My bad, I think it was because I forgot to drain the crab. I used Oceanica crab meat and topped it with a homemade tartar sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LonghornCook"
},
"reviewBody": "This recipe was great!! Crab cakes are my wife's all-time favorite, and she loved these! She said they honestly were better than most restaurant crab cakes she's ever had. Loved the fact that they were meaty and light on extra fillers.\n\nThis was my first time ever making crab cakes. The recipe was very simple to follow, and the results were exactly as expected. I made very minor tweaks to suit our tastes. First, I used a half &amp; half mix of fresh lump crab and claw meat (I prefer the rich sweetness of the claws). In addition, I slightly increased the moist binding ingredients (mayo, Dijon, worstershire), added a few chopped green onions with the tops and doubled the Old Bay spice. I fried cakes in 1½ Tbs olive oil instead of butter. Finally, I added sauce from an AR Mini Crab Cakes recipe on the side (although my wife preferred Chef John's cakes all on their own). Next time, I may try panko crumbs instead of regular bread crumbs. I'm looking forward to making this recipe often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "These are very good basic crab cakes. The only substitution I made was using town house crackers instead of saltines because that is what I had. I also added extra old bay seasoning (about a teaspoon total). I made a basic remoulade sauce to serve with them and I don’t think they would be as good without any sauce. We don’t have fresh crab meat where I live but I bought Boss handpicked crab meat that worked just fine. I would make again but prob make them smaller next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best crab cakes recipe I have ever tried. As another reviewer, I lightly coated hands with bread crumbs when forming patties. I used 1 pound of canned claw meat I bought on sale during Lent. Otherwise I followed recipe exactly and will go in my recipe box for celebration meals! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana"
},
"reviewBody": "Excellent recipe. I made pretty much as directed but added my own little Cajun touches I added 5-6 drops Zatarain’s liquid crab boil to mixture as well as some chopped green onion for extra kick. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DrLeslie"
},
"reviewBody": "These crab cakes are great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Egan"
},
"reviewBody": "I have made these crab cakes three times. I buy four cans of crab meat, which is cheaper than fresh and about as good. I use panko versus bread crumbs. If you mold them and coat them with panko and maybe some fish fry, they keep well in the fridge or even freezer. Really a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Zmolek"
},
"reviewBody": "I made these with some of the crab the hubby caught, and they are delish!! I will be doing this every time he catches enough crab. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Toomey"
},
"reviewBody": "Great recipe! Bought a pound of premium lump crab from my local fish market. Oddly the brand was Chicken of the Sea - who knew they can premium crab? Followed Chef John instructions with no changes. The taste was fantastic. The only thing I would change next time is the size of crab cakes I made. I made 4, next time I will make 6 smaller crab cakes. Thanks for another great recipe Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieQ"
},
"reviewBody": "Really good crab cakes. The only issue I had was I didn't have saltines but I had oyster crackers and didn't know how much to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason H"
},
"reviewBody": "Easy and to the point. Traditional Maryland crab cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Northern Lights"
},
"reviewBody": "Made as directed. They held together which is great! 4mins on med-high was too much for my stove top so they were a little too brown before the flip. Was enjoyed by the family. Paired with a salad for a nice mid-week meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kish!"
},
"reviewBody": "This recipe is DEEEEliscious!!! Since COVID I’ve been getting in the kitchen and I’m really enjoying it! I added fresh green onions and a little bit of fresh lemon juice. These are going to go great with the creamy grits I’m about to make. Wish I knew how to make the remoulade sauce....I’m sure Chef John has a recipe for that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherGG"
},
"reviewBody": "These are easy and delicious! I did add a shallot and I think that worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "I used panko instead of breadcrumbs, which added a nice crunch to the texture. I found it necessary to add one more egg to the recipe in order to mold the crabcakes and not have them fall apart. I would suggest adding the extra egg; otherwise an excellent recipe - the best I have found. I also used Chef John's recipe for remoulade sauce, which went very well with the crabcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tata"
},
"reviewBody": "Best crab cakes I make. Love chef’s Jonh and his recipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DreadedCutie"
},
"reviewBody": "This is an amazing recipe! I'm a Louisiana girl so I had to add the creole spin to it! The old bay was out of stock in all the stores even the seafood market. My sub was creole seasoning and added a half teaspoon of celery seed. I addedsome finely chopped green onion. These were awesome. I served with steamed broccoli, loaded mashed potatoes, and buttermilk biscuits with cheddar and garlic butter. this recipe yielded 7 cakes that were pretty thick and a good size. Great recipe. not complicated either. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Mele"
},
"reviewBody": "It was awesome, exactly as advertised basically a lot of crab with very little filler. We made it per the recipe and I see no reason to change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mossburg"
},
"reviewBody": "I didn’t have any crab on me, so I subsituted it with a tp link archer c7 ac1750 wireless dual band gigabit router. Pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Easy to make, great recipe. Only had half the crab amount so I boiled shrimp in a small amount of old bay. Loved the saltine inside and bread crumbs on the outside. Delicious served with Mae Ploy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "njj"
},
"reviewBody": "They're huge - they fill a hamburger bun! Next time, I'll make them smaller. I followed the recipe exactly, will add a bit more Old Bay and salt. Hubby really like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "These were delicious, no changes to the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Cannon Walker"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda C. DePriest"
},
"reviewBody": "I had only 4oz crab left over and made a single crab cake. I didn’t use saltines; I used extra bread crumbs instead. I also just improvised a created my own Dijon. It turned out amazing! I will be making this again. Absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Squid"
},
"reviewBody": "Simple and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stahrchyld"
},
"reviewBody": "I made this exactly as it's written and it tasted as though I ordered it from a restaurant. Thanks to Chef John I feel like a gourmet cook. When I fried it I coated the patties with panko breadcrumbs. They were amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dunehunter"
},
"reviewBody": "Very easy. Excellent flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Brogden Petre"
},
"reviewBody": "Delish. A definite do-over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DHARK"
},
"reviewBody": "Love this recipe. I add chopped celery just to add a little bit of crunch. I use just enough bread crumbs to give it that crusty layer. I garnish with a chipotle mayo and lemon sauce (homemade). This recipe showcases the fresh caught Dungeness crab that I use for it. You really need to ensure it chills that full hour plus. With very little filler/binder, you need that time to form firm patties for cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarinaT"
},
"reviewBody": "Yum! Made as instructed and came out great! Just needed a little more butter through cooking as they absorbed it on the first side"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Schneider"
},
"reviewBody": "these crab cakes are delicious. i have made them a few times &amp; they always get compliments. you can really taste the crab &amp; the seasonings complement the flavour of the crab"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryellen Conner"
},
"reviewBody": "Excellent. Had 6 oz of dungeness for the 2 of us. Cut everything in half and ended up with 2 good sized cakes. Used panko instead of bread crumbs. Love you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thom"
},
"reviewBody": "They were awesome. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeffJames"
},
"reviewBody": "World class; the best ever, and I'm an old guy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy B"
},
"reviewBody": "Made these for friends and they were a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D4Say"
},
"reviewBody": "Better than some I've had in Maryland!!!! I used panko for the outside and I loved the crunch. I used lump crab meat, would like to try using fake crab meat too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Pippin"
},
"reviewBody": "This was delicious. I usually don’t make changes to a recipe but I like a little crunch so I did add a celery stalk. It worked out! I was afraid it would mess up the form. One of the four fell apart a little but they were all delicious. I did use canned crab meat and soaked it in ice water for 10 minutes prior to use. Will definitely make these again. Easy recipe to impress people with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie"
},
"reviewBody": "Fantastic, and I doubled it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert C Dickerson"
},
"reviewBody": "Simple and delicious. After picking through a bushel of Maryland crabs we had exactly 1 pound of crab left over. This was the perfect recipe for 4 nice size crab cakes. I used pre-seasoned panco instead of bread crumbs...made them a little to salty...stick with plain bread crumbs and let the crab shine through!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I thought it was great. I used 6 cans of crabmeat or 18 oz. You must drain as much liquid out of the can because it gets soupy. I used 18 Townhouse buttery cookies to soak up the liquid and added a little more Worchester sauce and mustard. \n\nIt broke apart in the pan, I need to work on it, but the flavor was perfect.....yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mister"
},
"reviewBody": "These are amazing and so easy! I made them for Father's Day and he wanted them again today, just three days later! I used fresh \"lump\" crabmeat and followed the instructions except used Progresso Garlic Herb dry bread crumbs. So good, highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi Johnson"
},
"reviewBody": "This recipe is great - I think I'll add a little more binder next time as they fell apart when frying. Maybe a pinch more old bay also - otherwise, very meaty and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Witch Whisk"
},
"reviewBody": "Delicious! At first I was worried because it didn't seem like enough breadcrumb but when I took the first bite it was chock full of crabby deliciousness! Perfect texture.\n\nThe only thing I changed is I added way more Old Bay bc I'm a freak. Next time I might add some lemon juice or zest to brighten it up a tad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon"
},
"reviewBody": "These crab cakes turned out delicious. The crab not the filling was the star. They did not quite hold together completely but tasted great anyway. I will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DragonFryer"
},
"reviewBody": "everyone said they are awesome and go great with honey mustard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Vic"
},
"reviewBody": "Chef John’s Crab cakes are excellent! I added 1 TBSP Old Bay, used 12 Ritz crackers, and no salt or breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachie LaughingMonkey"
},
"reviewBody": "Not a thing was changed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "I made this recipe with imitation crab meat bcuz it was my first time and I wanted to see how it turned out. It’s a easy n delicious recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bebe"
},
"reviewBody": "Really like this crab cake recipe. Substituted club crackers for the saltines and panko for the bread crumbs. Also added chopped green onion to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GrandmaDonna"
},
"reviewBody": "Delicious! But I suggest the recipe makes 6-8 patties instead of 4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobby Sanford"
},
"reviewBody": "These are delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Reter"
},
"reviewBody": "Simple, quick and delicious. I’m a fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busymom"
},
"reviewBody": "This was my first time making my own crab cakes and I must say this recipe was absolutely delicious!!! I can actually say these were better then ones I have had when eating out. Thank you Chef John for another fantastic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Larsen Santora"
},
"reviewBody": "I used a little more obay and was just great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "The crab cakes were quick to make and delicious. Mine were great Hopefully I will be able to catch my own crabs this summer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smcdonnell1"
},
"reviewBody": "This recipe cannot be beat! I highly recommend trying it. I will be using this recipe for the rest of my life. Thank you so very much for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DFBROWN"
},
"reviewBody": "Lots of flavor! Didn't have Cheyenne pepper, so I substituted with smoked paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Meier"
},
"reviewBody": "I made these last night! Amazing! I have never made crab cakes before because I thought it would be too hard. After a few additional Ingredients to make it mine, they came out WAY better than expected. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzi Hopkins"
},
"reviewBody": "I need to make again before I rate it. I was out of green onion and use onion powder. It was very salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker Dave"
},
"reviewBody": "Excellent like all of cheff Johns recipes. I always read his and usually save them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olympia Harris"
},
"reviewBody": "I was drawn to this recipe by reviews, along with the limited ingredient list. This is the first time I’ve made crab cakes and I will definitely make this recipe again. I didn’t have breadcrumbs so I used crushed Ritz crackers. I also added the optional cayenne. It was served with spicy mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "P. Felix"
},
"reviewBody": "Fantastic crab cake recipe, the family loves it and it’s the best crab cakes I’ve ever eaten!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Kightlinger"
},
"reviewBody": "Made this twice with left over king crab legs. One hack that helped to keep them together during the crumbing was using a slider patty ring (or open top biscuit cutter) and parchment. I would put the ring on the parchment square, sprinkle crumbs in it, add crab cake mix, press down and add crab cakes to top. When you flip it into the pan, you have more control."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K"
},
"reviewBody": "I made this the first time . 01/22/2020 I made them exactly by the recipe! They are be best crab cakes that I have ever eaten! I also used a small amount of store bought remoulade sauce. Wow were they great. I have made it many times since but used 8 ritz crackers because that what I had. And still, Wow they are great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosalba Saunders"
},
"reviewBody": "Very good to excellent. Ingredients not spicy at all but let the crab flavor come forth. Loved the panko crumbs on each side to let them get crispy. From one lb. crabmeat I got 6 crab cakes and cooked 5 mins on a side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackiec"
},
"reviewBody": "I live in Ohio, it’s pretty hard to get good crab cakes, even at high end restaurants. Now I don’t have to look, I can make the perfect crab cakes at home! Thanks chef john"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Hollon"
},
"reviewBody": "This recipe makes a delicious crab cake. However, I added about a teaspoon of very finely chopped green pepper and a couple tablespoons of grated parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy R"
},
"reviewBody": "Great taste. I only had canned crab and fresh would have been much better. I also should have drained it better. I dipped in Panko before frying. Cakes stuck together after cooking at high heat.p but fell apart initially. Served with Alfredo pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nickey1016"
},
"reviewBody": "Best EVER!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Musicmann1022"
},
"reviewBody": "My Dad used to make this recipe with fresh picked crab meat. They cakes were excellent in a steel fry pan with butter and oil mixed. No burning when frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Teachey"
},
"reviewBody": "Crab meat with all crab no filler basically. Delicious. Restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "victoriann"
},
"reviewBody": "Great recipe! Considering you don't add much to this recipe, it was filling and delicious. I lightly breaded them and still got the nice crispy outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorrie Young"
},
"reviewBody": "PERFECT! I followed the recipe exactly and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Burke"
},
"reviewBody": "unbelievable really good best i ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Amazing! Maybe I haven't used fresh crab in my prior efforts, but this was amazing. I didn't change a thing, except adjusted to 2 servings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Calloway"
},
"reviewBody": "Turned out great! Followed directions since first time trying to make crab cakes and they are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kenni Peck"
},
"reviewBody": "The flavor is good and the recipe is easy, but my cakes would not stay together for the life of me. Probably user error. On the other hand, frying up the crab mixture as a hash until crispy and serving over salad with lemon juice was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Wear"
},
"reviewBody": "Perfect. My only change was using low sodium bay seasoning, not adding salt, no cayenne and I held the cakes in my hand and sprinkled the with the breadcrumb instead of patting on the plate. They held together that way. . My husband loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katburt"
},
"reviewBody": "These are the best crab cakes you will ever eat!! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Hyland"
},
"reviewBody": "This recipe is amazing. We live in the Midwest where it’s not easy to buy crab and I love crab cakes. I had leftover baked haddock and used it in place of the crab. They were incredible. Followed the recipe exactly other than the fish. Will definitely make again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/221079/chef-johns-crab-cakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1238/appetizers-and-snacks/seafood/crab/",
"name": "Crab"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1240/appetizers-and-snacks/seafood/crab/crab-cakes/",
"name": "Crab Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/221079/chef-johns-crab-cakes/",
"name": "Chef John&#39;s Crab Cakes"
}
}
]
}
}
, "about": [
]
}
]