				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Cheesy Crackers"
,"datePublished": "2013-10-22T18:40:24.000-04:00"
,"dateModified": "2022-11-10T21:55:04.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Make your own cheese crackers at home and enjoy their fresh, satisfying crunch on salads, in soup, or just as a snack."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/S9vGurhtWuW3EHfzJ2n8jFhS0tc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7429552-chef-johns-cheesy-crackers-Kris-Miller-1x1-1-cad64035c51941afb935eec7ff61b097.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2737854677001",
"description": "See how to make delicious homemade cheesy crackers.",
"duration": "PT6M49S",
"name": "Chef John's Cheesy Crackers",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/3bfca8ee-8f07-4a29-8f0d-face52a3a773/9009142d-9c48-499d-b4a1-93f1adbab13b/1280x720/match/image.jpg",
"uploadDate": "2021-07-20T02:49:53.514-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Cheesy Crackers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "151"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "25 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "44 mg"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.5 teaspoon vegetable oil",
"2 tablespoons unsalted butter at room temperature",
"0.75 cup lightly packed shredded sharp Cheddar cheese",
"0.33333334326744 cup lightly packed freshly shredded Parmesan cheese",
"0.5 teaspoon paprika",
"1 pinch cayenne pepper, or to taste",
"0.25 teaspoon salt",
"0.5 cup all-purpose flour",
"1 tablespoon cold water, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Line a baking sheet with aluminum foil and lightly grease with vegetable oil."
} ,{
"@type": "HowToStep"
,"text": "Place butter into a mixing bowl; add Cheddar cheese, Parmesan cheese, paprika, cayenne pepper, and salt. Mix together with the back of a spatula until thoroughly combined."
} ,{
"@type": "HowToStep"
,"text": "Mix flour into cheese mixture with a fork until crumbly. Sprinkle in cold water, 1 or 2 drops at a time, and mix with spatula until it comes together in a dough that holds its shape when squeezed."
} ,{
"@type": "HowToStep"
,"text": "Transfer dough to a work surface and press into a thick, flattened disk. Wrap in plastic wrap and refrigerate 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll dough out on a floured work surface to about 1/8-inch thick. Use a pizza cutter to cut 1-inch wide strips from the dough. Cut strips crosswise into rectangles about 1 1/2-inches long. Use the back of a bamboo skewer to punch 5 small holes into each cracker. Arrange crackers onto prepared baking sheet."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/S9vGurhtWuW3EHfzJ2n8jFhS0tc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7429552-chef-johns-cheesy-crackers-Kris-Miller-1x1-1-cad64035c51941afb935eec7ff61b097.jpg"
}
]
,"text": "Bake in the preheated oven until crackers are browned and crisp, about 15 minutes. Let stand about 3 minutes for crackers to cool and release from the foil. Let cool completely before serving."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tires"
},
"reviewBody": "Family loves these! I have feeling there will be a lot of experimenting with this recipe flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I can't count the amount of times I made these crackers for my family. They kept begging me for it! They love everything crispy and this definitely satisfied that craving. Just a word of caution: I tried tripling the ingredients as a shortcut to save time and to make a large quantity of crackers and they turned out soft,pillowy and bland despite being adequately cooled. Doubling the recipe still gave me crispy crackers. But don't triple it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erfrongillo"
},
"reviewBody": "This recipe is absolutely baller!! I did make a few changes. I used King Arthur’s Measure for Measure gluten free flour. I used only Cabot’s “Wickedly Habanero” cheddar cheese, so I omitted the cayenne (the habanero was spicy enough on its own). I also omitted the vegetable oil, because I was baking these in my air fryer. My air fryer is an unmanageable BEAST and burns everything, so each batch was only in there at 370° for 4 minutes. They came out puffy, crispy-crunchy, flaky, and the flavor was salty and incredible!! Downsides, they are indeed a little greasy, even despite the air fryer method. That could have been my chosen cheese? I don’t know. Also, refrigerating the dough first was the wrong way to go, at least for mine; the cold was unnecessary, as it made my doughball way too stiff and unmanageable to roll out (it cracked, etc). If I’d done it while the dough was room temperature right after mixing it with the water, it miiight have stuck to my rolling pin a LITTLE, but it overall would have been much easier. I think that’s on me too though, because I’m a cook, not a baker, and I never really know WTF I am doing with dough enough to follow my own instincts. Anyway, I can’t wait to make this recipe again, keep tweaking, and customize with all kinds of flavors, maybe throw in some herbs, too. I just love this as a cheesy cracker base recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Triezenberg"
},
"reviewBody": "If I could give this recipe 10 stars, I would. I made these on a whim, but they turned out to be some of the best things I've ever tasted (my husband concurs), and that's a fairly high bar, as I've prepared quite a few of Chef John's recipes. I did substitute Sriracha seasoning for the cayenne and smoked paprika, but the biggest surprise was what happened when I ran out of room on my baking sheet. Rather than prepare a separate batch in the oven, I decided to try the overflow crackers in the air fryer. Not only were they done in considerably less time than the oven batch, but they were the clear winners in terms of taste and texture. This recipe was a bit fussy in terms of cutting and docking the crackers (the little buggers were jumping all over the place), but they were so tasty that I'll be making them regularly in the coming weeks, absolutely in the air fryer. I have some buffalo ranch seasoning that I'd like to try next, along with some nacho cheese flavoring for another batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "So yummy Didn’t change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck Rodgers"
},
"reviewBody": "My wife and I both love these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I changed this up after realizing there’s no possible way this works in a mixing bowl with a fork to have them look like the photo. \n\nI used a food processor for everything and this incorporated the cheese well. I added cayenne, garlic, onion powder, parsley, and turmeric for extra color, I doubled the spice or they would be very bland. Added water in the top of the food processor until the mix was like cornmeal. \n\nI also baked at 370 on a higher rack and added a 1/4 teaspoon of baking powder. Very lightly sprinkle with coarse sea salt before baking. \n\nBut the Parmesan and sharp cheddar is a good combo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babette Russell"
},
"reviewBody": "I made these for Passover. We loved these crackers. I used Colby Jack because I had it already grated. They were easy, crispy &amp; extremely tasty! Thank you again Chef John. I have tried several of your recipes &amp; have enjoyed each one immensely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Love these! I followed the recipe except for the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Benner"
},
"reviewBody": "These turned out with a fantastic flavor. The hint of spice at the end is nice. Make sure you roll them as thin as they say. Mine were a little thick but still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Motto"
},
"reviewBody": "Great recipe! We made a couple changes after reading some of the reviews. We added a half teaspoon of turmeric for color and a half teaspoon onion powder, half teaspoon mustard and smoked paprika instead of regular paprika for flavor along with sprinkling salt on top. We lowered the oven temp to 350 and baked for 17 minutes to get them more crispy. They are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Followed the recipe exactly and they were really good. I thought the dough was going to be too dry, but not so. I will make again. They cooked in 10 minutes, so watch closely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mantequillas"
},
"reviewBody": "I thought this was very good and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sum Dai"
},
"reviewBody": "oily, like other said. Not bad for home-made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrownSugar"
},
"reviewBody": "I really love this recipe, it's easy, delicious, and customizable. I once added chopped up roasted peppers that came out amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eparkhurst"
},
"reviewBody": "Love this recipe! I add turmeric for color and flavor, and a little more cayenne to make them good and spicy. Better than the real thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "I made these crackers just now. OMG I could eat the whole batch. I made them with dry white cheddar powdered cheese (it's what I had at home)and finely shredded aged asiago cheese (BelGioso aged asiago). They were great. I think I'm going to try making them next with brown butter and possibly air fry? Obviously you can use any type or combination of cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miguel Arguelles"
},
"reviewBody": "I think I added too much water the first time to get the batter stickier, which ended up making for some rather soft crackers. For the next batch, I stuck firmly to the recommended one tablespoon of water and the texture came out perfectly.\n\nThe paprika and cayenne doesn't seem to add much, but it might just be an issue with mine having weaker strength than those in the video. I can see how easily I can swap out spices in the future. Tried fresh oregano and it didn't add much; will try dried next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucinda A. CindyRowe Bentley"
},
"reviewBody": "loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DaniG"
},
"reviewBody": "I’ve made these several times. My family loves them..These are very easy to make. I had to adjust the baking time a little longer, by 5 minutes, and they came out perfect. I can’t make a single batch anymore as the are gone too soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bookaholic20"
},
"reviewBody": "People leaving a bad review must have cut corners or otherwise messed up this super simple recipe. These are super good and very easy if you are able to follow a simple recipe. Can't wait to make changes like adding bacon or other flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wintersunshine"
},
"reviewBody": "Ok, update. I have made this 3 times now, and the third time was the charm. Some keys to success: measure all ingredients carefully (except you can add more or less paprika without harm). It took quite a bit more cold water than stated to form a cohesive ball to roll out. The rolling thickness is critical, not too thin, not too thick. I baked mine at 400-425 for about 10 min. Keep an eye on em as they bake so as to achieve your desired doneness. I like mine extra toasty so I put em under the broiler for about 2 minutes to finish up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "theowl"
},
"reviewBody": "These were great! They tasted amazing, but they did not really turn out like crackers. Despite that, I recommend these and will be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "Easy to make, and a great cheese flavor! I baked them on a silicone mat and put them on paper towels when they were baked, to absorb some of the oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TerriK"
},
"reviewBody": "I didn't have rice crispies the first time I made these, so I subbed in dried bread crumbs. Worked fine and gave it a more nutty flavor. Either way is very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Stone"
},
"reviewBody": "They came out perfect and my son loves them :D thank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aidancooks"
},
"reviewBody": "Yum!! I used all cheddar because I only have powdered Parmesan and also added 1 t each of poppyseeds and sesame seeds. Didn’t have a skewer or a toothpick so I poked them twice with a fork. Mine were done in more like 11-12 minutes. I baked on a silicone mat and didn’t use any oil, so I had no problem with oiliness like others mentioned. They also didn’t stick at all and are crispy! Will be making these all the time. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pj Packet"
},
"reviewBody": "Delicious. Chef John's recipes never disappoint. Cheesy and crunchy. After making this John's way, I adapted it with almond flour to make keto crackers. Just as good and I have made it that way several times since."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodney Keith Bone"
},
"reviewBody": "Very good. I’m gonna change up the cheese and maybe spice them up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolle"
},
"reviewBody": "I made these for a fund raiser sale. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharirus"
},
"reviewBody": "Unbelievably good ! I am over 50 and have never knew or even heard about making your own crackers...I will never again buy boxed crackers...with this recipe I can make any flavor or shape of crackers I need. My family loved them and my friends are going to scream when they try my next batch. To save time I rolled the dough out and cut them into shapes and put them in the fridge till I was ready to cook them. I think it might have made them a little flakier than rolling them out again after refrigerating the whole lump of dough and having your hands warm up the dough when shaping the individual crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flakybabe"
},
"reviewBody": "These are fantastic!! I first made them as written. And I felt that no changes were needed. However, I am experimenting with different cheeses and spices and am having a lot of fun with it. My family is very pleased!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FERBSTOESSER"
},
"reviewBody": "I just made these. They are incredible. I used all Cabot extra sharp white cheddar as it’s all I had. Made it 60 servings and semi followed it. Used 1 cup of flour, about 4 tbsp of butter. Didn’t refrigerate at all. Made two big half sheet pans of crackers, enough for snacks for the next week or so. So glad I tried these! I will definitely make these regularly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neil Lawson"
},
"reviewBody": "Easy and delicious. Freeze butter and grate it, and use a tiny bit less flour than suggested. Bake slightly longer than you think, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FabinKitchen"
},
"reviewBody": "I added my favorite spices, garlic, dill weed, powdered onion and red pepper flakes. I tried for a \"very spicy\" cracker so I wouldn't eat them all at once. Thank you so much, Chef John! They were even good the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "Pretty good recipe. Per some other reviews I substituted 2 tbsp baking powder for 2 tbsp of flour, added some basil, garlic powder, and turmeric to the batter and deleted the salt due dietary restrictions. (I did dust the crackers with a little salt before baking. ) the dough was very dry and I ended up adding 4 to 5 tbsp water. I mixed everything in my stand mixer. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RiverStone"
},
"reviewBody": "Follows receipe as written and cooked 17 minutes. Perfect zest and texture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Hollon"
},
"reviewBody": "Made no changes....came out yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Ellen Wright"
},
"reviewBody": "Love these crackers, very easy! Sometimes I use hot sauce instead of water, sometimes white pepper instead of cayenne. I love that they’ll all bake together in 12-15 minutes even when I’m all over the place on the thicknesses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pchafen"
},
"reviewBody": "Excellent! Only change was that I added 1/4 tsp baking powder as advised by another reviewer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dat1guy"
},
"reviewBody": "These were really tasty. For a first try, I thought they turned out pretty well. Next time I make them (it won't be long) I will try to roll them out just a little thinner and/or cook them a bit longer. They were fairly crisp when they cooled, but after packing them in a tupperware container, they have softened a bit. Still great flavor though. I used a bit more cayenne than called for I think, because they pack a punch (and I like it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robin Manning"
},
"reviewBody": "simple to make but not enough cheese flavor. I used Colby jack. 15 minutes in oven was also t long for my oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ricfera"
},
"reviewBody": "I made it without oil, without parmesan, a little more water, and a little less butter. I really liked it. These are way better than commercial brands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anjali Chopra"
},
"reviewBody": "It tasted a bit bitter and was not as great as I thought it would be. It was a lot of work as well. It was a very fun thing to make and everything cooked properly. This is a good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lin"
},
"reviewBody": "Great fast easy cracker Chef John!\nTillamook sharp cheddar cheese worked wonderful in these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "InukHash"
},
"reviewBody": "I didnt have butter, cheddar or cayenne. Used instead marjarine, mozarella and chile powder. I had never baked crackers. ever. Tried to be positive throughout. I was pleasantly surprised when they cooled!! I will be baking them again with butter, cheddar and if any cayenne is available at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shuhak"
},
"reviewBody": "Really good! I used swiss cheese instead of parmesan cheese and I used salted butter instead of adding salt. I'll definitely make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "desirejadeh"
},
"reviewBody": "Feel free to experiment with different cheeses. I did gouda and parm. Have done blue cheese. Sharp cheddar. Pepperjack. All are awesome. Couldnt tell you how long they keep because they finish within 24 hours. Great party snack. Careful when shaping if you care about the neatness of the final look but mishappen or not they are yummy. Quick and easy prep. Almost fail proof."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Gulley"
},
"reviewBody": "I changed the recipe a little, left out the oil and cayenne pepper then added garlic and herb seasoning and a little extra cheese, I also swapped the regular paprika for smoked paprika. I loved them!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Christmas-Cabana"
},
"reviewBody": "mmmm easy and very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "samwooly"
},
"reviewBody": "This was my first time making any kind of cracker. I followed all ingredients and instructions and they came out great! I’d like to try this recipe using other cheeses. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jack"
},
"reviewBody": "I love cheese crackers , I doubled it and made some changes in that I use cold butter cubed and used a food processor and pulsed extra sharp white Cheddar and 50 grams grated parm and butter till coarse crumb . I added 1/2 tea of baking powder and blended with flour and spices , processed till fine about 20 seconds then drizzled in cold water till it clumps. remove dough and flatten out into a square and add 1 Tlbs sesame seed evenly and fold over four times and reshaped into disc and chilled 20 min and baked on lightly butter parchment . perfectly delicious ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Gromek"
},
"reviewBody": "Perfect! Crisp, cheesy, delicious perfection. 10 minutes was the perfect length of time but I rolled them pretty thin. Oh, the possibilities. And yes! I did it exactly like the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bettyjean"
},
"reviewBody": "Excellent! Really rich and cheesy. I made 2 changes in procedure, not ingredients: I had hard butter so after adding it to the cheddar I put it in the microwave on half power for 20 seconds. Made combining them very easy. Also, I rolled the dough into logs and next day sliced them into rounds. No rolling out and cutting. Will make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Davis"
},
"reviewBody": "Loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1966Debjms"
},
"reviewBody": "I’ve made these several times now. Puffy, cheesy, crispy, delicious. SOOOO much better than store bought. I’ve stuck to the directions exactly...just watched them in the oven between 12-15 minutes so I can take them out at th perfect moment. So quick &amp; easy. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brianco"
},
"reviewBody": "So good. Followed the recipe pretty close using medium cheddar and a little extra cayenne. Mine took 16 minutes on the nose for a perfect cook at high elevation. My only gripe is I should have doubled or tripled the recipe like it suggests at the bottom of the page if you are serving multiple people. I usually use a pasta roller on thick to roll crackers, but this dough is easily workable. I still tried, but was easier just to do by hand with this dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Marian"
},
"reviewBody": "I made these a few minutes and they turned out to be awesome. I followed the exact recipe with no adjustments. My kids thoroughly enjoyed these cheese crackers. This recipe is a keeper for life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "Sooo good! I am making these all the time. Can't wait to try some other cheeses!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joblessmonkey"
},
"reviewBody": "I loved it but for the seasonings I added some basil just to add some additional flavor everybody loved it and i plan on making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candi B"
},
"reviewBody": "Perfect cheese cracker. Followed recipe with no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marty"
},
"reviewBody": "Flavor was good - however, they were hard to roll out and therefore, were too thick. There are better recipes for cheese crackers - try the one using rice krispies.............much better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenny1103"
},
"reviewBody": "Very good! Even better after Thru were in he refrigerator for a day :-)) yummm , prob is u can t eat just one !! \nThank u Chef John. 3 ed recipe of yours I have made. Love them!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SUSANWHITE"
},
"reviewBody": "I doubled the recipe as one recipe only makes a small amount"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue Carver"
},
"reviewBody": "I made the recipe exactly as written. However, when I started rolling it out it was crumbly and fell apart. But, they still turned out very tasty, which was a relief!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Joy "
},
"reviewBody": "This was an awesome recipe! I made them for no reason except that I was bored. I have to admit mixing the butter and cheese was pretty hard. It took me like seven minutes to mix it and it still wasn't completely mixed. I loved the flavor though! It kinda tasted like a mix of a cheese bread and cheese its. My sister hates the cheese bread but loved these crackers! It took a long time to poke all of them with a toothpick but it was over all a great recipe! \n\nUPDATE: I made these again but this time I doubled the recipe (because last time they were gone by the next day) and I sprinkled a tiny bit of cheese on top! It was great!! It made some of then hollow! \n~K"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "Great crackers. Baked mine on parchment omitting the oil and they are not greasy at all. Also added a T. of sesame seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These crackers are yummy! They taste just like CheezIt crackers, but even better and way healthier. I used a Silpat mat to line the cookie sheet (or you could use parchment paper) instead of oiling the pan. I cooked them until they were a little brown and it gives the cheese an extra toasted flavor. These are great to have around as a healthy snack. I just keep them in a Mason jar in the fridge and they're ready anytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkirchenbauer"
},
"reviewBody": "These crackers are yummy! They taste just like CheezIt crackers, but even better and way healthier. I used a Silpat mat to line the cookie sheet (or you could use parchment paper) instead of oiling the pan. I cooked them until they were a little brown and it gives the cheese an extra toasted flavor. These are great to have around as a healthy snack. I just keep them in a Mason jar in the fridge and they're ready anytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaretrer"
},
"reviewBody": "Love this recipe! I even doubled it and they turned out great. Be sure to use a skewer to pierce the tops. One batch I just forked and they weren't cooked right through. I found this to be a very forgiving recipe. It works no matter if you add too much or too little of any ingredient."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bena"
},
"reviewBody": "I have made this recipe 3 times now and they are absolutely delicious. I have used different cheeses. I cheated and bought grated cheese, sharp cheddar and an Italian five cheese mix. I plan to experiment with other cheese. Maybe even some different spices. How can you go wrong with cheese?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie C. Harding"
},
"reviewBody": "Just made these and I love them! I never knew how easy it was to make crackers and using natural ingredients, too! My crackers puffed a bit, not as much as Chef John's, but there was still that nice crunch to them (I wasn't sure if they were done after 15 mins, so I left them in the over for another minute). My oldest son doesn't like the commercial Goldfish crackers, but he ate these like candy! Next time, I'll have to make a double, or even triple, batch! Thanks Chef John for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marie"
},
"reviewBody": "I had someone close their eyes and have one of these and they came up with the name we all buy in the store. These are awesome and so so easy to make!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMK"
},
"reviewBody": "Very tasty! Easy to make, smells incredible, my husband and I ate the whole batch in one evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tfw64"
},
"reviewBody": "I just made Chef John's cheese crackers and did it with a couple martini's in me. I added a little more cayenne and a touch or rosemary. I can't imagine how this recipe doesn't work perfectly for anyone. It is the best. I am going to triple this recipe to take to work tomorrow. Unbelievably good. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MFizzlebottom"
},
"reviewBody": "Followed the recipe exactly as written and they were amazing. Crispy, cheesy and delicious. My kids who are devout cheese nip eaters now prefer these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "These were simple to make that my 4 year old helped me and he loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparky595"
},
"reviewBody": "I love cheese-its. When I saw this recipe I had to try it. It turned out fantastic! Only addition was a shake of celery salt. Cooking time was spot-on. I re-rolled the scraps twice and had nearly 100% use of the dough. Mixed in a drop of water before re-rolling. Definitely will make these again. Going to try a few alterations as suggested by others. Thanks so much for a top notch snack so easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michaela Mahony"
},
"reviewBody": "yummy but so greasy (my be due to the type of cheese i used).\nMine were brown, if not over cooked, at 12 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Sargent"
},
"reviewBody": "Delicious! I just added a little bit more water than a tbsp (maybe 2 tsp) to make the dough a little more manageable. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PITA"
},
"reviewBody": "I followed this recipe to a T, only doubling it. I like spicy so I was liberal with the cayenne, but kept in mind the grand kids do not (since I was doing it for them), so kept it at a happy medium and, frankly, I couldn't even taste spicy, just flavor. The only change I made was that after I rolled and cut them into individual pieces, it occurred to me that I did not double the salt in the recipe AND remembering Cheese Nibs had a bit of salt on the top of the cracker. Therefore, while in dough form, I lightly sprinkled sea salt over the tops and lightly pressed the salt into the dough. These came out EXACTLY tasting like the store bought version but so much healthier. Mine were a bit thick, but it didn't seem to hurt the flavor of the finished product. The only thing I will do differently next time is try to roll out the dough into a cookie sheet so it is more rectangular all the way around and I get more good looking cracker shapes out of every bit of dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bnlutjen"
},
"reviewBody": "Great recipe! Made it with my Grandaughter for movie night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennyg92"
},
"reviewBody": "Really good recipe! Easy and I had all the ingredients on hand. I omitted the parmasean because I was out, and added onion powder. My baby loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tksaisho"
},
"reviewBody": "These are very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aida Bardekjian"
},
"reviewBody": "I did not make any changes to this recipe. These crackers were so delicious, the only problem was they were addictive....I will definitely make them again. Thank you , as always."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenni22"
},
"reviewBody": "These crackers are easy to make and taste good. From the ingredients, you can tell they're going to be greasy, and they are (especially compared to other crackers I've made) When hot, I put them right on a paper towel covered plate and it got full of grease. They basically taste like toasted cheese. They weren't a big hit with the kids, so I probably won't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kk"
},
"reviewBody": "Oh my these are good. Only thing different I did was put in a little Asiago in place of some cheap old cheddar that I had to use. I thought it might boost the cheese quality a bit. I can't wait for my husband to get home from work to try them. They are like Cheese Nips on steroids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I really liked the flavor of these. However, I am not sure why but my crackers turned out semi-soft and super chewy. I followed the recipe exactly only leaving out the cayenne. I liked that this did not make too much. I got about 45 crackers. I made some squares and some mini animals one. They did puff up quite a bit, but the kids ones I made did hold their shape and print which I liked. I cooked them until suggested, so not sure the issue with the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrAMsMom"
},
"reviewBody": "All I can say is \"Woah Momma!!\" Delicious!!! Will be making them again. My 3 yr old is super picky with food or snacks, this recipe got his approval! -- Omit the Cayenne pepper, or not, is up to you! Process was simple! First time making crackers and they were a success! We added a bit of garlic powder! Yummy! --- Thank you for the recipe. -- By the way, to those complaining about \"greasiness\" use parchment paper! And cool the dough before as told if you want to be able to cut them in shape! Just do what the recipe says! - Will recommend to my friends!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mocooket98"
},
"reviewBody": "These crackers turned out great!!!\nWill be making a lot of these for get togethers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "Chef John this recipe Is THE BOMB!!! Incredible!! These crackers are Sooooo Flavorful...They honestly do taste like a true cheez it! This recipe is very forgiving also! I added a bit more cheese and never chilled my dough and they still turned out PERFECTLY crispy and Sooooooo Delicious!! I will make these Alot!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LO"
},
"reviewBody": "Love love love these crackers, made the recipe as is and they were gone in a day. Can't wait to try it with different cheeses. I think I will try feta cheese next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily"
},
"reviewBody": "Amazing! They're simply the best. I recommend following the directions in the video, since he shows you what the texture of the dough should be in each stage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "This was a very easy recipe to do and it taste just like store bought cheese crackers. Well use this over and over"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimandDennis Bemis"
},
"reviewBody": "Made these today and they are delicious but I learned a few things along the way. 1. Make sure your cheese is a warm as the butter, cold cheese is harder to work with than cold butter. 2. Do not re-roll the scraps, makes them tough and chewy, if you're making these for guests just nibble on the uneven ones. 3. Don't bother wasting your time docking them with a skewer five times just poke them twice with the times of a fork, 4. Use your hands to mix the dough, at least for the last few minutes. 5. They're easier to dock if they stay sitting next to each other before putting them on the baking sheet. 6. Do use foil but just spray it with non-stick spray instead of wiping oil all over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine"
},
"reviewBody": "These were amazing. So easy so make, quick and better than the store-bought ones. Next time I will substitute water for hot sauce, to make them spicy! I might try to substitue butter for coconut oil, to see if it could also work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luting k (lukab)"
},
"reviewBody": "I have made these crackers so many times after watching Chef John's video. Every time they still gone in minutes! But now I cut the ingredients down to 5 and skip few steps, still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "melymel"
},
"reviewBody": "Tasted just like cheez-its. Not a fan of cheez-its lol. I suppose I was expecting a better taste. You are definitely better off getting the branded crackers instead, in my opinion. Will need to look for a new cracker recipe. :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/235172/chef-johns-cheesy-crackers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
"name": "Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1659/appetizers-and-snacks/snacks/kids/",
"name": "Kids"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/235172/chef-johns-cheesy-crackers/",
"name": "Chef John&#39;s Cheesy Crackers"
}
}
]
}
}
, "about": [
]
}
]