				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Pasta Primavera"
,"datePublished": "2014-01-13T17:19:10.000-05:00"
,"dateModified": "2019-04-02T03:02:36.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Pasta primavera is a straightforward recipe; fettuccine tossed with an array of fresh spring vegetables. When done right, this is one of the year&#39;s great seasonal recipes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5CL4SA02cIu2k6O2aB1jjvNiSuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1104151-552577daf8404b8b9b7e124dd41c160a.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2579416683001",
"description": "See how to make a delicious spring vegetable pasta.",
"duration": "PT5M3S",
"name": "How to Make Pasta Primavera",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/b6093029-3a55-416b-8714-bb4813ef9f1f/e563c48a-9a9f-4545-a8e3-9d012711c067/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T01:37:07.596-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Pasta Primavera"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "198"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "590 kcal"
,"carbohydrateContent": "73 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "8 g"
,"proteinContent": "19 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "607 mg"
,"sugarContent": "8 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 bunch fresh basil",
"3 cups chicken broth, divided",
"0.5 cup olive oil",
"2 cloves garlic",
"1 pound fettuccine pasta",
"2 tablespoons olive oil",
"1 large leek, white and light green parts only, chopped",
"1 bunch green onions, chopped",
"2 jalapeno peppers, seeded and diced",
"2 pinches salt",
"2 zucchinis, diced",
"1 cup chopped sugar snap peas",
"0.5 cup shelled English peas",
"1 bunch asparagus, stalks diced, tips left whole",
"0.5 cup grated Parmesan cheese, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rolling boil. Hold basil bunch by the stems and dip basil leaves in boiling water until bright green, about 2 seconds. Immediately immerse basil in ice water for several minutes until cold to stop the cooking process. Once the basil is cold, drain well. Remove basil leaves from stems and discard stems."
} ,{
"@type": "HowToStep"
,"text": "Blend basil leaves, 1 cup chicken broth, 1/2 cup olive oil, and garlic together in a blender until smooth."
} ,{
"@type": "HowToStep"
,"text": "Stir fettuccine into the same pot of boiling water, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Heat remaining 2 tablespoons olive oil in a large saucepan over medium heat. Cook and stir leek and green onion in hot oil until softened, about 5 minutes. Add jalapeno and salt; cook and stir until jalapeno is soft, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Increase heat to medium-high. Stir 2 cups chicken broth, zucchini, sugar snap peas, and English peas into jalapeno mixture; bring to a simmer and cook for 5 minutes. Add asparagus and continue cooking until asparagus is soft, about 3 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Pour 1/4 cup basil-garlic mixture into zucchini mixture and cook and stir until heated through, about 1 minute. Remove from heat."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5CL4SA02cIu2k6O2aB1jjvNiSuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1104151-552577daf8404b8b9b7e124dd41c160a.jpg"
}
]
,"text": "Place pasta in a large bowl; pour zucchini mixture over pasta and pour remaining basil-garlic mixture over the zucchini mixture. Spread Parmesan cheese over the top. Toss mixture briefly to combine and tightly wrap bowl with aluminum foil. Let stand until pasta and vegetables soak up most of the juices and oil, about 5 minutes. Toss again."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carola Spurlock"
},
"reviewBody": "I used 2T dried basil instead of fresh, and omitted the jalapenos &amp; sugar snap peas. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kamrkamr"
},
"reviewBody": "Added additional basil and skipped the zucchini. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It’s alright. Doesn’t taste bad, but it also doesn’t taste like much. It’s quite bland to be honest. It needs something to bring more flavour to it. I think because the sauce is so thin and light that it doesn’t add thaaat much flavour to the plain fettuccine. The vegetables are good. The parmesan cheese is what really gives it the salty good taste. Without it, it would be even more bland. Probably would not make again. But 3/5 overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "This recipe definitely requires a lot of prep time, but it makes enough for several days' worth of leftovers for two people. I pretty much followed the recipe with a few small modifications: Used 18 oz fresh linguini rather than fettuccine. I used as much basil as comes in those plastic tubs and maybe would double the amount next time. And I included about a full cup of Parmesan. You don't need to use less chicken broth; eventually the noodles will adsorb it. With salt and pepper and a little extra cheese sprinkled on top, this makes for a perfectly light, refreshing, flavorful dish. Though I do wonder if a little something extra - perhaps some lemon or cayenne pepper - would've made the flavors pop even more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "This recipe is absolutely perfect. I didn’t change a thing and my teens and 4 yo loved it! I used to make this years ago and blend it up when my little one was a baby...he couldn’t get enough. I found it in my recipe box and couldn’t wait to make it again! It’s awesome! Yes, definitely prep your veggies ahead and be ready to ‘go!’ It’s worth it....sooooooo worth it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen B"
},
"reviewBody": "Restaurant quality pasta. I added 1 lb chopped, cooked chicken at the end. My husband said it’s some of the best pasta he’s ever had. Definitely will make again. So good and love all the veggies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cicada soquaddro"
},
"reviewBody": "I have made this many times and is one of my go to recipes. I love it and am about to make in again, even though it is winter. I think anyone would love this as much as I do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "April Hass"
},
"reviewBody": "I was really looking forward to this dish and all the great greens the recipe included. However, there was way too much liquid even after reducing by a cup. Also reduced the olive oil and added red and yellow bell peppers for some extra color. Love Chef John recipes but this is the first one to miss the mark for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "Yes indeed, it was delicious! It’s so easy to modify depending on the local, in season veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "It certainly was a hit for a meatless Monday supper! Teenagers ate leftovers the next few days. I followed recipe exactly and turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mree"
},
"reviewBody": "This was Delicious, I omitted the jalapeño, not a fan, but I added extra garlic . My “ I’m cutting down on carbs” guest, went back for seconds. I will absolutely make this again. Thank you, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jane"
},
"reviewBody": "I made it as written, At the end I added 2 lbs. of shrimp sautéed in garlic and butter. Which made it perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stuart Axelrod"
},
"reviewBody": "Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beans"
},
"reviewBody": "Vitamin K filled meal that revels in subtle flavor. I stuck pretty closely to the instructions of the recipe, only deviating by adding some spinach to further increase the green density. Overall, the result is tasty, but the flavors are very mild. I may try this again with more spices added in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allen Foster"
},
"reviewBody": "Delicious and interesting blend of flavors and textures. Be sure to toss everything thoroughly. We ate this over three nights, the first night was mostly fettucine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashagang"
},
"reviewBody": "This is delicious as written. I also like this as a fall dish to transition into comfort food yet still be light enough for our warm days. The last time I made this, I didn't have any fresh basil but had some home made pesto in the freezer. It made a great substitution."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I used my immersion blender to mix the basil/garlic/oil/broth. I also used veggies on hand - cauliflower made it wonderful. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Beam Lampman"
},
"reviewBody": "I made this recipe a couple of months ago. It was delicious, BUT........After I ate the pasta, all of the vegetables were still in my bowl. Next time, I'll be sure to use a short pasta so that I get a taste of veggies with each bite. \nI think that pasta dishes with smaller pieces of protein or veggies should be served with short pasta so that the diner gets a taste of both flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JDaghri"
},
"reviewBody": "This tasted delicious. Very healthy. I did add some Italian seasonings to the veggies as well as the basil sauce. I and my family enjoyed it but felt that the sauce was a bit too liquid. I am going to add a bit more olive oil on the left overs to see if that helps. I would make this again but use 1/2 a cup of chicken broth in the basil sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Negaard"
},
"reviewBody": "Pretty tasty for healthy. I didn’t have leeks (out of season) so I doubled the zucchini. I probably added a little more cheese. And then using the same pan, I fried up some tofu. Definitely goes well all together. The Jalapeño gives some kick but I would do 1 instead of 2 instead of eliminating. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Howe"
},
"reviewBody": "This came out pretty good. I had trouble getting my water to turn green. It never did. But I made some alterations--instead of jalapenos, green onions and asparagus, I've used broccoli florets. I cooked pasta ahead of time and went to step 3. Overall, it came out pretty good on a plate than a bowl. I would make it again and hope the water turns green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Photogirl505"
},
"reviewBody": "I love this recipe; it’s a bit tedious, but it comes out delicious and it’s well worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherwood Tucker"
},
"reviewBody": "Came out phenomenal. The leeks and green onion are key. Another home run by Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LB"
},
"reviewBody": "I did just loosen up the pesto in a jar with the chicken broth to make the sauce just a bit easier. It was a little work chopping but delicious recipe. Also beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark1of4"
},
"reviewBody": "I'm not a pasta fan, but I followed the step by step instructions and it turned out great!. My wife loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jim McMahan"
},
"reviewBody": "I made this dish, and thought it was so-so. My wife thought it was lacking in flavor and needs something to jazz it up a little. She suggested black olives, which is her favorite. Maybe someone has some thoughts about other options."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wilma Martinez"
},
"reviewBody": "yes I did not add snap peas the rest was great it tasted great\nI would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Diskin"
},
"reviewBody": "It is so easy to make and absolutely amazing to eat. This is definitely going on my menu rotation"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia Theodoropoulos"
},
"reviewBody": "This was delish and healthy.\nEnjoy. My hat off t9 The chef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Andow"
},
"reviewBody": "Amazing recipe! Chef John, knocked this out of the park. The taste of fresh veggies stood on its own but then to add the lite pasta and texture. It was a Homerun!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna McLeod"
},
"reviewBody": "YUM YUM YUM we loved it! I didn't have the peppers and since we don't like HOT just left it out. YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Thomas Cramer"
},
"reviewBody": "Way too much pasta for me. Made to serve with another dish and all 4 of us went for the other dish. If I ever do it again, I would add some cilantro to the sauce and cut the fettuccine to 1/2. Having it for leftover lunch today by removing most of the pasta and eating the veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyvzw"
},
"reviewBody": "I took some of the suggestions by using 1/3 cup of olive oil, and just two cups of chicken broth. I did not have snap peas so I used chopped broccoli instead. And for the green onions I used some chopped vidalia onion. This is a delicious recipe, a real keeper and one we'll have often when we have fresh garden asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terfaz"
},
"reviewBody": "Pasta primavera is not supposed to be spicy. Skip the jalapeños. If you like a bit of heat, it is more “Italian” to add some red pepper flakes at the table, which allows each person to have it spicy or mild."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy Emery"
},
"reviewBody": "We loved this! Tasted great and satisfied our need for Spring!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie O"
},
"reviewBody": "My daughter is very ill so I brought all ingredients with me to her place to surprise her &amp; make something I knew we would enjoy together. Meal was absolutely fantastic!! Was concerned when I saw all the “extra” liquid. We let it rest &amp; the pasta absorbed all the deliciousness!! Doubled recipe as I knew everyone was hungry. All went back again &amp; again till it was gone! This is a recipe you should not pass up - so easy to put together &amp; tastes soooo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pattyshaw"
},
"reviewBody": "I made a half recipe since there are only two of us. It was good and I will make it again, but it needed more basil. I thought my package had about half of what was in the video, but it wasn’t enough for the basil flavor to come thru. Next time I will use the amount shown in the video for a half recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheKoreanOne"
},
"reviewBody": "Great way to get a lot of green vegetables into one meal! (My husband worried it would taste like straight chlorophyll but he ate every last morsel.) The fat from the olive oil helps some nutrients become more easily absorbed so don’t sweat the calories too much. There was a lot of liquid “sauce” broth which I have a feeling I’ll appreciate in tomorrow’s leftovers when my pasta isn’t all dry and tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theskyisthelimit"
},
"reviewBody": "I added more garlic, and did not have the peas. Used a yellow squash, and oyster mushrooms. So good I drank the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoelLisenby"
},
"reviewBody": "Tastes delicious but I think I would go with one jalapeno next time, it was quite spicy ;D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Vargo"
},
"reviewBody": "Very flavorful and I love the mix of veggies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Leslie Starr"
},
"reviewBody": "Didn’t care for this at all. Pretty bland. Not as good as the picture looked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rusby"
},
"reviewBody": "Almost seems like a way to celebrate spring, with all the fresh green veggies. Feels like a complete meal with either peas or green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Auna Tayloe"
},
"reviewBody": "I can't really think of any thing I would necessarily change. It just want a big hit with my family. My mom refused to eat it. The rest of us ate it, but it wasn't our favorite. I most likely will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Astrid Grünert"
},
"reviewBody": "I loved it - i dis make a change. I substituted half the oil for avocado. A bit helathrhier and creamier that way. I’m sure it’s great otherwise as well. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsoofie"
},
"reviewBody": "This was a great way to eat vegetables we don't often have. We found it to be a little bit lacking in flavor, next time I will try a little (or a lot) more garlic and some fresh ground pepper. I followed the directions as written except I added the zucchini at the end with the asparagus. Definitely worth a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vikki"
},
"reviewBody": "Easy and delicious. I only used 1 jalapeno pepper but kept everything else exactly the same. Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marty Haire"
},
"reviewBody": "I'd make it again. In spite of all the veggies, the kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Adam Collins"
},
"reviewBody": "Maybe I made it wrong? It was way too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "221b"
},
"reviewBody": "Lovely pasta primavera recipe! Everyone I've made this for has really enjoyed it! As written, I'd give 4 stars, just because the amount of basil isn't specified, and the recipe as written results in a bit too much liquid in the dish. After making this a couple of times, I've done as follows for the best results: 1. use at least 3 oz./2 cups of fresh basil; 2. use 1/2 cup of chicken broth in the sauce (instead of 1 cup); 3. add the zest and juice of 1/2 a lemon to the sauce to brighten the dish and add complexity to the otherwise somewhat olive oil-heavy flavor profile (the acid also keeps the sauce very green); 4. proceed as written until step six of the written recipe. Here, instead of adding some of the sauce to the veggies, remove the veggie mixture from the heat and drain off all of the broth, and then add the veggies and sauce to the pasta, as in step seven of the recipe. When covered and allowed to sit for 5 min., the sauce will be sufficiently warmed and the flavors will meld well in spite of skipping step six.\nOut of personal preference I also add some pine nuts to the sauce, double the garlic, and use a lot more parmesan on top. I've also found that the amount of saltiness in the dish is fine as written; you may even want to exclude the added salt if you're using normal chicken broth (not low sodium) and you've salted the pasta water well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "This was delicious and a very pretty green pasta dish. I often tailor a recipe to suit personal preference (no asparagus) and what I have on hand (wonderful frozen organic green beans, celery), so I did make a few substitutions. However, what is important to me is to note ingredient proportions and cooking method of a recipe, and ideas from the reviewers. My husband and I both liked this, and I will make it again - according to what's in the pantry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Rekrut"
},
"reviewBody": "Four stars as I modified the recipe. Added white wine!!!!! A little more oil and the wine made a great sauce. Let the pasta finish cooking in it. Also, used a red chili instead of the jalapeno. Added mushroom b/c I didn't have zucchini. Lots of parm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Swanson"
},
"reviewBody": "A wonderful combination of fresh green vegetables!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ValleyLily"
},
"reviewBody": "Too much liquid. I didn't use the leeks, snap peas, or other peas, but I added a red bell pepper and chicken. Overall there was just too much liquid and as a result I don't think the flavor was as strong as it could have been as a result. I would use no more than 2 cups of chicken stock. 1.5 cups might be ideal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "Delicious. Lots of veggies and the sauce is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookiebeast"
},
"reviewBody": "Delicious, but I thought de-seeding jalapeños was only for wimps, and I was wrong!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Pfaff"
},
"reviewBody": "This was a great spring recipe that is adaptable to many different greens you have on hand. However, you'll need to know when to add each type of ingredient so that it cooks the right relative to the rest of the mix. I suspect reviewers that found the recipe too runny did not let it sit under the plastic wrap for enough time for the pasta to absorb the liquid. Mine was not runny at all. Rather than leaving out liquid, just let it sit a little longer if it looks too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DOMMETT"
},
"reviewBody": "Just ok to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Whitehouse Baptista"
},
"reviewBody": "This was so much better than I expected! Even my daughter (who is not thrilled with vegetables) liked it. Used edamame instead of English peas, and I added the drained fettuccine directly to the pot of veggies to finish cooking/absorb the sauce &amp; flavors for the last 5 minutes. I thought it was going to be too soupy, but it the amount of sauce left will be perfect with leftovers. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stromberg"
},
"reviewBody": "frickin awesome, halfed it to serve 2, still overate. worth it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "piglet"
},
"reviewBody": "This was time consuming but I cut everything up first and followe directions exactly (watching video helped) with the exception of reducing from 3 to 2 cups-- and it was absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "Chef John came through ... again! Seems like there was a lot of prep work, but it was so worth it. A wonderful dish, just as it's written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adam Berger"
},
"reviewBody": "Loved it, the vegetables were cooked perfectly(instructions were spot on) the sauce was strong and tasty. Great Mediterranean dish that is light and healthy. I skimped on adding salt--will add more next time I cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carmela SchianodiCola McFee"
},
"reviewBody": "Only added 1 cup of broth and all the pesto. More than enough liquid. Forgot to buy the zucchini but threw in 2 handfuls of baby spinach in the end. Also sauteed some shrimp before making the sauce and added that in at the end for a complete meal with a protein."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Very good! Definitely will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lolly"
},
"reviewBody": "this is the 2nd time I've made this and it came out just right. I reduced the amount of broth by 1 cup and left out the jalapeños. My husband doesn't like jalapeños. I used 2 leeks instead of 1, but only used 2 green onions. Fresh and a little crunchy (snap peas)and really satisfying. A great Lenten dish.\nI really trust Chef John for providing tasty recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlott"
},
"reviewBody": "This recipe as written is fantastic. Deviations can be made to equal praise and ease. I added at the last minute sliced grape tomatoes for color. I am already thinking about the next time I fix it with maybe shrimp. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "johnniles"
},
"reviewBody": "Worked well. I might change a few things--difference veggies maybe--but it really was perfect for a light supper or with left overs, perfect for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenn Strickland"
},
"reviewBody": "I made this recipe exactly as written. It tastes fine, but I had a problem with the sauce - it was too watery. The pasta never absorbed all the liquid. If I make it again, I will use less chicken broth, and also eliminate the sugar snap peas, as they are kind of stringy, and not very tasty. Some family members thought the jalapeno made it too spicy, but I thought the spice level was just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooker Bob"
},
"reviewBody": "I used gluten-free pasta and added shrimp. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "veggielover"
},
"reviewBody": "Good taste, but too runny. Absorption of sauce by pasta may depend upon type of pasta -- didn't happen for me. Would reduce broth in the sauce by about half, and toss in a little salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RDB"
},
"reviewBody": "Fairly easy to make and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cmunchoff"
},
"reviewBody": "Very bland, a lot of work. I'm a vegan but decided to make this despite the cheese because it got so many great reviews and I would love to find a meal that my meat loving husband and I could both enjoy. This recipe did not deliver. Many of my vegan cookbooks have more flavorful recipes because they know how to use spices and herbs. I agree with another reviewer who said just use regular pesto, skip the broth. Unless you are a creative and confident cook I'd say skip it all together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth Ann Olmsted"
},
"reviewBody": "This tastes great &amp; worth the effort as it is a bit labor intensive in my opinion. I used homemade turkey stock I had in the freezer and omitted the jalapeños as well as English peas. My asparagus was very thin to start with so I did not split the stem. Very beautiful to the eye &amp; light tasting. Calorie count surprised me, though. 589! All that olive oil adds up. Make time for an after dinner walk :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Giovanna"
},
"reviewBody": "Delicious!!! just as is!! maybe with a little more salt :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tere Winters"
},
"reviewBody": "Thank you Chef John for another great recipe!!! I halved the recipe for two and it was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "recipe003"
},
"reviewBody": "Adding well tasting color is what's missing. Steamed Cauliflower spuds and fresh flowered cut tomato grape is the attitude to invite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kurt Linsin"
},
"reviewBody": "Use half basil and half baby spinach to enhance taste and make your own pasta. you never look back."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rocknroller"
},
"reviewBody": "March 23, 2017: 1st time made: Well impressed how visually, it exactly matches picture and the taste was pleasantly surprising . If you find flexing your knife chopping skills relaxing, you're in for a nice recipe prep time--especially for those with recipe step organization talents. Highly recommend finding ingredients from local farmer's markets. Made per instructions: Makes a meal for family of 5, with guests or you can gift neighbors / friends with some. Do use the powdery Parmesan cheese to help absorb additional liquids, with additional cheese taste being a bonus; worth using top shelf shredded Parmesan to top this Primavera--which I can see pairing beautifully with grilled or rotisserie chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cardiacolt"
},
"reviewBody": "Never had pasta primavera before. After making this, I'll be putting this on the rotation when cooking pasta dishes. I did add a few things. For the sauce, I added some sun dried tomatoes and hot peppers for some heat and color and blended it with the pesto sauce. Also during the last minute of cooking, I threw in some sliced mushrooms and spinach. Make sure you toss, then cover and let it rest so the pasta soaks up the sauce. It's still a bit runny but the flavors and tastes are wonderful. Chef John, you've done it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mrs. antoine"
},
"reviewBody": "This recipe was so so. It needs to be modified. First, ignore the first part of the recipe and don't bother making the basil/broth/olive oil base. Just make pesto. Not only will the flavor be more robust, but it will thicken up the texture of the pasta. Secondly, don't add 2 cups of broth to the vegetables. I ended up having to drain the dish because it was so soupy. Lastly, this recipe is bland, bland, bland. It needs salt and any other seasonings you prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Jolie"
},
"reviewBody": "Absolutely delicious! I only used 2 cups of broth total, I think 3 would have been too much broth for the amount of noodles, and I also used a 1/4 cup of olive oil. Blanching the basil and blending it with chicken broth &amp; garlic really gave the sauce an unique taste! It was quite the hit! Nice work Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jessica Farrell"
},
"reviewBody": "This didn't come out well at all. I'm a big fan of veggies in all forms but I really disliked this result. Too much liquid and ended up just tasting like garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose East"
},
"reviewBody": "Brilliant, such a fresh taste, I make it with gluten free pasta, and if a vegan friend comes round, the cheese can be omitted. One of our favourite meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vincent Tseng"
},
"reviewBody": "Ohh it's super delicious and healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bryna123"
},
"reviewBody": "Delicious! Something about that basil sauce is perfect. This recipe can be extravagant or paired down and still be tasty. I used only broccoli, onion and zucchini, stir fried with garlic and oil. For pasta I had tricolored rotini. It looked and tasted incredible. I topped it with Romano cheese before serving, since that's what I had. Leftovers still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "American Abroad"
},
"reviewBody": "Fabulous recipe and it's healthy to boot. I've made this recipe twice now, and I agree with other reviewers who state that not as much chicken broth is needed; two cups is fine. Don't skimp on the grated cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ute Flaig"
},
"reviewBody": "easy and very tasty! loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonna"
},
"reviewBody": "I loved it just the way it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "I will definitely make this recipe again. It turned out well. I can't say that I measured properly but I did follow the recipe as best as possible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Mazzotta"
},
"reviewBody": "Divine!!!!! That's sum's it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Chou"
},
"reviewBody": "I needed more salt and seasonings but that's easy enough for you to do on your own; otherwise followed the instructions to a tee and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Watt Prokesch"
},
"reviewBody": "This was sooooo good! I usually shy away from recipes with so many ingredients, and so much prep, but this recipe intrigued me, and we had almost all the ingredients in the fridge just begging to be used up. The sauce was somewhat thin, but I thought the flavour was delightful. And although there are a lot of steps to the preparation and the cooking, it is definitely worth it. And the fact that you can sub any veg just makes it all the more appealing. Give it a try, it's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisa Wright"
},
"reviewBody": "Loved all the fresh vegetables. I added baby bellas , too. My family said it was delicious! Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carrie Beth Keck"
},
"reviewBody": "It was SO bland. I managed to eat enough to not be hungry. My husband and kids did not like this at all. There was way too much liquid and not enough flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "morfor"
},
"reviewBody": "Made as is and added diced grilled chicken. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NEXTDRHOOD"
},
"reviewBody": "I followed the recipe except for using Trader Joe's Spinach and Chive Linguine to make the dish green throughout. (Perfect for St. Paddy's or Green Eggs and Ham celebrations!) Hubby, who hates asparagus, loved it. We did choose to add some salt after serving, but that's a matter of taste. Another winner from Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eat"
},
"reviewBody": "Made exactly as written....Do not despair! It takes about one hour for the juices to be fully soaked up by the noodles. Stir once every 15 minutes for one hour. Buy thick asparagus spears and chop the veggies a little bit larger than you normally would. I would have given this 5 stars if the directions were complete."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/236218/chef-johns-pasta-primavera/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17020/main-dish/pasta/pasta-primavera/",
"name": "Pasta Primavera Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/236218/chef-johns-pasta-primavera/",
"name": "Chef John&#39;s Pasta Primavera"
}
}
]
}
}
, "about": [
]
}
]