				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Irish Pork Stew"
,"datePublished": "2014-03-13T17:56:14.000-04:00"
,"dateModified": "2023-01-02T09:07:54.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "Chef John&#39;s pork stew served with mashed potatoes features cubed pork shoulder and Brussels sprouts simmered in dark beer flavored with caraway seed."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/M3IyWDrfhJnOWODhTlnqAKdL3_E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2158157-de3cce56e0fa44419effcd00ed7fe873.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3327016214001",
"description": "Here’s what we should be eating for St. Patrick’s Day.",
"duration": "PT6M2S",
"name": "Chef John's Irish Pork Stew",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/a534207e-c8aa-41c2-9b3e-7b630cca9182/8ae31f9f-b08b-43b5-bc7c-5306c0819dc6/1280x720/match/image.jpg",
"uploadDate": "2020-12-03T08:15:47.408-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Irish Pork Stew"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "319"
}
,"cookTime": "PT145M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "401 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "5 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "769 mg"
,"sugarContent": "7 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (2 1/2 pound) boneless pork shoulder, cut into 2-inch cubes",
"salt and ground black pepper to taste",
"1 tablespoon vegetable oil",
"1 tablespoon butter",
"1 large onion, chopped",
"2 cloves garlic, minced",
"1 tablespoon all-purpose flour",
"1 bay leaf",
"0.75 teaspoon caraway seed",
"1 (12 fluid ounce) bottle dark beer (such as Guinness®)",
"2 cups chicken broth",
"3 carrots, cut into 1-inch pieces",
"2 stalks celery, cut into 1-inch pieces",
"0.25 cup chopped fresh flat-leaf parsley",
"3 tablespoons balsamic vinegar",
"12 Brussels sprouts, halved",
"3 cups mashed potatoes, or as needed",
"1 teaspoon chopped fresh flat-leaf parsley, for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Season pork with salt and black pepper."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large pot over high heat. Working in batches, cook and stir pork in hot oil until browned on all sides, 5 to 10 minutes. Transfer pork to a bowl."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in the same pot over medium heat. Cook and stir onion in hot butter with a pinch of salt until onion is softened and translucent, 7 to 10 minutes. Add garlic; sauté until fragrant, about 30 seconds."
} ,{
"@type": "HowToStep"
,"text": "Stir flour into onion mixture; cook and stir until flour is completely incorporated, about 2 minutes. Add bay leaf and caraway seed; cook for 2 minutes more. Pour in beer. Cook and stir until thickened, 1 to 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir browned pork, broth, carrots, and celery into beer mixture; bring to a simmer. Stir 1/4 cup parsley and balsamic vinegar into stew; reduce heat to medium-low and simmer until pork is fork-tender, about 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, bring a large pot of lightly salted water to a boil. Cook Brussels sprouts in boiling water until almost tender, about 5 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Stir Brussels sprouts into stew and simmer until heated through, about 5 minutes. Season with salt and pepper."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/M3IyWDrfhJnOWODhTlnqAKdL3_E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2158157-de3cce56e0fa44419effcd00ed7fe873.jpg"
}
]
,"text": "Divide mashed potatoes between 6 bowls. Ladle stew over potatoes and garnish with 1 teaspoon parsley."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT170M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Wallace Balderas"
},
"reviewBody": "This Irish Stew was beyond wonderful. It has such great flavors. Everyone I serve it to wants the recipe. I make it every St Patrick’s Day and beyond. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe with the brussels sprouts. I didn't care for the taste of the brussels sprouts and think I would prefer using cabbage. I omitted the caraway seed and used regular beer instead of dark. I thought the stew itself was very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing recipe and super easy to do for all skill levels! The only changes I made was roasting the brussels in the oven at 400 for 20 min with butter, salt and a drizzle of balsamic for a toastier and crisper baby cabbage. I also added a bunch of garlic to mashed potatoes. The mashed potatoes as a base layer is absolutely genius and as unique as it is fun. This the families new standard stew recipe. My only recommendation is to at least DOUBLE the recipe as it goes quick and you will want more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this recipe! I have made it several times for family and friends. Everyone has also loved it.I put in about twice the amount of Brussel sprouts. It takes time to cook the carrots and celery to a soft stage. It’s very flavorful and delicious. Be sure to try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Thompson"
},
"reviewBody": "Loved the different techniques for the meat, potatoes and sprouts, really helped separate the flavors in each."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynda"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alleycat5404"
},
"reviewBody": "I made this yesterday so that I would have it for a St Patty's party today. I may need to make a second batch today since what I made yesterday is almost gone. It is so good! Love this stew! The caraway gives this a great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Left Side Cook"
},
"reviewBody": "I made the dish per the recipe. After tasting, my wife’s first comment was, “ this is good, please keep this recipe”. \n\nI have to agree with my wife."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RobCooks"
},
"reviewBody": "good base recipe. I'll probably change it for the Instant pot because at 5800ft it takes about 3 hours to get done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Followed the recipe but omitted the caraway seeds and Brussels sprouts since my husband doesn’t like them and substituted additional broth for the beer and it was amazing. cooked for 2 1/2 hours and the meat was so tender and flavorful. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSS"
},
"reviewBody": "Made this last night and it was exceptional! Used all of the noted ingredients but changed up two things: 1) Used an IPA only because I didn't have any dark beer on hand (not sure how it changed the flavor but it was great) and 2) Roasted the sprouts before adding to stew. Will absolutely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosanne"
},
"reviewBody": "I made this recipe tonight for St. Patrick’s Day. It was fantastic- so much so that I had a second helping, and husband had three! The only changes I made was adding a half cup of white wine instead of the beer ( I don’t like beer) and I didn’t have any caraway seed, so I used dry thyme. I will definitely be making this again!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "normal"
},
"reviewBody": "I basically followed the recipe. Did not use parsley or the vinegar. Also I had fresh cabbage that I used for the Brussels Sprouts. Used lots of cabbage. Served this to 5 other ladies. We all loved it. Don’t know why some people give low ratings if a recipe is “bland”. Not everything has to be spicy. This had great flavor. What we often call comfort food is usually flavorful, but “bland”."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QOHearts"
},
"reviewBody": "Easy and awesome!! Only change I made was roasting the brussels sprouts instead of boiling. Otherwise, made recipe as written (served sprouts on the side because hubby isn’t a fan). The gravy is irresistible. This recipe will be added to my regular menu options."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug Jeffreys"
},
"reviewBody": "The wife and I really liked this stew. It highlighted our St. Patrick's Day meal along with Chef John's Irish cheddar spring onion biscuits"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Possibly the best Irish Stew I've ever had, let alone made. Simple, tasty, hearty, and even better the next day! Thanks, Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINNY"
},
"reviewBody": "I tried this out the other night with the ends pieces of a pork loin that I had in the freezer and it was absolutely delicious! I think the balsamic vinegar added a slight sweetness to the sauce. The flavor was perfect. \nI didn't see anything about covering the pot as the stew cooked for the 2 hours so did not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy"
},
"reviewBody": "2nd review for this (wanted to post a picture). Fantastic! Tasted like something my Irish Nana used to make. Comfort food at it's best! Gonna try it with beef next time because one of my kids doesn't eat pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J"
},
"reviewBody": "This was delicious! My husband who hates left overs asked me to save some and freeze it in a container for lunch. I made it exactly as written but served it over garlic mashed potatoes. So delicious! I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luigit"
},
"reviewBody": "I made this recipe for my family and the absolutely loved the stew. already asking when I am going to make it again. very flavorful dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hiko73"
},
"reviewBody": "I am in LOVE with this stew. I used beef as I don't eat pork and didn't have the caraway seeds, but this is one of the best Irish stews I've had and I had the Guinness stew at the Guinness Brewery. Ok, I tripled the garlic as well, still the best stew :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Garrison"
},
"reviewBody": "Simply amazing! Been craving this flavor since visiting Ireland. Tastes authentic. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrieannaShay"
},
"reviewBody": "Another home-run dish from Chef John! Easy to prepare and so satisfying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmcg"
},
"reviewBody": "Amazing recipe. Did not make any changes. It’s a keeper for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BECKY300N"
},
"reviewBody": "I just saw this recipe yesterday. I have never seen a recipe with SO MANY 5 star reviews! Had to make it. Problem is I live waaaay out in the country and I didn’t have everything. I was lucky in that I had a pork shoulder in the freezer. So I made do with what I had. I used Busch Light beer instead of dark ale and cabbage instead of Brussels sprouts. I didn’t have caraway seeds. I promise you Chef John, I will make it the correct way next time. But I have to say what I made was delicious! Can’t wait to do it again, next time the real recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Hit this one out of the ballpark, Chef! My only advice is double the recipe! I made with leftover pork loin because we require less fat in our diet, but this was still excellent and fit for a king. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Stathis"
},
"reviewBody": "One of my favorite recipes on this site, I make it every year on St. Patrick's Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "Made as written using brussels sprouts, this was a very good stew that will be made over and over again. It was very flavorful to us, not bland at all as some reviewers stated. Used 20 yr. basalmic vinegar, Guiness Smooth, added a bit of garlic powder and onion powder also. Super good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina McGlynn"
},
"reviewBody": "I never write reviews, but this stew was so good that I had to. I followed the recipe exactly (aside from forgetting the caraway seeds) and it was delicious. I make a lot of internet recipes once and don't bother again, but this one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Notyas"
},
"reviewBody": "I love pork. I hate caraway seeds. \n\nFollowed the recipe as best I could giving Covid limitations. Turned out phenomenal. I wouldn't change a thing.\n\nRevisions: \nBeer: (hopefully, this is funny) My family doesn't drink at all. But I will yield sometimes with wine in a recipe. I have never used beer in anything but beer bread and hated it. So, I asked my husband to go to the convenience store across the street from our house. Literally about 200 feet away. He didn't know what dark beer was and no one in the store could understand what he wanted through his mask. So, my poor honey even called my brother in law who brews his own beer. So, the decision was easier than he thought, the only beer he could buy as a single was in large barrels near the door and conveniently was placed into a paper sack. He came home with a \"40\" of malt liquor. What a story for the grand kids. \n\nI poured my 12 ounces and put the rest in a jar in the fridge. Yes it took 50 years for me to have beer in my fridge. \n\n2. Brussels sprouts-just left out. \n3. Cooked for 1.5 hours in the oven on 350 and 45 min uncovered on 400. \n\nThe texture was velvety and smooth. The flavor was rich with umami and a subtle sweetness and the color was amazingly dark like beef stew. \n\nI have a pork roast in my freezer that I plan on using the remaining 28 ounces of Malt Liquor tomorrow and freezing for later use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dablacks77"
},
"reviewBody": "First time making this I had no fears when chef John says it’s good it is good.!! I had a package of boneless chunky spareribs, they were lean I sliced them in bite-size pieces, I use extra couple of carrots, I also took a cup of the liquid out of the pot and let it cool while the stew was simmering. I then added a tablespoon of flour?????. I defrosted a bag of brussels sprouts, when they were defrosted I sliced them in half and added them to the simmering stew the last 15 minutes?. I thin thick and the stew with the liquid then I added the flour to earlier. ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabasco"
},
"reviewBody": "This stew was amazing. We used a locally brewed oatmeal stout. I also pan seared the brussels sprouts with some olive oil and salt, the same way I would serve them by themselves, and put the finished product in at the end.\n\nWe're making it again with beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gaurav Langeh"
},
"reviewBody": "The family loved it. Followed the recipe completely. Thought the quantity was a lot when i started....we are a family of just 3....but the entire bowl was polished off in one sitting :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candis Selhay"
},
"reviewBody": "I am giving this 5 stars because that is what it deserves, as written. I had a pork sirloin roast and made it with that. It was really quite good, but the pork was too lean and thus, a little dry. With that said, my hubby LOVED it and had it for dinner, lunch, and dinner again, as leftovers. I did serve with boiled red potatoes and not mashed. I will most definitely make this again with pork shoulder. The balsamic vinegar was the key to making the sauce perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "This recipe is a keeper! Definitely will be added to my “favorites” list. I made it per direction, well maybe a little heavy handed with the garlic because I’m a big fan of garlic. I used Guinness DRAUGHT Stout and it was not bitter at all! Also, I think , make your mashed potatoes a little stiff and not to creamy so they stand up to the gravy. It was wonderful. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Leduchowski"
},
"reviewBody": "This is a great recipe! I dry rubbed the meat and refrigerated/marinated it overnight. I like to buy bulk cuts of meats and get a couple dishes out of them ( I made piri piri pork kabobs with grilled pineapple with the other half of this pork shoulder) \nI did the Brussel sprouts the first time, but honestly didn’t find they added much to the dish so omitted them the second time. A treat for my husband was adding grilled mushrooms to the mashed potatoes \nDelicious recipe, love chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Case"
},
"reviewBody": "I did not deviate from the recipe - never do when I'm making it for the first time. It was delicious, and the family gave it \"two thumbs up\"!\nI will definitely make it again - but may substitute hash browns or tater tots for the mashed potatoes on the next go-around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blkcat118"
},
"reviewBody": "The taste was amazing. My only issue I had with it is that some of the veggies were still hard while others were soft. It wasn't consistent in texture. When I make again, then I am gonna stir more and leave on longer,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtnsjim"
},
"reviewBody": "Great cold weather stew. I used less pork loin and added several veggies, sweet potatoes and veggie stock. A little sriracha gave it some kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlyle R Chan"
},
"reviewBody": "Love this recipe! Didn't have beer or caraway seed on hand but still turned out really yummy! Used apple cider vinegar instead of balsamic since I don't have balsamic vinegar at home. Recommended this to my sister thanks for the recipe will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Romana (Anamor971)"
},
"reviewBody": "Great recipe for a delicious outcome! Followed it to the letter and it turned out perfect. We didn’t have caraway seeds so will try to add them next time. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy R"
},
"reviewBody": "Delicious! I didn’t change a thing except I cooked it in the oven at 275 for two and a half hours instead on the stovetop and substituted more carrots for the cabbages."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I make this every year around St. Patrick's - I make it with Chef John's Perfect Mashed Potatoes, and it is a HUGE hit. Keep it at a low simmer and add chicken stock if it reduces too fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Gammon"
},
"reviewBody": "I doubled the recipe and got rave reviews for this recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Mutdosch Tupper"
},
"reviewBody": "Absolutely perfect. Served over colcannon and everyone raved (including two children). Will make this again, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "After cooking for 40 minutes, I went to the kitchen to stir the pot. The room was filled with smoke and the stew was burned. It was simmering on low at the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beans"
},
"reviewBody": "A rich stew that was perfect for a Sunday. My only modification was cooking potatoes in the stew instead of making mashed potatoes separately. This greatly increased the volume of stew, requiring a full quart of chicken stock. However, after 2 hours of simmering, it still had loads of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roquiey"
},
"reviewBody": "Very tasty. The caraway seeds give it a great flavor but don't over do them as a small amount can go a long way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Casale"
},
"reviewBody": "Loved the brussel sprouts, I would add more next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hans"
},
"reviewBody": "Made it at the shelter where I volunteer; big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Berta Parker"
},
"reviewBody": "I personally didn’t like the bitter flavor the Guinness added to this stew. I will make it again but with either a lighter beer, or no beer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schwwwyzzerdd"
},
"reviewBody": "Always trust chef john\n\nHonestly if you don't like this stew I'd say that's on you - either you made a mistake or you don't like one of the ingredients. If you do it anything close to as stated you end up with tender pork, perfect veg, and a rich pub-style gravy.\n\nYou will notice immediately after you put it in how essential the balsamic is to this though; I would say for all the variations you can do w/ meat, veg, beer, broth, fat, it won't be the same without the vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merrymicerborn"
},
"reviewBody": "No substitutions. A delicious, delightful preparation. It got raves from my family. THANKYOU chef John for sharing your talent with us, an army of home cooks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Brenner Baldwin"
},
"reviewBody": "Delicious! Hearty and comforting. Added a can of tomatoes to make the stew richer since I didn’t have broth. I’ll make this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashagang"
},
"reviewBody": "Hard to believe I've never reviewed this recipe. It was my first Chef John recipe and it rocks. Both my husband and I grew up on Hamburger Helper, Shake and Bake, etc. I was much better than that, but far, far from where I am now as a cook. It opened a whole new world. \n\nThis is one of my first cool weather recipes of each and every year, and every time, we love every bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Kitty"
},
"reviewBody": "We made this last night and it was awesome! We used country style boneless pork ribs, extra garlic, extra Brussels' sprouts.\nInstead of boiling the Brussels' we sauteed them in olive oil until crisp on the edges and then added them and the other veggies with about 30 minutes remaining. - we like our vegetables a little on the al dente side. We kept the sauce true to the recipe. It was delicious. Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Cox"
},
"reviewBody": "I used Sierra Nevada's IPA because I didn't want to buy a 6 pack of Guinness and it still tasted amazing. I think a darker stout or porter would definitely add to the flavor though, but it is so good. Cut up some russett's and boiled til soft then mashed and poured stew over it. Didn't get crazy with my mashed potatoes except to add butter. I followed recipe as written. Had to add more chicken stock. Turned out wonderful. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Hill"
},
"reviewBody": "I made it just as the recipe was written. It was so delicious and I will definitely make it again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David T"
},
"reviewBody": "Very good stew. I never thought that Brussel sprouts would be so good in a stew. Plan to add them to other stews in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Davies Alderliesten"
},
"reviewBody": "I love all of chef johns recipes, i look him up before i google recipes. His are always delish and a bit unique. KOODOS to Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allie"
},
"reviewBody": "I made this exactly according to the recipe, except I used 2 1/2 lb. boneless pork loin. It was fantastic! I loved the flavour of the caraway. Will be making this again fo sure,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nana Smith"
},
"reviewBody": "Thankyou Chef John, Another 5 star winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Ward-Armstrong"
},
"reviewBody": "Everyone loved this stew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bea"
},
"reviewBody": "This was wonderful - I did not find dark beer so some Polish beer and substituted dried onions and used apple cider vinegar along with the Balsamic vinegar. I will definitely make this again . Yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnnybw"
},
"reviewBody": "Made this as the recipe states and loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gnome"
},
"reviewBody": "Freaking awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack Leroy Campbell"
},
"reviewBody": "Used a light German beer instead of the dark and it worked fine. Also cooked the pork stew meat in the broth, beer, garlic and onions mix for one hour, and then added cubed potatoes and remaining vegetables to the stew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "losingittoo"
},
"reviewBody": "modified as below....1 lb of pork stew meat, 1.5 cups of chicken broth, 14.9 oz of Guiness, 3 carrots, 2 stalks of celery....broth/sauce was delish. used Garlic Mash potatoes..will make again and eliminate brussel sprouts (they just don't add enough) will use beef or lamb (not a pork fan)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Lakins"
},
"reviewBody": "I made this stew exactly by the recipe. The only thing I omitted was the Brussel sprouts. Will definitely make it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noah Arvidson"
},
"reviewBody": "This stew is incredible! The mashed potatoes soaking in the stew are my favorite part - so delicious. The only change we made was cooking the brussel sprouts separately, and we sauteed them. Brussels are kind of smelly (especially when boiled) and we didn't want the stew to take on that smell. They also didn't hold up well in the reheat for leftovers, so we make a fresh batch each time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quay Robinson "
},
"reviewBody": "I made this delicious dish- with a few substitutions.... I didnt habe celery so i used fennel seeds and no caraway seeds so i use some red chili mixed with cumin. It was great, still! Thanks @Chef John!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Hampton"
},
"reviewBody": "Loved this dish! I made it exactly as written but I had a little over 3 lbs of pork shoulder and I just decided to used it all. I worked out just fine. I think I like this more than Irish beef stew with Guiness that I made for St. Paddy's day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Tall Lady"
},
"reviewBody": "I will definitely make this recipe again. Delicious!! The only change I made to the recipe was for thickening, I doubled the amount of all-purpose flour, and the stew reached the perfect thickness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Very delicious. I used more veggies than the recipe called for. I also thickened the sauce with a tablespoon of corn starch stirred into a little of the liquid, then added to the pot. The caraway seeds were a subtle but important addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bhansai"
},
"reviewBody": "I love this. I made it to the letter once and left out caraway seeds once. I will admit I prefer it without caraway seeds, but I hate those, so that's on me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1184MaryKate"
},
"reviewBody": "The best pork stew in ages. And I come from \"stew country\". Made it as is and was super delicious. Next time however will cook only 1 - 1.5 hrs. I think 2 hrs was too much. Also, I added the Brussels sprouts 10 min before the stew was done and loved it. Thank you Chef John. Staple in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laureen"
},
"reviewBody": "Omitted the caraway because we don't like the flavour, and the Brussel sprouts because our kids don't like them. Despite these changes it was fabulous. Next time we will add the sprouts. The meat was fork tender and the gravy rich. We served the stew on whipped russet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wicked Moon"
},
"reviewBody": "As always, Chef John's recipes never disappoint."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "What a great stew recipe!!! Made it on a cold, snowy day and it was the perfect dinner. Only change I made was to add two more carrots, more Brussels sprouts (we love veggies) and a little more flour for a thicker sauce. Otherwise don’t change a thing- can’t wait to make for our kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "This is amazing. I didn't have the mashed potatoes, and we didn't miss it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TB"
},
"reviewBody": "This was very tasty! Next time I will make with pork shoulder instead of pork chops and add in sprouts a little sooner so they can absorb more stew flavor. No changes needed to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rafika"
},
"reviewBody": "I made this tasty dish this evening for dinner. It lit up our home with a lovely scent the entire time it was cooking. I didn't add the brussels sprouts since I didn't have any on hand. Otherwise, it was absolutely wonderful. I would certain make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mich"
},
"reviewBody": "This was delicious, the meat was soooo tender and love the Brussel sprouts at the end, I didn't boil them, I just microwaved for 2 minutes. Will definitely make again. Love all the recipes from chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dia"
},
"reviewBody": "I loved the recipe but I thought the Balsamic vinegar taste was too strong. Next time I’ll use half the amount"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cowboy Casey"
},
"reviewBody": "REALLY REALLY Great Stew... Doubled the recipe and used Cabbage wedges and worked perfect...\n\nThank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Rosette"
},
"reviewBody": "This is wonderful and other than needing to add broth during the second hour of cooking, I made the recipe as is. This is such an interesting way to serve Brussels sprouts. I’m eating low carb and so didn’t serve the stew with mashed potatoes, but the addition of Brussels sprouts made the stew substantial enough to eat on its own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Flanary"
},
"reviewBody": "I made this entire recipe in our Cast Iron Dutch ovens and boiled the brussle sprouts in our cast iron deep fat fryer. Absolutely wonderful flavors, rich and hearty. The brussle sprouts had an amazing crunch that added some nice texture. I love how Irish Stout was present at the end of each bite and complemented every single ingredient. I might try adding in some halved whole mushrooms next time to add another level of flavor and texture. I did have to add in some slurry made with flour and Water to thicken the gravy some more but other than that followed the recipe to the letter. Thank you for such a wonderful treat with tastes of the Emerald Isle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Awesome dish! Great dinner for a cold winter evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Craig"
},
"reviewBody": "This stew was great! The only suggestion I have is to buy a pint of the Guinness so you can add the 12 ounces and still have some left to sip. With the caraway seeds and stout it is almost like having rye bread with the stew. Great job Chef John and thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RYLA06"
},
"reviewBody": "I followed the directions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheridan Manfredi"
},
"reviewBody": "YUM! That about sums it up!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mochi"
},
"reviewBody": "Follow exactly like the recipe stated. The best stew we have ever had, that's the boys said. Thank you chef John for the delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmackisey"
},
"reviewBody": "Don’t like Brussel Sprouts, and did not have coriander. Other than that, made as stated - Wonderful!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodylicious"
},
"reviewBody": "I used half apple cider vinegar with the mother for the health benefits. Used regular cabbage instead. Ate it with homemade sourdough. I also was lazy and just threw in the entire 4 pounds of pork and just let it fall off the bone, so I shouldn’t really rate the recipe since I changed it, but I get the point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Very good. Hubby loves it. I even liked the Brussels sprouts in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "This was a fantastic meal! My husband could hardly wait until it was done :) The whole family enjoyed it, no leftovers. This recipe is going into our monthly rotation, especially now with fall around the corner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aerich Rea"
},
"reviewBody": "This is a really good hearty stew. Great for winter meals and makes a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adolfo Yee"
},
"reviewBody": "It was soooo goood! Made a big pot and now we are set for a couple of days.\nHappy."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/236988/chef-johns-irish-pork-stew/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1785/soups-stews-and-chili/stews/irish-stew/",
"name": "Irish Stew Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/236988/chef-johns-irish-pork-stew/",
"name": "Chef John&#39;s Irish Pork Stew"
}
}
]
}
}
, "about": [
]
}
]