				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Flour Tortillas"
,"datePublished": "2012-04-23T21:02:39.000-04:00"
,"dateModified": "2019-10-10T00:50:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Love tortillas? These homemade flour tortillas are tender and flavorful. Perfect for your next Mexican-inspired fiesta!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zigwyJKfhOaKirC6RDfNL4o0MD0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/840603-0f6bd08f82504b7da9963cb7faee37ca.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1555790887001",
"description": "See how to make easy homemade flour tortillas in no time.",
"duration": "PT5M52S",
"name": "Homemade Flour Tortillas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/fe02aa1f-8dec-4b5f-a372-8ab48f90df85/a59df2b2-ac87-4fc6-bf21-1e15e67e578b/1280x720/match/image.jpg",
"uploadDate": "2021-07-06T02:06:43.215-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Flour Tortillas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "321"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "171 kcal"
,"carbohydrateContent": "24 g"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "234 mg"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.75 cups all-purpose flour",
"0.75 teaspoon salt",
"0.25 teaspoon baking powder",
"0.25 cup vegetable shortening",
"0.5 cup hot water",
"0.25 cup all-purpose flour for dusting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk flour, salt, and baking powder together in a large bowl. Add vegetable shortening and work into flour mixture using a pastry cutter until it resembles coarse crumbs."
} ,{
"@type": "HowToStep"
,"text": "Form a well in the middle of flour mixture and mix in hot water. Work flour and water mixture together with a fork and transfer to a cutting board."
} ,{
"@type": "HowToStep"
,"text": "Knead until a smooth, soft dough is formed, about 3 minutes. Add more flour if dough is too sticky."
} ,{
"@type": "HowToStep"
,"text": "Place more flour on cutting board, cover dough with bowl, and let rest for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Cut ball of dough into eight equal parts and cover until needed."
} ,{
"@type": "HowToStep"
,"text": "Roll out balls of dough either by hand or with a tortilla press."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zigwyJKfhOaKirC6RDfNL4o0MD0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/840603-0f6bd08f82504b7da9963cb7faee37ca.jpg"
}
]
,"text": "Heat a large skillet over medium-high heat. Place flattened tortilla in skillet and cook until it begins to bubble, about 1 minute. Flip tortilla over and cook for an additional minute. Flip again and cook for 1 more minute. Repeat with remaining dough."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have a sodium intolerance. I did not use any salt and used Rumford reduced sodium baking powder. The tortillas came out fine, and I had no typical mouth reactions like when I eat store bought tortillias that can have over 200 mg of sodium per tortillia. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacyanne"
},
"reviewBody": "Chef John saying it will be hard to go back to the packaged option again is an understatement. I'm sure there will be a dark time when in a crunch I will have to buy some from the store, however, I think I will just need to keep these on hand. I used lard instead of vegetable shortening and it produced the lightest and most flavorful tortilla I have ever tasted. They were perfect for pork tacos and I can't wait to experiment with other recipes. The only thing I preferred was rolling them out by hand as opposed to the tortilla press. My tortillas in the press did not come out thin enough for my personal preference. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "Excellent as written. Dough really easy to work with. Have also used lard in place of the shortening with great results. So simple will never use store bought again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dixie"
},
"reviewBody": "I’d forgotten how easy it is to make tortillas and these were great. My mom is 92 and not an adventurous eater. She raved over these! I forgot to take a picture before we dug in and didn’t think an empty plate would work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "No I didn’t make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Tortillas came out really good - I followed the recipe exactly. Made scrambled eggs and chorizo breakfast tacos with them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Ferguson"
},
"reviewBody": "This is an easy, quick way to make delicious tortiallas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa DeKorte"
},
"reviewBody": "Great recipe!! I used regular salted butter because it’s all I had on hand, turned out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "siddygirl"
},
"reviewBody": "THE BEST TORTILLAS!! So I made the other tortilla recipe first the one that has over 1k reviews and this one is hands down better!! I used pork lard instead of veg shorting , my store sold a jar of organic pork lard right next to the crisco and I thought, why not go all in? they were crazy good! Super simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathy P"
},
"reviewBody": "These are pretty good and easy! It was my first time making tortillas. I found it easier to mix everything with my hands and I had to turn the heat WAY down to keep from burning them. In my personal opinion, they could stand to be a tiny bit saltier. But overall, happy with the outcome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas Bedient"
},
"reviewBody": "You will never buy tortilla's again once you get the hang of these.\n\nFor mine, I don't usually have shortening in the house, so I just substituted softened butter. Works wonderfully.\n\nBest tip I can give is you want to make sure the pan is HOT. You want to flash sear these. If they sit in the pan too long, the moisture evaporates and they'll be hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne"
},
"reviewBody": "I made the tortillas with butter, instead of shortening. Then with the tortillas I made them into burrito bowls. They were very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LoveMexiFood"
},
"reviewBody": "Make as thin as possible. A little bland Make cheese crisps then a burrito with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jtcoosbay "
},
"reviewBody": "I followed the recipe to a tee and it turned out thick. It was like Peda bread! Tasty though. I used a tortilla press and it kept shrinking back! So, I can't use them for breakfast burritos due to the thickness of it. Not sure what to do differently."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BRILEY"
},
"reviewBody": "Out of the same batch, I let one set of tortilla balls rest for about one hour in a plastic bag. When I cooked them on a hot griddle, they puffed up and were delicious. My first batch, without resting time, were tough and did not puff. With a little resting time, his flour tortilla recipe is delicious, light, and not greasy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yellow"
},
"reviewBody": "I used a crepe pan because I own one and it was great! I need to learn how to roll the dough out into a circle, but otherwise, it was tasty and easy to do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy mesinere"
},
"reviewBody": "I didn’t have shortening so I substituted butter. They were easy and delicious. My family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I loved these! They were too big for my tortilla press so I ended up having to roll each one. Next time I'll try to make them smaller so I don't have to roll them out. We loved the texture of these and they were perfect for our shrimp tacos!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "These turned out great and were fun to make! Followed recipe exactly. We used a rolling pin to roll out and it was easier just rolling them on the counter top than between waxed paper. First we flattened the dough ball with a plate, then rolled them out thinner. My youngest is a natural at making tortillas it turns out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bevo"
},
"reviewBody": "First time for doing homemade tortillas, so I followed the recipe exactly. I’m quite pleased with the result. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Micamus"
},
"reviewBody": "First try at tortillas. I’ll get them a little thinner next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURISSIMA"
},
"reviewBody": "Delicious! Mine did not bubble up, maybe because I didn't knead them long enough, but they tasted great. I used a little butter in the pan, which added some yummy flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ponytail Goddess"
},
"reviewBody": "Yum, I am now a huge believer in making homemade tortillas! I've made them twice now. The first time, I followed Chef John's directions exactly. The tortillas tasted good, but ended up being inflexible and a little gummy tasting. when I went to make them again, I read reviews on this recipe and others to find out what I could do to ensure success. Here's what I ended up changing: I used nearly boiling water, I formed the dough into eight equally-sized balls before allowing the dough to rest, and I only cooked the tortillas for one minute on each side. These changes gave me the results I was looking for, soft and tasty tortillas that were flexible enough to hold filling, but also strong enough not to break when filled. I plan to make these over and over again. They truly are.worth the effort and are.much tastier than store-bought tortillas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daireen"
},
"reviewBody": "Super easy to make and delicious! Make sure you get your tortilla dough as flat (thin) as possible for best results especially if you’re not using a tortilla press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathryny"
},
"reviewBody": "Delicious! I used this recipe to make quesadillas! Don't have a tortilla press so the rolling of these tortillas into approximations of circles was time consuming and frustrating. If you have the means, recommend picking up a tortilla press!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquie FurKidMom"
},
"reviewBody": "awesome recipe!! made them last night, and I agree, we won't be buying them anymore. Fresh is best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim L"
},
"reviewBody": "I would make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Losier"
},
"reviewBody": "I love Chef John's recipes! They always work out great. My kids love these tortillas I am not allowed to buy tortillas anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NoelnTye Munoz"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Price"
},
"reviewBody": "Have you ever made a simple recipe that makes you just gush with Proudness once you make it for yourself ? LOL Well, this recipe ended up being that proudness moment for me. :) I gave this recipe a try, for I wanted to have an organic recipe without the added Carrageenan ingredient that seems to be found in almost all store bought varieties. I substituted solid coconut oil for the shortening and made the recipe as stated with great success. This one is a Keeper. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally McDonald"
},
"reviewBody": "LOVE this! This is the first time that I've tried to make homemade tortillas, and didn't expect much. Followed the recipe exactly, but didn't watch the video. Overcooked a couple of them, but the taste is great and once I got the hang of it, it was super simple and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jayelle"
},
"reviewBody": "I give up. This was my second attempt at making homemade tortillas. The last time was ten years ago, so I thought I had more experience in the kitchen this time around and it would be ok. I realized I didn't have any tortillas in the middle of dinner prep and was trying to avoid an unwanted trip to the store. These came out very dry and crispy like if you tried to roll it up like a taco, it would snap in half. The flavor was good though. So instead of making burritos like I planned, I made a \"burrito pie\", laying them flat and layering ingredients. They actually worked fabulously for this as they didn't get soggy. Dinner was saved and I may use this recipe again if I plan on using tortillas for the purpose of layering in a casserole-style fashion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wyatt Bailey"
},
"reviewBody": "I would add a extra 1/4 tsp of baking powder to get bigger bubbles but otherwise it's a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladybug"
},
"reviewBody": "Yummy yummy yummy yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLynn23"
},
"reviewBody": "This is true to what our family recipe has at home. Nice work Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "My husband and I just love this recipe for flour tortillas. Actually, we liked them so much the first time we made them that my husband ordered a tortilla press that same night. To make it less laborious, I use a food processor to mix the dry ingredients and butter. After a few pulses, I transfer the flour back to the bowl. \n\nI use butter in place of the shortening and use a cast iron skillet to toast them. I top them with the restaurant style taco meat and guacamole that I also found on this site. With the taco meat, guacamole, some sour cream, and cheddar cheese, our tacos are definitely so much better than what we'd get at a Mexican restaurant in our city. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake"
},
"reviewBody": "First attempt and they came out great! Be sure to observe the rest period. Fried them in a nonstick skillet. Will never buy in store again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Tobin"
},
"reviewBody": "First attempt so I wanted to get it right.\nWent with Chef John.\nLoved the way they came out.\nWent exactly with recipe.\nGot a tortilla press process even better cause they look better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Linkes"
},
"reviewBody": "When in a bind with no store bought tortillas, I knew I had all the ingredients but didn’t want to leave the house. I followed the recipe(and the video) to a T! Everything turned out perfectly. I don’t have a tortilla press but I did use plastic wrap and a rolling pin. Made them paper thin and it was perfect! I showed a friend who of Mexican heritage and she said they were perfect as if she taught me. Gammy was so proud"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tony O'Conner"
},
"reviewBody": "I'm still trying to get this one right. The flavor is great, but I'm having some trouble with the shape and size coming out right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck Shepard"
},
"reviewBody": "I rolled it out in 3 segments, about a 1/4” thick, coated it in melted butter and cinnamon sugar to within an inch of one edge and rolled it into a cinnamon roll, cut it about one inch pieces and cooked them in a Med hot cast skillet for about 3-4 minutes, turned over for another 3-4 minutes (dark brown), let cool and they are snack rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonya Grady"
},
"reviewBody": "Simple and tasty. I probably need more practice to make it flexible enough as a wrap. But tasted just as good or better than what I buy at the store, so I did something right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarynB"
},
"reviewBody": "This was great. My kids loved it as well and was not that hard to make at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John G"
},
"reviewBody": "Probably merits 5 stars. My issues: mot a baker, my first attempt other than biscuits, whixch turn out poorl-not John's recipe. aTortillas: He lsaus use a cast iron skillet, don'tahave one. So, aluminum skillet, electricstove top, heat too high and burdened with the vagaries of electric burners. And no tortilla press. So, very oddly shaped little things. Tasted fine. Some burn spots, my fault. Suggestion John. Try your recipe with an aluminum skillet, regular not heavy lduty. See what hlappens. And I really do like the recipe.j\n\nJohn's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenniferWhitten"
},
"reviewBody": "We LOVE these and cannot do store-bought any more thanks to this recipe! Totally worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bert D. Hammah"
},
"reviewBody": "Great recipe! Ill be using this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2BPawsitive"
},
"reviewBody": "Excellent followed the recipe exactly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doggfite"
},
"reviewBody": "Made them with lard instead of the shortening, and I adjusted it to end up with 600g of dough.\nEnded up with 12 lovely, 9 inch tortillas. This recipe has the best ratios of salt, fat and flour that I've made!\nHighly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Klein"
},
"reviewBody": "Delicious! I flattened the tortillas by hand; I will probably try with a rolling pin next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ahh_pooh"
},
"reviewBody": "was disappointed. tried it with my heated Tortilla maker, and in a hot pan. didn't have the fluffy home made tortilla I was looking for. even tried a thicker one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Smith"
},
"reviewBody": "nothing better than home made tortillas! this is a easy and tasty recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sam Derp"
},
"reviewBody": "Hard to hand roll the tortillas used a rolling pin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jersey Ross"
},
"reviewBody": "I followed the recipe exactly, but only 1-2 of my tortillas puffed up, and they all were very dense and not as light and airy as I had hoped. I'm going to try it again and see if I can better results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Kirchner"
},
"reviewBody": "very nice but i rolled them thinner......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Kotchan"
},
"reviewBody": "Great and easy recipe. I am not good at bread making, but these turned out nicely. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Trucano"
},
"reviewBody": "Very tasty. I would cut dough in 6 sections instead of 8 for a 6\" tortilla press. These came out a bit small. I would also add a bit more baking soda as ours did not \"bubble up\" . \n\nChef John's videos are so helpful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayko "
},
"reviewBody": "I made these for dinner tonight and they are delicious. I used lard instead of vegetable shortening. The recipe is easy to follow and the video is helpful so I recommend watching that first. My boyfriend says they're better than the store-bought raw ones we've been buying and cooking at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Cothran"
},
"reviewBody": "The only ones I make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISHA77"
},
"reviewBody": "I hit enter key too soon. I made this earlier. One problem is they’re kinda small. So I made 4 medium (almost large) tortillas. Next time I’ll double recipe to make more tortillas. Taste so awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "good grits"
},
"reviewBody": "Family loved this, I will make again when the weather cools some. Very hot stove work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arnold Chestnut"
},
"reviewBody": "I made these with corn flour...and substituted 1/4 cup with cornmeal....absolutely great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis"
},
"reviewBody": "Delicious, thanks chef!\n Living in Arizona I'm used to authentic tortillas from restaurants that make there own. Store bought aren't just less fresh, they are also different . Putting your dish on store bought tortillas is like putting a new Corvette on old, cheap dry tires.\n I like this recipe but I use lard instead of vegetable shortening (Believe it or not lard is so much healthier, the research is all over the place, check the facts).\n Oh and I learned the hard way, make them thin, thin, thin! I place the dough between one side of a gallon ziplock storage bag and a piece of aluminum foil. Then use a large soup pot to do the initial press and then a granite roller.This allows for a thinner tortilla than a tortilla press. I place the tortilla in the pan with the foil still stuck to it, when the tortilla is ready to flip, it will release the foil allowing you to peal it away easily.\n Make them a tiny bit thicker and you have the base for a very fast and easy flatbread pizza that everyone loves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Payton"
},
"reviewBody": "Delicious! I halved the recipe, and eyeballed the salt, baking powder, and shortening. Makes a delicious cracker! Yet the ones I rolled out thicker had the Mission brand thickness, aka were foldable, aka were a tortilla (yay). Btw a tortilla press is absolutely a necessity if you eat tortillas regularly, or some makeshift tortilla press. The rolling pin produces a lame tortilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corbson"
},
"reviewBody": "Tastes great the way it's written. Prefer to roll them out thin rather than use a press. These have an almost buttery flavor to them that's a hit in our household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Yellott"
},
"reviewBody": "I've made these 3 times now and they are a big hit in my house. I also made these once to fry them up as flour tortilla chips for the Super Bowl and they were very good and everyone loved them. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lalu"
},
"reviewBody": "So much better than store bought, and so easy to do!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Gilbert"
},
"reviewBody": "delicious, I used home rendered beef tallow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doug W"
},
"reviewBody": "When I cooked them as long as the recipe calls for the tortillas were over cooked and crispy, like quesadillas without the cheese. I shortened the cook time to 1 minute total (30 seconds each side) and they were perfect. Great flavor and texture with time adjustment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "Chef John does it again... big fan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wolfcook"
},
"reviewBody": "Best tortilla recipe we have tried! Most recipes, the tortilla is thick and more like flat bread, this is the first we have tried that it is genuinely like a tortilla. A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine West"
},
"reviewBody": "Yummmmm!!! I loved these! I followed the directions exactly and they turned out wonderful. I did not have a press, but plan on investing in one soon. These were incredibly easy and remind me of ones that were made for me as a kid. Make sure when you take them out of the skillet that you place them in something to keep them warm. Delicious! Thanks Chef John......another winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La Wera Díaz "
},
"reviewBody": "Perfect, in every part ! I love the fact you can use a press ! I've done them for years I was taught by my mother in law here in Yucatán and she uses an old clothes iron as a press ! This is awesome thanks !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Squidlette Tall"
},
"reviewBody": "they taste wonderful! when you roll out the dough i had no idea how thin to roll it and ended up making the first half to thick. i also had no vegetable shortening, so i mixed vegetable oil in when i mixed in the hot water, it worked out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Estrellaruiz99"
},
"reviewBody": "I really wouldn't make it again, It was just wrong I followed the recipe and steps exactly and it just wasn't good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "As long as you can get them rolled out thin, they turn out awesome! Easy to make and rather quick considering; they're a great choice in a pinch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NikkiNicolle"
},
"reviewBody": "I wanted to make tortillas and thought I had my usual tortilla flour, but when I checked the pantry I was out. I decided to try a recipe that used all-purpose flour instead. This recipe was perfect! They turned out even better than usual. This will definitely be how I make them from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janingrace"
},
"reviewBody": "Great recipe! I grew up on flour tortillas in New Mexico and the texture and flavor of these are right on. My only substitution based on other reviews is I used 3 Tbls on room temperature coconut oil. After resting 20 minutes they were a breeze to roll out and work with. Thanks Chef Ron."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scrumptious"
},
"reviewBody": "Great soft, chewy texture, and easier to roll out thin than some other recipes I've tried, which is super helpful. I do wish it had a bit more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Woz"
},
"reviewBody": "Best Ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "I just used applesauce in place of fat and we loved them. I can see us using these instead of buying them. They are very delicious and very easy. Another winner for healthier and easier meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOM"
},
"reviewBody": "I did not have shortening so I used margarine. They came out perfect. I will probably cut into 6 instead of 8 next time as I like a slightly larger tortilla. They are easier to make than I thought. Will never go back to store bought. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Wagner"
},
"reviewBody": "a little more oil is needed to have that perfect subtle foldable tortilla...\nBut otherwise perfect, simple recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margaret Bray"
},
"reviewBody": "I made these with gluten free flour. I had to use a little more water than the recipe calls for, and I don't knead dough in which I use my GF flour. My husband, who can eat whatever he wants, loves these even though they are GF. (It is my goal, in my culinary adventures, to not just make GF taste \"as good as,\" but \"better than\" glutinous versions of recipes.)\n\nThese are a quick, wonderful version that I can easily make in whichever flour I desire, and I really like these!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerry nerhuman"
},
"reviewBody": "loved it, like when i used to get from my spanish friends mom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Éclair Lin"
},
"reviewBody": "Ended up being too salty. Also a bit too dry when it was cooked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SilentzzTV"
},
"reviewBody": "These were great and were gone in an instant the only thing is make sure that you role the dough REALLY thin or else it most likely won't cook properly another thing that i have to say is that these tortillias don't fold very well for burritos or soft tacos"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Made these with whole wheat flour - sooo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "superrajraj"
},
"reviewBody": "I don't put a full 1/4 cup of shortening. If you like them less gummy and more flakey don't full the 1/4 cup. No need to change anything else. Great recipe. Fav by far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois Meza"
},
"reviewBody": "Oh, wow! These are delicious and easy. Even my picky (he calls it \"discerning\") husband loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vivee"
},
"reviewBody": "Awesome! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "Really easy, top notch taste. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "First time making homemade tortillas :) We loved these! I agree with those who said to cook on medium and they seriously do not take long at all (seconds per side). Mine came out full of bubble pockets and were delicious. I should have made a double batch. Thanks Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Tanner"
},
"reviewBody": "Really easy and quick to make! Make sure you roll or press them really thin, and watch as they can burn very quiv"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C L Noble"
},
"reviewBody": "I followed recipe exactly and love the result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Simple to make, light and oh so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarbFlowers"
},
"reviewBody": "Like ALL of Chef John's recipes, this is a winner. Made them lots of times and they are so very very good. Always have to make one with peanut butter &amp; jelly, just for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovehumour"
},
"reviewBody": "I've made these before and they are delightful. Today, I splurged on a tortilla press and made a batch of gluten free tortillas. Beyond trying to get the right consistency with the gf dough to make them thin enough, they were beautiful. My husband ate one without knowing it was gf and said how nice it was. I'll keep working on trying to make them thinner without falling apart. As always, thanks Chef John for your wonderful recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellingt"
},
"reviewBody": "This recipe is so easy to make. I did not have a tortilla press, so I used a rolling pin. It worked just as well. My family devours these before they even hit the table. Thanks Chef John for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SunSmiles"
},
"reviewBody": "Followed recipe, except I used butter instead of shortening. I boiled the water to make sure it was hot enough. Used a dry (no cooking oil) nonstick pan over medium high heat. Don't have a tortilla press. I rolled dough out by hand using a heavy jar. I placed dough in between two plastic bread bags beforehand so dough wouldn't stick to my jar while rolling. Came out perfect. Must watch closely or they'll burn. Doesn't take long to cook. Tastes amazing. Looked like the finished product in the video . Hubby and kids ate them all and wanted more. Don't expect these to be like store bought. They're not as pliable, but more like a flat bread. But, they taste so much better. I will be making these often.\n\n\n******Update******Made these again. After taking them out of the pan, I placed them on a plate and covered it with a lid from one of my pots. They remained covered for about 20 minutes, while I did other things. When I removed the lid, I was pleasantly surprised. They were still warm, but VERY bendable and even more soft. I could use them like burritos or wraps. I love them even more now!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/221902/chef-johns-flour-tortillas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15855/bread/quick-bread/tortillas/",
"name": "Tortilla Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/221902/chef-johns-flour-tortillas/",
"name": "Chef John&#39;s Flour Tortillas"
}
}
]
}
}
, "about": [
]
}
]