				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chef John&#39;s Spaghetti alla Carbonara"
,"datePublished": "2012-04-25T15:03:10.000-04:00"
,"dateModified": "2022-02-02T19:08:37.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Spaghetti alla carbonara in its authentic form: peppery, creamy without using cream, cheesy, and delicious."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/U4ZOjiZB3G3lQgON-EkimcReerU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2394708-1166854245f2448d96cb868bd4fe73d3.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1397919267001",
"description": "See how to make spaghetti with bacon and egg sauce!",
"duration": "PT6M5S",
"name": "Spaghetti alla Carbonara",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2986f6e6-017a-4749-b528-700c25226591/6399e95e-89fb-43b4-9c72-06f8a55255e8/1280x720/match/image.jpg",
"uploadDate": "2021-07-10T10:40:43.211-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chef John&#39;s Spaghetti alla Carbonara"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "267"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "688 kcal"
,"carbohydrateContent": "66 g"
,"cholesterolContent": "220 mg"
,"fiberContent": "3 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "984 mg"
,"sugarContent": "3 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"4 ounces guanciale, cut into 1/4-inch cubes",
"1 tablespoon olive oil",
"1 teaspoon ground black pepper, or to taste",
"2 eggs",
"3 tablespoons grated Parmigiano-Reggiano cheese",
"3 tablespoons grated Pecorino Romano cheese",
"1 teaspoon ground black pepper, or to taste",
"6 ounces spaghetti",
"1 cup reserved pasta water",
"3 tablespoons grated Parmigiano-Reggiano cheese",
"3 tablespoons grated Pecorino Romano cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cook guanciale with olive oil and 1 teaspoon ground black pepper in a Dutch oven over medium-low heat until almost crisp, about 5 minutes. Reduce heat to low."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, 3 tablespoons Parmigiano-Reggiano cheese, 3 tablespoons Pecorino Romano cheese, and 1 teaspoon ground black pepper in a bowl. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, 10 to 12 minutes. Drain, reserving 1 cup of the pasta water."
} ,{
"@type": "HowToStep"
,"text": "Pour reserved pasta water and drained spaghetti into the bacon-pepper mixture; stir to combine."
} ,{
"@type": "HowToStep"
,"text": "Slowly pour egg mixture into the pasta mixture; cook, stirring constantly until the egg mixture forms a thick sauce, 1 to 2 minutes. Remove from heat."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/U4ZOjiZB3G3lQgON-EkimcReerU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2394708-1166854245f2448d96cb868bd4fe73d3.jpg"
}
]
,"text": "Stir remaining 3 tablespoons Parmigiano-Reggiano cheese and 3 tablespoons Pecorino Romano cheese into the pasta mixture and serve."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacyanne"
},
"reviewBody": "This is an exceptional bowl of pasta. The creaminess that is created from the pasta water and egg is outstanding. It is hard to believe the there is no cream in this recipe. I think I should have tempered the eggs a little as they scrambled a bit but it didn't really matter after adding in the cheese. I don't think I \"kept it moving\" enough. I also used diced prosciutto which was very nice. I will definitely be making this again at the husband's assistance. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Azure"
},
"reviewBody": "Use guanciale or pancetta. Look for an Italian grocery store. Smoked bacon is too strong. Can use unsmoked. Agree with others that there's too much pasta. He calls for 3 oz dry but package directions are for 2 oz, a much more reasonable size. The pasta water helps the sauce to stick to the pasta, and in this case to make a creamy sauce. Use this tip for all pasta with sauce. It may be counterintuitive, but it works. If I put tomato sauce on pasta without the pasta water, I end up with water on the plate and that's not cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good to eat and easy to make. Just my style."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lasimon"
},
"reviewBody": "Next time, I would cut the amount of black pepper in half. Otherwise, it was a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RKB"
},
"reviewBody": "Warning: I did not make it exactly as written the first time (which annoys me). I was trying to get creative with some leftover pot roast that I had and was incredible the first time around; didn't want it to go to waste. Pasta Carbonara popped into my head so I started browsing the internet for ideas and recipes. Once a recipe from Allrecipes came up, I immediately started searching for one from Chef John. I've never made a bad dish using one of Chef John's recipes. This one didn't fail either. It was incredible. Had about 3/4 of a pound of beef so I doubled the recipe. I first browned up the pot roast to somewhat mimic the texture of guanciale. Didn't have spaghetti, but I did have some Italian-made Farfalle. Cooked it in a light chicken stock for extra flavor (a big spoonful of Maggi's chicken bouillon in the water). Tempered the egg/cheese mixture with about 1/3 cup of the pasta water. I didn't have anything other than parmesan, so that's what I used. For this amount of pasta, I just re-used the pasta pot so I didn't make a mess. Put the pasta back into the pot, added the meat, put in most of the water and slowly mixed in the egg/cheese mixture. Turned out so much better than I hoped it would. Made this for my sister and she said it was the best leftover meal she's ever eaten. Then she told me to put it in my Recipe/Cooking Notebook so I don't forget to do this next time I make pot roast. Thank you Chef John for another recipe that is forgiving and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenInKali"
},
"reviewBody": "I can't count how many times we have made this with some modifications depending on if we can find ingredients. In one month we actually made if 4 weekends in a row when we had guests and they all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "So first of all, the butcher sold me uncured pork belly, not pancetta. I had never bought it before and didn't know the difference until I actually cooked it: It just looks and tastes like cooked pork, not pancetta. Bummer! \n\nThe recipe itself was easy to follow and the end result tasty. I used regular Barilla pasta. The dish might've benefitted from just a little salt. It was extremely peppery, though I'm not complaining!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Novo"
},
"reviewBody": "Kids loved it and they love the tight wound ball presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Hfpsychologist"
},
"reviewBody": "I normally love all Chef John’s recipes, but didn’t care at all for this one. May have been the cheese?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whitemb"
},
"reviewBody": "so easy and so delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarsonBosley"
},
"reviewBody": "When I decided I was going to make this I bought enough cheese and pancetta to do it twice. my first attempt was without a food scale. I pretty evenly split the pancetta but had to guess on the spaghetti. I also eyeballed the pepper and when I finished realized I didn't do nearly enough. Everything else turned out pretty good t hth ough! I got the sauce just right, thought it felt like a bit too much and my pancetta was a bit underdone. My first rating would have been 4 stars. my second time around I made sure to cook the pancetta more, measured out the spaghetti(after weighingnitni discovered I liekly did less than 5 ounces the first time! I also made sure to measure out my black pepper. With the more cooked pancetta, and the correct amounts of pasta and pepper it was a million times better! Easy 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CookinLovin"
},
"reviewBody": "Neither hubby nor I were a big fan. We didn't hate it, but it's not something we'd eat again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Pretty good. I meant to add some sweet onions when cooking the bacon like another reviewer suggested but forgot as I made the bacon ahead of time. Doh! I also used chicken broth - using the pasta water but then adding some bullion to it. Since I forgot to sauté my onions, I added some chopped green just before serving but they were a bit strong and almost conflicted with the dish? Would have preferred the cooked, yellow better. Overall, we love Chef John recipes. While not my favorite, it was pretty good. Thank you CJ!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meldan111"
},
"reviewBody": "I've been making this since 1970 when I went back to Italy. They made this dish at the Hotel we were staying at.\nIts a bit different. \nUsing Pancetta is ideal. What's different is you whip 4 eggs with the Parmesan/ \nReggiano cheese/salt &amp; pepper. Place some pasta water with the pancetta, add drained pasta leaving on low heat. Keeping the low heat on, you place the egg mixture in and keep stirring until you see that the mixture is sticking to pasta and leaving in pot until you see it sticking and forming little curds of egg &amp; cheese goodness on pasta. Viola........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MuffinNinja"
},
"reviewBody": "I used leftover Easter ham (included some of the fat) instead of guanciale, and it was wonderful! Very easy to make, and very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irina Y Shumilova"
},
"reviewBody": "Chef John recipes always easy and as always enjoyable"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "willbullock"
},
"reviewBody": "I love this recipe Chef John! I found authentic Guanciale a while back and chopped it and froze several 8 ounce bags of it just for using with this meal! I use 8 ounces per meal and 1/2 a diced small/medium sweet onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAry Jane"
},
"reviewBody": "Simple and authentic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J “Pappy41” Piazzola"
},
"reviewBody": "Please people don’t tell me how you changed the recipe and still call it carbonara."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Bright"
},
"reviewBody": "A family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "agnolotti thompson"
},
"reviewBody": "This was excellent! Should it be 16 ounces of spaghetti instead of 6? Seems like a type-o."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULES2JEWELS"
},
"reviewBody": "Delish! I found guanciale but it was $40.00 a pound!!! I opted to Boars Head panceta which was already diced at $4.00 for 4 ozs. I increased the quantities, but other than that followed the recipe to the T."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Fuller"
},
"reviewBody": "First time making this dish, it was dry (my fault, should’ve added more water) and I forgot the black pepper at the end. But amazing still."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This was good. I doubled the recipe for 4 and started with 1 3/4 C pasta water which was still a bit too watery for me. Next time I’ll sauté an onion and 2 cloves of garlic with the pancetta. Also a bit too much pepper for us, would knock it back to 1 tsp. and then add as necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kimberly Hopkins"
},
"reviewBody": "I learned how to make Carbonara while in Europe. This was not it. I followed the instructions to the T. This was the most awful tasting Carbonara I have ever had. For individuals that learned how to make Carbonara while in Europe do not try this recipe. It also was more difficult than any recipes I have used to make Carbonara. It usually is a pretty quick throw together meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NettieO"
},
"reviewBody": "This was a very easy week night dinner for 2 . I had a stressful day and wanted comfort food. This hit the spot. AND it was really a 2 serving size so we didn't have leftovers or eat too much, so was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Moretti"
},
"reviewBody": "Delicioso!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DemeChef"
},
"reviewBody": "Be sure to make enough for everyone to have seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DKL"
},
"reviewBody": "Yummy and easy. I did ad minced garlic and cut up asparagus bites to the bacon after it was done cooking then followed directions the same the rest of the way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ashley Vorne"
},
"reviewBody": "This was probably the blandest carbonara I've ever had. Use milk instead of pasta water for an actual creamy sauce and cut back on the amount of liquid that you add so it's not so soup like. The bacon needs to be cooked with garlic or onion for flavor and it adds depth to the meal. A pinch of salt goes a long way too. So much wrong with this recipe I can't believe people are eating it like this. I was highly disappointed with the end result as this was the #1 recipe on the internet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pandamom"
},
"reviewBody": "Who knew that a dish so delicious could be so easy to make! I made it for 6 of us and prayed that the eggs would not scramble when I poured them into the pasta. Thank goodness it did not and instead I got this yummy, cheesy sauce - it was a hit! I used bacon instead of pancetta and it was a tiny bit too peppery for the kids, so next time I will use 1/2 the pepper and I used egg yolks only (per one of the suggestions)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Winn"
},
"reviewBody": "My dish look marvelous and tasty! Thanks, Chef John Besh.\n\n R. Winn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Dickie"
},
"reviewBody": "Chef John makes it very easy with his instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schmemmiller"
},
"reviewBody": "Super easy, ingredients are accessible, and it turned out really tasty. Only thing I did differently was add peas and double the amount of garlic and parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mona-Lisa Lauzé"
},
"reviewBody": "I rate it a 4 star, would be a 5 if I used fresh and not leftover pasta. My two boys gave it a 8 1/2 and 9 1/2 stars out of 10, did sauté a bit of onion too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey Cummings"
},
"reviewBody": "I was looking for a recipe that used spaghetti noodles, but no gluten, no garlic and minimal dairy. This was perfect and my guests loved it! I used gluten-free spaghetti and the carbonara sauce was tasty and well-bodied without any garlic. I added some ham in place of the pork called for and topped with basil. Thanks for the footnotes too; very helpful. This recipe is a definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherWho?"
},
"reviewBody": "This is the best Carbonara recipe I have ever made, and it's easy to make too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peep_jerky"
},
"reviewBody": "Turned out great! Very peppery. I followed the instructions in the recipe, the only difference is I added some chicken, mushrooms, and sliced green olives, so I added some cooking time. I cooked the bacon first, then set it aside and cooked the chicken and other stuff while the pasta cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "I used uncured bacon because that's what I had. Even with that, this was very good. I will find Pancetta next time and maybe back off on the pepper just a bit for my taste. Having said that, it was very, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zerys"
},
"reviewBody": "Just what I had hoped for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I will definitely make this again. I just used regular bacon, I would probably put less in though next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dacook"
},
"reviewBody": "I made it. Delicious. I added some chopped garlic , chopped shallott, and a dash of dried oregano and basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRISCO"
},
"reviewBody": "I made this recipe with what I had on hand, just bacon, bagged parmesan cheese. I have to admit I was a little intimidated about not accidentally scrambling the eggs, but I did it correctly. I did add some onion with bacon just because I half of one to use up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bill Sib"
},
"reviewBody": "way too much pepper it was all I could taste, I made it this time with smoked pork jowl. I made it once before with bacon and much less pepper it was really good. This time was actually hot from the pepper. I can eat pretty hot food, the overwhelming pepper taste killed it for me. Next time I'll use about 1/3 of the pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Howe"
},
"reviewBody": "This was a fantastic meal. I made some small adjustments: instead of guanciale, pancetta or bacon, I used smoked sausage. It came out real good. I didn't have the Peccorino-Reggiano cheese and used regular Parmesan cheese instead. The sauce came out a bit watery from leftover pasta water and didn't make it a bit. But I would make it again with the bacon and the Peccorino cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Glazier"
},
"reviewBody": "Very good and easy. I sautéed scallops with pancetta"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lucy"
},
"reviewBody": "Very tasty. The only thing I did different is just use the yolks. I always have leftovers to microwave for lunch. Without the white they don't get that scrambled egg texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jstcooking"
},
"reviewBody": "I wanted to use up some nice prosciutto that I had on hand, so I rendered that with some onion and garlic (as other reviewers suggested). I added reserved pasta water to the pan like chef John suggested, but I also whisked about a half cup of the pasta water in with the eggs &amp;cheese as another reviewer suggested. (It made sense to me to temper the eggs a bit to help avoid scrambling them in the final step). I then added the pasta to the sautéed ingredients &amp; slowly added the egg mixture. It was a little runny at first, but I kept stirring it over very low heat until the excess water evaporated. The results were fantastic! Very tasty, Chef John. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Enriquetta E"
},
"reviewBody": "Simple. Quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VWJen72"
},
"reviewBody": "I used bacon... (2 cups) with an entire box of Rotini noodles. \nSo upped the other ingredients accordingly.. then added whipping cream, white wine, onion, mushroom and of course garlic. I also used chicken broth instead of \"pasta water\"... \n\nMy fam said it was restaurant worthy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muboriz Amonbekov"
},
"reviewBody": "John, it came really good. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Brebner"
},
"reviewBody": "Amazing! I I sautéed the Pancetta, then added shallots, and near the end, garlic. everything else was the same (I used all Parmesan) I don't lick the pan that often. Totally making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David R Campbell"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Radl"
},
"reviewBody": "I have made this several times now and sometimes it would be perfect and other times it would be grainy. Looked as if there was curdled milk in it. Took me a few times to realize what it was. You CANNOT use the container of parmeson cheese. You know what one I mean, it's on the shelf around the jars of spaghetti. It doesn't melt. You must use fresh parm and fresh romano. When done right, this is delicious, fast and easy. Oh, and I also use bacon just because I ususally have it on hand. Sometimes I will wilt spinach into it. Nobody really even notices. Thanks Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "I made the recipe as is except I used bacon which turned out great. A real keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "This is one of those dishes I treat myself to when I crave comfort food. Rich creamy, eggy goodness with bacon no less!!! What's not to love. My wife is not as enamored with it as I am but it is awesome. I will tell you I actually use WAY more bacon and cheese that the original recipe and in my world....you can't use to much. I like to crisp up several extra strips and crumble it up right on top before I serve it........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "curlydoc"
},
"reviewBody": "Made it with fettuccine and smoked ham hock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hankus"
},
"reviewBody": "Exactly the way I make in my restaurant. Except I make my own spaghetti with Italian semolina flour which adds to the authentic carbonara"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joshua Abell"
},
"reviewBody": "I used Penne instead of spaget and I added peas for color. Delicious dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiffany"
},
"reviewBody": "We are a family of four so I doubled the recipe. Sautéed yellow onions in EVO first about 10 minutes then added frozen shredded chicken, seasoned with cracked pepper, then added jamón serrano, then pre cooked thick bacon from breakfast morning to make it more hearty for the hubby. I also boiled pasta in low sodium chicken broth and a bit of water. Added some salt to the chicken broth but not too much as the jamón and bacon is salty enough for our taste. I used the spaghetti pot to mix up the rest off the recipe and the egg and cheese mixture thickened up perfectly with the broth reserve. This was loved by my entire family which is a rarity. I will definitely be making this simple yet delicious dish again. Try it, you will not be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeannie"
},
"reviewBody": "Oh, boy! This recipe turned out great for me! I was going to add some onion and garlic to the bacon - yes, I used 2 strips of bacon - but got side-tracked. I did take another lady's suggestion to use only the egg yolks and a few Tblsps. of water to the egg and cheese mixture. Next time I'll try to add some onion and garlic. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kate O'Neill"
},
"reviewBody": "This was just “okay” as far as Chef John recipes go. First off - who on earth adds OIL to the pan to cook bacon (or guanciale)?! I did as advised and predictably wound up with several spoonfuls of oil and fat I had to trash before adding the pasta water. Yuck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tishprint"
},
"reviewBody": "First time...too dry, second time scrambled the egg mixture...next time it will be perfect. Also it really does need the pancetta, bacon is a sorry second."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Flare"
},
"reviewBody": "I enjoyed this meal. I had a half pound of guanciale left, so I doubled the recipe to keep the proportions the same. It turned out pretty good! The only change I made was to reduce the amount of pepper since I'm not a huge fan of pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen merino"
},
"reviewBody": "No changes will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lelena109"
},
"reviewBody": "Made in a pinch with bacon and half the amount of parmesan and reggiano. Can't wait to try with the full amount of cheese! \n\nUsed HALF the amount of pepper and it was peppery enough!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmdh"
},
"reviewBody": "Made this according to the recipe except added one large clove of minced garlic. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "londonlinn"
},
"reviewBody": "This was a great recipe. My grandkids and husband loved it. My granddaughter gave it 10,000 out of 10 as she says. Didn’t change a thing except added a little garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Rheuark Certuche"
},
"reviewBody": "It was a very nice meal and really quite frugal. My 6 year old granddaughter ate 5 helpings of it. I served it with asparagus. The perfect easy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fdmelcher"
},
"reviewBody": "No brainer 5 star. Easy and quick to make. Tastes amazing. Made exactly as specified."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Margaret Matthews"
},
"reviewBody": "Little dry for me added more pasta water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redhead"
},
"reviewBody": "Made this tonight. It was ok. I don’t know if it was the pepper or pecorino Romano but it tasted bitter to me. My family liked it tho. The consistency was perfect. I made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley W"
},
"reviewBody": "Chef John and all his fans, I apologize for what I did to this recipe, but I’m poor, and had to “make do”. Chef John is my favorite, but we’re going through a tough time and managing by using our freezer goods. I know there are others in my positions, soooo, here’s what I did...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Dallmann"
},
"reviewBody": "Great recipe. Loved it as written. Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherjh"
},
"reviewBody": "This is basically the way I've made this for years. My recipe was given to me by an Italian and has A LOT of black pepper in it, hence the name; as you said. I could never understand having those recipes with a little pepper in them. I've tried a few with that and the creamy sauce, and they are just not as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Gauerke"
},
"reviewBody": "It is good. I used prosciutto instead. Do not use salt. The salt in the pasta water and prosciutto and cheese is enough. Trust me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Palka"
},
"reviewBody": "This was so easy to make and wonderful flavor! After reading some reviews I did set aside a little bit of the pasta since some said it was too much. Glad I did. I also mixed the eggs and parmesan cheese together before adding to the pasta like one person recommended (thank you). Hit with the family. Never made before but I will again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia Ranger"
},
"reviewBody": "This was so good and quick and inexpensive. Made enough for 2 servings. I did make some changes. Used 6 slices thick sliced smoked bacon instead of guanciale. Added 1/4 cup diced sweet onions and 2 tbsp diced red bell pepper to the bacon. Didn't have romano or fresh parmesan so I used 1/4 cup grated parmesan. I also added a little milk for extra creaminess. At the end, I did constantly stir over low heat the entire pasta dish to make sure the egg was cooked enough (personal preference). Also only used one egg. Will definitely make again. Next time I'll try it with fresh parmesan and romano. Yummmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dion"
},
"reviewBody": "It tasted great, my kids loved it. I put a little too much cheese the first time but i would recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TyPapaya1"
},
"reviewBody": "This was so easy to make and I love that I didn't have to use cream or half &amp; half! Very flavorful and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gjmstarman"
},
"reviewBody": "This recipe is a very tasty and a great alternative to a red sauce. I did add some diced garlic and sliced mushrooms with the pancetta. This was the first time I tried this recipe and used caution with the black peppy by only using a very generous grind of fresh mixed pepper corns to the pancetta. I only added 3/4 of the cup of water to the sauce to get the consistency that I liked. I garnished each serving with an additional grid of fresh pepper corns, chopped fresh Italian parsley and good parma cheese. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Sanchez"
},
"reviewBody": "Made it according to the video recipe and it was DELICIOUS! I think I overcooked the pancetta a bit. Next time I will remove i from the heat a bit sooner, but I will definitely make it again. Such a fancy seeming dish, but very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GREG59"
},
"reviewBody": "This turned out to be a crowd favorite. I followed the recipe but I did add extra cheese and a touch of heavy cream to give it a finish. I got lots of compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jo Morris"
},
"reviewBody": "First time, I made exactly according to recipe. I was really nervous about sauce and wasn't perfect until I read review which beat eggs and cheese together and added a little hot pasta water and added to pasta mixture off heat. Wonderful. Since then, I've added bacon with onion and garlic softened in tiny amount of bacon drippings. Also green peas and Italian parsley for garnish. I'm now a hero to family and friends. THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Memphis Dad"
},
"reviewBody": "Very nice, simple, and I had most of the ingredients on hand. My only changes were to add some diced onions, and I used pancetta instead of bacon. I also used a little white wine to deglaze the pan after the pancetta and onions. I've never tried a Chef John recipe I didn't like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dooolay7"
},
"reviewBody": "Mix pasta water into egg mixture before adding it. Stir continuously while adding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Elle"
},
"reviewBody": "Loved this! Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DECAR48"
},
"reviewBody": "Very good. Happy to know how to make something so creamy without all the cream calories. Only suggestion I have is to serve it immediately because if it sits too long it gets very thick. Next time I serve it I will wait until after the salads are finished to mix the pasta with the mixture.\n."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Riley"
},
"reviewBody": "I added a bit of finely diced red bell pepper right before I put the pasta in the pan, and I had to use bacon. It was delicious, I definitely will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Wilson"
},
"reviewBody": "Yummy and easy. DH made it and followed the recipe using bacon. So good. Thank you Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Montana Girl"
},
"reviewBody": "Yum. I made this the other night for my husband, and his best friends. They think I'm a good cook (eh) so I don't really believe them when they rave, but that night I did. It turned out really well, even though I used regular bacon. I added chicken strips to the dish that I had floured and fried in bacon grease. Not the healthiest meal, but when I want to throw caution to the wind again, I'm making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Roesel"
},
"reviewBody": "This was exceptional and so easy. I substituted left over pork belly (Chef Johns recipe) and it really added a richness and flavor layer to the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly Figueroa"
},
"reviewBody": "I upped the portions to 6 but found out 2 tablespoons of pepper was way too much. The flavor was amazing otherwise. Will definitely make again.... with less pepper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "irishgirl371"
},
"reviewBody": "This did not turn out as I think it should have. It was tasteless , bland and perhaps too much pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosalba Saunders"
},
"reviewBody": "After having this pasta for the first time in Rome this summer, I was enamored with the flavors and had to try it myself. This recipe with video seemed to echo what I remember and so tried it. My husband and I were delighted with the results ! To replicate my first meal this is what I did differently: Since I couldn't find guanciale I used thick cut bacon. Make sure you use the leaner parts --and we used more than specified because we love bacon. I also added 1/4 cup chopped vidalia onion and 1/3 c baby bella mushrooms which I sauteed first and removed from pan...then added it to the bacon after bacon was cooked. The rest was exactly as Chef John's recipe and it was wonderful! Oh also used home-made linguine from our local Italian grocery store...which made it extra authentic...cooked al dente of course. Oh and if you want a little extra sauce, maybe add a little more spaghetti water. Very creamy without cream. Not difficult to make....it's just all in the timing. It had the amazing taste just like the little local Italian restaurant we ate at in Rome. Bon appetit !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "This was my first time making Spaghetti alla Carbonara. It helped to view the video beforehand, also to read the reviews. I made it as per the recipe except I added a handful of finely chopped kale. I also tempered the eggs with a little of the pasta water, but I don't think that was really necessary. Easy to make and delicious. My husband particularly liked it - he told me that black pepper helps to reduce triglycerides. Wow - yummy and healthy too!\nUPDATE: Made this again and added small cauliflower florets and 1/4 cup diced tomato. Even more healthy, and again, yummy. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaddyCakes"
},
"reviewBody": "Love, Love, Love! Tonight I only had medium eggs so I just added an extra yolk and it came out terrific! I also only use Pecorino Romano (Locatelli) as it's my favorite and pancetta as that's all I can find in my neck of the woods. Everyone loves it. It's a go-to recipe in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kghmama"
},
"reviewBody": "This is amazing! I had to use bacon which was still fantastic, and I added a little diced onion in with that. Also added a bit of fresh oregano and basil at the end. I suggest doubling the recipe, it is so good you are going to want to eat all of this yourself"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Howard"
},
"reviewBody": "I made this as called for and as I was put the cup of reserved water in I new it was going to be too much. I read the comments and haven't seen any other complaints but mine came out too watery. I will try using the full 12 ounces of Spaghetti next time or adding the water as I mix the egg mixture in. Didn't have the flavor issue some others had at all."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/221971/chef-johns-spaghetti-alla-carbonara/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17540/main-dish/pasta/pasta-carbonara/",
"name": "Pasta Carbonara Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/221971/chef-johns-spaghetti-alla-carbonara/",
"name": "Chef John&#39;s Spaghetti alla Carbonara"
}
}
]
}
}
, "about": [
]
}
]