				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cherry Angel Food Cake"
,"datePublished": "2020-06-18T23:06:37.000-04:00"
,"dateModified": "2023-03-10T08:10:33.214-05:00"
,"author": [
{"@type": "Person"
,"name": "Traci Poole"
,"url": "https://www.allrecipes.com/cook/24328999"
}
]
,"description": "The traditional angel food cake with a new twist - cherries!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GsIZhSNN7vWxwksGVRmwv-EXu30=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/575330-a2a00e3350b44d0eb0bbc8a1237d812d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cherry Angel Food Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "28"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "143 kcal"
,"carbohydrateContent": "33 g"
,"fiberContent": "0 g"
,"proteinContent": "3 g"
,"sodiumContent": "83 mg"
,"sugarContent": "21 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
, "recipeCategory": ["Cake"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"1 cup sifted cake flour",
"1 cup egg whites",
"1 teaspoon cream of tartar",
"0.25 teaspoon salt",
"1.25 cups white sugar",
"0.75 teaspoon vanilla extract",
"0.25 teaspoon almond extract",
"0.33300000429153 cup maraschino cherries, drained and sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Sift flour three times."
} ,{
"@type": "HowToStep"
,"text": "Beat egg whites, cream of tartar, and salt in a large glass or metal mixing bowl until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Blend in vanilla and almond extract."
} ,{
"@type": "HowToStep"
,"text": "Fold sifted flour into egg white mixture until no streaks remain. Pour 1/2 of the batter into a clean, dry 10-inch tube pan, and arrange 1/2 of the cherries overtop. Repeat once more."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 50 minutes. Cool cake in the pan, inverted onto a wire rack, empty wine bottle, or thin-necked glass bottle; this will prevent the cake from sinking."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "francinejacobson145"
},
"reviewBody": "I will never believe the ones that says they made it--- Oh Yes you took 10 egg whites? too bad!! it is not true--- Why don't take a box of angel cake??? I did it with it-- Good idea for the cherries and almond flavor--"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caron"
},
"reviewBody": "Looks great will try soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I love angel food cake and really enjoyed this one. I added the cherries after cutting them very small and getting as much of the liquid out as I could. The cake didn't rise as much as expected but the tast was very good. I will make this again. Next time I want to try making a Maraschino cherry drizzle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Moki Smudgemuffin"
},
"reviewBody": "I came across this recipe when I was looking for a way to use an angel food cake mix I had purchased from Aldi. I happened to have a partial jar of maraschino cherries, and I thought this would be a good way to use them up . After reading the reviews I decided to add more cherries to the recipe. I think I added almost a cup. It made a beautiful cake. It rose several inches up out of the pan, was dark brown, deeply cracked, and appeared to be dry. However, while it was upside down, cooling, the cake fell out of the pan in several big chunks. Inside it was rather damp. I can't comment on the actual cake recipe here, but I did want to caution people using it that I think you can add too many cherries. It's probably a good idea to make sure that your cherries are patted or spun dry, so as to not contribute too much moisture to the mix, and to be careful about adding too many, because it may make the cake so heavy it can't stay in the pan to cool like it should. If you have extra cherries, they might make a good topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Garcia"
},
"reviewBody": "If you use carton egg whites, then add twice the amount of cream of tartar. I didn’t add cherries, instead I took lychee juice (which is already sweet, so don’t add sugar to it) and brushed all of the sides (top, bottom, edges) to give a light flavor! Be generous with the brush, but don’t drench the cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jayme"
},
"reviewBody": "I was reading others peoples review. A lot of people said it fell. Use cake flour it won’t stay formed with all purpose. also MAKE SURE YOU BEAT TIL IT PEAKS before moving on to the next step not only does that make a difference but it will give it that sponge texture it needs. Also hang it upside down in your pan while it cools (make sure you don’t grease or flour your pan or when you do that step it will break)that step is in the last of the steps and it will make the cake not fall and make a big difference in the over all appearance of the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Jaskowiec"
},
"reviewBody": "The flavor was fine, but it did not rise. I followed the recipe to the letter. I am reluctant to try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shazam"
},
"reviewBody": "Oh my gosh....!! I had made a yellow cake for a co-workers birthday and had a bunch of egg whites left over... Found this recipe that called for just the amount of egg whites I had (most angel food cakes call for much more..) Didn't have cherries so I used sliced strawberries as another reviewer did. Also didn't have cake flour so I removed 2 Tbl of AP flour and replaced with 2 Tbl corn starch. Wow! Usually my family is bummed when I have a co-worker with a birthday because they miss out on one of Mom's cakes - but this time, I think they scored the better end of the bargain! This is light, tasty - wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valentinesdaybaby"
},
"reviewBody": "Very tasty, I added extra cherries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gypsy_Songbird"
},
"reviewBody": "Made w/out the cherries, and it turned out yummy. I made a balsamic strawberry sauce for the top. I do wish it would have been a little fluffier, but overall it's a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lele"
},
"reviewBody": "I didn't use any cream of tarter and used regular flour instead (just because I didn't have cake flour) and it turned out excellent. I also added fresh strawberrys instead, about 8-10 med sized chopped up into very small piece and spinkle some sugar on them and then folded them into the cake mix. My toddlers loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "This cake was delicious. It is not as light and fluffy as other angel food cakes, because there are not as many egg whites in it, but still really good. I folded my cherries into the batter carefully. I will use more cherries next time. I served this topped with Cool Whip-this one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomZilla (Evin)"
},
"reviewBody": "Insane! My honey is on a diet and asked me to NEVER make this again. He can't stop eating it! I topped it with homemade whipped cream that I flavored with a little almond extract. PERFECT compliment. Next time (I don't care what he says, there WILL be a next time) I won't make the whipped cream as sweet, since the cake itself is VERY sweet. I folded in the cherries rather than \"placing\" them. Soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHARLOTTE "
},
"reviewBody": "I have never made an angel food cake in my life because I thought they would be too difficult. This was delicious. I took it to a church function and it was gone in ten minutes. I am going to try this with different fruit. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Joy"
},
"reviewBody": "My first attempt at angel food cake, I used all-pupose flour so that was probably the problem but it didn't even attempt to raise a little bit. My friends didn't know that it was supposed to be twice as high though and all raved about it, very tasty and I'm excited to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Steel"
},
"reviewBody": "this would have been an amazing cake. but it didnt rise as much as it should have. even though i had it in the oven for an hour :/ it was still good. just a little too condensed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHARON B."
},
"reviewBody": "Delicious! I don't know if mine turned out just as it \"should\", it was not real tall and fluffy. It didn't end up filling up the pan, but it had GREAT flavor. I iced it with whipped cream, sweetened with powdered sugar and flavored with vanilla and some chopped cherries. I later compared the recipe to the one in my Betty Crocker book and noted that there are less eggs in this recipe among other things, which might explain why it wasn't real tall and fluffy. I will try it again for another occasion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "K_HUFF"
},
"reviewBody": "This tasted great. We had it with some ice cream and brandied cherry topping. However, it fell a little, and wasn't as light as I had hoped. I will try again, though. Overall a great recipe and really simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lila D"
},
"reviewBody": "Delicious and beautiful! I made it for a small get together and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ELWOH"
},
"reviewBody": "YUMMY! This cake was so easy and made a perfect light dessert. I served this to my in-laws and received high praise. My father-in-law went back for seconds. I actually added more cherries than the recipe called for, and I folded them in (as suggested in another review). A few pieces did end up with more cherries than others because I folded rather than placed them, but this was not a problem for those who got those pieces. My husband suggested that I add even more cherries. This was absolutely delicious. Thanks for sharing, Traci!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMS1115"
},
"reviewBody": "this cake turned out great! i didn't have cream of tartar and used self-rising flour but this was not a problem. i will add more cherries next time (maybe fresh ones) and fold them in rather than just laying them on the batter. i think i will only add 1 C. sugar next time too, but all in all 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i made it for a girlfriend at work and it was a smash"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25981/cherry-angel-food-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
"name": "Cherry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25981/cherry-angel-food-cake/",
"name": "Cherry Angel Food Cake"
}
}
]
}
}
, "about": [
]
}
]