				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Tetrazzini for a Crowd"
,"datePublished": "1999-04-30T21:45:07.000-04:00"
,"dateModified": "2022-08-02T14:53:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lois Shaw"
,"url": "https://www.allrecipes.com/cook/24325918"
}
]
,"description": "A few conveniences make it so easy to prepare this popular chicken and pasta dish with creamy mushroom-Cheddar cheese sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6c6Q75Q8052YrCj5FCR73bxDOCw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7106963-b6a2515a4f5e499e867e778f6cb734b9.jpg",
"height": 1126,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Tetrazzini for a Crowd"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "306"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "279 kcal"
,"carbohydrateContent": "21 g"
,"cholesterolContent": "49 mg"
,"fiberContent": "1 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "506 mg"
,"sugarContent": "2 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 pound spaghetti, broken into pieces",
"3 (10.75 ounce) cans condensed cream of mushroom soup",
"12 ounces shredded Cheddar cheese",
"6 cups shredded boiled chicken breast meat",
"1 pound sauteed mushrooms",
"1 (4 ounce) jar sliced pimento peppers, drained",
"2 cups reserved chicken broth" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of salted water to a boil. Add uncooked spaghetti (broken into thirds) to the pot and cook for 8 to 10 minutes or until al dente. Drain and set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large saucepan, heat soup over low heat. Add shredded cheese (reserve some for topping) and stir together. Then add the cooked shredded chicken, mushrooms, pimento peppers and cooked spaghetti and stir all together. Add enough of the reserved broth to make it &#39;sloppy&#39; and mix all together."
} ,{
"@type": "HowToStep"
,"text": "Pour mixture into a 9x13 inch baking dish. Sprinkle reserved shredded cheese on top and bake in the preheated oven for 25 to 35 minutes or until bubbly."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Brown"
},
"reviewBody": "Delicious - now, to indicate what I added to the basic recipe: HALVED the recipe (it still filled a 9 x 13 pan), 2 cans of soup - one of cream of mushroom, one of Cheddar cheese soup (Campbells); used the entire 12 ounces (three cups) of cheddar cheese and the entire six cups of rotisserie chicken chopped; 1 can mushroom pieces - used the liquid from the mushrooms and added water to make 1 cup liquid to which I added 1 Tablespoon chicken boullion; and - to use up my vegetables in the fridge, I sauteed a small white onion, 1 teaspoon of dried garlic, 3 stalks celery diced, 6 small carrots diced , 6 pea pods- I had no pimento peppers so I chopped 1 small red pepper and 1 small yellow pepper which I sauteed along with the rest of the vegetables. Lovely! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef_Dad"
},
"reviewBody": "I made a double recipe for a church meal. It went over VERY well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paige"
},
"reviewBody": "OK this is fantastic ! I used 2 rotisserie chickens, deboned and boiled off /cooked down the carcasses w/ some extra chicken bouillion for the broth . Forgot the pimento, so I added some frozen chopped red/green pepper onion blend to the mushrooms. I used the 2 cans of mushroom and 1 can of chicken soup idea, added extra broth and parmesan cheese. THIS IS such a FABULOUS family meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charly"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nichole Cook"
},
"reviewBody": "I for got to put in the mushroom's and the peppers added broccoli"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonnisaysmangia"
},
"reviewBody": "used 1 can each cream of chicken, cream of mushroom, and cheddar cheese soups; thighs, not breasts...like others, used fresh mushrooms, sautéed with roasted red peppers and garlic. my family raved. granddaughter ate 2 helpings and she hates mushrooms. my son and his roommates devoured 2nd pan. finally! a meal that everyone likes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Alexander"
},
"reviewBody": "Turned out really yummy! I added some sautéed celery and onions, mixed in all the cheese and topped with crushed Ritz crackers. It was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blessed3"
},
"reviewBody": "Awesome recipe spiced it up some but used the main ingredients listed my family loved it!!!!! Forgot to take the pic before they started eating so only could post what was left in the pan lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GG"
},
"reviewBody": "Let out extra mushrooms. Added extreme"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanice SistaSoulja Prater"
},
"reviewBody": "It is wonderful although I added cream of celery, cream of chicken, a little garlic salt and cayenne pepper for spice!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Foil"
},
"reviewBody": "Scrumptious! Ive made this recipe as written many times. My family loves it. I love how easy it is and having enough for everyone plus leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg138"
},
"reviewBody": "I've made this recipe so many times. It's always turned out well, although I don't add the pimiento peppers, I don't care for them. It's super easy, feeds a crowd, is delicious and an easy reheat for leftovers, if there are any. The chicken/turkey can be already cooked, just cut it into bite sized pieces and heat up with the mushrooms. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kabrina Orchard"
},
"reviewBody": "It had a good texture but the flavor was a bit boring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marylouise1"
},
"reviewBody": "I made this recipe exactly as it was written ... my family liked it, I thought it was ok. What I didn't like was it was salty from the 3 cans of condensed soups. Next time I will add some onions along with more fresh mushrooms and make my own cream sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Hannah Williams"
},
"reviewBody": "This was very bland. I think it needed onions, salt and pepper, and perhaps a dash of italian seasoning. Disappointed. As my husband used to say, “It’s not that good but there’s a lot of it”!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivy Carter"
},
"reviewBody": "We make this for people everytime we have a big group come over, or if we can't think of anything to do with some canned chicken. We make this with freshly grown hot peppers instead of pimento peppers, and skip the mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maxylicious"
},
"reviewBody": "Used 1 can of family sized healthy mushroom soup ~26oz &amp; 1 can of chicken broth ~14oz. Measured out 12oz from 1 bag of cheddar and 1 bag of mozzarella cheese. Used 2 lbs of pre-seasoned garlic &amp; herb chicken from Walmart which I cubed and sauteed. Only used 1 8oz package of mushrooms. Diced, sauteed &amp; added 2 medium yellow onions and 2 large sweet red peppers. No additional seasonings were added. Very yummy, will make again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chriscrooke"
},
"reviewBody": "I doubled the recipe and added, chili peppers and made the soup base.\nInstead of commercial soup, I added 1 cup dry milk, 1/2c. Corn starch, 1 tab. Italian seasoning, 2 tsp salt 2 1/4 cups broth in which the chicken was boiled. Dissolved all in a pan, then followed the recipe. I did not add cheese to the mix only topped the dish with the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Automm Lombardo"
},
"reviewBody": "This recipe is very tasty! I substituted spaghetti squash for the pasta to make it more healthy. For a 13x9 casserole pan I multiplied the recipe by 2/3. Didn't have pimento peppers so I just used green pepper and it was still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CW"
},
"reviewBody": "Great recipe! No complaints from the adults or children. I only modified a little: seasoned chicken, added spinach, and chives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rosenicole"
},
"reviewBody": "Very bland when made as written. Bonus is it makes A LOT. Second time around I added a couple of tablespoons of Worcestershire sauce and about a teaspoon of seasoned salt to the sauce plus some broccoli florets w the chicken. Much improved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DKoppy"
},
"reviewBody": "I halved the recipe, using their portion size calculator. Instead of using 1 1/2 cans of soup, I used 1 can and 1/2 can of milk to thin it out a little. I did not use any chicken broth. I also sautéed red pepper with my mushrooms. I used them to replace the pimentos. I think they added a lot of flavor that you don't get with pimentos. This was delicious, my fiancé went back for seconds and asked me to add it to my recipe box. I disagree with the portion numbers. There is no way that the amount I made would have fed 10 people, I would say 4, maybe 5 at the most. Will be adding this to the rotation, so easy and fast. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JohnnyB"
},
"reviewBody": "Followed recipe fairly close. Put a couple of different types of shredded cheese. Used cream of celery and cream of mushroom. Sautéed minced garlic w mushrooms. Sprinkled kraft parmigiana on top w shredded to help it crust-up a bit. We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb10"
},
"reviewBody": "I took the various feedbacks from reviewers and my own experience from making similar casseroles to make this a great meal. I used two cans cream of mushroom and one can cream of celery. I cooked boneless breasts of chicken (about 2 lbs) in boiling water (enough water to cover breasts) for 25 minutes and checked to be sure chicken was cooked through - no pink - then removed chicken from pot and cool slightly (15 mins) and then took a fork and shredded the chicken). I browned the mushrooms along with a finely chopped small onion and 3 cloves garlic in a small bit of olive oil (add the garlic last minute of browning so it doesn't get bitter). I put 1 cup of shredded cheddar cheese into hot soup and used the second cup of cheese to top the dish before baking. I also added about 1/2 cup bread crumbs to the topping of the casserole before baking for a little extra texture and flavor. Also added generous amount of salt to pasta water and added salt and pepper to entire mixture for the right amount of seasoning and flavor. Result was really delicious. Makes a big amount but easy to split into two casseroles and freeze one for the future. One other note: be sure to cook the casserole until nice and hot - for me was more like 40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AkilahandtheB"
},
"reviewBody": "Left out pimento peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Snyder"
},
"reviewBody": "I made it! ?? Except I used leftover turkey in place of chicken. I also left out the pimento but added celery and onion. It was quite rich but had a great flavor. Next time I'll also cut back on the cheese. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VJDUNHAM"
},
"reviewBody": "I did not have cream of soup, so I made my own. The problem I had was deciding how much reserved broth to make it \"sloppy\". I used probably one cup of broth when I needed the second cup. The sauce got absorbed and was a little dry for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Kokot"
},
"reviewBody": "I cooked the chicken (breast and thigh meat) in chicken broth and added garlic and onion powder, salt, and lemon pepper seasoning. After the chicken was done, I pulled it out and put my whole grain pasta in. I had some really good chicken broth that I'll use later for another recipe. \nI'm not a mushroom fan, so I didn't add the mushrooms, but to the mushroom soup mixture, I stirred in some thawed vegetables (the corn, bean, carrot mix...small pieces), let that cook the veggies a bit, adding broth little by little, then adding in the cooked pasta, and ended up w/that \"sloppy\" mixture. \nEveryone loved it! Even my picky daughter. I'm catering a Senior Citz dinner in a few days and making this for 25...hoping for the same results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Fadehere"
},
"reviewBody": "Very good but lacking in a little flavor. Spinkled Cholula hot sauce on it and made it perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie S"
},
"reviewBody": "Very good but followed the recommended changes. Cut recipe in half. Sauted mushrooms, onion and red pepper before adding chicken. Also added fresh english pea's, garlic powder and a bit of mixed grated italian cheese. I didn't have any chicken broth so I added white wine and water along with a bit of chicken boulion. My hubby and I both enjoyed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LupeRonnie Ruttiger"
},
"reviewBody": "So simple, so delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "UHcougar"
},
"reviewBody": "Very good! I used only two cans on soup, one cream of chicken and one cream of celery. I omitted the mushrooms and used Kraft triple cheddar for the cheese. Would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah "
},
"reviewBody": "Made this for Father's Day for about 10 people. It was a huge hit. Even 99 year old Uncle Gene asked for seconds. Used half cheddar and half shredded parmesan cheese. Added salt and white pepper. Sautéed onion in with the mushrooms and added petite frozen peas right before scooping into baking dish. Made a nice presentation with plenty left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Richey"
},
"reviewBody": "Super easy!! Use rotisserie chicken to save time! We did not use all the pasta about 3/4 lb and found it still maybe too much. I skipped the mushrooms and added in mix medley of veggies. Also used cream of celery soup and cream of mushroom and used a total of 4 cans as I found it too dry with just 3 but probably because I added the veggies. It's also easy to make a day ahead and wait to heat until the next day and great to freeze the leftovers. Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dfbailey"
},
"reviewBody": "I added a lot more pimentos and added 1/2 cup of pesto in the sauce. Turned out great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Hanevold"
},
"reviewBody": "Very good, i added my own seasonings so it wasn't bland. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wingnut McGee"
},
"reviewBody": "It needs something. Simple to make, but not very exciting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "minaayindra"
},
"reviewBody": "This was outstanding! I couldn't have been more surprised at what an easy and wonderful dish this was, that pleased every single member of my picky family. I made a few changes specific to our taste (we aren't mushroom lovers) but I'm sure the original instructions are super for those who enjoy them. I used 1 can of cream of chicken, 1 can of cream of celery, and 1 can of cream of onion (instead of the cream of mushroom soup). I did not add in any mushrooms and I cut the amount of chicken in half. We don't need a lot of meat and it's far cheaper that way... I also used condensed chicken broth as opposed to the water I boiled the chicken in. Fabulous, easy, and an all-time winner in my books!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ"
},
"reviewBody": "Made this and it was very good. I wouldn't change anything. Made 1/2 the recipe and it was good for 6 people. Don't know why it was posted for 20."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni Bauer"
},
"reviewBody": "Added corn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy Kitty"
},
"reviewBody": "We loved this! I forgot the pimentos while shopping so I added some peas. I sauteed onions with the mushrooms and added garlic powder, s/p. I halved the recipe and used just one can of mushroom soup. I also used jack and cheddar cheese. No need to dirty another pot to heat up the soup and cheese. Just dump everything in the skillet with the mushrooms and stir it up. We really enjoyed this dish. Served some biscuits on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Ortega"
},
"reviewBody": "I decided to try this recipe because my husband, who was in the Army, and overseas for 2 years, said his favorite MRE was chicken tetrazzine. He loved this recipe and said it took him back to those days. I am glad I found this recipe for him. This was so good and were even better when we ate them for leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Denny"
},
"reviewBody": "mom used to make this recipe when I was growing up definitely one of my favorite recipes happy I have found it on here without having to ask mom for it looking forward to trying it myself it's great to have a little slice of home when living away from home"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnaCate's personal chef"
},
"reviewBody": "Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janis P"
},
"reviewBody": "This is a very good recipe and the quantity is just right for entertaining a dozen people. It freezes well too so if you have a lot of turkey, make a lot and just freeze the rest. I omitted the pimientos and sliced mushrooms as I didn't have any on hand but added broccoli florets. Easy recipe and you can really add anything you want!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Im_hungry"
},
"reviewBody": "I have made this several times. It's scrumptious! This is great for using left over chicken or turkey. I use red bell pepper instead of pimento. This recipe freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephy"
},
"reviewBody": "Easy and tasty. I would season the mushrooms because even though the sauce is there, they were not that flavorful. I omitted the chicken broth and baked as is, great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Very popular with the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ncbater"
},
"reviewBody": "Followed some suggestions of 1 can cream of mushroom soup, 1 can cream of celery, 1 can chicken broth with a little Frank's mixed with Worcestershire sauce. Cooked over medium. Mixed in cubed turkey breast, mushrooms and garlic. Threw frozen peas in the pasta water the last 2 minutes and drained. Pour in greased pan. OMG"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherryf7"
},
"reviewBody": "Very hearty! I used a jar of roasted red peppers. They were less expensive. We ate loads of this casserole! 5 stars from us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "macabi"
},
"reviewBody": "I plan to make this dish soon. It looks delicious! My question is this....I plan on freezing it so should I freeze it unbaked, bake it without the cheese, or bake it as is and freeze it?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Lynd"
},
"reviewBody": "This was really good, and super cheap to make! I sautéed the mushrooms in some butter, then added in the soup and other ingredients to cut down on the dishes I used. Since I thought it looked like there were peas in it in the picture, I added some peas, which was really good. I'll definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "Wonderful comfort food. I modified slightly....We enjoy spicy food so I used Swiss and pepper jack cheese. I topped it with Panko crumbs drizzled with butter. Very good. Husband loved it even as leftovers. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "The time it took to put this together and the finished product, were both amazing. I didn't veer far from the original recipe and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristysayshowdy"
},
"reviewBody": "I loved this but did make a few changes...used roasted red peppers and a green pepper instead of pimentos. Also used onion and garlic when sautéing the mushrooms. Plus I substituted one can of cream of mushroom soup with cream of chicken. Family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nikkibee51570"
},
"reviewBody": "I made this for a potluck at my children's school. It was hit!!! Some families took some home. I bought some home as well and my husband tried it and he said it was better than his mothers!!! I had to pat myself on the back for this one. Will definitely make this again for the family!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mddsouza84"
},
"reviewBody": "This is a great dish for a crowd. It can easily be enough enough for two casserole dishes. We ate one and froze the other. The only thing for my family is that we thought it needed more spice, although some people might prefer it without the extra spice. We added Tony Chacheres, some cayene pepper and green chilies. If adding Tony Chacheres, less salt is needed, (if any salt)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate V"
},
"reviewBody": "I really liked this recipe and so did my husband, which was miraculous since he usually doesn't like anything with white meat in it.\n\nI did add some sautéed onion (1 small medium yellow onion) to it, and since several reviewers said spice was needed I added about 1 tsp summer savory and dashes of nutmeg and beau monde. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janie Guice"
},
"reviewBody": "Very bland though I used fresh roasted turkey breast meat, fresh mushrooms and followed the recipe carefully adding the full 12 oz. of chicken broth. I was embarrassed that I'd prepared it as my only main dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammi"
},
"reviewBody": "My family liked it, but I would changes to it. It was very dry. I would add more veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Thompson"
},
"reviewBody": "Oh, boy! Is this good or what? I left out the pimentos as I didn't have any. It would have been nice to have the color though. I scaled it down for 4 people, just used less of the ingredients. The pimentos would be required if making this for a crowd, as an eye pleaser. It would be nice to sub cream or milk for the chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idontsurf1"
},
"reviewBody": "yum yum yum. i added a red onion, used cream of chicken cause i don't like co mushroom. and I used egg noodles instead of spaghetti. i added mustard and worchester sauce as well. very easy to make and quite tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jelly"
},
"reviewBody": "We tried to duplicate my mother-in-laws recipe with this one. I was expecting something different. If I had never tasted hers it would be fine. I will try some of the suggestions next time,more cheese perhaps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kara Douglas"
},
"reviewBody": "I did not care for this recipe. I made this with high hopes but the dish had zero flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "This is a great recipe. Made it for a holiday get together and one of my parents friends, who is a very picky eater, devoured two large helping and kept raving how good it was. Kids from 3 on up ate their fair share too. I made it just as the recipe calls but want to add water chestnuts next time, per my 23 yr olds suggestion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Agrimson"
},
"reviewBody": "SO delicious! I forgot the broth and it still turned out great. Very creamy and the pimento peppers truly made the dish! I did add garlic. Even my (VERY PICKY and I mean very picky) son ate this dish. Can't wait to eat the leftovers tomorrow night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen K. Jones"
},
"reviewBody": "I've tried this recipe but with a few added ingredients... I saute chopped onions and bell peppers in butter and add to the soup and cheese mixture. And to give it that added pop I add a can of original Rotel. If you like it with more spice use the extra hot Rotel. Rotisserie chicken from your local grocery store not only taste good but it cuts down on the prep time... Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bethm"
},
"reviewBody": "I made this dish in hopes of getting back the flavor of a favorite dish of a family I used to babysit for. She made this dish often when I had the kids for dinner and I loved it. This recipe was disappointing, too bland for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keekey"
},
"reviewBody": "this is a great meal I fixed it for one of our family gatherings it was a crowd pleaser"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjk527"
},
"reviewBody": "My kids are very picky eaters and they loved it. They ask for it all the time. I used roasted red peppers because I didn't have piementos and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kinz"
},
"reviewBody": "Very good! Fed the troops and they loved it. Can't wait until tomorrow so I can warm up the left-overs while we all watch football."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Curtis"
},
"reviewBody": "LOVED IT!! Even the picky eaters...didn't have pimento used bell pepper and onion instead. Ran out of cream of chicken used some mayo still turned out great...oh and used tuna instead of chicken lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ben Ridenour"
},
"reviewBody": "Not sure why it's 'for a crowd', it makes 1[one] 9x13 casserole. It's ok. It needs something &amp; spice. [at least black pepper] ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAYDEEBUG"
},
"reviewBody": "I would make this again! it makes a TON though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Marquis"
},
"reviewBody": "My family loved this! Like some others suggested, I also sauteed onion, garlic and green pepper with the mushrooms. I also simmered it in sherry and it gave the veg a lovely flavour!\nDefinitely a make-again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kentucky"
},
"reviewBody": "This is really easy, and people always eat it up. I use Rotisserie chicken, add fresh mushrooms and also an onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarahtea"
},
"reviewBody": "Delicious! Just what I expect from Tetrazzini! I think it would be good as listed, but I was trying to replicate a specific meal I had eaten before, so I made some changes. \n\nI sauteed some extra veggies with the mushrooms: 1/2 an onion, chopped, 4 mini sweet peppers (equivalent of 1/2 an orange bell pepper), chopped; and about a cup and a half of celery, sliced. I used one can each of cream of: celery, chicken, and mushroom soups. And for the chicken, I used all of the meat I could glean from a Store-Bought Rotisserie Chicken. (Mine was plain chicken, from Whole Foods. Most other stores season theirs). \n\nWith those additions, this needed a loaf pan in addition to the 9 by 13 pan. I baked both at once, and it was done within the time range listed on the original recipe. I definitely plan to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HESSELMJ"
},
"reviewBody": "I have made this recipe as is for years (except that I make 1/3 the serving for my family of 5). My children LOVE it. We generously sprinkle lemon pepper on our dish after it's baked. If you have trouble finding pimentos look in the olive isle in your grocery store. They come in very small glass containers. It's just not the same without them (I did that once because I forgot to buy them)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "njgirl"
},
"reviewBody": "Awesome! Yummy and super easy to make. I didn't add the pimento peppers, but thats it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hate2cook"
},
"reviewBody": "This sound delicious and perfect for me. I can cook up a big batch, divide it into meal-sized portions for my husband and me, and freeze up 6 or so meals I can just pop in the oven. This is my kind of home-cooking:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "I thought it was too salty probably due to the condensed soup. After tasting it, I chopped up &amp; microwaved some celery, but that still didn't help enough. I'll make it again, though, as it has potential."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rickie"
},
"reviewBody": "The best tetrazzini! I couldn't find pimentos so I used roasted red peppers. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie E."
},
"reviewBody": "This is the best tetrazzini recipe I've come across so far. Everyone enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki Navigates"
},
"reviewBody": "My family rated this about an 85%(according to my father-in-law), just be sure to add more seasoning to give it some flavor. Also I added frozen peas and diced oninon and green/red bellpeppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie"
},
"reviewBody": "My 3 sons loved this! Used spiral noodles instead. Had just 2 cans of cream of mushroom soup so I added a cup of artichoke dip left over from Thanksgiving. Used leftover turkey instead of chicken. Wonderful! Thanks for the recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Trapolino"
},
"reviewBody": "The whole family enjoyed this recipe. Thanks for sharing Lois!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolinagirl"
},
"reviewBody": "I made almost as is except to lighten up a bit, used reduced fat cream of mushroom soup and 2% cheddar cheese instead. I also added diced red and yellow pepper only because I had leftover on hand and a little onion powder, garlic salt and crushed red pepper flakes for extra flavor. This recipe turned out great (even with the reduced fat ingredients), thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jullum"
},
"reviewBody": "Used this recipe to use up some leftover Thanksgiving turkey. Adding cream of whatever soup and cheese makes anything tasty, so this was good. I also added in some asparagus. Didn't have pimentos so skipped those. Was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "I've made this a few times, and I swore I'd already reviewed it, but apparently not. I have used leftover turkey both times, and it works just as well. Good recipe, and it freezes well. A few times when making it, I've gotten a little carried away with the broth, so carefully add in the broth to make it sloppy. You don't want it too watery! It holds up to modifications--like adding different vegetables, and it is now a staple in our house. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nativeSDgirl"
},
"reviewBody": "This was good but I did make a couple changes. Instead of cheddar cheese I used grated parmesean (chedder didnt sound very good in this recipe). I also added frozen peas right before baking. I do think this dish needs a bit more zing to it but Im not sure how to accomplish that at this point. I will probably make again, as this is an easy recipe and great for taking in my lunch to work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "My family liked this and I liked how flexible it was. I only had canned mushrooms. I had no pimentos. I added chopped onions, pepper, garlic, salt and a dose of dijon mustard. I also baked the chicken. It will be in the family rotation. I've used perdue ready chicken too as a shortcut and it works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I doctored this up quite a bit since that is what I usually do anytime I use condensed soups. They are a little bland for me. (I used 2 mushroom and one cream of chicken.) I used crimini mushrooms for more intense flavor and sauteed them with onion and garlic. I also added quite a bit of dried basil since I think it needed some kind of spice added to it. Didn't bother with the pimentos since they have very little flavor. 9x 13 seemed too small for this so I stuck it in my lasagna pan. Not sure how this would feed 20 people. This served 12 women with just a little leftover. In the end, it had some good flavor and was easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "my2boysmom"
},
"reviewBody": "This recipe is a regular on our menu now! I half the recipe for one 9X13 pan and it comes out perfect. I also add some 2 tsp minced garlic and 2 TBSP sun dried tomato to the mix for extra flavor. So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MrsPari"
},
"reviewBody": "This was pretty good, but not my favorite. I made a few changes. I used linguini instead of spaghetti, added a couple splashes of white wine to the soup mixture, used cream of chicken instead of cream of mushroom (only because my husband prefers it), used a couple splashes of lemon juice in the soup mixture, and added some frozen green peas. I thought it was a bit bland, but ok. If I make it again, I will add more cheese for a more rich flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALBankingmom"
},
"reviewBody": "Very good and very quick! My extremely picky daughter went back for seconds! I left out the pimento and used parmesan cheese instead (all we had at the time). Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kimberly Marcial Locricchio"
},
"reviewBody": ""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "facetiousy"
},
"reviewBody": "3.5 This was pretty good, but not a Wow recipe. I did make some modifications: I scaled this recipe down on the website, and used some low fat ingredients for health. I used 1 crm of mushroom and 1 crm of celery. Because I like veggies I added some onion, celery, and bell pepper which I sauteed with garlic. And I couldn't resist adding a bit of sherry as others suggested. I did reserve some of the cheese for the top, and added crushed crackers on top of that - this provided a crust which was the best part of the dish. I will probably make again, but I'll try to snaz it up some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "appelorchard"
},
"reviewBody": "I quadrupled this recipe for a church supper. They absolutely loved it. I will use this recipe A LOT!! Very tastey, just the right creaminess, and it has yummy mushrooms!! Perfect."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15036/chicken-tetrazzini-for-a-crowd/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15036/chicken-tetrazzini-for-a-crowd/",
"name": "Chicken Tetrazzini for a Crowd"
}
}
]
}
}
, "about": [
]
}
]