				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Tetrazzini I"
,"datePublished": "1999-02-19T19:19:04.000-05:00"
,"dateModified": "2022-07-14T18:08:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tammy Schill"
,"url": "https://www.allrecipes.com/cook/24328717"
}
]
,"description": "So simple to make and so comforting to eat, this homey baked dish is an uncomplicated blending of chicken, mushrooms, cream of chicken soup and sour cream with spaghettini noodles. Pour into a casserole dish and bake with a sprinkling of Parmesan."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z52OMJYvKrKT8Jka_GdoSDYY6DI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/247167-8545f5ea2d8b4d13af2109a168279f2f.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Tetrazzini I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "146"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "826 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "166 mg"
,"fiberContent": "4 g"
,"proteinContent": "38 g"
,"saturatedFatContent": "28 g"
,"sodiumContent": "1447 mg"
,"sugarContent": "4 g"
,"fatContent": "53 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"8 ounces spaghetti",
"2 (8 ounce) cans mushrooms, drained",
"0.5 cup butter",
"4 boneless chicken breast halves, cooked",
"2 (10.75 ounce) cans condensed cream of chicken soup",
"1 (16 ounce) container sour cream",
"2 tablespoons grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Break spaghettini into 1 inch pieces. Cook according to package directions. Drain."
} ,{
"@type": "HowToStep"
,"text": "Saute mushrooms in butter or margarine. Cut chicken into large pieces, and mix with mushrooms. Stir in sour cream and condensed soup. Fold in noodles. Turn into a buttered casserole dish, and sprinkle with the Parmesan cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake at 300 degrees F (150 degrees C) for 40 minutes."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nikki stainbrook"
},
"reviewBody": "really good! added bacon. because well it's bacon lol. my family has never had it before it was a total hit even with the littles!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjhannen"
},
"reviewBody": "I cut the recipe in half. It made plenty. Very easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Hamilton Ulmer"
},
"reviewBody": "This recipe calls for way too much soup and sour cream. If I make again, I will cut back to 1 can of soup and 8-12 oz sour cream. Be sure to add seasonings to suit personal taste. I added poultry seasoning, rose,ar6,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hobbitsgal"
},
"reviewBody": "I added some broccolini to keep it from being so 'white', and a splash of white cooking wine went well with the mushrooms and chicken. I doubled the amounts, but still only ended up with 1 serving leftovers. Sorry, but I only thought about a picture when I finished and was looking at my empty plate. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Huber"
},
"reviewBody": "I enjoyed it. Not dry at all....the way I like it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Marie Cooper"
},
"reviewBody": "Great base recipe! I added old bay seasoning to my chicken when cooking. I also only used 12 oz of sour cream instead of 16oz. I used 1 Can of cream of mushroom and 1 Can of cream of chicken soup. I added parsley, oregano, Italian seasoning and a little bit of garlic salt instead of actual garlic cloves. So delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Duvall"
},
"reviewBody": "Very good! Did not have enough sour cream so I used some heavy cream. My husband is not a big love of pasta but he thought it was great, even asked for seconds. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shetieka Darvin"
},
"reviewBody": "Turn out GREAT!!! Modified it because I don’t like mushrooms. I put chicken bouillon cubes and a dash of soy sauce in while boiling my spaghetti and chicken. I added Parmesan cheese and chicken broth to the butter, sour cream and cream of chicken soup (I used the amount from the recipe). I thinned the sauce with the chicken broth and it turned out creamy and FABULOUS. My family LOVED it will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DHaire"
},
"reviewBody": "This is my go to tetrazzini recipe. The only changes I make are I either cut the butter in half or none at all. I swap out sour cream for plain greek yogurt. I also do a little more sauce as we like it saucy! ;)\nWe have made it with zoodles, but the zoodles have a lot of water so make sure you get as much excess water out.\nBut if just following the recipe exactly, you can't go wrong!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was so delicious...creamy, rich, tasty.\nI made a few tweeks. First, I only had 1/2 the sour cream the recipe called for, so I added about 4 oz reduced fat cream cheese with the sour cream.\nSecond, I much prefer cream of celery soup over cream of mushroom, so I used one can of each.\nThird, I felt the combination of the above ingredients was a little too thick, so I added in about 3/4-1 cup of chicken stock (organic stock, not broth). \nFourth, I only used 1/4 cup butter instead of the 1/2 cup, and I think I could have even cut back to 1/8th of a cup of butter.\nFifth, I added diced pimientos, because they're supposed to be in Chicken Tetrazinni (I may have spelled it wrong. Sorry!). \nIt was fantastic. So good. I'll be making this again!\nOh, and my husband smoked 4-1/2 chicken breasts yesterday, and that's the chicken I used for this recipe. That probably added to the flavor, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harrisonellenj"
},
"reviewBody": "This was so delicious...creamy, rich, tasty.\nI made a few tweeks. First, I only had 1/2 the sour cream the recipe called for, so I added about 4 oz reduced fat cream cheese with the sour cream.\nSecond, I much prefer cream of celery soup over cream of mushroom, so I used one can of each.\nThird, I felt the combination of the above ingredients was a little too thick, so I added in about 3/4-1 cup of chicken stock (organic stock, not broth). \nFourth, I only used 1/4 cup butter instead of the 1/2 cup, and I think I could have even cut back to 1/8th of a cup of butter.\nFifth, I added diced pimientos, because they're supposed to be in Chicken Tetrazinni (I may have spelled it wrong. Sorry!). \nIt was fantastic. So good. I'll be making this again!\nOh, and my husband smoked 4-1/2 chicken breasts yesterday, and that's the chicken I used for this recipe. That probably added to the flavor, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Karo"
},
"reviewBody": "Super easy, my daughter loved it and also ate the leftovers. The flavor was good as it is but I did add some spices. It wouldn't be the meal I would pick for guests but it's perfect for a weeknight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yvette Billing"
},
"reviewBody": "Great for easy comfort food, I used half a rotisserie chicken I had leftover about 12 oz spaghetti 16 oz light sour cream and 2 cans healthy request cream of chicken w 2 cans of mushrooms, then topped with panko. Tried to make it a bit lighter, and nobody noticed:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Ponciroli"
},
"reviewBody": "Great recipe. Didn't have mushrooms on hand (would have been better if I did). Used 2 cans cream of mushroom. Also used whipped cream cheese and added some milk instead of the sour cream(all I had)and 4 cloves of garlic. Also added some crushed red pepper flakes and thyme to the chicken. Delicious. Kids devoured it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cfiglest"
},
"reviewBody": "I used half the amount of sour cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cristy55"
},
"reviewBody": "Really good. My husband loved it. The only modification I made was I put in less mushrooms because my husband is not a big fan of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Fredrick"
},
"reviewBody": "Made this recipe with a few alterations. I boiled my chicken first in water and \"Better than bullion\" and then chopped it up. I used 3 Tbsp butter to saute the mushrooms and garlic, and although I swear I bought sour cream I did not, so I had about 4 oz of that. I also added some Velveeta to make it a little cheesy. It came out a little dry, but I think that is because my oven runs hot and I didn't think to shorten the time because some reviews were concerned with the excess sauce. I will definitely make this again, though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tweety"
},
"reviewBody": "Very simple and good base recipe. I sautéed 7 cloves of sliced garlic and a large handful of fresh sliced basil in olive oil and butter, then added the partially boiled, sliced chicken to flavor it together. Salt and pepper to taste, then mix in the Parmesan cheese,8oz sour cream and one can of condensed mushroom soup(un diluted). Add cooked pasta and adjust seasonings to taste and serve!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amanda Mayer"
},
"reviewBody": "WAY too much butter and too soupy!! It's a great base but definitely needs some adjustments. Next time I'll cut the butter down to 1/4 cup at most. A full thing of sour cream isn't necessary either. I'd change it to about 10 oz. I also used 1 can cream of mushroom and 1 can cream of chicken to give it a little more flavor, but in all reality only 1 can of either would probably be enough. A little onion powder and black pepper would probably go a long way, as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Trout"
},
"reviewBody": "This was awesome! Even my 2 year old grand daughter loved it! Made a double batch and it did not last long. Sautéed the mushrooms in garlic added an extra zing to the dish. Will definitely make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whitewave"
},
"reviewBody": "We liked this meal very much! Thank you for the recipe.\n\nI used a package of fresh sliced white button mushrooms instead of canned, and I also added a half a block of cream cheese because I had it in the fridge and needed to use it up. Made it extra creamy &amp; delicious &amp; I would recommend these additions/revisions.\n\nFor presentation: It could use a sprinkle of fresh parsley on it, or some spinach in it, for color, as the appearance is all \"white\" on the plate. Next time I'll try adding either a package of baby spinach or some broccoli in it for color &amp; taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kuties"
},
"reviewBody": "Delicious and easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "augboilerdawes"
},
"reviewBody": "Too much sour cream. Just ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather Mitchell Tchobanian"
},
"reviewBody": "Lemon! This is one of the things this needs. This is a staple recipe of my mother-in-law's, but she adds lemon. It's an Armenian thing. Anyway, use 1/2 the sour cream, 1 can of soup, 2/3 of the butter, and a WHOLE lot of parmesan cheese. This is not a low-cal dish. I put about 1/3 cup of parmesan cheese in the mix, 3 tablespoons of lemon juice (bottled is fine), sprinkle some garlic and onion powder and salt in it, stir it around, and TASTE IT! Then add more stuff as needed. Once you put it in the casserole dish, mix 1/3 c. parmesan cheese and 1/3 cup Italian bread crumbs, then sprinkle it on the top and pat it down firmly. Then sprinkle a little more lemon over the top. Just a little. My parents are elderly and their appetite isn't what it used to be, and this is MAJOR comfort food for them. They love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammi"
},
"reviewBody": "This was very good. It made a lot more food than was expected. We had lots of leftover which my son and husband actually ate. They have never really eaten leftovers in the past. My son says it was tons better than the dish made at school. I liked it, but it was a little salty for me. Both told me this recipe was a keeper. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia"
},
"reviewBody": "This was a great recipe. Very creamy and delicious! It was easy and quick to make. I used a roasted chicken you can get from the grocery stores and just shredded it for the recipe. I also used one can of cream of chicken soup and one can of cream of mushroom soup, put some panko on top, and put cheddar cheese on top during the last few minutes in the oven. This recipe is a good base, and you can do a lot to tweak it in your own way. Very good recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura T"
},
"reviewBody": "This was easy and awesome, and the only thing I did was add some salt, pepper, Worcester sauce, and a tiny bit of garlic salt... My guy said it was incredible... I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatieC"
},
"reviewBody": "Good base recipe. Doubled the spaghetti since it seemed like a lot of sauce. Used olive oil &amp; only 1 tbsp butter to sauté mushrooms, red onion, &amp; frozen peas.. Added 1/4 c white wine to that &amp; reduced a bit to make it taste more homemade. Subbed cream of celery for 1 of the soups &amp; LF sour cream. True comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hanny Manny"
},
"reviewBody": "Marinated the chicken in italian seasonings and baked in in the oven for 30 min. at 350 degrees. Using only one Tbsp. of butter (not a 1/2 cup like the recipe calls for), I sauteed a some chopped onion, garlic, green bell pepper, and fresh sliced mushrooms. Omitted the second can of soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie C"
},
"reviewBody": "I have made this a couple times when I had left over chicken, usually from hubby smokin' a bird on our Big Green Egg. It's a quick come together recipe that uses leftovers and stuff you normally have around the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Ann Flythe"
},
"reviewBody": "This is sooo good! It was a hit with hubby. The only thing I did different was add some bread crumbs before the shredded cheddar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tori"
},
"reviewBody": "My family LOVES this dish. The only change I made was I added frozed peas. Terrific!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ward"
},
"reviewBody": "Loved this! Made some slight modifications to lighten it a bit and boost flavor. I added a small onion that I sautéed with the mushrooms. I halved the butter and added about a 1/4 cup beer (wine would work too). I added some bouillon and sal and pepper at this point too. I doubled the spaghetti and left the rest of the ingredients the same. I was able to make two casseroles that way and froze one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicoal"
},
"reviewBody": "Very good! My family really liked it. I did as the others suggested and cut the sour cream by half. I also added a bit more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Harris"
},
"reviewBody": "I enjoyed this very much. Great comfort food. I used a can of cream of broccoli and cream of chicken and lightly dusted the top with seasoned bread crumbs as well as the parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bessiedarlin"
},
"reviewBody": "Yummo! We are not pasta people per say, but, this is absolutely delicious. Just made minor changes (as to what I had in the pantry). I used fresh mushrooms and I made my own cream of chicken sauce. A winner! : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "7Great recipe. Easy. I did modify it slightly as rbamllory did. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dll07"
},
"reviewBody": "I made this with a couple additions and it turned out great. My nephew now thinks I'm an amazing cook! I used whole wheat pasta, cream of mushroom &amp; cream of celery soup (all I had) and also added a pureed onion &amp; about 2 cups of pureed cauliflauer. My kids who are very picky ate with little complaining (which is a feat!) and my nephew loved it and the best part is NOBODY knew what the secret ingredient was!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VOELKERLK"
},
"reviewBody": "I followed a few other reviewers' advice and only used 1 can of soup, about 1/2 the called for sour cream. I also added diced fresh onion &amp; garlic, and left out the mushrooms all together. It was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "canmcg27"
},
"reviewBody": "Absolutely delicious! I wasn't expecting this to have much flavor, but it really is creamy and flavorful. I only cooked two chicken breasts so I only used one can of soup and half a container of sour cream.\n\nI did do one thing differently. I omitted the mushrooms and cooked my chicken breasts in olive oil with garlic salt. I also thinned the sauce with a splash of chicken broth to get the right consistency. This will be on my table again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "ABSOLUTELY DELISCIOUS!!!!!!! A definate KEEPER! I used rotisserie chicken because I always have deboned rotisserie chicken in 2 cup portions in my freezer ready to throw together dishes like this. This was very YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wrambin"
},
"reviewBody": "Excellent creamy dish. I used fresh mushrooms. I think it went in the oven a little too long because it was slightly dry but still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Made this recipe without making any changes and my family loved it. It is the closest taste to my favorite restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I was looking for something mild to make for dinner tonight and this was recommended to me on the recipe buzz. I was surprised that it was rather quite good, as I don't normally care for too many canned ingredients. I had reduced fat sour cream and only 1/2 the amount suggested and it worked perfect! I actually don't like too much sour cream in a casserole anyway, because it tends to mask the other flavors. For the butter I used half regular butter and half of a heart healthy spread. It was what I had in the house. This was creamy and delicious, no complaints! I did take it out of the oven in 25 minutes, as I used 1/2 the sour cream, and didn't want it to dry out. I will make again when I want a quick comforting dish, especially during the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katy"
},
"reviewBody": "I made this for my family once about 2 months ago and they flipped over it. I use more mushrooms than the recipe calls for because we love mushrooms but I now have to make it for them at least once ever 2 weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathmank"
},
"reviewBody": "DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "dougleen"
},
"reviewBody": "Was easy to prepare but found the taste rather bland and too creamy for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KaraSmith"
},
"reviewBody": "I really liked this recipe and I felt that it was a great starting point for a tetrazzini. I added 1/2 tsp of garlic, 1/2 c. onion, some paprika and a pinch of oregano. Also I thought it really tasted great after I placed one tsp of fresh cracked black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anlycoar"
},
"reviewBody": "Made this tonight for dinner with only minor tweaks (increased spaghetti to 16 ounces; one can of mushrooms, a bit of salt, pepper and garlic.) I was worried that this was going to be to soupy, but it wasn't. Family proclaimed that is was very good. I will definitely add this to our dinner menu cycle! Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DisasterArea"
},
"reviewBody": "This recipe was pretty good! I used bowtie pasta instead - just a personal preference. I think the only reason it didn't get 5 stars from me was because something about the consistency with the sauce. But I'll try it again, and see if any tweaks help with that. Otherwise it was totally worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda_KY"
},
"reviewBody": "I thought this was a great simple dinner recipe. My entire family enjoyed it and some went back for seconds. Great way to use up left over chicken and can easily add additional veggies to get the kids to eat more vegtables. We added spinach. It was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmaraJ1"
},
"reviewBody": "As modified, we enjoyed this very much, but I think it might have been too soupy and pretty bland without the modifications. I used one can each of cream of chicken and cream of mushroom soup, only half the indicated amount of sour cream (8 oz instead of 16 oz) and 12 oz. of fettucini instead of 8 oz. Even so, it was borderline too soupy, but then I only used one pint jar of homecanned chicken breast (about 1-1/2 chicken breast) instead of four, for economy. Also, since I had no mushrooms, I used only a tablespoon of butter to grease the casserole dish. I added a scant teaspoon of onion powder and a half-teaspoon of marjoram, along with plenty of pepper and a few of shots of Tabasco. A topping of buttered bread crumbs gave this a nice variety of textures. The mushrooms would have made this dish even better. Another time, I might also try it with broccoli florets. This is a rich, creamy, satisfying and versatile dish, well worth trying, but also worth \"healthifying\" some by reducing the amount of fat from the butter and sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DENISE1969"
},
"reviewBody": "I gave this 4 stars because it simple needed some seasoning. I added 2 garlic cloves and a packet of dry italian dressing mix. I also decreased the butter and used fresh mushrooms. Turned out really good with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "Very good recipe. The kids loved it! Thanks Tammy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Rhodes"
},
"reviewBody": "My husband doesn't like mushrooms, and I don't like them reheated, so we omitted both the mushrooms and butter. I also used a can of cooked chicken breast. This made prep much easier, now only having to combine the cooked spaghetti with the other ingredients before popping it in the oven. Very filling and rich, a great, easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afinerosesheis"
},
"reviewBody": "This recipe was really good. We all enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Yarbrough"
},
"reviewBody": "I did add more cheese about 1/4 cup of Parmesan cheese and 1/4 cup of Italian Five Cheese. I did melt all together. Then topped with crushed croutons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Easy and a huge hit with the family. I used 1 can of cream of chicken and 1 can cream of mushroom. I didn't have any canned mushrooms. I only had half the sour cream called for so I added 3 oz cream cheese. I did put quite a bit of parmesan and added a hefty sprinkle of garlic powder. I cooked the chicken in a little of the butter and seasoned it with some Season all and some garlic powder. Thanks for such a versatile dish that really wowed my family. This was great comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANGEL"
},
"reviewBody": "THIS IS A WONDERFUL DISH!! I ADDED A BIT OF HEAVY CREAM AND TOASTED ALMOND SLIVERS TO THE BASE MIXTURE AS WELL AS BREAD CRUMBS ON TOP TO ADD A BIT OF TEXTURE . DEFINATELY A CROWD PLEASER!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hungryhippo"
},
"reviewBody": "After reading reviews, I did 1 can cream of chicken and about 12 oz of sour cream. I also deglazed chicken pan with sherry and then added 3T butter to sautee 1 4oz can of mushrooms (family not a fan of mushrooms). I added peas. It was a little dry, so next time I will add 1/2 c (or so) of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SheepyChef"
},
"reviewBody": "This was a pretty tasty recipe. I had never eaten chicken tetrazzini before I made this, and it was pretty good. I will definitely use about half the amount of butter next time, as the leftovers kind of scared me with the amount of butter stuck to the bottom of the containers. Otherwise, a pretty good recipe. My husband liked it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ZooKeeper"
},
"reviewBody": "I'll give it four stars because yes it is good, but it is also easy to modify to your own tastes. I used one can of crm of chkn soup, but then used one can crm of mushroom. I left out the mushrooms, added garlic to the butter, and then used a hint from another member and topped it with bread crumbs. Makes a yummy casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "southernmancooking"
},
"reviewBody": "This was easy to prepare I added a little garlic &amp; Dry minced onion I also Like saute the Chicken by it self in butter and Dry roasted Peppers and garlic then adding back in the mixture on low for about 10 min. I think I will try Cheddar Cheese on top next time overall pretty good stuff"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wilemon"
},
"reviewBody": "We were not huge fans of this recipe as written. I will 'play' with the idea starting with using fresh mushrooms with minced garlic and add a couple tablespoons of white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary C"
},
"reviewBody": "My husband and I enjoyed this dish very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NDR"
},
"reviewBody": "Very delicious and has a homemade taste, but quick and easy. I used grilled chicken breasts cut into bite sized pieces because I prefer the flavor of grilled chicken. I also used low fat soups and sour cream and increased the amount of parmesan cheese, about a handful mixed into the dish and topped with probably about a cup of the cheese. It was very good, one of my favorites!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MonicaG"
},
"reviewBody": "Very creamy and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela F."
},
"reviewBody": "This was good but so rich. Almost to rich to eat as a main course. A few bites and i was good. Good flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nena_s_j"
},
"reviewBody": "Was a huge hit with my family. I made it for my mom and younger siblings when they came over for dinner. And since they really don't like mushrooms I only used 4 oz. total, but I felt so guilty for the lack of veggies that I steamed up some broccoli on the side. It tasted wonderful in the creamy sauce. And as what i believe to be true, everythings better with bacon. i fried some up, chopped it and sprinkled on right before baking. It added some really wonderful tender bites and crunchy ones. Will be making this for years to come."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IDNARB74"
},
"reviewBody": "Very good!! Only thing i added was some cheddar cheese on top for the last few minutes of baking. Will def. make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRHELYMO"
},
"reviewBody": "Got lots of compliments! I left out mushrooms but substituted 1 can cr mush for a cr chx. Upped the noodles to 16 oz. Only change for next time would be to add a little pepper, or maybe some peas and carrots. I also baked at 350 and topped with Italian breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Food"
},
"reviewBody": "Not good at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taertman2516"
},
"reviewBody": "Very good. My fiance doesn't like red-sauce pasta dishes, and I don't enjoy alfredo, but we both like this. My dad used to make it for me when I was little :) I used fresh mushrooms and whole wheat pasta, and all cream of mushroom since that's what I had on hand. It worked well! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "annenorfolk"
},
"reviewBody": "After reading the reviews, I thought this would be a slam-dunk success, but my teenaged daughter HATED it and my teenaged son just nibbled at it. My husband didn't eat it at all. I thought it was OK, just nothing fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Break your mouth good! I used cream of onion canned soup (because that is what I had on hand) I also added some rosemary sprigs and some parsley. YUMMMMMMMMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHERBIE29"
},
"reviewBody": "very good....will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Selena"
},
"reviewBody": "I have made this so many times I have modified it to be much healthier, but still VERY flavorful. Perfect something to throw together on a cold night when nothing else sounds good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pr0le"
},
"reviewBody": "I chose this recipe without really paying attention to what goes in it. It wasn't until I was throwing it all together that I realized how unhealthy this meal had to be. \n\nIt tastes great, of course. With that much fat it's bound to taste good, but I won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whats4dinner"
},
"reviewBody": "This was great, but definitely one can of soup and 8 oz. of sour cream is enough (I used Campbell's chicken/mushroom). I also cooked the chicken in a crock pot until tender, making this very quick and easy to prepare in just a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsSunflwr"
},
"reviewBody": "This is an easy recipe that my husband and I LOVE. I didn't change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBLAZ17"
},
"reviewBody": "This is an old time favorite during my childhood growing up. We loved this recipe. It was my moms recipe and since she passed away when I was in high school I had no idea how to make it. Now that I am a mother myself, I wanted to bring back some good ol' childhood memories so I decided to check on here, and this is it exactly!!! We love this recipe, it's sooooo good! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "A very heavy, filling dish, but you can't help but love it! Pretty bland, so we kicked it up a bit with a little Worsteshire sauce and some onion amongst other things. Needs to be seasoned to your own liking, but a very good recipe to have on hand and make your own style! Thanks for this one, have made it several times already!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erika sullivan"
},
"reviewBody": "I LOVED THIS RECIPE AND SO DID MY FAMILY. THE SAUCE WAS GREAT AS WELL. THE ONLY CHANGE I MADE WAS ADDING THE WHOLE BOX OF 16 OZ. SPAGHETTI INSTEAD OF HE 12 OZ. I THINK BY ADDING THIS IT MADE THE SAUCE A LITTLE LESS CREAMY. I THINK THE ORIGINAL RECIPE WOULD HAVE BEEN A LITTLE TOO CREAMY, BUT OTHERWISE GREAT RECIPE! I WILL USE IT AGAIN IM SURE!:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joni"
},
"reviewBody": "My boyfriend and I didn't care for this at all. It was SO bland..even after adding tons of herbs to it. While the chicken was cooking it had such a great aroma, but once I combined everything there wasn't much flavor. I omitted mushrooms since my boyfriend doesn't like them so instead of using regular cream of chicken condensed soup I used a can of cream of chicken and mushroom. I added lots more garlic and way more seasonings and herbs. I also used egg noodles instead of spaghetti. I was very disappointed. This was my first time ever tasting chicken tetrazzini and making it. I wasn't impressed. Sorry. I think next time I will try the other recipes listed that have sherry and other liquids in it for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MooseNsquirrel"
},
"reviewBody": "I loved this and so did my kids. I used low fat cream of chicken soup and low fat sour cream and only half of the amounts of these called for in the recipe. . I also added 2-3 tbs white wine, about 1/2 cup shredded cheddar cheese instead of parm and added a couple tsp of pimentos. Seasoned with garlic salt, onion powder, parsley flakes and salt/pepper. Good Stuff!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie Shepherd"
},
"reviewBody": "This was good but I made a few variations. I also thought that there was too much soup/sour cream mixture so I used only 8 oz. of sour cream. I think once it thickened up in the oven it was perfect. I will make this again but next time I will try putting onion in and using fresh mushrooms instead of canned. I think fresh garlic would be good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Wilson Johnson"
},
"reviewBody": "I have made this several times and my family loves it. It has become a regular dish on our menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AURIE81"
},
"reviewBody": "I loved this recipe but I made a few changes. I seasoned the whole chicken breasts to my taste (salt, pepper, garlic powder and onion powder) and seared them on a large skillet until browned, but not cooked through. I removed the chicken and set it aside, and cut it into pieces. I deglazed the pan with a little juice from the mushrooms, and then added 2 TBSP butter and sauted the mushrooms. I then added the chicken pieces back to the skillet. While the pasta was draining, I used the hot pot in which I cooked the pasta to combine 1 can of mushroom soup, 1 can of chicken soup and 8 oz. of sour cream, then I added the pasta back to the pot. I combined this mixture into the chicken and mushrooms, and then put everything in my 2 qt. casserole dish (it almost didn't fit, and had to watch it so it did not boil over). I topped it with the cheese (maybe 1/4 cup) and served it with EZ Drop Biscuits from this site. It was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rbmallory"
},
"reviewBody": "This recipe is great - with some major modification. I cannot imagine using two cans of soup. I ommitted one can, only used 12 oz. of light sour cream and the consistancy was perfect. I also added 1/4 cup sherry to the butter when cooking the mushrooms. This flavor masks the canned soup quality and lends more of a from scratch feel to the recipe. Before baking I added 1 1/2 cups Italian seasoned bread crumbs to the top. This creates more of a casserole quality to the dish which we liked. Would probably be very good without it as well. I also liked the suggestion of adding frozen peas. I will try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mollymoo"
},
"reviewBody": "This is great! I will make this once a month for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cait Stone"
},
"reviewBody": "This was very good and easy! You can DEFINITELY half the butter...an entire 1/2 cup is unnecessary. Also, I don't care for mushrooms, so I substituted asparagus! I changed the noodles to fettucine too. I think anything of your choice would do just as well! I added a little more than what is called for, for everything, and it turned out great - I think it helps to make it not as creamy as some of the other members have commented. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alicia"
},
"reviewBody": "It was sooo delicious!! Very rich and creamy.... almost too rich... Id definatley make again... just with less butter and sourcream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nikkohli"
},
"reviewBody": "Had to add a lot of seasonings to this and it still tasted like pasta with a cream of mushroom sauce. My husband loved it though so I'll give it a 3. I wont make it again but he might!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy A."
},
"reviewBody": "My family loved this recipe; although I modified it as well. I cut back on the sour cream to make it less thick. I used turkey instead of chicken and added garlic powder, savory, and black pepper to add some depth to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imfifi2"
},
"reviewBody": "Loved it! I did add some garlic and red wine to the mushrooms for some additional flavor, sooo good. I also added in uncooked chicken so all the great flavors can cook together. My 3 kids absolutely loved it AND they didnt even pick out the mushrooms, WOW! Thanks for a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "No one was terribly impressed with this recipe and my gang eats just about everything. Although I added seasonings, which the dish didn't call for, it was still quite bland. Not worth the calories; sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carie"
},
"reviewBody": "great family meal, quick and easy I used diced onions and fresh mushrooms, and substituted cream of celery and cream of broccili for the cream of chicken. very tasty.. kids loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curt McLey"
},
"reviewBody": "This is one of the best casserole type recipes I've tried at allrecipes. It is so creamy and delicious, your family and friends will think you stole the recipe from a famous Italian restaurant's vault. It's mind boggeling that such simple ingredients result in such a fantastic taste explosion. I used what I had on hand: 1) substituted shrimp for chicken; I had 24 ounces of cooked shrimp ... I cut the tails off and sauteed just like I would have the chicken, 2) I used fresh parmesan cheese, which I grated myself ... it lended a rustic appearance and much enhanced flavor, 3) diced some leftover roasted red peppers into pimento sized pieces, 4) only had one cup of low-fat sour cream, so I added 1 cup of mayo. With these imposed changes, I saved a trip to the store and still enjoyed the recipe to the max! Some high quality bread and butter topped off this all-star lunch. Wow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakrsdzn"
},
"reviewBody": "I made this it was so easy. Easy after a hard day at work is just what I'm looking for. I changed a few things per some of the reviews I read. Like I substituted 1 can of cream of chicken soup for a can of cream of mushroom, I also only used about 8oz. sour cream and threw in some diced pimento. Next time I may add some celery, I think this is a some what forgiving recipe. It was delish my family ate it all."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11722/chicken-tetrazzini-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11722/chicken-tetrazzini-i/",
"name": "Chicken Tetrazzini I"
}
}
]
}
}
, "about": [
]
}
]