				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Manicotti Alfredo"
,"datePublished": "1999-09-17T21:49:33.000-04:00"
,"dateModified": "2022-07-14T16:17:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jeff Ellison"
,"url": "https://www.allrecipes.com/cook/24324136"
}
]
,"description": "Large manicotti noodles are stuffed with an aromatic blend of marinated chicken, ricotta cheese, egg, basil, oregano and marjoram. Blanket with a velvety Alfredo sauce, top with mozzarella cheese and bake to perfection."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ox4qGR9j99_rrkwSKommYDl_XOk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1103661-70296b033b6d4bf6947d3ddd51b9e254.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Manicotti Alfredo"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "153"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "813 kcal"
,"carbohydrateContent": "37 g"
,"cholesterolContent": "197 mg"
,"fiberContent": "2 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "30 g"
,"sodiumContent": "811 mg"
,"sugarContent": "2 g"
,"fatContent": "60 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"3 skinless, boneless chicken breast halves",
"0.5 cup distilled white vinegar",
"1 cup olive oil",
"1 clove crushed garlic",
"1 (12 ounce) package manicotti pasta",
"6 tablespoons butter",
"2 cups heavy whipping cream",
"0.25 teaspoon ground nutmeg",
"1 teaspoon ground black pepper",
"1.5 cups grated Parmesan cheese",
"1 teaspoon salt",
"1 pint part-skim ricotta cheese",
"1 egg",
"1 tablespoon chopped fresh oregano",
"1 tablespoon chopped fresh marjoram",
"1 tablespoon chopped fresh basil",
"1 cup shredded mozzarella cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large resealable plastic bag, marinate chicken with vinegar, olive oil, and garlic for at least 30 minutes. Saute in a little olive oil until done. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Cook pasta in a large pot of boiling water until al dente. Drain, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, melt butter or margarine in a small saucepan over medium-high heat. Add heavy cream, salt, nutmeg, and ground black pepper, and stir until sauce thickens. Reduce heat to low. Add grated Parmesan cheese, and stir until the cheese melts. Set Alfredo sauce aside."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, mix together ricotta cheese, egg, oregano, marjoram, and basil. Mix in cooked chicken."
} ,{
"@type": "HowToStep"
,"text": "Stuff cooked manicotti shells with chicken and ricotta mixture. Cover the bottom of a 9x13 inch baking dish with half of the Alfredo sauce. Place stuffed shells on top of sauce. Pour remaining sauce over shells. Top with one cup shredded mozzarella cheese. Cover with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degree F (175 degree C) oven for 45 minutes. Let stand 10 minutes before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinginMN"
},
"reviewBody": "I've been making this recipe, with no changes for almost years and it's delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fins Fan"
},
"reviewBody": "Great recipie as written, however, I took a short cut and used Bartolli Creamy Basil Alfredo sauce rather than making the Alfredo sauce. I also added extra fresh basil and I used lemon thyme. I added parm cheese to the ricotta mixture and added a touch of lemon zest 🍋 to help cut through the richness of the dish. Several with a green salad 🥗. Husband and picky Mom loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "The food was fine, but the recipe itself isn't very well written. If you follow it exactly, you're trying to stuff manicotti noodles with whole chicken breasts.\nAm I supposed to cut them into strips? Dice them? Shred them? It doesn't say."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Krissaundra Pereira"
},
"reviewBody": "Add cooked spinach and you have a masterpiece!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eponymous74"
},
"reviewBody": "Delicious and flavorful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie Sheehan"
},
"reviewBody": "well so far it's been alot of work...1 fry pan to cook chicken, 1 small sauce pan for Alfredo, 1 large pot to cook noodles, cookie tray for noodles to rest, and a bowl to make stuffing...WOW! It's in the oven and I sure hope it good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karlene Sa'ad"
},
"reviewBody": "It was so good! I didn’t use the nutmeg or eggs. Also couldn’t find a 12oz package of noodles but the 8oz package of noodles were enough. My family loved this dish and I was left feeling like a Star!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Palka"
},
"reviewBody": "This was so delicious! Will make again for sure. I made 1-1/2x the sauce for my taste and because it is so good. Very easy. Tastes like restaurant quality food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Faye"
},
"reviewBody": "It was very good but I’d cut out salt wherever you can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsia Hill"
},
"reviewBody": "I made this for my family. I was delish. Doubled the sauce as others suggested. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cyndy Marlow"
},
"reviewBody": "I will definitely make it again....I found they required too many manicotti tubes...I had a whole box that I didn't use....I also couldn't put the chicken inside the tubes so I put the chicken between the tubes....it was absolutely delicious...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary P."
},
"reviewBody": "There is absolutely NO reason for any recipe to call for an entire cup of olive oil for only 3 chicken breasts. What a waste! I tossed the chicken with in 3 Tablespoons of olive oil, 1 Tablespoon of fresh lemon juice and 3 cloves of garlic, salt and pepper. Then I baked them until done. I cooled them for about 30 min then shredded and added them to the cheese recipe before stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Ray Lewis"
},
"reviewBody": "The Alfredo sauce alone is to die for! Awesome recipe and I will definitely me making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan Krafka Meany"
},
"reviewBody": "What are you to do with the chicken after it’s cooked? \nI diced mine up in 1/2” cubes. Please be certain you’ve included all steps when posting recipes!\nIt is not quick nor easy, but tastes like a great restaurant entree.\nA full recipe would fill 35 shells and serve 9 x 12 people if you offer a lovely side salad and some great Italian or garlic bread, and of course a beautiful Tiramisu, yoghurt &amp; fresh berry parfait, chocolate mousse or gelato as dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VBMommaOf4"
},
"reviewBody": "I read through the reviews some before I made this recipe. I decided to double the sauce as some others had mentioned. The sauce was absolutely delicious! I planned on making no other changes to the recipe, but found out I was out of eggs so ended up not including that. It still turned out amazing. One of my son's said it was too cheesy but the rest of us loved it! Will definitely make this dish again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Dicus"
},
"reviewBody": "Delicious! Made it as a chicken alfredo bake versus using manicotti noodles, so I didn't use the ricotta cheese and mixed the fresh herbs in with the alfredo sauce. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Poison Ivy"
},
"reviewBody": "Delicious, will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "duboo"
},
"reviewBody": "This was excellent on its own, but was perhaps just a little dry. To make this again, I would increase the sauce by 50% and add in some with the chicken mixture. Also, the recipe doesn't say how to prepare the chicken for stuffing. I shredded it using a paddle blade in my KitchenAid mixer. That worked excellent. Also, I cut way back on the salt, using only a third of what was called for. This was the perfect amount. I followed the measurements on the herbs, but I felt the oregano was about double of what it should have been. Next time I will reduce by half. I did add a can of spinach (I would have preferred fresh) to my sauce, which I think was a real nice addition. Overall, a great sauce and a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "apdonovan84"
},
"reviewBody": "I would make this again, but would cut the chicken into bite size pieces and saute it in butter instead of olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLRMLR"
},
"reviewBody": "This dish was really good and easy to make. I made a few changes.\n1 marinated my chicken in a robust port vinaigrette\n2. sauteed the chicken in onions and garlic.\n3. used lasagna noodles\n4. added fresh broccoli and spinach to one of my layers\n5. did not use the egg with the ricotta cheese mixture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Brenner Hoffman"
},
"reviewBody": "Have made this a few times. It's one of my sons favorite dishes. The Alfredo is so good. Made it and stuffed jumbo shells. It's easier than stuffing manicotti shells. It's a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Smith"
},
"reviewBody": "Easy to make! I doubled the recipe for our D &amp; D gamenight supper. I also used ground chicken to save time, and tripled the mozzarella because CHEESE! Unfortunately, I used shakey cheese instead of grating my own Parmesan and my Alfredo was sooo salty :-(. So DON'T SKIMP ON THE PARMESAN! Get the good stuff and grate it! I also forgot the egg, but everything baked up ok.\nOn the plus side, I used one reviewer's tip to slice the tube, stuff, and lay seam down. Thank you, that worked great! Was also a lot less messy for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VALOVESOR"
},
"reviewBody": "The sauce alone deserves 5 stars. I made this for a small dinner get together with friends. It was a huge hit. I was able to assemble it ahead of time then started heating it 15 minutes before they arrived. My kitchen was clean and it all looked effortless. It is a rich (as stated) meal so I wouldn't have it often but is definitely worth making for special events."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindee"
},
"reviewBody": "The only change I made was to omit the vinegar and substituted white wine in the marinade. The Alfredo Sauce was not enough therefore the noodles browned and it was very dry. I'm not sure that I will ever make this again due to the amount of time spent on preparing to end up with a bland meal. Sorry this is the first receipe off of this site that was a disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edward D Mingus"
},
"reviewBody": "Very easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Lucky Higgins"
},
"reviewBody": "This dish is absolutely amazing. I was looking for new/different ways to replace beef and incorporate more chicken in the dishes I prepare for my family. I did not have any vinegar on hand, so I left it out, but I did everything else according to the recipe. It was so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn"
},
"reviewBody": "It was very good we made the recipe going for 4 people servings. We also used whole milk and a flour paste instead to make the Alfredo sauce thicken which came out to taste great. Its not the Greatest thing i have eaten but it is definitely a great dish that we loved. I did have to give it 4 stars because of instructions not being very descriptive but its overall quality with everyones sense of \"eh wing it\" with ingredient amounts on certain things went extremely well. Its a must try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Berry"
},
"reviewBody": "My husband and I reallllly enjoyed this dish! I suggest using less salt and slightly less garlic. I think you can away with less. Very good dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Touta"
},
"reviewBody": "out of this world, whole family loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zombie Girl"
},
"reviewBody": "After trying a few different recipe's for this, eventually I tried this one, and it really is my favorite. Far better than some of the others I've tried. The only down side is that it's a little extra work. But so are all things that are good in life."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This was really great! I did everything as written only I had to use Italian 4 Cheese instead of mozzarella because it was all I had in the fridge. It made it a little saltier but it was still good. Mozzarella would likely be better. I also shredded the chicken because it did not specify what to do with it! Super yummy! THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Logan Hays"
},
"reviewBody": "Was amazing! Family loved it. I made it to a T from the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teata"
},
"reviewBody": "So good!! I'm so excited I tried this recipe! My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Florist_fire"
},
"reviewBody": "Amazing! My bf is super picky. Took one look at it, then looked at me with a worried look. He took some, sat down and took a bite. Soon as he did, that worried look immediately changed to a look of awe and wonder! He went back for 2nds! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joclarke"
},
"reviewBody": "Awesome! I added spinach to the chicken/ricotta mix and upped the spices, but this dinner rocked. Served with a salad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dookie007"
},
"reviewBody": "This was so delicious. It really hit the spot. I change a few things but not because it needed it. I boiled the chicken in salt water and shredded it. I also sweated chopped onions and garlic in the butter before adding the cream, which I used fat free half &amp; half. LOVED IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly cooks"
},
"reviewBody": "I loved this recipe but I tweaked it slightly I added spinach to the recipe and no Parmesan cheese. Easy to make and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha"
},
"reviewBody": "Awesome recipe! Added spinach to the filling, used Italian seasoning, and made the Alfredo sauce with low-fat milk. Even those who don't eat spinach cleaned their plates!!! Next time I think I will try shrimp instead of chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamaSarahK"
},
"reviewBody": "Loved this recipe, I used white pepper instead of black in my sauce, just a personal preference I think it gives a smoother flavor. Also I didn't have any Marjoram so I omitted that. The only thing I will do different next time is cut back on the nutmeg just a bit. I also added garlic to my sauce. Turned out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meeganw"
},
"reviewBody": "Perhaps I overstuff my manicotti, but I was only able to fill 9 manicotti shells. Other than that, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HAGESE"
},
"reviewBody": "I followed the recipe except I added a 1/2 package of spinach per other reviews which meant I needed to cut back on the amount of chicken a little or I'd have too much stuffing for the shells. The biggest change I'd make is the amount of salt in the sauce. It was way too salty for me and even my husband thought it was salty and he typically adds salt to every dish. I'd either use unsalted butter or cut the salt in half or even less. I'd also use a little less of each of the herbs. The basil in particular I thought was a little strong. I'd make it again but with modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Coco"
},
"reviewBody": "This was an excellent dish! My family really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Pritko"
},
"reviewBody": "As everyone else who wrote a review, I too loved this recipe! I followed it just as written. I had only one negative about the dish, and it may have been something I did wrong. My alfredo sauce after baking the dish turned into butter. Anyone know what I could have done wrong? Next time I make this, and I will, I'm going to reserve some of the sauce back and pour it over the manicotti after it finishes baking. Thank you for sharing this wonderful dish with us all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m"
},
"reviewBody": "This was excellent, but very rich. The only change I will make when making this again is to reduce the butter to maybe two tablespoons...six is way too much, it was pooled in the bottom of the pan when I took it out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "This was delicious. As a hint - my grandmother taught me to cut the manicotti noodles in half lengthwise after boiling, lay the filling down the middle, then overlap, lay in dish with seam side down. Or, stuff uncooked, add extra sauce and cooking time and it will equal out. Both methods work, I like to stuff uncooked, 1/2's the time for the process no matter what you are stuffing inside! Definitely gonna be a family favorite. Added my own spices, spinach and loved this with salad and garlic bread, good guest meal!! Thank you Jeff!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefK"
},
"reviewBody": "My husband has raved for 3 days about how he loves this recipe. I made as is accept I did'nt have manicotti so I layered it with lasagne noodles..Turned out beautifully..Chicken Alfredo Lasagna!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cecilia"
},
"reviewBody": "Excellent! My only suggestions would be doubling the sauce and marinating the chicken before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsey"
},
"reviewBody": "I made exactly as the recipe stated and it came out perfect !!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ticamom"
},
"reviewBody": "This is an awesome recipe! A bit high on the calorie count, but if you're looking for that occasional splurge....this is it. I made the recipe as called for with the addition of spinach and some finely chopped sauteed red onion to my ricotta stuffing. I added chopped sauteed mushrooms and garlic to the sauce. I also made additional sauce as some reviewers suggested...drowned my stuffed manicotti in it....oh..I also slow boiled my chicken in a bit of garlic and 1 1/2 cup chicken broth for shredding (about 30 minutes)...that made it easier to stuff the manicotti. Bon Apetite...you will enjoy this one. Thanks for a great recipe Jeff!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookbarb"
},
"reviewBody": "froze well too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Izzy"
},
"reviewBody": "This is tricky! But ooohhh so worth it! Stuffing the shells is quite difficult because they tear so easily, so be careful there. Overall this recipe is DELISH!! Make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Smart Cookie"
},
"reviewBody": "This recipe is perfectly delicious, and not difficult to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki"
},
"reviewBody": "This was delicious! I followed other comments and doubled the recipe for the alfredo sauce and my boyfriend said it was the best thing I've made in the year we've been together!!! I added a sprinkling of Italian Cheese to the chicken and ricotta mixture before stuffing the shells just because he loves it and it turned out spectacular. Garlic bread would have been perfect but since we were out we cut hawaiian rolls in half, buttered, sprinkled with garlic powder, the italian cheese from the bag, and topped with a sprinkling of italian spice and put it in the oven under broil for 4-5 minutes... went perfect together!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "antsandy"
},
"reviewBody": "Didn't have enough flavor for me. Might try my own stuffing next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eTyler12"
},
"reviewBody": "WOW!! This is amazing!!! Very good!! I did add to it a little but overall this is Delicious!! I shredded the chicken, used total of 2 teaspoons of black pepper, and doubled the recipe for the ricotta cheese, egg, oregano, marjoram, and basil. Also used one pound of chicken. I didnt use fresh chopped ingrediants of these three but the dry seasonings and it turned out Fantastic!!! This is definitely a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HappyCookie"
},
"reviewBody": "Very Good! I made some modifications simply for my family's tastes: halved the marinade, used cottage chz vs. ricotta, and less pepper. This went over great with my hubby and toddlers and also with a family that we shared it with. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustBe563"
},
"reviewBody": "Super yummy! The wee ones loved it but don't use canned alfredo... It takes away from the taste. Homemade is always better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elubrano"
},
"reviewBody": "This is an amazing recipe! I boiled the chicken with onion and garlic, so i could shred the chicken...and added some fresh garlic to the sauce and ricotta mixture. Big hit, will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. P"
},
"reviewBody": "This was GREAT! I couldn't find a Ricotta that was 1 pt. I only found one that was around 425 ml. I got the smaller one and wished I had just bought two and had extra. I also added about a cup of fresh broccoli. I had a hard time waiting for the Alfredo sauce to thicken, so I just ended up adding the cheese and calling it good. This recipe was great and I thought it was better than most large chain Italian restaurants. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for a potluck at a home bible study, and it was a hit! Great flavor!\nI did use apple cider vinegar instead of white vinegar and marinated the chicken overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mzlongleggz"
},
"reviewBody": "I loved this recipe! I will definitely be making this again. The only changes that I made was the cheese and pouring the remaining sauce over the manicotti shells. I didnt have any mozzarella cheese so I used about 1/2 cup of extra sharp cheddar and 1/2 cup of mexican cheese blend. It was delicious! Happy Eating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "music-lover720"
},
"reviewBody": "This was delicious and not too difficult. THe only problem that I ran into was working with the manicotti. Not as easy as it looks, but that was probably user error."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Wing"
},
"reviewBody": "I made this dish for Christmas dinner along with other Italian dishes. I had never made Alfredo sauce before, and was a little nervous about making it. This was a simple recipe to make, I was surprised how easy the sauce was to make. I stuffed the shells the night before, made the sauce Christmas morning, and baked as directed. I not a big fan of Alfredo, but my kids are, and they loved it. Only changes I made was to add garlic to the butter (at my son's request) when I prepared the sauce, and I used dried herbs instead of fresh. The manicotti were not dry, and very flavorful. I don't think I will ever buy the jar stuff again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FELESHIA"
},
"reviewBody": "Very good, the family loved it will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I made this and absolutely loved it. The downside... it is too time consuming for a week night meal and the cheese sauce is plenty full at first but when it is reheated for leftovers it seems that there is not enougt sauce.... I will make more sauce next time and maybe even reserve some for the leftovers.... overall Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kitty"
},
"reviewBody": "My husband is from Italy and he liked the recipe, but made some modifications. We did not marinate the chicken and instead cooked it with some oil, vinegar, garlic and a package of frozen spinach. We too left out the egg. The spinach added a nice color and flavor. Next time I think we will use milk instead of heavy cream because it was a bit greasy with the cream and the cheese. We added some cornstarch to thicken it, because it will not thicken on its own. Also, we did not cook it longer than 20 minutes in the oven--45 minutes would burn the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "telizabeth32"
},
"reviewBody": "I made this for my first Manicotti dish ever. I did make some changes though. First, I seasoned the chicken with salt and pepper and lemon juice. I baked it and then shreded it instead of cubing. I also added spinach for flavor and aesthetic reasons. Was very tasty! The shredded chicken was much easier to stuff and I think taste better :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms Z. Jones"
},
"reviewBody": "made this last night. few changes first i added spinach and i used a store made alfredo sauce. Everyone loved it! Even the picky kids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hro"
},
"reviewBody": "The filling has a very strong taste, way too herby - it was inedible! I would only keep this recipe for the alfredo sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family loved this! I used jumbo shells because that was what I had on hand, also did not use the egg yoke or the nutmeg, it came out incredible, and the left overs were even better the next day, my husband who wasn't \"hungry\" when he got home ate 6 shells just because they were so good. Thanks for sharing, we will deff. make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cribrum"
},
"reviewBody": "quick and absolutely delicious! thank you jeff!! my husband is one of those \"picky\" eaters who never touches leftovers the next day and these were gone! made recipe as is and it was superb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hobbitchef"
},
"reviewBody": "I have never attempted anything like this before. but i like chicken and alfredo I said what the heck. It smelled soooooooo good i could hardly wait for it to come out of the oven. I did do some things differently. I didn't make my alfredo sauce or my marinade for one. I used classico creamy alfredo sauce and jack daniels garlic herb and chicken marinade. I cut the ricotta cheese in half no one in my house is a big fan of it. Instead of using just mozzarella cheese i used a 6 cheese blend packet of cheese. i also took out the grated parmesean cheese and I grilled my chicken. thanks for sharing... I will totally make again. maybe tomorrow!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "witowatto"
},
"reviewBody": "Outstanding and Major complements from all who ate this, the only drawback is the time it takes to stuff the Manicotti. The Best part is we have leftover for tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Rebekah Jones"
},
"reviewBody": "Wow! My friends, my husband and I all loved this dish. It is so easy to make and tastes delicious! I use the alfredo sauce protion of the recipe in my other dishes because it's so tasty! I only have one question: What is the easiest way to stuff the manicotti shells? Because that part was a fun mess. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi"
},
"reviewBody": "I'm rating the Alfredo Suace only!!! I would give this Alfredo sauce 10 stars and a Blue Ribbon. I wanted something special for a family party and decided to make chicken alfredo. This alfredo sauce was rated very good so I chose to use this recipe. It was very simple to make and was more than enough for a 1 pound box of pasta. I used 1 cup heavy cream and 1 cup of half and half....worked perfect. My guests were diving in for seconds and complimented the dinner over and over. I'm planning on making chicken and shrimp alfredo for Christmas Eve dinner. Yummy...can't hardly wait. Thanks Jeff for a fantatic Alfredo sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VITOMOJO"
},
"reviewBody": "This was good but I had some small problems with the end result. The filling wound up being a little too dry for my taste, I think next time I will omit the egg and see what happens. My hubby thought it was too rich and too cheesy but he is very picky anyway. It was good and went a long way but I don't know if it was worth all the time it took to prepare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mlssbarbre"
},
"reviewBody": "Great Sauce, great recipe! I have also made it with seafood (crab, scallops, and shrimp)it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "swallac7"
},
"reviewBody": "This recipe took a while to cook and in the end it was very bland.\n\nMy husband enjoyed it, but I didn't and wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Very good !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa L. Gab."
},
"reviewBody": "I read the comments on this recipe and I'm glad I did'nt listen to all. Made this with the ingredients the recipe called for except the egg. I think you can look at the ingredients in a recipe and know if it's going to be too rich,bland,spicy,. It all appealed to me. After reading the comments I knew that even though it didn't say to pour the marinate off the chicken thats what I did. I didn't add any extra oil to cook the chicken. Some said this was dry, so I left the egg out and added a little less chicken. If there is anything I want rich tasting, it would be alfredo sauce. Not hard to make and my family LOVED THIS DISH. Do double the sauce it is so good you will want your manicotti drowning in it. A real keeper...Thanks for sharing........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "We really enjoyed this. As others have said, the alfredo recipe alone is fantastic! I actually used up leftover turkey (diced) in place of the chicken. It left the filling a bit stiff; if you do what I did with the leftover meat, then maybe add some milk to make it easier to fill the manicottis. And double the Alfredo sauce, as others have said a single recipe isn't enought for the manicotties. Finally, I did a double batch of the manicottis, and served the second batch with \"Best Marinara Sauce Yet\". Both were a hit all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MindyLou"
},
"reviewBody": "We did not like this recipe. We also found it bland, and as other reviewers mentioned, for the cost, I would not make it again. Suppose you could use something more to marinate it in that would add flavor, and possibly the marinara sauce added would zip it up. It just wasn't what I was looking for. Thanks though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jessiew1"
},
"reviewBody": "I followed this recipe pretty closely. I did take some of the reviewers advice. I marinated the chicken in oil and garlic and no vinegar. We still found the chicken very bland in the recipe. Also as another reviewer said, the cheese filling got a bit dry and even with the herbs we found it also tasteless. Everything was just too cheesy! We only liked the alfredo sauce, especially since I made it a rose by adding a homemade marinara. For the amount of cost and the work to make this, I wouldn't recommend it. It was not a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shades of Green"
},
"reviewBody": "Very rich, but delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vickie"
},
"reviewBody": "folowed recipie exactly and came out just barely edible the filling was dry for one and the only thing i can say is i did forget to cover with aluminum but by the time baking was done there was no more alfredo sauce filling dry top overcooked dont know if it might be me but too much effort in this dish and not worth the outcome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny L"
},
"reviewBody": "This is a good recipe. It is very rich, so be prepared."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Star Gazer"
},
"reviewBody": "This recipe was VERY good!!! I did have to make a few alterations though. I added LOTS more garlic to the sauce and I sauted some diced mushrooms and onions and added them to the sauce! VERY YUMMY! I did forget the egg in the ricotta mix but it came out just fine nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dragngirle"
},
"reviewBody": "Had to use jumbo shells instead because when I opened my box of Manicotti they were all broke so luckily I had the shells on hand. Worked out just fine. Served with Ceasar salad &amp; fried bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nlayhoss"
},
"reviewBody": "this was a taste bud explosion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie62"
},
"reviewBody": "I served this at a women's luncheon. You should have heard them rave! It was a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLeigh"
},
"reviewBody": "This is an excellent recipe just for the Alfredo sauce alone. However, the sauce was missing one thing: fresh garlic. What I do is add 4-5 cloves of slightly crushed garlic to the melted butter, and I let them saute' VERY gently for about 4 minutes, then remove them. It is absolutely divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scientistandrea"
},
"reviewBody": "I know that this recipie is REALLY high in fat, calories, sodium and pretty much anything else that is bad for a human. BUT IF you can just eat light the next couple days and omit an oreo or two at bedtime then you can justify eating this! This is not something I could have time or money to make as everyday meals but it worked GREAT for my dinner party. It looks very difficult, smells great and will please a large hungry dinner party. Serves well with sauteed mushrooms or spinach :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TifMich6"
},
"reviewBody": "OMG! This was the best! I am using the alfredo part just for a good alfredo sauce. I didn't use the marjoram because I didn't have any. It was still ecxcellent! I even cooked it the 45 minutes on the grill. It is hot here in AZ and I didn't want to heat up my house by using my oven. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queret_Mom"
},
"reviewBody": "Wonderful! I made this for a dinner party and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bcastellano"
},
"reviewBody": "No idea what I did to this recipe but mine didn't turn out good. I did marinate for longer then an hour so maybe thats what I did wrong. I also noticed the next day the manicotti was oily. I might make it again with adjustments. Thanks for the recipe\n\nI made this again today 11/5 and it was a lot less oily, I made sure I patted the chicken very good after it was cooked to dry up some of the oil. But the next day it was oily again, not sure what its coming from but hubby still liked it, I might make it again but if anyone has any idea what the oil is about that would be helpful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LCURT"
},
"reviewBody": "I usually love alfredo but found this too rich for my taste. However, my husband loved it so I know I will be making it again with some adjustments like using milk instead of whipping cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A great recipe idea for sure!! I cut back on the spices a bit, and used 1lb of boneless chicken tenders marinated in olive oil, white wine, and garlic (with pepper, oregano etc.). \r\n\r\nFor pasta, I used ready-bake lasagna (soak it in hot water for 10 min to soften) and made 12 rolls. I had some leftover chicken which I sprinkled around the baking dish.\r\n\r\nAlso, I added broccoli and carrots both in the stuffing and in the caserol dish.\r\n\r\nYummy, yum yum!!\r\n\r\nCG"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natalee"
},
"reviewBody": "WAYYYYYYYYYY to much italian seasoning for my taste. Other then that it was really good. Next time instead of all the seasoning, I will add some garlic to the ricotta cheese and stuff it plain. I loved the chicken. With the Marinade it turned out really good. My husband liked it. Instead of using your recipe for alfredo sauce, I used a homemade recipe that is a huge success with my family. Next time I will know what to add and what to take out!\r\nThank you for adding the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AMY CARLISLE"
},
"reviewBody": "Very good and easy to make. An interesting twist on manicotti! I will definitely make this again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12069/chicken-manicotti-alfredo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16767/world-cuisine/european/italian/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1796/world-cuisine/european/italian/main-dishes/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12069/chicken-manicotti-alfredo/",
"name": "Chicken Manicotti Alfredo"
}
}
]
}
}
, "about": [
]
}
]