				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Biryani"
,"datePublished": "1999-12-19T23:47:13.000-05:00"
,"dateModified": "2022-10-21T11:34:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Nazia"
,"url": "https://www.allrecipes.com/cook/24327033"
}
]
,"description": "Chicken biryani is a traditional South Asian rice dish with tender chunks of chicken in a creamy, spicy blend of onion, garlic, tomatoes, and spices."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4AT6ruhq4dPKpPmK_3BGcTqd1vs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1932914-9afbbe1d33a24aef9598f8c8f76bc4a9.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1904432957001",
"description": "Watch how to make this top-rated Indian dish.",
"duration": "PT7M58S",
"name": "Chicken Biryani",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4c7dc2cb-d036-461a-9312-efdd3059868b/d3d5d37d-3d6b-49a4-9827-4f2bb74dddd2/1280x720/match/image.jpg",
"uploadDate": "2021-07-07T19:43:44.615-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Biryani"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "160"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "832 kcal"
,"carbohydrateContent": "79 g"
,"cholesterolContent": "134 mg"
,"fiberContent": "5 g"
,"proteinContent": "48 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1522 mg"
,"sugarContent": "5 g"
,"fatContent": "35 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 tablespoons vegetable oil, divided",
"4 small potatoes, peeled and halved",
"2 large onions, finely chopped",
"2 cloves garlic, minced",
"1 tablespoon minced fresh ginger root",
"2 medium tomatoes, peeled and chopped",
"1 teaspoon salt",
"1 teaspoon ground cumin",
"0.5 teaspoon chili powder",
"0.5 teaspoon ground black pepper",
"0.5 teaspoon ground turmeric",
"2 tablespoons plain yogurt",
"2 tablespoons chopped fresh mint leaves",
"0.5 teaspoon ground cardamom",
"1 (2 inch) piece cinnamon stick",
"3 pounds boneless, skinless chicken pieces cut into chunks",
"1 pound basmati rice",
"2.5 tablespoons vegetable oil",
"1 large onion, diced",
"5 pods cardamom",
"3 whole cloves",
"1 (1 inch) piece cinnamon stick",
"0.5 teaspoon ground ginger",
"1 pinch powdered saffron",
"4 cups chicken stock",
"1.5 teaspoons salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat 2 tablespoons of oil in a large skillet. Fry potatoes in hot oil until lightly browned, about 3 to 5 minutes. Remove to a paper towel-lined plate to drain; set aside."
} ,{
"@type": "HowToStep"
,"text": "Add remaining 2 tablespoons of oil to the skillet. Add onions, garlic, and fresh ginger; cook and stir until onion is soft and golden. Add tomatoes, salt, cumin, chili powder, pepper, and turmeric; cook, stirring constantly, for 5 minutes. Stir in yogurt, mint, ground cardamom, and cinnamon stick. Cover and cook over low heat, stirring occasionally, until tomatoes are cooked to a pulp. It may be necessary to add a little hot water if mixture becomes too dry and starts to stick to the pan."
} ,{
"@type": "HowToStep"
,"text": "Add chicken and stir well to coat. Cover and cook over very low heat until chicken is tender, 35 to 45 minutes. There should only be a little very thick gravy left when chicken is finished cooking. If necessary cook uncovered for a few minutes to reduce the gravy."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make the rice: Wash rice well and drain in a colander for at least 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large skillet. Add onion; cook and stir until golden. Add cardamom pods, cloves, cinnamon stick, ground ginger, and saffron; stir in rice until coated with spices."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4AT6ruhq4dPKpPmK_3BGcTqd1vs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1932914-9afbbe1d33a24aef9598f8c8f76bc4a9.jpg"
}
]
,"text": "Heat stock and salt in a medium pot until hot; pour over rice and stir well. Add chicken mixture and potatoes; stir gently to combine. Bring to a boil. Reduce heat to very low, cover with a tight-fitting lid, and steam for 20 minutes without lifting the lid or stirring. Spoon biryani onto a warm serving dish."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Massimo Saccomando"
},
"reviewBody": "I've made this recipe many times and I love it its so flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsssrobertson"
},
"reviewBody": "This is the second time I’ve made this recipe and I love it!!! It’s one of my go tos!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ghada Maz"
},
"reviewBody": "wow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ahmad Saaydoun"
},
"reviewBody": "Not a traditional biryani but it taste nice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was well written very easy to follow and it was delicious \nI had to make a few changes since I used a premixed biryani spice but all and all it was great will definitely be making it again soon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ananya Sk"
},
"reviewBody": "I did mine in the Instant Pot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "The flavour in this was pretty good. Only changes I would make would be to cut the rice in half....there is way to much. I'd also probably add a tad more chili powder (not what we Canadians call chili powder but \"red chili\" powder) and when prepping for the rice I cooked the seasoning in the oil before adding the rice to the mixture. Overall a pretty good dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aarya patil"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roula"
},
"reviewBody": "i cannot believe someone would think this is not the best Biryani ever been made. Truly delicious. I make this dish at family gatherings.. a sheer crowd pleaser. Thanks from the bottom of my heart"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gruevy"
},
"reviewBody": "This recipe is delicious. I've never had any at a restaurant so I don't know anything about authenticity, but I made it as directed and loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This turned out so good! It's just my husband and and I so i didn't do as much chicken or rice but I did double the spices (as others recommended) we still had leftovers which heated up good. This recipe will surely be added to my recipe folder!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rindy"
},
"reviewBody": "It came out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sadia Zafar"
},
"reviewBody": "20 minutes for potatoes to cook under steam is insufficient so naturally they came out practically raw! I followed this recipe to a tee but it tasted completely bland, undercooked potatoes, over cooked rice and both me and my boyfriend hated it. Only reason I decided to follow this recipe was because I was out of the Shaan biryani mix. \n\nIf I try this the next time I’m going down on the amount of chicken, adding the potatoes in earlier and definitely at least doubling up on the salt and chili powder so it doesn’t taste like a bland mashed up dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hildamae"
},
"reviewBody": "I'm delighted I had the courage to attempt an authentic Indian recipe. We loved this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gudi"
},
"reviewBody": "Didn't use saffron as I did not have it at home.\nYes. Making it again :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Life Is Wonderful"
},
"reviewBody": "thanks for sharing the recipes, this was the first time I made it, even I hadn't tried it before, but my boyfriend did, and he loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Minnifield"
},
"reviewBody": "Instead of saffron, I used garam masala. Nice kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "Not difficult - was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jo"
},
"reviewBody": "The flavours were great but the rice partially cooked and partially went to mush. Recipe made as written. Disappointed after all the ingredients needed and time it took to prepare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "florin"
},
"reviewBody": "Nothing special. Also the potatoes weren't done by the time the rice was. As you can imagine, this is quite a big issue. Not worth the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aed1129"
},
"reviewBody": "I don't know much about the authenticity of this dish but it was good! I followed the suggestions of a couple reviewers, I doubled the spices (will triple all next time except the tumeric) and I could not find cardamom at my grocery store so I left it out. Not sure if I missed it not being in there because I don't recall what it tastes like. I also used chicken legs and they turned out great. Next time I will add raisins. All in all a good recipe just need more spice to it so double them for sure. I think this would've been pretty bland if you don't at least double them.\n\nAlso, this isn't all that time consuming to make this if you have things ready to go and multi task a bit. I would say it took me between and hour and an hour and a half to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Souvik Banerjee"
},
"reviewBody": "made it without tomatoes, still tasted yummy !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martin Warren"
},
"reviewBody": "I have made this recipe a few times now, and have made a couple alterations that I enjoy and kicks the flavor up a notch.\n\nI purchased a packaged Biryani kit, Kitchens of India Hyderabadi Biryani Paste. It includes a package of spices that are harder to find in my area, so that helps.\n\nI used the paste in the kit and mixed it with a half cup of plain yogurt a day ahead. I then put whole drumsticks and thighs into the curried yogurt and marinate overnight. \n\nI skipped the potatoes, and added soaked raisins during the last step. Other than that, I followed the recipe exactly, and was able to use the spices that came with the kit and supplement with my own. I did find that marinating the chicken with the yogurt does result in more gravy, but that's just fine with me!\n\nWhile this recipe says to wash the rice and drain in the colander for half an hour, I would recommend soaking it first, then draining. Before making this recipe I rinse the rise thoroughly, then put it into a bowl and cover with water, letting it soak for 5 minutes or so, then into the colander and let it dry for the remainder of the time you are making this recipe, which should be an hour or so. This should give you a very nice, non-stick, fluffy rice.\n\nTo punch up the presentation, when this meal is done, scoop about 3/4 of a cup of the finished rice mixture into one bowl, and another 3/4 cup into a second bowl. In bowl one, add about a half teaspoon or so of Tumeric and mix thoroughly to get a rich orang"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashanti Israel"
},
"reviewBody": "It is a long process but so good and worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robby W"
},
"reviewBody": "I added a bit too much water and my very low heat was too low. I made it for my friend who is from Malaysia who eats authentic Indian food and he said it had all the right flavors and was very tasty. Nice recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "YummyTummy"
},
"reviewBody": "Made as written, it didn't impress me but was edible. I won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bhabiskitchen"
},
"reviewBody": "One of the Tastiest Biryani recipe I have ever read \nRegards,\nbhabiskitchen"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Eman Efird"
},
"reviewBody": "I have made this recipe two times. The second time I doubled the spices as others suggested and it was much better. I also added small carrots and zucchini in the last step and garnished with cilantro. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YummyFoodRecipes India"
},
"reviewBody": "Delicious food..!! I love chicken recipes especially biryani. Goof effort and showcased in details how to prepare food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gourmette"
},
"reviewBody": "It turned out wonderful. I did not have any mint and I used powdered ginger and cinnamon and cloves but all was great in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Elizabeth Richards"
},
"reviewBody": "I give it a like because my fiancee who HATES Indian food likes it. To me, however, it is not spicy at all....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Priyanka_23"
},
"reviewBody": "This is not a biryani, it is actually a pulao. In a biryani, the meat is cooked at the bottom of the pot and the rice, butter and spiced are layered on top of it.\n\nHowever, this recipe is delicious and takes way less time than a biryani! I always make this recipe a little more traditional by topping the finished dish with chopped mint and coriander, and drizzling it with melted clarified butter (ghee) and a little rose water. This really makes a difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Fox"
},
"reviewBody": "I have made this recipe about 5 times now and it is a very good base. I have made some changes, just as it seems others who have rated this recipe have done. I wanted to make it taste more like the biryiani that my favorite Indian restaurant makes. It is not very hot spicy at all so I added about 2 tsp cayenne pepper and a chopped jalapeño when I sauted the onion. I also increased the amount of all the spices, about double the amount works in my opinion. I did not have cardamom pods so I used 3/4 tsp ground cardamom instead and I also used saffron threads instead. I added about a cup each of broccoli, cauliflower, carrots and string beans, all cut up into appropriate sizes and sauted in vegetable oil. Those were added into the rice with the potatoes. I also threw in golden raisins and cashews. When all these changes were made, my family thought the biryiani was just right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "domestically challenged"
},
"reviewBody": "not flavourful enough. It was good, but not an Indian dish I was expecting. \nIt makes tons of food, next time I will use less rice and chicken but the same amount of spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff S"
},
"reviewBody": "Great recipe. This was my first attempt at Indian cuisine and it was delicious. It takes some time to prepare but the results are worth it. I substituted olive oil for the vegetable oil and white rice for the basmati rice, but otherwise I followed the recipe as-is. My kids, who are both picky eaters, loved it.\n\nOne mistake I made was using canned tomatoes--I added the entire contents of the can instead of draining the tomatoes first. This added excessive fluid to the gravy mixture resulting in longer cooking times before it would thicken. Next time I will drain and add the liquid only as needed.\n\nI bought fresh mint per the recipe and I'm glad I did--you can taste it in the baked dish and I think it really helps bring out the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy naqvi"
},
"reviewBody": "My husband is from Sind province, Pakistan. I've been cooking Pakistani/Indian dishes for 25 years. I thought I'd try this recipe. My family liked it, but not as much as the authentic style I usually make. This is more like a plou not biryani. I will make this again with a few variations. Instead of frying more onions while cooking the rice. I will add the spices and let them fry until fragrant then add the rice and the chicken stock. ( to tell you the truth, I will probably use water not stock) I will cook the rice until half done. Then in a new pot I will scoop 1/3 of the chicken mixture on the bottom. Add some fresh mint leaves and some fresh tomatoes slices on top. Then put 1/3 of the half-boiled rice on top. I will layer two more times ending with the rice on top. As someone noted you really need to cook the rice on medium heat or it will be soggy. That is why it is best to cook the rice separately half way then layer. At the end, when there is no more liquid left you can cover it with a couple paper towels or a cloth and then put the lid on top. That is when you simmer it on low temperature for 20 mins. That helps to remove more moisture and the rice will come out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hebah"
},
"reviewBody": "Excellent ! I changed the servings for two people (the salt was a little short). My husband loved it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hinchetnee66"
},
"reviewBody": "My guests really like this as lunch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hamdan03"
},
"reviewBody": "Love this recipe, not spicy at all, I am able to make as spicy as I like. Great tasting, little time consuming, but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "acdebeer"
},
"reviewBody": "Lovely Biryani. Used to eat this a lot at work many years ago when I was working for Indian people. Always wanted to try it for myself, so I tried this recipe. Only negative was that my potatoes was not cooked. Next time I'll add them while the sauce reduces. I'd rather have them overcooked, than not properly cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lexipex"
},
"reviewBody": "I didnt like the taste of this at all. Too salty, and something wierd that I cant put my finger on. Also, very little flavor for the amount of rice and meat. The biryanis I grew up with in South Africa make this one a complete non-contender. It tastes like a bland stew to me, and not at all like biryani."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elzorro"
},
"reviewBody": "I haven't tried the exact recipe - but the technique REALLY helped me with my own biryani/curry/paella creation. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yslint"
},
"reviewBody": "Best Dish i have ever prepared.. I did not have any Saffron.. could not find it anywhere... still came out great..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony2008"
},
"reviewBody": "I love this Dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sen"
},
"reviewBody": "Thank you for this super recipe, I've used it on a number of occasions (with a few modifications) and have always got rave reviews... it is an easy-to-make-can't-get-wrong recipe for super biriyani, thank you once again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "chaiandallthatjazz"
},
"reviewBody": "I followed this chicken biryani recipe closely, but it didn't turn out well at all. It was really bland. Which is shocking, because it smelled amazing. After 3 hours of prep/cooking, I was quite let down by the way this turned out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Szatkowski"
},
"reviewBody": "We made this today, it's wonderful. We made it for a young man that we know that is from Bangladesh and he said that it tasted just like home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sfill"
},
"reviewBody": "This is on my families favorite recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruthann"
},
"reviewBody": "I made this using the exact recipe (no substitutions/changes) and it is exceptional! Glad I have a well-stocked spice cupboard (thank you, Penzey's!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrew_choppa"
},
"reviewBody": "I'm used to cooking an authentic lamb biryani a completely different way. I even tossed up whether to adapt my version to this one, but I'm so glad I didn't!! This recipe is sensational!!! I followed the directions exactly (except I used a bit less salt!) and apart from the accompanying picture being incorrect, it turned out perfectly!! Great flavours, succulent tender chicken!! Can't wait for leftovers tomorrow night!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Rajan"
},
"reviewBody": "My husband is from southern India and this is one of his favorite dishes. This recipe is made in different ways, the Muslim version (according to him), being the best, and most difficult. I made this recipe for my husband; however, I think it's important you chop up 3 small green chiles and cook it with the tomato mixture, that way, it gives this dish the necessary kick as in India. Also, my husband said the original version is made with hard boiled eggs and not potatoes, though I made it with potatoes. Finally, along with the green chiles and tomato mixture, I also added about 2 tablespoons of red pepper flakes. Overall, this recipe is good and my husband said it tasted EXACTLY like the way his mother made it back in India."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I have no idea how \"authentic\" this recipe is, but we can now say our very picky 5 year old ate Indian food with joy. This was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janine Moore"
},
"reviewBody": "This was incredibly good. The cover picture is misleading though. The rice is cooked together WITH the chicken. Had to read the recipe a couple times to get that. The flavors were stunning. Best Indian I've ever made. Will definitely make it again. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carolwithak"
},
"reviewBody": "This was the first biryani recipe that I tried and have been cooking it for about a year now whenever I'm craving some Indian food. I bought packaged spice mixes from my trip to India a two years ago and use the one labeled Madras curry and potato masala instead of measuring every single spice out, but I still add in the cinnamon sticks and whole cloves and it tastes great. I also add some more vegetables: carrots, peas and more potatoes, then it's a hearty main dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Evans"
},
"reviewBody": "It was great! Though I did need some added zing - maybe some Paprika? I felt it needed to be much spicier, but the flavor overall was great, and most of my friends who enjoyed this dish are not into spicy foods - so just perfect! I did not have yogurt on hand - used sour cream instead and it tasted just fine. Curious to know what the difference in taste might have been. Definitely making again in the very near future! Served w/Basmati rice &amp; I also sprinkled lots of the Pampered Chef Moroccan Rub on top! MMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "azraqelrouh"
},
"reviewBody": "I'm a little confused, It says 2 large onions, finely chopped &amp; then 1 large onion, diced again? Is it a combination? Is it meant to combined?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tahnia123"
},
"reviewBody": "my mom makes the best biryani but she makes the boxed one from p[ran"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer McArthur"
},
"reviewBody": "Fantastic! Wouldn't change a thing. We didn't have Saffron so we used Saffron rice mixed with Basmati rice. We have a top notch Indian food restaurant close by that this recipe rivals, if not exceeds. It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "My first time to cook chicken biryani, it turnout really good, my hubbie loves it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cannuck1972"
},
"reviewBody": "This is a little bit different than other biryani I have tried but it is excellent. It is worth the time it takes to put it all together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Preetmx"
},
"reviewBody": "Of all the Biryani recipes that I've tried so far, this one is my top favorite. I hardly made any changes to it and it turned out super delicious....love it. the cooking time is not as long as it seems, the only time consuming part is cooking the chicken. I'm definitely going to make it over and over again....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JK"
},
"reviewBody": "Five stars if the spices were doubled and half were used to pre-season the chicken. I cooked the chicken on it's own, then added to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alles"
},
"reviewBody": "Love Love Love :) Biryani has always intimidated me, but this was delicious. The hubbs agreed, as evident by his desire for second helpings. He couldn't stop raving about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "candace"
},
"reviewBody": "my first try and it turned out much better than I expected, however, I have to say it turned out way toooo salty. Next time I won't use any salt and only half chicken stock and half water or maybe just the salt and all water and no chick stock at all, other than that it was perfect Tastey and spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sutirtho"
},
"reviewBody": "Made my 1st Biryani today... and all of my friends liked it! 5 stars :):)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kanchanshaw"
},
"reviewBody": "This recipe is much too time consuming... and seems to mix a LOT of spices... I do love chicken biryani. I have a tried and tested recipe in my Recipe Box that I use for cooking biryani once a month."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neil"
},
"reviewBody": "takes a while to make but well worth it makes a lot of food half this recipe for 4 people"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stiltskin"
},
"reviewBody": "thanks for this easy recipe... i love eating my bestfriend's version of biryani........and miss it a lot(im home now n davao) so iv been searching high &amp; low for a perfect recipe and found yours! and lurrrrrve it! Thanks a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kriszti"
},
"reviewBody": "It was very easy to follow the recipe and the biryani was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bsunil"
},
"reviewBody": "Very delicious and simple recipe for biryani! I did increase the amount of garlic, ginger, and chili powder and instead of stock I used water. Usually making biryani can be so laborious if you layer up the rice and chicken, but this recipe was easier and soaked up the spices and seasoning very well. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sams girl"
},
"reviewBody": "Very Tasty! I made this with no changes, except I doubled everything. A friend who had actually tasted this dish IN Bangladesh said it was very very close to what he had over there. WONDERFUL FLAVOR THE NEXT DAY! Thank you for posting! God Be With You!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephan Peters"
},
"reviewBody": "Not as hot as I would have liked, and required a lot of kitchen prep but was very nice and savory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carleigh Vollbrecht"
},
"reviewBody": "Easy to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROBYNBNB"
},
"reviewBody": "This was really good and yeah a little more work then I usually do for dinner. I added a little more of all spice and added marsala too. I added the spuds back with the chicken to cook them thru. Used ground cloves and no salt and used canned tomato, every thing else the same. The Authentic Biryani on this site is good too, by su. Would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "I was somewhat disappointed by this recipe after putting in about 2 hours of preparation. The potatoes were not completely cooked (had to pick them out and microwave them for a minute or two), the chicken didn't absorb any flavor and was very dry, and some of the rice wasn't cooked all the way either. I was disappointed by how bland it was in spite of all the spices used. It was all around okay but I probably wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci-in-Cali"
},
"reviewBody": "I used the recipe for the chicken but not the rice since I used a rice cooker. I also used chicken thighs instead of breasts because it's what I had. I did use all the spices and this was very tasty!.. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nadeuariel"
},
"reviewBody": "it came out very delicious. the only problem was that there was way too much liquid and it didn't reduce down so i had to remove it but once that was solved my family and i enjoyed it very much =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyler"
},
"reviewBody": "Even though I didn't have chili powder It was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XXXNAUGHTY"
},
"reviewBody": "Delicious. I did add some chicken broth to the mix though since I used vanilla yogurt; had to balance the flavours. So good, especially with Indian Saffron Rice from this site and steamed broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adrienne tran"
},
"reviewBody": "great recipe! it was a little too mild for me, and considering i'm pretty sensitive to hotness.. i'd add some more chili powder i also added peas, carrots, and red bell peppers which i thought was a great touch. (the bell peppers especially gave it a refreshing crunchiness)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hildagard"
},
"reviewBody": "Amazing!!! This recipes took FOREVER to make! But it is lots of fun if you have good wine, music and company while you make it-:) Preparation and Eating was a totally spiritual experience:) Certainly a dish I will reserve for special occasions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AKrause"
},
"reviewBody": "I enjoyed this recipe - it was easy to make, prepared quickly, and is tasty. Next time, I will pre-wash my rice to avoid some of the pastiness.\n\nI used ingredients that I had on-hand which included:\nBoneless, skinless chicken thighs - I'd recommend thighs over breast, or bone-in pieces (even though most authentic Biryani seems to contain bone-in chicken).\nGround cinnamon - since I had no sticks available, using ground cinn. did not detract in any way.\nDried mint flakes instead of fresh - again, using dried mint had no negative effect.\nGround ginger - no problem with this substitution.\nSour cream instead of yogurt - another harmless substitution.\nI had no cardamom...it would have been nice, but it was fine without.\nPreparation - I prepped the potatoes as directed, then prepped the rice and chicken separately. I combined the chicken, potatoes, and rice at the very end to speed the process and keep the potatoes from getting too mushy.\n\nThis was not exactly like the Biryani that I eat in restaurants, but was every bit as good in its own right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADELINE D"
},
"reviewBody": "We love indian food, and found this recipe as a good starter. I have made it 2 or 3 times and have compared it with other biryani recipes I have found. \n\nI think if I had a biryani spice mix maybe that would kick it up a notch, but as it is, I would increase the cumin, ginger, and garlic as well as the clove. \n\nOther biryani's I have had have included cauliflower, carrots, peas, raisins and cashews and I include them in lieu of the potatoes. Since there is already rice, I don't see the need for another starch. I would also use ghee rather than oil. And last, I would use 3 or 4 tomatoes instead of only 2. I would look for a solution to the problem I had of cooking the rice, on a low setting, the rice at the top was crunchy and the rice at the bottom was soggy. Also, i like some heat in my indian food and this is completely without any spiciness to speak of...I would put a tsp of garam masala to give it some of the hot spice I anticipate when I eat indian food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Anis Cadlum-Mesia"
},
"reviewBody": "Indian restaurants are few and far between, hence I tried to make one at home. After endless search and trials, this one is perfect for me and my husband (we both worked in the Middle Eastern region at one time). Time consuming but really worth it in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveNCyprus"
},
"reviewBody": "I'm only giving 4 stars because I think potatos in Biryani is wierd (I left them out). With that adjustment, plus extra mint, and a biryani spice mix instead of the powders, it was EXCELLENT. But this is all according to taste, so do whatever you want to adjust to yours and it will be a 5 star meal. I think next time I will use ground spices in the rice rather than the whole (even if it is more authentic, I don't like to bite down on a whole cardamom or clove, and I don't think the flavors got to the rest of the rice as powedered spices would)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "honeyz"
},
"reviewBody": "The taste made my boyfriend fall in love with me, again..The way to a man's heart is through his stomach.. and now i totally believe that..Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "This came out great. A little labor intensive, but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRINGORN"
},
"reviewBody": "This was pretty good, but I thought it was alot of work. My rice also turned out a bit too soft. Served it with plain yoghurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "siritta"
},
"reviewBody": "really really enjoyed this dish, fantastice recipe! i would definitely recommend, i did add extra chilli as prefer it to be a little spicier. my little sister also enjoyed it even though she is a very picky eater. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LisaM"
},
"reviewBody": "Added more chili pepper for more spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gregory TW"
},
"reviewBody": "This recipe certainly made our Christmas day memorable. It took some time to put things together, but the end results were excellent. We enjoyed it so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Green Angel"
},
"reviewBody": "This was great! The version of biryani (there are many) that I'm familiar with doesn't have potatoes, so I left that ingredient out. Also, the ghee made all the difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I don't have a problem with recipes that have several steps and/or require a lot of prep time, as long as the results are worth it. This wasn't worth it, imo. I ended up adding a lot more spices and yogurt, and most of a can of tomatoes. The end result wasn't terrible, but it was quite a lot of work for rather mediocre results. Thanks anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommymeggy"
},
"reviewBody": "This was great; the cardamom offers a delicious and different flavor. The only change I made is using water rather than broth to cook the rice in; with all the spices it seems unneccessary and wasteful to use broth. I'll definitely make biryani again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "San"
},
"reviewBody": "This recipe is awesome! The best biryani recipe ever! I skipped the potatoes since it dint work well for me before. After reading a few reviews, I decided to add more spice. I added 1 tsp of chilli powder, 1 tsp of ground pepper instead of half tsp each. This is the first time that I have succeeded in making a good biryani! Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PNLewis"
},
"reviewBody": "I made this as a covered dish for our foreign exchange student's orientation. It was a huge hit. My son, who is a picky eater, told me the recipe was a keeper! I did not have cardamomor powdered saffron. I used a biryani spice mix, omitting the spices included in the mix. I also used saffron threads, which probably would have made the rice a beautiful yellow had I known how to use it properly. Thank you for sharing this wonderful dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "momica"
},
"reviewBody": "This really isn't the best biryani recipe I've made, but it's fast for biryani so I thought I'd give it a shot.\n\nI had to double all the curry spices and added a good helping of garam marsala. I never even tasted a hint of mint so I'm thinking that doubling the mint might help as well.\n\nWhen you're cooking your rice, I would eliminate the onions and let the spices sit in the oil until it's nice and fragrant. Then add the rice and cook for five minutes to let the rice absorb some of the flavors. Once you've added it to the rest of the recipe don't cook on the lowest temp or it will get soggy. You need to cook basmati rice on a med-low heat and much faster to avoid soggy rice.\n\nThis recipe is HUGE. I cut it down to four servings and still had too much food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hipchickrecords"
},
"reviewBody": "Even with all the spices, it was slightly bland in my opinion, but better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gulzar"
},
"reviewBody": "hey I jst made my 1st biryani wid ur recipe n u no what it turned out to be awsome.. thanks a million..i never thought making biryani was so easy.. once more thanks"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16102/chicken-biryani/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16102/chicken-biryani/",
"name": "Chicken Biryani"
}
}
]
}
}
, "about": [
]
}
]