				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Cordon Bleu Lasagna"
,"datePublished": "2019-04-02T02:59:53.000-04:00"
,"dateModified": "2019-04-02T02:59:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "fotoe!78"
,"url": "https://www.allrecipes.com/cook/4211559"
}
]
,"description": "This lasagna, made with Swiss cheese, cooked chicken, and deli ham, has all the flavors of chicken Cordon Blue without a lot of fiddly preparation."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/LWJzYZu4zzCGh7f2iSPEH6hKg9U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8674075-98252b8a945e4ad69122143bfd607e3c.jpg",
"height": 1833,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Cordon Bleu Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "67"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "691 kcal"
,"carbohydrateContent": "41 g"
,"cholesterolContent": "156 mg"
,"fiberContent": "2 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "27 g"
,"sodiumContent": "768 mg"
,"sugarContent": "6 g"
,"fatContent": "44 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (8 ounce) package lasagna noodles",
"0.5 cup butter",
"1 (8 ounce) package cream cheese, softened",
"0.5 teaspoon salt",
"0.5 teaspoon onion powder",
"0.25 teaspoon ground black pepper",
"1.5 cups shredded Swiss cheese",
"1.75 cups warm milk",
"2.5 cups cooked chicken, chopped",
"8 ounces deli ham, chopped",
"0.5 cup shredded Swiss cheese",
"0.5 cup bread crumbs",
"1 pinch Italian seasoning, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a saucepan over medium heat; stir cream cheese into hot butter until it begins to melt, about 5 minutes. Season with salt, onion powder, and black pepper. Whisk warm milk gradually into cream cheese until smooth; stir in 1 1/2 cup Swiss cheese. Bring sauce to a simmer, stirring constantly, until cheese has melted and sauce has thickened, 5 to 10 minutes. Remove from heat."
} ,{
"@type": "HowToStep"
,"text": "Spread 3/4 cup of cheese sauce into bottom of a 9x9-inch baking dish. Arrange 1/3 of the lasagna noodles over the sauce and spread half the cooked chicken and half the ham over the noodles. Pour 1 cup sauce over chicken and ham. Repeat layers starting with half the remaining lasagna noodles, remaining chicken, remaining ham, and 1 more cup of cheese sauce. Finish by layering remaining lasagna noodles, remaining sauce, 1/2 cup Swiss cheese, and bread crumbs; sprinkle top with Italian seasoning. Cover dish with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until casserole is bubbling, about 25 minutes. Remove foil and continue to bake until crumbs are browned, about 10 more minutes. Let casserole stand 5 to 10 minutes before serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen May"
},
"reviewBody": "So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkphoto810"
},
"reviewBody": "So good! I used a 13x9 dish and also added steamed spinach to a layer. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacolyn "
},
"reviewBody": "This was creamy, moist, tasteful, and of course, unique. An easy weeknight dinner I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "This is a rich but good lasagna. I used sliced deli ham and did not chop. I cooked my sauce on low, as medium would have scorched it. The recipe was very easy to follow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Wow was this good! It’s more work than I’d do for a regular rotation meal but it’s worth the effort. I found it takes patience to get the cream cheese to melt into the butter. Lots of whisking did the trick. I doubled the sauce and made it in a 9x13 pan. The doubled sauce was too much for this size, but I’d rather have too much than not enough. It was such a good meal. I’ll definitely make again! I HIGHLY recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kati Cole"
},
"reviewBody": "Followed the recipe except for gluten free noodles and breadcrumbs, and adding some garlic. Four adults = four rave reviews. We loved it. I've been asked to do a double batch in a taller, bigger pan. It's easy enough I could almost trust husband to try making it next time. I could see freezing it before baking and having it on hand for lazy nights, too. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "I'm really surprised that this recipe has received such good reviews. I just made it last night, following the recipe exactly as written. And what I got was a very dry and almost taste-less lasagna. :( I think it would be better if more sauce was used (to make it less dry) and if something was added to give it more flavor -- maybe some sauteed onion or something. Unfortunately, this recipe isn't a keeper and I won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Saymansky"
},
"reviewBody": "This is absolutely delicious! I NEVER have leftovers. Have to make double batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Eckels"
},
"reviewBody": "Was delicious! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Omg amaaaazing... I’ve made this 3 times in the last month because my kids can’t get enough. The first time I made it exactly how it is written and it was really good.. the second time I added a tbs of minced garlic when melting the better for the sauce and it was even better. The third time I added the garlic and I used a mix of Swiss and mozzarella for the sauce and then for the bread crumb topping I used 1 C of Italian seasoned panko mixed with 1/2 C of melted butter. I then lightly sprinkled that topping with shredded white cheddar. These slight changes made the best version. I highly recommend using garlic and panko bread crumbs with butter. I also never chopped up the deli ham.. I just layered it on top of the noodles followed by the shredded chicken, followed by spooning the sauce over that and then beginning with noodles again. I also used a rotisserie chicken and the other times cooked my own chicken in the slow cooker, both methods worked well. Use high quality deli ham though, it makes a difference. Overall excellent kid approved recipe at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ross"
},
"reviewBody": "Incredible but very runny. I will definitely make it again but will use half of the butter and mill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "renabeth"
},
"reviewBody": "My whole family ate it and liked it, which is not a common occurrence, so I am very happy about that. I made a small batch with some frozen veggies on the bottom for myself and really liked it like that. It's a bit rich for regular use, but I will make it again for sure. It would be super quick if you already had some cooked chicken and leftover noodles. It uses a lot of pots and pans if you do it all in one cooking so that and the richness are my reason for not giving it five stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allyson Hester"
},
"reviewBody": "Holy WOW! This is amazing! \nI used no boil noodles and doubled the sauce to make sure there was enough liquid to soak into the noodles. \nI baked the chicken breasts. \nTopped with Italian Panko Bread Crumbs. This is awesome comfort food for a cold day! I will DEFINITELY make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Arnold Williams"
},
"reviewBody": "Just take a chance and make this recipe! All the reviews are right in how delicious this is and EVERYONE loved it and had seconds. I did double the sauce bc of others suggesting it since we like plenty of sauce and only other change was I used 1 cup of Italian blend cheese in the cream cheese sauce in addition to the Swiss only bc I ran out, then and topped with 1/2 c of shredded mozzarella and provolone and it worked perfectly. Thank you for this awesome dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Knapik"
},
"reviewBody": "I use a rotisserie chicken and ham off the bone... I also used the Italian blend cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrarm "
},
"reviewBody": "Made this the other night the only thing I changed was I used Italian bread crumbs and I doubled the sauce as I used a bigger pan. Also don't use no bake noodles the noodles didn't get quite done. But everyone still loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EasyOnTheSalt"
},
"reviewBody": "OMG! I love cordon blu but I hate all the work to stuff the breast. This recipe is great and easier to make in my opinion. My father-in-law was skeptical about it but he was pleasantly surprised (told you so)! Hubby took the rest for lunch the next day and loved it still! Will make many more times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Minimom3"
},
"reviewBody": "I used turkey instead of ham and it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OODLES_OR"
},
"reviewBody": "Delicious. I gave some to a neighbor and the very next day she came over to ask for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Mixing the butter and cream cheese, I thought...this is going to be greasy but delicious. However it wasn't nearly as greasy as I thought, but was every bit as delicious! I thought my family might object to a non-traditional lasagna (I've always preferred white sauces to tomato), but it went over really well. Gonna make another pan to deliver to a friend and I'll definitely share the recipe! Not health food by any means, but it will be something good to serve when entertaining and when I get tired of plain ol chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Georgia Heick"
},
"reviewBody": "Great tasting recipe. Needed more sauce, but added extra shredded cheese on top to make up the difference. It is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Lynd"
},
"reviewBody": "Omg this was amazing. I chose this recipe because I had some leftover honey baked ham and turkey to use up. I made the recipe as written except I used Jarlsburg light Swiss, and I also had a bunch of extra fat-free half and half, so I used that in place of the milk. Next time I make it, I think I'll do 1.5 times the sauce--I think I could've just eaten the sauce with a spoon it was so good--and I think I'll sauté some mushrooms to put in, too. I bet caramelized onions would be good, too. The whole family raved about it--thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mzayd3"
},
"reviewBody": "My wife, who is a picky eater requests this. This recipe is simply awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Boy R Drew"
},
"reviewBody": "Very tasty! Only a couple changes Id make if I was to make this recipe again. First off there wasnt much sauce and was pretty dry on top so double the sauce when making this also the amount of ham was too much and I only used half of what was called for. It was pretty much a ham lasagna. I would use maybe about 1/4 of the ham called for and maybe about half a cup more chicken. Either way it was good and probably going to make again but with the necessary changes I mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigMomma"
},
"reviewBody": "My family and I loved this recipe. I did not make any changes. It took longer than the indicated 20 minute prep time (baking chicken first, grating cheese, etc), but I'm probably slower than the average cook too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Garcia"
},
"reviewBody": "So good. Definitely double the recipe for sauce if using Oven Ready Lasagna if you want it \"saucy\". I was unsure of all of the swiss cheese since I'm not a fan of it but everything pairs perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Kracht"
},
"reviewBody": "The family can't get enough of this! I used no boil noodles to save time. It worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I made this tonight for dinner. It was delicious. Followed the recipe exactly. For some reason mine took longer to cook and I ended up turning on the broiler to brown the top. Everyone in my house loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KPeoples"
},
"reviewBody": "I made this recipe and really enjoyed it. It tastes just like \"traditional\" Cordon Bleu. It is rich and filling. I was concerned that there would not be enough of the cheese sauce, but there was just the right amount. I used the \"no boil\" lasagna. I cooked it for 30 min with foil on it and then another 30 uncovered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelia s "
},
"reviewBody": "This was so good, my husband ate almost the whole thing, made it in a 10x12 pan instead of a 9x9 and put pancko bread crumbs on top, this was excellent...will be a regular dish here!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa F"
},
"reviewBody": "I was a little skeptical about this recipe, that it might be too rich...but the first thing out of my picky hubbie's mouth was \"mmm this is good\" and for him that's saying a lot. I have 5 little ultimate critics and they mmmed and ooohed the entire meal too! the sauce was delicious almost onion dip like but perfect for the meal and tasted wonderful when I dipped a piece of chicken in it. I boiled my chicken in salted and peppered water until the water disappeared, only light seasoning is needed and I used a 9 x 13 lasagna dish and found in had enough sauce, but I wouldn't have complained if I had a little more, (though double would've definitely been way too much). I used Ritz crackers on top because I had no bread crumbs, didn't bother covering it in the oven and 20 minutes did perfect, it was good with the browned cheese. It was pretty set out of the oven but if you use more sauce you might need to let it set a few minutes. Thank you so much for this recipe, from my 7 hungry tummies!! I will make this again and again. Goes great with crusty bread and some steamed veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lorrina"
},
"reviewBody": "I would give 4 1/2 stars because I really loved the flavor. I was hesitant to make a new recipe for a social gathering, but the guests loved it too. One suggestion, double the recipe for a 9x13 pan. I made 1 1/2 the sauce but it was still a little dry. It might be because I used oven ready noodles so that may have been the problem. The bottom layer seemed to get a little over done, dark and crunchy but one guest said that was his favorite part. I used pre cooked shredded chicken o that made it easy. I also added two layers of yellow squash which definitely was a hit. I also added mozzarella on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mayo"
},
"reviewBody": "Fantastic! Perfect for a dinner party! The only thing I added was fresh sauteed mushrooms on each layer. I did drain the mushrooms on a paper towel prior to adding to the lasagna to avoid any extra liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Friesen"
},
"reviewBody": "Do you think this could be made in a crockpot?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Z"
},
"reviewBody": "This was delicious! I made 1 1/2 the recipe and put it in a 9x13 pan. When I was making the sauce I thought there was going to be a bunch left but it was the perfect amount! It got rave reviews from my husband &amp; his friend. We love chix cordon bleus and the sauce in this tastes just like the ones we buy! I did use American Swiss instead of plain swiss. This is pretty rich so serve it w/ a side to help break it up. Thanks so much for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin Marie"
},
"reviewBody": "Have been making this since I first saw it on here around two years ago! Tastes delicious and my family loves it, super easy to make as well. :) Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Burns"
},
"reviewBody": "Fixed it as directed turned out awesome! We will fix this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joitapr"
},
"reviewBody": "This is absolutely delicious! That sauce is awesome. I did make a few changes but nothing I think altered the taste significantly. Used egg noodles cuz I didn't have lasagna. Added about 2T real bacon crumbled in the sauce. And used Panko bread crumbs with some Parmesan for the topping. So glad I stumbled on this recipe as it is already a family favorite. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne"
},
"reviewBody": "My family liked this recipe. Simple to make, I did make it in a larger 9x13 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "butrfly"
},
"reviewBody": "So I tweaked this recipe a little. I thought it could use a vegetable so I added a layer of broccoli over the chicken/ham. It was amazing! My husband says this is his new favorite dinner! Also used half regular butter and half Challenge roasted garlic and herb butter. Most definitely recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jac75"
},
"reviewBody": "So good!!I was a 1/2 cup short on swiss cheese so I made up the amount with mozz and I used panko crumbs.So happy I came across this recipe!I will make this again.Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZgirl"
},
"reviewBody": "Great dish! I had leftover chicken from tacos the night prior; I made this dish based on the fact I had the ingredients to pull it off with some alterations to compensate for the items I did not have; worked out well! I used mozzarella cheese and Velveeta. For the noodles I used Fideo noodles. I added a can of cream of celery to the cheese spread compensating for the over amount of chicken I had. I will make this dish again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pattik"
},
"reviewBody": "Made as written but used non-hydrogenated margarine, low fat cream and Swiss cheeses plus whole wheat lasagna noodles to make the recipe healthier. Loose bread crumbs did not appeal to me and if I make this again I will blend with a little margarine to hold them together. All in all I was pleased with how this turned out; I was able to use up a lot of leftovers in my fridge and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "booboo9999"
},
"reviewBody": "Got RAVE reviews with this!! My guests left with the recipe and my boyfriend was still raving about it the next day!Just made a few changes. Used Panko Italian flavored break crumbs for the top. And when I cooked the chicken, I seasoned it with garlic powder, salt and pepper. I did add a little more cheese because I love cheese. Cant wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betha1987"
},
"reviewBody": "This was fantastic. I didn't use the bread crumbs because I didn't have any. But it is a keeper for sure!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin"
},
"reviewBody": "Made it for my family, they ate almost all of it in one night (we are only four people!) and when I brought my professional chef neighbor over the next day to try it, there was only a single piece left! (He loved it, by the way, and ate the entire slice extremely quickly) Definitely would reccommend to anyone! Don't be fearful of the lack of ratings, you'll regret it- this recipe is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Awesome Erica!"
},
"reviewBody": "No changes, came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beezerbrit"
},
"reviewBody": "This was SO delicious! We didn't have any milk (how is that even possible?) so I used half and half instead. Wow! It was so rich but SO good. Wouldn't change a thing about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Durf"
},
"reviewBody": "Didn'tchange a thing....loved it!! Great recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Belcher"
},
"reviewBody": "KILLER!!! Made as directed. Hubs and I loved loved loved it! Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen Brough Chapple"
},
"reviewBody": "It was a big hit with my family. I used left over ham instead of deli slices. It is a little rich, so I'll be cutting back on the cream cheese/swiss mixture next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230779/chicken-cordon-bleu-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230779/chicken-cordon-bleu-lasagna/",
"name": "Chicken Cordon Bleu Lasagna"
}
}
]
}
}
, "about": [
]
}
]