				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Noodle Casserole"
,"datePublished": "1999-04-17T19:14:44.000-04:00"
,"dateModified": "2022-07-14T16:11:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Dawne"
,"url": "https://www.allrecipes.com/cook/24322629"
}
]
,"description": "This chicken noodle casserole combines juicy, poached chicken with mushroom soup and noodles for a creamy chicken bake topped with buttery crackers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4_Bo8hI6kLhEl3gSbvGMn82Rn-M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2336398-chicken-noodle-casserole-i-photo-by-cooking-monster-bryan-resized-4f33bb04fcdb49cd8087161a65d02fa3.jpg",
"height": 856,
"width": 856
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651158777001",
"description": "See how to make fast, creamy chicken noodle casserole.",
"duration": "PT3M2S",
"name": "Chicken Noodle Casserole I",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/fd792f51-cb93-4da0-ab9b-01bd2d989af6/12d9a241-392f-4266-b7cf-ab4fe4de49bd/1280x720/match/image.jpg",
"uploadDate": "2021-06-22T22:47:26.375-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Noodle Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "2382"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "542 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "133 mg"
,"fiberContent": "1 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "18 g"
,"sodiumContent": "895 mg"
,"sugarContent": "2 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 skinless, boneless chicken breast halves",
"6 ounces egg noodles",
"1 (10.5 ounce) can condensed cream of mushroom soup",
"1 (10.5 ounce) can condensed cream of chicken soup",
"1 cup sour cream",
"salt to taste",
"ground black pepper to taste",
"0.5 cup butter",
"1 cup crumbled buttery round crackers" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Fill a large pot with water and bring to a simmer over medium heat. Add chicken; poach in simmering water until no longer pink in center, about 12 minutes. Use a slotted spoon to remove chicken from pot and set aside. Leave water in the pot."
} ,{
"@type": "HowToStep"
,"text": "Bring chicken cooking water to a boil. Stir in egg noodles and cook until tender with a slight bite, about 10 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Transfer noodles to a large bowl. Cut chicken into bite-size pieces and mix with noodles."
} ,{
"@type": "HowToStep"
,"text": "Mix together both condensed soups and sour cream in a separate bowl. Season with salt and pepper. Add soup mixture to chicken mixture and gently stir until combined. Transfer to a 2-quart baking dish."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a small saucepan over low heat and remove from heat. Stir in crumbled crackers. Sprinkle mixture over top of casserole."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4_Bo8hI6kLhEl3gSbvGMn82Rn-M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2336398-chicken-noodle-casserole-i-photo-by-cooking-monster-bryan-resized-4f33bb04fcdb49cd8087161a65d02fa3.jpg"
}
]
,"text": "Bake in the preheated oven until heated through and browned on top, about 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyDrew20"
},
"reviewBody": "Family loved it, I substituted half can of Durkee Crispy Fried Onions to the top of casserole instead buttered crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's a great dish that i love making but i put alot less butter in for the crackers so they aren't mushy. They crisp up nice in the oven!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherri Stone Wiegman"
},
"reviewBody": "I give the recipe above three stars as the recipe goes as it was rather bland. I upped the recipe to: used a rotisserie chicken; added fresh sliced mushrooms; added frozen peas; about 1/3 cup of fresh Parmesan cheese; and, lots of black pepper. Instead of butter crackers, because we didn’t have any, I used French fried onions. IMO, messing around with boiling chicken breasts when many of us are stretched time wise doesn’t make good sense. With a jazzed up chicken casserole, my husband and I give it 5 stars. Served it with fresh steamed broccoli and a nice white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I only gave it 3 stars because “as is” needs some more deep &amp; full body flavor. This is what I call a “base recipe” that leaves room for you to season to your taste with your choosing of what is on hand to make it your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Traynor"
},
"reviewBody": "Good basic start. Add sautéed mushrooms for flavor depth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Kendall"
},
"reviewBody": "I’ve made this casserole twice so far and absolutely love it. Very easy to make and very filling and simply delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mztracy"
},
"reviewBody": "This was absolutely terrible!!! Completely bland and tasteless. My husband couldn't finish it . Do not make this recipe, even with revisions. YUCK!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Brinks"
},
"reviewBody": "PRINT THIS RECIPE RIGHT NOW...you may thank me later. Everyone in my family got up for second helpings. This casserole is creamy and dreamy with the nicest crunch topping. I always add a can (10.75) of hot water to add to the creaminess (from the chicken pot) and extra Ritz on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "Put the noodles and chicken in one bowl, then mix the soups and sour cream in another bowl? No. Poach the chicken and set aside. While the pasta cooks, mix the soups and sour cream in a large bowl. Cut up the chicken and add it to the soup mixture. When the noodles are done, add them to the same bowl. One less bowl to wash. Anyway, this recipe is a good base to start with. I've made this a variety of ways, depending on what's in my pantry and fridge. Tonight's variation: I didn't have any Ritzoid crackers, so I substituted buttered panko crumbs, and I didn't have any sour cream so I went with cream cheese. I poached the chicken and boiled the noodles in chicken broth. I put the cream cheese in a bowl, added some chicken broth to thin it out a bit, and added a half ounce (half a packet) of onion soup mix. I beat it smooth with a hand mixer, then stirred in the cans of soup and pepper (no salt) by hand. I also always add a shake or two of poultry seasoning whenever I make this. I did the panko and butter as directed. It turned out great tonight. I'm rating the recipe as 3 stars because it's a great place to start. You can easily make it a 5 star dish if you play with it. One of my favorite variations was to saute onions in butter for 5 minutes, add chopped mushrooms and minced garlic for another couple of minutes, add the pepper and poultry seasoning, add a couple of splashes of Chardonnay, and let it reduce. Everything else was per the original recipe and it was amazing. I've also made it with broccoli, but it changed the flavor too much for my taste (although I do like broccoli). Like I said, it's a solid base for a great dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sooo good! If I make it again I’ll add vegetables. I didn’t like the crackers though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I used full package of noodles. I know some people think using canned soup mixes are cheating but…. This is one delicious recipe. Super flavorful. Delightful meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Exactly as written?? This would be too saucey and not enough substance but I could see where submitter Dawne was going with this and it was very reminiscent of recipes my mom would make when I was growing up. To keep as close to the original recipe as possible but be something I would enjoy; I doubled the noodles, added diced celery, onions and a jar of diced pimentos and used half the butter for the cracker sauté. It was a wonderful recipe! I would make again when I want an easy and economical throwback meal! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This a great meal and then the leftovers are put in the freezer for an easy fix for lunch or dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenInSeattle"
},
"reviewBody": "Added pint of mushrooms before baking, baked more like 45 min"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "The dish was very bland. I would definitely add some more spices and veggies to give it some flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good! I didn’t have crackers but I did have the French’s crispy fried onions, it went really well with the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "slo_cook"
},
"reviewBody": "A bit bland as written. It could use some minced fresh onion, garlic and poultry seasoning to taste, a splash of white wine would go well with the fresh garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Moshlak"
},
"reviewBody": "Sub chicken broth, for the water and add a bag of frozen peas to the noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very nice dish. I always find the chicken in casseroles bland. So I will cook the chicken on the grill halfway to fully cooked or I will cut up the chicken and stirfry it quickly with some soy, dark vinegar and brown sugar. It makes the chicken standout in the dish and provides some depth to the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Knestrick"
},
"reviewBody": "Love, love, love which is not surprising. Everyone of your recipes that I ever made never disappointed me. My grandkids just love it and they want me to make it every week for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberto le Case"
},
"reviewBody": "My lovely wife and I made this just the other night and it was yummy in our tummies, especially on an evening when the temps outside were chilly. As a kid my mother used to make a tuna fish casserole which was much like this so, I can see swapping the chicken out for tuna and giving it a go. Also, we used to crumble up potato chips as a crunchy topping. They added the bit of salt that I think this finished dish needs so, I'll be trying that change as well. Otherwise - four thumbs up! (my wife's and mine!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Good base recipe. I taste tested the sauce and added garlic, onion, thyme, basil, and lemon juice. Cooked the chicken and noodles in 4 cups of seasoned chicken bone broth, and added a 12 oz. bag of frozen peas and carrots. Sprinkled the casserole top with 2 tbsp of parmesan reggiano cheese. Topped that with a cup of panko bread crumbs mixed with 2 tbsp of melted butter. So good! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Husband thought it tasted bland. He suggested adding some cream of celery soup to it, so I'm preheating the leftovers with cream of celery soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Quick and Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elspeth Gadzik"
},
"reviewBody": "I also added a can of mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Mavaro Cummings"
},
"reviewBody": "To save time, I used shredded rotisserie chicken, cooked the noodles in water with a chicken bullion cube, and added mixed vegetables, thyme, and shredded cheddar cheese blend on top. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "h6ts4mwdhr"
},
"reviewBody": "Making sure you season your chicken is a definite! On its own this recipe doesn’t have a whole lotta taste. I added McCormick’s Montreal Chicken seasoning to both the chicken, before I boiled it, and the creamy soup/sour cream mixture. Added a bag of broccoli &amp; a big handful of cheese to the chicken to even out the meal. Because I LOVE any bread &amp; butter mixture I did what a couple of reviewers did &amp; added another scoop of crushed crackers &amp; 1/2 stick butter. Shoulda waited on the butter, 1 stick was more than enough. Overall this is a definite do-over. I’d like to try a different pasta with another vegetable. You can change this up with whatever you have on hand. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corina"
},
"reviewBody": "I made this tonight…EXCELLENT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Randy m"
},
"reviewBody": "It very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RedCoatMom"
},
"reviewBody": "I remember my mom teaching me how to make this when we became latchkey kids back in the late '70s. It was easy but good! It also helped me understand some basics about cooking. As I got used to making it... about once a week it seemed like... I would experiment with adding herbs, leftover vegetables, and whatever else seemed good. I used this recipe to teach my sons how to cook. They all are adults on their own and have advanced beyond this casserole. But at least I knew they wouldn't starve with this recipe in their arsenal. This is a great foundation recipe to make it different every time. Thanks for bringing back fond memories!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jacdobe"
},
"reviewBody": "This is an excellent base meal which can be tweaked to your preferences, or is good as is. My review is based on the base recipe bit with my changes, it is a 5. I prefer my casseroles to have a bit more flavor intrigue so I tweaked in the following manner: I rubbed the chicken breasts with paprika, dill and seasoned salt then browned over high heat before removing from pan and setting aside. I sauteed a large Vidalia onion, chopped fine in butter with 4 cloves of garlic, diced and 1 cup of red, yellow and orange sweet peppers. I returned the chicken to the pan and added 1/3 cup chicken broth and 1/3 cup white wine and a can of sliced carrots, drained. I poached the chicken and veggies until done. After removing the chicken from the pan I reduced the remaining liquid by about half. After mixing everything together I added 1/4 cup milk to the mixture as well as 1 cup shredded italian cheese (parm, romano, mozz) and doubled the noodles to make a full 9x13 casserole dish full. My husband has never willingly eaten a casserole in 17 years of marriage and he not only had seconds of this dish, he has asked for it several times since. This is definitely a keeper. ETA: updated 10/22 I still make this a few times a month. I switch up the seasonings and sometimes omit the bell peppers but definitely need more than poached chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Woomer"
},
"reviewBody": "This has been a family favorite. I use only the cream of chicken soup and no sour cream. On the top I crush potato chips instead of crackers. My children and grandchildren look forward to this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i used two chickens minus thighs and drumsticks, added peas [frozen] half a cup, mushrooms 2 cups, chopped mint and dill, and couldn't find the cream. somebody apparently swiped it all. also a few bits spicy sausage. slow cooked the two chickens with lemon slices onions and used the bones and some turkey necks for stock, a lotta bay leaf and thyme... in lieu of cream, powdered cream of chicken from Knorr. it's cooking now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added peas, a few more noodles and some Mrs Dash Tableblend seasoning. Extra crushed buttery rounds and 1/2 stick more butter to the crackers. Omg! My new favorite chicken and noodle casserole!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This has been a family favorite for years. When some of the children are not home we add mushrooms. Sometimes even when they are home and we tell them to pick them out. I love how easy it is and it makes such a good leftover as the days get cooler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added onion, celery leaves, fresh basil and mushrooms. Delicious results"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Abercrombie"
},
"reviewBody": "Was a hit at our table"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEM"
},
"reviewBody": "I have never made a dish that had \"Cream of\" anything soup so I was glad to have reviews that made alterations to the original recipe. BTW, who wants to go to the trouble of making a dish and it turns out bland? So thanks for all the revisions. I sauteed onion, celery, garlic, dried thyme, and mushrooms, then added the soups and sour cream (less of the latter) along with a splash of sherry. Super thick so thinned it with milk and added steamed broccoli to the dish. That's a lot of changes but glad I made them. First and last time using canned cream of anything soup though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlene Burns"
},
"reviewBody": "I added broccoli and peas because I wanted to complete dish with starch protein and vegetables. It took a little longer to cook to make sure the vegetables were done next time I might parboil the vegetables before I put them in with the pasta. The picture is from before I put it in the oven so it doesn’t look quite finished"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janis Rehm"
},
"reviewBody": "My family loved this casserole. It was easy to make and delicious. I used Ritz crackers for the topping and added one cup of shredded cheddar cheese to the chicken and noodle mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwendolyn"
},
"reviewBody": "As was mentioned by other persons, I did some changes. Cream of broccoli instead of cream of mushroom. Added sautéed carrots sliced rounds, chopped onions, chopped onions, chopped Celery with a sprinkle of garlic powder and chicken boullion. I followed the preparation of the recipe. Definitely for pot luck dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Jean"
},
"reviewBody": "I doubled the noodles and poached about a pound of chicken breast. I also sauted about a cup of sweet vidalia onion and a half cup of celery in 2 tablespoons of margarine with 1 tsp of Better Than Bouillon with Garlic for 12 minutes while I poached the chicken. I used 1 cup of Italian Style Panko Crumbs with the 1/2 cup of butter on the top of the casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i loved the recipe it turned out real good everyone loved it i did add more sour cream cooked the noodles in chicken broth i poured the chicken broth in the batch and topped it with mozzeralla cheese and ihad a very good chiken flavor in the noodles and the filling it was a hit defently will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy McMullen"
},
"reviewBody": "I did not bake in oven as long as 30 minutes. I baked for 20 minutes. I also added peas since this recipe did not have one. It was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bgiambrone"
},
"reviewBody": "This one was thrown together last minute. My daughter had come home with 2 extra school buddies, then there is the usual crowd. Around the table you heard um’s and this is the best casserole I have ever had. I was thinking this could go either way so to the creator of this casserole, bless you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was my first time making it I really like the receipt and super easy to make although it seemed a little dry next I make this I’ll add some milk to make it creamier and maybe add some more crackers as the family suggested but all in all I love this recipe I will make this the rest of my life."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia Drost"
},
"reviewBody": "Loved the taste and easy to make. I added 1 can of sliced mushrooms (drained) and 1 small can of Hatch green chilies. It was a big hit! From the photo you can tell we barely ate a forth of it. I think it makes enough for 8 servings, at least for 75 yr old senior citizens. Thanks for sharing this delicious dish. I only added some things to get vegetables in our dinner without a side dish. ❤️ 🐕‍🦺"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teakwood137"
},
"reviewBody": "It was really good. In the future, I may use a little more chicken next time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "v87xlr8r"
},
"reviewBody": "This was a hit with my family! I will have to double the recipe the next time! I used Club crackers and added a little powdered chicken bouillon to the soup mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grady Sullivan"
},
"reviewBody": "Delicious! Easy, to assemble and great leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wizardisoff"
},
"reviewBody": "I added 1/2onion, can of corn and a can of green chilis. Used some garlic powder. Turned out very good. Will make again maybe add black olives"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "This was terrific! I made a couple of adjustments to it because I didn’t have all the ingredients. I used leftover chicken that I had cooked in my Instant Pot. Instead of sour cream, I used milk and chicken broth to dilute the soup. I also cut the butter in half. This will definitely be one of my go-to recipes for the next potluck dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trentscastle"
},
"reviewBody": "Proportions are off, but as a trained Chef, who’s woman wanted me to make it, I figured it out just fine. She (and I) loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Essie Bruell"
},
"reviewBody": "Used canned chicken, two large cans per recipe. Added Penzey's Tuscan spice with a heavy hand. No added salt. Didn't have sour cream, substituted plain full-fat yogurt and cream. This recipe was delicious with the simple changes we made, so I know it can be customized to suit what's in your pantry and frig."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April H. Wright"
},
"reviewBody": "I made the recipe but saw peas in the photo but not in the recipe so I added some frozen peas and carrots. My husband thought the recipe was a keeper. \n\nI don’t think I used as much chicken as suggested, but I made it as a way to use leftover chicken. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dave Lawlis"
},
"reviewBody": "I added carrot, celery, onion, and mushrooms as well as dried thyme, rosemary, and lots of fresh ground black pepper. Start sauteeing the celery a few minutes in advance of the onion and mushrooms. Cook the carrots with the noodles to soften them up. I would give my version 5 stars, but if I had made it as written I probably would have given it two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "derisotony"
},
"reviewBody": "I used cream cheese instead of sour cream DELIOUS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaDonna Langwell"
},
"reviewBody": "This was a very simple, and very good, recipe on its own. Added a little pizzazz to it to use up some of the goodies we had laying around the house. Since I cut it in half for us, I just used cream of chicken soup. I added in some chives, green onion and a dash of cayenne pepper. I also mixed in a handful of cheddar cheese. On top, I added another layer of cheese, then some buttered panko crumbs. After baking, I broiled it for a moment to get a crisp crust. Absolutely delicious! Husband ate three helpings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LCD “LCD”"
},
"reviewBody": "I used more noodles than the recipe, so it was a bit dry, but still tasty. I might try it with frozen peas and mushrooms next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard Gilchrist"
},
"reviewBody": "This recipe looked bland. I diced four chicken breasts into about 1 inch pieces. I roasted some red peppers. I sauted onions and mushrooms with the diced chicken, cooked the noodles. Cleaned and diced the roasted red peppers. Used a can of cream of mushroom soup, the sour cream and omitted the cream of chicken. Drained the noodles and threw it all together, mixing well. Put in a 9x13. Cover with the butter cracker crumbs. Seasoned with thyme and marjoram."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family &amp; I loved it. To reduce fat intake, used fat-free condensed creams of chicken &amp; mushroom, and 2/3 sour cream. Cooked chicken with half water &amp; chicken stock plus added one garlic clove and ground pepper. Added some frozen cut green beans (steamed 1st) to the mix on the pan. Used egg white noodles which are less dense since the cracker crumbs will make it a bit heavy. Can't wait to prepare it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adnirnnyl tnerap"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariya Lighthill"
},
"reviewBody": "Family loved it and it wasn't all that hard to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lora Wade McKinney"
},
"reviewBody": "This was great! My picky husband loved it. I jazzed it up with thyme, and garlic and fresh mushrooms. I think I will add red pepper flakes next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holli Gaghan Holt"
},
"reviewBody": "Whole family LOVED this!!! Only thing I changed was I crunched up some French’s fried onions &amp; put on top instead of Ritz &amp; added just a tiny sprinkle of shredded cheese. Going to make this again tonight &amp; add a few things. Thinking of diced onion, broccoli &amp; maybe a little red pepper flake!?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Dill"
},
"reviewBody": "I made this and put green beans in it and the family loved it. Great one dish meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Martins"
},
"reviewBody": "Delicious!!! The only thing I did different was substitute the sour cream for plain greek yogurt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Wright"
},
"reviewBody": "This is comfort food. I use boneless skinless chicken thighs over breasts. We have made this several times and the family loves it. Nice to have in our rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Kollay D'Ettorre"
},
"reviewBody": "This is my go-to comfort food recipe! I make it often, and it’s a favorite for my husband and two little boys. I always poach the chicken and cook the noodles in separate pots at the same time to save time. I also add 1/2 tsp. garlic powder and 1 tsp. onion powder along with the salt and pepper and mix a bag of mixed frozen peas and carrots to the sour cream and soup mixture. This is also great as a prep ahead and save in the fridge until ready to bake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail Swanson"
},
"reviewBody": "Was this casserole so darn bland? I don’t think so. The soup/sour cream combo helped with flavor, even the cracker topping added a tinge of interest ( I used Club Crackers). A good standby recipe when looking for something easy to make and not too time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "boiled chicken in mix of chicken stock used half diced onion 1/2 tsp tyme 1/2 tsp basil two cloves garlic three cups of crackers. family loved it wants it all the time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joeb"
},
"reviewBody": "delicious flavor - I almost substituted panko bread crumbs for the crushed butter crackers. I'm glad I did not as the cracker crumb topping really made this casserole delicious combined with the chicken and noodles. Definitely added to my rotation"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "entityellow"
},
"reviewBody": "Everyone in my family really liked this! I'm adding it to my easy casseroles list! The only thing I did differently was I used italian panko crumbs instead of buttery crackers, since I had none."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandilong"
},
"reviewBody": "Loved it. Made it as written except I used a rotisserie chicken. Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolly Zartman Owens"
},
"reviewBody": "This is a great recipe. I change it up a little by cooking off broccoli and adding that to it. Also for the topping I used crushed garlic and cheesy croutons. Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gandc2"
},
"reviewBody": "My family of 4 liked it. My boys are young adults and thought it was a little bland but they like spice. Overall it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trent Shannon"
},
"reviewBody": "Very good. I added half bag of frozen peas and used more noodles than recipe calls for. Also, I seasoned the chicken with lemon juice, salt, pepper and granulated garlic and left the chicken in a zip lock bag in the refrigerator for 4 hours before poaching the chicken. I also poached the chicken in chicken stock. Added good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melodie"
},
"reviewBody": "It came out really good. The only change I did was add a bunch of shredded cheese with a little milk bc I had extra in the fridge. I do think it needs a little bit more flavor though, which is why I only gave it four stars. Unfortunately other reviewers said that but I didn’t read them until I had already thrown it in the oven. Would definitely throw in some garlic n maybe some chicken spices to give more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill64"
},
"reviewBody": "Great recipe. Added veggies &amp; seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Neely70"
},
"reviewBody": "I only used 2 chicken breast and it was plenty (they a good size). I also added a cup of frozen mixed vegetables which I pre cooked with the noodles. I will make this again. Overall it is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Villarreal Carrillo"
},
"reviewBody": "I have already made this a few times. My family loves it just the way it is. My kids are very picky...so for them to love it means this recipe is perfect! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cepace"
},
"reviewBody": "kids love it. I add peas&amp; carrots is all. i have made this at least a dozen times. Always a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roseroserose"
},
"reviewBody": "The recipe AS IS, is quite bland in my opinion. That’s why I rate it 3 stars. However, as many reviewers have mentioned, it’s a great base recipe for your own creations. To turn this into a 5 Star meal, I added a packet of dry ranch seasoning mix, sautéed onions and garlic, and shredded cheese. Super yummy and comforting after the additions. 3 stars without the additions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Kay McDearis"
},
"reviewBody": "Fantastic follow the lady that added veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeriNewman"
},
"reviewBody": "First I agree that a recipe should be rated AS WRITTEN. This one is a solid casserole, easy to make with readily available ingredients. If I were making it to serve at a restaurant or potluck, it would be great as is; definitely 5 stars. \n\nI like this recipe because it's like a little black dress that can be dressed up or down with accessories. Everyone tweaks recipes a bit as a good recipe like is the base guide for the dish, I tweak everything since beloved hubby is a famously finicky eater. So, here's how i made this VERY good casserole. \n\nI made this using the carcass of a Costco rotisserie chicken that had plenty of meat left and the carcass of a turkey breast I roasted for sandwich meat. I've found that a roasted chicken gives soups and casseroles more depth as the flavor tends to be richer from the caramelized chicken juices. \nPRO TIP: Put the carcass in a collapsible wire steamer basket and cover it with the cooking liquid. This allows you to lift the whole carcass out and no bones or other inedible parts get into the stock. \n\nTo the stock I added a diced red bell pepper for some color and a couple of carrots that I needed to use up along with some chopped onion. I tossed all of this in a stock pot and cooked it in the flavorful broth, and then cooked the noodles in it. I picked the meat off of the bones and returned it to the pot. I thickened the stock with a little I adjusted the salt by adding some better than bouillon vegetable base and chicken base to tas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MandyNorm Richter"
},
"reviewBody": "I wanted to try something new for my family and it was a hit!! Everyone loved it!! It was super delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissa couch"
},
"reviewBody": "I used a whole rotisserie chicken ans added a can of mushrooms and oh my gosh this is fabulous. My husband loved it so much I made it again 2 days later! That is huge coming from him. A keeper for sure. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ian M"
},
"reviewBody": "I accidentally swapped Celery for Chicken soup, and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Beck"
},
"reviewBody": "This is just the best chicken casserole and great to freeze and take to work. I used penne because it is what I had and I like a little more substantial pasta. Wish this would let me upload a pic.... Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jrosee"
},
"reviewBody": "I’ve made this twice now, as written, and both times we were all underwhelmed. There isn’t much flavor to this dish without enhancing it. The cracker topping is the saving grace here. I don’t recommend making it as written unfortunately. However, this is a great BASE recipe for something potentially delicious. I will share MY enhancements to turn this from 3 stars to 5 (ultimately still keeping the recipe at 3 stars since we’re reviewing the recipe given)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine419"
},
"reviewBody": "I made it as is and it was delicious! Big hit in this house full of kids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachella76"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darrell Beach"
},
"reviewBody": "turned out amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel DeYoung"
},
"reviewBody": "Added some celery and onions into the mix for added flavor. Easy prep. Really liked this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "QUOLO"
},
"reviewBody": "I'm sure the recipe is fine for many--we found it a bit heavy and not something we'd do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Violet"
},
"reviewBody": "It was delicious. Warmed it up in the microwave and it was still delicious. Will definitely make it again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11864/chicken-noodle-casserole-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
"name": "Chicken Breast"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
"name": "Chicken Pasta"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11864/chicken-noodle-casserole-i/",
"name": "Chicken Noodle Casserole"
}
}
]
}
}
, "about": [
]
}
]