				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Hariyali Tikka"
,"datePublished": "2019-07-10T02:54:19.000-04:00"
,"dateModified": "2022-10-09T18:14:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Heeru"
,"url": "https://www.allrecipes.com/cook/1157805"
}
]
,"description": "Chicken breast meat is rubbed with an intoxicating paste made with cilantro, mint, and other distinctive flavors. Chicken legs may also be used, or a combination of legs and breasts. This recipe is cooked in the oven, but will work well on the grill. Serve hot with onion rings."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QDbhlD3Ps1cScYY9X39K9gUlx18=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/288198-chicken-hariyali-tikka-SunnyByrd-4x3-1-af31d6a4a18543f593f73fb929bdc40e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Hariyali Tikka"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "54"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "147 kcal"
,"carbohydrateContent": "3 g"
,"cholesterolContent": "65 mg"
,"fiberContent": "0 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "1966 mg"
,"sugarContent": "1 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup finely chopped fresh cilantro",
"0.5 cup finely chopped fresh mint leaves",
"1 tablespoon ginger garlic paste",
"1 tablespoon lemon juice",
"1 tablespoon green chile paste",
"1 tablespoon salt",
"1 pound skinless, boneless chicken breast halves - cut into chunks" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, grind together the cilantro, mint leaves, ginger garlic paste, lemon juice, green chile paste, and salt. Place the chicken in the bowl, and rub with the mixture. Cover, and refrigerate 2 to 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven broiler. Lightly grease a baking dish."
} ,{
"@type": "HowToStep"
,"text": "Place the chicken in the baking dish, and broil 20 minutes, or until chicken juices run clear."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT215M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dreuther"
},
"reviewBody": "Prepared it exactly as the recipe said. Came out amazing! Everyone enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David Cox"
},
"reviewBody": "Made it exactly as written but it was WAY too salty. I would recommend cutting the salt down to 1 teaspoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter"
},
"reviewBody": "I waited too long to make this. Everyone thoroughly enjoyed. I couldn't find chile paste, so I substituted curry paste instead. Next time I will reduce the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda"
},
"reviewBody": "Everything just meshed together so well. The chicken was tender and juicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doreen"
},
"reviewBody": "VERY VERY GOOD! I agree with some of the other reviews- too much salt, 1-2 tsp should be good, although we used Fish Sauce for a more Asian taste. Didn't have Ginger-Garlic so used 4 cloves and about 1 Tbl of fresh ginger- will double the amount since we like things spicer. Also used Sambal Olek in place of green chilies and will up those amounts also. Threaded on skewers and broiled for 5 minutes per side. Served with rice and snow peas. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mlkdmk"
},
"reviewBody": "We couldn't find green chili paste and substituted green curry paste. But the recipe was awesome. My husband loved it and I will definitely be rotating this recipe into the cycle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmcnicho"
},
"reviewBody": "Served with coconut rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monique"
},
"reviewBody": "I did not have mint but my family still loved it. It was so fast and easy to make! I'll surely try it on the BBQ this summer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Val C."
},
"reviewBody": "Loved this chicken. I will say I made a few changes just using what I had on hand. I don't like mint so I just used all cilantro, and used fresh lime instead of lemon. Used a bit of powdered ginger and garlic instead of paste, and a can of green chilies. Threw it all in a blender and then poured it over the chicken to marinate. My family loved it... Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine Chou"
},
"reviewBody": "Very very good but I made some substitutions: chicken thigh instead of breast (more tender), half the salt and chili paste and it still seemed too salty so will cut out more next time. Otherwise, easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggy Morra"
},
"reviewBody": "Maybe because I had a head cold I didn't think this was very flavorful. My husband said it was. I will try it again but may add more spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettysue"
},
"reviewBody": "In my small blender, I put fresh chopped garlic, ginger, and garlic hot sauce plus a tiny bit of Mae Ploy sweet chili sauce with the cilantro to form a paste. I left it on boneless chicken thigh pieces for several hours. Then I followed the cooking instructions. The result was chicken that was both delicious and juicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beasley"
},
"reviewBody": "By chance I was given some Vietnamese mint during the week, thus I replaced normal mint. Was fantastic with the coriander.\nUsed a couple of birds eye chillies instead of paste and added a little peanut oil to the marinade. Used a healthy sprinkle of good sea salt as opposed to a tablespoon. Was tempted to use soy sauce in marinade but glad I didn't. The garlic and ginger are essential.\nThighs better than breast if using a grill/bbq.\nI would never broil a recipe like this. Needs the caramelise factor.\nFamily loved it. Will def do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy"
},
"reviewBody": "What is cilantro and where do I get it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asim Nagree"
},
"reviewBody": "Excellent recipe. Make a few cuts on the chicken which will get the marinade. Also add a tablespoon of oil and curd . This will make the chicken really soft \n\nAsim Nagree from Mumbai"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "7/2009 Great flavor!!!!!!!!!!!!!! Like others I subbed red chili paste for the green (only used 1/2 TBS) and minced garlic and powdered ginger for the paste. First time using mint on my chicken and this was very good!\n11/2015. I've made this so many times I've lost count. Today was the first time I broiled it vs grilling. Worked great. I subbed freshed minced jalapeño, garlic and ginger for the pastes. This is so darn good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marnisown"
},
"reviewBody": "Absolutely delicious! Wasn't able to find ginger garlic paste or green chili paste,so we used 6 cloves of garlic,about an inch of fresh ginger root and 2 seeded jalapenos, ran everything in the food processor until it was almost pasty (takes awhile). Will be making this over and over - I'm thinking this method would be extra-tasty with pork"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this was very tasty! i don't keep ginger garlic paste in my house so i used 1.5 tsp each minced fresh ginger and garlic.. glad i read the reviews.. i only used 1 tsp salt.. didn't have green chile paste so i used some curry paste i had in the fridge as another reviewer did.. added 1/4 cup of water to the mix as it was pretty dry.. cooked at 350 for 40 min's.. we really enjoyed this.. ty for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelsea Velthoen"
},
"reviewBody": "The smell was amazing and I was excited to try it. I tried half with coconut milk and half without. With the milk is definitely better. My chicken turned out very dry and little bland, so I will have to experiment a bit more. Good starting flavor for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicay"
},
"reviewBody": "Wow! I cannot believe how incredible this tasted. I swapped lime juice for lemon juice, used fresh garlic and ginger instead of the paste, and fresh serrano pepper instead of the paste. So delicious! So easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Diva Contessa"
},
"reviewBody": "very easy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I like the unique taste of this dish although I found it too salty - and I even cut back on the salt from the original recipe. For those who don't like their food too salty, I'd say, go easy on the salt in the marinade and salt at the table if you want it more salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "I didn't have any chile paste so I just prepared it without. I tooks others advise and reduced the amount of salt. I was very good. I will try it again with the chile paste and see how it works out. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Birna Ýr Thorsdóttir"
},
"reviewBody": "Wonderful Chicken Hariyali. I put all Ingretiants in the food processor, added a little Vegetable Oil to make it paste like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley West"
},
"reviewBody": "Best dish ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justyndm"
},
"reviewBody": "Phenomenal recipe. Made a few changes - No salt needed at all if anyone enjoys low-salt food. It's so tasty without salt. I used a mix of lime juice and lemon juice, and think this would be better with lime juice only. All fresh ingredients (deseeded chiles, whole mint and cilantro, whole garlic and ginger), just put it in a blender and it works just as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeahS"
},
"reviewBody": "Great recipe--the first time I prepared it as written, substituting red curry paste for green chile paste as that is what I have. This turned out great. The second time I doubled the listed ingredients, blended them with a can of coconut milk, and simmered the chicken in the sauce. This was *delicious*. It makes a fresh-tasting curry that's great over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dylan"
},
"reviewBody": "I marinated this overnight--absolutely terrific."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth Thomas"
},
"reviewBody": "FABULOUS! Tender, juicy, and incredibly flavorful. I often find chicken boring, but not this recipe. I wasn't sure whether to pack down the cilantro before I measured it, but I went ahead and did so because I like cilantro so much. I used 1/4 cup of dried mint because the grocery store was out of the fresh stuff. And I measured the garlic, ginger paste, and green chili paste very generously. I only had chicken thighs (bones in) on hand, so I broiled them for twenty minutes on the first side and ten on the second. I don't know that I've ever had better chicken. We ate it with orzo and tomato salad. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Cakes"
},
"reviewBody": "I am cheap, so I used chix thighs.I marinated the chix for 24 hrs., it was very tasty and I was sooo happy that the herb mixture didn't turn all brown, I know it was the lemon that helped that. I baked it and was delish!! Thank You for another yummy alternative to the same old birdy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this using seitan instead of chicken. I had to double the Tikka (probably because seitan is a little more absorbent than chicken), but it turned out very nicely. I felt good after eating - like I'd really eaten something very healthy and good for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Super99"
},
"reviewBody": "I will try again, with less salt! But after sitting in the fridge for a day, the salt seemed toned down. Lovely fragrance! I had some of Amy's Cilantro Sauce from another dish left over and dipped the chicken in it.. MMM. Very nice. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Neil"
},
"reviewBody": "Mmmm mmm good. I used Sarichi (not sure of the spelling, the red chilli sauce with the rooster on the bottle) because I couldn't find green chilli paste. Also couldnt find garlic gincer paste so I used 3 cloves of garlic and 2 tbs of fresh chopped ginger root."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookhealthy"
},
"reviewBody": "This was good, but I thought the citrus flavor was a little strong or it needed something to make the flavor less bitter. I think it would be better without the lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OBOEWANKENOBI"
},
"reviewBody": "SOOO good!!! And extremely healthy and low-cal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riri2"
},
"reviewBody": "excellent is an understatement for this....the tangy and garlicy taste just blend beautifully.....and really presentable too! UPDATE 18/06/2011 :: This is a recipe that's been going strong in my house ever since I made it! I do marinate these in the fridge for a minimum of 8 hours (over night) to even 24 hours or even frozen for longer. I bake these first for 21 minutes @ about 175C and then flip them over and bake for anouther 21 minutes. Something I forgot to mention was to follow your own taste for the salt coz that's what I do since the salt proportion in the recipe seems way to much. These tikkas are much loved by all who've tried these at my place! :) Thanks again Heeru!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney"
},
"reviewBody": "This is SOOO good! My husband was skeptical when I was telling him the ingredients, and he LOVED it- so did I! It is super easy to make and goes well over Jasmine Rice and veggies or even in pitas as a sandwhich!! I am so glad that I found it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pete"
},
"reviewBody": "First time I attempted this recipe, it was good but a little too salty for my taste buds. On round 2, I did 1 teaspoon instead of 1 tablespoon and it came out perfect. Just an idea for those out there who don't have much tolerance for salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Parker"
},
"reviewBody": "I had to make a few changes to this recipe out of necessity (I couldn't get to the store) and out of my tendency toward experimentation but the results were great! I didn't have garlic ginger paste or green chile paste so I put four cloves of garlic and a fat piece of peeled, sliced ginger and half a small can of chopped green chiles in my mini food processor. I also put the cilantro and mint in there. I processed the mixture into a paste and tumped it into a large plastic baggy. I then added to the mixture juice from half a lime and 1/2 cup of coconut milk. Put the chicken chunks in there and marinated for two hours. I broiled the chicken for 5 or 6 minutes per side and served it with buttered jasmine rice with green peas. It was awesome! Even my somewhat picky husband loved it. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hena"
},
"reviewBody": "Turned out really really well! :) It's a nice change from the usual tikkas. I couldn't find any green chili paste either so I blended in a whole green chili and a bit of spring onions to spice it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAT79"
},
"reviewBody": "Wonderful. I couldn't find green chile paste so I added a splash of hot sauce instead. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SAFICAT"
},
"reviewBody": "We grilled this with skewers. It was very good. However, I can’t see adding cumin to it as the first reviewer did. My husband loved it, my children and I liked it a lot. To me it seemed to need some type of sauce to accompany it, though. Any suggestions Heeru? I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kavi"
},
"reviewBody": "This was very moist and flavorful.I used thighs instead of breast meat and blended all the ingredients in a food processor. It took me about 15-18 mins to broil in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PGANJU"
},
"reviewBody": "great recipe, the chicken was wonderful. We cooked it on the grill and my husband said that it was the best chicken he had ever had. The only change I made to the recipe was to add a tablespoon of ground cumin."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/75409/chicken-hariyali-tikka/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
"name": "Indian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/75409/chicken-hariyali-tikka/",
"name": "Chicken Hariyali Tikka"
}
}
]
}
}
, "about": [
]
}
]