				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken and Rice Casserole I"
,"datePublished": "1999-05-09T14:39:11.000-04:00"
,"dateModified": "2022-08-11T20:59:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Mary Ann Benzon"
,"url": "https://www.allrecipes.com/cook/24324339"
}
]
,"description": "Still quite convenient, this version incorporates onion flavoring with rice, mushrooms and your choice of chicken pieces."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RnyFj3Qh1hKGu7kC0FUq689JwWo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5231910-chicken-and-rice-casserole-i-tcasa-4x3-1-2000-5c70451bb8c74e20911e92aa124af45c.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken and Rice Casserole I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "163"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "367 kcal"
,"carbohydrateContent": "37 g"
,"cholesterolContent": "72 mg"
,"fiberContent": "1 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "1252 mg"
,"sugarContent": "4 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 cup uncooked white rice",
"1 (1 ounce) package dry onion soup mix",
"2 (10.75 ounce) cans condensed cream of mushroom soup",
"1 (4.5 ounce) can sliced mushrooms",
"1 cup milk",
"6 skinless, boneless chicken breast halves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl mix the rice, dry onion soup mix, cream of mushroom soup, mushroom pieces and milk."
} ,{
"@type": "HowToStep"
,"text": "Place the chicken pieces in a 9x13 inch baking dish and pour the mushroom mixture over the chicken. Cover and bake in the preheated oven for 1 hour. Uncover and bake for 15 more minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glass_Cat"
},
"reviewBody": "No More Crunchy Rice, yay!!!! I use the same ingredients but I assemble it differently. I boil boneless skinless chicken thighs until cooked and while that's cooking, I use my rice cooker to cook 3 c white rice.i mix soup, garlic and onion powder and waer (or milk) in a bowl. I stir in chopped up chunks of chicken and some rice noodles the gravy mix, then pour it I to a casserole dish. After sprinkling the 2nd envelope of Lipton Onion Soup mix over the top, I cover it w/loose foil and bake about 30 min at 350 degrees. Easy peasy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael K Kuethas"
},
"reviewBody": "Been making this for 20 years, slightly different. I cook the chicken over a bed of onions and a stick of butter first at 350 for an hour, then mix up the rice (2 cups) / soup x2 / milk x2 and two packets of onion soup mix, then pour that over the chicken and bake another hour. The chicken falls apart and shreds into the casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyKay"
},
"reviewBody": "Been a family favorite for years! Always try to double it so I can have it the next night but it happens every time the whole family goes for seconds and that ends that. Very easy for beginner cooks. We have it 2 times a month."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sean.meijer12"
},
"reviewBody": "I grew up with this and still it’s my favourite and I added several changes to the recipe over the years. Fast east not hard mix it all together and throw it on oven easy love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kirby"
},
"reviewBody": "Used rice medley with quinoa because I didn’t have regular white rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin R Mazzeo"
},
"reviewBody": "My mother made something similar in the ‘60’s &amp; ‘70’s. It’s just as delicious as I remember and definitely my husband’s favorite chicken and rice recipe. Sometimes I do add sliced carrots or peas. It’s wonderful winter comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ"
},
"reviewBody": "I first used this recipe in the 1970s and have used it many times over the years, both for family meals as well as meals given to friends who have had surgery, a baby, a death in the family . . . It is so easy to reheat and everyone seems to like it! I personally do not like strong onion flavor, so I use a little bit of onion powder instead of the soup mix. I'm so glad it was posted here. I am frequently far away from home but still have to cook, and my original handwritten recipe is miles away at home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Fleetwood"
},
"reviewBody": "I tweaked the recipe, I took out the onion soup mix. The kids didn't like it with it in it. Also have used thigh meat and pork chops both come out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A.E. Renegar"
},
"reviewBody": "The 2 cans of soup were enough mushrooms for me so I didn’t add more. I’ve made this years ago but forgot it. I used chicken tenderloins instead of breasts. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Camarillo"
},
"reviewBody": "This is my favorite childhood meal. My grandma always made it with a whole cut up chicken bone in. I prefer to use boneless chicken breasts and to maintain flavor I brown them first. Makes all the difference in the world. Also use minute rice. It does not work with long grain in my experience."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leslie Wells"
},
"reviewBody": "Well I made this exactly the way it said to but the rice was crunchy! It had a great flavor but next time I will use instant rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Saber"
},
"reviewBody": "needed a touch of salt - I used a salt substitute and it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Hilton Tripp"
},
"reviewBody": "A family favorite! I use fresh sliced mushrooms instead! I also use I can cream of chicken &amp; mushroom soup, and 1 can of mushroom soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CougarAcres"
},
"reviewBody": "I have to say, I will normally eat ANYTHING....but this is not something I will ever eat or make again. I followed the directions exactly as they are written...and I had high hopes...but they were shot down in burning flames."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CougarAcres"
},
"reviewBody": "I have to say, I will normally eat ANYTHING....but this is not something I will ever eat or make again. I followed the directions exactly as they are written...and I had high hopes...but they were shot down in burning flames."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tcasa"
},
"reviewBody": "Overall this is a good recipe, perfect for a busy night when my husband is working and I need to put something on the table. This reminded me of something my mother use to make when I was a kid. I used skinless chicken thighs and a packet of Lipton savory herb with garlic seasoning. The trick is to reserve some of the soup/seasoning packet and sprinkle it over the chicken instead of mixing it all into the rice. We all need recipes like this in our recipe boxes because not every night can be a fine dining dinner experience:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristig"
},
"reviewBody": "I have made this several times without the soup mix, so I tried using the onion and mushroom dry mix from one review... (many said the onion dry mix was too salty). I added another 1/2 c of rice and little more milk to go farther, as well as other spices (garlic, paprika, pepper, cayenne, onion powder to doctor it up). This was a HUGE hit, and will be making it again! Def a keeper! I also used instant brown rice, which was another great tip as I have learned from making this previously that the (regular long grain) rice is a little tricky to cook!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Kish"
},
"reviewBody": "I got this recipe from my sister-in-law years ago and lost it -- this was the closest to what she made -- it has always been a huge hit in our house. I use Safron rice (2 cup pkg) and just increase the milk. I also put half the onion-soup in the mixture and the other half on top.\n\nThank you so much for posting your receipe -- very grateful as I haven't made it in quite a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stephanie Caldwell"
},
"reviewBody": "This turned out horrible. I was very dissatisfied. The chicken was very dry and the rice was undercooked. I cooked it longer hoping the rice would cook more but it didn't. Someone mentioned in their review that the rice would be undercooked if you use low fat milk. I used 2% milk and it was still undercooked. Ohh well, better luck next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina Keef Apple"
},
"reviewBody": "This was so simple to make and so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andeL"
},
"reviewBody": "Very good! Family likes it a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Couch Strebler"
},
"reviewBody": "This has been one of my \"go to\" recipes for 25 years. The only change I make is I use 1 can of soup and add 1/2 a stick of butter. Melt the butter, soups, and milk together, stir in the rice (make sure to use Minute Rice, brown or white), and pour the whole mixture over the chicken. Super easy, kid friendly, and great comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Campbell"
},
"reviewBody": "I will make this again for sure but I would add garlic the next time and maybe not cook it as long! It was an amazing dinner though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Hubbard"
},
"reviewBody": "I also have been making this for about 38 years lol. isnt this site good place for beginners to go to anyways? yes its the first dish I learned to make for myself when i got my own place,but its good enough to still be around then huh. I normally put rice on bottom, poured milk over the soups spread on top of chicken pieces, but i like this way better. rice doesnt get crispy in corners of pan. it may be old, but my guys have always loved this simple farmhouse kinda meal. its easy, and son likes it when not feeling well,needs something easy on stomach. so thanks for posting it! I had forgotten how much milk to use, when I found this recipe,so i switched to this one. I only use half packet of the onion soup mix, as its a little strong for me, but thats just my preference. TYSM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MYR"
},
"reviewBody": "I haven't made this in 40 years but it was excellent, using legs, and oven preset to arrive home to the yummy smell n supper cooked. I would adjust dried onion soup mix as I today being the young gal I am, have to watch sodium? Enjoy everyone and I may soon bake it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "toie"
},
"reviewBody": "The next time I make this I am using more rice, less milk and 2 cans sliced mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellin Roche-Donga"
},
"reviewBody": "I have been making this for 45+ years. I love this recipe. I always serve this with cranberry sauce. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamira Bennett Volk"
},
"reviewBody": "Easy and delicious . I made my own seasoning since i like garlic more than onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bamafan0504"
},
"reviewBody": "Yuk! There was no flavor except for the onion soup mix which was way too strong. The rice didn't cook and I did use 2% milk. I won't cook this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bruce D"
},
"reviewBody": "The uncooked rice was still uncooked after baking it for 1 1/2 hours covered and 20 minutes uncovered, and was soupy. I was only able to fit four chicken breasts in the 13 x 9 baking dish and the breasts didn't seem to be particularly large. The finished product tasted good except for the crunchy rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Natasha Douglas"
},
"reviewBody": "Should have listened to the previous reviews and only used 1/2 package of onion soup mix. This was overpoweringly \"onion\" flavored with an entire pouch. However, given the tweak I would imagine this would be very good. Will have to try again with other reviewers suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this exactly by the recipe and my rice was not cooked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andrea a"
},
"reviewBody": "Use instant rice!! I used the uncooked with whole milk and the rice still didn't cook all the way. I also used fresh sliced white mushrooms instead of canned, they tasted amazing. Instead of 2 cream of mushroom.. I used 1 cream of mushroom- 1 cream of chicken. I also sprinkled in some cheddar cheese, especially on top! Overall success... Except for the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nic 's Mom"
},
"reviewBody": "I was in the mood for some good old comfort food and remembered recipes similar to this one from years ago. I followed the recipe exactly and the chicken turned out dry and over cooked. Not sure if the rice would be cooked if you cut the cooking time so I threw out this recipe. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kclawson"
},
"reviewBody": "I made this and used fresh mushrooms instead of canned and also added a little fresh parmesan cheese. It turned out pretty good and it was easy. We will see if my husband likes it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "My mom used to make this recipe for us growing up 30 years ago, we always loved it!!!! I am going to make this weekend!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Raelene.A"
},
"reviewBody": "I tried this recipe yesterday. The flavor was awesome but I used chicken thighs and it took longer then 1 hr and 15 minutes to cook. I would recommend using 2 cups of milk. My rice was still a little undercooked with 1 cup and really thick. 2 cups might have made it better. I also used the onion mushroom soup mix. Will try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CraftyPancakes"
},
"reviewBody": "This just wasn't a dish for me. I can see how it's really easy to put together if you are in a pinch and have just a couple of minutes to throw something together but it really isn't worth it. My family thought it was oddly flavored, overly salty because of the onion soup mix and requested that this not make it into the dinner rotation again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlelady"
},
"reviewBody": "Super easy and delicious! My family LOVES the moist rice, so I doubled the recipe, but used the original 6 chicken breasts. You can also experiment with some added seasonings for a different flavor. Adding a little curry or thyme to the chicken is nice sometimes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NanaKathy"
},
"reviewBody": "I omitted the Onion soup and used one can cream of mushroom soup and One can of Cream of chicken soup. I mixed this in a bowl with the uncooked rice and a warm cup of chicken broth. I sprayed the bottom of a 9x8 cake pan with non stick cooking spray ,added the rice, added the chicken breast on the top of the rice, cover with foil, and cooked for one hour, stirring once at the half hour, and added more water if the rice looks dry. I then take the foil off and let bake an additional 15 to 20 minutes. YUM! what a quick meal to put together! ** If using frozen chicken, Cook an additional half hour with the foil covering it- as the rice does get dry.**"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Falicia Draves"
},
"reviewBody": "A really good recipe but I was afraid it might not taste good so I added some garlic powder, dried parsley leaves, and some chicken seasoning salt. My dad and two siblings loved it and were asking for more. Thanks for this awesome recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessemae88"
},
"reviewBody": "yummmmmmmy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sunflower"
},
"reviewBody": "Made this Saturday night for dinner. Cooked 1 1/2 hours. Chicken was done, brown rice was not. Definitely will not make again. Ugh!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melody Stowers"
},
"reviewBody": "I add a can of cream of celery to the mix. I also bread the chicken with ritz crackers and the onion soup mix then put them in the casserole pan with the rice mix already in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlene"
},
"reviewBody": "The recipe was easy. I didn't have some of the ingredients listed and substituted with what I did have. It came out good except for one thing. The rice didn't fully cook. Next time I plan to use instant rice instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Numnums"
},
"reviewBody": "I didn't care for the onion soup flavor and my canned mushrooms were a bit rubbery. The chicken was tender and the rice was good. I will make it again with some changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLT1"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erick Sarah Marshall"
},
"reviewBody": "I give this 5 stars and yes I am a great cook. 5 because its sooooo easy, yes its yummy and its frugal. I used chicken broth instead of milk and doubled the rice. I have 5 children who are oh so picky and they eat this. Do use instant rice. I love to make this when Im pregnant and too sick to cook or just want a night off. The hubster likes it so its a keeper. the critics need to stop the unnecessary hate over how simple it is. They need soften their hearts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAVIDCASSIDYFAN"
},
"reviewBody": "Yes, I tried this recipe, we love onions so it was perfect. My husband is not really a fan of rice, but in this recipe, he gobbled it down. I give this recipe a thumbs UP on flavor!! Really easy to put together also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsjohnson"
},
"reviewBody": "Very tasty. I cut the recipe in half for me and my husband. I also used jasmine rice, added a garlic clove, and omitted the onion soup. I would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kidsmommab"
},
"reviewBody": "We loved it. Had to substitute with boneless chicken thighs because that's what I had. But it was still very good. I will definitely make again. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ptulip"
},
"reviewBody": "I gave it 4 stars for the simplisty of this dish. Nice receipe for a quick dinner. I was able to used left over cooked chicken, made rice 4 minutes in my pressure cooker, combined everything and placed in oven till hot and bubbly topped with some shredded cheddar cheese. no left overs thanks from a busy mom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "corruptedpeppermint"
},
"reviewBody": "I love this recipe, and have made it several time. Here are some thing I found helpful.\n\nChicken- Bone-in, Skin on. Season to taste and put on top of the rice mix to bake. Otherwise the chicken gets dry.\n\nRice - If your not using instant rice the bake time is closer to 2 hours for the rice to bake all the way. Its well worth the wait.\n\nCover &amp; Bake -This dish needs to be covered and left to bake. If you uncover it to check on it to much it will not bake properly. I use the lid and then seal the lid to the pan with foil. And only check on it after its been cooking for an hour.\n\nGood luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Dunlap Torres"
},
"reviewBody": "I made this for the first time today. Used one can of cream of mushroom and one cream of chicken. Cut chicken in small chunks and added little extra milk and frozen peas and carrots. I did not add the mushrooms but added shredded cheese. Mixed it all together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "juley0129"
},
"reviewBody": "This is a tasty dish which my family really enjoyed! I will make it agian for sure but will as others have said, only use 1/2 package of onion soup mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rayna Eidenschink Erickson"
},
"reviewBody": "The only change I made was to sprinkle the chicken breasts with basil before pouring the mushroom soup mixture over them. I love how easy it was to throw everyting together. It hit the spot on a cool rainy day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanniej"
},
"reviewBody": "I have made this recipe for years but I never used milk or dry onion mix. Everything same, but I use one can cream mushroom, 1 can cr of chicken and 1 can french onion soup mix. cover tightly with foil bake 1 hour at 350, uncover bake 15 min longer. I put chicken breast on top of rice mixture. Great with brown sugar carrots and green bean bundles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine Howley"
},
"reviewBody": "I tried making this a little healthier, using a single can of low fat soup, water rather than milk and fresh mushrooms. \nI used 3 breasts (which turned out to be 2 pounds, and could have gotten away with half that amount) and cut them into bite sized pieces. \nThere was so much talk of undercooked rice in other reviews I started very early. I'm glad I did because it took no less than an hour. I cannot stress enough that if this happens to you to not turn the temperature up. Think about how rice cooks on the stove top. You'll only burn it. \nWhen the rice was fully cooked I added a bag of broccoli flowerettes and put it back in the oven, uncovered, with some Parmesan, bread crumbs and a little of the onion soup mix that I had reserved sprinkled over the top. \nThis is classic 50's style comfort food. It's not gourmet or exciting but it's nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dayna foster"
},
"reviewBody": "Chicken and mixed veggies added and some added seasonings! Baked uncovered for 45 minutes at 380 and then covered for 15 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Made this tonight for my mother in law. I added some carrot and mrs. dash seasoning and nature's seasoning. It was approved! Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ajay6024"
},
"reviewBody": "This needs to be cooked longer, and probably bump the temp up. Rice was still crunchy!! Will make it again, but will make sure to cooke longer and hotter!!\r\n\r\nI also added chopped celery and did not ad the soup mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "I used cream of chicken soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phoebe"
},
"reviewBody": "Good, 1/2 pkg onion/roasted garlic soup mix, 1 can cream of mushroom, 1 can cream of chicken. Fresh mushrooms cooked and drained in the microwave and added. NOt gourmet for sure but great for an ordinary dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randa Slater"
},
"reviewBody": "I made this the first time without any changes beyond using a whole envelop of onion soup mix because I didn't want to waste it. (It is too much onion for some, it was fine for my family.) I loved it! I ultimately tweaked it so with the additions, there is no need for a side dish/vegetables. I added mixed frozen vegetables (any blend you'd like), basil, oregano, parsley, S&amp;P, and garlic powder. I mix it all together and bake according to the instructions but the last 15-20 minutes I add a LOT of shredded cheddar cheese, covering the top completely. (We love cheese!) I do need to increase the total cooking time because of the added vegetables and cheese so that is something to keep in mind. This is by far my favorite thing I cook! I have out of town family for dinner tonight, I can't wait to hear their thoughts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swhitmoreallr"
},
"reviewBody": "I loved this recipe. I read the reviews and had to find out for myself. The recipe worked perfectly using regular rice with no pre-cooking. The trick of course is to make sure the casserole lid is on tight since rice takes liquid and heat to cook. \nI also added in some baked ham pieces and served over a bed of wilted spinach. It was a hit at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Sickles Cameron"
},
"reviewBody": "My husband loves it when I make this. I do use less of the onion soup mix though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "april"
},
"reviewBody": "This was very good. The first time I made this, I added the full packet of onion soup mix and it was too salty... This time around, it came out much better. I only used 1/2 packet of Lipton's Onion Soup Mix, seasoned the chicken with salt and pepper, added about 2 cups of cheese to the mix, baked at 350...45 minutes covered and 20 minutes uncovered.. Also, I added crispy fried onions to the top in the last 5 minutes of baking. Came out MUCH better this time around.. My picky husband who is hard to please in the kitchen, actually went back for 2nds (Which is rare, lol)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tmoesplace"
},
"reviewBody": "based on the cooking temp and time, the rice was still hard, and the chicken was still very raw! get it right before you decide to put it on line!!! it looks and sounds good, may be good if adjusted, but not the way its written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yvonne Weston"
},
"reviewBody": "Very easy and very tasty! I browned the chicken before adding it to the dish. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polandjc"
},
"reviewBody": "I've tried several Chiken and Rice casseroles here and this is the best. I added some chicked bouillon for added flavor. I also use Campbell's Cream of Chicken and Mushroom soup and whole grain rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura M"
},
"reviewBody": "This was a great recipe. My husband hates mushrooms, so I substituted frozen peas instead, and used cream of chicken soup instead of cream of mushroom. It turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlmySidaKay"
},
"reviewBody": "Turned out amazing! Used a whole package of onion mushroom soup mix instead, and added 2 cups of shredded cheddar, most in but enough to add a layer on top of cheese as well. Also went with fresh diced mushrooms instead of canned, cubed chicken instead of just breasts, and a layer of french fried onions on the very top. (And after reading all the other reviews I made sure to use instant rice and it worked perfectly, though it only cooked for an hour covered. Didn't need the extra 15 mins.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Used brown rice &amp; it didn't cook. Good flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hapygrl"
},
"reviewBody": "Well, I dont know about the snob who said this was only for beginners. I made this just like it is written (use half a pkg of onion soup mix) and it was excellent. I have been cooking for 40 years and it was a great easy casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sdavidkova"
},
"reviewBody": "My husband and I liked it a lot. I made it with chicken thighs. it took just 10-15 extra min to cook. It was so easy to make... Just mix in all the ingredients together, pour over chicken and forget about it!! Thanks for the great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adthompson"
},
"reviewBody": "This recipe is a must for busy cooks! I like the fact that most of these ingredients are usually on hand in my kitchen. This will definetly be cooked again in my Kitchen. The onion soup packet made all the difference with this dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CookerMom"
},
"reviewBody": "This dish had an oatmeal looking consistency and the taste was awful. I gave it 1 star because I was able to salvage the chicken, which was moist. The rice did not cook even after 1-1/2 hours. Even though I only used 1/2 the package of onion soup mix as suggested by others, it was still too overpowering. The smell was nauseating after an hour and half. I quick made a couple of sides and wiped off the chicken and saved the meal. I will not be making this or any variation of this meal again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heyheyern"
},
"reviewBody": "Not bad at all. I added an extra can of mushrooms and a cup of frozen spinach. I also added a bit of garlic powder and some other seasonings. The rice turned into somewhat of a bread stuffing consistency so I might add some more milk next time and cut out the last 15 minutes of cooking because everything appeared to be cooked correctly when the hour was up. Overall me and the hubby liked it and it will go into rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "This is a big hit at my house. I used Lipton Onion-Mushroom instead of regular onion soup mix and it helped cut down on the \"oniony\" taste. I skip the can of mushrooms for the kids,who don't like the extra mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marilyn"
},
"reviewBody": "this recipe is a hit in my house, my kids love it, but a little tip to make it faster I cooked the rice separate it only took 15 minutes and had left the chicken cooking in broth and onion soup mixture in the crockpot, when I got hm from t-ball practice all I had to do was add cream of mushroom and rice together with chicken and we didnt have to wait an hour to eat! yay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tori"
},
"reviewBody": "this was SOOOOOO good...We loved it. I didnt use onion soup mix, i didnt have any. So i sliced onion really thin...I also added shredded cheese on top with crumbled crackers, the last 15 mins! Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tnahinu"
},
"reviewBody": "Sorry but i was not impressed. I wont make it again. Like the others, my rice wasn't cooked all the way either. My family didn't like this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shelli"
},
"reviewBody": "Baking time was a little longer than listed, but the result was creamy and delicious! I made it with low-fat cream of mushroom soup and low fat milk--it still tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "Well this is a very easy meal for when you don't have much in the pantry and need to go shopping. I used 1 can mush soup and 1 can of cream of chicken soup. I added some shredded cheddar cheese to the top and French's Fried Onions It added a boost of flavor which this really needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlee Kleve"
},
"reviewBody": "This was pretty good. I did not use instant rice and it cooked just fine. I do agree with other people that it was a little salty. I would use a little less onion soup mix. I think I would also throw some fresh veggies in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Definitely minute rice. I found the chicken PERFECTLY cooked and delicious. Used 1 can of cream of celery and 1 can cream of mush. I used 2 tbsp. of a garlicy-spice seasoning that I had in the house. It was okay but I can see how the the original recipie would be yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lala"
},
"reviewBody": "This was so easy and my kids loved it. I added less onion soup mix probably half a packet, and put cheddar cheese on it for the last five minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JACK T"
},
"reviewBody": "Okay, I think this recipe is getting a bad rap. I used the whole pack of onion soup mix, a can of healthy request cream of mushroom, and 1% milk (I can't drink the 2% or whole stuff). I added some frozen green peas, a can of well rinsed sliced mushrooms, a fresh carrot finely diced, and a lot of black pepper (maybe 1/2 tsp). I cubed my chicken breast. I followed the cooking instructions as written except I topped the casserole with Food Lion dry cornbread stuffing for the last, uncovered 15 mins. I like onion, and the flavor was strong, but not overpowering. The rice came out totally fine. If anything, and I can't believe I'm saying this, it still needed salt added after cooking. I thought it was a great comfort food for the frigid weather we're having. I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKCHILD"
},
"reviewBody": "I was looking for this kind of recipe, but most of the ones I saw, I didn't like the look of. This was the one I decided to go with. I did make some tweaks though. I used Cream of Chickena and Mushroom soup, and fresh mushrooms. I also threw in some spices (basil, oregano, parsley, salt and pepper). I cooked the sauce before putting it in the oven, and put the rice in the sauce to let it soften up a bit before baking. This turned out really good though, and I think I've found another regular recipe to add to the rota."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Montridge"
},
"reviewBody": "I just prepared this for dinner tonight. \nLike many of the other reviewers, I made a few changes...I browned my chicken breasts (which I marinated in Italian dressing first) and sauteed the mushrooms. I also used instant rice, evaporated milk, only half the onion soup mix, and added about a fourth teaspoon of black pepper. \nOther than that, I followed everything else as written. In one hour and fifteen minutes, the casserole was done to perfection. It wasn't soupy or mushy at all. Hot buttered peas and a basket of warm rolls complimented the meal quite nicely.\nI will definitely make this again, but being a bit of an experimental cook, I might try different soup combos/instant soup flavors in future.\nBuon Appetito!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "What a great recipe! I did make a couple of changes- left out the mushrooms and the onion soup- due to what I had on hand at the time. Was still delicious, and as a bonus was so quick to make. This is a new regular meal in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This was pretty good. I used two cups of brown minute rice and a half of the package of soup mix and it turned out perfectly. Putting the rice mixture on top of the chicken keeps the chicken really moist, tender and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I love this casserole. My mom has been making something like this for 20 some odd years. I used this recipe and it tastes just like mom's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Me Here"
},
"reviewBody": "Note: this will not work unless you use that horrible, expensive, disgusting instant rice product. Also if it does work it's just another oversalted, pre-processed \"glop from a can\" dish. What a horrendous waste of expensive chicken breasts this was!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "srhouse"
},
"reviewBody": "I searched for this recipe as I used to make it when I was in college. I make it with one can of cr mushroom soup and one can of cr of chicken soup. The only other change was that I used minute rice brown rice. It turned out perfect, very tasty. Next time will use half pkg of onion soup mix tho. The consistency was perfect, not too runny and the rice was cooked. Didn't have the problems others have mentioned. My very picky husband even loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "clarke"
},
"reviewBody": "Nobody at my house wanted to eat this dish. I was not appealing to the eye and did not have good texture to it at all. Some of the rice was hard and uncooked so i left it to cook a lot longer. Then it was too mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BONLEIGH"
},
"reviewBody": "Not good at all. Couldn't even eat it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kath"
},
"reviewBody": "Good flavor. Rice was hard. I won't make this again. I think recipe required you use instant rice."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8662/chicken-and-rice-casserole-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
"name": "Chicken Breast"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8662/chicken-and-rice-casserole-i/",
"name": "Chicken and Rice Casserole I"
}
}
]
}
}
, "about": [
]
}
]