				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Adobo I"
,"datePublished": "2000-08-11T16:04:45.000-04:00"
,"dateModified": "2019-04-03T23:26:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "roguejoker"
,"url": "https://www.allrecipes.com/cook/147034"
}
]
,"description": "A whole chicken cut into pieces and simmered with a soy-vinegar sauce until infused with flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DhAle31_BlfNld5Z06Fx2XOxYzw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/396607-3fa61e6b1bc94e9abfe5fc9ea39d1a96.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Adobo I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "49"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "340 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "100 mg"
,"fiberContent": "0 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "3600 mg"
,"sugarContent": "0 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups water",
"1 cup distilled white vinegar",
"4 tablespoons soy sauce",
"1 teaspoon whole peppercorns",
"4 cloves garlic, crushed",
"2 tablespoons salt, or to taste",
"1 (2 to 3 pound) whole chicken, cut into pieces",
"2 tablespoons vegetable oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large pot, combine the water, vinegar, soy sauce, peppercorns, garlic and salt. Mix together, add chicken pieces and simmer over low heat (uncovered) until chicken is cooked through and tender (25 to 35 minutes)."
} ,{
"@type": "HowToStep"
,"text": "Remove chicken from pot and brown in oil in a large skillet over medium high heat."
} ,{
"@type": "HowToStep"
,"text": "Return chicken, with oil/juices, back to pot with reserved sauce. Cover and simmer over medium heat until sauce reaches desired consistency."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Baldonado"
},
"reviewBody": "This recipe not bad, I would use way less vinegar usually 1/2 cup and 1/4 to 1/2 soy sauce depending on taste. If your adding fish sauce, use less soy sauce. Never add salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whemingway"
},
"reviewBody": "Very delicious/ I used a whole cup of red sherry vinegar- too much. The basil and squeezed lime sort of calmed it down a bit but I would try half of the vinegar and add it as you cook just so the taste isn't too overwhelming . Overall my family loved it and we will cook again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "Interesting flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karen Chin"
},
"reviewBody": "Way too salty!!! This dish was indelible when following the original recipe and I am not a picky eater. My whole family could barely swallow a few bites because the salt was so high. It tasted like you we're eating salt by the teaspoons. The flavored may have been great if we had eliminated the salt altogether. I will try again with NO salt and see if that makes a difference. I can always add more salt later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "circe257"
},
"reviewBody": "This was okay, but not the Adobo I was hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Will"
},
"reviewBody": "Whoa! Way too much salt! My poor family tried their hardest to pretend to like it. Cut out the salt and add some corn starch to thicken up the sauce. There's enough salt in the soy sauce but you can always add more if you think it needs it. The flavor wasn't bad but it's very hard to get past all the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Absolute delish!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marynolski"
},
"reviewBody": "I always add chicken livers to my adobo. Cook them with the chicken, but mash some of it and put it together with the liquid and bring to a boil, return the chicken and liver and simmer until the sauce thickens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tim S"
},
"reviewBody": "4 stars cause of the salt...don't need it...good base recipe though! I add jalepenos while I am browning the chicken. I also had a lime laying around, squeezed in the juice as suggested by another reviewer and it was very good. We all love Adobo, works great with pork as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "R.M."
},
"reviewBody": "I could never get this recipe right, so I finally looked it up. I liked this one because of its simplicity, but I did tweak it a bit with the advice of everyone before me...first I sauted the garlic and onion, added my chicken to brown and then seasoned with pepper...NO SALT. Then added apple cider vinegar and lite soy in the amounts given. I added water to cover the chicken (didn't measure), added a huge bay leaf (or 2 small ones) and the juice of a lime. I let simmer on medium for 25-30 minutes until the juices reduced...I could hear the pot sizzling...that's how reduced. We all loved it...not too salty and the hint of lime is beautiful. Thanks to everyone for their suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "discogal"
},
"reviewBody": "Growing up in Japan my parents always experimented with Asian dishes. I've been eating this for 20 years. But we make it a little differently. We start by sauteeing a sliced sweet onion in a couple T of olive oil with some minced garlic and brown the chicken parts in this mixture. Then we add the vinegar, soy sauce, some brown sugar, bay leaf, and water. When it's done we eat it over sticky white rice. Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AllisonM"
},
"reviewBody": "My husband and I really liked this recipe. I did omit the salt as previous reviewers had mentioned and it was fine. I also used Chicken breasts because I prefer white meat. Instead of vegetable oil, I used olive oil. I served this with couscous and it was quite tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PRINCESSDJ"
},
"reviewBody": "i didn't evaporate the water enough.. but it's good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Military Cook"
},
"reviewBody": "Love this recipe, I make this in the Mess and in much larger quantities (50 people) and the customers love it. Only thing i change is the amount of Soy Sauce and Salt, but that is due to the large amount made. Have also made this for my parents and friends and they love it also!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Way too much salt! There's already vinegar and soy sauce. No need for salt...especially \"2 Tablespoons\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Delicioso!!! Wouldn't change a thing on this recipe. My whole family loved it, already recommended it to some family members."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica L"
},
"reviewBody": "My fiance is a hard one to please with chicken. He LOVED this recipe. Thank-you so much. This will become a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenbook"
},
"reviewBody": "My family loved this dish! They couldn't eat it fast enough and even my son (who constantly complains) loved it! I too cut the salt in half and it was still plenty salty and quite flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Quincie Ingram"
},
"reviewBody": "I thought this had a great flavor. I gave it 4*'s because it was to salty, but nothing I can't adjust next time. This one is a keeper for my family. I may try the baking idea or at least browning the chicken first. I thought it was kind of a pain to take it out to brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Pretty good recipe for people who have never had adobo, but if you want true filipino adobo, this is not it. Too much water, ended up stewy/soupy! I tried to boil some off but it was just not the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe!! I used little chicken drumsticks though so they were more like buffalo wings and I served them with white rice. My husband loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RHONDA35"
},
"reviewBody": "I've watched my Filipino friends countless times fix Chicken Adobo. This recipe is very good. I personally skin whole pieces of chicken and place them in a baking pan. Mix up the vinegar/soy sauce/juice of one lime/5 bay leaves/4 pods of minced garlic/ 1/3 cup of cooking oil and water.. like a marinade. Then pour this mixture over the chicken.. cover and bake. The chicken comes out VERY tender and full of flavor. The juices in the pan are used as a topping to hot jasmine rice. This is a one pan dish in our house and fixed at least 3 times a month!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHADRACH"
},
"reviewBody": "Fast, easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I marinated the chicken first (for about 2 hrs) with the sauce (adding bay leaves and 1/2 tsp of brown sugar).\r\n\r\nMarinating makes a big difference in taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This sounded good on paper... I took another reviewer's suggestion to add bay leaves and onion to the pot, but it didn't seem to make a difference - the vinegar flavor overpowered the entire dish. My boyfriend said he liked it, but I wasn't that impressed. I used 2 tsps. of salt rather than Tbsps., but used all the soy sauce called for and the salt level seemed to be ok. The chicken came out very dry, and the sauce was almost too tangy to use. I poured the sauce through a colander to get all the chunks out and tried to reduce it, but it stayed pretty watery. Also, when I attempted to brown the chicken, the skin came off - I think broiling is definitely the way to go here to get a crispy outer texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm Filipino-Amer. and I like to try other adobo recipes. This recipe needed some adjustments to it. Salt didn't need to be added because the soysauce is salty enough-the water didn't need to be added because it waters down the flavor and adding 1 to 2 bay leaves are a big part of this recipe. There are also several variations to cooking this recipe. Traditional stove top cooking can be messy so baking is great, leave the skin side up and broil for 10 mins, crunchy chicken skin is \"ono\"\r\n(delicious) and the crockpot is the other alternative cooking method. For those of us who work and just want to come home and EAT. I hope this was helpful : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this recipe at home and asked my filipino friend to come over for dinner. She didn't want to like my chicken adobo, because it was way too salty and something wasn't right with the taste. She told me that I could eliminate the water, add onions, and adjust the amount of soy sauce to suit my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm sorry, I thought this recipe was horrible. The sauce was very, very watery. I marinated the chicken for over 24 hours with the listed ingriedients, and I felt in the end, the chicken still tasted bland. And, to top it off, adding the watery sauce just amplified how sour it truly was. It may be that my mother had a different recipe, but I am Filipino-American and I've had other recipes. I did not consider this one a good one, at least for my own tastes. --too brothy, like soup, I cut the salt, and in the end, way sour from too much vinegar. Any other recipes???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "great, i added less vinegar and doubled the juice recipe for a broth.mother-in-law loves the broth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kraftykitti"
},
"reviewBody": "I made this for my husband whose mother used to make it for him when he was little. When it was done, I was pretty sure that my kids wouldn't like the strong taste so I added a large can of pineapple chunks and juice to it. That mellowed it out just enough and created the perfect ratio of sweet and salty, which complimented the chicken nicely. I also used boneless and skinless chicken and served it over Jasmine rice. I didn't fry it which made it virtually fat free but full of flavor. Needless to say my family enjoyed it and I will surely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LKONZELMAN"
},
"reviewBody": "I did this in a crockpot and thought the sauce was odd - but we all (me and guests) loved the chicken and I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAYESIY"
},
"reviewBody": "My boyfriend loves this dish. Everytime I want to get in his good side I just make this and he's putty in my hands. hehehehe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LULUMARIE"
},
"reviewBody": "Chicken Adobo is delicious when it's done well, and I learned while working in a Filipino restaurant. The chef uses sherry vinegar instead of plain. While the dish is generally characterized by saltiness (Filipinos love salty and sweet flavors), it shouldn't be overwhelmingly salty so you should be able to cut the salt. The sherry vinegar really makes it special."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was great and a nice change from plain baked chicken. I have two children who can be picky at times, and they loved it! When I made it, I also made some plain white rice and poured the liquid over the rice. Tastes great when served with fresh fruit! I do recommend cutting down on the salt, though. Overall...this was a great dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was very good, I took the advice from one of the reviews to not add salt, and I believe that helped. It was fine without. I plan to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I to am an American married to a filipino man who craves his mothers wonderful dishes. He said he liked this almost as much as his moms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have no peppercorns, so I didn't use any. I just threw in some regular ground black pepper. It is excellent, very easy, and a nice change from other chicken dishes. My MIL makes this all the time as she's Filipino. My husband said mine was just as good as hers! (Shhhhhhh! Don't tell her!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "stuck in the suburbs"
},
"reviewBody": "Way too salty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HEATHER FEHRENBACH"
},
"reviewBody": "I love chicken Adobo and thought this was a good version, I added 2 teaspoons of pickling spice which gave it a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought it was a little salty and will skip the salt next time - but it works just as well with skinned chicken. We really liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elizabeth Santana"
},
"reviewBody": "I just didn't card for the flavor. It was really easy, but if the kids, the husband, and I don't like the taste - what's the use?"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20779/chicken-adobo-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
"name": "Filipino"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20779/chicken-adobo-i/",
"name": "Chicken Adobo I"
}
}
]
}
}
, "about": [
]
}
]