				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Shepherd&#39;s Pie"
,"datePublished": "1999-08-26T23:07:00.000-04:00"
,"dateModified": "2022-07-14T17:34:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karyn"
,"url": "https://www.allrecipes.com/cook/24324942"
}
]
,"description": "This is not your typical Shepherd &#39;s Pie. Chicken takes the place of ground beef, a whole head of roasted garlic is mashed into the potatoes, and the thyme and rosemary add a perfect touch. And there &#39;s lots of cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/VLjImOFXSTnkFZ1yzERrWyvVxxo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/537801-4729f364bb9a4eabae126864cff245ae.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Shepherd&#39;s Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "68"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "556 kcal"
,"carbohydrateContent": "60 g"
,"cholesterolContent": "99 mg"
,"fiberContent": "8 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "446 mg"
,"sugarContent": "5 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"8 potatoes",
"0.25 cup butter",
"0.66666698455811 cup milk",
"1 medium head roasted garlic",
"1 pound cooked, shredded chicken breast meat",
"0.5 teaspoon salt",
"0.5 teaspoon freshly ground black pepper",
"1 tablespoon chopped fresh thyme",
"1 tablespoon chopped fresh rosemary",
"0.5 cup red bell pepper, diced",
"1 cup fresh corn kernels",
"1 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To prepare roasted garlic: Cut head of garlic in half and drizzle with olive oil. Wrap in foil and bake at 400 degrees F (200 degrees C) for 45 minutes."
} ,{
"@type": "HowToStep"
,"text": "Reduce oven temperature to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Peel, chop and boil potatoes until tender. Drain, then mash potatoes. Add butter, milk and roasted garlic and mix in. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Arrange chicken evenly in the bottom of a casserole dish, then sprinkle with spices, then layer peppers, corn and all but 1/4 cup cheese. Spread mashed potatoes on top, sealing everything in. Sprinkle with remaining cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 25 minutes or until brown around edges."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Burnett Royal"
},
"reviewBody": "I looked up this recipe after I'd already slow cooked chicken thighs and already slow cooked potatoes in the chicken broth with garlic. What I did was my own thing but it was very similar to what this recipe describes and I was grateful to find and use this recipe to bolster my confidence on how to proceed. Before mashing potatoes, I removed the excess broth and added heavy whipping cream. The broth in a pot, I added carrot chips from the food processor and a handful of fresh rosemary, added tumeric, and garlic powder. After it simmered well, added can of corn. \npretty much followed the recipe otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abbyz2000"
},
"reviewBody": "I left out the salt and pepper and used garlic powder instead of fresh. My daughter had two big helpings and she doesn’t usually ask for seconds. I loved how easy it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Maldonado"
},
"reviewBody": "Yummo! I used green beans with the corn, and a tad bit of tomato sauce with colby-monterrey jack mixed cheese.. awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Morford"
},
"reviewBody": "I like!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rose Munroe"
},
"reviewBody": "It was good taste wise but a bit dry. Seems like it's missing something to us. But I would make it again if I had some left over chicken would probably add something next time to give it moisture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rccardenas224"
},
"reviewBody": "It had way too much thyme and rosemary. It severely overpowered the dish. I believe it would have been a great dish without it. I will make it again but without those 2 ingredients. I will also use more salt to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mine Gursel"
},
"reviewBody": "I improvised with the ingredients, used sweet peas and carrot instead of corn, and a little bir more cheese than the recipe here. It turned out to be very good. A simple recipe resulting in a delicious outcome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R J M"
},
"reviewBody": "We added fresh mushrooms and some watered down boullion to give it moisture. (1/4 cube to a cup of water. Then used a 1/2 cup of it.) This was for a half recipe as my wife doesn't care for traditional shepards pie. She came back for seconds. WOW this is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rmjj"
},
"reviewBody": "This was a most yummy Shepherd's Pie. We had left over potatoes and chicken that had been slow cooked in Lawry's Lemon Pepper marinade. The suggested spices complemented the lemon pepper nicely. The only change I made was I did not have a red pepper on hand so I substituted a 4 ounce can of green chilies. Since we love to broil or slow cook our chicken in the lemon pepper marinade and use the leftover chicken for a second meal this was a great find. Thanks for the recipe. We will definitely have this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ferguson Williams"
},
"reviewBody": "I made this tonight, though admittedly, I took great liberties. I had some leftover chicken I'd cooked in the crock pot, and some leftover mashed potatoes. So I followed some of the recipe. I put the cooked chicken in my dish, topped it with some salt, pepper and I think I sprinkled on some thyme for good measure. I topped that with some chopped onion, some corn I cut off an ear I had in the fridge, and a good amount of frozen peas and carrots I had in my freezer. Oh, and some shredded cheese. Then I heated up the leftover mashed potatoes, just so they would be easier to spread. Then I sprinkled some more cheese on top and cooked according to the recipe, although I think I may have let it cook a bit longer. Anyway, the hubs and I both agreed it turned out fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Wrzesinski"
},
"reviewBody": "Possibilities all over. I could not weigh my leftover cooked chicken.... needed more. The potatoes never browned even with additional time. I added onions and Pace Picante Sauce. I will make it again, even for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindee"
},
"reviewBody": "I made this again last night, this time I sautéed onion, mushrooms and red pepper in evoo. Added 1 can of cream of chicken soup and 1 cup of frozen peas. Used a 1 and 1/2 round casserole dish and used 1 pkg. \nof Idahoan Garlic mashed potatoes prepared as directed. Excellent, great left overs and really yummy. 01/14/15.\n\n\nI loved this receipe based on others recommendations, the only changes I made was to saute the onion, red pepper and 2 stalks of celery in a little eeov, added 1 can cream of mushroom soup and substituted the corn with 1 cup of each frozen green beans and peas. I cheated with Idahoan Garlic mashed potatoes ( I should have used 2 bags, I will next time) Baked for 1 hour at 350 because I used a 2 1/2 round casserole dish. Delicious leftovers. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LBS"
},
"reviewBody": "I used others' suggestions and sauteed my chicken in red wine to add flavor. Then, I mixed all of the veggies with Cream of Mushroom soup and topped with mashed potatoes. Something is definitely missing from this dish. I'm not sure I would make this again. Too much work for disappointing results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ben Ridenour"
},
"reviewBody": "If you have \"wet/loose\" potatos you don't need the soup. If your potatos are stiff, you do. 1/2 tsp of dry thyme &amp; sage is plenty! Good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I also made modifications, and it was very tasty. Added onions and mushrooms, then cooked ground chicken in. Then I added a half can chicken broth soup to give it some moisture, just enough to keep it from being dry. I added more corn to cover the meat layer. Also for my garlic I skin it and let it boil with potatoes and just mash it in. And I put some in with my meat as well to give extra flavour. Gives a lovely mild garlic favour that is not too over powering. An d a little more cheese on top. It was moist and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefeno"
},
"reviewBody": "So good! Made enough to feed my husband and I for a few meals. It's just as good reheated too. Picky husband of mine even liked it enough to get over the bell peppers haha! Will use regularly, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharolyn"
},
"reviewBody": "SUPER!!! Especially the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Hines"
},
"reviewBody": "I gave this recipe a 5 and my husband gave it a 3 so I have rounded it to a 4. I will definitely be making this again. A great way to use up chicken dinner left-overs. I will be using dried rosemary next time as the fresh rosemary was a little bitter. At the recommendation of others I added a can of cream of mushroom soup on top of the vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meba"
},
"reviewBody": "love this however i topped mine with honey cornbread mixed, just made up the batter and poured it over the pie and spinkled a lil more cheese on it bingo perfection!! thank\nyou for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovely Lyndsey"
},
"reviewBody": "Awesome! I used a different mashed potatoes recipe and peas instead of bell pepper and dried spices instead of fresh. My whole family (including my picky eater) ate it and didn't complain after that first bite. Perfect quick meal and using leftovers really helped, too! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPACEANGEL"
},
"reviewBody": "My family &amp; I loved this. I actually forgot to add any seasoning (salt, pepper, rosemary, &amp; thyme), and it was still delicious. I added fresh mushrooms, and frozen peas, just because I had them. The potatoes were quite runny; I will decrease the liquid in the potatoes next time. We all agreed that it would be just as good without chicken, as well (side dish, or Meatless Mondays!). I will definitely be making this again. It was tasty, colourful, and my kids ate their veggies happily :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cambur"
},
"reviewBody": "I made this recipe by memory, and I forgot the cheese. Nonetheless, it turned out yummy and it will probably taste even yummier next time. I figure I can use any left over beef/chicken/pork to make this pie! I did add 1/2 chicken stock to the raw veggies before topping with the mashed potatoes. My potatoes were prepared with 1 clove of minced garlic, 1/4 cup of sourcream, 1/4 cup of milk and a dash of kosher salt. Summary...keeper recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tasteyer"
},
"reviewBody": "I sauteed garlic with 2-3 sticks celery, added the chicken which I fork shredded. Then added 2 cups of water mixed with Chicken Bisto. I used mixed veges. \r\n\r\nI always add an egg yolk to my shepherd's pie potatoes. \r\n\r\nI'd never done one with cheese this way and YES the cheese is a hit.\r\n\r\nI am making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shauna"
},
"reviewBody": "Great recipe if you have leftover roasted chicken or turkey and mashed potatoes. My only suggestions are to pour a can of cream of mushroom soup in with the chicken and veggie mixture and make sure you bake in a shallow casserole dish as opposed to something like what is shown in the photo. I put my pie together in a deeper dish and it took forever to cook, but it turned out tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sheri S."
},
"reviewBody": "This was okay though I won't make it again. I added a can of cream of chicken soup since others indicated it was dry. I also substituted frozen broccoli for the red peppers since I don't care for peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Great recipe, I did add some changes too! I did not do the roasted garlic. I cooked my chicken in a pan with some water to keep it moist; meanwhile I chopped 1/2 onion, 1/2 bell pepper and 4 strips of bacon. Sauteed together until onion softened. added some chopped garlic. Chopped my chicken with my food chopper then added 1 can chopped tomatoes and the spices ( I added oregano too) Let that simmer while finishing potatoes. I added about 1/2 c cheese to my mix, topped with potatoes, baked about 20 min, then topped with more cheese and broiled. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Martita"
},
"reviewBody": "I grilled the chicken until just browned. I then cut it up and sauteed it in chicken broth and 1/2 packet of Ranch dressing mix. I substituted green beans for the veggies. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. H"
},
"reviewBody": "Delicious! I had my hubby make this recipe for dinner on his cooking night. Nice-n-easy for him as there was no pie crust to make. :) Turned out great! Was also great as leftovers. I used dried thyme and rosemary so only half a tablespoon of each was needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vivienne"
},
"reviewBody": "I didn't use the roasted garlic but added garlic salt instead. I forgot the corn and used peppers and broccoli instead. My 2 and 3 year old had 4 servings!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn Couch"
},
"reviewBody": "This recipe was a huge hit with my picky-eater family. I left out the garlic and bell pepper. I also added a can of cream of chicken soup to the chicken. I reduced the thyme to 1 tsp. and rosemary to 2 tsp. (I used dry) I will make this again - and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Feeding 4 Tummies"
},
"reviewBody": "This was ok but I prefer ground beef shepherds pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "As other readers stated, this is a pretty dry dish. I even added cream of chicken soup (from scratch, not a can) and still think it could have used a bit more liquid. I also didn't like the red peppers in the dish. They didn't mingle well with the other ingredients and were too crunchy. My family liked the addition of peas, but we still had to add more salt and pepper to the dish at the table, and I think next time I would use more garlic in the mashed potatoes. This recipe has potential, especially since my 6-year-old asked for seconds, but I will definitely be making some changes to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "strawberry"
},
"reviewBody": "This was a great way to use up extra potatoes and chicken. :) The only change I made was I didn't have time to roast a garlic so I just used minced. I also added some poultry seasoning. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "We loved this recipe. I made a few changes/additions. I used a whole chicken and shredded the meat. Added cream of mushroom soup to the chicken layer to prevent dryness. I used dry spices. Asparagus instead of bell peppers. Did not use any garlic in the potatoes. Kind of tasted like a chicken pot pie....Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KissMorticia"
},
"reviewBody": "Made this with vegetarian chicken and it was amazing!! I'm not sure when the garlic was supposed to be added, so that got skipped accidentally. Otherwise 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mallory Martin"
},
"reviewBody": "It was good, a little dry as written. Next time I will add some kind of sauce to the chicken. Also I had dried herbs and I don't know if it made that big of a difference but it was a little lacking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "txlaurie"
},
"reviewBody": "Very good! I have made this several times which says a lot b/c my husband and I usually dread eating at home. Celery adds a nice flavor,too, and I have also subbed store-ready mashed potatoes for ease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missbetty"
},
"reviewBody": "i added french cut beans instead of red peppers. after reading a few of the posts that the casserol was bland... i decided to combine the vegetable, chicken and herbs with 1 can of cream of mushroom soup. it was phenomenal this way since chicken is kind of a dry meat. lastly, i didn't roast the garlic. instead just added finely minced garlic into the mashed potatoes before i baked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zinernon"
},
"reviewBody": "Sooooo delilcious!!!!! EXCEPT......no rosemary!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Connie W."
},
"reviewBody": "My family really enjoyed this recipe. I rated it with four stars only because it was a little runny when it came out of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Delicious! My family thoroughly enjoyed this dish. I didn't have the spices that the recipe called for so I just used my own and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Coby R"
},
"reviewBody": "4 stars b/c I modified it so much--but it turned out great! I'd made slow cooker chicken with carrots and onions, and used those leftovers for the base--spread chicken out, added rosemary, salt and pepper and paprika. Onions and carrots on top, then 1 1/2c sharp cheddar. I made a package of chicken stuffing, spread that out, then half a can cream of chicken soup for moisture. I had leftover sour cream and chive instant mashed potatoes, so I spread that out, topped off with cheese, baked at 350--yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chelsea"
},
"reviewBody": "i wasnt very impressed with this recipe. I didnt like the texture, it felt mushy( however this might have been my fault...) and it was pretty dry and bland when it was finished. i like my shepards pie to have some juice, enough of it so you can dip the crust in it to mop it up! this had no juice what so ever, for me. i might keep experimenting with this recipe... it does have potential to be really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lovebeingamom"
},
"reviewBody": "Our family enjoyed this, I gave it thee stars because I had to doctor the flavor up with extra seasonings. The original recipe is a little bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JenniferJP"
},
"reviewBody": "Just OK. Eight potatoes was way too many, I ended up using about six, and it was still too much. This was a bit bland, I had to serve a side of brown gravy to add flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wyattdogster"
},
"reviewBody": "Just so-so, thought it was a bit dry. Good flavor but for us it needs to have a sauce or gravy with the chicken, under the potato topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie Klein"
},
"reviewBody": "Really good, If you add the garlic to the chicken it's good as well. Peas and mushrooms are a great substitute to corn for a little variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leanna Brown Snyder"
},
"reviewBody": "Uh! YUM!! Why this is only four stars beats me! I really loved this recipe! I made this for friends and it's gone and recipe was demanded! YUM! YUM! YUM! All around!! Wonderful for those cold days and nights!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MELANKAY"
},
"reviewBody": "Very good!! A great use for leftover mashed potatoes. I simmered the chicken with the spices in chicken broth and red wine so that the flavors really soaked in -- this also made the pie extra juicy, which I liked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pam RN"
},
"reviewBody": "I probably would not make this again. I thought it was rather bland, although I didn't use the garlic because my hjusband doesn't like it. I didn't think there was enough cheese or veggies. I guess there are just other things I would rather make with these ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Cass"
},
"reviewBody": "I changed this recipe significantly to better appeal to my family, and we really liked the modifications. Instead of corn and peppers, I used green beans cooked with bacon and onions. I also made the mashed potatoes using whipped garlic-flavored cream cheese and milk instead of roasted garlic, butter and milk. (Much easier!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ESSIELTTE"
},
"reviewBody": "This was the first time I had ever made a shepherd's pie as I do not care for ground beef too much. The chicken is a very nice change. Be sure not to over mix the potatoes so as to end up with a crisp topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NOZ-N-A-CUK-BUK"
},
"reviewBody": "Surprised at how good this was. I was so tempted to add something to \"sauce\" the chicken, but decided to just follow the recipe. It was very moist and the cheese helped to bind the ingredients. A very satisfying meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANAT"
},
"reviewBody": "I cooked my chicken in a little bit of olive oil with onions on top of stove and near the end to make it lots of gravy I put in 1 can of cream of chicken soup and a jar of chicken gravy.\nLayered the chicken/gravy mixture then added 2 cans of corn and topped it off with my mashed potatoes. Made enough of approximately 8 servings. (ever think of adding a package of stuffing ? Yummie ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGGIEMITCHELL"
},
"reviewBody": "I used instant garlic potatoes for this recipe instead of cooking &amp; mashing potatoes. This was a really good recipe (even my fiance liked this one). I added frozen peas in with the corn (and omitted the red peppers since I didn't have any). This is definitely a quick, yet hearty dish. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great alternative to the beef version. I didn't really like the rosemary flavor, but that's just a personal thing. Yummy, stick-to-your-ribs dinner!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12621/chicken-shepherds-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
"name": "Savory Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2254/main-dish/savory-pies/chicken-pie/",
"name": "Chicken Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12621/chicken-shepherds-pie/",
"name": "Chicken Shepherd&#39;s Pie"
}
}
]
}
}
, "about": [
]
}
]