				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken and Spinach Ravioli"
,"datePublished": "2019-04-03T23:32:17.000-04:00"
,"dateModified": "2022-07-14T16:31:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JCBanks"
,"url": "https://www.allrecipes.com/cook/1038433"
}
]
,"description": "A delicious combination of chicken and spinach make a wonderful Italian meal. Make sure to have plenty of freshly grated Asiago cheese to top these ravioli."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YOZVEXRIK9txkQ3pwS_xBansCIM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4582862-d233f1eaa5c646eb9d9fcffcdf514396.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken and Spinach Ravioli"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "64"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "621 kcal"
,"carbohydrateContent": "102 g"
,"cholesterolContent": "148 mg"
,"fiberContent": "7 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "1346 mg"
,"sugarContent": "17 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"4 eggs, beaten",
"0.75 cup water",
"3.75 cups sifted all-purpose flour",
"1.5 teaspoons salt",
"0.5 pound ground chicken",
"0.75 cup chopped fresh spinach",
"2 tablespoons finely chopped onion",
"3 tablespoons melted butter",
"3 tablespoons freshly grated Asiago cheese",
"0.25 teaspoon salt",
"0.25 teaspoon garlic powder",
"0.125 teaspoon ground nutmeg",
"1 pinch ground black pepper to taste",
"1 (16 ounce) jar marinara sauce",
"0.25 cup freshly grated Asiago cheese for topping" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a bowl, mix the eggs, water, 2 cups flour, and salt. Gradually mix in the remaining flour until smooth. Divide dough into 2 parts. Cover, and set aside in the refrigerator 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "In a skillet over medium heat, cook the ground chicken until evenly brown; drain."
} ,{
"@type": "HowToStep"
,"text": "In a food processor, mix the chicken, spinach, and onion. Transfer to a bowl, and mix with butter, 3 tablespoons Asiago cheese, salt, garlic powder, nutmeg, and pepper."
} ,{
"@type": "HowToStep"
,"text": "On a lightly floured surface, roll out each part of the dough to 1/8 inch thickness. Cut into 2 inch squares. Place about 1 teaspoon of the chicken mixture in the center of 1/2 the squares, and top with remaining squares. Seal the edges of the squares with a moistened fork to form the ravioli."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil, and cook the ravioli in small batches for about 8 minutes, or until al dente. Drain, and rinse under cold water."
} ,{
"@type": "HowToStep"
,"text": "Place the marinara sauce in a saucepan, and cook until heated through. Serve ravioli topped with marinara sauce and remaining Asiago cheese."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eliza Hunter"
},
"reviewBody": "Only reason I didn't give it 5 stars is because alfredo sauce or other white sauce are way more suited for chicken and spinach than marinara sauce. I also added some coriander and parsley to the filling to really round it out and this taste is amazing. This is my first try at raviolis and I'd pay money for this at a restaurant. Great recipe, with modifications"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abby"
},
"reviewBody": "The pasta needed less water or more flour - it was very sticky. My pastas wound up looking like mashed potatoes, but the taste was great! I added ricotta cheese to the filling and used Parmesan instead of Asiago."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "China"
},
"reviewBody": "Have it only 4stars because I didn't make the dough I also used wonton wrappers. The filling was delicious. I poached my own chicken. I also cooked my onion and spinach and squeezed dry. It made 25 ravioli with only enough filling leftover for two wontons which I had ran out of. I measured one packed tablespoon for each ravioli so I thought the measurements worked really well for the pack of wontons. I also didn't use the nutmeg it gives me heartburn?? . Going to try this again with homemade dough. I thought the wontons were too thin. But the filling is fantastic and I may use it for lasagna rolls as someone else suggested. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica Pavliga"
},
"reviewBody": "Review is on the filling only:\nAs a couple other reviews mentioned, the filling is a bit dry so I'll try it again by either adding some olive oil when cooking the chicken or mixing in a little ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rahila"
},
"reviewBody": "It came out really well it just took way longer to make and finish then I expected"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "Great recipe. For the pasta I slowly added water until it looked right. This was my first time making pasta so I was guessing. Came out fabulously. I loved the filling and my entire family loved this. Served with an pesto Alfredo sauce. Amazing. And my whole family was very impressed. A lot of work but I made it a family project and we had a great time together making these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Vigurs"
},
"reviewBody": "very good! I might try a sauce that is a little less overpowering though, maybe a butter and sage sauce?. but a good recipe for pasta if you dont skimp on the kneading time and get pasta flour for the job."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother Ann"
},
"reviewBody": "I'm giving this 5 stars as we really loved it. I did make a couple changes like I did not use Asiago cheese but feta cheese and I used a red onion. I did this because I had a sauce in mind I was making that had Kalamata olives in it and I love those flavors altogether. I also did not use the pasta dough recipe as I have my own that always comes out fine. It was just enough filling for my dough and every bite was eaten. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Brea"
},
"reviewBody": "Wonderful flavors! It was a lot of work but memories have been made and this one is a keeper! I added some Italian seasoning to my dough and used fresh minced garlic. The results were fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I used 1 lb of turkey instead and liked the overall taste of this. Gives me an appreciation of ravioli. So much work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sericks7"
},
"reviewBody": "Have made this twice now. The first time was my first experience making homemade pasta. I followed the recipe to a t and thought it turned out great the first time. Now after a few more batches of pasta under my belt, I thought I'd try it again. I made a few tweaks to the filling by adding some ricotta and a little extra cheese ( c'mon when has a little extra cheese ever hurt anyone). This time it turned out fantastic!!! Served it with a homemade cream sauce and it was great!! I will definitely be keeping this recipe close!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mkstevens09"
},
"reviewBody": "I tried making this recipe, but the dough was a total disaster and I don't have enough experience making dough to know how to fix it. The filling looks like it could be tasty though, and most other reviewers seem to think this recipe is good with some other kind of wrapper instead of what the recipe calls for. I may try this again someday with wonton wrappers or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "My hubby loved this I made them into Tortilini's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JannieRee"
},
"reviewBody": "Notes: do NOT layer the ravioli while making them and keep some space between individual ones; any part touching WILL stick together! \n\nThe family loved these; my son thinks we should make them for everyone at Christmastime, too. Takes some time, but definitely worth the work!!! Had lots of fun making them. Thanks for the great, easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "silentrose"
},
"reviewBody": "i enjoyed the recipie alot although i did make a few changes. instead of asiago cheese i put 8oz of cream cheese. and someone had suggested to add mushrooms so instead od adding them. i used the fresh mushroom marinara sauce. tasted great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOHN"
},
"reviewBody": "This recipe work great for me. The filling was delicious, the pasta firm, yet tender. Was a very easy recipe to follow.\n\nFYI:THIS IS A RECIPE FOR MATURE/ADULT PALATES. NOT FAST FOOD JUNKIES OR YOUNG CHILDREN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Winnie"
},
"reviewBody": "I would add less water and add more flour, as the dough was difficult to work with and the raviolis came out looking lumpy and miss-shapen. To cut the dough, I would suggest using a pizza cutter and making the squares as even as possible. Overall, with the sauce, it tasted fairly good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ake-2-bake"
},
"reviewBody": "i have made this recipe twice now. its great. i dont use the filling recipe part just the dough. i tweaked it so i put all the flour and salt in and make a whole in the middle, add the eggs beat them in. Since it will be too dry add water, i normally use less. \nfor filling i use ground beef with tomato sauce. i cook it until not pasty. it tastes great this way too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Greta"
},
"reviewBody": "I didn't use the pasta dough recipe, i used my own. But the filling was extremely bland and i followed the instructions completely. Won't be trying this again unfortunately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jot"
},
"reviewBody": "This was delicious. I substituted mozzerella cheese for asiago because I didn't have that on hand and they were fantastic. The best ravioli I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Pregno-Tello"
},
"reviewBody": "Very tasty. I used wonton wrappers to cut down on time. Worked great!! I also used perdue already seasoned italian flavored chicken cuts. Easy to make and a nice change from the day to day. Soemthing special without all the hassle. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne"
},
"reviewBody": "For having never made ravioli or pasta before, I thought this recipe was easy and super yummy. I added ricotta to the inside mixture and made the pasta with whole wheat flour. The recipe called for the right about of water for me (maybe a tsp extra than I needed, but I made up for it with flour). I drizzled the cooked pasta with olive oil, mozzarella and a teensy bit of seasoned salt. I will use this recipe again, maybe tweaked a little - but it's a great starting point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "creativecook"
},
"reviewBody": "awesome :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rayhenry"
},
"reviewBody": "This is my first ravioli i have ever made but i am pretty experienced and i used a different noodle recipe and i doubled the cheese and it was the best ravioli ever my parents loved it too.So only add about 2 and a half tbs of water and 4 cups flour and a pinch of salt and 4 large eggs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CAMyers"
},
"reviewBody": "This was very good. I used ground turkey in my mixture just because I don't care for the taste of ground chicken. It was still very good. The mixture was a tad dry, but very flavorful. As with other users, I added water 2TBLS at a time until it was the correct consistency. We used the cheese, just regular pesto sauce, and fresh diced tomatoes to top it off. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALIEA"
},
"reviewBody": "This was really great. I think its unfair all the reviews stating this recipe is not worth all the work. ALL homemade ravioli is time consuming, and this recipe's filling is delicious. We were being run out of the garden with so much basil, so we topped this with a pesto cream and it was INCREDIBLE. The filling was so good, I used the leftovers (with a little ricotta mixed in) for lasagna roll-ups a couple days later. Thanks for a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VIVNIDHI"
},
"reviewBody": "Had spinach pasta dough so skipped the spinach in filling. Used veggie chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "newcook1"
},
"reviewBody": "This was good but not worth all the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bbuster"
},
"reviewBody": "Prepare for 4 hours in the kitchen. Dont attempt this without a pasta roller. I could not get the pasta thin enough to enjoy. I had to add cheese on top to take away the dryness. Not a bad evening project, but I found that it works best to use 4\" squares of pasta and cut off the extra.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "WeirdAuntMartha"
},
"reviewBody": "Should have listened to my gut (and the other reviewers). There was way too much water in the dough. It was completely unworkable and I had to throw it all away =("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "taralynne"
},
"reviewBody": "This WAS a lot of work! I substituted broccoli for the spinach and also added mushrooms and fresh garlic instead of powder. We had no problem with lack of flavor with this. I thought I rolled the pasta thin enough, but WOW, it tripled in size. Next time I will make it paper-thin and may even do 1\" to 1.5\" size squares as the 2\" ended up expanding to the size of my hand. I had a lot of the chicken/broccoli stuffing left over so I will try and stuff them to the max next time. This time I just added the leftover mix to the sauce and it was great. Definitely something fun to do when you have the time! Also, for the pasta I used 100% whole wheat, organic flour to make it healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Theresa Shea Whisenhunt"
},
"reviewBody": "I think the problem that people are having is that this recipe is listing WAY TOO much water for the amount of flour and eggs used. This really only needs like 2 tablespoons of water. I have been making pasta for a while now with my kitchenaid and the basic recipe I use is 4 large eggs, 4 cups flour, 2 tbls water, 1 tsp salt... try that. The dough will be pretty stiff and if you arent using a pasta roller you may need to soften if up just a tad but much easier to add a tsp of water at a time to get the right consistency than cups of flour..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindseykai"
},
"reviewBody": "We changed some things, but only because we didn't have all of the ingredients; cooked the chicken with fresh spinach, put in the food processor with roasted garlic, cheddar and a splash of my homemade veggi marinara. I was suprised how well the man did with the pasta, but it was a lot of work. Not a dish I would do for a quickie, but we love, love, loved this!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JKL"
},
"reviewBody": "it was ok. I nixed the spinach (husband doesn't do veggies!) but the mixture was pretty good. my first attempt at homemade pasta.... it was ok. here are things i would do differently:\n1. Roll the pasta out very very thin\n2. Make the strips wider (4 inches??)\n3. Put less filling on\n\nMy biggest issue was getting the ravioli to stay sealed.... all my filling came out. Not sure what i did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nerdmom"
},
"reviewBody": "This was a great recipe. The filling was a little bland for my taste to next time I will use fresh garlic instead of powdered.\nAlso, pasta dough is all about experience. Too sticky and it won't form well, kneaded too much and it won't roll well. You can add flour to compensate for too much water, and just knead until it is elastic and holds together. \nI didn't let mine rest in the refrigerator, just covered in a bowl on the counter and it was workable enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Smiley"
},
"reviewBody": "I made this tonight and it was actually quite fun. Make sure you roll the dough VERY thing as they tend to 'blow up' in size once cooked. I made a homemade marinara to top it off with and it was superb. I did not have nutmeg so I put a little tiny shake of ginger in instead. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "natashasulin"
},
"reviewBody": "i would never make this recipe again...sorry...i really dun like giving bad reviews....firstly the spinach and the chicken stuffing in the ravioli was bland...i love pasta but this was just tasteless...i experimented on my boyfriend and sister and they didnt even finish 3 pieces of ravioli...i dough for the ravioli was just too hard and took a long time to cook...i didnt have the proper machine to roll the dough into 1/8th an inch...i used a rolling pin and it took ages to get it rolled that thin...not to mention it was tiring as well...the stuffing seemed too watery and when placed on the dough it didnt stay in shape and the dough eventually got soaked with the moisture of the stuffing...ill never make this again...took too much time and preparation...sorry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lucky Noodles"
},
"reviewBody": "My first time at making homemade Ravioli! It was fun - do make sure to roll out the dough VERY THIN. I probably won't process the filling as much as I did, I'd like it chucky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonfire!"
},
"reviewBody": "I don't think I am cut out for pasta making because I couldn't get the dough thin enough and it seemed to keep snapping back. The filling, however was DELICIOUS and I ended up using it with a garlic cream sauce over store bought noodles. I think I will try Melissa's suggestion of wonton wrappers next time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LoraineT"
},
"reviewBody": "My husband liked this. The filling was great. However, I would look elsewhere for the pasta dough. It was too difficult to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "patrak17"
},
"reviewBody": "This was my first time making pasta, let alone ravioli. I loved making this dish, however I felt the filling was a little too dry. I'd put more oil or butter in it to moisten it up a little bit. Also, I don't think it's completely necessary to cool the ravioli off completely. The hot sauce isn't always enough to warm it up completely to serve. I had a grea ttime making it though and it tasted delicious. I used left over meat mix to make a lasagna aftewards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cedric"
},
"reviewBody": "These are great. Don't change a thing! Except maybe add some beef in with the tomato sauce and some spices too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrs. flyfisher"
},
"reviewBody": "My husband and I loved these! Very similar to what my grandmother makes. One small change I've added from grandma's recipe- instead of 3/4 cup water for the dough, I used 3/4 cup mashed potatoes. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ladeedadeeeverybody"
},
"reviewBody": "The chicken and spinach mixture smells terrible. After mixing it up with the spices and cooking it I thought it might be edible. When I served it my 3 year old daughter said 'I don't like that green stuff' but my wife sealed the deal when she said she was trying to be nice and congratulated me for the effort as she proceeded to empty 2 or 3 ravioli of their contents.\nI ate some of the shells. Then I left the table, repulsed by the smell of the filling sitting on my plate. I am in the other room writing this review and trying not to think about it so I don't have to make a trip to the bathroom to throw up.\nIf you use the shell recipe, you'd have to be made out of teflon to make it work. Try multiplying the flour by 150% and then you might have a fighting chance at creating the raviolis, much less removing them from whatever surface they are placed on to put into the boiling water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RMHJ"
},
"reviewBody": "i made half the batch according to the recipe, and used portobello mushrooms instead of chicken in the other half. it was very good, but the pasta was really chewy. it was my first attempt at homemade pasta so i think this was my fault and not the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MEHUNGRY98"
},
"reviewBody": "I can't comment on the pasta part because I used my own recipe, but the filling just isn't that great - I usually really enjoy ground chicken dishes and spinach dishes but this was just so-so; too much work for the result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was great. But I used store bought wonton wrappers instead of making my own dough from scratch. It went a lot quicker and the results were great. Everyone loved the dish. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBG"
},
"reviewBody": "Excellent recipe, even better when you add some fresh mushroom pieces"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sara Reichenbach"
},
"reviewBody": "Admittedly this was my first shot at ravioli - but this just tanked. The dough was far too sticky, the ravioli too heavy - surely I did something wrong (but not such a complicated recipe!) We couldn't eat it, which is too bad because I spent HOURS on it. I am officially scared off of home made pasta =("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My first attempt at ravioli! The recipe was easy to follow and quite delicious... the filling had a wonderful flavor. I made a simple tomato sauce for these, and the combined dish had a very fresh taste. It was well-received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent recipe...tastes great!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/70509/chicken-and-spinach-ravioli/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16767/world-cuisine/european/italian/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1796/world-cuisine/european/italian/main-dishes/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/70509/chicken-and-spinach-ravioli/",
"name": "Chicken and Spinach Ravioli"
}
}
]
}
}
, "about": [
]
}
]