				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Souvlaki Gyro Style"
,"datePublished": "2019-07-10T02:54:10.000-04:00"
,"dateModified": "2022-06-13T09:23:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chris J"
,"url": "https://www.allrecipes.com/cook/chrisj"
}
]
,"description": "An easy and delicious recipe for Greek gyros with grilled souvlaki chicken and rich tzatziki sauce. Serve buffet-style so guests can choose their own toppings."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xROlsDAeB_2WWHamLRT6145PBsk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7127584-35360c7dc41f4b98b47b0d7a8cbbdf66.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Souvlaki Gyro Style"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "587"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "764 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "133 mg"
,"fiberContent": "4 g"
,"proteinContent": "44 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "3170 mg"
,"sugarContent": "12 g"
,"fatContent": "41 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.75 cup balsamic vinaigrette salad dressing",
"3 tablespoons lemon juice",
"1 tablespoon dried oregano",
"0.5 teaspoon freshly ground black pepper",
"4 skinless, boneless chicken breast halves",
"0.5 cup seeded, shredded cucumber",
"1 teaspoon kosher salt",
"1 cup plain yogurt",
"0.25 cup sour cream",
"1 tablespoon lemon juice",
"0.5 tablespoon rice vinegar",
"1 teaspoon olive oil",
"1 clove garlic, minced",
"1 tablespoon chopped fresh dill",
"0.5 teaspoon Greek seasoning",
"kosher salt to taste",
"freshly ground black pepper to taste",
"4 large pita bread rounds",
"1 heart of romaine lettuce, cut into 1/4 inch slices",
"1 red onion, thinly sliced",
"1 tomato, halved and sliced",
"0.5 cup kalamata olives",
"0.5 cup pepperoncini",
"1 cup crumbled feta cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a small bowl, mix balsamic vinaigrette, juice from 1/2 lemon, oregano, and 1/2 teaspoon black pepper. Place chicken in a large resealable plastic bag. Pour marinade over chicken, seal, and refrigerate for at least 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat an outdoor grill for high heat."
} ,{
"@type": "HowToStep"
,"text": "Toss shredded cucumber with 1 teaspoon kosher salt; set aside for at least 5 minutes. In a medium bowl, mix yogurt, sour cream, 1 tablespoon lemon juice, rice vinegar, and olive oil. Season with garlic, fresh dill, and Greek seasoning. Squeeze cucumber to remove any excess water; stir into sauce. Season to taste with kosher salt and pepper. Refrigerate until ready to use."
} ,{
"@type": "HowToStep"
,"text": "Remove chicken from marinade and place on the preheated grill. Discard remaining marinade. Cook chicken until juices run clear, about 8 minutes on each side. Remove chicken from heat, and allow to sit about 10 minutes before slicing into thin strips."
} ,{
"@type": "HowToStep"
,"text": "Place pita rounds on the grill, and cook for about 2 minutes, until warm, turning frequently to avoid burning. Arrange warmed pita, sliced chicken, lettuce, onion, tomato, olives, and pepperoncini on a serving platter. Serve tzatziki sauce and feta cheese in separate bowls on the side. Stuff pita pockets with chicken and toppings to serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Chapman"
},
"reviewBody": "Really liked the marinade. The meal tasted fresh and delicious. Got the pita still warm from a local Persian restaurant. Both parents and tweens liked the meal. Put out all ingredients on the table and everyone made their own slovaki."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tena Kartinen"
},
"reviewBody": "Great tasting chicken and sauce. Didn’t change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Hardy"
},
"reviewBody": "The only change I made was using Naan instead of pita &amp; it was delish. Husband &amp; teenage kid approved too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karalyn16"
},
"reviewBody": "The chicken was OK. This is the best recipe for tzatziki I've ever made though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Patel"
},
"reviewBody": "Used 3 parts balsamic + 1 part olive oil instead of vinaigrette."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gingb"
},
"reviewBody": "Very tasty, hubby and I both enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Ryals Morris"
},
"reviewBody": "This is an EXCELLENT recipe! Needs no adjustments! Only thing is, I used chicken thighs instead of breasts because that’s all I had on hand. This will definitely be a favorite in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dennis N Teresa Pullen"
},
"reviewBody": "sauce was perfect. Chicken was tender and delicious. I will probably marinate the chicken longer than an hour though as I feel it could have used more flavor. I'll try and spice it up a bit more next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shimira W"
},
"reviewBody": "Off Da Chain!! Savory And Succulent, the sauce is absolutely delicious. The chicken is very tender a flavorful, the balsamic marinade made it taste totally like it’s souvlaki. love love this dish. Used indoor stove top grill. Tip: If you salt and let cucumbers stand you don’t need to add more salt at the end of making the sauce. The sauce is so so savory and garlicky in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Mersereau"
},
"reviewBody": "This is very good! I used to use a recipe that required me to skewer and broil the chicken and onions. Didn’t like that. Plus it took a ton of time. Now I just cube up the chicken, and roughly chop a red onion, and put it all in a baggie with the marinade for an hour. After the hour I dump it all out onto a parchment lined cookie sheet and bake at 350° for a 30-40 mins....stirring it up once during cooking. It’s so good! And it’s quite a lot! I could prob get 8-10 pita wraps out of this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole H."
},
"reviewBody": "This recipe is exceptional and always a hit! I add much more seasoning to the chicken marinade (which I marinate overnight), and add more seasoning to the tzatziki as needed. It's not necessary, but we like a lot of flavor. Close to an authentic gyro, I was shocked by how delicious it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkristenus"
},
"reviewBody": "This was the most awesome chicken gyros I have ever eaten and I live on the south side of Chicago, where chicken gyros are of abundance. Definitely a keeper! I usually have to \"doctor\" a recipe to my liking, but not this one! Thank you! Will probably make again in a few days, with all of the tzatziki sauce I have leftover (I doubled batch)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Delicious! I didn't change ANYTHING in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "Yummy! I used bl/sl thighs and grilled indoors as the weather was bad. The marinade was very good. The tzatziki sauce was very tasty, add a little more garlic next time, had to use dried dill as I did not have fresh. Made Seredipity Bread to have with it and Greek salad.\n#AllrecipesAllstarsCanada\n#InternationalFavourites"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BirshyKat"
},
"reviewBody": "We loved this recipe! Per the suggestions of others, I used plain greek yogurt which gave the sauce a really nice thicker consistency. I used 1/2 tbsp of dried dill, instead of fresh. I sprinkled the shredded cucumber with salt and let it sit for a few minutes. I then put the cucumber in a sieve with a heavy bowl/object on top, to drain off any excessive liquid. I made the sauce the night before so the flavors had time to meld. I added the chicken to marinade before leaving for work in the morning. Since I knew I would be rushed for dinner, I bought already chopped (bagged) romaine lettuce and jars of sliced pepperoncinis and kalamata olives. The most important thing is to buy a GOOD, thicker pita/flatbread. We found a brand called \"Papa Pita Flat Bread\" that was wonderful! The first time I made this it was cold and snowing in our beautiful state of Minnesota, so I cooked the chicken breast on our old George Foreman grill. ;-) Everything turned out wonderful! Definitely will be adding this to our regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "The only thing I substituted was I cooked the chicken in a cast iron pan until 165 ... this was restaurant quality!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maddielynn"
},
"reviewBody": "I made it once as described and had too much chicken. I used the leftover chicken and served it over a bed of rice that I had mixed with greek seasoning. Both ways were very delicious. Will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catherine"
},
"reviewBody": "never use aluminum foil on something acidic, lemon juice will eat away on the aluminum foil and you will have metals in your dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DARLA11"
},
"reviewBody": "I follow directions and used listed ingredients. The sauce was good and the marinade gave the chicken a nice flavor...but still, I felt like it was missing something. \nIt seemed bland...heaping on a lot of olives and pepperoncinni seemed to help, so maybe it just needed more salt. \nI've only had Greek food a few times so not much to compare this recipe to. It is a light and healthy seeming recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary"
},
"reviewBody": "Great sandwich, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzyk"
},
"reviewBody": "My husband, who doesn't cook often, made these for me for Mother's Day at my request. Absolutely delicious. Kids loved them too! We topped with store bought tzatziki and served on lightly grilled naan bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Gocha"
},
"reviewBody": "I never add dill to any recipes really, but I did add in order to keep with the recipe. I did like it, but will omit next time. This was a really good recipe to follow and easy to modify to your liking. I will omit dill next time and add a lot more garlic. Also, being a huge mayo fan, I love adding about 1/4c to cucumber sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sowdersphotography"
},
"reviewBody": "Loved this!! Followed the recipe exactly except I left out the pepperoncini (just not a fan of them). For those of us who are gluten-free I used gluten-free wraps, and it was still great! Ate leftover chicken and cucumber sauce on a salad the next day. Don't be intimidated by the long list of ingredients. It's pretty easy. I marinated the chicken before I went to work. Then when I came home I made cucumber sauce, then while chicken cooked I cut up the lettuce &amp; tomatoes and cleaned up. From start to table it only took 30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jan"
},
"reviewBody": "Excellent recipe! Didn't change a thing. I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brewmeister"
},
"reviewBody": "I've made this recipe so many times. Easily one of my favorites. Don't change a thing and it is spot on. Substitute whatever meat you like and it is equally as good. Make extra sauce because it is a great veggie dip when left over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Adamczyk"
},
"reviewBody": "Anyone on this site saying that the marinade had too much vinegar used the wrong thing - there is NO vinegar in the marinade recipe - it's balsamic vinegar DRESSING, and the marinade tastes great! I let my chicken breasts marinade for seven hours in the refrigerator, and they came out tasting like those we've had in Greece. I like Chef John's tzatziki sauce that doesn't include sour cream or olive oil, but did go ahead and add the Greek seasoning that this recipe calls for - made the best tasting sauce, as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kris.c"
},
"reviewBody": "The best souvlaki and tzatziki I've ever had! Even better than our local Greek restaurants. Even my 1 year old devoured it!! He just LOVED the tzatziki sauce! The only ingredient I changed was the rice vinegar; substituted for apple cider vinegar with a little sugar added. It was so good, I'm gonna make it again tonight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryno's mom"
},
"reviewBody": "little too zingy with lemon and vinegar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evan Elise Termini"
},
"reviewBody": "Holy guys!! This recipe is amazing. I followed it almost exactly.. meaning to the best of my ability. I cut up my chicken because I am a college student in an apartment so all I have is a George Foreman grill, it still came out amazing. The tzatiki sauce recipe is awesome too. Like everything is so on point. I had it with a Greek style salad and roasted potatoes! So much leftovers but I'm glad.. now I have healthy meals for a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I don't know how one \"shreds\" a cucumber, so I \"diced\" one into the smallest pieces I could manage. Still, this was delicious, The vinegar content was too high for my husband, though, and he had to have cold cuts instead. Poor fellow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I don't know how one \"shreds\" a cucumber, so I \"diced\" one into the smallest pieces I could manage. Still, this was delicious, The vinegar content was too high for my husband, though, and he had to have cold cuts instead. Poor fellow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "williamrgrosh"
},
"reviewBody": "Great marinade. I used waaay more cucumbers to get the sauce to the right taste as well as a TON more seasoning than is recommended. If you nail the tzatziki sauce then you will mostly likely nail the meal so definitely follow your taste buds. \n\nThe plain yogurt you choose can make the sauce turn out differently. Some yogurt has a very bitter aftertaste, like what I used, and you will end up putting crazy amounts of dill, greek seasoning, and salt to try to drown out the bitterness.\n\nI cooked it at the stove because I didn't feel like grilling the chicken. It would have turned out a whole lot better over an open flame but it was great regardless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Apple Tennis"
},
"reviewBody": "This was fabulous..as long as you prep in advance enough it's a really simple recipe!Made it as written except added a little more garlic to the yogurt sauce.Make sure you get good pita..lol..that's the one problem we had.Our market just carried the one brand.Definetly going to make again!Thanks for the great recipe????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raquel Barron"
},
"reviewBody": "This is one of my favorite recipes, and one of the go-to meals in our house when we have the time to make it. It's rather time consuming to put together, but oh-so worth the effort.\n\nRather than cooking the chicken on the grill, I cook the chicken on the stove (marinade mixture and all) until the marinade mix reduces and leaves a dark, delicious coat on the chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne"
},
"reviewBody": "Delicious recipe. Used dried dill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJC"
},
"reviewBody": "Delicious, made with veggies and herbs from the garden. Fresh and light for a summer meal. Followed the recipe as written, with the exception of fresh oregano and added avocado just because I had a ripe one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Edgar"
},
"reviewBody": "I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is a keeper! It's very easy, considering how many ingredients are required, and so delicious!! I've actually used this marinade and just eaten the chicken grilled, without completing the recipe, and even that is phenomenal. I wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandybethg"
},
"reviewBody": "SO SO good!!! Make it exactly as the recipe. Only problem I ran into is I couldn't find greek seasoning at the store. But I found a recipe for it on here and made my own =) this is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kmart321"
},
"reviewBody": "Very tasty! Would be better with more veggies inside and there was lots of leftover sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JTTERWELP"
},
"reviewBody": "Easy, fresh, and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G-Rocks"
},
"reviewBody": "This is the real deal! I will make this again &amp; again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparkledeecorti"
},
"reviewBody": "I made these for my husband....who is NOT a chicken breast fan....and he LOVED them! this will be added into the monthly rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ang1980"
},
"reviewBody": "Too much oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GiantsDodgers"
},
"reviewBody": "I've made this a few times, it is fantastic. Following the advice of others, I increased the lemon, doubled the garlic and put some of the greek seasoning in with the chicken while it marinated. Added a couple splashes of siracha (just a little) to the tkatziki sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "icklemewho"
},
"reviewBody": "This was awesome! I did everything pretty well exact, but I only had table salt, and bottled lemon juice, and didn't feel like removing cucumber seeds (ninja chopped it), and everything was perfect! I also prepped everything the night before, and cut up the chicken before marinating over night. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ONIOND"
},
"reviewBody": "Huge hit. I ate way too much! Thanks so much for sharing the recipe, I didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imabuffbaby"
},
"reviewBody": "Love this recipe! I think it's even better than our fave Greek place because I can customize it. I like to do a little less cucumber and a lot more dill in the sauce. I also spread the sauce over the pita first instead of using it as a topping. Top it with crunchy Romaine, some fresh tomatoes, and a bit of chopped red onion and you've got yourself a hella good dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Ladner"
},
"reviewBody": "Have always loved this when we went to a Greek restaurant and now I can make it myself, and I think it's even better. Love the sauce and the chicken is great. Made it exactly the way the recipe said. Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "Really good! I appreciate people like you, who take the time to put this recipe on allrecipes! I followed exactly &amp; loved this! So different than our usuall spaghetti, tacos, stir fry, talapia, fajitas week! Thank you again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron N Rhonda Lewis"
},
"reviewBody": "Best ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "working mom"
},
"reviewBody": "Better than a restaurant. A bit time consuming but worth it. Especially the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie Donahue"
},
"reviewBody": "OMG!! Super yummy!!! A good healthy version of a Gyro! Saved to my recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Stevenson"
},
"reviewBody": "One of my favorite recipes Ive found on the web. Ive worked at a Greek restaurant and never thought I could make a dinner as good if not better then those chefs. I drained my yogurt 24 hours and cucumbers about 3 hours, which is overlooked here. Make the sauce as thick as possible. As always i tripled the garlic. The longer the sauce sits in the fridge the better this gets, its quite amazing. Made this for a get together and was asked for the recipe by quite a few of the guests.\n\nI recommend making and using a garlic paste for the sauce. Simply blend peeled garlic and just enough olive oil to create a paste. Very potent and blends well in sauces. I make enough to keep around, stays good for about 4 weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Made this last night for my finicky family. They all LOVED it! The only down side was there were no leftovers to take to work, since they ate 3rd helpings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOMTOAUSTIN"
},
"reviewBody": "Was ok. Nothing great. Would try something different for the marinade, but not sure what."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2cook32"
},
"reviewBody": "Very good and very easy! My whole family loved this. My picky 16yo even ate the leftovers on here own. I love the twang from the olives and pepperoncinis. you don't even have to put in the pita bread.. When I ate the leftovers for lunch I just put everything on top of the chicken and ate... very low carbs that way. I will for sure make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Litvin"
},
"reviewBody": "Loved this recipe. Followed it to a T and it came it perfect. Super easy to make! My husband, my son and I really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazzinelly"
},
"reviewBody": "I added thin sliced onion, green pepper, and red pepper to chicken once it was cooked, then covered to soften - my family just prefers it this way. This recipe is AMAZING. Loved the Tzatziki sauce - was perfect. The seasoning/marinade for the chicken was incredible. The entire family loved this and it will be put into our rotation of meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allie :-)"
},
"reviewBody": "Oh my...most yummy stuff ever! Made it with Naan recipe from this site (per suggestion of another review) and Tzatziki sauce. The only reason I stopped eating was due to the fact that I had to leave some for my family. \nEven after reading the recipe and reviews, crazy me still used balsamic vinegar...sigh!...thankfully I caught my mistake and made another batch of chicken with the VINAIGRETTE dressing. The messed up vinegar chicken was barely touched, vinaigrette chicken was gone in a flash. It's just that good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marzipan"
},
"reviewBody": "I made this for a bbq get together because we wanted to try something different and healthier than burgers and sausages. It was a hit!! I marinated it over night and bbq'd it when the guests arrived. everyone asked for the recipe. I think this is my new go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin DeLooff"
},
"reviewBody": "The most delicious, real-tasting souvlaki marinade &amp; tzatziki sauce I've had outside of a Greek festival. Definitely worthy of company!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "needs more garlic, used 4 cloves"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilyadonovan"
},
"reviewBody": "Great sauce. Does take some prep time, so not a quick meal to throw together during the work week. My family loves this recipe and we make it several times throughout the year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeGe Ellenburg Beall"
},
"reviewBody": "I fixed this last night as written. My son, who is a chicken souvlaki connoisseur, couldn't lay off it! Dinner last night. And this morning I found a note from him saying he couldn't resist &amp; had had it for a midnight snack. While the list of ingredients for the sauce seems long, it takes no time to whip it up. This is most definitely going into our regular dinner rotation. With winter upon us, we're going to grill a big batch of the chicken &amp; have it ready to go in the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TCmofo"
},
"reviewBody": "This recipe is LEGIT! Turned out much better than expected...as good as any gyro I've had before.\r\n\r\nSo I didn't have any Balsamic Vinagrette so I used the following for my marinade: 1/4 cup olive oil, 2 tbspns lemon juice, 2 tbspns balsamic vinegar, 1 tspn garlic powder, 1 tspn salt, 1/2 tspn pepper, 1/2 tspn each of dried marjoram, thyme, rosemary and oregano. (per lizzy217's recipe from this site)\r\n\r\nFollowed the recipe for the tzatziki sauce as written; it's really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMMICHELLE"
},
"reviewBody": "Lovely! I used this recipe for the chicken marinade and the toppings, but I used my own Tzatziki sauce recipe (from a friend who's Greek). This sauce recipe looks quite similar, so I would definitely give it a whirl next time. I loved the idea to use chicken to enjoy gyros. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kritcooks"
},
"reviewBody": "Super easy, idiot proof recipe! I used a little more oregano than it called for and it was great! I also used about a pound of chicken tenders instead of chicken breasts and cooked them on my George Forman grill - came out PERFECT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brownie82"
},
"reviewBody": "Oh my goodness, this is delish!! I didn't have enough yogurt, so I made up the difference with the sour cream (3/4 cup yogurt and 1/2 cup sour cream) and it was just fine. I added a little extra dill and Greek seasoning to our taste. It was amazing. It tasted just like our local restaurant's souvlaki pita, if not better. This recipe will definitely be a keeper for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annekj"
},
"reviewBody": "We really enjoyed this recipe. I used fat free balsamic vinaigrette from Trader Joes in the marinade. I may make just the chicken sometime because I thought it was very flavorful on its own. I used low fat sour cream and fat free yogurt in the tzatziki sauce. I used fresh dill from my garden. I may have put too much in because it was very strong. The sauce still tasted very good, though. I don't like cucumbers, but for some reason I like tzatziki sauce. I didn't use the olives or pepperoncini, but I don't think they were missed. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Punnett Lucas"
},
"reviewBody": "yum! I used balsamic vinegar and oil as substitute. I peeled the cucumber, and stuck it in the blender, and just squeezed the water from them. (didn't salt them) and I didn't used the greek seasoning, as I didn't have any. I also precut the chicken, before marinating, and broiled it. Everything was great and everyone ate it! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SJcook"
},
"reviewBody": "This was really easy and super good. I mixed boneless thighs and breasts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JeBolton"
},
"reviewBody": "The marinade on the chicken is very good and this is now what I use when I make chicken gyros. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VALOVESOR"
},
"reviewBody": "I thought this was just okay. With all the seasoning, I thought it would be more flavorful. Family ate it up so I can't complain too much. Maybe a little more tweaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "Great recipe with lots of flavor! For the marinade I just used balsamic vinegar to reduce some calories. It would be good with a mix of balsamic and italian dressing if you don't have the vinaigrette. The tzatziki sauce was good but it needed a bit more zip to it and I doubled the garlic. Maybe next time I will replace the rice vinegar with apple cider or more balsamic. We layered ours with all the above except the olives. Great tasting! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j doschadis"
},
"reviewBody": "I just used the marinaded chicken - delicious! Put it with basmati rice, cooked onions and peppers. Also delicious dipped in tzatziki sauce. Would be great in pita bread but seems like too many carbs with the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheltigurl"
},
"reviewBody": "Everything turned out great! Was a hit with my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TastesLikeChicken"
},
"reviewBody": "Delicious. Everyone loved it. Used plain Greek yogurt because I happened to have it on hand. I let my chicken marinate for about 4 hours and it was flavorful and moist. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa Schleicher "
},
"reviewBody": "Oh my god! To die for. Made it the recipe way minus the mayo. Will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Huffer"
},
"reviewBody": "We loved this recipe! So simple and delicious! We have it at least once a month. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Yummy Yummy!"
},
"reviewBody": "chicken was too intense, and the tzatziki was missing that super garlicky kick that Im use to. Probably won't make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Redd"
},
"reviewBody": "Loved it, added greek seasoning to the marinade"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tamara43"
},
"reviewBody": "I thought this recipe was delicious. the vinagrette marinade was just perfect. I made this with chopped lettuce, red opinion, feta cheese, chopped tomatoes, I cheated and bought cucumber dill salad dressing for sauce. Was all very delicious, tasted as good as any restaurant at a fraction of the price. Wasn't difficult to make at all, either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg Natural"
},
"reviewBody": "So good! This was a huge hit at our house. I couldn't find Greek Seasoning at the store so I used equal parts basil, oregano and thyme (should have used marjoram too but didn't have any). The tzatziki sauce definitely makes it. Like another reviewer said, definitely buy good pitas. I warm them up in the microwave wrapped in damp paper towels to keep the pliable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Elder Wilson"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BUNKYLION"
},
"reviewBody": "Very, very good. Only thing I did different and it was only because I did not get the time to marinate the chicken. So, seasoned the chicken breasts with a garlic seasoning, S&amp;P, and grilled and then sliced and tossed with the marinade. A great solution should you find that you were not able to marinate the chicken ahead. Came out great this way too. Thanks for the wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yyyu"
},
"reviewBody": "Delicious!!! My husband doesn't like to eat chicken, but for my surprise he asked me this one!! Because I didin't have balsamic vinaigrette that day, I made it and is wonderful!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Dude"
},
"reviewBody": "Cant get enough of that sauce. Perfect as is. Triple the yogurt dill sauce. Trust me it doesnt get old dipping veggies or pitas in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamakatie1346"
},
"reviewBody": "Very much enjoyed this easy recipe. Next time I would marinate the chicken longer for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maurice GrillMaster Burt"
},
"reviewBody": "Ripped In Half! FAMILY went NUTS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeenCookingLovey"
},
"reviewBody": "Made this for the family tonigth, and they loved it! They said, it was better than the local gyro joint, (Which is mighty good!) The only think I did to change the recipe was adding a 1/4c of sugar to the tatziki. We like our a little sweet, and tangy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danni Skaricki"
},
"reviewBody": "I'm not sure how to rate this dish and I'll tell you why. I printed the recipe to make it and it printed weird so I marinated the chicken in the marinade with the garlic, dill, and Greek seasoning added. I have to say it was fantastic and will make it again with my goof up. Everyone loved it. I served it with Yia Yia's Tzatziki from this site because I can't cheat on that recipe.\nA good long marinade is the key- I marinated for 8 hours.\nThanks for sharing- great flavor in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OhnoDadsCooking"
},
"reviewBody": "Excellent. Everything comes across in harmony without needing to mess with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debutante"
},
"reviewBody": "This was superb! I didn't use the pita step, but followed the grilled chicken and Tzatziki steps to the letter. I could not have been more pleased with the way it turned out -- tender, moist, and delicious. The Tzatziki can be made well ahead of time and the chicken marinated overnight, which leaves only the grilling for the last minute.\nThis is going to become one of my \"go to\" recipes for guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Scher"
},
"reviewBody": "Perfect recipe, I wouldn't change a thing. At the moment, it's my favorite recipe on this site. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chris e."
},
"reviewBody": "Love this tzadziki (sp?). Being a NYer living in the South, it's kinda hard to find Greek food but a few weeks ago I had the most amazing chicken gyro and was determined to learn to recreate it at home. This is it! The chicken marinade is fine, but the cucumber sauce is the real winner, I used red wine vinegar and dried dill, still came out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana"
},
"reviewBody": "This is really good. The marinade for the chicken is tasty, though could be a bit saltier (but keep in mind that the tzatziki and the feta are both salty too, so use a sparing hand). The tzatziki sauce recipe is nuanced and delicious - since I didn't have Greek seasoning on hand, I found a great recipe (using LOTS of different spices) at http://www.food.com/recipe/greek-seasoning-mix-61579. The sauce portion as written is quite large, and could probably feed 6-8 people, so the two of us had a lot of leftovers at the end. We ended up doing a variation using ground beef seasoned with oregano, garlic powder, salt, and pepper instead of chicken - WOW! So good with a side of diced and salted cucumbers and tomatoes and the leftover yogurt sauce, served with white rice or in pita. Delicious recipe... plan to do tons of variations on this in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "e3gerlin"
},
"reviewBody": "This was awesome! The only thing I did different was use apple cider vinegar in place of the rice vinegar and dried dill weed instead of fresh because that is what I had on hand. Phenomenal recipe - I will make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexa"
},
"reviewBody": "Super super good!!!! A little too much oregano in the marinade. I made a couple small changes. I broiled the chicken as some other reviewers did. I didnt have any greek seasoning for the tzatziki but there is a recipe for it on this site and I used everything in that recipe except the mint, thyme and majoram. It came out delicious!! I have been craving gyros from a little place down in Brandon, FL called Romano's. This is not Romano's gyros, but it definitely satisfied my craving."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/72114/chicken-souvlaki-gyro-style/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
"name": "Greek"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/72114/chicken-souvlaki-gyro-style/",
"name": "Chicken Souvlaki Gyro Style"
}
}
]
}
}
, "about": [
]
}
]