				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Long Rice Soup"
,"datePublished": "2018-03-21T12:55:00.000-04:00"
,"dateModified": "2018-03-21T12:55:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Mama Smith"
,"url": "https://www.allrecipes.com/cook/mamasmith"
}
]
,"description": "This Hawaiian-style chicken soup has been a family favorite for many generations. The leftovers are great, and it freezes well. Even my Texas man loves it!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wC5DTRx8Q-WhVd86uS-c7dQd0Is=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/700610-17e9c9bcf5bf4ce9bfdd35aba07d50d3.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Long Rice Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "70"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "396 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "102 mg"
,"fiberContent": "1 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1118 mg"
,"sugarContent": "3 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3 pounds chicken leg quarters",
"3 (32 ounce) cartons low-sodium chicken broth",
"1 tablespoon Hawaiian sea salt",
"1 (1/2 inch) piece fresh ginger root, sliced",
"1 large Maui sweet onion, cubed",
"1 (8 ounce) package uncooked bean threads (cellophane noodles)",
"1 bunch green onions, thinly sliced",
"1 small head bok choy, chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place chicken, chicken broth, salt, and ginger into a large pot. Bring to a boil over high heat, then reduce heat to medium-low and simmer until the chicken is tender and no longer pink, about 35 minutes. Remove chicken, and strain broth into a new pot. Discard the solids."
} ,{
"@type": "HowToStep"
,"text": "Fill a bowl with hot tap water. Add the long rice noodles, and let sit for 30 minutes to soften."
} ,{
"@type": "HowToStep"
,"text": "Stir onion into the broth, and bring to a boil, then reduce heat to medium-low. Meanwhile, remove the skin and bones from the chicken and discard. Roughly chop the meat and set aside. Add the noodles, chicken meat, green onion and bok choy; simmer until noodles are tender."
} ,{
"@type": "HowToStep"
,"text": "After the noodles have sat for 30 minutes, stir in the chicken meat, green onion, and bok choy. Reheat and serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roy Okimoto"
},
"reviewBody": "Used store bought baked chicken. My roommate said too salty and the noodles where short and filled up the pot. I like a little soup in my noodles and i did use 8 oz bean thread package but as i followed directions by serving time the noodles took over the soup. I like chicken no noodle soup as I call it to have some noodles with my soup. Maybe ill try a different brand noodle or less noodles. Good enough for me to make again and use some of the hints from others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SaltyBird "
},
"reviewBody": "So easy and tasty. This has become one of my favorite things to make when I’m only cooking for me. It’s quick and I almost always have all the ingredients in the house so it’s perfect for lazy days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "Awesomely Delicious!!!\nI accidentally purchased mung bean noodles. still yummy. I have since bought the correct rice noodles. will be making another pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big Poppa"
},
"reviewBody": "my kids love this meal..but I did make some slight changes.\n2 table spoons of low sodium soy sauce.3 cloves of garlic minced and a little extra ginger requested by the family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adelaide"
},
"reviewBody": "This is a family favorite! I make it all the time for my family, and we never have enough for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pono 808"
},
"reviewBody": "Season and roast the chicken first for more flavor - I use Hawaiian salt, fresh ground pepper and chinese five spice to taste. If using the chicken with skin on roast till crispy otherwise just till browned on the surface."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jason Kwiat"
},
"reviewBody": "Confusing directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbyt"
},
"reviewBody": "I have made this several times. It was a little bland at first, but I have nailed it, now. I sauteed bacon, garlic and onion as my 1st step. Then added chicken bouillon with the chicken broth. This has DEFINITELY added some flavor. I even have my mother's approval, and shes my biggest critic when it comes to food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brindisi"
},
"reviewBody": "This so called Hawaiian long rice chicken soup seems to be the same as the filipino dish of chicken sauteed with ginger garlic n onion then after being halfway cook add water or chicken broth then when boiling adding rice glass noodles or mung bean thread noodles till cook n adding scallions or bok choy slices lol. Maybe brought Hawaii by filipino immigrants?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "P'lar Kinzel"
},
"reviewBody": "Made with already cooked chicken. Added a bit of soy sauce, &amp; no salt, used spinach, instead of bok chow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "My grandfather used to make this for us when we were little. The aroma brought back fond memories. I didn't add enough ginger and will make note to follow the recipe more closely next time. I made the bok choy on the side as I knew my husband would not like it. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret L Barckhoff"
},
"reviewBody": "Great results, although I didn't measure precisely.\n\nWhile the broth was initially developing I did throw in some sage, bay leaves, tarragon, and lemongrass, which got strained out with the rest of the solids.\nAlso added carrots and celery with the onion.\n\nVery fortifying, especially when you're not feeling well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M'Lissa"
},
"reviewBody": "I make this several times a year, especially in the winter. It's a hit! I use a rotisserie chicken from Costco, cut most of the meat off, then boil the carcas so the rest of the meat falls off. It is so yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Tidler"
},
"reviewBody": "Easy and turned out great. I used boneless skinless chicken breasts, added a little soy sauce and some other spices to give it a little more kick. This will make the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin K"
},
"reviewBody": "Delicious and easy to make! I omitted the Maui onion and added about 5 cloves of garlic with the ginger. I usually only eat white chicken meat, but for this recipe the dark meat with skin and bones really added a lot of rich flavor. It was more like a brothy soup than the noodle side dish I'm used to but I love it and will definitely make it many, many more times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Mulligan"
},
"reviewBody": "So dang good, I can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melo684"
},
"reviewBody": "This recipe turned out REALLY GOOD! The only modification I made was adding 2 chicken bouillon cubes because I only had 1 carton of the low-sodium chicken broth (32oz)!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah J Park"
},
"reviewBody": "So delish! Love the bok choi twist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taylor Mystic Pea Lockard"
},
"reviewBody": "I love this kind of food. It was pretty easy to make and had barely any prep work to do other than to crush some garlic and shred the chicken. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherryl Marie"
},
"reviewBody": "So easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "my recipes"
},
"reviewBody": "Have made this several times this is so Ono! The only thing I do is I add more ginger then called for, I add it to the cooking of the chicken and then I add more when I cook everything else together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "A definte keeper for the winter. I only had 8t bouillion powder so I was only able to make 64iz if chicken brith. It was a bit salty but I'm sure the low sodium chicken broth would have been better. Definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flying hawaiian chef"
},
"reviewBody": "Good base but VERY bland- big SNORE as is. I suggest adding something that will actually make it tasty: MORE salt! Sad but true, low sodium is groovy but if you want this recipe to be flavorful here is my suggestion: Regular chicken broth, add some \"Aloha Shoyu\" brand \"Barbecue\" sauce (its just sweet and ginger-y soy sauce, not like regular BBQ sauce- once you use this you will never go back!) Then, Caramelize LOTS of onions, add to the broth, and finally (the \"piece de resistance\", add a generous portion of the Organic Chicken Base made by \"Better Than Bouillon\", sold at Costco and other good supermarkets- its worth finding and keeping many jars of it in your pantry.I never go home without it. I was a Four Seasons chef for several years- chef secret: salt, sugar, and butter, GO THERE (once in a while, life is short)! Garnish with lots of fresh chopped green onion (\"Scallions\" for all you mainlanders...:))) ENJOY, \"Stay ONO, wen Broke Da mouth\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAKEA"
},
"reviewBody": "This is the real deal, perfect for rainy hilo days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "takara59"
},
"reviewBody": "I made this for an Hawiian themed party for senior citizens. Everyone loved it an there was none left (I doubled the recipee). I made a couple of changes. I used half the salt. I don't have access to Maui onions so I used vidalla. For the chicken, I used about 4 lbs of boneless skinless chicken thigh. This was a double batch and not having to mess with skin an bones was great. I have sinced made it for my family and still use the boneless skinless thighs. It also cuts down on the fat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carla Cleary"
},
"reviewBody": "This IS very comforting, nutritious and low in calories...not to mention economical! We had it for Sunday lunch. I added a couple small jalapenos, sliced, from the garden. Have to admit I used a regular sweet onion and regular salt and it was still awesome. Thank you, Mama Smith!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef GourMAY"
},
"reviewBody": "This is a nice change from traditional chicken noodle soup I make. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn Durfee-Najera"
},
"reviewBody": "my mom made this when we were kids and i just got back from Maui and all my ohana there made this for us....mmm so ono. a regular dish at every table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "OkinawanPrincess"
},
"reviewBody": "Growing up as a child chicken long rice was and still is a favorite of mine. Now I make it often as it is simple and so delicious. This is a good chicken long rice recipe. Nowadays, I just pick up a rotisserie chicken (i.e costco) and shred the meat (thigh, drumstick, some breast) and keep the juices from the rotisserie. I usually add a pinch of hawaiian rock salt to the chicken meat (shredded) with all of its juice and 4 cans of chicken broth in a large pot. I turn the heat up on high to boil. I add some fresh ground black pepper. I use (thumb size) fresh grated ginger, 2 or 3 garlic cloves, no maui onions, and a sprinkle of green onions for garnish. I omitted the baby bok choy. One package of saifun noodles (bean thread) noodles is a must. There are about 4 bundles inside each package, enough for a large pot. Don't buy the vermicelli noodles, it is too thin. Once the broth is boiling, I add the noodles to the pot, I cover the pot and I let it get soft and expand, about 25 to 30 minutes give or take. Once the noodles are tender I use a kitchen scissors to cut up the noodles. I turn off the stove and let the noodles sit. Since the noodles will usually soak up a lot of the chicken broth I add a another can of low sodium chicken broth to the soup. I then taste and adjust seasonings (salt and black pepper). I normally eat this alone or with POI and/or rice. A very comforting and flavorful chicken soup - especially when you are feeling under the weather on those cold days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "silke"
},
"reviewBody": "This soup is \"souper\"! Made it several times for my family and they love it! Freezes well and is a great comfort food on cold winter days. For convenience I use boneless, skinless thighs. Made a large portion and took to work, kept hot in the crockpot, and all our operators and workers coming out of the cold could smell the soup right away and followed their nose to the kitchen. They all loved it and I had several marriage proposals (LOL)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JAG"
},
"reviewBody": "This was not as flavorful as I had hoped. Not sure if I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsDevlin"
},
"reviewBody": "My family absolutely loved it and it's hard to find something EVERYONE enjoys!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alissa1822"
},
"reviewBody": "My best friend has been using this recipe for years, I LOVE it! Her mom used to make it for us when we were kids, and now I come running for this stuff. Absolutely my comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Soup Loving Nicole"
},
"reviewBody": "I used mung bean noodles because that is all I could find and it paired perfectly with my Kalua Pig. I drizzled a couple of drops of sesame oil in my leftover the next day and that was good as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jctnact"
},
"reviewBody": "Delicious!!! I only had chicken thighs on hand and I halved the recipe and it still made a lot of soup. The kids(1yo and 4yo) LOVED it. They both had 3rds and the 4yo kept saying how delicious her soup was. Thanks for this recipe the whole family can enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iqueral"
},
"reviewBody": "This is a childhood favorite of mine with one exception, I've always used bean threads instead of the rice noodles. I'll have to give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia C."
},
"reviewBody": "I live on the Big Island of Hawaii and have tasted lots of chicken long rice. This recipe is superb and ranks among the best I have tasted. The beauty of Hawaiian food is that it is not exotic - no peanut sauce, lemon grass, or other \"Thai\" like spices or flavorings -- Hawaiian food is simply and deliciously seasoned with Hawaiian sea salt, some ginger, but very few other types of spices. Plain and simple but ono. Here we eat chicken long rice more like a side dish, and therefore I lessened the amount of broth. I used pink Hawaiian sea salt. We also \"snip\" the long rice into more bite size pieces by taking kitchen sheers and snipping a handful of the soaked long rice at a time, until the entire batch is snipped into shorter, more manageable and bite size pieces. I used chicken thighs, canned broth, and a bit of powdered chicken broth and water because I didn't have enough of the canned broth on hand. I would also use this broth to freeze for Chinese recipes. I liked the addition of the mild Maui onions. It was pleasant but not overpowering like regular onions would be. This will be my new long rice recipe from now on. Today I am using this recipe to feed about 50 local kids in a youth gathering. I am also serving Kalua pork. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ViciousV"
},
"reviewBody": "Thank you so much for this recipe! We just moved to the islands from the Mainland and have had to change our menu a bit. This is a perfect addition to our meal menu. I doubled the recipe and used chicken bouillon powder instead of stock. To make things easier I added frozen diced onions, boiled it a bit, then added the long rice noodles. At the very end, just before serving, I added about two cups of frozen spinach and two cups of diced rotisserie chicken that I bought at Costco. Believe it or not, we get cold here in Hawaii, and it was perfect for this chilly night. I will definitely be making this many more times! Mahalo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kirklandcook"
},
"reviewBody": "Delicious! Would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnaB"
},
"reviewBody": "Living in Hawaii all my life I would NEVER add lemon grass as suggested and I like the addition of bok choy. Getting kids to eat greens is hard, but mine love bok choy this way. Less is better when making comfort food and this is truely comfort food!! Love this recipe, don't change a thing!!! Mahalo nui loa!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Aubin Ben"
},
"reviewBody": "thanks so much for the reminder. Been a long time since I made this dish and I really like this version, quick, easy and tastes great. Makes me home sick for Hawaii, as most Hawaiian food does."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Taylor"
},
"reviewBody": "I made this soup today and as soon as my husband came home he was scoping out the kitchen saying it smelled amazing. Well it tastes even better. Thanks for the recipe, will definitely be making this again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "VERY GOOD!!!! Never had bok choy in a soup and it works! Ginger works deliciously in this! I actually had the Hawaiian sea salt and it goes great in this! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wildmorel"
},
"reviewBody": "Growing up in Hawaii, chicken long rice was a childhood favorite. This recipe is simple to make and delicious - the ginger perfectly flavors the chicken broth, and the bok choy offers some nice and slightly chewy contrast to the dish. The only modification I made was cutting back on the chicken stock by 1/3 - I eat it more as a side dish served on a plate than as a soup. This is the perfect accompaniment to a Hawaiian dinner of kalua pig and macaroni-potato salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Icook4dave"
},
"reviewBody": "ONO!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa4Dennis"
},
"reviewBody": "This was super easy and very delicious, one of the best I've tried. I used Chicken Breast instead of thighs because I hate dark meat, but it was still wonderful. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ms. claire"
},
"reviewBody": "this is the first time my husband had it.. and he loved it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MauiGirl"
},
"reviewBody": "I've looked through numerous Chicken Long Rice recipes and this has to be one of the easiest and most flavorful recipes I've found. I use chicken breasts because my husband dislikes \"brown meat\" but it is just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Soifua"
},
"reviewBody": "I never thought of Chicken Long Rice as comfort food, but I guess if you grow up on the stuff that's what it becomes. We do make it with some different stuff though, I've never had chicken long rice with bok choy, so I left it out; I'm not a huge fan of ginger, so I decreased the amount and added garlic. All my life we've used \"long rice\" for the noodles, it's mung bean thread (the package I bought said \"saifun\" don't know if that's what it's labeled as), found in the asian section of the grocery store, never heard of using rice noodles or rice vermicelli, but I'm sure it'd work. Very simple recipe, if you can find the right noodles it'll be perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dabergmans"
},
"reviewBody": "Thanks for this idea! We recently went vegetarian and I was looking for something to make with bok choy and rice vermicelli. I ended up simmering the bok choy in some water with fresh ginger and garlic in it. I added three diced green onions, some chopped cilantro, and then mixed in a peanut sauce (peanut butter, soy sauce, chili garlic sauce, and hoisin). I threw in some textured vegetable protein (TVP) to thicken it up and served it over warmed (cooked) rice vermicelli. It was a hit. I know this is nothing like your recipe really, but thought I'd add the comment so someone else might get creative too! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vaz007"
},
"reviewBody": "This was really delicious. I paired it with the kalua pig it turned out very goooood."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/112818/chicken-long-rice-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/181/soups-stews-and-chili/soup/noodle-soup/",
"name": "Noodle Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/112818/chicken-long-rice-soup/",
"name": "Chicken Long Rice Soup"
}
}
]
}
}
, "about": [
]
}
]