				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Piccata III"
,"datePublished": "1999-07-01T12:22:57.000-04:00"
,"dateModified": "2022-07-14T17:55:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sharon"
,"url": "https://www.allrecipes.com/cook/24328160"
}
]
,"description": "This spin on the original features the addition of mushrooms and artichokes in the lemony sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Ai3xFIjtU8Ix5L2R3joHnq2ibqY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/28962-5219370d8a91427da4ac0b5d292e334d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Piccata III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "112"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "444 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "69 mg"
,"fiberContent": "5 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "786 mg"
,"sugarContent": "1 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"0.5 teaspoon paprika",
"1 pinch salt and pepper to taste",
"1 pound skinless, boneless chicken breast halves - cut into thin strips",
"0.25 cup vegetable oil",
"4 ounces fresh mushrooms, sliced",
"0.25 cup lemon juice",
"0.75 cup chicken stock",
"0.5 teaspoon garlic powder",
"1 (14 ounce) can artichoke hearts, drained and quartered" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a shallow bowl, mix together flour, paprika, and salt and pepper. Dredge chicken pieces in the seasoned flour."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large skillet over medium heat, and saute chicken until light golden brown (about 45 seconds each side). Remove chicken from skillet, and set aside."
} ,{
"@type": "HowToStep"
,"text": "To skillet, add mushrooms, lemon juice, and chicken stock. Simmer until a smooth, light sauce develops. Season with garlic powder. Return chicken to the skillet, and simmer until chicken is no longer pink and juices run clear. Stir in artichoke hearts, and remove from heat."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Dalton 'Lizzie'"
},
"reviewBody": "Good Piccata Recipe! I added white wine to the recipe and let it cook down a little longer. I only added half the artichoke hearts so they didn't overpower the dish! I didn't measure the lemon but I know I used more than called for because I like a lot of lemon. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Spyce"
},
"reviewBody": "This was okay. One cup of flour is too much. A half cup or less would be plenty. Next time, I might just lightly dust the chicken with flour instead of dredging in flour because mine soaked up all the sauce. The artichokes are a nice twist, but don’t add that much tang to the recipe like capers, so I added some of those in. The garlic powder didn’t do it for me. I would suggest using a grated clove of fresh garlic, two if you like garlic. A 1/4 cup of lemon juice was just right, I got that much from half of a large lemon. I used a mix of white wine and chicken broth for the liquid, 1/2 cup of wine, and 1/4 cup of chicken broth. I used chicken breast tenders that I had in the freezer. I gently flattened them a little with the edge of a sauce. I garnished with fresh parsley and a few thin lemon slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "willbullock"
},
"reviewBody": "Delicious! We don’t like capers so left them out. Pounded the chicken breasts to thin scallopini style. Added some heavy cream to the sauce just before serving to thicken it a bit. This is a keeper! Bravo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Captain Slater"
},
"reviewBody": "Good stuff, easy to make, I used already mixed garlic, I used 1/4 cup of white wine and 1/2 cup of Chicken Stock.. my twist I added 1 lb of Lightly fried shrimp that I friend in a different skillet in light Louisiana batter, I threw those in the mix after the artichoke hearts and let it rest for a bit. It was pretty amazing. I’m a picatta fanatic I also used Superfood pasta. I like that this dish doesn’t have butter. I would like to use something besides vegetable oil which is horrible for the heart. Anyway loved the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Powers Corbett"
},
"reviewBody": "Tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gayle Jacobsen"
},
"reviewBody": "I sliced a shallot and sauted it with the mushrooms and used white wine instead of broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "britt m"
},
"reviewBody": "I liked this recipe. I cooked the mushrooms separately in butter and didn't add the chicken back to the sauce. I also left out the garlic because I forgot it. Lol But overall it was very good anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grayjabe"
},
"reviewBody": "No, but chic breast’s nowadays require a car to run over them to get thin enough. Next I will many chicken fingers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cate"
},
"reviewBody": "Made this from a fortuitous collection of leftovers. Fairly easy, very tasty. The chicken was missing a little something, can't quite figure out what though. Try a blend of different spices in the dry rub and it should come out a little more flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Una D"
},
"reviewBody": "Just like Eastside use to make only better. Seconds!\nI used capers instead of artichokes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Beware the substitutions! The first time I had it, most of the reviews said to cut the lemon juice, so I used about half of what it called for and a full cup of chicken stock. It was perfect. The second time I subbed wine for the chicken stock, as the recipe says you can do, and used the full amount of lemon juice. With the lemon and the wine and the artichokes, it was WAY too sour! \n\nBe sure to stick with the chicken stock and cut down on the lemon by a hair, and you will love this dish! I served over pearled cous cous and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GaryY"
},
"reviewBody": "Just OK...not spectacular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kten"
},
"reviewBody": "Excellent simple recipe with great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I made this recipe with a few changes to utilize the ingredients I already had in my kitchen: Olive oil, instead of vegetable; Dipped the chicken in an egg wash before flouring; Minced garlic, instead of garlic powder; Used a whole container of mushrooms; added 1 cup chopped sweet onion; 5 chopped sun-dried tomatoes; and 4 tablespoons of capers. Additionally, I saved some of the leftover flour mixture for after I cooked down the onions and mushrooms in order to thicken the sauce (I made a rue with the flour and butter). This was one of the best meals I have ever made, and there were no leftovers. But next time, I will just brown the chicken instead of flouring and pan frying to save on calories. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adam"
},
"reviewBody": "THIS RECIPE IS EASY TO FOLLOW,FAST AND TASTE GREAT !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "morgansmiles"
},
"reviewBody": "This was pretty good. I didn't cut the chicken into strips, just left the breasts whole. I added some cornstarch to the sauce to thicken it up. Made with spaghetti. It was good, but the artichokes were a little too strong for my tastes. Good, but don't know if I'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLW"
},
"reviewBody": "I made this, as written with only one exception: I sauted minced garlic with the mushrooms, instead of using garlic powder. This is a very good recipe and I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Johnson Nucci"
},
"reviewBody": "Awesome recipe. I added sun dried tomato strips and also capers. The tomatoes &amp; capers just add more color to this great dish. Thanks for putting a new twist on an old favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Ogden"
},
"reviewBody": "Excellent recipe. I left off the artichokes since I don't care for them and added about 2 Tbsp of capers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Creative Caterer"
},
"reviewBody": "This recipe was fabulous! Will definitely make again - so easy and delicious. I used 1/2 white wine instead of 1/2 of the chicken broth. Added capers and it was excellent. I served it over some linguine. The sauce made enough to flavor the pasta quite well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TOOTIEFRUTIE26"
},
"reviewBody": "Not bad, too much lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Taylor"
},
"reviewBody": "I've made this recipe at least 5 times since I discovered it 2 months ago. I cooked the chicken in olive oil (this addes flavor to the sauce). I also used fresh garlic (2 or 3 cloves) and the juice from 1 fresh lemon plus around 1/8 cup of white wine. I also added capers (generous sprinkling). I always serve this over angel hair pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carman Milemon"
},
"reviewBody": "This is the absolute best chicken piccata I have ever made. I didn't follow the recipe exactly. I sauted the Chicken in olive oil and butter.. but I used an egg/flour/egg wash first before placing in the pan. After browning, remove the chicken to a paper plate with a paper towel to drain the excess grease. Into scrapings add 1 cup white wine (chicken broth if you don't drink)be careful as it is very very hot..whisk briskly over med to high heat.. to that add the juice of one lemon, mushrooms, capers, 1 cup chicken broth and 1 table spoon of flour. Continue to whisk briskly to break up flour. Once you get your rue to a medium consistency, place chicken in pan.. turn over to coat both sides. Chop 8 artichoke hearts very well and sprinkle on top of Chicken. Take one lemon cust in half and place once on one side and the other on the other side. Cover and simmer on very low heat for 20 minutes. Place chicen on plate and spoon sauce mixture over chicken. Best ever!! Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Genesis54"
},
"reviewBody": "Great recipe, however I made a few changes to suit my personal taste. Like some others, I left the chicken pieces whole, pounding a bit. I dredged in flour but did not use nearly a cup. I browned the chicken in butter rather than vegetable oil and omitted the paprika. I added 3 cloves of garlic instead of powder and used 1/2 cup stock and 1/2 cup wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tegan Lee"
},
"reviewBody": "This recipe was easy to make and the whole family enjoyed it! I didn't change a thing, and it was great! Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ETAINL"
},
"reviewBody": "I love this recipe! I find myself craving it when I haven't made it in a while :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tanya Cass"
},
"reviewBody": "I would probably not fix this dish again. I followed the recipe closely and we all found it a little bland. I've never had another piccata recipe so I don't know how this compares. I served it with rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly "
},
"reviewBody": "The chicken itself was good but the sauce was WAY too lemony. It came out too bitter. Better off going with one of the other chicken piccata recipes on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vstreb"
},
"reviewBody": "This recipe is quick and easy. I have made it twice now and it is one of the very few recipes all four of us will eat. Of course, my son picks out the mushrooms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mj"
},
"reviewBody": "Very good, very easy, presents on a plate beautifully. This is a good company dish since it looks like it takes forever to prepare. I added lots more mushrooms, a whole can of chicken broth, and then added some lemon zest along with the juice for that extra zip. Serve it over a whole wheat spaghetti and there you have a delecious meal. I've made this dish lots of times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOYOUS_E"
},
"reviewBody": "Very good and very easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nursemom"
},
"reviewBody": "This definitely a company dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane G"
},
"reviewBody": "Very good. Used wine and broth to make more gravy and cut lemon juice in half because we don't like strong lemon flavor. Served over spaghetti. Everyone enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNIFERNOLAN"
},
"reviewBody": "Yum-o (as Rachael would say). I substituted 2 oz of capers for the mushrooms and added 1/2 cup white wine. I served it over really good pasta. Kids didn't like it. Oh well more for mommy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LITTLEBIGJOHN"
},
"reviewBody": "Simple but delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HISTORYGIRL04"
},
"reviewBody": "The first time I had chicken piccata in a restaurant, I wanted to try it at home. This was exactly what I was looking for! Or at least sort of because I made a few changes. I doubled the recipe, used a little sprinkling of the leftover flour mixture and a dash of heavy cream to thicken up the sauce as it heated. I left out the mushrooms becasue I don't like them and substituted artichoke hearts for capers. I served this all over a bed of fettucine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Overall taste was good. Made a few minor changes. Did not cut chicken into strips, just pounded chicken breast. Added 3 cloves garlic when cooking mushrooms, used 1/2 cup broth and 1/4 cup white wine. Also added a little butter and flour to the sauce to thicken up a bit. Added capers of course at end becaue it wouldn't be piccata without capers. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "raesquared"
},
"reviewBody": "Not bad. It was very lemon-y."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SULIN1"
},
"reviewBody": "I've used this recipe several times and always comes out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kelcampbell"
},
"reviewBody": "DH and I were not fans of this dish at all. Instead of cutting the chicken into strips, we pounded the breast thin and cooked them that way. We also used 2/3 chicken broth 1/3 white wine. We found this dish to be very tangy, and the flavours did not seem to meld well. We will not try this dish again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KOALAGIRL"
},
"reviewBody": "An average chicken piccata recipe. You do not need all the flour that the recipe calls for - - just enough to coat the chicken. And I did not cut my chicken into strips; flattened the chicken breast to 1/4 inch, pan seared, and kept in a warm oven while making the sauce. The addition of the mushrooms and artichoke hearts was a nice treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "njmom"
},
"reviewBody": "I made a few slight changes. I used an egg/lemon juice egg wash, then dredged in seasoned flour. Pan fried with olive oil and butter. I held the chicken out, and meanwhile added mushrooms, chicken broth, lemon juice, crushed fresh garlic, capers and artichokes to pan. Cooked down into a sauce, thickened slightly with cornstarch and served over the chicken. Too lemony for my 11 yr old, but my DH and I liked it. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOONEYLINDI"
},
"reviewBody": "This was sooo...good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "This was okay - I liked the chicken piccata I recipe better, as the breading is so much tastier. Skipped the artichokes, and added a little red pepper flake to spice it up just a little. The chicken is nice and moist, and makes a nice sauce to go with pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOSIE"
},
"reviewBody": "This was fantastic Sharon. My husband loves the sour/tangy dishes so this was right up his alley. I skipped the mushrooms since I was out and the artichokes were a wonderful addition. I wanted a little more substance to the sauce so I sauteed a shallot and some minced garlic before adding the lemon juice and broth. I used thinly sliced chicken cutlets and they cooked up perfectly. I served this over angel hair pasta and would suggest doubling the sauce so there will be enough to go over the pasta. Thanks for sharing this one...it will definitely be made again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RACHAEL"
},
"reviewBody": "I love chicken piccata at restaurants, but I have never made it at home. I sauteed the mushrooms in the pan after the chicken, with the drippings and some butter added and put the garlic in with that. Skipped the artichokes and added a little bit of capers to this. I was surprised that people had stated this was too lemony for them, I didnt find the lemon flavor strong at all. I served it on top of angel hair pasta, and while my husband I liked it, it is not what I am looking for and will continue to search for a lemon piccata recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "figment_jii"
},
"reviewBody": "Pretty easy to make and tasted very good. I ended up using half chicken breasts pounded to about 1/4 inch thick rather than strips (thought it looked prettier). Reduced the lemon juice requirement to a couple of teaspoons (based on other recommendations) and it tasted good. Also, added capers at the end (with the artichokes) because I always think that capers are part of picatta. Oh, also sauteed the mushrooms in butter before adding them to the chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah B."
},
"reviewBody": "Being a poor college student, what I liked most about this recipe was it's cost/benefit ratio. The ingredients were cheap, time and effort were minimal, and it tasted fabulous. The only thing I'd change is the amount of lemon juice... maybe use half of what the recipe calls for. Also, I substituted white wine for the chicken broth and that worked well.\r\n\r\nI'd recommend this recipe to anyone who is on a tight budget and low on time..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheri"
},
"reviewBody": "Never had chicken piccata before so I can't compare. The kids and I did like this dish. Very lemony. My hubby got home late and had his dish reheated and he wasn't too thrilled with the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DRJILL2"
},
"reviewBody": "Very bland and more work than it's worth. As other reviewers have noted, you definitely don't need that much flour. Didn't find it very lemony at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mom22GreatKids"
},
"reviewBody": "Not the best chicken piccata I've ever had. But it was ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BABSKITCHEN"
},
"reviewBody": "This recipe could have been a lot better had I listened to previous reviewers and cut back on the amount of lemon juice. It was really overwhelming. Two to three tablespoons would be plenty. As previous reviewers have noted, 1/2 cup of flour is plenty. The artichokes are a nice addition but if you don't like artichokes, then forget about this dish. I think I will stick with the recipe I've been using for nearly 20 years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary K."
},
"reviewBody": "This recipe was okay--I felt like it was a lot of work but it tasted kind of average. I'll try it again, just in case I did something wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So easy to do and tastes like you cooked for hours. Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VAL428"
},
"reviewBody": "Turned out great! Next time though, will use a little less flour and lemon juice. I was quite surprised with the result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "elaffint"
},
"reviewBody": "I thought this was kind of blah. The chicken came out mushy and the flavor was bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great basic recipe for chicken picatta. You really don't need more than 1/4 cup of flour, though. Otherwise, the sauce may become thick. I also prefer to use less lemon juice. 1/4 cup makes for a strong lemon flavor. A white wine is a good substitute for the broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THIS RECIPE WAS O.K. BUT I THINK IF I MAKE IT AGAIN I'LL TRY IT WITH BROCOLLI.I WASN'T AS IMPRESSED AS I THOUGHT I'D BE. ALSO THE RECIPE CALLS FOR 1 CUP FLOUR....THAT'S WAY TOO MUCH.1/2 C.WILL DO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely fantastic. I just made it yesterday and can't wait until I make it again. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IANKRIS"
},
"reviewBody": "We enjoyed this recipe. I doubled the mushrooms and left out the artichokes. I also added a tablespoon of butter. Good with rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trillian"
},
"reviewBody": "The whole family loved this one. I'm going to make it when Mom-in-law comes to visit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MARY MOON"
},
"reviewBody": "I wasn't impressed at all with this recipe which is a first as all of the \"5 star\" recipes I have found on this site have been great up until now. The lemon in this over powers the dish and gives the artichoke hearts a very bitter flavor. My hubby didn't have any raves to offer either. We'll be deleting this from our \"recipe box\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DGLENDE1"
},
"reviewBody": "This is fantastic and so easy. My husband said it was by far the best chicken dinner we've ever had! Next time I may add some capers, but other than that, I wouldn't change a thing! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CIRCETSUI"
},
"reviewBody": "Wondeful and very easy recipe! I took other reviewer's advice and added some parsley and chopped tomatoes. I also used some white wine. It tasted great and looked great. My boy friend loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEA"
},
"reviewBody": "This recipe is awsome!! My Daughter &amp; I wanted to lick the platter clean and the left overs were even better the next day for lunch. I left some of the chicken strips out of the sauce for my finicky eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple and yummy! This dish was a hit. My husband and one year old both loved it. I used wine instead of chicken stock and added some chopped fresh tomato and parsley for color. Served over pasta with crusty bread, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAINOBARBARA"
},
"reviewBody": "I FOLLOWED THE RECIPE, BUT ADDED MOZZARELLA AT THE END AND LET IT MELT AND IT WAS DELICIOUS!!MY HUSBAND LOVED IT! IT WAS QUICK, EASY, AND EXTREMELY TASTY.\r\nBARBARA SANSEVERINO"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used olive oil instead of vegetable oil and white wine instead of chicken stock and it was delicious! My sister droppe din for dinner at the last minute and raved about it! I might add some chopped fresh tomatoes next time for a little color. a definite familt fav/orite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FOREVER42"
},
"reviewBody": "Would take out the artichokes next time, and the chicken didn't finish cooking with the recommended time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azarbonne"
},
"reviewBody": "Yummy! My family really enjoyed this dish. I cut the artichokes into smaller pieces. Nice variation from capers and white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband loved this. I omitted the artichokes. He had it the next day as a leftover and continued to rave. Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JKWBROWN"
},
"reviewBody": "It came out dry and bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent recipe. Easy and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I eliminated the mushrooms and artichokes (picky kids) and increased the paprika and it was really delicious. This is definitely one I will be adding to my recipe collection and making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tasty dish! Used white wine instead of broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turned out great. Adding paprika to the flour made the chicken have a great color. I substituted a bit of wine for the chicken broth which turned out well. I served it with tomato/mozzerella salad on the side. Yummm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a very flavourful recipe. But it was almost dry. The next time I will add some more chicken stock to the butter along with some flour and milk and garlic powder to make a nice sauce before adding the chicken, and pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esmee Williams"
},
"reviewBody": "A delicious dinner for weekdays or weekends. I was thinking this would be a great dinner to serve guests when you don't have a whole lot of time for preparation and cooking. Bravo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KUNGFUKAREN"
},
"reviewBody": "I made a vegetarian version of this recipe by substituting chicken-style seitan (vital wheat gluten) and vegetable broth for the chicken and chicken broth. I also added some julienned red pepper for color. It was scrumptious served over jasmine rice and sprinkled with paprika. This is a very lemony dish--next time I will add some white wine to mellow out the sauce a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Hudson Jansen"
},
"reviewBody": "scrumptious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic recipe, took 20 minutes to prepare. Would recommend to anyone who loves chicken piccata, and artichokes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8901/chicken-piccata-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17187/main-dish/chicken/chicken-piccata/",
"name": "Chicken Piccata Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8901/chicken-piccata-iii/",
"name": "Chicken Piccata III"
}
}
]
}
}
, "about": [
]
}
]