				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Cordon Bleu Casserole"
,"datePublished": "2019-04-02T02:48:46.000-04:00"
,"dateModified": "2019-04-02T02:48:46.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Wanda Cleaver Geitner"
,"url": "https://www.allrecipes.com/cook/1698184"
}
]
,"description": "I love making casseroles, and this one&#39;s so simple. The chicken breasts, Swiss cheese, and ham are cubed, rather than stuffed and rolled, giving you all the flavor of Cordon Bleu in much less time."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/nX1VHoEnjSapgJ6GdCMl5V6NpHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/698626-22e83a9aa0514625bc5c7d42685e486e.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Cordon Bleu Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "223"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "500 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "137 mg"
,"fiberContent": "1 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1017 mg"
,"sugarContent": "4 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 egg",
"0.5 cup milk",
"2 pounds skinless, boneless chicken breast halves - cut into chunks",
"1 cup plain dried bread crumbs",
"1 cup oil for frying",
"8 ounces Swiss cheese, cubed",
"8 ounces cubed ham",
"1 (10.75 ounce) can condensed cream of chicken soup",
"1 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Beat egg and 1/2 cup milk together until combined. Stir in the chicken chunks to coat, then drain, and coat with bread crumbs. Heat oil in a large skillet to 375 degrees F (190 degrees C). Fry breaded chicken cubes in hot oil until golden brown on all sides, then remove, and drain on paper towels."
} ,{
"@type": "HowToStep"
,"text": "Place chicken cubes in a glass baking dish, along with the Swiss cheese, and ham. Stir together the soup with 1 cup milk, pour over casserole."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven until golden brown and bubbly, about 30 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathi"
},
"reviewBody": "After I tweaked this recipe - it was fantastic. I cut the recipe down to 4 servings as there is only me. I also fried the chicken in a non-stick skillet with 1 tablespoon of butter - not oil. For the sauce, I only used 1 can of Healthy Request soup and 1/4 can of milk so it was not runny at all. But I did add 1 tablespoon minced garlic, 1 tablespoon Mrs. Dash Seasoning and 1/2 onion grated to the sauce - cause I wanted this to taste good. Served with a green salad. Yum. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Benyo Tiers"
},
"reviewBody": "This turned out great, although I modified the meat quantities to use less chicken and an equal amount of ham. I also sprinkled bread crumbs on top. I served it with a side of green beans and my family cleaned their plates! Very yummy. Prep time takes longer than stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Dettinburn"
},
"reviewBody": "This was delicious and easy to make!! Will definitely be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Klosek"
},
"reviewBody": "Jjanahah Aisha’s"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sukismom"
},
"reviewBody": "Wonderful flavors! After reading reviews, I used soup and sour cream. It still was runny when I cut into it. Next time I make this I'll increase the Swiss cheese and pre-cook the cubed ham . Thank you for a wonderful alternative to trying to roll chicken around the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mmoloney"
},
"reviewBody": "This turned out so well that my very picky husband gave it a thumb's up and said I may make it again. It is obviously much easier and less time consuming than making traditional Chicken Cordon Bleu. Following suggestions, I only used 1/2 cup milk and it still had enough sauciness for the pasta I cooked for a side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KBNTN"
},
"reviewBody": "Giving it four stars for the basic idea. It was very tasty and easier with my alterations. We try to avoid fried foods so used cooked chicken breast cut in chucks. As another reviewer said I used the bread crumbs as a topping but didn't really care for that. Next time I will leave them off or use a different topping. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Hoffman"
},
"reviewBody": "Was excellent ! Made it for guests,they loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "penny2"
},
"reviewBody": "We used american cheese as my family don't like swiss came out good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PenguinSocialism"
},
"reviewBody": "Very good, filling casserole. I chose to brown the chicken instead of frying it and used the bread crumbs for a crust on top. I upped the amount of ham to 12 ounces, and I also used the half cup of sour cream, half cup of milk alteration many on here have recommended. Perfect consistency. I think I'll add some mushrooms next time to see if that makes it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Gryttenholm"
},
"reviewBody": "This was definitely a hit with my kids as they LOVE anything creamy with some crunch and cheese. The chicken was SO tender and moist and it really did taste like the real thing. Will definitely be making it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vi Nicholas"
},
"reviewBody": "Use IT bread crumbs, fresh parsley. Sauté onions after frying chicken. Sauce: 1/2 cup milk 1/2 cup sour cream. Add fresh parsley to sauce. Add Montreal Chicken seasoning to sauce. Serve over parsley buttered egg noodles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This was good. I would have liked some more \"stuff\" in it though. It seemed like it was missing some veggies (peas, mushrooms, or broccoli would be nice) or at the very least, some noodles. If I make it again, I'll probably monkey with it some and see what I can come up with. As written, it's good, but lacking something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty"
},
"reviewBody": "Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jgnagy"
},
"reviewBody": "best over rice. very cheesy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KrisTheCook"
},
"reviewBody": "I used shaved ham, sliced cheese, and canned chicken. Did the soup, milk, and sour cream thing. I greased the baking pan, then laid down seasoned bread crumbs, the slices of Swiss chees, then shaved ham, then canned chicken. Repeated in two layers topped with crumbs and cheese. Was amazing good and easy! The cheese next to the crumbs on the bottom layer baked into a nice chewy/crispy feature. I wanted to see how many corners I could cut and still have it taste reputable. Haha. It's works. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "my hubby really liked this. I did add a sprinkle of parsley to the egg/milk mix. Next time I will add some pasta to the casserole too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martin Sparks"
},
"reviewBody": "I don't get the canned soup part, nor the point of breading the chicken prior. It adds so much more sodium to the dish where the ham is salty enough. I flash fry the chicken and ham , pour it in casserole dish, toss it a bit with a few tablespoons of flour -- along with warmed milk it will thicken on its own when baked. I add mushrooms (pre-rendered so not to add more liquid)and top with buttered bread crumbs -- it is gorgeous, creamy, cheesy and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Olmscheid"
},
"reviewBody": "To add texture and color, I added in a bag of frozen broccoli and diced potatoes. With my additions, this hot dish transformed into a delicious well rounded meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KATYPI"
},
"reviewBody": "The sauce was runny and the flavor was bland. I had high hopes for this recipe as I am a great fan of chicken cordon bleu, but I found this recipe to be a disappointment considering the amount of work involved. I will not be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia"
},
"reviewBody": "FANTASTIC !! Perfect ... no changes are needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chris Martin"
},
"reviewBody": "only things I changed were to add 2 cans of cream of chicken and 1/2 cup milk - too runny and way too salty - nothing to hold it together - also frying up all those chicken cubes was more work and grease than I wanted to deal with"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "This is a great comfort food! Picky kids loved it! Made enough to feed a hungry family of 6. Will definately make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julez"
},
"reviewBody": "Yummy! I added cooked white rice and an extra can of the Cream of Chicken...then chopped maple ham, Swiss, American and muenster with the fried chicken and poured the second can of soup with the cup of milk over the top and baked for 40 mins!!! Everyone loved this! Yay!!! So LOVE when that happens!!!THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "This recipe has been a favorite since the first time I made it. My husband doesn't like swiss so I used cheddar and panko flakes instead of bread crumbs. It still tastes awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JessamineJohn"
},
"reviewBody": "Great basic idea, but I am lazy and took some shortcuts. I cut the chicken into 1 1/2 inch cubes, tossed them in a little olive oil, shook them in a plastic bag of bread crumbs and baked them until they were done. \nLined the bottom of the dish with 1/2 inch uncooked rice then the ham, chicken, and cheese. Used 2 cans of soup and 1 cup of milk. Topped it with some crushed Ritz Crackers. There were no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephasm482"
},
"reviewBody": "My husband loves this and it is great to set aside multiple portions for his lunch. I put it over mashed potatoes and it is yum yum yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "islandbird"
},
"reviewBody": "My family really loved this recipe. Even though it was a bit runny when following the directions, I have seen some great ideas to help with that. We love chicken cordon bleu and this casserole really delivers the flavor with ease. Thanks a bunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Abby"
},
"reviewBody": "This was EXCELLENT. I added another can of soup (cream of mushroom) and also added fresh mushrooms. The best chicken Cordon Bleu I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amberlee"
},
"reviewBody": "My boyfriend is an incredibly picky eater but he loved this! I put in a few more spices and frenchs fried onions on top towards the end. Thanks so much for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABMB"
},
"reviewBody": "Thank you for this recipe. I did make modifications to use what I had on hand. I didn't have chicken breast but only grilled chicken strips. I ended up cubing the chicken and ham. Mixed the chicken, ham and cheese together with 1 can of soup and 3/4 can of milk. Threw it in the pan and put the bread crumbs on top. Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob ONeill"
},
"reviewBody": "WOW and YUM...that says it all. SIMPLE and QUICK and kids and wife licked the plates!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jackie Ferguson"
},
"reviewBody": "Ttoo runny and too much work for a casserole for me. The taste was good, but the look and presentation of the dish was not good. \nPerhaps lining the bottom of the baking dish with instant rice would help to soak up some up the runny sauce and add another element besides meat and cheese....don't know if it's worth it to try though. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ben Ridenour"
},
"reviewBody": "It's good. Heavy due to ingredient but quite good. Made exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "carren1105"
},
"reviewBody": "I like chicken cordon bleu and I love comfort food, but this was not at all what I expected. I was really looking forward to it, from all the good reviews, but I will not be making it again. To save some calories, I did not bread and fry the chicken, simply sauted it in a pan with a small amount of olive oil. Kept everything else the same, although I did add a bit of fresh thyme. Overall, this is way too salty and lacking in flavor. In some weird twist, my uber picky 13 year old stepson, who would try to live off plain white rice and dry ham sandwiches if we let him, actually liked this....although he was the only one out of five."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sgshowers"
},
"reviewBody": "This is by far the best casserole I have ever made. i would recommend not making any adjustments to it. I have fixed this for years and it is a family favorite. great dish with a side of mixed veggies, rolls, and a cheesecake for dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DanaC"
},
"reviewBody": "I did it differently. I didn't fry anything instead I mixed the ham, chicken and 2 cans of cream of chicken and filled one can with milk so it was thicker.\nThen I poured that in a pan layered it with swiss cheese and topped with bread crumbs. I don't like frying because of the added calories. We all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mabel_doll"
},
"reviewBody": "OMG! This was soooo... good! I followed the recipe verbatim other than using lowfat cream of chicken soup. I didn't find breading the chicken to be any trouble at all. This recipe was much easier than trying to wrap it all up inside a chicken breast and tastes just as good! I highly recommend. This recipe has been added to my Recipe Box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Great basis! I was lucky enough to have frozen, pre-breaded chicken breasts that I could fry so that saved a huge step in prep. Instead of 1 cup of milk, I used about 1/2 cup milk, 1/4 cup white wine, and 1/4 cup sour cream. Yummy, yummy - we'll do this again and thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Lynn Paton-Igoe"
},
"reviewBody": "absolutely loved it i just made it for the first time last week and im making it again today"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PURRBERT"
},
"reviewBody": "I love Chicken Cordon Blue but this recipe didn't do it for me. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bgoughs"
},
"reviewBody": "I also cut back the milk and add another can of soup. Kids like it. Will make again. Prep time took a little longer as I cooked each cut up breast separately for better browning. It also was a bit salty, may have been the extra soup and ham. May need a little tweaking to tone this down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuvsTo Bake"
},
"reviewBody": "Made exactly as written and was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookie17"
},
"reviewBody": "This is good but if you are like me and don't normally fry, you won't like the smell of the chicken frying. \nOtherwise a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAUREN5797"
},
"reviewBody": "My husband absolutely loves this casserole. I have made it a few times and I make it exactly as the recipe states. My only gripe is that it is very time consuming for a casserole, but since he loves it, I will continue to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mvaneps"
},
"reviewBody": "This was just ok for me. I probably wouldn't make it again. If you make the chicken like the recipe call for and don't use frozen nuggets, this seemed like it was actually more work than just making Chicken Cordon Bleu. I would rather stick with the real thing. If I could think of one thing that would make it better for me would be to use something other than bread crumbs to coat the chicken. Maybe more of a traditional flour based breading would have made a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bowlanoodles"
},
"reviewBody": "I used frozen popcorn chicken instead of fresh chicken, and kept everything else the same. Turned out great and made for an easy dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caren"
},
"reviewBody": "This was very good. I did cheat a little by using frozen chicken nuggets thawed (just to save time). They worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This is so delicious and easier than pounding the chicken breasts thin enough to roll. I took the other readers advice and used two cans of soup and about 3/4 cup of milk, just the right amount of sauce, thanks Wanda!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Hansel Russo"
},
"reviewBody": "My family loved this casserole. I made it exactly per the recipe the first time, but thought cooking the chicken was exhausting, I hate to babysit food. So the next dozen or so times we've had it, I was lazy and took frozen chicken nuggets, heated them in the microwave and cut them in fours. The kids nor I knew the difference. As a single Mom with 5 kids in the house, I'm all about simple and quick. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JodiJean"
},
"reviewBody": "The whole family (3 kids under age 7) loved it! I used a ham from Costco and made several batches for the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MegSidebottom"
},
"reviewBody": "This recipe is kick-butt! The first time I made it, it came out a little runny so I took the advice of some other reviewers and cut the milk to 1/2 c. and used 2 cans of soup instead of one. One other thing I did differently was layer the bottom of my pie dish with green peas-- it came out perfect! My husband does a little dance everytime I ask him if he wants this on the menu for the week :) Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HARLEYHON444"
},
"reviewBody": "This is a pretty decent base recipe. I took suggestions of many -- added cooked rice in pan bottom; thyme, garlic powder, parmesean cheese in chicken coating; added 2 tbsp mayo to egg wash to thicken; plus I used turkey ham instead of regular ham. It still could use a little extra flavor but havent decided what the addition will be. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amandalo90"
},
"reviewBody": "Love this recipe! I've been making casseroles a lot lately because they're an easy left over to heat up and this is definitely my favorite so far. The only thing I did DIFFERENT was I put a layer of cooked white rice in the bottom of the casserole dish before baking and it took care of the problem that other people were talking about as far as it being too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "So, my one main issue was the bread crumbs. I think it might have been dipping it in the egg/milk wash that made the coating all fall off into the oil in the skillet. I used italian-style bread crumbs but it didn't really matter because it all fell off in the skillet. I did add fresh ground pepper to the soup mixture before I poured it over the casserole ingredients. I added one personal touch--one box StoveTop Savory Herb stuffing over the top, then I drizzled 1/4 cup of butter over the top. This is sitting in my fridge now waiting for my husband to bake it at dinnertime, as I'll be at work. I'll update my review tomorrow, once I hear how they liked it. EDITED: Mixed reviews. They didn't love it but they didn't hate it either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShepR"
},
"reviewBody": "I LOVED this!!! I ate it for 3 straight days (lots of leftovers) and could have eaten it for 5!!! I liked how the cubed cheese melted... Will definatley make again... THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greniv"
},
"reviewBody": "Loved this recipe! I too made some of the above changes. I would for sure make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imsomr"
},
"reviewBody": "This is 5 stars with reviewers changes. I halved this recipe and cooked it in a casserole dish. I used 1 egg &amp; 1/4 cup whole milk for egg wash. I used 3/4 cup of italian bread crumbs. 4 oz of swiss cheese. I used half milk and half sour cream. It was not runny at all. It actually looked very appetizing unlike the picture above."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TRILLIUM"
},
"reviewBody": "I probably shouldn't rate this at all, as I made this because my daughter loves Chicken Cordon Blue, and I figured she would enjoy it. She did. It's just not my thing though. It would probably be popular at a potluck supper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mr. drinky"
},
"reviewBody": "Not bad.Use low sodium ingredients where possible.We found it quite salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene3692002"
},
"reviewBody": "Great easy way to make cordon blue with basically the same flavor but in a casserole dish! My husband loved it and he is picky, but I mad a few small changes. I used thin sliced ham cut up and pan fried to add a little extra texture and flavor. I used provolone cheese and cut down the milk by about half like others suggested. It turned out great and I will be makig this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Quinn_K"
},
"reviewBody": "I used 1/2 cup of milk and 1/2 cup sour cream as others have suggested, but I found it to be a little dry. Next time I will bake it over rice and use a full cup of milk and possibly 2 cans of soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica Brown"
},
"reviewBody": "This was good I added diced potatoes in the bottom and cooked the chicken then added the rest of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMYJ4KIDOS"
},
"reviewBody": "This was great! I was always \"afraid\" of making chicken cordon bleu the regular way, because I have trouble getting the chicken cooked all the way thru without being dry, so this was a good caserole to try for me. My whole family enjoyed it, with only a small portion left for my 9 year old to pack it in his thermos for lunch the next day. This is a keeper in my recipe box thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann D"
},
"reviewBody": "It's a keeper . everyone enjoyed it and it was so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "neets"
},
"reviewBody": "This was okay. I added thyme and parmesan cheese to the breading mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Mason"
},
"reviewBody": "This was FANTASTIC and has been added to the dinner rotation! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DANIELLE BEATTY"
},
"reviewBody": "Not very healthy, but we definitely enjoyed this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trish"
},
"reviewBody": "Delicious recipe. I didn't have cream of chicken soup so I substituted cream of mushroom and whole milk and it still turned out great. I also took the advice of an earlier posting and used a combination of gruyere and swiss. Excellent. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Mannella"
},
"reviewBody": "This recipe is fantastic but you have to eat it immediately! It does not refrigerate well and it makes terrible leftovers. I don't like the pungent taste of deli swiss cheese, so I substituted Gruyère. It's a little more expensive, but it's much milder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindaT"
},
"reviewBody": "My family loves this. I've made this quite a few times and it comes out good every time. It is a bit time consuming breading and frying all those small pieces of chicken but the end result is really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "triciareneeb"
},
"reviewBody": "one of my favorite recipes that I have found on this site. Have given it to many friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ltltrickster"
},
"reviewBody": "I JUST made this today for dinner, and was unsure what the husband (who's not a casserole fan) and two picky kids would have to say. But i figured i would give it a try as we all love chicken cordon bleu but the husband (who usually makes it) hates making it. Well, when i took it out of the oven the kids came in and said \"smells good like regular chicken cordon bleu\" so with high hopes i plated it up. Both kids and the husband liked it and said i could definitely make it again. I love finding something they ALL like that i can add to my recipe box. One note: I took the advice of a lot of reviewers and cut the milk that i mixed with the soup down to 1/2 a cup from 1 cup. This turned out beautifully, it was not runny at all and tasted fantastic, AND i ran out of bread crumbs but had a bag of seasoned salad croutons in the cupboard that i smashed into crumbs and coated the rest of the chicken with. It worked great! So if you like chicken cordon bleu definitely give this a try, i don't think you'll be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharron"
},
"reviewBody": "so, my family loved this. after reading the reviews, i made a couple of changes as well. I added some flour to the bread crumbs, i only used 1/2 a cup of milk with the canned soup, i used mozzarella cheese, i precooked (in microwave) the ham a little to remove some moisture, i baked it shallow in a large dish for 1 hour. it was creamy and looked great. I just made some for my girlfriend who had her first baby, easy for her to eat, and to make if she wants to repeat. copied the recipe for her along with a casserole dish for a gift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "This recipe was not to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CME"
},
"reviewBody": "My family loved it! I followed the recipe to a T and it was perfect. I served it with rice and peas and it made a Great Meal. I am sure I will serve it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrandyLogan"
},
"reviewBody": "This is my husband's favorite recipe. To make it quicker, use 2 lbs. frozen chicken nuggets instead of breading your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HeatherAnn"
},
"reviewBody": "Very good! Didnt change anything. Easy and each bite has that great Cordon Bleu flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SuperN"
},
"reviewBody": "I liked the flavor of this recipe, but the texture wasn't what I was going for. The crispy breading on the chicken became soggy while baking, and most of it fell off the chicken. This recipe hasn't been a total loss, however. I've since breaded whole chicken breasts and fried, then set aside and prepared the rest of the ingredients as a sauce on the stove to pour over the chicken. This is actually faster, as the sauce is ready as soon as all the cheese is melted, instead of 30 minutes in the oven. Thanks for helping me find a great alternative to the time-consuming hassle of Chicken Cordon Bleu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missy9177"
},
"reviewBody": "reall good chicken dish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trishg98"
},
"reviewBody": "Good flavors. Too time consuming to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven95827"
},
"reviewBody": "I love this cordon bleu, it's so easy to make, it it captures the all the flavors of the orginal cordon bleu. i love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookfinn"
},
"reviewBody": "Sloppy? Yes. Delicious? Yes. I did the breaded chicken part. However, I cooked some non-breaded chicken chunks with onion and garlic in a skillet. Added that to the baking dish. Put in 10 oz of swiss plus about 4 oz of Velveeta because I had it on hand. With about 10 minutes left in the bake time I added a layer of raw/dry package stuffing for crunch. Perfect. Getting up for thirds now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I totally cheated on this one. I used 20 breaded chicken tenders and cooked them ahead. While they were cooking I chopped up the ham and cheese. Making sure to cut everything about the same size. I also try and make sure that all the pieces are evenly dispersed cause I don't like big huge chunks of cheese all clumped together. I used a 9 x 13 pan since the size wasn't mentioned. I used half fat-free sour cream and half milk, like others have suggested. I did not have the problem of this being too runny, infact it could have helped to be runny since I served this over bow tie pasta. Would have made for more sauce that way. This barely fed 5 people. No way 8 people would be happy with the portion size. Make sure to use low sodium chicken soup. Super easy to do and throw together, especially with the breaded chicken tenders."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheHounshells"
},
"reviewBody": "after reading all the reviews i decided to not switch things but make it more for my family. we are trying to eat healthier now so we did not coat and fry the chicken. we just cooked the chicken in the pan and then cubed it up. because ham is a natura water \"holder\" i quickly cooked the ham in a pan first to drain most of the water out of it. i used low sodium cream of chicken soup. i put 1/2 cup of milk with the soup instead of 1 cup. i put 1/2 cup cheese in the mix and 1/2 cup on top. then coverd with a small amount of breadcrumbs. the casserole was not runny at all and tasted very good! the only complaint i have it that this recipe says for 8 people. i have a family of 4. my husband and daughter eat quite a bit and this casserole only covered the 4 of us. depending on what you call a serving size, i would double up on the ingredients if you have more than 4 people in your family. thanks to everyone who put in suggestions!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nettie20"
},
"reviewBody": "Very good, I grilled the chicken and then added some frozen peas and only used 3/4 cup milk. Was a little watery so will prob use less milk or more soup next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pt"
},
"reviewBody": "Very salty and does not taste like cordon bleu. I made it twice changing the recipes to make it less salty but it was still too salty for my taste. Will probably not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Ashley"
},
"reviewBody": "my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kat"
},
"reviewBody": "I made this last night for dinner, and my sweet hubby couldn't stop eating it! In fact, he begged me to make it again. I did modify the recipe. I used a can of cream of mushroom soup instead of the ckix kind, left out the ham, added 1/2 a sautéed red onion and used 2% cheese cubed. Didn't need as much milk as the recipe called for, but I can't tell you how much I used exactly - just made sure it didn't look \"soupy\" before it went into the oven. Will def add this one to the rotation!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy McWilliams Cramer"
},
"reviewBody": "This was great, everyone loved it. I made changes including a few tablespoons of dijon mustard, stirfried the bare-not-breaded chicken, used sliced swiss over the casserole and under a buttered cracker crumb top. Due to the \"runny\" comments, I started the casserole with a layer of rice and the whole thing turned out perfect. Its a keeper, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susieq772"
},
"reviewBody": "I added potatoes to mine to have something else in the casserole to absorb some of the juices and flavors. It was very good! Breading the chicken does seem like a lot of work for an otherwise simple casserole, so I may skip that next time and just do a crumb topping like some other reviewers have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1SWILSON"
},
"reviewBody": "This is kid friendly. Very good. Will make again. I wonder if we could use oven baked \"fried\" chicken so cut the calories/fat down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimmee Hancock"
},
"reviewBody": "Good base recipe, follow the recommendations! And cut the chicken into bite size pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaili Lynn Gallant"
},
"reviewBody": "Used more chicken than recipe called for"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Altmiller"
},
"reviewBody": "good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sld22"
},
"reviewBody": "This was way too heavy for my taste. Frying the chicken and then layering it in cheese and creamy sauce made for a dish that was too heavy for dinner. I won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer DeFosse"
},
"reviewBody": "I skipped the breading and frying part. I just stir-fried the chicken and then tossed it in with the ham and cheese. I halved the milk and added half cup sour cream. This was very good served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VariableVeracity"
},
"reviewBody": "Pretty good. Threw all the ingredients in the casserole dish and topped with bread crumbs and baked. Served with brown rice. With the rice it was very filling and tasty. Easy and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Awesome recipe. It was a little work (breading and frying the chicken cubes)for a recipe, but the taste is great! It is sooo worth it! Try this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/132959/chicken-cordon-bleu-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
"name": "French"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/132959/chicken-cordon-bleu-casserole/",
"name": "Chicken Cordon Bleu Casserole"
}
}
]
}
}
, "about": [
]
}
]