				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken and Biscuit Casserole"
,"datePublished": "1999-05-29T22:24:12.000-04:00"
,"dateModified": "2023-02-10T12:38:08.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cyndi Smith"
,"url": "https://www.allrecipes.com/cook/337693"
}
]
,"description": "This chicken and biscuit casserole is packed with assorted veggies in a creamy sauce for a giant pot pie with a fluffy, herby buttermilk topping."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0m2LLJD46QpHHjktidFBtjJGa0M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5866328-c5ed7efcce9c44d5a38828df0ffd8ee9.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4209581525001",
"description": "Creamy chicken and vegetable filling topped with basil buttermilk biscuits.",
"duration": "PT2M44S",
"name": "Chicken and Biscuit Casserole",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/f411ae19-de38-4f84-a3bf-3f28481d6313/1a865832-01d2-4357-a047-ba343a5db48d/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T04:38:58.673-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken and Biscuit Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "1181"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "451 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "96 mg"
,"fiberContent": "3 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "2015 mg"
,"sugarContent": "8 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.25 cup butter",
"0.5 cup chopped onion",
"0.5 cup chopped celery",
"0.5 cup chopped baby carrots",
"2 cloves garlic, minced",
"0.5 cup all-purpose flour",
"2 teaspoons white sugar",
"1 teaspoon salt",
"1 teaspoon dried basil",
"0.5 teaspoon ground black pepper",
"4 cups chicken broth",
"1 (10 ounce) can peas, drained",
"4 cups diced, cooked chicken meat",
"2 cups buttermilk baking mix",
"2 teaspoons dried basil",
"0.66666668653488 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a large skillet over medium-high heat. Cook and stir onion, celery, carrots, and garlic in hot butter until tender. Mix in flour, sugar, salt, basil, and pepper. Stir in broth; bring to a boil. Boil and stir for 1 minute, then reduce heat and stir in peas. Simmer for 5 minutes, then mix in cooked chicken until combined. Transfer to the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Make biscuits: Combine baking mix and basil in a large bowl. Stir in milk to form a dough. Divide dough into 6 to 8 balls. Use the palm of your hand to flatten each dough ball on floured wax paper into a circular shape; place on top of chicken mixture."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0m2LLJD46QpHHjktidFBtjJGa0M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5866328-c5ed7efcce9c44d5a38828df0ffd8ee9.jpg"
}
]
,"text": "Bake in the preheated oven for 30 minutes. Cover with foil and continue baking for 10 more minutes. Spoon chicken mixture over biscuits to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rich"
},
"reviewBody": "After reading the list of ingredients, I thought the end result would lack flavor, and wasn't so sure the basil would work with this dish. I was thinking thyme would be a better fit. But I made it as written and I was pleasantly surprised, the basil does in fact work and and the dish is flavorful. Mine came out really thick, there just wasn't enough liquid for the ingredients. I intended to spoon over white rice, but so glad I didn't, because the rice would have sucked up any remaining liquid. I would definitely back down on the peas next time, they seemed out of proportion to the rest of the ingredients, and I like peas. In the end, not sure I will tinker with this recipe or not, the end result as written is not worth the effort, and it is labor intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew"
},
"reviewBody": "I made the Chicken and Biscuit Casserole recipe but decided to top with Chef John's Buttermilk Biscuits off Allrecipes and loved the casserole. I know, I know, people get irritated when you change the recipe but I did not have a boxed biscuit mix. I followed the biscuit recipe exact and did not use basil in biscuits but did in casserole. Like I said, everyone loved the recipe. Wish I would have taken a pic. My casserole looked much nicer than the pic on the website for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Kay"
},
"reviewBody": "I used Pillsbury Grands biscuits because I have not had luck with homemade biscuits in the past. I added corn in my casserole and used more veggies than called for. For the chicken I used two boneless skinless Kirkland brand breast (I do not think that was four cups?). I don't like meat overloading my casseroles, but it could have used one more cut up chicken breast. And of course I used salt and pepper to season my chicken before cooking, because who likes plain chicken? Also cooked my chicken on the pan to 165 Fahrenheit (could have done 160 Fahrenheit, because it cooks in the oven a couple of degrees more in the oven and you don't want it overcooked and tough) then placed it in a bowl into the fridge while I cooked the veggies. For the bake time instead of 30 min --&gt; Cover with aluminum foil for 10 min I did 25 min --&gt; Set 9x13 on stove top and Nestle Pillsbury Grands biscuits into the mixture, cover with aluminum foil for 15 min. I found that my casserole was more runny than I prefer (I prefer thicker consistency), although it did thicken up a little for leftovers the next day, but not as much as I would have likes. Next time I will try placing the oven at 375 Fahrenheit instead of 350. Overall good! Also I used a 9x13 I wanted to use my 8x11.5 but could not find it! The slightly smaller pan size could help with the runny consistency. I will be making again! Also, I will use this in a pie crust for a pot pie in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle Mitchell"
},
"reviewBody": "Easy to put together, I used Thyme instead of basil, just my preference. Everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy"
},
"reviewBody": "This was a hit with the guys. Added a pinch of thyme and a shake or two of poultry seasoning for extra flavor plus diced up some potatoes and let them boil about 10 minutes. Thank you for a great meal. Will be making again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this as is and give it a solid 4/5 stars. It is a great base recipe, and a warm comforting meal. Since then, I have made the following changes to suit my family and now consider it a 5. I poached chicken tenders, and 2# yielded 4 cups. I used chicken stock for a heartier flavor, and used 1/2 cup of half n half in place of the milk. I omitted the basil and have substituted thyme and even a pinch of rosemary or poultry seasoning. I doubled the amount of onions and celery that the recipe originally called for and precooked the diced carrots in some of the stock. The cooked perfectly in about 7 minutes. I also use canned buttermilk biscuits and quartered each one to spread on top rather than use the Bisquick mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe that my family has enjoyed for years. I first found the recipe in 1994 in Taste of home Magazine. It was the first place winner of the comforting casseroles contest, presented by Sue Mackey of Galesburg, Illinois."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindie McCaughey"
},
"reviewBody": "Made it as written in a cast iron pan, (except for refrigerated biscuits. Used Grand's. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "I followed the recipe exactly as posted except I used frozen peas. It was delicious! Thank you for this new addition to our menu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ekgaan"
},
"reviewBody": "I had left over baguette and i cubed it, drizzled it with olive oil and salt, cooked in the oven at 350 for 10 minutes. I cooked up the chicken mixture on the stove, spooned into bowls and topped it with the \"croutons\". I called it a \"deconstructed chicken pot pie\" My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonia Rivera"
},
"reviewBody": "OMG!! This is the perfect dish for those cold days. It tastes amazing. It fills your belly and warms your soul. I definitely will be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Schiesl"
},
"reviewBody": "I used thyme instead of the basil because it's my preference. I just dropped the biscuits on top instead of rolling the dough out. I did not have celery but it didn't matter as this is a delicious dish and I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mamaw"
},
"reviewBody": "This is really good. I made it according to the recipe except, instead of broth I used chicken base. Also thought it needed more carrots and peas than called for, hence 4 stars instead of 5. My personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine"
},
"reviewBody": "This was an excellent recipe! I did add peas and I will make this again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alison Miner"
},
"reviewBody": "I made it using Pillsbury fluffy biscuits. 5/7/2021. At CBH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi Parsons"
},
"reviewBody": "great recipe, but instead of buttermilk biscuits, I used the red lobster cheddar bay biscuit mix! turned out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evelyn King"
},
"reviewBody": "It was very easy. I didn't have any carrots (used them all in that fabulous Corn Beef recipe). Cut the recipe in half but the adjust recipe really didn't work so I adjusted it myself. Half is easy but I guess not for the AR modify recipe. Oh well no harm, no foul. It was a good comfort dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jconrad"
},
"reviewBody": "My family loved this recipe! Next time I will omit the sugar and use some additional seasonings. I used canned biscuits and they worked well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Johnson"
},
"reviewBody": "A very good base for this dish that you can add or tinker with. I made as directed but switched around a few veggies with what I had on hand. I added 2 medium potatoes chopped into small pieces. and per others suggestion I added in poultry seasoning for more flavor. I made drop biscuits from scratch and put on top. Really great dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillebean"
},
"reviewBody": "I made this recipe and I swear it was the most delicious food I've ever eaten. My daughter (who claims she doesn't like chicken) was upset with me for not making a bigger batch. My husband loved it too. We can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rico Suave"
},
"reviewBody": "Very good. I used Grands biscuits. I fully cooked the biscuits first, then added them into the casserole for the last :10. Bottom had a chance to absorb, and the tops were nice and crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bobbiethecook"
},
"reviewBody": "I have made this several times and basically keep to the original recipe ingredients. However, I suggest to use Better Than Bullion(Roast Chicken Flavor) for the broth, much more flavor. I use about 1 cup of carrots, 3/4 cup celery, 3/4 onion,1/2 cup of peas and 1/2 cup of corn. On occasion I have also added some precooked diced potato. I replace biscuits with Pie Crust or serve the casserole over Mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "I didn’t want to fuss with mixing dough, so I used frozen biscuits. Other than that, I thought it might’ve been a little bland with the seasonings in the recipe so I used additional seasonings. I would say season to your taste. Thanks for the easy and delicious dinner!?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lara Lincoln"
},
"reviewBody": "I made this with some modifications based on what we had on-hand and what some other reviews said. I had no carrots so used more of the other veggies, I used fresh green beans, bouillon instead of stock, and all thigh meat. I don't like parsley, so I substituted celery leaves. I also added garlic and lots of herbs. We all enjoyed it, including my kids. And what little leftovers we had the next day were even more delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Martin"
},
"reviewBody": "Didn’t expect this to turn out so good! Followed the recipe to a T and it turned out wonderful. Super easy and my boyfriend devoured it! A+"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chantel"
},
"reviewBody": "I just made this recipe the other week. My family thought it was really good. You can add other ingredients- I added mushrooms because I had no peas. Making this again for my family tonight. This will be in rotation for our family meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Barnes"
},
"reviewBody": "I made a few changes but basically the same pot pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolyn bystrycki"
},
"reviewBody": "followed directions. i’m lazy so i used frozen veggies and canned biscuits. served over mashed taters. no complaints from teens. Hubs had seconds and commented that it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnne Yannello"
},
"reviewBody": "I made the recipe exactly as written except I used bisquick and it was wonderful. The flavor was perfect, I wouldn't change anything as far as I'm concerned but everyone has their own taste. My fiance said it was the best meal I've ever made him lol, not true ha. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desiree DeLooze"
},
"reviewBody": "Great recipe!! I used less basil then it called for just because I’m not a huge fan of it. I also added a few bouillon cubes. Other than that I made it as written. It came out delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike D"
},
"reviewBody": "I followed the recipe and it tasted great. I didn’t change it like some people do and it magically becomes tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "This is such a good recipe. It was delicious and the family loved it. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Mottier Sylva"
},
"reviewBody": "Awesome. Used ready made biscuits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LonghornLiz"
},
"reviewBody": "Delicious. I poached my chicken in broth with herbs de provenance and used that broth for the recipe. I’m gluten-free so I whipped up some drop biscuits from scratch and used those. I can’t remember if I made any other modifications, but this is a great base (make it as is or have fun playing with the veggies chicken etc)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julyjohnson"
},
"reviewBody": "Very good! I followed the recipe completely except for the biscuits. I had a can of crescent rolls that I simply spread over the top. Turned out great! Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny LaRue"
},
"reviewBody": "This recipe is incredible! I followed it to spec, the only modification I made was making homemade biscuits instead of the store bought. SO worth it!!! It has amazing flavor and a creamy, delectable consistency. It was a HUGE hit with my family. Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Righter"
},
"reviewBody": "My whole family loved this. All I did differently was fresh broccoli in place of the peas, bc that's what I had, and I increased the biscuits to 3 c (and 1 c milk) so I would have a bit more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mili Camarillo"
},
"reviewBody": "This was so good and I didn’t change a thing! I diced up half a pack of Costco Rotisserie Chicken and it was perfect. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksneij"
},
"reviewBody": "This was a really good pot-pie type dish, homey and filling. Everyone in my family said the recipe was a keeper! \nI made a few minimal changes, based on what I had on hand. I didn't have as much chicken as the recipe called for, so I added some frozen corn and some canned diced potatoes for volume. I also used thinly sliced regular carrots instead of chopping baby ones. I used one can of chicken broth, and 2 cups of \"broth\" that I made using Better Than Bouillon. Additionally, I skipped the step of making my own biscuits and placed frozen buttermilk biscuits right on top of the casserole and baked it for about 35 minutes at 375. It worked perfectly!\nI would add the corn and potatoes again in the future, because I think it added flavor and texture. I will also cut down on the sugar next time, probably only adding 1/2 the called for amount.\nA very good, and easy dinner, especially if you use pre-made biscuits!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhondda Lake"
},
"reviewBody": "I made this substituting Italian seasoning for basil as we had no basil. The family lived it. I will be making this again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Miller"
},
"reviewBody": "This was delicious and pretty quick too. I made some changes out of necessity. Due to Covid19 I can't run to the store. I had chicken breasts that I cubed, uncooked. I added them with the vegies and really followed the recipe after that. I used vegetable broth and made the dumplings with Bisquick. I halved the amount of sugar and would probably leave it out entirely next time. This was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae Hoggarth"
},
"reviewBody": "I followed the recipe pretty close, but didn't have any peas so added canned green beans. And instead of making my biscuits I used those in the refrigerated section of the store. Very good. I'll make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I didn't have the buttermilke baking mix so, instead, I used the recipie for JP's Big Daddy Biscuits (https://www.allrecipes.com/recipe/7040/jps-big-daddy-biscuits/). The result was absolutely delicious. My wife and I ate the whole thing in just two meals. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy K"
},
"reviewBody": "Great Recipe! I put in more carrots and celery than called for and think next time I may use frozen peas because the color is so much better. Both boys in my house went back for seconds and that is my indication that I should make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Riemann"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcus Cox"
},
"reviewBody": "I boiled my chicken with salt, peppercorns, and rosemary in the water and seasoned the chicken with S&amp;P. I also added Italian seasoning to the cream mixture. Came out very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Fascio Russell"
},
"reviewBody": "Did cheat and use bisquick for the biscuits ...but everything else is the same...tastes great! Hubby loves it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gus Gillespie"
},
"reviewBody": "By flattening the bisquick dough, they were bland and dried out. Chicken mixture was cool in center. YUK!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Moore"
},
"reviewBody": "Followed the recipe but used d\ncorn, potatoes, peas, and carrots. Used2 cups broth with a lot of chicken base to flavor plus 2 cups half and half. Didn't have celery so no worries. Have in one now but cream base was delicious! I used chicken tenders, cooked fresh a d shredded then added. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Smith"
},
"reviewBody": "This is now one of my favs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dayanna MRamos"
},
"reviewBody": "this stuff is dangerous! So delicious! I decided to use the Pillsbury canned biscuits and cooked for the time the recipe states. what ended up happening was that the biscuits ended up dry. my suggestion would be to not cook more than 20 min of you're using canned biscuits. this particular can said to cook for 15 min. the recipe is still so delicious. definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Russell"
},
"reviewBody": "I used chicken bouillon, buttermilk biscuits and frozen mixed vegetables... smells delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebMiller"
},
"reviewBody": "Home run! This was excellent. The only change I made was to use frozen beans instead of peas and to cut the basil to one tsp in the biscuits. Excellent. Will make it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Russotto"
},
"reviewBody": "Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosey"
},
"reviewBody": "I made no changes and the recipe was great! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daneen Berry-Guerin"
},
"reviewBody": "Good casserole. We used leftover roasted chicken from store deli and added corn instead of peas. I didn’t make patties with the biscuits just spread dollops on the top. Super easy and flavor is good. I’m thrilled that there is no can of cream of anything. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Lauzon"
},
"reviewBody": "Was great! Family loved it! No leftover! Instead of making the biscuits I used Pillsbury biscuits. Cut the baking time down based on the colour of the biscuits. Was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Knowlden"
},
"reviewBody": "Excellent - however I used homemade baking powder biscuits and they covered the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanababy"
},
"reviewBody": "My family LOVES this. To make it really quick and easy, I've used a rotisserie chicken and Pilsbury biscuits....it comes together quickly and is such a great winter confort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "It was fairly easy to make except it took longer than the recipe said it would to put it all together but It was well worth the wait. We loved it and both went back for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HOLLY9000"
},
"reviewBody": "Thank you for the recipe! It was a little sweet, next time I would half the sugar and up the salt. But the kids ate it so yay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Integrated some review suggestions from others. Used a little half and half instead of all chicken broth. Used frozen buttermilk biscuits rather than from scratch. One mistake I made, I put the frozen biscuits on the bottom and poured the mixture over the top. It got a little exciting when they started to rise!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "KInd of reminded me of a pot pie. The only thing I did differently was half the peas but added frozen corn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Brown"
},
"reviewBody": "Made as directed and it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cabinlady"
},
"reviewBody": "Just Perfect as it is. My family loved it. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darby"
},
"reviewBody": "Delicious and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlebiglady"
},
"reviewBody": "Added poppy seeds to my biscuits, but other than that followed the recipe to a T and it was a big hit, though they said it tasted like Chicken pot pie.. eh def making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carmen and Tucker"
},
"reviewBody": "This was delicious! my husband liked it so much that he requested the leftovers with a runny egg on top...for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rcanter"
},
"reviewBody": "Easy and delicious . Added some potatoes ... That was it ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "I used frozen vegetables, instead of fresh carrots and canned peas, and I used Grands biscuits, but I thought it was much too sweet, so use less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Leal"
},
"reviewBody": "will make again. I made random minor changes. used a roll of store bought biscuits, and added diced potatoes. since I added the diced potatoes, I ended up adding a but more liquid so it wouldn't end up being too dry. I just added some cream of mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bekalu"
},
"reviewBody": "Success! I’m not a very experienced cook, but this turned out great for me. I followed some reviews and rather than baking, simmered on the stove and baked the biscuits separately (with some cheddar in the mix). Added a little milk with the broth, a few mushrooms and a zucchini I had in hand, along with the peas of course! Very creamy and yummy and pot pie like. Hubby loved it on a rainy winter night, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Reed"
},
"reviewBody": "Easy recipe and delicious. I did add cheese to thicken up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeccamagoo"
},
"reviewBody": "So easy... and my kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trudi Gittlein"
},
"reviewBody": "Added frozen peas, poultry seasoning, 1/2 &amp; 1/2, a splash of white wine, mushrooms, green beans. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sara"
},
"reviewBody": "Nice comfort food! Used frozen peas versus canned and seasoned to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noelle Desrochers Olby"
},
"reviewBody": "My family and I really enjoyed this recipe! I used diced chicken breast and Bisquick instead of canned chicken, but followed the recipe other than that. I liked the taste and consistency but may use canned biscuits next time instead or maybe sweeten up the Bisquick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Horns"
},
"reviewBody": "Yum. I’ll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana DeOchoa"
},
"reviewBody": "I used refrigerated biscuits &amp; baked them for a few minutes before baking with the casserole. My husband and I loved this one. I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patriot / Kenneth Burlingham"
},
"reviewBody": "Awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Chandler"
},
"reviewBody": "I followed it exactly except I added a teaspoon of cayenne for some heat and it was a hit! Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulyaman "
},
"reviewBody": "Super awesome! Changed nothing and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Adele Otte"
},
"reviewBody": "I loved this recipe and so did my husband! I try to limit my salt intake so I didn't add the extra salt (just lightly salted the chicken breasts when cooking and the organic chicken broth had more than enough.) I used 3 chicken breasts, but I think I might add a fourth in the future. To add more flavor I added some cayenne pepper and lots of garlic and pepper. When I make this again I'm going to use frozen peas instead of canned. (slightly crunchier, less mushy)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen DeKok"
},
"reviewBody": "On my second try of this recipe, I didn't have any biscuit tubes, so I substituted a refrigerator pie crust and eliminated the biscuits. My wife LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rashawn Lamar"
},
"reviewBody": "Hearty, fairly simple to bake and delicious. Surprisingly filling so I was able to feed family and friends"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clubby981"
},
"reviewBody": "This was great! Followed recipe as written and very happy with the result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jaguar28"
},
"reviewBody": "Very easy and quick to make. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzy g"
},
"reviewBody": "Made as directed but cheated on the biscuit and used jumbo refridgerator store tube biscuits. This was an amazing dish and will make again but I would want to try their biscuit recipe as well. there is NOTHING I would change about this!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jburrell"
},
"reviewBody": "This made my 2 teenage boys very happy when I made it. I also made a beef version when I had leftover roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivy Carter"
},
"reviewBody": "I loved this! It's herby and fresh, while being savory and filling. My husband and friends did not enjoy it, though, so it may be appealing to only a specific palate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Stout"
},
"reviewBody": "We really liked this recipe, it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Kraus"
},
"reviewBody": "I made this on a family vacation and everyone went back for seconds. I used pilsbury grand Biscuits instead of making them from scratch and it turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sillyme"
},
"reviewBody": "Soooo good!! I added potato too, for that chicken pot pie experience. Did not disappoint!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dragonwinged"
},
"reviewBody": "My kids and I felt it needed more carrots and less peas. But it was super tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "This recipe definitely deserves 5 stars. I followed it pretty much as written. I used darker meat chicken and the broth from it. I have found that the darker meat makes for more flavor. I used 3 cups broth and 1 cup half and half for a creamier taste. I made biscuits from my favorite recipe and used coconut oil in the biscuits. The basil in both the pie and in the biscuits made this outstanding. I upped the temperature to 380 degrees and cooked for 30 minutes. My family raved about this. My chicken and biscuit recipe from now on!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gymrat"
},
"reviewBody": "I have made this several times with various combinations of vegetables. I wanted to share last night's combination because it was yummy! I had a box of pearl onion in cream sauce in my freezer. I cooked it for 3 minutes in the microwave. I then pretty much followed the recipe by sautéing the onions and sauce in butter with garlic; added 3 cups of chicken broth; 3 cups frozen vegetable mix; maybe 3+ cups of chicken; used an 11x7 glass pan and baked for 20 minutes. I added Bisquick drop biscuits on top and baked at 375 for an additional 20 minutes. Can't go wrong!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seveneaters"
},
"reviewBody": "Loved it! Kids loved it! Made a few MINOR changes. Less sugar, I don’t like it too sweet; 3 cups broth, 1 cup milk and a little sour cream mixed in; used Pilsbury Flaky Biscuits cut in half horizontally and placed on top as a shortcut. ‘Grands’ would be good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alesi Jones"
},
"reviewBody": "This is such a yummy recipe!! The only different thing I did was use a pre-made biscuit dough &amp; it cooked about half the time! super yummy &amp; VERY filling."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8700/chicken-and-biscuit-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8700/chicken-and-biscuit-casserole/",
"name": "Chicken and Biscuit Casserole"
}
}
]
}
}
, "about": [
]
}
]