				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Cordon Bleu Sandwich"
,"datePublished": "2012-12-17T17:16:39.000-05:00"
,"dateModified": "2019-10-10T00:51:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "If you love chicken cordon bleu because of its winning flavor combination of chicken, ham, and Gruyere cheese, you&#39;ll love this sandwich. It has all the satisfying flavors of chicken cordon bleu with half the work!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aiG5KHQVIm-nxs_mvzLkY4YGHqY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/958827-6cd79534aa2640339cb000b8651435f0.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2011593267001",
"description": "See how to turn a French classic into a simple sandwich.",
"duration": "PT5M45S",
"name": "Chicken Cordon Bleu Sandwich",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d54d5682-c696-404c-b5b4-7d5170c359b6/e82cc21c-c93e-4fa9-babf-050b5234d735/1280x720/match/image.jpg",
"uploadDate": "2021-07-20T05:59:18.380-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Cordon Bleu Sandwich"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "49"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "384 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "78 mg"
,"fiberContent": "1 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "741 mg"
,"sugarContent": "4 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 tablespoons dry bread crumbs",
"1 teaspoon butter, melted",
"2 tablespoons butter",
"0.5 cup diced smoked ham",
"0.5 cup diced onion",
"0.25 teaspoon dried thyme",
"2 tablespoons all-purpose flour",
"0.5 cup milk",
"1 tablespoon milk",
"0.5 cup shredded Gruyere cheese",
"1.5 teaspoons Dijon mustard",
"salt and freshly ground black pepper to taste",
"1 pinch cayenne pepper, or more to taste",
"1 pinch ground nutmeg",
"1 cup diced cooked chicken breast",
"0.25 cup diced dill pickles",
"4 (1/2 inch thick) slices toasted French bread",
"0.25 cup shredded Gruyere cheese",
"1 tablespoon melted butter, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with heavy-duty aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Combine bread crumbs and 1 teaspoon melted butter in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Melt 2 tablespoons butter in a saucepan over medium heat. Cook and stir ham and onion in melted butter until onion turns translucent, about 5 minutes. Stir in thyme and cook for 1 minute. Add flour and cook, stirring constantly, until flour has lost its raw smell, about 3 minutes. Remove from heat and pour in 1/2 cup plus 1 tablespoon milk. Place saucepan back over medium heat and cook, stirring constantly, until sauce is thick, 1 to 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove saucepan from heat and add 1/2 cup shredded Gruyere cheese, Dijon mustard, salt, black pepper, cayenne pepper, and nutmeg. Stir to combine."
} ,{
"@type": "HowToStep"
,"text": "Stir chicken and diced pickle into cheese sauce."
} ,{
"@type": "HowToStep"
,"text": "Place toasted bread slices on the prepared baking sheet. Brush one side of each bread slice with 3/4 teaspoon melted butter. Turn slices over and top each with 1/4 of the cheese sauce. Sprinkle 1 tablespoon shredded Gruyere cheese over the top of each sandwich. Top with bread crumb mixture."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aiG5KHQVIm-nxs_mvzLkY4YGHqY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/958827-6cd79534aa2640339cb000b8651435f0.jpg"
}
]
,"text": "Bake sandwiches in the preheated oven until cheese is bubbling and chicken mixture is hot, 15 to 20 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sharon B"
},
"reviewBody": "Followed recipe. Everyone liked it, except for the pickles. I would suggest trying half batch, one with the pickles, the other without.. \nWould be a five star, well less the pickles here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "I'm just becoming a better cook. The flavor was spot on. I made it as the recipe suggested except I toasted the bread first before baking it. It was a bit of a challenge for me as a new cook to make the sauce so my husband (a trained chef)assisted me. Our daughters along with us, all loved it and we would make it again for dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "Excellent! I doubled the recipe exactly as written and got 10 sandwiches The only change for next time will be to omit pickles. Chef John..thank you once again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "Made this tonight and deviated only where ingredients were not available. Used home made 40%ww bread and tag ends of cheese as I didn't have enough Gruyere. I will be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Gleeson Powell"
},
"reviewBody": "This is the best chicken cordon Bleu I have ever eaten. I am not a cook by any means- My family raved too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KevinJ"
},
"reviewBody": "Yum! And I really liked the pickles in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaleen Strandberg"
},
"reviewBody": "We made this at soup group. We loved it. The only thing we changed was we left out the pickles. There was extra topping so that will be turned into appetizers for the clubhouse pool party Wednesday night. We will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Bibbee"
},
"reviewBody": "no changes super great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "I love Chicken Cordon Bleu, so I was very excited about these sandwiches. However, I really did not care for them. I do not think it tasted like chicken cordon bleu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pattie"
},
"reviewBody": "The picture of this looks so yummy but I was a bit disappointed in my final product. I guess I was expecting a more cheesy flavor &amp; texture and didn't care as much for thick sauce. My husband liked it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessiejune"
},
"reviewBody": "Not to our tastes.Nothing was \"wrong\" with the recipe, I really believe it came down to tastebuds and our personal preferences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blueberry"
},
"reviewBody": "This was wonderful. It was easy to prepare, and was a hit for dinner. We will have this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aegray"
},
"reviewBody": "We tried this tonight and mt husband is already asking w hen I am going to make this again. \n\nI cut my into bite size pieces and think would make a good appetizer at my next cocktail party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZeeWee"
},
"reviewBody": "Wow! Chef John does it again! This was amazing. The flavors were perfectly melded, I could taste all the components and not one \"took over\". I loved the addition of the pickles, I used a high quality homemade type and finely chopped it like another reviewer suggested. I also used Swiss because that's what I had on hand. Served this with a nice arugula and spinach salad. I am seriously thinking about making this again tonight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky in Texas"
},
"reviewBody": "This is delicious! I made the recipe exactly except for the French bread-my husband brought home ciabbata (sp?)-but it was still great. My husband voted it a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Schnabel"
},
"reviewBody": "Excellent easy recipe. I modified it a little because I'm on a Low-Carb regiment. Instead of the flour and milk for the bechamel sauce I used 2 oz. cream cheese and 1/4 cup cream and skipped the bread crumb topping. Eveything else remained the same. It came out great. For the bread base you can substitute Great LowCarb Bakery or ThinSlim bread (1 carb per slice). My granddaughter loved it too and said it tasted like a gourmet chicken pizza. I was also very good cold. I may skip the pickle or mince it finer next time but that's just me. The flavors were very well balanced. It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WYERA"
},
"reviewBody": "This recipe was simple and easy to make. I really liked the idea of it. I don't understand the inclusion of the pickles - they didn't add anything as far as I could tell but were just odd when you bit into them. And the texture was oddly creamy which I found to be off putting. Overall, not my favorite but wasn't terrible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "just jude"
},
"reviewBody": "I was looking so forward to trying this recipe, but was just a bit disappointed with the result. It looks delicious - just like the picture - but its taste is a bit bland. For the amount of time it took to make and the cost of the Gruyere cheese, I think I'll stick to my chicken roll-ups which use chicken, Swiss cheese, ham, and seasoned bread crumbs and then baked and topped with mushrooms lightly fried in garlic olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Galbraith"
},
"reviewBody": "Great recipe! \nWe loved the simplicity of the recipe whilst incorporating all of our favourite chicken cordon bleu flavours. We will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Weeks"
},
"reviewBody": "Friday nights before Scout camp-outs are always rushed and I'm constantly looking for quick Grab and Go hand foods that still pack some substance. I used 6\" French Rolls from the bakery and doubled the recipe to make 8 open faced sandwiches. My Husband says \"These are great! 5 stars!\" I did use the Gruyere cheese which I have never bought before. Both of my sons were holding their shirts over their noses saying they stink, so I was afraid they wouldn't eat them at all. Well...One son ate 3, the other ate 2. My husband had 2 and then came back in the kitchen and snagged the last one before I got the chance to taste it! I never even got to take a picture of them they were gone so fast! Since Gruyere is so expensive, and according to my 16 y/o smells like stinky feet, I may just use Swiss next time. I'll have to set one to the side for myself next time before calling in the hoards. According to the guys' reactions, there will definitely be a next time. Keep 'em comin' Chef John, you've saved dinner more than once at our place."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "After two trips to local markets I struck out on the proper cheese. I used a blend of shredded cheeses and,the recipe was a solid 4 stars. The only thing, this recipe, in my opinion, is not half the work of chicken cordon bleu. Very good anyway"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic!!! I love chicken cordon bleu and this is a simple, delicious version of that dish. I followed it to the letter with one exception, I left out the pickle as I don't care for them. But I served some diced pickle on the side for those in my family who enjoy it. Thanks Chef John for another winner!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "subracer"
},
"reviewBody": "I used chef john's french baguette recipe with this and received rave reviews from the wife. We plan to serve at our holiday party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pete thomas"
},
"reviewBody": "I thought this recipe was fantastic as are all chef johns recipes, keep em coming john, and as always, enjoy :))))"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carpy"
},
"reviewBody": "My husband made exactly as it and we thought it was delicious. It was quite salty next time we will leave out the extra salt. It also had a lot of pickle taste. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Del"
},
"reviewBody": "This is good even without the red and black pepper. I use dried basil as a black pepper replacement. 2 of us in our card party club can't handle pepper, so we have found substitutes. Basil works great. This is quick and easy on homemade bread too. A little green salad and you have a great supper. Thanks, again for the great ideas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamelapoohbear"
},
"reviewBody": "Excellent!! Why or why do people write that the recipe was wonderful than give it three or four stars because they don't have the type of cheese called for in recipe. If the recipe is pleasing, please don't give it less stars just because you don't have all the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juls"
},
"reviewBody": "This recipe was very tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Adams Dodge"
},
"reviewBody": "These were very good and fast and easy to make. I can't help but think about holiday leftovers.....turkey and ham....these are definitely in my future"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsEngstrom"
},
"reviewBody": "So, this is going to sound a little weird, but I just made this into a casserole. My kitchen is almost bare, but I had chicken breasts and my husband loves chicken cordon bleu, so I decided to try and cobble something together. Hubby gave it a \"very good\" so I thought I'd share!\n\nI followed the directions, for the most part, but I only had Buddig ham sandwich meat and some Irish cheddar or something (the wrapper is gone, so I'm not sure. It was just a very sharp cheese!). I doubled the recipe and used panko bread crumbs with the butter as a base in a 7x11 glass pan, chopped chicken next, and then my crazy ham &amp; cheese mixture. As I said, I followed the directions, but didn't have Dijon so I mixed some yellow mustard with a bit of dry mustard. I poured/spooned the mix over the chicken and topped it off with another layer of panko, and in the oven it went!\n\nI like it fairly well myself, but I have a low spice tolerance so I'd probably do a little less mustard next time, and I admittedly went a little crazy with the panko XD but overall it's a success, more than just edible, and I definitely want to have it with french bread and \"real\" ham sometime!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "drkal"
},
"reviewBody": "I followed the recipe for the most part. My husband had made a boule the night before so I used that for my bread. The only other change I made was to use mozzeralla because that's all I had. It turned out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassychef"
},
"reviewBody": "Wonderful recipe. Found we liked it best without the pickles and the onion. I think I used just a dash of the Dijon mustard. Also made this on sliced bread. Although I'm sure it would be wonderful on a French loaf as well. We didn't have gruyere so I used a sharp cheddar instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boonhala"
},
"reviewBody": "I made this dish last night, it was absolutely delicious! My son devoured almost eight inches worth of the entire loaf. Thanks for sharing??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msblackeyes68"
},
"reviewBody": "This is excellent as is. Only thing I may do different is change up the cheese. Other then that so yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnkiPan"
},
"reviewBody": "Just made it for my family of five last night. I just started cooking, but my father ( a very good, trained chef in my opinion) said it was restaurant quality. I TRIPLED the recipe and there was not one bit of leftovers. However, I used sharp cheddar rather than Gruyere (a Vermonters spin on it) and instead of doing individual sandwiches I hollowed out a big loaf of artisan bread and stuffed it with the cheese sauce. We cut it into sections and had it with a side of steamed broccoli in a sharp cheddar cheese sauce. Absolutely amazing. I will definitely make this dish a regular one. It's affordable, it's quick, and it's delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Wagener"
},
"reviewBody": "I can't say I ever follow recipes exactly. The whole family loved these. We used wheat buns cut in half and used olive oil instead of butter. The flavor was very yummy. I used sharp cheddar since it was what I had on hand. The second time I made it with only ham and still awesome. I will try the french bread when I make again. Thanks so much Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "I followed the recipe to as written...delicious!!! Couldn't find Gruyere cheese at my small town grocery store, so just used Swiss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "I made this just as directed by Chef John, and everyone loved them. They made the perfect lunch for us as we greeted out-of-town visitors. I did think that they were just a tad on the bland side, a fact that could be that I used some Honeybaked ham rather than the smoked ham called for. I am surprised that Chef didn't add a little cayenne to this, since that is present in so many of his recipes! :) I would definitely recommend this sandwich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rex Hutcheson"
},
"reviewBody": "Really good as is, but next time maybe I'll add some hot sauce to bring it to a sharper taste."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230567/chicken-cordon-bleu-sandwich/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17371/main-dish/chicken/chicken-cordon-bleu/",
"name": "Chicken Cordon Bleu Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230567/chicken-cordon-bleu-sandwich/",
"name": "Chicken Cordon Bleu Sandwich"
}
}
]
}
}
, "about": [
]
}
]