				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chicken Chilaquiles Casserole"
,"datePublished": "2020-06-23T17:51:31.000-04:00"
,"dateModified": "2020-06-23T17:51:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Melt Organic Buttery Spread"
,"url": "https://www.allrecipes.com/cook/meltorganicbutteryspread"
}
]
,"description": "Loaded with the flavors of Mexico--poblano and chipotles chiles, cilantro, adobo, and queso fresco--this chicken and tortilla casserole is a sure crowd pleaser."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ialLuypGjCzBPAPGzBGF0rfNwCY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/992077-8c580a19358b46c6833342756f66a42b.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chicken Chilaquiles Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "9"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "474 kcal"
,"carbohydrateContent": "52 g"
,"cholesterolContent": "101 mg"
,"fiberContent": "9 g"
,"proteinContent": "44 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "341 mg"
,"sugarContent": "10 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"10 (6 inch) corn tortillas, each cut into 8 wedges",
"Vegetable oil spray",
"2 poblano chiles, steamed, seeded, and chopped coarse",
"2 onions, minced",
"2 teaspoons Melt® Organic Buttery Spread",
"Salt",
"0.25 cup minced fresh cilantro",
"6 cloves garlic, minced",
"2 teaspoons minced canned chipotle peppers in adobo sauce",
"1 (14.5 ounce) can whole peeled tomatoes",
"0.75 cup low-sodium chicken broth",
"1.5 pounds boneless chicken breasts, trimmed",
"Pepper",
"3 ounces crumbled queso fresco or feta cheese",
"0.25 cup low-fat sour cream",
"1 tablespoon fresh lime juice",
"1 tomato, cored, seeded and chopped medium" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350 degrees. Spread the tortilla wedges on 2 rimmed baking sheets. Lightly coat both sides of the tortilla with vegetable oil spray."
} ,{
"@type": "HowToStep"
,"text": "Bake the tortilla wedges until they are lightly browned and begin to crisp, 8 to 12 minutes. Flip the tortilla wedges and continue to bake until the chips are fully toasted, 8 to 12 minutes longer. Set the tortilla wedges aside and turn the oven to 500 degrees."
} ,{
"@type": "HowToStep"
,"text": "Combine the poblano chiles, 1 cup of the onions, Melt®, and 1/8 teaspoon salt in a 12-inch skillet. Cover and cook over medium-low heat until the vegetables are softened, 8 to 10 minutes. Uncover, increase the heat to medium-high, and continue to cook, stirring occasionally, until the vegetables are lightly browned, 4 to 6 minutes longer."
} ,{
"@type": "HowToStep"
,"text": "Stir in 2 tablespoons of the cilantro, garlic, and chipotles and cook until fragrant, about 30 seconds. Stir in the tomatoes with their juice and the broth. Pat the chicken breasts dry with paper towels and season with 1/8 teaspoon pepper. Nestle the chicken breasts into the sauce and bring to a simmer over medium-low heat, about 5 minutes. When the sauce simmers, flip the chicken, cover, and continue to cook until the chicken registers 160 to 165 degrees on an instant-read thermometer, 10 to 12 minutes longer."
} ,{
"@type": "HowToStep"
,"text": "Transfer the chicken to a plate. When cool enough to handle, shred the meat into bite-sized pieces. Process the sauce in a blender until completely smooth, about 1 minute. Return the sauce to the skillet, season with salt and pepper to taste, bring to a simmer over medium heat."
} ,{
"@type": "HowToStep"
,"text": "Stir in the tortillas and cook until they begin to soften, about 2 minutes. Stir in the shredded chicken, then transfer the mixture to an 8-inch square baking dish. Sprinkle with the cheese and bake on the lower-middle rack until hot throughout, 5 to 10 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsey Helgerson"
},
"reviewBody": "This recipe took me about 2 hours to make. I cooked the chicken by itself in salt, pepper, and cumin. It took the tortillas almost and hour to brown at 350. Maybe my dish wasn’t big enough. I cooked the veggies as directed. I then add the chicken to it when it was down and used a hand processor when it was all together. After that I put it on top of the baked tortilla and added the cheese. It tastes so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "EXCELLENT!!!! What a keeper!! The whole family loved it. I do feel that the serving sizes are off- I halved the recipe and wound up with 4-6 servings despite the entire recipe supposedly making 4 servings. I baked the half recipe in an 8x8 pan. I made a couple of minor changes- my husband is trying to stay relatively low-carb so I used low-carb flour tortillas in place of the corn ones. After blending, the sauce was a bit mild so I added about 1/4 cup of salsa and a small sprinkle of onion, garlic, and chile powders- seriously just a little sprinkle of each to push the flavor over the top. I did steam the poblano per the recipe and it worked fine although I have always roasted them in the past. We will definitely be making this one again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lyn Galiote"
},
"reviewBody": "I have never had chicken chilaquiles before, so I had no idea what to expect. I didn't have poblano peppers, so I substituted serrano peppers. The dish wasn't spicy, but we added hot sauce to spice it up. I have one question about the recipe. The directions didn't include any steps using the rest of the chopped onion, the chopped tomato, the sour cream, or the lime juice. I mixed the onion, tomato and lime juice together and put some on each plate. Was that what the recipe author intended? I put a glob of sour cream on each plate too. We liked it, but I agree with others that it was a lot of steps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gilcaz"
},
"reviewBody": "I have had Chilaquiles my whole life. I gave it a 5 star rating because these are the best chilaquiles I've ever had. I think the most difficult part or making chilaquiles is making the salsa. the process given in this recipe is simplified and you get the same result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie Bloodgood Sileo"
},
"reviewBody": "This was tasty, but a bit labor intensive. Also, my corn tortillas kind of cooked up to mush, not sure if this was what was supposed to happen or not, I liked it but other in my family did not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa Hopper Coggins"
},
"reviewBody": "Nice flavor. I made a tripled the recipe to feed 10 and I also seared the chicken then loaded seared chicken and all the veggies into a roaster pan, baked for a little over an hour, was much easier with feeding such a large crowd and I could do other preps while it was cooking and not watch it so close. Made enough for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cazacandice"
},
"reviewBody": "Very, VERY good despite the fact that I did not have all of the ingredients on hand (missing cilantro, chipotle peppers, tomato). Have made it twice and will make it again and again. Next time might try using a spicier pepper than the poblano."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/219865/chicken-chilaquiles-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
"name": "Everyday Cooking"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/219865/chicken-chilaquiles-casserole/",
"name": "Chicken Chilaquiles Casserole"
}
}
]
}
}
, "about": [
]
}
]