				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Children&#39;s Gingerbread House"
,"datePublished": "1999-10-19T15:07:13.000-04:00"
,"dateModified": "2023-01-08T23:10:37.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Ruth"
,"url": "https://www.allrecipes.com/cook/79460"
}
]
,"description": "This easy gingerbread house will be a hit with kids and adults alike. Use your imagination and a variety of candies to make doors, windows, pathways, and a garden. Note that the house will take 2 to 3 days to complete."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Sh4K8Cgz0yjxQ8-jrmNaeeXABQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/538439-childrens-gingerbread-house-SBelle-1x1-1-0c0bac50868f425894508409cda6c005.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1990771210001",
"description": "This old-fashioned gingerbread recipe makes a sturdy, festive holiday house.",
"duration": "PT7M26S",
"name": "Children's Gingerbread House",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4958d448-769a-48d3-a7fd-89251c82ef5c/d5ef6269-d24d-495e-9b08-1ccdab267225/1280x720/match/image.jpg",
"uploadDate": "2021-07-21T23:03:05.029-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Children&#39;s Gingerbread House"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "125"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "736 kcal"
,"carbohydrateContent": "160 g"
,"cholesterolContent": "49 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "172 mg"
,"sugarContent": "136 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT150M"
,"recipeIngredient": [
"0.75 cup butter",
"0.875 cup packed light brown sugar",
"1 teaspoon lemon zest",
"1.5 tablespoons lemon juice",
"0.5 cup molasses",
"2 eggs",
"3 cups all-purpose flour",
"2 teaspoons baking powder",
"1 tablespoon ground ginger",
"2 teaspoons ground allspice",
"6 egg whites",
"4 (16 ounce) packages confectioners' sugar, sifted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "First cut out in thin cardboard: a side wall, 4 1/2 x 8 inches; an end wall, 4 1/2x5 inches; a triangular gable, 4 1/2x3x3 inches; and a roof rectangle, 4 1/2x9 inches. Tape the rectangular end wall piece to the triangular gable piece: match the long side of the triangle, 4 1/2 inches, to one of the 4 1/2 inch sides of the end wall."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream butter and sugar until light and fluffy. Stir in lemon zest, lemon juice, and molasses. Gradually beat in 2 eggs. Sift flour, baking powder, ginger, and allspice together; stir into creamed mixture. Wrap dough in parchment paper, and refrigerate for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degree F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Turn out dough onto a lightly floured surface. Divide into 6 portions, 2 slightly larger than the others. On a lightly floured surface, roll out the 4 smaller pieces to approximately the size of the side wall and the end wall with gable templates; cut out 2 of each."
} ,{
"@type": "HowToStep"
,"text": "Roll out remaining dough, and cut into 2 rectangular roof pieces. Transfer gingerbread to greased baking trays."
} ,{
"@type": "HowToStep"
,"text": "Bake gingerbread in the preheated oven for 10 minutes, or until crisp. Remove from the oven and leave gingerbread on the baking trays for a few minutes to set, then transfer to wire racks. Leave out 8 hours to overnight to harden."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, lightly whisk 2 egg whites. Gradually beat in approximately 5 cups confectioners&#39; sugar. The icing should be smooth and stand in firm peaks."
} ,{
"@type": "HowToStep"
,"text": "Spread or pipe a 9-inch line of icing onto a cake board, and press in one of the side walls so that it sticks firmly and stands upright. If necessary, spread or pipe a little extra icing along either side to help support it. Take an end wall and ice both the side edges. Spread or pipe a line of icing on the board at a right angle to the first wall, and press the end wall into position. Repeat this process with the other two walls until they are all in position. Leave the walls to harden together for at least 2 hours before putting on the roof."
} ,{
"@type": "HowToStep"
,"text": "Spread or pipe a thick layer of icing on top of all the walls, and fix the roof pieces in position; the roof should overlap the walls to make the eaves. Pipe or spread a little icing along the crest of the roof to hold the two pieces firmly together. Leave 8 hours to overnight to set firmly."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Sh4K8Cgz0yjxQ8-jrmNaeeXABQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/538439-childrens-gingerbread-house-SBelle-1x1-1-0c0bac50868f425894508409cda6c005.jpg"
}
]
,"text": "When ready to decorate, make the remaining icing: In a large bowl, lightly whisk 4 egg whites, and mix in remaining confectioners&#39; sugar. Use this to make snow on the roof, and to glue on various candies for decoration. Finish with a fine dusting of sifted confectioners&#39; sugar."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT34720M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alison Alfredson"
},
"reviewBody": "I recommend only using this recipe for building...not for eating. I thought the dough and the baked cookie was awful tasting. Therefore I left out the lemon entirely because what's the point if it won't be eaten. The baked pieces for construction turned out great. They made very sturdy pieces. So 5 stars for the recipe and 0 stars for the taste = 3 stars overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookiemonster27"
},
"reviewBody": "I was really afraid to try this but the recipe is great, easy to follow and tastes amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roguegator"
},
"reviewBody": "Sure easy even without my mixer. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justina"
},
"reviewBody": "Using the extra flour and also using the recommendations for the icing , I made my first gingerbread house that didn't turn into a gingerbread lean-to. My kids loved it and loved the taste as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene1612"
},
"reviewBody": "I am not a fan of gingerbread but this recipe tasted great and the dough was great to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Crabb"
},
"reviewBody": "Excellent recipe, just a little difficult at the beginning, then it gets easier, family love it and super fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "elkebotha"
},
"reviewBody": "This recipe did not work. The gingerbread never hardened, it stayed soft for days, probably because of the molasses. Also the icing was way too dry, not soft or easy to work with at all. I wouldn’t recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "Awesome recipe, easy to make, house sections did not change shape during baking, had enough frosting with 2 egg whites and 4 cups icing sugar, easy to assemble, and tasty to eat! Will definitely make again next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "abadgett"
},
"reviewBody": "As with many others, you will be very frustrated if you do not add quite a lot of extra flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingMomma"
},
"reviewBody": "Our family had so much fun making this gingerbread house. Making a homemade gingerbread house from scratch and decorating it, is so much more fun and exciting compared to the store bought houses. We made it last year for the first time, but we saved the cut outs and we're ready to make the magic happen once again. Thank you for this recipe and our new family tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Cadle"
},
"reviewBody": "I have made houses for friends and family with this recipe for several years as it is written, and it's been great every time. I used a different Royal icing, but we love this cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenni Murphy-Bartruff"
},
"reviewBody": "I didn't use the icing part of the recipe, as I haven't gotten that far yet and have a different recipe for royal icing. That being said, the cookie part came together easy enough. I had to use about 4c. of flour to make it a dough I could actually handle and I didn't add any levening. The flavor is a bit bland, but we don't usually eat our houses anyway. It's a simple recipe that made a pretty decent gingerbread cookie for building houses. This will be my go to recipe now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lindadoubledoo"
},
"reviewBody": "I'm sorry, I just didn't like this recipe. I made this as written. I really didn't like the flavour. Also, I don't think construction gingerbread should have leavening agents and it should be low water content to limit the formation of steam, which means no eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Andrea Peralta"
},
"reviewBody": "Made it exactly as the directions said, dough was so sticky and when they came out of the oven they didn't smell like gingerbread, they smelled horrible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Hoffman"
},
"reviewBody": "Great receipe. The royal icing stiff and works fantastic !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "THANK YOU for the reviewers who said to add 1 1/4 cup of flour. That saved me so much stress. I had a wet mix until adding the flour. This recipe works great otherwise. I did make a different royal icing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dannyboom"
},
"reviewBody": "It was very helpful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "shornbostel"
},
"reviewBody": "I don't know what I did but I followed and it didn't work I had to add more flour it was like I had never added any.:("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "amelia418"
},
"reviewBody": "Followed the recipe except the lemon zest and it didn't harden up so it collapsed and found its way into the trash :(\n\n I guess I'm just not a gingerbread maker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Liv Rinkes"
},
"reviewBody": "Not a good recipe for gingerbread houses. The dough is way too thin to roll out as walls; it's better for cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyful"
},
"reviewBody": "This was a great recipe for first timers like me. I doubled the recipe and added about 1 cup of flour to the gingerbread after reading the other reviews. I only used 4 cups of powdered sugar for the first batch of icing to put the houses together and approximately 5 cups for the decorating icing. My kids had so much fun we will definitely be making this a yearly tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodelicious"
},
"reviewBody": "The dough worked great! I made a Halloween gingerbread house, which I'll redecorate for Christmas using lots of white icing. I also used meringue powder instead of raw egg whites for the royal icing. No matter what you use, be sure to let everything cool off or dry up between steps. It's worth taking the extra time so your house doesn't fall apart if you try to rush the process. Ask me how I know. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheerio"
},
"reviewBody": "Worked great for my family during Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ElizabethR"
},
"reviewBody": "It would be really helpful to first time makers here such as myself, as to how thin to roll the dough. I ended up with not enough to make a second sidewall. \nRegarding the ICING. First batch to 'glue' the piece together was the perfect consistency with 2 egg whites and 5 cups of sugar (I added about 2 tablespoons of water to get it just right). The second batch to decorate the house was so incredibly thin that I added about 5 - 6 cups of sugar to get it right. \nThere is no way you can have 4 egg whites and remaining sugar to get it thick. \"Remaining sugar\" from what? 5 cups? The recipe needs re-writing perhaps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Abi261"
},
"reviewBody": "The dough really didn't work. It took me an hour and a half to get them cut out and on the trey, because they were so sticky and soft. It needs much more flour. I did the same thing as many did, I added a lot of more flour. Over all it was pretty good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHIRLEDPEAS"
},
"reviewBody": "I don't think I can say enough good things about this recipe. First, the gingerbread dough was really easy to work with. Like everyone else, I had to add more flour. Before adding the extra flour, my dough ball was just goo, almost like brownie batter. After adding an extra cup of flour, it still wouldn't hold in the shape of a ball. I ended up using 5 cups of flour instead of the 3 cups. After that, it was perfect! I chilled it, rolled it out on wax paper, chilled it, cut it, chilled it, flipped the wax paper cut-outs onto a parchment-lined cookie sheet, and then baked it. It didn't swell at all! Usually, when you bake gingerbread houses, you end up having to trim the cookies when they come out of the oven. I didn't have to do ANY trimming with this recipe at all! I also had more than I needed for the gingerbread house. I made all four sides, the roof, extra pieces for support, a few gingerbread cookies to eat, and I still ended up throwing away an orange-sized ball of dough that I didn't need.\n\n\nThe frosting really does hold together like glue. Like the dough, the frosting is the PERFECT recipe for a gingerbread house. For the frosting for the construction, I was only able to get 4 cups (not 5) of powdered sugar mixed into the two beaten egg whites. It was too thick to hold any more! It held strong. I think this is the first gingerbread house I ever made that didn't have pieces falling off and driving me nuts! This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Calico Hunt"
},
"reviewBody": "i doubled this recipe to try to make a extra large gingerbread house and it was NOT enough. This recipe only makes a TINY gingerbread house :(\ni had to make my so called HOUSE into cookies.... \n:("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "njoynbakin"
},
"reviewBody": "This gingerbread house turned out really well and it looks really cute! The dough after it hardens overnight is of a strong consistency so you're not afraid it won't hold up for the building process. Definitely would recommend you add 1 or 1 and 1/4 cups additional flour to the dough recipe before attempting to roll it out, or it'll be one sticky mess. And plenty of dough on the rolling board/roller is a must. Roll the dough to 1/4\" thick or slightly thinner. Make sure that the cut-out gingerbread house pieces are matching up with the cardboard cut-outs AFTER placing them on the baking sheet. I did this, &amp; mine didn't need to be trimmed at all after baking. And with the gingerbread dough left over, I was able to get 5 little gingerbread boys using my cookie cutter &amp; an extra end wall (spare in case one didn't hold). Now the powdered sugar called for (4 16 oz. bags) is a little too much- had 2 full cups of sifted powdered sugar left over &amp; if I'd tried adding all of it to my icing for the house decorating, it would have broken my mixer. The gingerbread is pretty good tasting, though it's main function is as a building material. This would be a great Christmas project for you to work on with your kids, especially putting all the candies on. Thanks for sharing this recipe, Ruth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "contessa2007"
},
"reviewBody": "It turned out pretty good, the last gingerbread house I made fell apart upon completion and tasted too wicked for me. But this recipe is pretty tasty. I did make a few changes, but it was mainly becsuse I ran out or didnt have ingredients. First, I 1 1/2 the recipe so I'd have some for cookies too. I only had a tablespoon of ginger instead of 1.5 for my adjustment. And I did not have a lemon to zest, but did have lemon juice, so I added just the adjusted amount. I added some cinnamon and nutmeg to make up for the missing ginger, and I did have to add a good amount of flour, as everyone else mentioned. I baked the house pieces for 20 minutes to stiffen them up but the cookies for only 10. Surprisingly though, the house is still quite soft after being out for several days and is starting to get eaten now that the cookies are gone. I did use a different frosting recipe (2 egg whites, 1/3 tsp. cream of tarter, and 3 cup powdered sugar), only because I've used it before with great results. The recipe as is I'd give 4 stars, but after my tweaks, I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimi B."
},
"reviewBody": "I didn't do lemon zest and I used my own recipe for the icing. \nI'd just like to say, I don't think it's fair to complain about a recipe when the instructions were clearly not followed if you needed to add anything extra. The dough was easy to work with since I allowed it to set in the fridge for an hour like the recipe says. I know it would have needed way more flour had I not done that. Sifting the flour after measuring it probably helped as well. \nI baked mine for 7 minutes, then trimmed the walls and roof back to the correct shape(I also cut out doors and windows half way through baking), and baked it for another 7 minutes. I assembled the house after about 45 minutes of setting and it was just fine(probably because I overcooked it but I was in a bit of a hurry so that was intentional). You can roll it out fairly thin (I wish I had rolled mine thinner) because it raises quite a bit and it's a very sturdy cookie. \nThis was an all day project so if you plan on doing this with young kids the house should be constructed and ready to decorate ahead of time. I made mine with my 7 year old from start to finish and we decorated it right after sticking it together because I didn't want her to have to wait. I admit that was risky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathiB"
},
"reviewBody": "I made this with my granddaughter. It turned out great! Right consistency, directions were perfect. I might try different designs now and then, but the gingerbread itself worked very well and they did eat it after we left, and said it tasted good! Thought I had a photo, but haven't found it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momloves2drink"
},
"reviewBody": "Excellent!Had no issues. Used my own cookie cutters. Walls are very sturdy. Just needs to be put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brownie!"
},
"reviewBody": "It was excellent!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad Istace"
},
"reviewBody": "Worked out great. Walls warped a bit while cooking but I don't think that can be helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ciara_G"
},
"reviewBody": "I made this for a Kris Kringle present just before Christmas and it turned out great. \n\nI should say that I live in rented accomodation with a poorly stocked kitchen so while baking it had no weighing scales, no sieve, no electric whisk (no whisk of any kind actually - I used a fork), no rolling pin, no baking trays (used a silcone baking sheet), only one shelf in the oven, no wire rack to cool it on and no cake board. So I made an educated guess as to the amounts, smoothed it out by patting tinfoil over it, and improvised a cake board with a piece of thick cardboard and more tinfoil. I went out and bought an icing syringe, which for €2.50 did the job of decorating nicely.\n\nDespite the lack of normal kitchen implements this recipe still turned out great so I couldn't give it anything less than 5 stars :-)\n\nOh, like other reviewers I did use almost twice as much flour as the recipe called for so that is one little alteration. I've made the recipe again since using the specified amount of flour though, and it worked too. The spice came through stronger which was nice. And I found that if you have biscuit molds the dough holds the shape really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Work"
},
"reviewBody": "I've never been a fan of gingerbread. I never really cared for the taste or texture. This was a wonderful recipe in its own right, but I needed to add another cup of flour for the right consistency. I'm rating it 4 stars BEFORE my adding the extra cup of flour. Very flavorful and enjoyable to work with and eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "anku"
},
"reviewBody": "The cookies tasted great but I had to add about 2 cups of flour to this recipe to get the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Benson"
},
"reviewBody": "I made 5 gingerbread houses this year from scratch following this recipe. I added 1 1/2 cups more flour as other reviews suggested. The gingerbread is amazing (and I'm not a big gingerbread fan) It was easy to construct the houses. My kids all had a ton of fun decorating them. I will use this recipe for years to come. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvalee"
},
"reviewBody": "This is a great basic recipe. Our family had a blast making and decorating our houses!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LadyK"
},
"reviewBody": "I, also, had to knead in at least another cup of flour to get a workable dough, but once it was workable the rest went smoothly. I used a different recipe for the frosting to avoid the raw eggs: 1 cup powdered sugar to 1 and 1/2 tablespoons milk, made as needed. I put it in a bag and cut the corner off to prevent it from drying out while I worked with it and so I could squeeze it out onto the pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Eulia Gentle"
},
"reviewBody": "Way too STICKY!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Padudu"
},
"reviewBody": "This was a very easy recipe (very basic ingredients) to put together and follow. I cut out the cardboard pieces using approx. the same dimensions (made the pitch of the roof more steep though) Once the dough was rolled out, just placed my 'templates' on the dough, traced and cut. I rolled all the dough out on separate parchment paper which made it easy to transfer to the baking sheet without 'skewing' the 'walls'. I cut out windows, before baking and added crushed candy cane which melted into our 'window glass'. I let the pieces harden overnight before starting assembly. Instead of using the icing recipe here, I used two tubs of ready-made chocolate icing and added 1 16 oz package of confectioners sugar which made a very stiff 'glue'. I assembled the walls as directed, then covered them in the icing, I 'lined' the walls to make it look like logs. I then added the roof. I used Hersheys Cookies n Creme bars to make 'shutters', Kit Kat for the front door, I halved Reeses Peanut Butter cups to make 'flower boxes, Snickers sliced in thin pieces for a 'rock' foundation, and Chocolate Frosted Mini Wheats for the roof 'shingles'. Super fun project! Great recipe, husband and kids loved the flavor of this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HoosierDaddy"
},
"reviewBody": "Make the side walls taller so your roof has support along the entire edge. As written support is only on the gable ends. Our roof started sliding. Added more flour as others did also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "grayfrog10"
},
"reviewBody": "I found the dough to be impossible to shape and cut before baking, and ended up cutting after it came out of the oven. It did make a great gingerbread house, although the part we ate I thought was very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "Best flavor gingerbread recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Stephanie Stock Mahoney"
},
"reviewBody": "Very flavorful for a gingerbread man; but I do not recommend it for a gingerbread house. The dough was very sticky and difficult to roll so we added almost an additional cup of flour. The cookies rise unevenly, therefore the house pieces were not flat and unsuitable for construction. We made 4 batches of this dough for a class project before we changed to a food network recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kinga"
},
"reviewBody": "I like this recipe because it is well explained."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bakingfanatic"
},
"reviewBody": "The ginger bread came out a little lighter than I expected, but over all it was a really good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LalaBeansMom"
},
"reviewBody": "I am so glad I found this recipe! I don't believe Christmas comes in a box and that's what I resorted to after a few failed attempts at the perfect ginger bread house. Everything worked out great, thank you for a recipe that I can pass down to my children..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "texkate"
},
"reviewBody": "I don't usually write reviews, but I wanted to for this recipe. I made this on Christmas Eve, following the directions exactly and it was a complete success. The gingerbread tasted great, and the kids had so much fun decorating it. The only problem I had was that the butter was too soft when I added it, so the dough did not firm up enough to cut even after refrigeration. I solved this by rolling the dough on the cookie sheet and cutting just after I took it out of the oven. All dimensions were perfect and assembly was so easy. THANK YOU for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "This was a lot of fun making the gingerbread &amp; putting the house together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "This was a fabulous experience for myself and two children to enjoy. Here we were in Australia with a temperature in the low 40s C and we were making little cottages with pretend snow adornments. Finding the molasses took days then we were away. The recipe was followed to the letter and it worked out perfectly for us first timers. We did frame the houses, we made two, in the heat the construction and decoration just followed on as it all dried so quickly. Thank you for sharing this recipe and we are planning to make it each year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aggeliki Marina"
},
"reviewBody": "Wonderful flavour! The texture is great as well. We are still nibbling from the house, and it it two weeks old. I found that I needed to add flour, but as with all recipes, each kitchen needs to adjust the ingredients to their own needs. We really loved it. This recipe is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twiggyshell"
},
"reviewBody": "great recipe! i didnt need much extra flour, and i tried rly hard to get this done in one day since thats all i had. i did but i used extra structural support. my hockey team loved it, and some of my coaches couldnt stop eating it hahaha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "millsy"
},
"reviewBody": "not spicy enough for my taste and the walls weren't sturdy enough even with the extra flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise Tegtmeier"
},
"reviewBody": "Used as a 'building' activity for Destination ImagiNation (1st graders). They learned a lot. Even the girl that doesn't like gingerbread ate a piece afterwards! I made a batch and a half (which made two sheets), and I used Watkins' Lemon Extract instead of lemon zest (thumbs way up on taste!) The team &amp; I learned that fresh gingerbread is too crumbly - you DO need to wait more than one hour after baking to assemble:). But, my aim was also to have them cooperate and figure out a way to cut their own shapes without wasting much gingerbread - mission accomplished. And the other teams were very excited to eat our leftovers. Definitely will use this recipe over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "This was perfect with the addition of another cup of flour. I made two small gingerbread houses and a dozen gingerbread men with this recipe and just baked the house parts longer. Very tasty :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheSimpleCook"
},
"reviewBody": "I cooked it about 13-14 minutes and it worked better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bburkhalter01"
},
"reviewBody": "This review is only for the cookie, not the icing, because we made this last night on a complete whim and didn't have enough eggs for the icing. The cookie aspect of this recipe is nice. It tasted pretty good, but ours came out a little too soft for good construction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "petitchameau"
},
"reviewBody": "Great recipe! I did have to add more flour like others have commented, but it tastes great and works well for construction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriAnne Parks"
},
"reviewBody": "Good recipe; held together well. The royal icing recipe is very strong mortar and couldn't be more simple to make. We crumbled butterscotch candies and filled the window openings prior to cooking; this made very realistic looking windows. For high altitude cooking--increase baking time by at least 4 minutes and for the icing; it was 3 egg whites to 5 cups of powdered sugar. Please see uploaded photo/girl with blue shirt on right side of photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayla"
},
"reviewBody": "these are soo cool i love them all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DULCINEA54935"
},
"reviewBody": "Very tasty but a little crumbly for a gingerbread house. Great eating though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "I'm only rating the icing. I had a gingerbread house kit but no icing. I used your recipe. This was the easiest icing. I made 2 versions. Thick for gluing on the candies and the holding the house together and a thinner version to paint on the base and walls, as this one started to dry in the bag and get thicker I also used it for ice cicles. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "METG"
},
"reviewBody": "This dough is delicious and wonderful for gingerbread cookies, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jang"
},
"reviewBody": "Tasted horrible but held up great!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Corinna Campbell Kirk"
},
"reviewBody": "very fun. I use this recipe for my gingerbread molds every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JennaPlum"
},
"reviewBody": "Overall, this is a good recipe. I've used this recipe 2 years in a row, but I'm not totally satisfied with it. I always omit the baking soda/powder to prevent the pieces from expanding and changing shapes. I still get some bubbling though. I'm still on the lookout for a better, more structurely sound recipe to build the large detailed \"houses\" that my husband and I have made a tradition in our home. I have never followed these directions for the house, so I cannot comment on them. Thanks for sharing the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WorldRoamer"
},
"reviewBody": "This recipe worked great! My brother and I decided to construct not just a gingerbread house, but a gingerbread skyscraper! Check out the picture on my profile - I was pretty impressed with our very first attempt at gingerbread construction!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyanka"
},
"reviewBody": "This is an easy and fun recipe. I don't consider myself a cook at all, but I did enjoy this recipe and my children had so much fun making this house. They are only 6 so the house came out like it came out, but they are currently tearing it apart now that Christmas is over and eating it. The gingerbread is tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "akruel"
},
"reviewBody": "The gingerbread itself is tasty but was very very sticky to have to try and roll out I had to add more flour to it. Im not sure what is with the icing recipe but the one that is listed there is not a good one. It doesnt work. I used a different royal icing recipe from this site"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sujatha"
},
"reviewBody": "This was my first gingerbread house and turned out great. My daughter was so happy to decorate it. and she told at least 100 thanks. \nAs other reviewers told, I also added 1 more cup of flour to get the consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ROSEP47"
},
"reviewBody": "This needed more spice for both flavor and color. The second time I added cinnamon and a little ground cloves and thought it tasted better. This is a very rich dough for something that will likely be eaten before it goes stale. I think I'll search for one with less butter. Wanted to add that a large turkey pan liner bag is good for protecting the house overnight. Also, a battery operated tea light or mini light string can be put in if you leave a door or window big enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stefani Buhajla"
},
"reviewBody": "Only giving it four stars because the recipe for the royal icing doesn't work as is and had to add flour to the gingerbread. \n\n**Use 3 egg whites (not 2) to 5 cups of powdered sugar and also add 1/2 teaspoon cream of tartar. It will come out perfect for piping out of a bag and will dry hard as a rock. \n\n**I used honey in place of the molasses simply because I do not like molasses. \n\n**On advice of other reviews I also added a full 1 1/2 cups of flour. Gingerbread was exactly the perfect consistency for building. \n\n**For anyone who wants to use this for other projects, roll your dough to about the same height as a graham cracker. \n\n**Roll dough and score your shapes BEFORE you refridgerate. It is easier to work with while it is still room temp and you will only have to chill it for about 15-20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "krislovesdonuts"
},
"reviewBody": "Not the right recipe for a sturdy gingerbread house. Too much butter, not enough flour, too much powder, should be be honey instead of molasses for hard walls. Would have liked more instruction on how thick to roll out dough. Had to search other sites for better instructions and dough recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dustybortner"
},
"reviewBody": "I did not care for this recipe. The dough was way too wet. I will buy the kits from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CURBKICKER"
},
"reviewBody": "This recipe is AMAZING! I could not stop eating the batter! I don't usually love gingerbread men, but these are heaven, just out of the oven. I didn't use this recipe for my gingerbread house, but will always use this for my men and piecrust for pumpkin pie (gingerbread crust is great for that). Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ranya"
},
"reviewBody": "This recipe didn't work for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOHNN11102"
},
"reviewBody": "I made this with my 3 year old son. I firmly believe that a gingerbread house should be EATEN. Which we did, after about a day and a half. Please allow yourself the childish pleasure of taking a big bit out of the roof!! I added a bit more spices, but otherwise a perfect recipe. Remember to trim!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PITTIPAT"
},
"reviewBody": "We've always bought those kits to make gingerbread houses at Christmas but I'll never do that again - they might as well be cardboard compared to these. So tasty and a lot more fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAJEUNIR"
},
"reviewBody": "This is a really great recipe. Time consuming but well worth your efforts! I had to use bread flour but if you're not going to eat the house after you build it, it works just fine. (Remember to use 2 tablespoons less per cup if you have to use bread flour!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Hmm. You could find a better recipe. It was way too wet--I'm sure something is skewed in the flour amount, as others have said. And the design of the house is simple and works fine, but it could use much more particular instructions for first-time home-makers. I also got a few bubbles in the slabs of baking gingerbread, which I had to pierce, and had trouble getting the whole thing crisp without the edges being burnt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn"
},
"reviewBody": "Frosting for the \"gluing\" of the house, but particularly easy to work with, and held it together beautifully. The rest, of course, was yummy. Carolyn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Auria"
},
"reviewBody": "This recipe was pretty good. I definitely added extra flour, but not until I had refrigerated the dough for an hour. After finding the dough was still quite sticky, I kneaded in three quarter cups of flour. Otherwise it worked out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Let's Eat"
},
"reviewBody": "This was a disappointment. The dough was too stretchy. Once I cut the pieces out, I could not tranfer them to the baking sheet as the pieces would stretch out of shape. So I had to roll out the dough directly on the sheet and cut the shape out there, thus being able to bake just one piece at a time. The icing is a mess. It is very thick and only wants to stick to itself, not to the gingerbread house. After using A LOT of it, we were able to get the house together but that much icing really detracts from the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duckball"
},
"reviewBody": "If you are hesitant to make an icing/glue with raw eggs in it, I suggest picking up some meringue powder (local craft stores usually carry it, and it can be bought online). To make royal icing with meringue powder, you use 3 TBS meringue powder, 1 pound sifted confectioners' sugar, and 4-5 TBS warm water... Mix 5-10 minutes until it forms peaks. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B. Gilbertson"
},
"reviewBody": "Absolutely delicious gingerbread, though I omitted the lemon zest and juice and used mace and cinnamon in place of the allspice. I have my dough refridgerating right now, however I made a few drop cookies as testers and they were GONE in less than 2 minutes. Wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geneen"
},
"reviewBody": "This recipe was a lot of fun. Make sure you give yourself a few days to get it done. It doesn't pay to rush it. It also helps if you have a second pair of hands. The frosting is definitely as good as glue!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SaresMama"
},
"reviewBody": "This turned out so good and so fun for my kids. I made 2 batches for our 3 houses. The first batch I made exactly as written and it turned out perfect! The 2nd batch, I left out the baking powder and of course, it gave me a flatter cookie, but this way I did NOT have to trim the cookie after it came out of the oven, it was a little flatter and more crisp and I actually liked it a little better. Both were great,and my girls and I had a blast decorating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phaewryn"
},
"reviewBody": "This review is for the ICING and assembly tips only, as I used a different recipe for the actual cookies (Gingerbread Men): \n\nThis icing is easy to make and holds like GLUE! It's perfect, and hardens well enough to keep decorating in 2 hours (at least in my low humidity area). I'm so happy with how our first ever gingerbread house turned out that I'm submitting my pictures. I did not use any frame, I simply glued the cookies together as directed in this recipe, walls first, wait one hour til dry, then roof added, wait another hour or two, then decorate in two steps. I did make the cookies 3 days in advance, not because they needed to dry that long, just because I got busy and the house had to wait. It turned out great though! I plan to keep this icing recipe on hand for anytime I need an easy to use and very sturdy icing for decorating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "schmerna"
},
"reviewBody": "I really should have trimed the pieces after they cooked. I had the most crooked house in town. It was still cute but not as pretty as it could have been."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "its laking capasity leAVES MUCH OT BE DISIRED"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DINKYPIE"
},
"reviewBody": "Bake a little bit longer than the directions call for, especially if you live somewhere humid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJGRAHAM"
},
"reviewBody": "I have made this house two years in a row (for Valentine's Day instead of Xmas) and I think it's a great recipe. One year I needed to add flour, the other year I didn't, so just plan accordingly. The icing is amazing and holds the pieces together perfectly. I make tall houses and don't need a frame. I am worried about the raw eggs however and may try another recipe next year because my young children really want to eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULJAMDAN"
},
"reviewBody": "We thought this was a wonderful recipe. We made cutouts for windows, and spread crushed candy canes inside them prior to baking. They melt into stained glass windows. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esmee Williams"
},
"reviewBody": "A bit of work to prepare but so worth it. I have a cookie 'mold' that helps me make the shapes then I use a glue gun to put it together. Then the next day we decorate with candy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The recipe is tasty, however I have found that I needed to DOUBLE the flour to make it work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ABANANAW"
},
"reviewBody": "They were a bit too lemony for my taste, but husband loved them better than three other gingerbread recipes I tried. A great recipe. Thanks, Ruth!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ang"
},
"reviewBody": "This could have been a 5 star. I agree with other's comments.. I had to add about 1 1/4 cup of flour for the dough to work properly. Once I had workable dough it was good from that point. I used another Royal Icing recipe (from this site)after reading others comments. I didn't want to chance that part. Cookie tasted great and my girls had a great time putting together our first gingerbread houses. (Had to make 2 so no fighting would happen) Will make again with adjustments to recipe. I know next time will be a 5 star!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9446/childrens-gingerbread-house/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9446/childrens-gingerbread-house/",
"name": "Children&#39;s Gingerbread House"
}
}
]
}
}
, "about": [
]
}
]