				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chiles Rellenos (Stuffed Peppers)"
,"datePublished": "2018-06-08T09:17:36.000-04:00"
,"dateModified": "2022-07-14T15:43:51.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Adriana"
,"url": "https://www.allrecipes.com/cook/146011"
}
]
,"description": "This is a great traditional Mexican dish. It takes a little bit of time, but it is worth every minute! Provecho! Serve with a side of Spanish Rice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wCNe9UiHvRbzOgQJn-CKFX7iWMo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3641254-23d13e9595624edc9a9ffdb5b459db08.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chiles Rellenos (Stuffed Peppers)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "166"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "808 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "195 mg"
,"fiberContent": "3 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "270 mg"
,"sugarContent": "4 g"
,"fatContent": "71 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"4 fresh poblano chile peppers",
"0.5 pound lean ground beef",
"1 onion, chopped",
"1 clove garlic, chopped",
"salt and pepper to taste",
"3 eggs, separated",
"1 cup shredded mozzarella cheese",
"2 roma (plum) tomatoes, chopped",
"0.5 cup all-purpose flour",
"1 cup corn oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place whole peppers over an open flame (gas burner) or under the broiler. Roast, turning frequently until evenly black and blistered. Remove from heat, place in a plastic bag, and let them sweat for a while. This will allow the skins to peel of easily."
} ,{
"@type": "HowToStep"
,"text": "While the peppers are sweating, place the ground beef in a skillet over medium-high heat. Cook, stirring to crumble, until evenly browned. When beef is fully cooked, add the onion, garlic and tomato, and cook for a few more minutes. Season to taste with salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "Remove the peppers from the bag, and peel off the burnt skin. You may wish to wear protective gloves. Run peppers under cool running water to rinse away any burnt pieces. Make a small vertical slit in the side of the peppers, and remove the seeds and veins. Stuff each pepper halfway with the ground beef mixture, then fill the rest of the way with shredded cheese. Close the slits, and secure with toothpicks."
} ,{
"@type": "HowToStep"
,"text": "Whip egg whites in a large glass or metal bowl until thick and fluffy. Add the egg yolks, and whip for a minute to blend in."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, heat 1/4 inch of oil in a large heavy skillet over medium-high heat. Coat the stuffed peppers with a light dusting of flour, then dip them in the egg so they are fully covered. Carefully place in the hot oil, and fry on both sides until golden. Drain on paper towels, then serve on a large platter."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Reinke"
},
"reviewBody": "First time I made these. I did use ground pork and dinner cumin. Then the sauce, that go's over them, I put cumin and chili powder. It was fantastic. But does take a little time to prepare. Well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a 1/4 tsp of cummin and a pinch of serachi. I was surprised how good it turned out as it seemed more technical than I thought I could accomplish. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChrisM"
},
"reviewBody": "Used Queso Fresco cheese and stuffed the peppers half with the filling and half with cheese before frying. Topped with crumbled cheese for effect. :-) Was delicious and would make again! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Pritko"
},
"reviewBody": "This was so much fun to make!!! And my husband and I loved them!!! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Liz Hopkins Coon"
},
"reviewBody": "We love chilli rellenos, but make them with poblanos over the stove burner to char, then stuff with Colby cheese and then wrapped in an egg roll wrap and deep fry for nice crispy crunch. Then smother with pokrk green chilli sauce and shredded lettuce and diced tomatoes. These are delicious and a favorite of our family and friends. We used to have them at a restaurant in Colorado. I've been making them for about 35 years. \nLiz"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margoth Rod"
},
"reviewBody": "Loved this recipe. I have never been. Pepper person but this was good. The only think I did different is I used chihuahua cheese instead of mozzarella. Will make again for sure! Thanks for the wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Cee"
},
"reviewBody": "Needs more seasoning. It is a bit messy to make but very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J B"
},
"reviewBody": "Fairly easy and really tasty! These only lack a good sauce to smother them in, but other than that, they're perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Wilson"
},
"reviewBody": "They are very good, just wish the chilies were easier to prepare. I did get a tip to shock them is cold water after roasting them. It makes the skin peel easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jethro"
},
"reviewBody": "I added mushrooms and used feta cheese instead of mozzarella. I enjoyed this recipe very much. My late mother used to make these and the roasting of the peppers reminded me of her and those times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa walker"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Stiles"
},
"reviewBody": "My wife &amp; I make this recipe. We really love it! We chop up Chile de árbol peppers &amp; put in the poblanos to make the dish spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Tampke Stiles"
},
"reviewBody": "I stuffed it with shrimp, chorizo, green onions, shredded pepper jack cheese and sundried tomatoes instead of the plain ground beef.....otherwise followed the recipe. Turned out perfect . A meal in itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jzspins"
},
"reviewBody": "Thank you so much for teaching me to make these. I’ve had them in restaurants and wanted a dish that was Keto friendly. I used Almond and Coconut flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drosa"
},
"reviewBody": "Wow! Loved this dish just as it is! Will be on the rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moggy"
},
"reviewBody": "Delicious, my first time making Chiles Rellenos. We loved it. I followed the recipe for the most part, but knowing my family's love of spices and stronger seasoning, I substituted a can of Rotel original in place of the Roma tomatoes and I added about a teaspoon of cumin. I'm sure its delicious as written, just wanted to kick it up a notch. This goes in my 'keeper' file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "glennslioness"
},
"reviewBody": "Flavor was good. Not spicy (poblano peppers). I only gave a 4 star rating as the instructions on how long to sweat your peppers was missing. So, I over sweated my peppers and and they became hard to handle, fill and close."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Bradley"
},
"reviewBody": "I also substituted a can of stewed tomatoes instead of diced tomatoes and added some fresh basil leaves. It was outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merri Chansley"
},
"reviewBody": "One change really, I baked the meat mixture with cheese sprinkled on till melted. Served the fried peppers with meat &amp; cheese on top. The peppers kept tearing as I was removing skin. My SO loved it, (he is of hispanic descent). Named them \"Open Face Chiles Rellenos\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coastal Lover"
},
"reviewBody": "Very authentic! My Mexican friend, who grew up in Mexico, taught me years ago how to make these. This is her recipe all the way. We only did cheese stuffed, but there are many variations on this. Also, you can substitute whatever kind of cheese you like, per taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thisni Caza"
},
"reviewBody": "Good dish...nice flavor combo. I didn't fry, just cuz I need to keep calories down. (Note that the recipe calls for a full cup of oil...most of which is prolly not used, based on the frying instructions in the recipe...but I think the nutrition counts do include the full cup.) Used mild Rotel with the ground beef and pepper jack cheese. Spread a thin layer of enchilada sauce over the bottom of a 7\" X 11\" baking dish, added the stuffed peppers, and then spread about a tablespoon of sauce on each pepper. Baked at 375* until bubbly, added more sauce and a layer of cheese, and then baked until the cheese was melted and bubbly. My peppers fell apart when I peeled them, so I kinda had to half stuff/half roll...and use a few toothpicks = ) ...!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValerieB"
},
"reviewBody": "This was wonderful! My husband said it tasted better than the restaurants. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsplj"
},
"reviewBody": "Sooo good! Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Enobaria Luz"
},
"reviewBody": "I added some spices into my meat like oregano, parsley, cumin, and tumeric. I also added my own tomatoes red salsa. Had a little trouble keeping the peppers from breaking but it didnt matter once they were done because they tasted great. Definitely was a lot of work and creates the garnacha smell in your house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "I opted for a healthier version and skipped the batter &amp; frying, and used the cheese only as a light topping. I baked at 350F for 35 minutes. \n\nIt was flavorful and mildly spicy, good portion size, great addition for a balanced meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "etherhay"
},
"reviewBody": "These are delicious!! The recipe is so easy to follow and they are very true to the authentic flavors. I added a dash of cumin when cooking the meat (I also used ground turkey). This has always been a favorite dish to order when eating authentic Mexican food, and on this first attempt of mine, I am one happy pregnant lady!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hambismommy"
},
"reviewBody": "I was really hesitant about coating with the egg white but it came out perfectly! I added a little enchilada sauce to the meat mixture before stuffing and used a Mexican blend of cheese in place of the mozzarella. Served with more enchilada sauce and grated cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "3 stars because this was not easy for me...being my first time to work with peppers this way. THIS DOES NOT REFLECT THE RECIPE...as I'm sure better cooks did a better job. I just want anyone out there that is not real experienced to know ahead of time...it's not easy. I wish someone could message me on what I did wrong. :( I plan on making them again, but my peppers all fell apart. They were ripping here and there...stuff falling out...barely got them fried up. My husband wasn't impressed...with MY cooking...not the recipe. I love stuffed peppers and really want to make this wonderful recipe work! HELP!!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shenzi96"
},
"reviewBody": "I'm not the fan of Chile Rellenos to begin with, so I'll go off my husband's opinion as it's his favorite dish. He thinks something is missing... but besides that this is one of the best versions we've found on this site. We used some Mexican queso instead of mozzarella for fear it would be too bland. Will keep searching for that missing piece...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jan"
},
"reviewBody": "Substituted with gluten free flour, about to sit down and see! (Crosses fingers)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "make_it_spicy"
},
"reviewBody": "I don't know if it is fair for me to review this, but these were VERY difficult to make! I did the egg mixture and surprised that it stuck to the pepper well but it did not taste the same. I had trouble peeling the peppers' skin and making the right thickness of batter. I melted a spatula in the oil and the second one turned out okay but would definitely not attempt this again. I very much respect the mexican restaurants now and will enjoy them even more now when I order them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "Lots of work. This will be a dish for special occasions. I added cooked bacon with the cheese to the inside of the pepper. Can't go wrong with bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kymla"
},
"reviewBody": "Good Dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gushaus1"
},
"reviewBody": "I'm not a fan of fried food, so I think this is a good alternative. Roast peppers and make mix as described. If you like spicy like me? Add a chopped jalepeno and 1/4 cup pine nuts. Stuff peppers, and add 2 tablespoons of your face tomato sauce. Top with the Mozz cheese. Bake for 1/2 hour. I believe this is a good healthy way to go, and tastes better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "We really like these. My husband is so happy I can make them at home, he won't have to go out to eat to have one.LOL The only thing I really did different is I mixed half ground beef and half chorizo, it was very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy Andrews"
},
"reviewBody": "My husband LOVES chile rellenos so I was excited to find this recipe! The restuarants around here do NOT batter and fry them so I didn't do that either. YUMMY! He was so excited and told me I had to make them at least once a month. :) One other change I made is that I used Land O'Lakes white american cheese instead of mozzerella...I've been told that's what our favorite Mexican restuarants use, and from the taste, I think they're right!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "OdaMae"
},
"reviewBody": "I used Queso Blanco instead of mozzarella, as recommended by another reviewer, these were absolutely FABULOUS!!! The MAN friend had 2, and normally I can't get him to hardly finish his plate for ANYTHING! I had some left over taco meat so I got to skip a step, and one egg was plenty for 3 Poblano peppers, had some bacon drippings, so I skipped the more heavy and excessive corn oil. Topped with heated picante sauce and served with home made spanish brown rice! We WILL be having again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "autumnrose"
},
"reviewBody": "ABSOLUTELY DELICIOUS! Must try but be warned that they are messy and time consuming. Read the directions and make a mental note of how you will prep all of the other sides you will be making with this main dish. The chilies alone take a lot of time. Aside from how disgusting mine looked because I over grilled the chiles and over stuffed them... they were like a little bit of heaven. Even after all of them mess and time it was totally worth it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beverly Jane"
},
"reviewBody": "I made this yesterday but I made the mistake of adding a small amount of adobe sauce. WOW I only used a teaspoon and was it HOT. Otherwise delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eileenkmiller"
},
"reviewBody": "I really liked using the flour instead of a batter. Combining the filling of half meat and half cheese worked perfectly for my version using chorizo sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenlikescows"
},
"reviewBody": "These do take some time to make, but are totally worth it. Mine took a little under 2 hours. (I wasn't rushing, but wasn't totally taking my time either). I used a cheddar and jack cheese blend instead of mozzarella because that is what I had on hand. I will definitely make these again. My husband and father were very impressed and gobbled them up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "REE28AM"
},
"reviewBody": "This was good but just to much grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nofuture"
},
"reviewBody": "I wanted to make that dish because we had it in Mexico and we liked it. It took only 45 minutes to make 5 peppers. Authentic version we tried had a thicker coating, I assume you can increase coating thickness by alternating flour and egg several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GEOFORCE6"
},
"reviewBody": "Good but NEVER EVER rinse the peppers after roasting. A big no-no. It washes away the smokey-char of the skin that adds depth to the roasted pepper. Just remove what you can and the rest of the small burned bits remaining add to the dish's authenticity. I also am a purist and omit the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Christy Chandonia"
},
"reviewBody": "I chose this recipe because it was the only recipe on this site that offered a 4 1/2 star rating but the payoff was not worth all the work that went into the recipe. I made it with a bed of ranchero sauce as well. This was just too much work for not so much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "YUM. My husband just loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessandsam"
},
"reviewBody": "Very yummy. I used canned tomatoes with chili peppers added to make less work. It added some heat also. I struggled getting the outside crust to stay on though. Not sure what the trick is? Next time I won't let the peppers get so overdone under the broiler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy Jackson"
},
"reviewBody": "When making 4 chiles ,use at least 6 eggs for the batter and add like a 1TBLS. Of flour to the batter.I dip the chile into the batter with both hands into the hot oil,just be careful not to burn your fingers,and if some areas need covering with the batter just spoon over the areas that need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hlthytxn2011"
},
"reviewBody": "delicious... but any tips on keeping the batter on the pepper while frying? nearly all my batter came off in the process. :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "texmex12"
},
"reviewBody": "This was the first time I made chiles rellenos, and they came out pretty good. I gave some to my parents and my aunt, since my husband and kids don't like them. They said it came out really good. I did have trouble with the batter sticking to the chiles, but it still came out good either way. I love them with cheese and ground beef, so I stuffed them with both. It was a lot of work, but they tasted real good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoagieja"
},
"reviewBody": "This was an awesome dish. My husband says it may very well be the best he's ever had and is better than one of his favoritie restaurants. Thank you so much for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherry Macias"
},
"reviewBody": "I made these 2 days ago without the meat &amp; they came out great! They taste just like my aunt makes them. Im Mexican &amp; ive tried chiles rellenos before &amp; to be able to make them is just a great feeling! I didnt put the chiles in a plastic bag, i just peel them like that (thats how my mom makes them), and i made some refried beans 2 go along with it. Im glad i found this recipe! Thanks a lot =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Very delicious with a few adjustments to personal taste. I did have a difficult time keeping the peppers together - they kept ripping further as they were stuffed and dipped. I may have over-steamed them. I added Garden Fresh Jack's Special Medium salsa in place of the tomatoes and some cumin as well as hot red pepper to the beef for more spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "carmen94"
},
"reviewBody": "This was good but my family says they wouldn't want it again. I thought it was good but alot of trouble. Not worth the time it took."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "owllasers"
},
"reviewBody": "I'm from Tx, and recently moved to Minnesota where good Mexican food is extremely hard to come by, much less good chiles rellenos. This recipe is fantastic. The only thing I do differently is that I use ground pork rather than beef 'cause I'm saucy like that. Additionally, try adding raisins and/or almonds to the meat as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jillybean"
},
"reviewBody": "The crust didn't stick at all..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "catjean"
},
"reviewBody": "This is fantastic! Will definitely make again! \n\nThe only thing I did differently is I added 4 cheese mex blend you buy in the bag instead of mozzarella. Also after I fried them, i poured about 1/2 cup of enchiladas sauce, sprinkled a little cheese on top, covered, and baked about 10 min at 275."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nici"
},
"reviewBody": "Very tasty! I used blue cornmeal instead of flour for rolling the stuffed peppers in. Beating the egg whites really does make a huge difference in the texture of the batter- it sticks easily onto the peppers, and fries up very crispy. I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bobinbay"
},
"reviewBody": "Impressive...I have always wondered how to cook good rellenos...now I know. Good authentic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tayg"
},
"reviewBody": "yummy!!! i have been looking for a good recipe to match my mother-in-law's chile rellenos and this lived up to her cooking!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lexus1994"
},
"reviewBody": "No one in my family really liked this. To be fair, I believe I really didn't roast the peppers long enough and that may be the only reason none of us liked them. The filling was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babs09"
},
"reviewBody": "Made Chile Rellenos for the first time last night. DELICIOUS! Family loved it. Will do more often now. Used ground turkey meat instead of beef to cut down on fat. Used 75% monteray jack cheese and 25% colby cheese in place of mozerrella. Also used Canola oil - better heart healthy oil. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinArgentina"
},
"reviewBody": "Excellent recipe, I have a very happy hubby! I just filled mine with rolled mozzarella cheese and added 1 tsp of flour to the beaten egg whites along with the yolks to help stiffen the batter. they fried up so beautiful! Thanks so much for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassandra"
},
"reviewBody": "My husband and I loved this recipe and so did my 12 and 14 year old kids! So tasty and I am definitely going to make this again! Thank you so much for posting! I will definitely try variations in the future but we know we will keep coming back to this recipe as it was incredible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ljshrews"
},
"reviewBody": "i was suprised these turned out good! i was apprehensive about them falling apart in the pan since the peeling was messy, but they actually held up well. next time i will probably use a sauce to pour over like some people suggested, and perhaps try mixing cheeses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nina_shawn@coxnet"
},
"reviewBody": "I made plain cheese rellenos using this recipe and it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made plain cheese rellenos using this recipe and it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyBug06445"
},
"reviewBody": "This recipe is EXACTLY how my Mom made them for us growing up and at her restaurant. You can also stuff with different mexican cheeses. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessica"
},
"reviewBody": "These are sooo, delicious. I've made them so many times. Great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "This is a great and authentic recipe. We were very delighted. I used homemade tomato sauce, but the peppers were good without sauce too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "This is a great recipe. I had never made chile rellenos before and this explained exactly what I needed to do. They were delicious. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Qween of My Destiny"
},
"reviewBody": "Great recipe, made it w/ mexican blend cheese since that was what was in the house. My husband said this is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BABSKITCHEN"
},
"reviewBody": "I followed this recipe mostly but didn't want beef in it, just cheese. We used a Mexican cheese blend. Followed the directions the rest of the way and then made a sauce of 1 - 15 oz. can of tomato sauce with 1 can of Original Rotel tomatoes. Very spicy and tasted really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenniV"
},
"reviewBody": "awesome, and very tasty. The only thing I changed is I used a pancake batter made thing redhot and water and used a few different peppers. Even my kids loved it.... I will make this again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DYANNAH"
},
"reviewBody": "Made these for dinner and they turned out great. They are more filling then regular cheese filled chiles. We don't eat our chile rellanos with rice as a side we usually have them with corn tortillas as I serve them with a broth of sauted onion, garlic, tomato and cilantro with chicken broth. However, I did add potato and carrots with the meat mixture making it a picadillo. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "I ended up roasting 3 peppers and not roasting 3 other peppers and put them to the taste test. My family agreed we liked the taste and texture of the peppers that were Not roasted. I like my chile rellenos with cheese only and I knew I wouldn't like mozzarella, so I used montery jack. Good, but I'll continue to search for a better mexican cheese. (but maybe with the meat mixture it works better) I loved the coating - make sure you whip the whites almost stiff. The first few with the stiff egg whites came out much better than the peppers coated with only the frothy egg in the bottom of the bowl. UPDATE: At a restaurant I prefer cheese only, but for this recipe I prefer the ground beef and cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "LOVED this recipe, and so did my sisters and they're very picky eaters!! I learned not to let the egg mixture sit for too long becauuse it will go flat, and also cut the chiles carefully because it will get messy with all the toothpicks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "I've been wanting to try cooking my own!! I prefer only cheese in my Rellenos. Using a restaurant sauce over the home made Chiles Rellenos sounds like a good idea. I'd really like to learn to make that, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KMOREL"
},
"reviewBody": "I saw this recipe being made by mexican chefs in mexico on PBS. What I saw them do differently is they dipped chille in egg white fluff...no yolk, then lightly dusted with flour and deep fryed the chille. If you have a deep fryer...that's the way to go. My chille's were a disaster b/cos I had to flip them over in the fryer and I lost alot of the crust. Other than that a fantastic recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandra"
},
"reviewBody": "I made this recipe but instead of frying I layered the ingredients in a rectangular pyrex peppers, cheese, meat and tomato sauce , black beans and corn onions and cilantro, more cheese and then the egg mixture on top and baked in oven at 350 for 25 minuted instead. Came out great and less greasy than original fried recipe. served with rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gerry"
},
"reviewBody": "Very, very good......was quite a bit of preparation, but worth every minute. Will definitely try it again and again. Hopefully it will freeze well and I will make a bigger batch next time. I went to our local Mexican Restaurant and bought their Ranchero Sauce to put over the top of peppers........great!! Would recommend this recipe to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sarah p"
},
"reviewBody": "This recipe was ok. when you roast the peppers, make sure you roast every inch, and expect it to take a long time. (I learned that the hard way.) Also, you definitely need some type of sauce to go with it, or else it is way too dry. the meat mixure is good, but a little heavy. Next time, I would definitely half the meat mixture and add more cheese. Overall it is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "txchica"
},
"reviewBody": "I used queso fresco instead of mozarella cheese. These were sooo yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kendra"
},
"reviewBody": "Omit the ground beef and do not roast the peppers! Much easier and they turn out great! YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "COOKKAT"
},
"reviewBody": "peppers did not cook fully by frying them (20 min). some peppers very hot, too much filling, but otherwise very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SalTo"
},
"reviewBody": "This was a very tasty dish! My husband even liked it and he''s not a big pepper kinda guy. However, it was very labor intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherbear1"
},
"reviewBody": "This is an authentic recipe, something that would really top it off is a nice tomato sauce over the top. I use about 4 roma tomatoes, 1/2 white onion diced, 2 garlic cloves chopped finely, 1-1/2 chicken bouillon cube, and about 2 cups of water. Put everything in pan and bring to boil, then once tomatoes are tender, put it in the blender and blend until smooth. Pour over the chile rellenos, and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Missdonna13"
},
"reviewBody": "My family and I really enjoyed these. It was my first time making them, and they turned out fantastic. I also made spanish rice with mix veggies as a side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smart cookie"
},
"reviewBody": "Much spicier than you'd think. I am married to a chef, and he said bell peppers would have taken it down to less spicy if you prefer. But pretty simple and very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "Baked instead of fried, and still good! Used grilled chicken instead of beef. Added some chili powder, cumin and crushed red pepper to onions. (We like it hot!) Then rolled in eggs and breadcrumbs, and baked at 400 for 12 minutes. Took out, poured red enchilada sauce and added some cheese to the top, baked for a few more minutes just to melt the cheese!!! My husband and I LOVED this recipe! Will make again when we harvest these poblanos again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vcrim4eva"
},
"reviewBody": "Absolutely Yumalicious! Worth the time and the mess. I substituted the cheese with some colby after reading a few reviews. I also replaced the tomatoes with some Herdez hot salsa to give it extra zing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Crystal852003"
},
"reviewBody": "I made this recipe for dinner last night. It wasn't bad, but there are a few things I changed/would change. First, I mixed the ground beef with a store bought soffrito sauce which gave it a good flavor. I also used a monterey jack and cheddar cheese mix. I followed the recipe for the batter, but I did not like the way it came out. I think the next time I make this I will use a cornbread batter (like the kind corn dogs are made with)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKINGQUEEN75"
},
"reviewBody": "My husband fixed these and they were delicious but he said they were such a pain to make that he will never make them again! We liked them stuffed with the ground beef and he used monterey jack cheese instead of the mozzarella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PastelDeleon"
},
"reviewBody": "The tips were great on peeling the peppers. this is alot easier then what i had been doing. The only thing i changed was the filling i made carne con papas and added queso. my family loved it will be making this again. Thank's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcella Deer McKinney"
},
"reviewBody": "This pic does not do these peppers justice. I used 4 poblano peppers and 4 green chiles, (chiles were a little small to stuff very well). Didn't change anything for the batter recipe and my friends and family raved about them. I was lazy, did not wash my peppers after I cut out the seeds, but they were still wonderful. Last time I made them, I placed the leftovers in the freezer, froze them individually, and my husband and I had them one night for supper. Just threw each of them in a tortilla, added pico and cheese, mmmmmmmm. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steve"
},
"reviewBody": "We made this last night. We used Provel rope cheese and some Habanero cheese melted on top. Getting the chile to stay closed when frying was tricky. We added sour cream on top at the end and lots of hot sauce. THIS DISH WAS AMAZING!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LiLi"
},
"reviewBody": "Great dish! The only alteration we made was to spoon (tomatillo) salsa verde on top before serving. This is how it is served at our favorite Mexican restaurant and it tastes delicious! We will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sonia E."
},
"reviewBody": "I liked these and my daughter loved them but I don't think I'm very good at making them. They were too greasy for me, probably didn't heat the oil hot enough, which made them difficult enjoy. I think next time I'll make them in a casserole so not only will they be easier for me to make but also not so greasy."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/31045/chiles-rellenos-stuffed-peppers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/31045/chiles-rellenos-stuffed-peppers/",
"name": "Chiles Rellenos (Stuffed Peppers)"
}
}
]
}
}
, "about": [
]
}
]