				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chilaquiles III"
,"datePublished": "2020-06-23T17:50:27.000-04:00"
,"dateModified": "2022-08-08T10:48:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "vcmartinezyahoocom"
,"url": "https://www.allrecipes.com/cook/18306896"
}
]
,"description": "One taste of this great Mexican breakfast dish made with crisp corn tortillas, eggs, and chile peppers, and you&#39;ll be hooked!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/q8yKM6XEsCnIcXku9414EdKovKA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5136487-25ed0823ff924852a623c68725fd204e.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chilaquiles III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "34"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "205 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "279 mg"
,"fiberContent": "2 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "119 mg"
,"sugarContent": "2 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"4 (6 inch) corn tortillas, torn into strips",
"1 small onion, diced",
"0.5 tomato, diced",
"3 serrano chile peppers, diced",
"salt and pepper to taste",
"6 eggs, lightly beaten" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the oil in a medium skillet over medium heat, and fry the tortillas until lightly browned and crisp."
} ,{
"@type": "HowToStep"
,"text": "Mix the onion, tomato, and serrano chile peppers into the skillet. Season with salt and pepper. Continue to cook and stir until onions are tender."
} ,{
"@type": "HowToStep"
,"text": "Stir the eggs into the skillet, and cook until firm."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Cleaver"
},
"reviewBody": "It’s was really good. I used jalapeño because I had it and added my tomatoes as I started cooking the eggs so they wouldn’t get mushy. It was easy and delicious. Great brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Joy Elliott"
},
"reviewBody": "Made this for dinner today. I did not have Serrano chilies but used 2 jalapeño chilies that were beginning to turn red. I also forgot to add cheese on the top but we really did not need it. I also used grape tomatoes since it was all I had on hand. It was delicious and I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phoebe Scarborough"
},
"reviewBody": "Delicious, and I only used what I had on hand to be fair. No tomatoes so I used tomato paste, valentina brand salsa picante and a bit of water. I added that to onion, garlic and some fresh oregano I had in the fridge. I had old corn chips, so I threw that in with the tomato onion mix and then added the eggs. I served it with black beans and some leftover chicken. Amazing, only took 15 minutes, and the chips still had a bit crunch. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mindiesel82"
},
"reviewBody": "this was excellent! we fried about a half a package of tortillas separately until golden brown and put them aside. Then I cooked chorizo separately and put that aside. Then sauteed tomatoes, onions, minced garlic and serrano peppers and then added the eggs until cooked through. Then, we layered everything on our plates, tortillas, chorizo, eggs, cojita cheese, and crema fresca, and topped everything off with red enchilada sauce (hot). This was soo delicious and totally authentic and the tortillas stayed crispy because we didn't cook them with anything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HAPPY_HIPPIE"
},
"reviewBody": "What a great recipe for shaking up the breakfast routine in our home. This was very good. That it was quick and easy to prepare with ingredients I always have on hand made it very appealing. My changes included reducing the chile peppers to just one because I was feeding teens, but they suggested amping it up a bit so I'll use 2 next time. I also added pico di gallo at the end to add additional moisture to the dish because this is how we remembered it being served in restaurants. Thank you VCMARTINEZ for sharing your wonderful recipe that made for a very yummy breakfast and will be made again and again in our home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MattOlay V-H"
},
"reviewBody": "I love this! Minor changes: I used white corn tortillas (all I had) and roasted the serranos (I was in the middle of making salsa) and of course seeded those :). When it comes to latin food, I seem to squirt lemons all the time and use green pepper sauce. That's just me though. I will keep this for sure! Nice change of pace and maybe next time try it with chorizo. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "This was good. I used canned diced tomatoes instead of fresh. I didn't care much for the taste of the cooking oil. Maybe I will try lard next time. I used a Hatch chile pepper from my freezer. This seemed a bit bland though and needs some seasoning. I scrambled the egg, but I think I will try it over easy the next time. I liked the crunchy bits of corn tortilla best. Thanks, I enjoyed this breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Maurer"
},
"reviewBody": "Easier version. Use salsa verde. A Mexican salsa made with tomatillos. poor over chips and add fried egg on top. ususally served with a shredded white cheese and crema fresa. (or sour cream)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "This was good! Needed a little seasoning was all! I halved the recipe and served them in flour tortillas with some hot sauce and we thought it was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rhianna"
},
"reviewBody": "Good in its own way (&amp; with salt &amp; pepper added), but I really wanted it saucier - perhaps adding some red enchilada sauce would've satisfied. To reduce the very high cholesterol, I used 2 whole eggs &amp; the rest were egg whites. By the way, folks, however crispy you get the corn tortilla pieces to be, they WILL become soggy again, as to be expected in chilaquiles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Canedo - GO STEELERS!"
},
"reviewBody": "I was very happy with this recipe! I followed the recipe exactly and it was excellent! My fiance is mexican and when I gave him this for breakfast, he said it was better than what he was used to! Thank you for this recipe, this one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "metzstar"
},
"reviewBody": "Much better then your basic scrambled eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLISBDOLLIS"
},
"reviewBody": "Delicious! We used stale tortilla chips rather than frying tortillas, and added them right at the end just before the eggs were fully cooked. No cheese needed--this is tasty as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Topher"
},
"reviewBody": "Great recipe, very authentic tasting. I don't use serranos very often because others in my family think they're too hot. I also like roasted peppers with my chilaquiles, so I roast jalapenos or buy canned chipotles. I throw in a large minced clove of garlic with the onion and tomato, and add the peppers just before the egg, at which time I also add roughly chopped cilantro. Just before the eggs are finished cooking, I add some smoked mozzarella cut into cubes and this melts wonderfully and adds a nice smokey flavor which complements the peppers. If you don't judge the crispness of the tortillas right, you may burn them while sauteing the onion. You may want to remove them from the oil, dry and return them when you begin cooking the eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "My family loves these. I've torqued the recipe depending upon what I have in my fridge. Instead of a fresh tomato, I've used a half a can of cut up tomatoes. Instead of fresh chiles, I've used a can of diced mild green chiles or diced jalapenos. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Lopez"
},
"reviewBody": "We thoroughly enjoyed this. Sprinkling a little cheese on top and a bowl of fresh fruit on the side makes this one terrific breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda123"
},
"reviewBody": "This was great. It was a little more elaborate than my usual scrambled eggs, but completely worth the extra steps. I cut the recipe in half and used egg whites to make it healthier. I didn't have any fresh chiles so I used a couple tablespoons of canned green chiles. To serve it I sprinkled it with some Jack cheese and a scoop of light sour cream. I added hot sauce as I ate it to up the spicyness a bit -- the fresh chiles probably would have helped with that. It was very good the way I made it and I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jodee"
},
"reviewBody": "This was sooo good. I had to make breakfast for 40 people,and I had never made this before, but had it in mexico and loved it. Well everyone loved the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dinnersforwinners"
},
"reviewBody": "My mom always made something like this when I was growing up so I was glad to find a recipe that seemed to be just like what I remembered. It was easy &amp; tasty. I added shredded cheddar and jack cheese to the top... I also added the tomatoes after that.... I liked them cold on top of the melted cheese, personal preference. I didnt really like how the tortilla strips became soggy by the time I plated this, but there's probably no way to avoid that. Great recipe, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THIS RECIPE WAS AWSOME, I HAD FUN MAKING IT, IT WAS REALLY GOOD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LucyDelRey"
},
"reviewBody": "Muchas gracias!!! This was a quick and delicious supper for the two of us. I scaled down the recipe, using 4 corn tortillas and 4 eggs. I topped with sour cream (VIEW MY PHOTO) and a side of refried beans. I will keep this in my recipe file. It's a great recipe for those folks who, like me, are exhausted at the end of the work day and need a quick and hot meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SARAHT55"
},
"reviewBody": "We just made this for brunch with friends and everyone loved it! Easy, great, and no leftovers."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/49613/chilaquiles-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/49613/chilaquiles-iii/",
"name": "Chilaquiles III"
}
}
]
}
}
, "about": [
]
}
]