				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chinese Steamed Buns"
,"datePublished": "1998-10-24T23:06:27.000-04:00"
,"dateModified": "2022-12-16T08:52:07.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Carol Chung Chi Wa"
,"url": "https://www.allrecipes.com/cook/26842573"
}
]
,"description": "These steamed buns are delicate, filling-free Chinese dim sum you can make at home. Hot and freshly steamed mantou are ultra-soft, puffy, and fluffy."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Vxu9PcPKs4klYBnXi2EdGjiOQQY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1121464-89ab6617ed5f44e5a81ffab59f1a25fe.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chinese Steamed Buns"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "191"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "44 kcal"
,"carbohydrateContent": "8 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "35 mg"
,"sugarContent": "1 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.75 cups all-purpose flour, divided",
"0.75 cup warm water, divided",
"1 tablespoon active dry yeast",
"1 teaspoon white sugar",
"2 tablespoons white sugar",
"1 tablespoon vegetable oil",
"0.25 teaspoon salt",
"0.5 teaspoon baking powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together 1/4 cup flour, 1/4 cup warm water, yeast, and 1 teaspoon sugar in a large bowl. Allow to sit for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Mix in remaining 1 1/2 cups flour, remaining 1/2 cup warm water, 2 tablespoons sugar, vegetable oil, and salt. Knead until dough is smooth and elastic. Transfer to a greased bowl, roll to coat with oil, and let sit until tripled in size, 2 1/2 to 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Punch down dough and spread out on a floured board. Sprinkle baking powder evenly on surface of dough; knead for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Divide dough in half; set aside one half in a covered bowl. Divide remaining half into 12 equal pieces. Shape each into a ball; transfer each ball to a small square of waxed paper with the smooth surface facing up. Repeat portioning and shaping with remaining dough half. Cover all 24 dough balls and let sit until doubled in size, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Bring some water to a boil in a wok, then reduce heat to medium and keep water at a low boil. Place the steam plate on a small wire rack in the middle of the wok, leaving at least 2 inches of space between the plate and the wok. Working in batches, place buns on waxed paper squares onto the steam plate, leaving 1 to 2 inches between buns."
} ,{
"@type": "HowToStep"
,"text": "Cover and steam buns for 15 minutes. Carefully remove the lid, so condensation doesn&#39;t drip onto buns. Continue steaming remaining buns until all are cooked."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT285M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Little Women in the Kitchen"
},
"reviewBody": "Have tried countless of recipes. This one is the one the one I’m keeping and making over and over again! Love that it’s so fluffy and also easier to handle than other recipes I’ve tried! So happy with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I gave it a five star because the inside was delicious and I couldn't stop eating it after all I ate the most in my whole family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good recipe! I did have to add a little more flour but it came out to be the best recipe I've tried and I've made these buns many times. Didn't have any baking powder but they still came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kitchenratz"
},
"reviewBody": "we followed the recipe and just as one commentator wrote, needed much more flour on the initial mix. Not a good sign. The buns came out okay, I guess. Will freeze the remainder to repurpose. For what have no clue yet. bake them for croutons? and to top it off too time consuming, but we knew that going in. 4hours? Won't be doing this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PaperTsubaki"
},
"reviewBody": "It took all day but I finally finished! I took everyone's recommendation of adding some baking soda to counteract any bitterness and it worked like a charm! I will admit the wait times are kind of unnecessary. I ended up skipping the last 30 minute rise.\n\nI did a beef bulgogi recipe (Called beef bowl on another site) with both ground pork and leftover chicken leg for the filling and it was pretty good.\nThis recipe is in a lot of other places and it takes a LOT less time to rise. The taste was good but I attribute it to my stellar filling recipe. I made it in my rice cooker and it was pretty good. The only complaint I have is the rising time is a bit overkill considering many other variations and ended up being an all day task. Would make it again all in all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne Martindell"
},
"reviewBody": "I had to add more flour to the recipe about 1/2 cup more. So it is not so sticky. This is a great recipe starter. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marc W"
},
"reviewBody": "Unless I did something wrong in the making, my family did not like these plain steamed buns. The plain bun was very bland with very little taste, and in fact, several of the family noted something bitter.. I wonder if that addition of baking powder at the end caused that. \nWe ended up splitting them, toasting them and eating with butter and sugar - they were enjoyable then, but as a plain bun, I think the dough should have been more tasty. \nI won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ben Burke"
},
"reviewBody": "Made great buns. Ensure you roll out dough evenly when adding filling. Otherwise you will end up with transparent dough ok one side and thick bread on the other."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I have never made any kind of Chinese buns before (and I'm not a great baker) so I was nervous - but these came out AMAZING. I followed the advice of adding warm milk in place of half the water and a few drops of lemon. \n\nI used a cupcake tin to make this. After I rolled out a circle, I draped it over one of the cupcake holes and gently shaped it in, making sure the bottom was the thickest part (which was counter-intuitive because usually, you roll out dough thinnest in the middle). Then I put in about 2 tbsp of filling and gently pinched it closed before giving the top a gentle 'spin' to get that design. \n\nPopped it out and put it on a quarter-sheet covered with parchment paper to rest before steaming and went on with the next one. This recipe gave me exactly 12 cupcake-sized buns and they were SO DELICIOUS. Pillowy, soft, chewy and yum. I used a spiced hamburger and veg stuffing since I knew my family liked those flavors. Now we want to try every stuffing with these buns!\n\nIf you've never made these before and you're craving WowBao? You've found the recipe! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kylee Wachtveitl"
},
"reviewBody": "The bread tasted great, the size of the balls aren't the best for filling and keeping it evenly all around. I would cut it into eighths or tenth instead of 12th. It was too small when I filling the buns with steak. (Which turned out better than expected.) \n\nFun point if you don't have a steamer normally used you can use a veggie steamer and it works out just fine! -it worked for me, just make sure you have a big enough pot so the steamer is as able to have the walls as flat as possible. 10/10 will do again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jgardner14"
},
"reviewBody": "I'm really happy with the way these turned out, but this is the first recipe for them that I've tried so I can't compare it to any others yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Xena Alvarez"
},
"reviewBody": "Turned out great. I ended up using a 1/2 c more water and it may have been because I am at a high altitude. Besides, that I let it rise the 2 1/2 hour minimum and when I separated the dough, the dough balls came out way too small and did not double in size as expected. I ended up combining 2 for each and they were a much better size. I went with turkey stuffing and chicken in mine, and the consistency and flavor of the dough once steamed is phenomenal! Can’t wait to make again!!! Thank you for sharing! Husband approved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princessicedark"
},
"reviewBody": "My 3 year old loves them... especially when I put peanut butter in between or sesame paste and jelly in between."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia DelleTorri"
},
"reviewBody": "Added filling (tofu, carrot, white onion) for dinner\nAnd peanut butter&amp; chocolate chips for dessert :)\nI steamed them in a rice cooker instead. 15 minutes with parchment paper lining the bottom.\nSo easy to make! I can't wait to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amybobamy"
},
"reviewBody": "Only use BAKING SODA on the last step if you want BROWNING. This ingredient causes the Maillard reaction and produces light browning during steaming\n\nFor bright white steamed buns, leave out the BAKING SODA (but it will NOT affect flavor, either way).\n\nThis recipe, used exactly as written, produces a perfectly textured steamed bun, whether filled or not. Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Claire Halberg"
},
"reviewBody": "This recipe did not work for me at all. I was not able to finish the recipe, because the dough came out of the last rising period as a liquid. The recipe needs to be worded more clearly, especially when describing what should be done/added after each rising period."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doris Tam"
},
"reviewBody": "Pretty Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veldrin Luth'ol"
},
"reviewBody": "I made a stuffed BBQ Chicken version of these. They were fun to make, not to hard to do if you have some baking skill. However, they were not like they are when you buy them at the store. Mine came out darker and more bread like than sponge like. They were not bad, just different. I don't mind. These beautiful buns rock!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "God_warrior627"
},
"reviewBody": "I used the suggestions of using milk instead of water and adding baking soda and the dough turned out wonderfully. The rolls were soft and fluffy after steaming. Mmmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel"
},
"reviewBody": "I've made it once and it was perfect. Yes, I had to use more flour than the recipe asked for but that is not enough of a problem to rate it down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spanishfruit"
},
"reviewBody": "I've been using this recipe for a long time and it makes the perfect steamed buns. I've used it to make buns and garlic twists too. It's my go to base recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shernaz"
},
"reviewBody": "Very tasty. The bread was also great. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crowefoot"
},
"reviewBody": "Great recipe for Bao. My wife loves steamed buns and this dough works great for all kinds: pork, vegetable, pretty much any kind of filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tinna Helgadóttir"
},
"reviewBody": "This was awesome! I have never made steamed buns before, but I liked these a lot! Put in 1/2 cup of warm milk instead of water per other reviewers suggestion. \n\nFilled them with leftover pulled pork, scallions and cilantro. Served with lettuce and hoisin sauce. Didn't have a bamboo steamer, so just used a strainer lined with wax-paper. They were fluffy, soft and delicious! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen Pizarro"
},
"reviewBody": "Great recipe. Be prepared to tweak the recipe. Like the other reviews, I had to add extra flour too. However, you can refrigerate leftovers and reheat in the toaster oven for a few minutes.\n\nI also tried this recipe with pork filling, it wasn't the prettiest, but it tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Justin James Morgan"
},
"reviewBody": "Not bad. I got a craving for pork buns, but there aren't any places that serve them where I live. So, I set out to make them myself. Most of the issues that I had were my own fault so I won't complain about them. The only complaint I have, therefore, is that this recipe doesn't say when to add filling. luckily for me I read many versions of the same recipes and had a general idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sss6788426915084"
},
"reviewBody": "This is a great recipe! I altered the recipe a bit and used half whole wheat flour and half bread flour, and also added about a cup of raisins throughout the bread that I presoaked in water instead of using a meat filling. I used my bread machine to do the initial kneading and proofing, as well as the second 5 min knead. I then rolled out the portions, placed them on squares of wax paper, and let them double in a microwave (not turned on) along with a cup of steaming water with the door closed for 30 min before I steamed them in a large pot. The result was the softest and possibly most delicious batch of steamed buns I have ever eaten - much better than store-bought! I plan to come back to this recipe again and make more in the future with different kinds of fillings. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliet Fiss"
},
"reviewBody": "This dough was wonderful and light. I used King Arthur Flour and followed the recipe exactly. I filled these with a mix of: scallions, ginger, garlic, egg, potato starch, soy sauce, and white pepper. I served with a dipping sauce of: soy sauce, vinegar, sugar, ginger, and scallions. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith Bihler"
},
"reviewBody": "DO NOT ADD MORE FLOUR. \n\nYes, it's a very sticky dough, but that doesn't mean it's unworkable. The key is to coat your hands in oil while handling it. The point of a very wet dough with high baking powder and high sugar is a very light and airy sweet bread.\n\nI personally steamed flat circles and used with with an orange spicy sweet bbq chicken &amp; cilantro. In the future I'll make the full buns, it was a little messy (but delicious!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin Moore"
},
"reviewBody": "This was a very simple recipe for the buns I had been wanting to make for a long time. I put red bean paste in mine. My boyfriend said they were very good and wants me to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimpk"
},
"reviewBody": "Love it. Made it successfully at the first time. It's airy soft dough that tastes just like from China Town. I can't wait to make some more. Thanks for sharing some tips you deviate the recipe. I manage to steam 12 buns finally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Calturtle13"
},
"reviewBody": "I followed this recipe exactly (using the warm milk instead of water). The texture was PERFECT and airy and light but the flavor wasn't as sweet as in used to and it was overly yeast-y. The yeast flavor was just too much for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Sieghartner"
},
"reviewBody": "I love this. I put bbq chicken or pork in the middle and steam. It turns out awesome. My kids love it and call them stuffed sandwiches. :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "B?o Linh Le"
},
"reviewBody": "Great recipe - first time I've made Banh Bao (I took a Viet twist to this - viet-seasoned pork, boiled egg, and shallots) and loved the texture of the dough after steaming. Definitely used more flour than the recipe called for -added an extra 1/4 cup like other reviewers had suggested, and still probably another 1/4 cup in kneading the dough because it kept sticking to the surface of my board. Added an extra tablespoon of sugar for a bit of a sweeter taste. With the amount of dough I ended up with though I was only able to make nine medium-large Bao, not nearly 24. All in all a great (long) experience."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda"
},
"reviewBody": "If you live in Nepal, India, or a country around that area try using a momo maker and it's super easy. This recipe sounds hard but it's not! Just give it a try!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joe Rabon Jr"
},
"reviewBody": "The dough was great, but the filling was not my favorite. Maybe it was just me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ElleElle"
},
"reviewBody": "What a great recipe! I am now steaming my second batch (the bamboo steamer only takes 4 at a time) and have just eaten 2 buns which I filled with vegetarian filling. This batch only made 12 but that's because I made them pretty big. I've uploaded a photo which compares the pre and post steamed buns. They are brilliantly fluffy! The only downside is that I couldn't get them white like the restaurants despite adding lemon juice to the dough. Maybe I didn't add enough? I didn't let the dough rest for 3 hrs, only 2. I did what another rater suggested and put some warm water in a bowl underneath the dough bowl. Would make this again but will double it as is clearly going to be finished quickly and can be easily frozen ready to be steamed and eaten next time. Thanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leann Thompson"
},
"reviewBody": "These disappear faster than I can make them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "gianni"
},
"reviewBody": "Followed the metric measurements exactly for a half batch. Dough was way too wet and sticky. Instead of adding flour I went with what it was. It rose but collapsed catastrophically and got even more sticky. I just tossed the whole lot out without even trying for a second rise. It was clearly a wrong recipe. Unfortunately, I did not read the poor reviews first or I would have seen what I was experiencing before having to experience it. This is the second asian AllRecipes recipe that has failed me. I do not think I will attempt another."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniella Baroni"
},
"reviewBody": "Very nice. I live in China, and gave my husband and a friend of ours a taste. They both really liked it. They said it's different from the ones they are used to, which are no sweet at all, but they liked it better. I also used milk. \nI made them twice actually. The first time I followed others' advice and added the baking soda, to counteract the sourness, which really wasn't necessary. I ended up adding it, and then had all these brown spots and strips in the buns. Word of advice, if you add b soda, make sure you knead it in really well...I think that's what I did wrong. The second time I didn't add the soda at all, and it was still great. However, I still kneaded in the baking powder really well. It turned out great. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mazzerb"
},
"reviewBody": "Delicious the best bun recipe, but maybe needed a bit more sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pooch656"
},
"reviewBody": "This recipe makes buns exactly the same as my favourite restaurant. I found the recipe to be perfectly fine the way it is, although just in case I added a pinch of baking soda along with the milk (instead of 1/2c water) and flour to ward off any sour taste (not that I noticed any). I also added an extra teaspoon of sugar, the reastaurant I like makes their bun dough quite sweet. I did a couple plain as testers and the rest I filled with cha siu pork. They were light and fluffy, and slightly chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bctabby"
},
"reviewBody": "Great! A lot of work but taste really good. For the filling, I used the Chinese Steamed Buns with BBQ Pork filling from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wulfs"
},
"reviewBody": "I kneaded the dough until it looked shiny and elastic but I think that made the buns too dense in the end. I'm also not a fan of the flavor - too bland for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Haslam"
},
"reviewBody": "Trying to teach my kids different cultures and made this for the Chinese New Year. It was a process but, worth it! The whole family LOVED them. Thank you for a great homemade recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NambyPamby"
},
"reviewBody": "Yes this tasted good and it came out nicely - but it took 4.5 hours to make from start to finish - which was just more time than worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "Turned out perfectly, just like I've had at restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Just made this today and its not bad. Dough needs to be a little sweeter and i used 1/2 cup of milk instead of water. Next time will add more sugar and a little more salt. I compared this to the dough package from the store where you just add half cup of sugar and one cup of milk. Same texture as the store except the store brand is sweeter and not as bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Ginn"
},
"reviewBody": "I made this recipe last night, and was really impressed! I normally do not have any luck making yeast breads, but this was very easy. The buns turned out very fluffy and delicious. I split the dough into 12 parts. But after steaming them, I probably could have made more like 18 or 20 because there was a little too much dough compared to meat. I also would have not turned them onto the seam when cooked them, they didn't look as nice as the ones at the restaurants. I followed the recipe exactly as written but made my own BBQ pork filling. This recipe is a keeper, and next time I will experiment with different filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Manda&Anna"
},
"reviewBody": "After reading all 106 reviews, I decided to try this recipe, with my own filling and whole wheat flour. I started as the recipe stated, but I think a 1/4 cup of wheat flour was too much, because it became very, very thick. I added more warm water. Though the bag of flour did state to only use 25-50% of what was called for in recipes using APF, I found that I ended up using about the same amount as this recipe calls for, which makes sense since most of the more lengthy reviews said they had to use between 1/4 c. - 3/4c. more. The dough was still very sticky, and I couldn't get it smooth (may have been the flour), but I let it rise for 2 1/2 hours as the recipe stated. Since my goal was to create a healthier version of the steamed buns I used to get at the Hong Kong Market in New Orleans, I only got about 7 buns out of this, and they weren't as big as I would have liked. During the second rising, they didn't appear to rise at all, and they only rose a little while steaming. This might have been me, I may have over kneaded them. However, I found that while filling them, the dough was elastic enough to allow me to pack it in, and using a spoon to get the edges thinner than the center was a good tip! I also added some vinegar to the water before setting the buns to steam, which I think kept the buns sweet. A tip for those using steam plates: I put mine in a large pasta pot and sprayed it with cooking spray, rather than using wax paper squares. It worked perfectly, no sticking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Espeut"
},
"reviewBody": "This recipe really only makes 12 stuffable buns. If you get 24, i still never got more then 20, they are incredibly small even after allowing them to rise. if you don't intend to stuff them then you will not have an issue. I agree with other reviewers, adding more sugar does help. Generally a good start off recipe and easily adjusted to suit your needs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nbradr"
},
"reviewBody": "Even though this was a little time consuming, I had a day free, so I made them. They turned out great. I had to makeshift a steamer because college budgets are limited. These were so fluffy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LilPop"
},
"reviewBody": "Not bad but not the perfect recipe for hum bao bun. The dough was very sticky and difficult to handle. I had to add 1/4 + cups flour to handle dough. I also added extra sugar (1tbs) and it still didn't taste sweet like at dim sum. Thanks anyway, will continue to experiment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra Duffy"
},
"reviewBody": "I read somewhere that you can wrap the bamboo steamer cover in a small towel before putting on top for the 15 minute steaming and that will stop the condensation dripping on the buns while they steam. You can use any kind of meat or dessert filling. A BBQ pork or shredded coconut in a custard, etc. THAT IS MY FAVORITE....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M&M"
},
"reviewBody": "The best ones I have ever made and had. Don't need to leave the buns in the steamer too long at all. Too much steam (moisture) will ruin the outside texture of the buns. I did not add the 1/4 cup flour with the yeast. It turned out perfect though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "This recipe produces very traditional and homely steam buns. It is a little different from what I am used to and I am wondering if rice flour can be used instead of all-purpose flour or a combination would work to produce the white fluffy steam buns I get back at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOK"
},
"reviewBody": "Very good. After I made this recipe for many times, I figured out the easiest way. I mix the first 4 ingredients together first but don't have to let it stand for 30 min. Keep adding all the rest of ingredients and kneed. Devide the dough into 6-8 pieces (depents on how big you wanna make a each bun) and stuff with meat etc. Now let it stand for a while until the dough is doubled in size. Then steam for 15-18 min. depends on the size of the bun. It's easier and tastes the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason O'Hara"
},
"reviewBody": "OUTSTANDING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chocolots"
},
"reviewBody": "Pretty good recipe but still not as fluffy as I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debiscooking"
},
"reviewBody": "I did two batches of baos. I added water and the exact sugar amt. the recipe called for in the first batch. I replaced water with milk and added 4 table spoons of sugar in the second batch. The second batch turned out to be more fluffly and closer to the original baos I had from home (Taiwan). For fillings, I seasoned some grounded beef and finely chopped green onions with sesame oil, white pepper, soy sauce and salt. To be adventurous, I also use italian sausages for fillings too! To make some sweet treat, i melted some chocolate chips and spread it onto a flat dough and rolled it up to make a chocolate buns! They are all very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NicoleS"
},
"reviewBody": "So cool and easy to cook rolls this way and very soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tbehan"
},
"reviewBody": "Great recipe. Had to add a little more flour to make it work for me, but I loved it. Very soft and fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xshadowdancerx"
},
"reviewBody": "first attempt ever making steamed buns. turned out more or less like they do in store. pretty fine :]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akey"
},
"reviewBody": "Wonderful. Just like the ones I have when visiting Japan and when I lived in Hawaii. My brothers continually ask for them, even the littlest one and he doesn't like anything but cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CYGA"
},
"reviewBody": "The bread was perfect! One star off because I don't see how you could get 24 decent sized buns (mine ended up the size of golf balls)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Pixxxie Pie"
},
"reviewBody": "AWESOME RECIPE. The tips left by user Mukinsvivi ROCK &amp; helped me ensure my steamed buns came out ultra tasty. NOTE: the dough does look very odd after first rise &amp; it has a very sticky texture. You can punch it down just like the directions say &amp; Mukinsvivi's advice to add about 3/4 cup xtra flour @ this point is spot on. Didn't utilize the entire 3/4 cup, but I came close. Eye the dough &amp; at some point you know it looks right: the texture is smooth &amp; elastic instead of sticky. To ensure I didn't overdo it, extra flour was added slowly. Adding a bit of lemon juice to the dough &amp; vinegar to the boiling water is also great advice &amp; my buns came out very white accordingly. Didn't use baking soda, but I did use baking powder (it contains baking soda already). My steamed buns came out large &amp; yielded about 12. Prior to steaming I stuffed them w/shredded curry chicken, onions, potatoes, cabbage &amp; bell peppers. My steaming pot is small so it took a while to steam all the buns &amp; they wanted to stick to the steaming plate a bit. Once removed from the steaming plate I found it handy to sit the buns on a simple wrack of bamboo skewers that I placed on top of a plate. This allows bottom of buns to dry nicely. Sitting them directly on a plate gave me a bun w/ a slightly soggy bottom &amp; placing on paper towel = bun w/ paper towel bits stuck to its bottom. Next time I make these I may make them w/ fruit stuffed inside just to see what happens!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "The dough tasted kind of weird. After reading some reviews I did make a couple of changes, I had to add about a tad bit over 1/4 cup flour to the dough. I thought 2.5-3 hrs rise time was way too much and saw that someone suggested 1.5 hrs. My first rise I did for just over 1.5 hrs, rose very well,but also deflated very well after touching it. I thought breaking the dough down to 24 was way too small, I only got 12. The 2nd rise was 30 mins, and they were decently sized....but again, as soon as I touched it, they deflated a little...and never rose again during the steaming. The recipe is simple, but yet it takes so long. I'm not sure I would try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Willbaby0805"
},
"reviewBody": "Great recipe! My buns turned out very light, but still with a little chewy texture, which I like. I agree with ball the other posts about needing more flour before I got a workable dough. But the timing tips and everything else was just spot on. Although I would advise coving your doug when it is proofing with a slightly warm and damp cheesecloth just to prevent it from drying out! Great results though, I made 16 nuns or so, and my three year old furnished them in one go.. I only got a little piece!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koopin"
},
"reviewBody": "Wonderful recipe! I used warm milk instead of water and had to add a bit more flour, but everything else was perfect! I don't know if there is a person alive who likes this bread more than I do. Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie Verret"
},
"reviewBody": "I never rate these recipes, but this one was so good and consistently gives me perfect chinese buns that I had to rate it. It was amazing! \n\nAs a twist: baked a meatloaf with lipton soup recipe, then crumbled it and stuffed the bread before steaming. It was AMAZING! Seriously the best thing I've ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirsten"
},
"reviewBody": "So... good! They're good plain, and they're good when you create your own fillings. I made these in the steam basket of my rice cooker, and they took about 15 minutes a batch. \n\nI got some inspiration from other websites, and made a meat filling with sausage (of all things,) scallions, mushrooms, hoisin sauce, and a little oil. Quite good, though I will try the standard pork next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Danni"
},
"reviewBody": "My dough didn't rise enough the first rise and then not at all once I filled them. Not sure what went wrong. I bake bread all the time and don't have a problem with the yeast. I still steamed them and they weren't as bad as I thought they would be but probably won't try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chang"
},
"reviewBody": "I've tried different recipes for steamed buns, this is definitely the fluffiest! I filled mine with homemade red bean paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KokinaGoddess"
},
"reviewBody": "This recipe was super easy to follow and both batches I made came out perfect! It deffinitely took longer to rise because its winter here in WA and my house is knd of chilly but otherwise the dough tasted AMAZING!:) Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefKimi"
},
"reviewBody": "Excellent recipe. I used splenda because I didn't have any white sugar on hand, and it came out too sweet for my taste; I think if I stuck to the regular sugar like the recipe calls for, it would have been fabulous. Followed this recipe and the one for the meat filling to make turkey left over steamed bun... came out fantastic!!! Excellent recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte"
},
"reviewBody": "Incredibly delicious! Used meat filling from this recipe, substituting gruond pork instead of chopped! worked well! Will definately make more often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "black cat"
},
"reviewBody": "Yum yum! Doubled everything but the yeast and added some baking soda to the dry ingredients as another reviewer suggested. I filled them with some Teriyaki chicken and got about 16 deli sized meat buns. The texture was perfect- just like the ones at the Asian markets!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Underworld440"
},
"reviewBody": "These were the greatest! Made them just like the recipe above except I used rapid rise yeast so I only let it sit for 15 minutes the first time, an hour for the 2nd rise, and 15 minutes for the 3rd. I used ground pork, chopped garlic, &amp; boiled cabbage for the filling. Used my electric rice cooker to steam them. Very very good i'll use this recipe all the time probably double it next time cuz i only ended up making around 16."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "venymae"
},
"reviewBody": "I hope to make this recipe as soon as possible. The problem is that I'm currently living in the Sichuan province and no one here seems to have any idea what baking powder is...I've described what its supposed to do, and wonder how they make the buns that i see street vendors selling everywhere without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ali"
},
"reviewBody": "I used this recipe to make Bao- the end result was absolutely heavenly. The dough was pretty tough to work with when it came to wrapping the filling (very sticky and easy to tear), so I ended up using more dough than I wanted to make each bao (six large bao total, but it was my first time handling the dough so I forgive myself for using so much :) ) and had to enlist the help of my husband. I also tried a variation on this recipe where I used whole wheat flour instead of white- even though the dough was much thicker and the end result was much heavier than the original recipe, this mixture was still very light for whole wheat dough and easier to handle. The wheat flour additionally gave it a sweeter taste. Both variations were excellent- definitely try this recipe for Bao!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cc"
},
"reviewBody": "I followed the recipe carefully and was not satisfied at the outcome at all. The dough tasted bland, extremely dry, a bit sour and it had a somewhat plastic-type texture as the final product - nothing like the buns served at dim sum or even ones that are purchased at the local supermarkets. I will try this recipe again. But instead of water, I'm using milk all the way (in hopes that it won't be so dry) and instead of using active dry yeast, I think I'm going to use self rising flour because the wait time is a killer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahSweets"
},
"reviewBody": "Everything was just peachy except that I made a few exceptions myself that I should not have done like subsitute yeast with my own concoction and made one cup of flour rice flour... Let's just say It was a tad bit difficult to deal with. But still yummy and we'll definately be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zhouxiaoyu"
},
"reviewBody": "Love this recipe! The measurements in the recipe worked for me, I didn't change anything and the buns were light, soft, and fluffy. Perhaps I live in a drier area than some of the other reviewers who needed to add more water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sopenia"
},
"reviewBody": "Great versatile recipe. I get 8 buns from this recipe; I tried to double the recipe to get more buns but it doesn´t work. By the time I get to steaming the last batch or two, they´re over-proofed, giving them a bland flavor (sugar turned to alcohol) and poor texture. The buns freeze well; just re-steam them until soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie-One Love"
},
"reviewBody": "A lot of work but well worth the effort. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaaae"
},
"reviewBody": "These buns were perfectly fluffy and delicious. I didn't change anything in the recipe, but I paired the buns with some improvised chicken. I shredded chicken thighs and cooked them in hoisin sauce, where I added HBI garlic and soy sauce, then strained it. It was a delicious combination."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hoondogs Personal Chef Service"
},
"reviewBody": "I baked these instead of steamed. They were at 350 for about 30 minutes. Prior to baking I put an egg wash on them. Once I pulled them out of the oven I put a tablespoon of honey on top and brushed it around. They were very good. I am going to cook them again but at a little higher temp to see if I can get them even crisper. Filling was of my own creation of smoked pork butt and sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Emily M"
},
"reviewBody": "Tasted good but was not like any bao I've ever had before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Dao"
},
"reviewBody": "easy to make and extremely delicious! used milk instead of water and added an extra teaspoon of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BDOLIM"
},
"reviewBody": "This is the good stuff! Just like you get at the teacake places."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bea"
},
"reviewBody": "This recipe was exactly what I was looking for. It came out texturally perfect, and delicious. I did have to incorporate a bit more flour, as the dough tended to be somewhat sticky. It had no discernible effect on the product. The buns were a hit, and next time I do intend to double the recipe, as they disappeared, literally, in moments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Wow, this is incredibly authentic, and one of the easiest bun recipes I have ever prepared. I added a little more flour (1/4 cup), enough so that the dough was not so sticky. For those who complain the dough is too wet - just use common sense and add a bit more flour until the dough is not sticking to the sides of the bowl - the final steamed bun will not taste any drier/denser because of the added flour. I made 24 filled buns (in accordance with the recipe), and they turned out the size of a slightly flattened tennis ball (there was about a tablespoon of filling in each). Anyone can make this - I rarely work with yeast and so was a bit nervous, but the instructions are very clear and the product was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Wanda"
},
"reviewBody": "PLEASE, PLEASE, PLEASE do not use this recipe. I made this thinking it was the correct dough. There seems to be not enough flour in it and makes an awful dough. Too sticky and not worth the time. I am a professional chef and was not pleased with the product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taminara Marjadi"
},
"reviewBody": "I wish the bun is a little bit sweeter. But despite my own doubts looking at it, the taste after the steaming is done is PRETTY GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty Crocker"
},
"reviewBody": "This was enough to satisfy my craving, but keep in mind it's not exactly dim sum quality. The dough is very sticky, and I had to almost double the flour. Personally, I don't mind if it's not super white because it really comes down to the flavor. I might try this again if another craving hits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "myning"
},
"reviewBody": "THANK YOU SOOOO MUCH!!!!!!! I live on Oahu and was at Shirokiya's where they had dim sum demonstrators from Japan, I had a BAO that was yummy so I wanted to get the recipe because the taste/texture of this is so traditional but unfortunately, none of the restaurants here cook like this, I came upon your recipe, tried it, and it is just delicious!!!!!!!!!!!! i just have a question, if i was to put a filling in it, would it still rise? thank you for the recipe...i love it, i'm going to try it with whole wheat flour today...i am so grateful, i'm not the best cook in the world and if a recipe doesn't come out, i give up and don't cook for a long time, i'm so happy with this recipe that i am making it again today!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saralovesfood"
},
"reviewBody": "This is the very first recipe I've made using the nifty little bamboo steamer that I picked up at ross for $7 bucks - yeah! I made a bbq chicken filling, and let me just tell you that the bun was super soft and scrumptious. I'm going to try red bean buns next time. I was a little worried when kneading the dough because I ended up with a sticky mess... eventually I added about 2/3 cup more flour and that made for an easy to use, \"doughy\" consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aegibear"
},
"reviewBody": "Everyone lOVed it! I used warm milk instead of water,added a little more flour (didn't measure but just enough for it to be easier to work with), and added about a teaspoon of sugar. Made my own chicken curry filling with chicken, carrots, onion, and potato all chopped very small. it was aWesOme! Such a great recipe.. You can play with the fillings and make it your own!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "My Chinese Steam buns turns out GREAT! but here is a little Tip may help if your buns turn out little yellow color, you can add a tespoon or two of vinegar into the water, before you place any buns into the steam pot, and yes dont let any water drip onto your chinese buns. Good Luck Steaming..."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7011/chinese-steamed-buns/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7011/chinese-steamed-buns/",
"name": "Chinese Steamed Buns"
}
}
]
}
}
, "about": [
]
}
]