				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chinese Spareribs"
,"datePublished": "2019-07-10T02:54:25.000-04:00"
,"dateModified": "2022-12-07T15:25:19.000-05:00"
,"author": [
{"@type": "Person"
,"name": "IBNSHISHA"
,"url": "https://www.allrecipes.com/cook/1216441"
}
]
,"description": "These Chinese spareribs are marinated in hoisin, honey, soy, sake, and rice vinegar, then baked until tender and delicious with a tangy-sweet glaze."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GtBu39aW906FtBvcCcjXHq7njqs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/868083-afc9073b34544c70ade58434e2d79575.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5437993262001",
"description": "Skip the takeout for fabulous home-crafted flavor!",
"duration": "PT53S",
"name": "Chinese Spareribs",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2783f17c-57be-4fc3-b288-4351f77de530/e497ea4e-e645-4395-8315-3ec88704100a/1280x720/match/image.jpg",
"uploadDate": "2021-07-02T09:15:33.056-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chinese Spareribs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "128"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "503 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "121 mg"
,"fiberContent": "1 g"
,"proteinContent": "30 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1015 mg"
,"sugarContent": "18 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"3 tablespoons hoisin sauce",
"1 tablespoon ketchup",
"1 tablespoon honey",
"1 tablespoon soy sauce",
"1 tablespoon sake",
"1 teaspoon rice vinegar",
"1 teaspoon lemon juice",
"1 teaspoon grated fresh ginger",
"0.5 teaspoon grated fresh garlic",
"0.25 teaspoon Chinese five-spice powder",
"1 pound pork spareribs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together hoisin sauce, ketchup, honey, soy sauce, sake, rice vinegar, lemon juice, ginger, garlic, and five-spice powder in a shallow glass dish. Place ribs in the dish and turn to coat. Cover and marinate in the refrigerator for 2 hours or up to overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Fill a broiler tray with enough water to cover the bottom. Place the grate or a rack over the tray; arrange ribs on the grate."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GtBu39aW906FtBvcCcjXHq7njqs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/868083-afc9073b34544c70ade58434e2d79575.jpg"
}
]
,"text": "Cook in the preheated oven on the center rack for 40 minutes, turning and brushing with marinade every 10 minutes. Let marinade cook on for final 10 minutes to make a glaze. Finish under the broiler if desired. Discard any remaining marinade."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT165M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tabithagray926"
},
"reviewBody": "I loved this recipe and I have been making these fof a long to d and I did change it up a little bit .. so instead of the hoisin sauce I used honey and I made thesauce thick and I literally just through it the oven at 400 it's pork .. and I covered it with tin foil and just let it for a couple of hours and it came out juicy and falling off the bones so good .. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ecarrabine"
},
"reviewBody": "Easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Lynn Sherry"
},
"reviewBody": "EXCELLENT...must keep basting...and i followed step 2 of placing in broiler...recipe didn't specify so i put on bake at 325 as directed but to get glaze at end, i broiled and kept turning them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen NY"
},
"reviewBody": "I will never buy ribs from my takeout place again. (Sorry Lucky Inn). The recipe is relatively easy with ingredients available from my local supermarker. \nI used Mirin instead of the Sake and par boiled them before marinating them. I didn't use the water/pan but baked them and finished them off under the broiler. Fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clifford Punchard"
},
"reviewBody": "The ribs taste great. Will try BBQ next time and add some spicy heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V Velthaus"
},
"reviewBody": "I made these for a small gathering with my husband's cousin. Rave reviews. Definitely will make again. The only thing I did different was use one clove garlic more. Yummy. Thx!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlena Rivett"
},
"reviewBody": "I will definitely make these again. I doubled the recipe to make enough for two racks of ribs. I added a tsp of chili flakes and 2 tbsp of corn starch. \nAlso, I included 4 pieces of zucchini cut as a 1\"x3\" rectangles in the marinade and these took on the flavors wonderfully. Tofu would also make a logical vegetarian substitution."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ravioliollie"
},
"reviewBody": "Made these last night along with Thai Brussel sprouts. Kind of a fusion meal, but both were very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary C"
},
"reviewBody": "I loved the taste. But I did modify a but. I added a little food coloring of red and orange for traditional Chinese restaurant style look and 40mins of cooking was not nearly enough. It was still raw on the inside. After I cut it, I still baked it an additional 40 mins while still turning and glazing in between turns. Came out to be medium rare (145°) which was perfect for me. Next time I will probably up the amount of honey and a dash more of five spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whammo"
},
"reviewBody": "These are terrific! First time I made them as soon as I got a whiff of the marinade's aroma I tripled the recipe and went and got more ribs. It was straight forward and the results were crowd pleasing and delicious! One of the best aspects was that they were not greasy as is often the case with Chinese take-out ribs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grady"
},
"reviewBody": "Used on beef short ribs. So I coated raw ribs with 5-spice and let sit for 5 hours, and left the 5-spice powder out of bbq sauce. Wrapped ribs in foil and cooked at 250 for 5 hours, then took out of foil and coated the ribs with the bbq sauce and placed in 350 oven for 15 minutes, took out re-coated with bbq sauce and back in oven for another 15 minutes.\n\nBest short ribs ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junnet Pascua"
},
"reviewBody": "I followed exactly what it said and family loved what I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya M. Price"
},
"reviewBody": "This dish was too simple to make to be soo good!!! I will definitely be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronni"
},
"reviewBody": "This is delish! It is one to make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BridgetB"
},
"reviewBody": "I followed the recipe exactly and it came out great. The marinade is full of flavor and the meat was cooked very nicely the recommended time. I thought about doing it in my electric smoker next and I think it would really set this recipe over the top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Orzechowski"
},
"reviewBody": "Everybody from Grandpa to baby loved it. I put the ingredients in a crock pot the night before except the ribs which were in the fridge. Put the ribs in, in the morning and put it high for about 3 hours then chopped some green oven on top for garnish and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "Kinda of disappointed. We had a little over 3 lbs of spareribs so used ingredients accordingly. That to me was a mistake because it made way to much sauce. We did marinate overnight which we usually do so no problem there. Had to eventually turn the oven up to 350 but the ribs still came out tender &amp; juicy. Warmed up &amp; used more leftover sauce on the ribs tonight &amp; were actually better than the 1st night. I was willing to try again but use less hoisin sauce &amp; ketchup because I thought it was to heavy on the taste, but hubs said no to delete the recipe. If I could give a thought, I'd keep with the ingredients as is &amp; don't increase for the weight of the ribs within reason. My ingredients list was for 1 lb of ribs &amp; we had just over 3 lbs. I really felt it was a waste of sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Berard"
},
"reviewBody": "These were fabulous ribs. I tripled the recipe. After marinading overnight I Covered with foil at 350 degrees for two hours. Reduced marinade to a glaze, uncovered ribs for a half hour at 350 a basted frequently. Raised oven to broil, glazed again and broiled for four minutes. Glazed a final time and served"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penelope Soddy"
},
"reviewBody": "Loved it! I doubled the hoisin sauce (because I like it) and doubled the 5 spice(my husband likes that). Marinated it for 6 hours and then cooked it covered at 350 F for 40 minutes, uncovered and cooked it a further 40 minutes at 325 F. The ribs were soft and juicy and not falling off the bone - we like to gnaw them! Perfect. Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "A delicious sauce that is as good as any restaurant's house sauce! A rich a deep flavor of sweet, sour, and salty that go with a well cooked bit of meat on a bone that really makes the labor intensive cooking worth every minute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Lucchesi"
},
"reviewBody": "Fantastic!! I followed the recipe exactly, put it on the traeger at 375 degrees for 1 hour 20 minutes, then a quick 5 minutes of basting! Perfect, will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nigel B"
},
"reviewBody": "Added Star Anise and Chili flakes with a sick of cinnamon for the marinating.\nI like the idea of using the broiler; it had been sitting around for awhile, and now I have a use for it. \nA great and simple recipe that is so rewarding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Coates"
},
"reviewBody": "This was very good. I didn't have sake so added more rice vinegar. I just put the ribs on a foil lined baking sheet instead of a broiler pan. I did double the sauce. Next time I would cook them longer as we prefer to have the meat almost falling of the bone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Robertson"
},
"reviewBody": "Easy recipe and great results praise even from the grumpy teenager so I will be making this again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nik"
},
"reviewBody": "Incredibly easy to make. Made them multiple times as a starter for a dinner party or for nibbles at a BBQ and everyone loves them. When there's a party and serving timing isn't clear, I place tinfoil over the top and leave them in the oven to cook the meat down, then remove the tin foil to thicken the sauce when we are close to serving. Springs onions are a must to throw over at serving time as they contrast beautifully with the sticky ribs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nan Bread"
},
"reviewBody": "Good recipe and hoisin is the prime ingredient when making Chinese ribs, but if you want them to taste like the do from the takeaway, or restaurant, then you need to add a ridiculous amount of sugar. These recipes never tell you how much sugar you need to add to get an authentic taste, but you really want a cup or more for something like this recipe. Just keep adding sugar until it tastes right, you probably won't believe how much sugar you have to add, but that's the rub. Chinese rib sauce at it's core is basically hoisin sugar syrup. You might want to thicken it a little with cornstrach/cornflour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "Turned out well, tasted great, although not exactly like a Chinese BBQ house, which is what I was hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cpoole"
},
"reviewBody": "Good recipe. Enjoyed by the whole family (which is unusual). As recommended, I put it in the crock pot for a few hours. So easy!\nI think next time I might add just a touch of hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I took almost all of the reviewers suggestions, I added a dash of fish sauce, ginger paste, garlic (a lot). Cooked the marinade and used it on the ribs before I put them under the broiler for 5 mins...EXCELLENT. Served with pork fried rice and sauteed snow peas. Good saturday night in house take out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erich J"
},
"reviewBody": "Amazing! Marinated 18 hours in freezer bag and cooked in crock pot for 6 hours on low. To the marinade recipe which I doubled, I added 1 tsp sriracha, 1 tsp toasted sesame oil, 1 tsp liquid smoke, 1 tsp fish sauce, and 1 chopped shallot. Put the marinade in crock pot with the baby back ribs and then used the marinade as a sauce over the ribs and jasmine rice for final dinner presentation. Ribs were fall-off-the-bone delicious and the marinade/sauce was absolutely outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robin Millard"
},
"reviewBody": "I wasn't that impressed. I did use spare ribs. I marinated over night and I put on the BBQ just to get some grill marks and then finished in the crockpot for 5 hours. I double the sauce and I used half for marinade and other for crockpot. Ribs had way too much fat. Next time i will use baby backs. Also sauce burned at bottom of crockpot so next time I will add 1/2 cup of water or chicken broth. The ribs did come off the bone easy so all good there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cltncook"
},
"reviewBody": "Good. However, I followed the recipe but felt there was a little too much of something, and I think it was the soy sauce. You really don't need it with the Hoisin. I think next time I will sub water for the soy sauce, or just leave it out; and whiskey for the sake. I subbed sherry for the sake this time per internet recommendation. Made a double recipe for a little over 2 pounds of spareribs and added a 1/2 tsp. of sesame oil (personal preference). Marinated overnight. I did NOT follow the baking method for this recipe so I cannot rate it. Instead I used a method from a reviewer, Button Love, from Hawaiian Spareribs on this site. I baked the ribs, without a rack, on a foil lined pan, tightly covered with foil, for 1 hour and 15 minutes at 350 degrees F. I then removed the ribs from the pan, drained the grease and drippings, and then returned the ribs to the pan, poured the marinade on top, after cooking on stove top for about 5 minutes, and put them back in the over for another 35 minutes. They came out tender and chewy and perfectly coated with a baked-on sticky sauce. I recommend trying this baking method. It was easy and perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomiKimi"
},
"reviewBody": "I was missing sake and Chinese 5 spice, but had everything else and it still turned out delicious! I tripled the recipe and used it to marinate a little over 5 pounds of boneless pork ribs for about 2-3 hours. I then used the sauce for basting as they were grilling on the BBQ. I will definitely make it again, I've already purchased the missing ingredients. This one's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitchell Williams"
},
"reviewBody": "I have been trying to make Chinese ribs like the ones back home in Detroit and these come pretty close, next time I hope to perfect them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoeJ"
},
"reviewBody": "I followed the receipt ingredients exactly. I baked the ribs for 40 minutes in the same dish I marinated them in. They turned out perfectly. My husband raved about them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "con207214"
},
"reviewBody": "I loved this recipe, just perfect. I subbed the Saki with dry vermouth because I had it on hand. I also baked a little different to suit my need. The seasoning was spot on. Thank you for this delicious Rib recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dominica Michele Gonzales"
},
"reviewBody": "Was very good and easy to make I marinated mine overnight hubby said might be too long but I love that Hoison sauce yum yum yum! Gotta just try it to believe it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liza"
},
"reviewBody": "This was really tasty. I baked them in the oven in a tin for a few hours till the sauce got carmelized and the ribs tender. The taste was just like a Chinese restaurant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosalind Brazel"
},
"reviewBody": "Really good and fairly easy recipe. These were hearty, tasty and different from the dozens of other rib recipes I've tried. I cook a lot of Asian dishes so all the ingredients were in my cabinet. I did make one substitution -- mirin for the rice vinegar, just because of personal preference. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I did not follow the cooking instructions, so I shall not comment on those, but the ingredients did make a wonderful marinade!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I did not follow the cooking instructions, so I shall not comment on those, but the ingredients did make a wonderful marinade!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TxLady2"
},
"reviewBody": "Excellent as written, followed the ingredients exactly but used a foil lined pan instead of a broiler. Don't leave out the hoison or the 5 Spice, they make this dish. Restaurant (GOOD restaurant) quality results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cal Gal"
},
"reviewBody": "The spareribs were awesome. I was worried that 40 minutes cooking time would not be enough but it was. I like my ribs tender but NOT falling off the bone and these were exactly right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mellissa Lee"
},
"reviewBody": "Really, really good marinade. The only thing I would do differently next time would be to perhaps try to make this in the slow cooker so that you get tender, melt-off-the-bone ribs in gooey gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Z Q"
},
"reviewBody": "Excellent recipe! Tastes exactly like what you get in a Chinese restaurant. I scaled back the hoisin sauce a bit, it seemed like a little much to me, and I just put my ribs right on foil covered pan. Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "I marinated the ribs overnight and the next day I baked them, covered at 250 degrees for 2 hours. I then fnished them off on the grill, about 7-8 minutes per side. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Cho"
},
"reviewBody": "Delicious! I made it last night for dinner and my husband loved it! I didn't add lemon juice or the 5 spices (didn't have any on hand) but I did put in a bit of sesame oil as someone had suggested and it tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Schiel"
},
"reviewBody": "Found the little rib-lets at a local Chinese market. Closest to the real thing from the Restaurant. Will definitely make again. I didn't have any Sake but I did have some Honey Whiskey. Don't know how much it changed the recipe but it ended up great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WarDogMom"
},
"reviewBody": "These looked great but dried out when left on \"hold\" for guests. I think I expected them to have a sweeter flavor. Love the cooing technique will tweak the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I had a huge package of ribs so I tried two different recipes. This was my favorite of the two. I really enjoyed the taste of the hoisin coming through in this sauce. I did change the cooking method. I baked the ribs in the oven for an hour and then finished on the grill. Served these with baked beans and garlic cheese bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessicarae"
},
"reviewBody": "These were delicious. I didn't have any sake but they were still amazing. I plan on making them again very soon. I added a little duck sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chisoutherngirl"
},
"reviewBody": "I doubled the sauce recipe but left out the sake. Used 3 lbs. of country ribs. Marinated for 3 hours. Cooked them very slowly w/o the water. They were amazing. My hubby asked me to make them again, which I'm doing today. They are juicy and flavorful; that fantastic blend of spices works perfectly. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michel Richard"
},
"reviewBody": "Not to my liking at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lnorto"
},
"reviewBody": "I love this recipe! I do bake them longer than recommended, they come out perfect. Must use the five spice powder or star anise to get the true Chinese rib recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia G"
},
"reviewBody": "This was great! Great for Father's Day. I took advice from comments and added Hickory Liquid Smoke and Sesame Oil. I also couldn't find sake in time, and a local store owner loaned me some Korean liqueur that is similar, and it worked fine. I made 2 racks of baby back port ribs and 4x the recipe, but had to go back and make another batch of marinade to baste the ribs. I also cooked the ribs for 1.5 hours and they came perfectly done. I would make this again in a heartbeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BP3"
},
"reviewBody": "The sauce is great, but a word of warning here: follow the recipe as given. I tried using boneless spareribs and a crockpot (the crockpot per other suggestions I had read; the boneless pork spareribs were, well, a boneheaded idea on my part) and it's just not the same, comes out dry and not very sauce-y. Bone-in only and use the oven method as prescribed. Definitely going to try this again the right way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hope03"
},
"reviewBody": "The marinade is very good. Authentic-tasting. It's true that the Chinese would use rice wine and not sake, which is a Japanese alcoholic drink. The type of alcohol doesn't make a huge difference. I even used ShockTop beer that has an orange-citrusy flavor. Nice. I make a large batch of this sauce and reduce it to thicken for basting and then serving with the rice. I used boneless spareribs that were thick so the cooking time was a lot longer. Finishing under the broiler really makes a nice sticky, toasty glaze so don't skip that step!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "Thought it was ok, but even after marinating and being sure to use fresh garlic and ginger in the sauce my ribs did not seem very flavourful. Very mellow flavour. Perhaps this was how they were supposed to be?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amethystshells"
},
"reviewBody": "these were really good,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Knapp"
},
"reviewBody": "These ribs were so delicious and much better than take out. I broiled them but I think the grill would make them spectacular. I also used fresh lemon juice and grated the lemon peel and added it to the marinade for an extra kick. I was surprised how tender and juicy the broiled ribs were."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "This one's a keeper* Thanks for the great recipe! I made it with fried rice and pork egg rolls"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eriko Ono"
},
"reviewBody": "these were great! i boiled them before marinating as some had mentioned, but i'm going to try without next time. i also didn't have chinese five spice on hand like i thought, so next time i'll add that for sure. i used mirin instead of sake since i didn't have sake either. i cooked them in the oven for about an hour and finished them under the broiler. mine were bone in pork ribs that i cut before putting them on the rack. my kids and husband loved them. i served with japanese white rice and red cabbage with japanese dressing. will for sure make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "misty"
},
"reviewBody": "Made this exactly as written; marinaded for six hours and baked in the oven. The hoisin sauce dominated the marinade too much for our taste. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audreyu8"
},
"reviewBody": "I substituted ketchup for HP sauce. I marinated it for 12 hours in the refrigerator and slow cooked it in my slow cooker on high for 5 hours. It tasted amazing though a little on the sweet side. Next time, I will try adding one more lemon and a little more white wine vinegar. Thank you for the easy and lovely recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ozzynews"
},
"reviewBody": "I did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dlyon"
},
"reviewBody": "These didn't work out for me. They were dry and tough. It may have been that there wasn't enough meat on the bones of the spareribs that I chose. Maybe I should have cooked them less, but spareribs always have to be cooked long in order to have them fall off the bone, so I didn't want to do that. The flavor was pretty tasty though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. Petro"
},
"reviewBody": "My husband &amp; daughter were amazed at how authentic these spareribs tasted. They both thought we were eating spareribs from our favorite Chinese restaurant! I followed \"Betty's\" recipe substitutions/baking methods &amp; could not have been more pleased. Home run!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barblsn"
},
"reviewBody": "WOW!! These tasted exactly like the chinese ribs at my favorite restaurant. Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snoopy"
},
"reviewBody": "perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasonadams29"
},
"reviewBody": "Awesome recipe. I was looking for boneless sparerib recipe like I used to get in NY and this was it. I used all the ingredients except the sake.Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scotty B"
},
"reviewBody": "Awesome recipe! This turned out beautifully! Used the same sauce minus ketchup for a beef stirfry and that rocked as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ttang"
},
"reviewBody": "Great flavour in this recipe. The sweetness of the hoisin. ketchup and honey, and the tartness of the rice vinegar and lemon give great balance. I tripled the sauce proportions and ended up cooking the ribs in the slow cooker for tender, tasty ribs. Thank you for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twigfilly"
},
"reviewBody": "I made two changes: I did not have any sake (I just used more rice vinegar) and instead of pork I used Beef Flanked ribs on the broiler pan. These were great! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allira"
},
"reviewBody": "I followed the ingredient list exactly but used boneless pork pieces rather than spare ribs, and I put the whole lot into the slowcooker and cooked on low for 5 hours. It came out delicious, exactly the flavour I was looking for, with plenty of sauce to go with the rice and veges I served it with. My 3 and 5 year old kids loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GEOTONE"
},
"reviewBody": "I made a few ingredient changes. I used powdered ginger and garlic. Omitted 5 spice powder(had none on hand) added 1 teaspoon of oyster sauce. Used white wine instead of sake (did have any of that in the house either). cook for 2 hours at 300 degrees. I reserved some of the marinade and heated in the saucepan and poured it over the ribs for the last 10 minutes of cooking. Put the oven on broil to brown or throw on the grill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eyecandy88"
},
"reviewBody": "These were good we didn't have the grill so we just cooked them in the oven with a flat pan on bottom.... It worked!!! But this was so delicious very tender and just good with some other chinese fixings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fong Chun Chan"
},
"reviewBody": "Delicious! My spare ribs were actually chopped up so I only had to take 3/4 of the amount of time to bake it. But the marinade was perfect. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "Wow! This comes really close to the stuff you get at a Chinese restaurant. I scaled this up to 10 for 5 lbs. of ribs. I didn't have sake so I used white wine and 1 tsp. of powdered ginger. I boiled the ribs for about 20 minutes first, then marinated them in some of the marinade all day, then put them on the grill basting them a bit. I then finished them in the slow cooker with the rest of the sauce for a couple of hours to get them nice and tender. If you want that deep red color, add a couple drops of red food coloring to the marinade. This stuff is awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Purdie"
},
"reviewBody": "This was good, but it was honestly much too sweet for my taste. I think the next time, I'll omit the honey and add more vinegar for more of a tangy flavor. I really miss the sweet and sour spare ribs we used to eat in Hawaii. I also cooked this in the slow cooker on low for about 4 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawson Li"
},
"reviewBody": "TASTY!!! Great flavors, little bit sweet, salty, and a touch of ginger. Marinated babybacks for 2 hours. Wrapped each slab in foil, allowing enough space for steaming and air circulation. 375 degrees for one hour, 20 minutes. After, placed on grill for 5 minutes per side and basted with extra sauce. The grilling allows some good caramelization of the sauce. You could also broil and flip the slabs similarly after removing from the foil. Great with rice and sauted chinese veggies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staramy"
},
"reviewBody": "My asian boyfriend said these were pretty darn close to perfect! I put them in a crockpot for ~4 hours and the meat was falling off the bone. If you want to do the crockpot method, I recommend to add more sauce, to cover the meat completely, but make sure to leave some extra room for the juices from the meat to fill the rest of the pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "patgal"
},
"reviewBody": "it was o.k. but it was missing something. The sauce had a weird taste to it. Maybe if I add some sugar. I'll have to play with the recipe. Thank you though for submitting it. =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meme"
},
"reviewBody": "These ribs were GREAT! Easy to make and all my guests loved them. I made them ahead of time in the oven and when it was time for dinner I put them on the grill for 5 minutes to heat them up and brown them. I'll definetely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faithxin_Cha0s"
},
"reviewBody": "i tried this last weekend and they were a HUGE hit! I'm making 40 lbs. of it this weekend for a huge BBQ party. I substituted the Sake for Tequila and it still came out AMAZING! Absolutely love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NikkiC"
},
"reviewBody": "I thought this was okay. I found the Cantonese Pork recipe on this site to have a more authentic taste than this. Also, cooking with sake isn't very Chinese, I would use Chinese rice wine (different than rice wine vinegar) instead which you can find at any Asian grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Anne Thomas"
},
"reviewBody": "These ribs had a really good taste to them. I followed the recipe exactly. It was a big hit with my kids, 7,4,and 2. My husband liked them too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JD in DK"
},
"reviewBody": "I used to live in LA where I could get GREAT chinese food. I recently moved to Denmark where the Asian food is awful AND I'm pregnant. This recipe was a lifesaver! I have been craving good Chinese food for weeks. Unfortunately no five-spice in DK, but they were excellent anyway. A little fresh ginger is a nice addition if you have it on hand. Thank you for this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISTICAT57"
},
"reviewBody": "These were great! I used country style ribs and instead of marinating them, I just dumped the sauce over the ribs in my crockpot and cooked them all day. My husband raved about them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "Wow... Unbelievably good. I marinated the ribs overnight (I made 'em with ground ginger as that's what I had on hand), and liberally basted the ribs every ten minutes. I definitely recommend broiling them - they crisp up beautifully. The meat was falling off the bone. Phenomenal. Will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline65"
},
"reviewBody": "As good as any British takeaway ribs if not better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosebud1"
},
"reviewBody": "Wow!! I doubled the receipe,and did a 3lb rack of Country Style spare ribs in the crock pot on low for 6 hrs. they were delicious!! It's the first time I used hoisin sauce,and am now a huge fan. I didn't have any sake,or lemon juice,and I used powdered ginger instead of fresh. It is so simple to make,and it's incredibly Delicious:) This is definatly my new crockpot favorite:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gia"
},
"reviewBody": "i used babyback ribs, the sauce was better then the chinese takeout by far!! Will def make this again, GREAT recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHEFANDERSEN"
},
"reviewBody": "this has become a favorite way of mine to do country ribs in the crockpot....I turn it on for 6 hours and when I come back they are just falling apart...I have also used the meat inside of pie crust to make hot pockets for lunch....it is wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shizambo"
},
"reviewBody": "I often buy the inexpensive pork bones you can find in the pork section to make soup base, so I thought... why not try? Trimmed off the some of the fat and followed the recipe (minus the Chinese five-spice)... the small portion of ribs were wonderful!! Even better the next day, sliced and served cold on top of a hot bowl of ramen"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "Big hit at dinner party!\nI doubled recipe for 8 pork chops and doubled again for 16 chicken thighs.\nCooked 30 minutes covered and then 30 minutes uncovered.\nBoiled and reduced leftover marinade and basted during last 30 minutes.\nFantastic and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "Very tasty - I tripled the sauce. Had to cook about 60 minutes total. Nice sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingCutie"
},
"reviewBody": "I am SO, SO, SO glad I tried this recipe! These ribs were EXCELLENT and I will make them again, and again , and again! I let them marinate for 5 hours and simply baked them in the oven. I didn't bother messing around with broiler pans or oven grates. Thanks for sharing this recipe! It's definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "Wonderful recipe. I parboiled the ribs first and them marinated them overnight. I skipped the water in the pan part. Lined a pan with foil and cooked them at 325 for about an hour and half, basting every 1/2 hour. They were wonderful, fell of the bone. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Henderson"
},
"reviewBody": "After 40 years of cooking, I rarely (if ever) follow a recipe exactly. I did follow this one, with two tiny additions -- I added a small amount of sesame oil because I like the flavour, and a few drops of hickory liquid smoke. I used baby back ribs, marinated them for about 4 hours, and cooked them about twice as long as called for. This turned out fantastically! The flavour was EXACTLY what I was looking for. I served it to raves from picky eaters. Next time, I'll probably make this the day ahead, and marinate overnight to really soak the marinade into the ribs. Thanks so much for this great recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77408/chinese-spareribs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
"name": "Chinese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77408/chinese-spareribs/",
"name": "Chinese Spareribs"
}
}
]
}
}
, "about": [
]
}
]