				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Babka"
,"datePublished": "2020-06-18T23:37:37.000-04:00"
,"dateModified": "2023-01-27T19:25:40.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Lilia"
,"url": "https://www.allrecipes.com/cook/2773487"
}
]
,"description": "The best recipe for chocolate babka. These rolled up bread rings are made from a yeast dough and baked with a chocolate and cinnamon filling."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aVDZW01b7vIpuemfkuplGIoUKYY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8295520-chocolate-babka-Hungrymom13-4x3-1-59d32655494c473db64b526de2b79e7d.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Babka"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "62"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "378 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "75 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "295 mg"
,"sugarContent": "23 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"0.75 cup milk",
"0.25 cup butter",
"2 cups bread flour",
"2 cups all-purpose flour",
"2 teaspoons active dry yeast",
"0.25 cup white sugar",
"0.25 cup water",
"1 large egg",
"0.75 teaspoon salt",
"5 (1 ounce) squares semisweet chocolate, finely chopped",
"1.5 teaspoons ground cinnamon",
"0.33333334326744 cup white sugar",
"0.25 cup butter, chilled",
"0.25 cup confectioners' sugar",
"0.25 cup all-purpose flour",
"0.25 cup butter, chilled",
"1 large egg, beaten",
"1 tablespoon water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare the dough: Warm milk and melt butter in a glass or ceramic bowl in the microwave for 30 seconds, or in a saucepan on the stovetop. Combine bread flour, all-purpose flour, yeast, and sugar. Add water, milk-butter mixture, egg, and salt to the dry ingredients and mix well."
} ,{
"@type": "HowToStep"
,"text": "Use the dough hook in a stand mixer on low speed or knead the dough by hand until the dough is smooth and elastic, about 15 minutes. If the dough is too wet, add more bread flour, about 2 tablespoons at a time (up to 8 tablespoons) to make a workable dough; too much flour can make the dough dry. Cover the dough with a damp cloth and let rise until double in size, about 1 to 1 1/2 hours."
} ,{
"@type": "HowToStep"
,"text": "Make chocolate filling and streusel while the dough is rising."
} ,{
"@type": "HowToStep"
,"text": "For the filling: Stir together finely chopped chocolate, cinnamon, and sugar. Cut in chilled butter with a fork."
} ,{
"@type": "HowToStep"
,"text": "Make the streusel: Combine confectioners&#39; sugar and all-purpose flour; cut in chilled butter until the mixture resembles coarse crumbs."
} ,{
"@type": "HowToStep"
,"text": "When the dough has doubled, punch the dough down and cut it into two equal pieces. Loosely shape each piece into a ball. Cover the dough with a damp cloth and let it rest for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Roll out one portion of dough on a lightly floured surface to form a 15x4-inch rectangle. Sprinkle with 1/2 of the chocolate filling, roll up to form a long log, and seal the seam. Attach the ends to form a circle and place the ring, seam-side down, on a parchment-lined baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Repeat with the second piece of dough."
} ,{
"@type": "HowToStep"
,"text": "Use a serrated knife or kitchen shears to cut slits at 1-inch intervals around the rings. Cover the rings with damp kitchen towels and let rise until doubled in size, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make the egg wash: Combine egg and water in a small dish and whisk to combine."
} ,{
"@type": "HowToStep"
,"text": "Brush the loaves with egg wash. Sprinkle streusel on top. Bake the loaves, rotating the baking sheets to promote even browning, until the bread is a deep golden brown, about 25 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT165M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dsa"
},
"reviewBody": "Made it exactly as written, it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Laubscher"
},
"reviewBody": "I love chocolate babka but it’s difficult to find outside of a good NY Jewish deli. And grocery store babka is too dry. So decided to make it. Very good recipe. I followed it to the letter the first time and really liked it, but... not enough chocolate and layers were too thick with the 4”wide dough. So the next time doubled the chocolate (kept cinnamon and sugar the same as the recipe) and rolled the dough to 15 x 7ish. Piled on the chocolate mixture, pressing it into the dough a bit. Rolled it up, and voila! Moved from good to awesome. Made 3 batches and gave to my neighbors. This will be a holiday staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie Walker"
},
"reviewBody": "Turned out to taste great, not the prettiest but I think that was user error"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Diane Strelser Levene"
},
"reviewBody": "I found this recipe to be just ok. The dough was a little stiff and thick so I had to add extra egg and butter to it. I followed the directions for the amount of flour exactly so I am not sure why it was so stiff. Also we felt like it definitely needed more filling. If I make it again I would double the filling. I have seen other recipes with nicer fillings so I might try one of those in the future. Overall the babka was moist and tasty. But could have been much better with more filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Long Weibel"
},
"reviewBody": "Amazing! Did not change a thing and it came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Da'tiger"
},
"reviewBody": "This recipe is very good, Just needs way more CHOCOLATE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda K"
},
"reviewBody": "I wish it had come out like a braided bread, but i will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyLPC"
},
"reviewBody": "I doubled it and used the bread machine to make the dough. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tikva"
},
"reviewBody": "I've made this a bunch of times and it comes out amazingly every time!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucky"
},
"reviewBody": "Delicious! Mixed dough in bread machine then filled formed and baked. Added toasted pecans &amp; coconut to chocolate filling. Absolutely fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Birchak"
},
"reviewBody": "I added 1/4 C sour cream to pastry and increased flour by 1/4 C. It turned out fantastically."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IUMGRAD2"
},
"reviewBody": "This was wonderful and easy to make. I made extra filling (used Vietnamese cinnamon, and mini chocolate chips instead of chopping) to make sure there was plenty...I used it all. Instead of the 1 egg I used 3 egg yolks. I used scissors to cut the tops after the 2nd rise, that way the filling remained in the ring. The bread wasn't dry at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "virginia o'neal"
},
"reviewBody": "Ive made this for thanksgiving for the past three years because my step dad is polish. the whole family loves it and ask for it every year. I started making it at age 14 so it's not to hard. time consuming but fun"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "There's no recipe lol! Would love to see it :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Do it! Don't hesitate! For something so impressive, it's really not that much work, no fancy ingredients required. The sweet bread is wonderful, not too sweet, and biting into the chocolate filling is a transformative experience :) I did add a little more chocolate, which was fine; but I think doubling it, as someone suggested, would really overwhelm the bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chibiev"
},
"reviewBody": "I used chocolate chips instead of chopping up the chocolate, which worked great. I put the streusel on one and topped the other with cinnamon and sugar. My husband and I preferred the one without the streusel. Next time I would make it with a little bit of sugar sprinkled on top, no cinnamon. Also be sure to roll the dough very thin, because that makes for a thicker middle and you can taste the chocolate more. This was a keeper, although I'll save it for special occasions because of the fat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindybee"
},
"reviewBody": "I have made this several times it's a family favorite. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LDHULME"
},
"reviewBody": "Really liked the recipe and instructions. The only recommendation that I can make is to double the chocolate filling. I had chocolate babka in New York, and there was much more chocolate in it. Next time, I will roll the dough to 15x8 and double the chocolate filling for each. I think that I will also sprinkle it with course sugar after the egg wash and before I add the delicious streusel topping for an extra touch of sparkle and crunch for the top. YUM! I am saving this recipe, just modifying it a bit to make it perfect for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef_niki"
},
"reviewBody": "I made this recipe it is delicious, i highly recommend proofing for as much if not longer a time period than is suggested, i though I could proof for a little less time and mine came out a bit dense. But Still DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hatchling"
},
"reviewBody": "I doubled the filling and thought it was a little too much - but my kids can't get enough. The dough was not too wet at all. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tanyaburrows"
},
"reviewBody": "Very good...i'm partial to the egg wash because it give the bread a the type of crust you would expect a soft pretzel to have but overall this recipe is delicious! I would say with the chocolate it's more of a dessert type bread than breakfast, but it definitely won over my friends and family! I followed this recipe exactly and it turned out wonderfully. I'm going to try it with different fillings next time such as just cinnamon and sugar or maybe some fruit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkhyclak"
},
"reviewBody": "So.Good! I used Nutella in addition to the chocolate mixture just because I wanted more chocolate. I also skipped the streusel topping, egg washed the top and sprinkled cinnamon/sugar on before baking. The dough was so easy to make and handle-I didn't need any additional flour at all. It was definitely one of the best doughs I've worked with in awhile! I took both \"loaves\" to a Bible study group of 12 people and both were gone in less than 10 minutes. Next time I may opt for the more traditional twisted loaf, but these were just fine too! I made my cuts with scissors towards the top and didn't have any issues with leaking filling. My husband, who's Polish, didn't remember having this with chocolate, but with a nut filling instead. I may have to figure out what he's talking about and give it a try as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookworm"
},
"reviewBody": "MMMMMMMMHM!!!! delicious! a tip for preventing the leaking, cut AFTER the rings rise, and instead of cutting the bottom, cut the top instead. *update* Right in the middle of making this recipe, I realized I didn't have bread flour. Used all-purpose flour and it still turned out. Also, to prevent dough from being dry, add about a tablespoon of sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "hotdogelvis"
},
"reviewBody": "This is an interesting way to make babka. I have typically seen it made this way. I have the bakery at my grocery store make it for the Jewish holidays and always ask for extra chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leila"
},
"reviewBody": "I cooked them a little longer than 25 min because the bottom didn't look cooked to me, it looked like raw yeast. I took them out a few times and inspected them....a cooked them a couple more min and they came out perfect!!! Soo yumiii!! I recommend to add more filling....the more the merrier :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerrie Thomsen"
},
"reviewBody": "Really yummy for such an easy recipe! I too added a little nutella on the bottom of the dough, it was wonderful. The loaf was gone so fast, my family ate it and requested more. If you have a kitchen aid, the only hard part is waiting! The dough is super easy to work with, rolls easily. Serve warm, good stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Silver Ghost"
},
"reviewBody": "OMG This is to die for. I used The fleishmans active dry yeast one envelope is 2 1/4 teaspoons, so I used it as is. I let the Kitchen Aid knead for 15 minutes. It made the most amazing dough. I left it on the preheated stove with saran wrap and it doubled nicely. The dough was just a dream. I can see using this with all kinds of fillings, cherry, cream cheese, cinnamon and sugar. when it came out my daughter and husband each had 3 pieces. In less than 15 minutes ONE was gone. It took over 3 hours, the only downer here. The bread was so delish, light and fluffy. I think I might try semi sweet chips instead of all the chopping of squares. Maybe chips with apricot, yum!!! this was a super hit. WELL WELL WORTH THE WORK!!\nShowstopping. Couldnt even get a picture of them, they disappeared so fast. Yeast breads\ncan sometimes be tricky for some. This made two fat little rings that never stopped doubling. But this is a no brainer. WONDERFUL!!! 5 stars for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELAH100"
},
"reviewBody": "Dangerously delicious and not hard to make using bread machine for dough. Thought I had too much streusal for top so only used half, but afterward realized that I could have piled it on and it would have been fine. My only problem is that during baking, the rolled dough separates a bit so there is an air gap underneath the top part of the bread. I sometimes have the same problem with raisin bread, which is also rolled up. Maybe there is a trick to rolling...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Very good, a bit of work but not too bad if you have a KA mixer. Mine wasn't dry at all, nice and moist. I baked them separately, the first came out a little overdone, so I reduced the cooking time by five minutes for the second one, perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANDACOOK1"
},
"reviewBody": "After rolling the dough out, I spread it with Nutella spread and then sprinkled it with the chocolate mixture. It deepened the chocolate flavor. To die for. I opted not to add the topping, and instead sprinkled the rings with coarse sugar, which added a sparkle and a little sweetness. I will be making this again. And again. And again....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "warpy2"
},
"reviewBody": "Wow! It's hard to describe. You really don't taste the chocolate, taste more like a cinnamon bun and Anyone doubting this one should give it a try...surprising delicious, will keep recipe and make again and again. I think this can be made for any occasion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had never had a Babka before despite my Polish upbringing, but gave it a try. My 2 &amp; 4 year olds helped. We used 2 cups white whole wheat flour for the all-purpose flour, chocolate chips for the baking chocolate squares, &amp; sucanat (dehydrated sugar cane juice crystals) for the white sugar. We thought it was good but not spectacular. My loaves baked very well but I would bake the loaves separately next time for better doneness control. One ended up more done than the other despite my rotating during baking and careful monitoring. This recipe inspired me to keep trying heritage recipes, looking for ultimate keepers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smj214"
},
"reviewBody": "Absolutely perfect! A beautiful breakfast pastry with just the right touch of sweetness. I made two \"rings\", and my family ate both in one meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "DELICIOUS! My husband has been talking about it for months since I made it, I will be saving the SECOND time I make it for some special occasion! :) A little more involved than the average recipe, as bread can be, but worth every bit of time. I did double the filling, as another reviewer suggested, and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy's Class"
},
"reviewBody": "This was magnificent! Tasters were beating a path back to our door for more, but we gobbled up any of the extra- it was just that good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thatoneguy"
},
"reviewBody": "Loved making this! Made it the other night for Easter and it was a big hit! It wasn't very difficult to make. The only really time consuming part was waiting for the dough to rise. Going to make some more this weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "recipes need gluten"
},
"reviewBody": "this was good bread, it tasted like choclate cinnamon rolls. I used less flour, also I made one ring with streusel, one without. We prefered it without the streusl as it did not stay on the ring very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GREEN77BUS"
},
"reviewBody": "We loved this bread. I made two yesterday one for my neighbor and one for us. Both households loved it. Ours is already gone. I loved the chocolate but am trying to figure what else I can put in it, maybe Jam or perserves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPA"
},
"reviewBody": "I put all ingredients in bread machine. Came out beautiful. Unfortunately one was sacrificed to a super bowl party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "I only made the dough portion, which I halved for my Zulu King Cake. Dough was very good and easy when made in my bread machine! I also added 1 pouch vanilla sugar and reduced sugar to 1 tbsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bird"
},
"reviewBody": "Wow...this bread tastes amazing! I really thought it wasn't going to turn out because of multiple mishaps on my part. I was also a bit concerned because the recipe calls for just dry active yeast, not fast acting, and the directions don't tell you to proof the yeast. My bread actually didn't rise that much, let alone double in size before punching it down, but I decided to follow through with the recipe anyway, and I'm glad I did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Loved it, and it was a hit! Like an Eastern European Pain au Chocolat. :) This will join regular rotation in my baking and will be a good starting point for other filled breads."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbcmom116"
},
"reviewBody": "Outstanding!!!! I can't wait to make this again and will add more chocolate filling next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Makeuplady"
},
"reviewBody": "This is wonderful. I made some for the first time yesterday. It rich, but not too sweet. I will definitely make this again soon. It's perfect for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Winkatyou"
},
"reviewBody": "This tasted pretty good, especially warm with butter. I thought the consistency was similar to the chocolate chip bagels we get at our grocery store--which wasn't exactly what I was hoping for. But the flavor was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bluebell"
},
"reviewBody": "Rich taste and flavor. I don't bake much and usually nothing this complicated. In fact for a first time making babka it came out pretty good - it cooked evenly throughout - it was just a bit heavy as I used whole wheat flour instead of white/all purpose!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "*Lisa*"
},
"reviewBody": "Very good recipe. It was a little dry, but overall very tasty and different. It reminded me of a cinnamon bun but with chocolate added. MMM...i would make this again. Presentation is very nice for company...i might try using something other than chocolate...could be good with a berry jam filling instead! I used the bread machine to make the dough and it worked very well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hedder"
},
"reviewBody": "My uncle used to make Babka all the time when I was young. I wanted to make it just like him - but this was a bit different. Still, it was GREAT! I made it exactly like the recipe and the only thing I recommend is putting the filling all over the dough. I left about 1/2 an inch on both the right and left and when I connected the ends, it left that area without chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "This bread is delicious! Makes a lovely change from the usual cinnamon buns. It makes two good-sized loaves, so make sure you're feeding a crowd, or do what I did and use the second loaf a day or two later to make a wonderfully fragrant chocolate bread pudding!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/176381/chocolate-babka/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
"name": "Egg"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/176381/chocolate-babka/",
"name": "Chocolate Babka"
}
}
]
}
}
, "about": [
]
}
]