				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Strawberry Shortcake"
,"datePublished": "1999-11-30T21:38:24.000-05:00"
,"dateModified": "2022-09-25T06:43:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Mary Ann Benzon"
,"url": "https://www.allrecipes.com/cook/652"
}
]
,"description": "For an absolutely stunning dessert, spoon sweetened strawberries and whipped topping between layers of homemade chocolate shortcake. Drizzle with chocolate syrup and serve to an awestruck crowd."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/amJMeRyHCsuSbY1BGTx7ODI4lEQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8258721-e2772f8b864c43af9f4901b48e95c5db.jpg",
"height": 1499,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Strawberry Shortcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "57"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "313 kcal"
,"carbohydrateContent": "41 g"
,"cholesterolContent": "22 mg"
,"fiberContent": "2 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "381 mg"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.33333334326744 cup white sugar",
"0.25 cup cocoa powder",
"1 tablespoon baking powder",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"0.5 cup butter",
"1 cup milk",
"2 pints strawberries, sliced",
"0.25 cup white sugar",
"1 (12 ounce) container frozen whipped topping, thawed",
"2 tablespoons chocolate syrup" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C). Grease two 9-inch layer pans."
} ,{
"@type": "HowToStep"
,"text": "In a large mixing bowl, combine flour, 1/3 cup sugar, cocoa, baking powder, baking soda, and salt. Cut in butter until mixture resembles coarse crumbs. Add milk, mixing until just moistened. Spread batter evenly into the prepared layer pans."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 15 minutes, or until a toothpick inserted in the center comes out clean. Cool."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, in a medium mixing bowl, combine strawberries and remaining 1/4 cup sugar. Let mixture stand for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove shortcake layers from the pans. Place one layer on a serving plate; cover with 1/2 of the of strawberry mixture and 1/2 of the whipped topping. Place remaining shortcake layer on top, then remaining strawberry mixture and remaining whipped topping. Drizzle chocolate syrup over top."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "I love shortcake but I don't like strawberry and chocolate so I planned to just make the cake with whipped cream (please make real whipped cream for this). It was fine, but the cake was missing something. It wasn't rich or chocolatey enough for me. Maybe it needed some chocolate added to it, or some more butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "k16"
},
"reviewBody": "I used real whipped cream made with a little confectioners sugar and a very good vanilla extract. This dessert is not too sweet, it’s fresh and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "WOW, this is a good cake! It's phenomenal! The cake itself is chocolatey, and has a nice texture that's somewhere between a cake and a scone. It's fantastic! I did use a 1/2 cup cocoa powder for a stronger chocolate flavor, and buttermilk in place of regular milk just because I had it. It's not an overwhelmingly sweet cake--but that's really a good thing! It pairs perfectly with sweetened whipped cream (I also recommend using the real stuff) and the sweet/tart berries. I forgot to add chocolate sauce--but it didn't matter at all: it was delicious without it! Thank you for the recipe! This one is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SeattleChef"
},
"reviewBody": "Nice recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kari Ardolino Rudgers"
},
"reviewBody": "Yum. Very easy and delicious. I only did one layer and assembled it with the strawberries, whipped cream (I used canned - would definitely make homemade whipped cream for an occasion) and chocolate sauce as I served it. So much tastier than plain shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mrs Z"
},
"reviewBody": "This was bitter and too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShirleyKay"
},
"reviewBody": "This shortcake has a very rustic look to it which i really love! i was looking for a good, basic no-egg shortcake recipe when i found this one with the powdered chocolate added. instead of baking in 2 pans, tho, I baked it in one 8x8 square pan at 375 degrees for about 30-35 minutes. also, even tho it's not too sweet, i replaced a little of the sugar with powdered stevia. i really did love some of the other reviewers ideas as to additional options that might be used, too. anyway, this is going in my recipe file as a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryle"
},
"reviewBody": "Made as directed with a couple changes - made the recipe one and half to insure that I would have enough to serve 12 people. I added a bit more sugar to the batter 1/2 cup instead of 1/3 and put less sugar in the strawberries as they were very sweet on their own. I also added about 1/3 cup of mini chocolate chips. I dropped the dough (approximately 1/3 cup per shortcake) on cookie sheets to make individual shortcakes and used real whipped cream rather than frozen whipped topping. Baked @ 375 for 12-15 minutes until the tops looked dry/cracked. Real hit with the family and will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "basssaman"
},
"reviewBody": "My family loves my regular strawberry shortcake and we all love chocolate so I thought I'd give this a try. It was a hit! I dropped large spoonfuls onto a greased cookie sheet and made 8 individual shortcakes and topped them with strawberries, chocolate ice cream and whipped cream. Really good. The shortcakes aren't very sweet, but aren't supposed to be. Real shortcakes are like biscuits, not cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corinne Murphy"
},
"reviewBody": "Excellent, light shortcake which acts as the perfect base for fresh, local strawberries. The texture is that of a delicate scone. \nI plopped eight mounds of dough onto a silicone sheet lined cookie sheet and baked for 10 minutes, so I could make individual mini shortcakes. I used 35% whipping cream with the sweet strawberries. The hint of cocoa is FABULOUS! Great idea! \nThis receipe is quick, easy, tasty, and is bound to become one of my \"go-to\" summer desserts for years to come - so I thank you kindly for sharing it with us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cloweelya"
},
"reviewBody": "Easy recipe but soooo delicious. My son and I loved it. I did make one adjustment to the shortcake, I added about 2 oz of strawberry gelatine to the step # 2 which make the cake more moist and added more of strawberry taste to the layers. I will be making this again. Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "A nearly identical recipe has been in my family for years. It is a wonderful recipe, but you do have to understand that the cake is a shortcake, not a typical American butter cake. It is not very moist and has only a slight chocolate flavor that really allows the strawberries to shine. I only serve this cake with real whipped cream (flavored with a bit of vanilla), and a homemade chocolate sauce. The chocolate sauce soaks into the cake and the whipped cream compensates for the less sweet cake. All together it is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn Kuhn"
},
"reviewBody": "We LOVED this recipe using Sweetened Whipped Cream from this site instead of Cool Whip. I can't wait to have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LROMSLO"
},
"reviewBody": "People love this dessert, I've been making it for years now and it's a frequent request for gatherings. Last time I make it with margarine and rice milk and it still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "People love this dessert, I've been making it for years now and it's a frequent request for gatherings. Last time I make it with margarine and rice milk and it still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PAMELA D. aPROpos of nothing"
},
"reviewBody": "I scaled by half and added another T of sugar to the shortcake. Used Redi-Whip Chocolate squirt can with strawberries and blueberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "masnmartinez"
},
"reviewBody": "I liked it i used white chocolate instead of syrup, i think that some people are confused on what coco powder is its not going to make the biscuit super sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "This was so good! And it was very simple. I did make my own whipped cream instead of using cool-whip. My youngest son said it was not good it was \"Magnificent\" so I will be making this again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "This was very good! I made my own whipped cream from the \"whipped cream\" recipe on this site, i also used chocolate covered strawberries also from this site redipped and drizzled in peanut butter. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shiela Linkroum Baudendistel"
},
"reviewBody": "I added some almond flavoring to the dough and dropped them onto a cookie sheet like a biscuit. Also sprinkled a pinch of sugar on the tops. I liked them a lot but prefer regular shortcake. Just personal taste. The recipe worked for me. Had no problems with it being dry or crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Conley"
},
"reviewBody": "Though I was concerned since the batter was very thick and had to be pressed by hand into the pan, this shortcake is outstanding. The family loved it and already asked that I make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah"
},
"reviewBody": "I altered this only that I used skim milk and light cool whip topping. in the last month I've had 4 requests for this to be made. I'm not sure what other people said about it being too crumbly I found that it stayed together well and tasted FABULOUS! I didn't drizzle the chocolate syrup as I felt it would ruin the \"look\" and everyone said it was great without it even though it was available to add if they wanted it. I definatly recommend this to anyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susanna"
},
"reviewBody": "Not bad, but not great either. I guess I just prefer my shortcake plain as the chocolate flavour did nothing for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Ziegler Lutz"
},
"reviewBody": "Easy and very simple to make. I added a teaspoon of almond extract to the batter and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle"
},
"reviewBody": "I think some of the people who were not happy with this recipe might be confused about what \"shortcake\" is. Maybe they were expecting \"cake\". Shortcake is supposed to be more like a biscuit or scone. I think this is a really good recipe, though you're doing it a big disservice if you use frozen whipped topping instead of real whipped cream on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "UTEEYORE"
},
"reviewBody": "Even before I poured the batter in the pan, I could tell that this was not going to work for me. I followed the recipe and am an experienced baker, but still the cake came out very dry and tasteless. I'm giving two stars only because we were still able to eat the strawberries, whipped cream, and chocolate sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRCHTA215"
},
"reviewBody": "The cake came out perfectly! This is one of the best I've ever made - it tasted delicious and looked beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We don't add the chocolate to the shortcake and we always have to be careful to remember that the recipe gives us the instructions to make the strawberries and also the shortcake. When looking at the total amount of sugar, you have to be careful that you are separating how much sugar you are putting in the strawberries and how much in the shortcake.\r\n\r\nThis recipe is outstanding, and we've really enjoyed this recipe. We've had it about five times now and it always turns out great. Before cooking, the dough is nice and perfect. Its crumbly texture is perfect before and after you stretch the dough out on the cooking sheet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This yummy treat not only looked great, but tasted delicious. Best of all, it was super low-maintenance to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Deb Hughes Cormier"
},
"reviewBody": "I made this for a family Easter dinner yesterday &amp; assembled it where we were having dinner,everyone was oohing &amp; aahing over as it looked amazing &amp; delicious.However,the cake itself was boring &amp; bland.I would make this again with a regular 9\" chocolate cake sliced horizontally for layers.Very disappointing taste!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FOXHUNTER"
},
"reviewBody": "I was somewhat disappointed in this recipe. I didn't think the cocoa added much flavor and the whipped topping was definitely a turn off. For me, there is no substitute for real whipped cream. My personal best is strawberries served on just baked croissants with whipped cream topping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a really yummy cake. I took the strawberries and poored them on the cake (after poking holes in the cake) then poored the chocolate syrup over and refridgerated. Didn't have any whipped cream but I didn't miss it. This was soooo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "schmerna"
},
"reviewBody": "There was nothing special about this dessert. The cake layers were okay. I probably won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is the worst recipe i have ever tried from this site. after following the recipe to the letter, i found that it was still raw and doughy after the allotted baking time. even the cake tester came out clean!! but the cake was still raw! what a waste of ingredients!! never again will i try this one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirsten Finnigan"
},
"reviewBody": "Simply excellent! Looks wonderful and is a nice change for company and families. Put it together in just minutes after you've pre-baked the cakes and thawed the cool whip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Used this for 4th of July with both strawberries and blueberries. Added sparklers on top. Travelled very well..took cakes in their disposable tins and berries in a bag. Used ReddiWhip instead of making my own. Great hit with even the finicky crowd! No leftovers and no mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARANIC"
},
"reviewBody": "Looks beautiful, tastes delicious. I had a hard time cutting it. It was falling all over the place. I had large strawberries, so the slices were huge. I would probably cut the strawberries in quarters first and then slice. And do not add chocolate topping until right before you serve it, otherwise it melts on top of it and looks stupid. I definately recommend this recipe to anyone who loves a strawberry shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Angelman"
},
"reviewBody": "I first found this recipe in our hometown paper and made it several times. Six years ago we moved and the recipe did not make the move. Thanks to allrecipes.com I found it again and it will be my wife's birthday celebration cake this year. We are so-o-o excited."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very heavy batter...did not bake in a consistent manner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This dessert is excellent, easy to prepare and even Martha Stewart would be impressed. Definitely try this one for special occasions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABHANAN"
},
"reviewBody": "I've made this several times and it is always a hit! Very simple to make, but pleasing to the eye. Very tasty, and the chocolate is a nice change!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "great! easy to make,looks gorgeous and tasted even better. good summertime dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent, easy to make, melted in my mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NORANC"
},
"reviewBody": "This made an attractive and filling dessert. So filling that we couldn't finish it all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Requires a little bit of effort &amp; time\r\nbut the end result is well worth it.\r\nLooks like something you'd see in a \r\ncooking magazine &amp; tastes even better.\r\nA real crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for mother's day and it was a hit! It is a beautiful cake and everyone will think you spent hours on it. Definately give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was a really nice cake"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16029/chocolate-strawberry-shortcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16029/chocolate-strawberry-shortcake/",
"name": "Chocolate Strawberry Shortcake"
}
}
]
}
}
, "about": [
]
}
]