				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Press Cookies"
,"datePublished": "2020-06-18T23:08:42.000-04:00"
,"dateModified": "2022-08-08T11:43:18.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Beth"
,"url": "https://www.allrecipes.com/cook/24321477"
}
]
,"description": "This is one of two recipes that my family ALWAYS makes at Christmas. Chocolate spritz cookies with holiday sprinkles will add variety to any cookie tray with a minimum of effort."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UIhNCczinz623R3uGpoxb3aoQ1A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/53684-38a03054d53e4fd1813f39cf1986dd41.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Press Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.4",
"ratingCount": "51"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "84 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "28 mg"
,"sugarContent": "9 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.625 cup shortening",
"1.75 cups white sugar",
"1 beaten egg",
"0.5 teaspoon vanilla extract",
"2 teaspoons milk",
"2 cups all-purpose flour",
"6 tablespoons unsweetened cocoa powder",
"0.5 teaspoon salt",
"0.25 cup multicolored candy sprinkles" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the shortening and sugar until smooth. Beat in the egg, and stir in vanilla and milk. Combine the flour, cocoa, and salt; stir into the creamed mixture until just blended. Fill cookie press, and press onto ungreased baking sheets. Decorate with sprinkles if desired."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 minutes in the preheated oven. Remove from baking sheets to cool on wire racks."
} ]
,"recipeYield": ["45"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chertinep"
},
"reviewBody": "Well I heard everybody’s warning about the batter being too stiff, so I followed the suggestions to increase the liquid and used two eggs, and mine was too soft! In the oven they flattened out and merged, so there was almost no form left to them. I think it might be because I was I was using Crisco baking sticks end it seems a lot softer than regular Crisco. But I gave it 5 stars anyway because I hate when people alter a recipe and then take away stars because it didn’t work out. I loved the taste and texture though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Walter H"
},
"reviewBody": "I read the reviews before making this cookie and decided to add 2 more tablespoons of shortening to the batter. I used Crisco butter flavored sticks. The result was a batter that was a bit dry, not sticky at all and I had no trouble pressing these with my cookie press. The result was a crispy spritz cookie with a strong chocolate flavor, just what I wanted. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim H."
},
"reviewBody": "Made it per the recipe and it came out WAY to dry! I added 1 extra egg and 2 TBSP more milk, and it came out beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SusanB"
},
"reviewBody": "I made this recipe using the additional egg, 1 tps vanilla and 1 tblsp of milk as other reviewers suggested. The dough came through the press beautifully, but the cookies were rock hard after cooking and cooling. I'll try these again with less cook time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm not sure where I went wrong. The dough went though the press fine, but the cookies were hard. Taste wise, they were ok, but nothing I would consider making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "melissa velazquez"
},
"reviewBody": "Lackluster cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BCVigil"
},
"reviewBody": "No stars in my opinion. I followed the recipe exactly as stated, however, the cookie dough was dry and crumbly. It processed through the cookie press alright but the cookies when done baking were hard as rocks. I tried baking for less time, and they weren't good at all. I was disappointed to say the least."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jezebelina"
},
"reviewBody": "4 stars because had to tweak the recipe. Used almost 1 cup (180g) of shortening, and 3-4 tbsp buttermilk. Very tasty and chocolaty. However, to prevent spreading next time, I will use indicated amount of shortening and just add the egg and buttermilk to compare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mae5683"
},
"reviewBody": "I loved these cookies i followed everyone else and added an extra egg, a full tsp. of Vanilla, and 2 tblsp. of milk. They came out like brownie cookies. I dont have a cookie press so I just rolled them into small balls and pressed them with the back of a spoon. Then after they came out I let them cool and I drizzled a vanilla glaze over them. Totally made them our favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CS"
},
"reviewBody": "These looked right, but ended up as brown scorch marks on my baking sheets, despite trying two different batches on different kinds of baking sheets. Horrible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "frenchfrog69"
},
"reviewBody": "I tried the recipe and substituted the shortening with butter. I followed the rest of the recipes as is as I didn't red the comments first... I had no trouble with the cookie press other than the stencil kept popping out (but I beleive it is more link with cookie press issue than the recipes). The cookies are good but I was disappointed that they didn't keep there shape when baking. Event though I decreased the baking time, the cookies are way to crisp with no chewy area. I will try again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "They tasted delicious, but didn't work in the press at all - as others have said. I tried adding milk, but just couldn't get the right consistency. Ended up making drop cookies. My son still loved them, but we made the recipe to use the cookie press, so were very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "familyforjc"
},
"reviewBody": "dough was too dry so i refridgerated for about 5 mins then it worked better, but the finished product tasted almost like play dough. i am not sure why"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Lane"
},
"reviewBody": "Even after adding an egg (2 total), increasing the milk to 2 tbsp, increasing the vanilla to 1 tsp, and adding an extra 2 tbsp of butter, the dough was too thick and sticky to make it through my press. \n\nI ended up rolling them into balls, pressing them down with the bottom of a glass, then dusting them with powdered sugar right out of the oven.\n\n(I used dutch process cocoa, though that shouldn't make a difference in this recipe.)\n\nMake these cookies - they're delicious - just don't try to put them through your cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "autumnchick84"
},
"reviewBody": "The dough was too dry so I took the advice of others and added 4 tsp of milk. Now the dough won't come out of the press. It tastes good but doesn't look good. I just rolled them into balls and then rolled some out and let my kids cut cookies into them. :( Boo I was looking forward to this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G$"
},
"reviewBody": "Very easy to make. only 10 minnites in the oven. the best cookies i ever ate!! this is a G$ resipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie W."
},
"reviewBody": "I found this dough to be much to stiff to go through a cookie press. I added a total of 2.5 TBLS of milk and 1 tsp on baking powder and then it worked great in the cookie press. Great texture. Almost like a brownie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jennifer"
},
"reviewBody": "while the cookies taste wonderful, and the recipe ends up yeilding a lot of cookies, I can only give 3 stars because I had to ad fluids to the recipe. while I was mixing it according to the directions, I noticed that the batter was quite thick and dry, too much so in fact. I simply added some extra milk and shortening until it was the right consistency. I will totally make these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rita"
},
"reviewBody": "This is not a press recipe - Be warned!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mhoward"
},
"reviewBody": "I adjusted/substituted the recipe by the following and they were perfect for the cookie press. 3/4 cup butter 2 beaten eggs 2 tablespoons milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robinzone"
},
"reviewBody": "Chewy and wonderful! I added 1/2 c melted and cooled chocolate chips and made ice cream sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "happymommyx4"
},
"reviewBody": "I give it three stars, because without some changes they don't work out. I followed the advice of previous posters. I used 2 eggs, 2 tablespoons of milk and a teaspoon of vanilla. They were spectacular! They really do taste like brownies. I would recommend trying this recipe BUT only with the changes previously mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Koranda Stuart"
},
"reviewBody": "Adding an extra egg, and increasing the milk to 2 tablespoons and the vanilla to a full teaspoon made these cookies a cookie press dream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinmama"
},
"reviewBody": "This was deliciously chocolatey with just the right amount of sweetness. After reading the other reviews i did ad a bit more milk to make it a better consistency for the cookie press. I added 1/4 cup plus 2 tablespoons of milk and they were perfect! I also only baked them for 7 minutes so they would come out soft and fudgy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "3angelsmommie"
},
"reviewBody": "Used 3/4 c shortening, 2 eggs, and 1 t vanilla"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CupcakeLiz09"
},
"reviewBody": "These are awesome! Of course, like with all recipes, I've tweaked it. I forgot to add the salt first off..lol....I went to measure the cocoa powder and it slipped out of my hand, and dumped about 1/2c. into the mixing bowl...to comp that, I added an extra 1/2tsp of vanilla and a splash or two more milk. They are chewy and gooey!!! SO yummy! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma Rose"
},
"reviewBody": "changed 2 tsp of milk to 2 tbl of milk and added an extra egg. The cookies went through my cookier press just fine. (mechanical not electric). They do taste like brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I agree with the others when they say the dough was too thick. I decided to use a trick my mom uses. I added a little more milk and a little more vanilla. I then added some butter! They still turned out great and I was able to usemy cokie press!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandi Hunt Dawson"
},
"reviewBody": "I was gonna give this a two, but after I added 2 more tbsp of milk and another egg, we really liked it. The reviewer who said it tastes like brownie sprintz cookies is VERY correct. It was great with peppermint sprinkles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Fox Atkins"
},
"reviewBody": "Just made these today. After reading the cookie press warnings, I decided to just roll the dough into 1\" balls, top with a walnut half and bake. These taste just like little mounds of brownie. I baked them at 350 for 10 minutes. I found if I let them sit on the cookie sheet an additional minute to cool, they set better. I will definitely make these again. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I had to add 1 more teaspoon of milk and 5 tablespoons of water. Then added a little more flour as needed to get the right consistency for my press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "natalie"
},
"reviewBody": "these cookies were missing somting... LIQUIDS!!!! mine were hard as a rock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "takenbylovely"
},
"reviewBody": "Had I read the reviews, I would've learned this is a terrible press recipe. I was too excited to have inherited an antique press to go that far, though. I had to add another egg to even get it out of the press, and even then it was difficult. However, the cookies TASTE awesome. I'll probably keep this recipe in mind and tweak it in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ksimpkins"
},
"reviewBody": "I just got my first cookie press and wanted to try it out. I was a little wary of this recipe, but tried it and am glad I did! I added one egg and also extra milk, just enough to make the batter smooth. I also glazed them with some cookie icing (just powedered sugar and milk.) They were delicious and my husband loves them. Not bad for a first try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MMICHAELS"
},
"reviewBody": "i agree w/everyone, it is not suitable for a cookie press. i was really disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lulu"
},
"reviewBody": "I heeded other reviewers' warning about the dough being too dry and substituted the water for 4 teaspoons of buttermilk. My batter turned out perfect for use with a cookie press. The batch yielded 80 beautiful, delicious cookies. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rie"
},
"reviewBody": "Flavor wasn't bad. No luck with the press, I should have read the reviews. I made them as drop cookies, we got a ton of them. \nMaybe I will reduce the Coco next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BOONKIAN"
},
"reviewBody": "What a disaster! the dough wouldn't even come out of my cookie press, so I added a little more milk to make it softer and it still wouldn't come out. I put it in the fridge for 30 minutes and it finally came out but the cookies weren't very pretty or tasty at all. I would not make this again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica B"
},
"reviewBody": "I give it four stars for potential. After reading all of the reviews I added a full teaspoon of vanilla and an extra egg to compensate for the dryness that everyone spoke of. But found that it wasn't thick enough at all so added more flour! I finally decided that it wasn't the thickness that's the problem, but the stickiness. So I added a couple more tablespoons of margarine and it worked perfectly. I think that the recipe as it stands would work best if just more margarine/shortening was added. They pressed our perfectly for me after that and are delicious, like spritz brownies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "boodles"
},
"reviewBody": "I really wished I had read the other reviews before trying these. The recipe should be revised, moved to a different catagory, or removed. It is not a pressed cookie recipe. I added an additional egg to get it to work with my press, but not great for the press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "angela"
},
"reviewBody": "This is not a cookie press recipe. My 3 year old wanted chocolate cookies from the cookie press and the dough was so thick I didn't even bother trying the press. I just made drop cookies instead. They were delicious, soft, and chewy. Tasted like brownies...Mmmmmmmmmm, but I had to give the recipe 3 stars because there was no way it would work in a cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added more shortening and it was easier, but I don't think it was a very good press cookie recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jackie Combs"
},
"reviewBody": "I agree with everyone else as well. The cookies are good but forget the cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RF369"
},
"reviewBody": "I agree with the other bakers--recipe is too dry for cookie press. I added 2 more small eggs to the recipe, chilled dough for 1 hr. and used my cookie press and cookie stamps. Baking time varied with my gas oven. Good tasting cookie. From my experience, new recipes should be tried/tested before the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANGCRIS"
},
"reviewBody": "These cookies definately are yummy but NOT a press cookie. I agree with the others that the dough is very dry. I, with great difficulty, rolled them out and cut with a cookie cutter. Baked for 10 minutes, came out crunchie and chewy. VERY chocolatey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WELIKESLEEP"
},
"reviewBody": "I tried this with a cookies press and it didn't work. I think the dough was too thick. I took it out of the press and balled the dough and they tasted great!!! They needed to cook longer than 10 minutes. These are very good but shouldn't be used in the spritz press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this recipe in hopes of finding something new to use with my spritz cookie press. I'm not sure if the orignial poster used their spritz press, but it did not work with mine. The dough was to stiff and dry. I even tried adding more milk and vanilla, and it still didn't work in the spritz press. On a positive note, I rolled the dough into small balls and used a cookie stamp. The cookies turned out pretty good that way. The taste reminded me of brownies...definately something the kids love as does my husband. I will make this cookie again, but would have to experiment with maybe less flour if using a spritz press."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46740/chocolate-press-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/840/desserts/cookies/chocolate-cookies/",
"name": "Chocolate Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46740/chocolate-press-cookies/",
"name": "Chocolate Press Cookies"
}
}
]
}
}
, "about": [
]
}
]