				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Tres Leches Cake"
,"datePublished": "2019-06-06T19:40:37.000-04:00"
,"dateModified": "2023-03-14T08:50:38.415-04:00"
,"author": [
{"@type": "Person"
,"name": "MrsFisher0729"
,"url": "https://www.allrecipes.com/cook/mrsfisher0729"
}
]
,"description": "This chocolate tres leches cake uses chocolate milk, cake mix, and chocolate whipped cream for a delicious version of the classic Mexican dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FzVrgLw5hht93ccO8UCH9d5opQI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1010262-chocolate-tres-leches-cake-taz5869-4x3-1-f24b4b64959e4704bced947e2b1a0d8e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Tres Leches Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "56"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "472 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "101 mg"
,"fiberContent": "2 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "319 mg"
,"sugarContent": "33 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
, "recipeCategory": ["Dessert","Cake"]
,"recipeCuisine": ["Mexican"]
,"recipeIngredient": [
"1 (18.25 ounce) package Swiss chocolate cake mix (such as Duncan Hines®)",
"1.25 cups chocolate milk",
"0.5 cup canola oil",
"3 eggs",
"1 teaspoon instant espresso powder",
"1 (14 ounce) can sweetened condensed milk",
"0.75 cup half-and-half",
"0.75 cup evaporated milk",
"3 tablespoons unsweetened cocoa powder",
"1 cup confectioners' sugar",
"0.5 cup unsweetened cocoa powder",
"3 cups heavy whipping cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan."
} ,{
"@type": "HowToStep"
,"text": "Beat cake mix, chocolate milk, canola oil, eggs, and espresso powder together in a large bowl with an electric hand mixer on a low speed until dry ingredients are moistened. Increase speed to medium and continue beating another 2 minutes; pour into prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Remove cake from the oven and allow it to cool in the pan until it is no longer hot to the touch. While the cake is still warm, poke lots of holes all over the cake with a small skewer or a fork."
} ,{
"@type": "HowToStep"
,"text": "Whisk sweetened condensed milk, half-and-half, evaporated milk, and 3 tablespoons cocoa powder together in a bowl until cocoa is mostly incorporated into the liquid; slowly pour the milk mixture evenly over the cake. Allow the cake to cool completely as the liquid soaks into it."
} ,{
"@type": "HowToStep"
,"text": "Sift confectioners&#39; sugar and cocoa powder together in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Beat heavy whipping cream in a stand mixer on medium speed for about 1 minute. While continuing to mix, add sugar-and-cocoa mixture to the cream in 2 batches, allowing the first to incorporate before adding the second. Increase mixer speed to medium-high; beat until soft peaks form and the cream is thickened and spreadable. Spread chocolate whipped cream on the cake to serve."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT115M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SJK"
},
"reviewBody": "I followed the recipe but substituted Rumchata in the milk mixture by reducing the evaporated milk. It was delicious. I received SO many requests for this recipe after taking it to an event at work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My co-workers raved about it so much, that I made it for my family for Easter dinner. So amazing!! The frosting tastes like chocolate soft serve ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I forgot the chocolate milk and the espresso in the cake but it was still delicious! I also used Cool Whip with the unsweetened cocoa powder on top. The best part was that it wasn’t too sweet. My girls didn’t really like the cake part but they liked the topping. My brother (whose birthday it was) really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika Sager"
},
"reviewBody": "This was a hit with everyone who tried it. My mom even asked for the recipe after one bite. I had everything on hand except the chocolate box mix and coffee. I substituted the cake mix with a butter cake mix and a box of chocolate pudding mix, combine them dry until it all looks chocolate, then continue like directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Tanner"
},
"reviewBody": "wow! wonderful recipe! I used Devils Food Chocolate cake mix and added 1 teaspoon of of Mexican Vanilla to the batter -- also added 1 tablespoon of Coffee Liqueur... this cake needs no frosting.. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TVick"
},
"reviewBody": "Everyone in my family loved it! I would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Litlmo"
},
"reviewBody": "I made this chocolate version for my friends birthday after she introduced the regular version to me a few months ago for my birthday and let me tell you, we both agree its the best cake ever! If you know a chocolate lover, they will definetly love this cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lolita M Scott-Charron"
},
"reviewBody": "Easy to Make, Moist, Delicious, hit of the 4th of July party. My new go to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YAYAYAYAYAYAYAYAYAY"
},
"reviewBody": "It is awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janis"
},
"reviewBody": "The cake turned out nicely &amp; everyone enjoyed it. I used a Devil ‘s Food cake mix since I could not find the Swiss Chocolate Cake mix. I added 2 tsp of the instant Espresso and added some amount to the whipped cream frosting. I will make this cake again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GLAMGeisha"
},
"reviewBody": "Very easy to make...and I made it exactly as stated though I used Duncan Hine's Devil's Food cake mix. My office LOVED IT!!! It's not as wet as a regular tres leches cake but it was still very moist. And I don't know why the recipe calls for 3 cups of heavy whipping cream when one or one and a half should suffice. I had so much frosting left over I am going home to make another cake so I can use it up. This will go on my list of options for my clients. Kudos!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhatCook"
},
"reviewBody": "Love love love this cake! My husband wasn’t thrilled by this but I think he loves the original tree ledge so much that this wasn’t up to or. Made exactly as recipe stated! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dusti"
},
"reviewBody": "This was an excellent recipe.\nI used the 15 ounce box and it turned out perfectly. Also, I feel based on the 8 hr old cake and overnight in the refrigerator leftovers, it must be made 1 day in advance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ricky57"
},
"reviewBody": "Very Moist and delicious cake..Definitely a keeper.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen"
},
"reviewBody": "I have taken it to several events, and it is requested by several of my friends as birthday cake of choice. \nI do add some liquer to it such as Kalula, or a spice rum, or a coffee liquor. It is a hit every time I make it.\nYou can decorate it various ways, my favorite is the chocolate ganache."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LaDonna Saylor"
},
"reviewBody": "I give it 5 for taste and easy but problem here is with the directions if you notice ur using the coco 2 x in the recipe and u give no clear instructions how to use it... please fix... but in all people this is a great way to make the cake... family loves it ! and its better 2 days after refrigerated lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Leigh Smith"
},
"reviewBody": "I've made this twice now. I halved the amount of cocoa in the whipped cream because it tasted too bitter with full amount. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carianna Farrell"
},
"reviewBody": "It definitely tastes the best after 1 or two days in the fridge. The icing was the best--it came out tasting like chocolate mousse!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glenwoodd6too"
},
"reviewBody": "This is a awesome cake, not difficult at all. Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRINK24"
},
"reviewBody": "Delicious! I would not change a thing. Made the cake the night before and refrigerated--then added frosting right before serving. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Richards"
},
"reviewBody": "I really enjoyed this. In the future I would add a bit less of the liquid to soak into the cake, otherwise, wonderful. The icing is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coleene"
},
"reviewBody": "This was delicious! I couldn't find swiss chocolate cake mix. I used a dark chocolate mix and good quality dark chocolate cocoa powder for the frosting just because I prefer dark chocolate. I made it a day ahead and refrigerated it overnight. It was rich and chocolatey without being overly sweet. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoGo"
},
"reviewBody": "I've made this two times for family get togethers and it disappears fast. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MamaSanchez"
},
"reviewBody": "I made this recipe for my husband who is from Guanajuato, Mexico, so he is our resident Latin cuisine expert. I make tres leches quite a bit and I wanted to try something a bit different. I couldn't find an 18 oz. box of ANY cake mix, so I went with a 16.5 oz. box of a fudge cake. I left all other ingredients the same. The cake came out good and the icing came out good. The ONLY thing that I will change for next time is the amount of liquid I pour over the cake. Normally, I put more, but I wanted to follow the recipe at least the first time. So, I did and my husband and I both agree that it definitely needed more liquid. Tres leches, typically, are not that dry. They are supposed to be a pretty wet cake. So, all I got was a moist cake, not a tres leches. Overall, a pretty good recipe. I will just need to adjust the amount of liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "remmus89"
},
"reviewBody": "This cake was delicious. I made it as a birthday cake for a bunch of us traditional frosting haters and it was a hit. Love the chocolate whipped cream frosting! And it's so much easier to spread and get that 'magazine pretty' look with. Used devils food cake mix, 16oz with no problem. \nWas surprised that the cake soaked up all the liquid without turning into soup, but it did. I omitted the evaporated milk and replaced it with half and half. Still delish. I let it set overnight in the fridge before frosting, mostly because it was 2am and I didn't have it in me to frost, but also it had more time for it to soak it all up. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwynnetx"
},
"reviewBody": "Omitted the espresso powder and used canned whipped frosting from the store. Made the rest according to the recipe. Took it to a gathering, and t was gone within minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Roberts"
},
"reviewBody": "I made this for my mother-in-laws birthday and it was a hit. I followed some other reviewers suggestions and substituted 1 stick butter, melted for the cake and 1 box instant chocolate pudding along with the heavy whipping cream for the frosting. It turned out beautiful and tasted amazing. My home has been elected the new celebration home from now on!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "This chocolate thres leches cake is amazing my family came back for thirds it was a big hit. I reccomand this recipe for everyone. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Godzilla"
},
"reviewBody": "I'm not much of a baker, but this was so easy and simple to make. That's a definite plus in my book. This made a super moist cake and loved the whipped cream topping. My family loved it. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria217"
},
"reviewBody": "My family devoured it.....it was my first try at any tres leche cake and it is definitely a keeper!! I used the 16.5 oz devils food cake mix by Duncan Hines and kept all the liquid the same (as did other users) and it was moist and delicious! Thank you for sharing this recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TWUTAH"
},
"reviewBody": "Tasted good the first day and better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Leigh"
},
"reviewBody": "Made this for our Mexican friend, and he loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pdavidson34"
},
"reviewBody": "I tried this recipe for my Mom for mothers day because two of her favorite things are chocolate and tres leches, and it was a big hit. I added a little bit of extra espresso, and then some shaved dark chocolate on top to really add some flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rgej"
},
"reviewBody": "The \"One Bowl Chocolate Cake III\" on this website is the cake mix I use to make this recipe! Also, for those not in America, I found a substitute for half and half: If you have heavy whipping cream and milk, you can make half and half by combining four parts whole milk with one part heavy cream. If you only have light whipping cream, use three parts whole milk and one part light whipping cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi S"
},
"reviewBody": "This cake is awesome! It's a big hit with my friends and family. I don't necessarily use Swiss chocolate cake, I just use whatever I can find. I also add a little bit of Irish creme to each group of ingredients. It's a rich cake, but everyone finds room for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "I made this for a high school tech week dinner with lots of hungry teens and it went over well. Out of necessity due to lack of ingredients at 10:30pm, I used Devils Food Cake mix and substituted 1/2 tsp fine ground espresso coffee for the instant. I also didn't have cocoa powder, so I used Ghirardelli Chocolate Mocha Cocoa mix instead of cocoa powder (and yes, it was sweetened), so I only used 2 TBL for the cake and 1/4 cup for the frosting (with 2 cups whipping cream and 2/3 cup confectioners sugar). It turned out awesome and I just called it \"Chocolate Mocha Tres Leches Cake.\" I will probably make it the same way next time because the mocha added a nice touch (albeit probably not as traditional). Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "DELICIOUS! I love the reg. version of Tres Leches Cake, so I knew this would go over well, and it did! I shared some w/ my mom and dad and they loved it too. I also could not find swiss chocolate cake mix, so I used devil's food. To make my life a bit easier, for the icing, I just beat together 2 cups of heavy whipping cream and a box of chocolate instant pudding, until thick, and spread that over top...perfect. This is a definite keeper~YUM! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EvieKay"
},
"reviewBody": "Very easy. I used a 16 oz. Devils Food mix from Duncan Hines and it turned out great. I didn't change any of the other ingredients, but I did whip the heavy cream until it was stiff. Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeniseKantner"
},
"reviewBody": "I've made this for dinner parties three times and twice for my family. It's a delicious hit! Our friends and grandchildren beg for this divine cake (our daughters are always dieting, but they always have a piece anyway). The only change I made was using a stick of melted butter in place of the canola oil (we like our butter around here). Sorry, gotta go -- just getting another one of these cakes out of the oven for a party on Friday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I gave this 3 stars because of the boxed cake mix, it really took away from the delicious taste of the leches. Next time I will make my own batter and give it 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SchrodingersCat"
},
"reviewBody": "It was beyond delicious. I had made this for a food day in spanish class, and it was a hit. The consistancy was unique but just added to the experience. The bottom was really moist and the milk congregated down there, then the middle was cake texture, the top was that moist cakey texture, and the frosting tasted like chocolate mousse. YUM! Absolutley making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "Everyone was \"wow\"-ed by this at our party. Used the recipe off the back of the Hershey's Cocoa can for the dry ingredients instead of a boxed cake mix. Left out the expresso powder, but did add 1T Kahlua to the milks. Instead of half-and-half, just used the whole can of evap milk. Cake texture and taste were GREAT. Frosting great too and super easy/quick to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "France C"
},
"reviewBody": "Delicious! I couldn't find a 18.25oz cake mix, so I used a 16oz mix, keeping the other ingredient amounts the same. The cake turned out perfect. Once I mixed all the milks together, it looked like it was way too much, but the cake managed to soak it all in. I ended up whipping the cream a bit too long and it was more of a mousse, but still tasty! I made this for a party and it disappeared in no time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "This is a fabulous cake! Ever since I made it my family has been begging me to make it again. Love that. Very easy to make to which is always a plus. I couldn't find the Swiss chocolate cake so I ended up using Devil's Food. I realized when I was making it that my cake mix was 16 oz and not the 18.25 called for. I wasn't sure what would happen since it was a smaller box so I cut the chocolate milk down to 1 cup. It worked nicely. When I was making this my hubby and my boys were thinking it was going to be weird since you pour all the milks over the cake, but they all loved it. When I went to make the frosting I realized I only had 1 1/2 cups of cream so I had to cut the frosting in half :( Still really good. Hubby even went back for another piece later in the night, which isn't something he does with cake. Fantastic recipe! Thanks MrsFisher0729 :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/229054/chocolate-tres-leches-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1217/world-cuisine/latin-american/mexican/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/229054/chocolate-tres-leches-cake/",
"name": "Chocolate Tres Leches Cake"
}
}
]
}
}
, "about": [
]
}
]