				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Oatmeal Cookies"
,"datePublished": "2020-06-18T23:05:54.000-04:00"
,"dateModified": "2023-01-18T14:38:12.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Norcal"
,"url": "https://www.allrecipes.com/cook/4747"
}
]
,"description": "These delicious chocolate oatmeal cookies are packed with energizing ingredients including oats, ground cinnamon, cocoa, and chocolate chips."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wp-W8rNIPmaD8dAu2hZwKCTwz08=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/25023-Chocolate-oatmeal-cookies-ddmfs-3X4-0173-34c84ebff62e4f80937c94e4b21e848a.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Oatmeal Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "510"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "79 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "92 mg"
,"sugarContent": "6 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"3 tablespoons unsweetened cocoa powder",
"1 teaspoon baking powder",
"0.5 teaspoon baking soda",
"0.5 teaspoon salt",
"0.5 teaspoon ground cinnamon",
"0.5 cup margarine",
"0.5 cup brown sugar",
"0.5 cup white sugar",
"1 large egg",
"1 teaspoon vanilla extract",
"1.25 cups rolled oats",
"0.5 cup semisweet chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Stir flour, cocoa, baking powder, baking soda, salt, and cinnamon together in a large bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat margarine, brown sugar, and white sugar together in a large bowl with an electric mixer until light and fluffy. Beat in egg and vanilla. Stir in flour mixture using a wooden spoon. Mix in oats and chocolate chips. Drop spoonfuls of dough 2 inches apart onto the prepared cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until edges are golden, about 8 to 10 minutes. Cool on the baking sheet briefly before removing to a wire rack to cool completely."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was made on a \"search for what's in my pantry\" day. I wanted to bake something and didn't want to go to the store. I didn't have brown sugar or chocolate chips, so I punted - used 3/4 C white sugar and 1 T maple syrup instead, and doubled the amount of cocoa and cinnamon, to make a more grown-up tasting cookie. I rolled the very stiff dough in my palms and baked for 14 minutes - the cookies stayed in ball shape and are ridiculously delicious! Next time I'll make them the same way and roll them in powdered sugar while they're hot, like you do with snowballs. Yum yum yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scottholly505"
},
"reviewBody": "These cookies are fantastic. Don’t do know who needs to hear this but make these soon oatmeal double chocolate love . I added a smidge of espresso powder, upped the cinnamon and added nutmeg , plus 1/2 c pecans , butter instead of margarine—and because I’m gluten-free I use King Arthur 1 to 1 . They were not dry. They were not flavorless. Cooked 10 min. 31 medium sized cookies. 111 calories per cookie. Very happy with this recipe on a snowy spring day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I simply adore chocolate and cinnamon together, and I love a small size bake. So this recipe is perfect for me. It would have yielded about 2 dz average size cookies, but I made the second sheet 8 larger cookies. Oh I used real organic butter, cacao powder, and Tollhouse peanut butter and chocolate chips. I rolled them and flattened them a little as they don't spread much, and baked them 10 min. They were textured almost like a crackle cookie but then chewy and moist inside. It was one of my favorite cookie experiences ever - sweet and perfectly salty, chocolatey then warm and texturally interesting. I will be making these often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't add the chocolate chips but it still turned out AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Krista Kyle"
},
"reviewBody": "One of my favorite pass times is baking, and improving other peoples recipes. The chocolate was overpowering. I added triple the cinnamon, as well as some nutmeg and ginger, and I couldn't taste it at all. Other than that they tasted fine I found that I could hardly even mix the wet and dry ingredients together, they were that dry. I ended up adding some butter and milk witch worked fine. My family and I thought that they were fine, but not worth making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "derosierkaren7"
},
"reviewBody": "Very easy and good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very solid and straightforward recipe. Nothing goofy with the ingredient. It certainly can serve as a default dessert for the kids, the occasional friend who just happens to stop by, or a small band of friends who wanna talk the talk.\n\nI varied the recipe a lot. Among other things, I used dark chocolate bar in place of semi-sweet chips and reduced the flour by a quarter. I made up the difference with a compo of gluten-free flours. \n\nI can't resist coffee, so I added it along with espresso power. I added two other spices. One was hot and one sweet. The final product was unexpectedly good. Not too sweet. It paired well with coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "These are delicious. Only change was I added walnuts because my husband insists on walnuts in all cookies. They were a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shayla"
},
"reviewBody": "I used Crisco shortening stick for the margarine, and Truvia Granulated Blend and Truvia Brown Sugar Blend for the sugars. They weren't dried out, but not as moist as I would like. When it came time to add the oats and chocolate chips, there wasn't quite enough moisture to stir with a spoon. I had to get in there with my hands and roll the batter into balls to transfer to the pan. They didn't flatten on their own in the oven either, I had to press them down with a fork. Next time, I will use regular butter. I feel like the Crisco shortening stick was the main issue. It was my first time using one, and I do notice it seems firmer than normal Crisco. I didn't notice anyone else in the comments mention needing to add milk or water to help. Maybe I was ignoring my instinct to do that, since everyone else's seemed to turn out so good without alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Booberry"
},
"reviewBody": "These are absolutely DELICIOUS!!! Ranks right up there with the best cookies that I have ever eaten. Slightly crispy sides and chewy centers. I did add extra chocolate chips and 2 tsp oil. I will definitely be making these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ElenaPerry"
},
"reviewBody": "Instead of egg I used chickpea juice. Kids love them, so that’s a win in my books."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sarah Leidy"
},
"reviewBody": "Save your ingredients and make something worthwhile. \nThese cookies were bland and flat, very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Faintly"
},
"reviewBody": "I added peanut butter chips to one batch. Came out good as long as I used margarine. I was surprised. The batter seemed really dry but I continued and they came out really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kent"
},
"reviewBody": "Daddy like!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "paperclippy"
},
"reviewBody": "Very tasty! The recipe doesn't make 36 unless you make them tiny, though. I got 25 medium-sized cookies from it. It was also very hard to tell when to take them out of the oven -- I cooked my first batch 14 mins and they came out too crunchy, second batch 10 mins are a smidge too soft. The flavor is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Addie Kimball"
},
"reviewBody": "Ended up accidentally using a whole stick of butter and decided to use 1 cup of Butterscotch Chips. These are a new family favorite. Except for me because I don't eat any kind of chocolate unless it's candy chocolate. If/When I make these again I will use a whole stick of butter again, since everyone seemed to like it that way. I baked these at 9, 9:30, and 10 minutes. I think for me they came out looking the best in the 9:30 and 10 minute batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bellababy"
},
"reviewBody": "We really loved these chewy chocolate cookies. The cinnamon added a new dimension to the chocolate flavor and it works really well in this recipe. I made them as written except I used milk chocolate chips instead of semi-sweet. I got exactly 3 dozen cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Celia Weson"
},
"reviewBody": "Mine turned out a little dry but has wonderful flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robbando"
},
"reviewBody": "Different for us, but very tasty. It isn’t the sweetest cookie, but that’s alright. Husband loves them, as do I. I made it exactly, except I used butter. Crispy outside, soft inside. Yums!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Towery-Haines"
},
"reviewBody": "Good recipe. The only thing i changed was i upped the chocolate chips to 3/4 cup. And next time i will make them with dark chocolate chips rather than semi sweet (just a personal preference). I also think the margarine could be replaced with fat free yogurt for a healthier version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Chocolate Oatmeal Cookies by Norcal. Only white sugar; somewhat chewy brownielike. They aren't oatmeal cookies with chocolate though. They're chocolate cookies with oats &amp; chocolate chips. 'Spread too much. More flour, oat flour, oats next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Poetic Chef Akp"
},
"reviewBody": "A perfect recipe! It came out just fine. \nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlos Armendia"
},
"reviewBody": "Awesome recipe! Made it in about 15 minutes by hand. I tried to mix the butter and sugar (I used only brown) as much as I could by hand and then I added the egg and vanilla and applied some strength.\n\nThe end result was so delicious! My wife loved them too! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sanika"
},
"reviewBody": "Lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I think this is my new favorite cookie recipe! I only made slight changes...I used dark chocolate chips, about 1 1/4 teaspoons cinnamon, and subbed out 1/2 cup of the oats for sweetened shredded coconut. Baked 8-9 minutes, let sit on cookie sheet 5 minutes before transferring to wire racks. Turned out chewy and perfect. Delicious unique flavor...who knew how awesome chocolate and cinnamon are together! Wonderful depth of flavor! Great recipe! Even my dad asked me for these a couple of times after the first time I made them and he NEVER requests any baked goods!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura L"
},
"reviewBody": "Pretty good. Very chocolatey and not quite as oatmealy as I was hoping. But they were delicious either way. I think I'd increase the oatmeal next time to 1 1/2 or 1 3/4 cups and eliminate the chocolate chips. But overall - I'll eat them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abbie Lam"
},
"reviewBody": "Easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donnadege"
},
"reviewBody": "My family loves these cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom"
},
"reviewBody": "By far, the best oatmeal cookies I've ever made. They're delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Loved this recipe!! I like my cookies soft so I only cooked them for 7 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mike_noodles"
},
"reviewBody": "These were a hit! I've been asked to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Girvin"
},
"reviewBody": "One of my favorite cookies!! Was looking for something different and am so glad I tried these. Very easy to make and love the slight cinnamon flavor. If you like chewy cookies this won't let you down. Even nice and soft the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rox Ann"
},
"reviewBody": "This is an awesome and worth while recipe! Super chewy and fluffy and dangerously addictive! Thank you for the awesome share!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clwong"
},
"reviewBody": "I swapped margarine for apple sauce and added pecans. Amazing! Next time gonna put big chunks of Mac nuts. That’ll be winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Valmont"
},
"reviewBody": "I made the bar like someone in the comments did! It’s perfectly chewy and crispy! Flavors are nice. Used raisins instead of chocolate chip. Will make this in the future sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Velay Vong"
},
"reviewBody": "These cookies are great! Didnt last long in my house thats for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmlam"
},
"reviewBody": "You must use real butter for this recipe! I added some coconut and butterscotch chips, as that was what I had on hand. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cmag"
},
"reviewBody": "Excellent cookies. Easy enough for my 12-yr old son to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1stick"
},
"reviewBody": "Wow, this is a pretty good recipe. The only thing I might change is to add a little more cinnamon. I put a few large raisins in a few of the cookies just to see what it would be like and it was pretty good too. I will be making these cookies again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dekaft1"
},
"reviewBody": "This is a darn good recipe! I did have to make a couple substitutions though, because I'm gluten free. I substituted the flour with gluten free all-purpose flour, and the sugar with both brown and white coconut sugar. I also smushed down the cookies with a fork before putting them in the oven (I have a personal preference for flat cookies, not weird little round cookies). The cookies aren't too sweet and they are VERY chocolately! Y'all will love these!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aidancooks"
},
"reviewBody": "Really good! I didn’t add raisins or chocolate chips and they still baked up great in 8 minutes. I did chill the dough for ~20 minutes. I had some leftover cream cheese icing to use up so I made chocolate oatmeal creme pies. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norma"
},
"reviewBody": "Made these without the chocolate chips, and added 1/2tsp espresso powder because I like it to boost chocolate flavor. They were chewy and delicious and I will definitely be making them again. Next time I”ll try adding the chocolate chips, I didn’t have any today. I expect they are completely over the top with that addition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Excellent cookies! They turned out a bit crunchier than I anticipated but everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellenh"
},
"reviewBody": "I added 1/2 c raisins &amp; 1/2 c walnuts and left out chocolate chips. Also increased the cocoa to 4T. Used 1 heaping T for each cookie and baked 10 min. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheriz"
},
"reviewBody": "I made it but without chocolate chips because my family doesn't like sweet and sugary things. It came out very delicious i will definitely add chocolate chips next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Mendez"
},
"reviewBody": "One less teaspoon of cocoa powder and added milk chocolate chips and almonds and some with raisins,these are the best chocolate chip oatmeal cookies I have had yet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndi"
},
"reviewBody": "Absolutely delicious!! Definitely will make this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "Yum, yum, yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sdionnac"
},
"reviewBody": "These are the best chocolate oatmeal cookies I have ever made. I added 1/2 cup sliced almonds because I love nuts and they turned out perfect. Deep rich chocolate flavor with the texture of oatmeal. Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The befuddled batchelor"
},
"reviewBody": "Doubled the batch. Used whole wheat flour. Half coco and half carob. Steals the show."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Gurner Kellett"
},
"reviewBody": "These were great! I loved the little kick of cinnamon. I baked them on a baking stone so had to bake them about 15 minutes instead of what was recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeeMaw"
},
"reviewBody": "Wonderful recipe. I made 24 cookies on 2 sheets worked out perfectly following the recipe - cooked 8 minutes exactly and rested 5 minutes none broke. Taste is great. The only change was since I don’t have margarine, I used 1/4 cup butter with 1/4 cup shortening. Just chewy enough. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David L"
},
"reviewBody": "they are kind of flat , but taste amazing! we are definitely making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skeet"
},
"reviewBody": "Easy and Yum! My wife thinks I can cook now ; )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuniorChef"
},
"reviewBody": "I put in the exact amount of sugar in the recipe, and I thought it was too sweet. I would recommend putting in less sugar than called for. Other than that, it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Missmoe Harrington"
},
"reviewBody": "I followed recipe, added crunchy chips, and dark chocolate semi- sweet morsels, and walnuts. Very good cookie, and easy to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jfish"
},
"reviewBody": "My son’s new favorite! I made it two ways. First, I made it exactly according to the recipe- with butter bc I don’t have margarine. So good! However, my son loves anything with chocolate and peanut butter so the second time, I used peanut butter chips instead of chocolate chips. Huge hit. Now, this is the only cookie he asks for when he comes home from college. This is a winner. Note- store them in a cookie tin with a slice of bread to keep them soft for longer. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxstar"
},
"reviewBody": "I toasted the oats on a stove before adding them to the mix.. seemed to work. Delicious cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenda"
},
"reviewBody": "Delicious and easy to make. I’ll be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaimie"
},
"reviewBody": "My new favorite! Love the cinnamon notes with the chocolate. I made it exactly as the recipe is written, except I used butter because we don't use margarine. So good. I might try adding peanut butter to it one of these days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trey Holst"
},
"reviewBody": "Very good recipe. I doubled the recipe and added 1/4 cup of flour as I am cooking at high altitude which helped them stay puffed up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Made as is and absolutely taking care of my chocolate craving! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Mitchell"
},
"reviewBody": "I doubled the recipe. Instead of doubling the butter I used 1/2 c butter and 1/2 canned pumpkin. I also altered the oatmeal to 2 cups and used 1/2 c of flax, chia, coconut fiber blend for added nutrients. I had some caramel bits and pecans on hand so I threw those in too about 1/2 c each. They came out soft and fluffy and kid approved. I will Definately keep this recipe close."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber Heasley"
},
"reviewBody": "Pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Ericksen Houston"
},
"reviewBody": "Wow! What a great, soft cookie! Living at a higher altitude, I left out 1/4 cut oatmeal. Then I excluded the chocolate chips. Otherwise, made it the same as the recipe. Absolutely stunning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "These Are yummy. I doubled the cinnamon. These are very sweet, next time I’ll reduce the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarmeVA"
},
"reviewBody": "Baked at 375 degrees. Used unsalted butter and added finely chopped walnuts, dark choc chips and a 1/4 c. Dried cranberries. Loved the soft inside but crisp outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Es_y"
},
"reviewBody": "These are great! I used this recipe to make lactation cookies. I added flaxseed meal and brewer’s yeast. I baked them for about 15 minutes and made them a little on the larger size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUNISIANSWIFE"
},
"reviewBody": "these are so good and bake up beautifully. 10 min in my oven was perfect. I used butter in place of margarine, as I never use margarine when baking. They are crispy on the outside, and soft chewy/fudgy on the inside. I used a combination of white, butterscotch, and chocolate chips. I did double the batch, and you might want to also if you are making these for a crowd. The proportions as written are fine for a quick cookie to have for a snack in home, or to give away to someone as a gift but they are sure to be a crowd-pleaser so you may want to double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Antonia"
},
"reviewBody": "I adjusted the recipe a little bit: since we don't like too sweet things, I cut the white sugar, replaced margarine with butter and added more cinnamon. We loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Sanchez"
},
"reviewBody": "I made this and shared it with my neighbor who loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmrfriend"
},
"reviewBody": "Made these twice, absolutely love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Mama Nerd"
},
"reviewBody": "I loved the recipe. I added 1/8 cup of steel cut oats in addition to 1 cup of regular oats. It has a great flavor but is still nice and soft"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esther Miles"
},
"reviewBody": "The cookies turned out just delicious! They were moist and yummy without being too sweet. Yes, I will make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riazza09"
},
"reviewBody": "These came out awesome. I wanted my kids to have some nuts for protein so I made the following changes:\nAdded 1/4 cup super fine almond flour and 1 tbsp maple syrup.\nOmitted white sugar and used 1cup light brown sugar total.\nFlattened the dough by placing a piece of wax paper and lightly pressing the dough scoop before baking and added MnMs on top.\nThey came out crispy on the edges and chewy on the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakeIt"
},
"reviewBody": "Absolutely delicious!! Very chocolatey, even without the chocolate chips. I don't even know what more to say, other than I used shortening instead of margarine, and it turned out GREAT!! This is one to keep for the books!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "W"
},
"reviewBody": "These cookies were a big hit. I used a bit less sugar (third of a cup each kind rather than a half) and raisins rather than chocolate chips. The result was a delicious crisp outside moist inside cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bigly"
},
"reviewBody": "Added more chocolate chips and baked them for 13 minuets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Torres"
},
"reviewBody": "I only put 1/4 cup chocolate chips. I added 1/4 cup sliced almonds and 1/4 cup dried cranberries. And doubled cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilovefood"
},
"reviewBody": "I changed the recipe a bit, added about 1/4 cup extra oats, 1/4 C almonds, a couple tablespoons of ground flax, and omitted the white sugar altogether. \nWith the addition of all that dry I had to add an additional egg but they were fabulous. Cutting the sugar put the sweetness right where I wanted it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Sabo"
},
"reviewBody": "Outstanding recipe. I needed a chocolate vegan gluten free recipe. This one was easy to adapt. I used oat flour and egg replacer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeannieJ"
},
"reviewBody": "Made exactly as the recipe was written, and they're simple, delicious and I love that it's a small-batch recipe, so there's not a ton of leftovers that the sort-of-dieting husband can be tempted by. Next time I'll add chopped pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandrina Tolan"
},
"reviewBody": "delicious!!! I love both the flavor and the texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyButterfly"
},
"reviewBody": "I have made this recipe 3 times and have gotten rave reviews! I added walnut pieces and dried blueberries and used dark chocolate morsels. Can't wait to take my latest batch to work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayatri"
},
"reviewBody": "I used cinnamon cocoa powder instead of the regular kind, and only used one egg as a reviewer suggested. The cookies are very quick to mix up, but very sticky right then. I popped them into the fridge for a couple of hours, and they were perfect at 10 minutes: crisp and yet chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "No changes. Easy to make with lots of flavour. Not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Boss of Everybody"
},
"reviewBody": "Although these cookies seemed a tiny bit dry they tasted very nice. Will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mixiao"
},
"reviewBody": "Used cake flour so didn't add baking soda. Replaced white sugar with brown sugar completely, but turned to be still too sweet. Next time will reduce sugar by 1/4. But overall excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "I've made these probably 30 times. They are definitely our favorite cookies. I always substitute Reese's Peanut Butter Chips for the chocolate chips and add about 2x as much as it calls for. They are sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Sin"
},
"reviewBody": "It's very chocolatey but tastes awesomew!! I used quick cooking oats instead. I found that the cookies didn't spread that much. I'll try using butter instead of margarine next time. I used an ice cream scoop for the first batch, didn't flatten much. it was rather thick. 2nd and 3rd batch were rolled into balls and then flatten. they were much better looking cookies. they are chewy and chocolatey. u can omit the chocolate chips. I reheated them the next day to make them crispy . I don't really like chewy ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Siddons"
},
"reviewBody": "These are by far the families favourite cookies. I make them a little healthier by using whole grain spelt flour and adding ground flax. I also sub the vanilla for peppermint essence for a mint choc chip cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonja Werthwein Galletta"
},
"reviewBody": "Amazing cookie, crisp and light"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erick Ponce de Leon"
},
"reviewBody": "I made it without the chocolate chips. This is definitely a new favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "This recipe is pretty good. The only thing is that when next time I do it, I'll use less sugar, as even though I'm a big sweet eater, this turned out to be too sweet for me. Good about the recipe is that it stays moist inside after cooking and at the same time has a nice firm top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loolyox"
},
"reviewBody": "Really good \" just have in mind to to mix the butter and sugar until combined"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark J. McGuire"
},
"reviewBody": "Great!!!! Easy to work with, has multiple options. Only substituted Hazelnut over the vanilla..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa Estrada"
},
"reviewBody": "Will totally make it again! I doubled it and used shortening and 1 tsp of butter flavoring, since I didn't want to buy margarine for just this recipe. Also added 1 TBL Cocoa. Ended up cooking for 14 minutes. Otherwise as written. Really great soft texture, just don't try to take them off the sheets without letting them sit for 5 min or so, otherwise they are too soft. Next time I'll add nuts. Would be really awesome with dried cherries too, as a riff on a Black Forest cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paddy"
},
"reviewBody": "I love these! Usually the only changes I make are the chocolate chips. I use about 1/3 cup white and dark chips and then use butterscotch chips for the rest. I find they really give the cookie a good chocolate balance. Great recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25023/chocolate-oatmeal-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
"name": "Oatmeal Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25023/chocolate-oatmeal-cookies/",
"name": "Chocolate Oatmeal Cookies"
}
}
]
}
}
, "about": [
]
}
]