				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Pretzel Treats"
,"datePublished": "2019-04-02T02:58:07.000-04:00"
,"dateModified": "2022-06-01T05:49:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LCDOYLE"
,"url": "https://www.allrecipes.com/cook/739766"
}
]
,"description": "Pretzel-Hershey kiss treats topped with M&amp;Ms candies are fun chocolaty treats that are so quick and easy to make. Plus, the kids can help you prep!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ebmhJLwmTSg2bkjR_pZfUFKml9g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1078907-chocolate-pretzel-treats-T-bone-4x3-1-6c4719a69d2142069ab69092b2ed0f99.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Pretzel Treats"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "87"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "37 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "12 mg"
,"sugarContent": "1 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (15 ounce) package small pretzel twists",
"1 (8 ounce) package milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped",
"1 (1.69 ounce) package candy-coated milk chocolate pieces (such as M&M's®)" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 175 degrees F (80 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Arrange pretzels on a baking sheet in a single layer. Place a candy kiss on the center of each pretzel."
} ,{
"@type": "HowToStep"
,"text": "Warm pretzels in the preheated oven until candy kisses are shiny and slightly softened, about 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Place a candy-coated chocolate piece atop the candy kiss on each pretzel; press down. Chill in the refrigerator for 10 minutes."
} ]
,"recipeYield": ["40"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vcdwwxfpgn"
},
"reviewBody": "These are great! I also make them with rolos and top it with a pecan half! Same time and temp.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a 200 degree oven for 5 minutes, which worked but kisses were a smidge too soft. I will adjust temp/time on next batch,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The oven temperature of 175 was perfect. I make these every year, and low and slow keeps the chocolate from blooming. They look great after storing them a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It doesn't melt the kisses enough to smooth them much. A little longer time is necessary for a flatter more even bite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Woodin Anderson"
},
"reviewBody": "Be careful these are super addictive and before you know it, you ate them all!!! Our favorite, and a great recipe to help keep kids busy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love these and came out perfect. Can do dark chocolate kisses and dark mms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrissypinson"
},
"reviewBody": "Simple and delicious! Peanut butter lovers try it with peanut butter m&amp;m's. It's my favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evasines"
},
"reviewBody": "I love this recipe and use a variety of kisses {or Hugs} and coated candies to top with. I find my oven needs to be set for 200F and 4-5 minutes to get the kisses melty enough to squish through the pretzels, especially the dark chocolate ones. I'm sure this is due to everyone's oven and elevation being different so do what works for you. 175F is a great place to start. You can add more heat and time, not less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ahmedchri"
},
"reviewBody": "Super easy and everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashley_per"
},
"reviewBody": "It was soooo good. It's a fun snack. Not only that you can alway change out what choclate to use and make it peppermint or dark."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tanzi"
},
"reviewBody": "FIVE STARS for Taste but taking off a stars for Temp and Time!! Like everyone else here I tried the 175 for 2-3 min. The Kiss was still hard. I kept putting them in for 1 min and taking out. SEVERAL TIMES. The 2nd Batch were slightly better. I turned the Stove up to 300 on Convect. It was a total guess but it worked. They weren’t shiny so I didn’t think they were ready. They were. I quickly put the M&amp;M’s on the top and pressed them down. They are NOT the prettiest candies but they taste fabulous. They took hours to harden. I left them in my Kitchen Table for 6 hours then put them in a Plastic Container with a Top. Next time I’ll try the LOW AND SLOW APPROACH. I think I’ll try 175 for 6 min. GOOD LUCK !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessica Wood"
},
"reviewBody": "I have made these for multiple Christmas's, I came here just to check what temperature I needed to bake these at. This recipe says 175 degrees. Like other reviewers said the chocolate never melts and just becomes crumbly. This ruined a whole cookie sheet for me. Make sure your oven temp is higher, I did 350 degrees for my second sheet after looking up a different recipe and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ari"
},
"reviewBody": "waaaaaay longer than 2 minutes in the oven. took me about six. good recipe overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "copsmom"
},
"reviewBody": "I make these whenever I get a sweet/salty craving. The beauty of this recipe is you can make a little or a lot. I have also made them using a Rolo candy instead of a Hershey kiss. The caramel in the Rolo is yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mlk2748"
},
"reviewBody": "Easy treat to make. Unwrapping the kisses took the most time. I only used about 60 pretzels because that was all the kisses I had. The kisses didn’t get soft enough in 2 minutes and had to do it for about 5 minutes at 175 degrees. It is key to refrigerate them so the chocolate can get solid again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndyFan"
},
"reviewBody": "I have made this using Rolo's caramels instead of Kisses and they were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Alvarado"
},
"reviewBody": "Easy recipe, but took 6 min for kisses to soften."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loswald"
},
"reviewBody": "So easy to make. We found that five minutes in the oven was the perfect amount of time. And needed a little more time in the fridge to cool, but otherwise pretty true to the recipe. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alyssa Ulry"
},
"reviewBody": "The only thing correct was the ingredients. 2 minutes at 175 did not melt the chocolates nearly enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lily"
},
"reviewBody": "I found 6 minutes at 175 to be the best cook time for me! Thanks for the recipe so easy, delicious and a perfect treat for sharing with friends and family!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marian"
},
"reviewBody": "I followed this recipe exactly, and after a minute or so in the oven, i take a peek, and...burnt. Had to put it outside for a few minutes because it was setting off the smoke alarm. I have an oven thermometer, so I know it was the right temperature. Not sure what happened there :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sandra C."
},
"reviewBody": "This recipe is wrong. The temp should be 350 for 2-3 minutes. I tried the temp listed and it took almost 10 minutes to get the kiss soft. If you heat oven to 350 then set the timer for a minute and a half. Check them and leave in oven if not ready. Should be glossy and straight on the sides. If there is a slight bulge on the side they aren't ready yet, give them about 30 more seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "I made these with 4 of my grands (ages 7, 7, 9, and 9) for a Halloween treat. We used Hershey Hugs to make them look like the whites of a monster’s eyeball. They had fun making these monster eyeballs and eating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgreeder1"
},
"reviewBody": "Fun for the kids, easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mill Wurray"
},
"reviewBody": "The author of this recipe should really put a warning to not over cook the Hershey's as they'll dry out and get crumbly. \nI did 170, for 3 minutes and they didn't seem melted at all. Left them in for 3 more minutes and same issue. So I took them out and they crumble to a dried out mess when trying to push the candy down onto them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Legenddi"
},
"reviewBody": "Chocolate didn't melt enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sew1215"
},
"reviewBody": "I use the circular pretzals, and they work way better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Carlin"
},
"reviewBody": "This recipes has the temperature exactly right. Cannot use any higher setting or the chocolate over cooks. I left in for 5 minutes at this temperature and all was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyla Patterson"
},
"reviewBody": "I used rolos as my chocolate instead of the kisses. It gave it a caramel taste along with the chocolate. You can also use a pecan on top instead of a m&amp;m if you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Holmes Yoder"
},
"reviewBody": "These little joys are addicting! I am not a chocolate fan, but had to try one! Oh geez they called my name!! So a handful or two later..........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Vermette"
},
"reviewBody": "Very addicting! The teachers always ask for more when we make these for gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly Novak Murray"
},
"reviewBody": "These are simple, but always a hit and ALWAYS requested at my family parties! And you can customize the color of m&amp;m's to match the holidays- so cute!! Note: the \"Hugs\" Kisses (white &amp; chocolate swirled) work out much better, and they are prettier! unlike the plain chocolate ones, they WILL MELT, so be extra careful. As for the plain chocolate ones, i left in for about 2 minutes, when you remove from oven, they begin to soften even more if you let them sit for about 30-60 seconds. Again, as many others have noted- take out of oven when they are shiny or they will be overcooked!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gatti"
},
"reviewBody": "Pay attention to the temperature and the time... I made these but the chocolate never melted. I think I left them in the oven too long (by a minute) and they got dried out. The longer I left it in the oven the worse the chocolate became. It only takes a minute or two for the chocolate to melt. Beware, mine ended up in the trash! If you get the melting right, they are deliciously sweet and salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Lemelin"
},
"reviewBody": "Once I liked to allrecipes, after I ruined a batch, I realized it is an exceedingly easy recipe! Follow the instructions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bermudiana"
},
"reviewBody": "fast and easy. instead of kisses i use Ghirardelli Dark Chocolate Wafers. You can change the color of your m&amp;m's to coincide with the different holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "88keys4god"
},
"reviewBody": "I have always loved these. So easy! Fun variation is peppermint mocha pretzels: a mint chocolate piece topped with a chocolate covered coffee bean instead of an M&amp;M. I tried Hershey's mint truffle kisses, but the mint in the middle made it more difficult to squash the coffee bean on top, so another kind of mint chocolate piece might work better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chinabambu"
},
"reviewBody": "Easy treat that my kids love making with me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "I think this will be a fun recipe to do with grandchildren. The cooking time was definitely more like 6 minutes before the chocolate got shiny and thus the M &amp; M sunk into the chocolate and the kiss stuck to the pretzel. I used heart shaped pretzels and shades of pink and white for this bridal shower, Valentine's weekend sweet and salty addition to the table. I do think the rectangular pretzels provide more of the salty taste however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Living4Him"
},
"reviewBody": "These were simple to make and so yummy. I loved the salt &amp; sweet together. I used different type of kisses and each one melted at a different rate. The white with red peppermint softened better at six minutes at 200 degrees. The regular kisses at 5 min. The caramel center and \"Andes\" type mint kisses at 4 min. For this reason it is best NOT to mix the kisses while baking. Bake them with like kisses because you'll have a mess and frustration (some kisses will be in a puddle and the others not soft enough. I put mine in a green quart mason jar for gifts. Happy Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beanie"
},
"reviewBody": "Great treat for my pre school kids to help with! Tip: I had trouble getting the melt right at 175, so I bumped it to 200 for the 2 min. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm rating it at 4 because I believe parts of the recipe are off: \n1) You need to cook the kisses longer than 2 minutes. For me, it's 5 minutes. \n2) I like to use Snyder's Snaps (but don't use the butter, the chocolate seems to fall off).\n3) Don't put them in the fridge--the chocolate gets chalky.\nI'd LOVE to rate it at 5 because everyone loves ‘em, a great combo of salty and sweet. Just as others have stated you can use Hershey's Hugs (these take less time to melt) or even Rolos. The toppings are also limitless: various nuts (pecans or cashews), different m&amp;m types, candy corn (at Halloween I used s'mores candy corn).\nThe longest part of this recipe is pealing the foil from the chocolate.\nENJOY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Rude"
},
"reviewBody": "I've been making these for years with different combos - caramel kisses, Hugs, peanut butter M&amp;Ms - they are all good. The trick is to take the kisses out at the perfect time - I've found it's 4 minutes at 200 degrees... I put them in little gift bags and add them to gifts. Great and easy, plus the kids can help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tmsully"
},
"reviewBody": "Very easy and kids can do it too. I make a batch for me with just the pretzel squares, no M&amp;Ms - one square on top and one on bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Heather Lyons"
},
"reviewBody": "The oven temperature is definitely wrong! I had them in at 175 for 6 minutes and still wouldnt melt. I went to another site and it said 350 for 2 minutes. That was exactly right. I would recommend changing the oven temperature before burning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenverk"
},
"reviewBody": "i needed 6 minutes exactly at 175 for perfect squishiness for adding the M &amp; M s. they disappear - so hide them if you are saving for something special. also, I also put on parchment paper. works well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charshaff"
},
"reviewBody": "So so easy. It took about three minutes for the kisses to melt down perfectly. I love this recipe because my three and five-year-old boys can help me and there's pretty much no mess involved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Chace"
},
"reviewBody": "Quick and easy to make. They also look super festive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanclaners"
},
"reviewBody": "Super easy and delicious. They are always a big hit with the kids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherylrc1"
},
"reviewBody": "I've been making this recipe for years. Thanks for sharing it, little ones like helping with this one too. The treats look so festive on a platter, I usually mix them in with other Christmas cookies or brownies and it looks like I labored much. As some others have said, you can vary this. I use Rollo's and place two pecans instead of the candies for easy turtles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RBANIGAN"
},
"reviewBody": "I've been making this recipe for years and it's a favorite! Usually I use the Hershey's Hugs Kisses, but this year I tried Candy Cane Kisses. Delicious! The big tip I have is that instead of 2 minutes, it will take 5-6 minutes at 175 degrees for the Kisses to be soft enough to press down with the M&amp;M."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Brown"
},
"reviewBody": "there great for party snacks,and really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe! I make it for our LSU tailgate with purple and gold M&amp;M's! I did mess up a batch today by having the temp too high---kisses cooked! They were hard and I could not put the m&amp;m on it. What can I use them for now? I really do not want to lose them if I can help it...Any ideas?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Best recipe to do with young kids and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Heiberg"
},
"reviewBody": "Jennifer, this happen to me yesterday. the temp was too high, so that's when i found this recipe, oven set at 175 and put in oven for 3 min, just enough to soften them and then atop each one with m and m s.. yum yum, my kids want more.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShueJJ"
},
"reviewBody": "Rollos are our favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wbk"
},
"reviewBody": "Jennifer-- Sounds like you left them in the oven too long. When the kisses are over done they are crumbly. Just takes about 2-3 minutes at most to soften the kisses. When they become shiny take them out and add the m&amp;ms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "I loved this, super easy and quick recipe. Dangerously addicting. I made them for my Christmas party, using all red and green M&amp;Ms. In addition to using kisses with M&amp;Ms I also used some kisses with peanut butter M&amp;Ms, and mini Rolo's with peanut butter M&amp;Ms (those were the biggest hit). As long as you don't overcook the Rolo's they won't make a gooey mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Tadlock"
},
"reviewBody": "Very good and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Chadwick Nash"
},
"reviewBody": "Very simple and fun to do with the kids, even young ones. We listened to Christmas music, unwrapped kisses and enjoyed our time thoroughly. We used the circle pretzels and Christmas color M &amp; M s. Great, easy, stress-free holiday treat. Thx."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SugarLush"
},
"reviewBody": "I make these with PeanutButter M&amp;M's. Around here they are called PMS cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janalee86"
},
"reviewBody": "So easy and so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akinom"
},
"reviewBody": "This recipe is amazing! It is such a great, little idea! We have tried pretzels, hershey kiss, and a rolo. It's very good but not pretty looking. I make these as little teacher presents for the holidays. They do end up having to stay in the oven for longer than 2 minutes, you just have to watch them very closely. If they are not the correct consistancy then you end up with partly squished kisses that aren't very secure on the pretzel. Very good recipe, I usually end up eating more than a few while making them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Askin"
},
"reviewBody": "These are so easy to make my three year olds help. I could fine pretzel rings so I used regular pretzels. No problem"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "casadam"
},
"reviewBody": "Had to cook longer than 2 min to get it the right softness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mscheibe"
},
"reviewBody": "So good and SO easy! My 8 year old and I made these together and it was not a problem. Adults like them as much as kids, and they are great for parties. In my convection oven it's 200 degrees for 4 min, but it is not very touchy so you can do whatever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JChicago"
},
"reviewBody": "Fantastic tasty snack and it can't get any easier than this! What's not to love - salty pretzels and delicious M&amp;M chocolate with a little crunch! Tastes delicious a little warm but even better after chilled. Make it festive by using your favorite colors, or the current holiday colors. Hide the \"M\" logo by pushing that part into the chocolate. You can use circle pretzels and call them Owl Eyes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathrynG"
},
"reviewBody": "Fantastic little treat to bring to parties. Very little effort for maximum taste and presentation. I also use the square pretzels because they hold the chocolate a little better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sunshinebluesky"
},
"reviewBody": "Simple, Festive, Tastey :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Waterless Cooker"
},
"reviewBody": "Forgot to add that we used the little square pretzels (Snyders of Hanover 'SNAPS')and peanut butter M&amp;M's in Christmas colors....mmmmmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bermuda09"
},
"reviewBody": "Made these for the first time yesterday...had lots of leftover kisses so this recipe was perfect. I added more oven time(total of 5 minutes) to soften the kisses. Easy and very addicting!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENMEIER"
},
"reviewBody": "Easy. And always a crowd pleaser!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANJACKSON"
},
"reviewBody": "Don't let the simplicity of this great recipe fool you - these cute little treats are always a hit and take very little time to prep! They are easily switched up with combinations and can be done in Christmas, Halloween, Easter colours etc! I have used various types of Hersey Kisses (striped ones, plain, etc) along with either M&amp;M's or smarties - all with great results! I have even used mini rolo type chocolates instead of the kisses. Love this one :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke"
},
"reviewBody": "Try making with the Hugs style Hershey's Kiss. The stripes with the candy looks so pretty! I usually do Christmas M&amp;M's but I think this year, I will use Halloween colors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbillin2"
},
"reviewBody": "These were delicious! They were so quick and easy too! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Captain1200"
},
"reviewBody": "What NO reviews? People miss the simpler things in life. Well I can say for sure, that if you make these , they will not last long. Way to GOOD. We use Peanut M&amp;M's atop the Kisses when they come out of the oven. Bet you can't eat just one!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223594/chocolate-pretzel-treats/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
"name": "Chocolate Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17158/desserts/chocolate/milk-chocolate/",
"name": "Milk Chocolate"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223594/chocolate-pretzel-treats/",
"name": "Chocolate Pretzel Treats"
}
}
]
}
}
, "about": [
]
}
]