				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Angel Food Cake II"
,"datePublished": "2020-06-18T23:05:06.000-04:00"
,"dateModified": "2020-06-18T23:05:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "veggigoddess"
,"url": "https://www.allrecipes.com/cook/195519"
}
]
,"description": "This is a yummy change to standard Angel Food cake. It has a light and delicate flavor and hits the spot of that chocolate craving. Note: for best flavor and texture, serve the cake on the day it&#39;s made and be sure to avoid any traces of yolk in the egg whites, which would prevent them from whipping to their fullest."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OZ99eiGFbehNsbSRinN7NuxrKdc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/204031-a5f76a2c082a4f56b0949384425b82a2.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Angel Food Cake II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "51"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "222 kcal"
,"carbohydrateContent": "45 g"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "126 mg"
,"sugarContent": "35 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.75 cup cake flour",
"0.25 cup unsweetened cocoa powder",
"1.5 cups white sugar",
"3 (1 ounce) squares semisweet chocolate, grated",
"12 egg whites",
"1 teaspoon cream of tartar",
"0.25 teaspoon salt",
"0.25 teaspoon vanilla extract",
"1.5 teaspoons lemon juice",
"confectioners' sugar for dusting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). If it does not have a removable bottom, line a 9 inch tube pan with parchment paper. Sift together the flour, cocoa and 3/4 cup of the sugar. Set aside. Measure 3 tablespoons of the flour mixture and toss with the grated chocolate."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, using an electric mixer set at low speed, beat egg whites until foamy. Increase mixer speed to medium, stir in cream of tartar and salt, and continue to beat until egg whites form soft peaks. Gradually mix in the remaining 3/4 cup sugar and beat until stiff peaks form. Stir in the vanilla and lemon juice."
} ,{
"@type": "HowToStep"
,"text": "Gently fold the flour mixture into the beaten egg whites, then fold in the grated chocolate, stirring just until no white streaks remain."
} ,{
"@type": "HowToStep"
,"text": "Gently scrape the batter into the prepared pan. Smooth the surface of the batter and tap the pan lightly to remove any air bubbles. Bake in center of the preheated oven for 60 minutes, or until the surface springs back when touched. Cool completely, and sprinkle with confectioners&#39; sugar before serving, if desired."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Dooley"
},
"reviewBody": "Have chickens so we have more eggs then we can eat. Made this cake and it did not last a day. I am constantly being begged to make it again. I made it just as the recipe says except I used all organic ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Zimmerman"
},
"reviewBody": "This was my first try at making a chocolate angel food cake or any type of angel food cakes for that matter. I made it for a trifle recipe. In retrospect, I wish I'd have served the cake in a more simple manner. It was very light in texture yet beautifully moist unlike store bought cakes which can be dense and dry. I most certainly will make this cake again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "llegros"
},
"reviewBody": "Easy to make. My guests had never had chocolate angel food cake before. It was a hit. I used chopped up chocolate instead of grated. I topped with whipped cream and strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Apple Tennis"
},
"reviewBody": "Delicious and addicting...Fabulous recipe!!I served it with a fresh chocolate whipped cream and some toasted almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "WE did not like this one at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nici"
},
"reviewBody": "Well worth 5 stars! It's light and airy, and moist and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "peachpearplum"
},
"reviewBody": "I had never heard of chocolate angel food cake until I found this recipe. I followed the recipe exactly, and the cake turned out OK... it wasn't great and it wasn't horrible. It was definitely a lot denser than normal angel food cake, and also not as moist as the angel food cake I am used to... I will not try this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marljong"
},
"reviewBody": "Angelically light and delightfully delicious! I mix all the grated chocolate with all the flour/cocoa mixture first and then proceed with the folding; much easier than the instruction for separate folding and less chance of deflating the egg whites. Also, have to remind myself NOT to grease the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Larissa"
},
"reviewBody": "This. Is. Fabulous. I had a little trouble getting the stiff peaks the recipe calls for, but having made a few angel food cakes before, I just forged ahead and hoped it would taste the same. It rose a little in the oven, and came out beautifully. Like the biggest, prettiest chocolate meringue cookie you've ever seen. My family couldn't keep their hands off it. My one caution is to really let it cool in the pan completely - I didn't, and mine fell out of the pan and cracked when I flipped it to cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Culbertson"
},
"reviewBody": "Wow was I ever impressed by this recipe! I love angel food, but I thought putting chocolate in was going to take away from its goodness, but I decided to try it anyways.I am so glad I did! This was better than regular chocolate cake! I used all the indredients as stated, except I took my semi-sweet chocolate (all I had was chocolate chips) and but it in my coffee grinder. Then I ground it for about 15 seconds and viola! powdered. This makes is so when you take a bite of cake it is savory and almost melt in your mouth. There are no hard chunks, just wonderful, light, chocolatey goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "Well this may be My new favorite cake! Not real difficult to assemble. I didn't have the chocolate squares to grate I did have about 1/2 cup of chocolate chips I put in the food processor for a bit and toss them with some of the flour and added them. Wow those extra bites of chocolate are wow! The cake would be good without the added chocolate but who would want to do that? Really does have a brownie like flavor with the lightness of Angel food cake! Yep a keeper! will do again for sure!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi"
},
"reviewBody": "Delicious! I am not a huge Angel Food Cake fan but this cake changed my mind. It was fluffy, moist and rich. I served it with whipped cream and fresh raspberries. It was a big hit. My husband loves angle food cake and he now has a new favorite recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catarina"
},
"reviewBody": "I made this last night and didn't exactly follow the instructions. I put too much cream of tartar and instead of mixing 1/2 the sugar with the dry ingredients, I mixed it all. So when I had to form stiff peaks I had to do it with the dry ingredient mixture. But it still came out fabulous! It was moist and had a great chocolate flavor. And you don't feel as bad eating it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shayshay27"
},
"reviewBody": "YUM!!! YUM!!! I used 1/3 cup of semi-sweet mini chocolate chips for the recipe. Also , I served it with homemade whipping cream and fresh strawberris!! Better than the plain one!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Cartier"
},
"reviewBody": "WOW WOW WOW!!! \"chocolatey\" and light - I served this with strawberries and cool whip - and I'm baking another one only one evening later! I'm converted...no more plain angel food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Very yummy... I left the grated chocolate in more of pieces and the cake turned out just fine. It looks really pretty with the chunks of chocolate showing. Thanks for sharing :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fluffy"
},
"reviewBody": "Lovely recipe, however I chose to eliminate the lemon juice, upped the vanilla to 1/2 tsp, and added 1/4 tsp of almond extract. Next go-round I will mix in some powdered instant coffee into the chocolate/flour mixture. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryJo"
},
"reviewBody": "This cake was easy to make and tasted absolutely wonderful. I made it exactly like the recipe and finely grated my chocolate so there were not any pieces. I might have to try it next time with grating the chocolate in larger pieces. It serves up very pretty with sliced berries and a little whipped cream. Will make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "6MOUTHS"
},
"reviewBody": "This was ok. We always make regular angel food cake but wanted to try something different. I wasn't sure how this would come out but it was a nice change. I left out the chocolate chips because I was out and it still had a good chocolate flavor. I'll probably stick to the regular one but this wasn't bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "r_l_c"
},
"reviewBody": "I made this cake for my younger sister's 13th birthday. I agree that it was simple to make. It was not very popular, however. It turned out very spongy. It was more like bread than a cake. It did look like angel food cake, but it didn't taste nearly as good as it looked. I will not follow this recipe again. There has to be a recipe out there for a genuine, chocolate angel food cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Wow. This cake got rave reviews at my husband's birthday party. Everyone was impressed that I was able to make this from scratch. The recipe was so easy to follow and just perfect. I dusted with powdered sugar to \"pretty\" it up. Grandma is still raving about it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "This cake was absolutely amazing. I made it for a dinner party and it was a huge hit with my guests. The cake was moist, and the little chocolate chunks added great flavor, yet the cake was not overwhelmingly sweet. I served it with fresh berries and homemade whipped cream. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Made this last year for Clare's birthday and she's still talking about it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "thisblondcancook"
},
"reviewBody": "It got eaten, but I'll never make this one again. It didn't have the angel-foodish texture I'm used to. Sorry, I didn't think it lived up to the hype."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TEACHINMOMOF3"
},
"reviewBody": "AMAZINGLY!!!! Awesome chocolate taste, wonderful texture. I made this with unsweetened chocolate instead of semisweet chocolate and we absolutely love it. Very well written and simple to follow instructions. I will definitely be making this again very soon and probably quite frequently. Thanks for a wonderful recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather C"
},
"reviewBody": "This is my new signature recipe! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D Morello"
},
"reviewBody": "Thanks Karla! This was the most moist and airy angel food cake ever. Just chocolate-y enough to satisfy those cravings. I used Marsha's Chocolate Glaze II and it was perfect - my husband could hardly believe it was fat free!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bobbi"
},
"reviewBody": "this recipe was okay. i made it for my in-laws they liked it but it just seem to be missing something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJGUETSH"
},
"reviewBody": "Wow - This was great! Very easy to make and delicious. A nice change from regular angel food. Smelled just like brownies as it cooked!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had made this cake, and it was very good! The chocolate angel food really hit the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "Light, airy and wonderful Karla. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Trachtenberg"
},
"reviewBody": "I made this for a friend's birthday. We enjoyed it with homemade lemon curd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLMARTI"
},
"reviewBody": "Incredible. I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANDIBARR"
},
"reviewBody": "This cake is HEAVENLY!! It turned out just as I hoped it would! I followed the directions as they are written, and am VERY happy with the results!!! This will be the thing that I take to all of the pot lucks this summer!! I may add some mimi choc. chips or not grate all of the chocolate down so fine next time, I think that would make it even better. Thanks for the WONDERFUL cake!!!! HIGHLY RECOMMEND!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TAURUSGIRL"
},
"reviewBody": "This cake wasn't as good as I had hoped it would be from the other reviews. That didn't keep me from eating it all! It had a funky taste. (maybe the cocoa powder) I love angel food cake and I love chocolate - but this isn't something I can't wait to make again. I'll stick with regular angel food cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Wiens Craddock"
},
"reviewBody": "Can I just say DELICIOUS?!?!?!?!?! I agree with the one reviewer who said this is the perfect chocolate flavor - not too sweet, not too bitter, and not at all 'fake' chocolate tasting. Perfect!!! Directions are very good, was very easy to prepare. After it was completely cooled, I dusted the top with powdered sugar, and served the cake with some fresh sliced strawberries. If you like the light texture of an angel food cake, and the flavor of a rich chocolate brownie, you will LOVE this dessert!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSA-ATL"
},
"reviewBody": "Delicious! The most time consuming part of the recipe was whipping the egg whites--but it was well worth it. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the first angel food cake that I have made and it turned out great. The directions were very easy to follow. I will make this recipe again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALICATS"
},
"reviewBody": "Very good and pretty simple. The instructions were very well thought out. I am going to make this again tonight. Mine turned a bit flat but I think my eggs were too old or I cooked it too long. I also used chips I just chopped them with a knife. I liked the little chocolate chunks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this cake! I'm a picky eater. Its the best cake in the world, i will make it again someday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "what a wonderful light fluffy cake.my kids loved this one! I love to bake and this one will definately be made again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my 1st attempt at a chocolate angel food &amp; my 2nd attempt at any homemade angel food. It was scrumptious, light, &amp; just right chocolatey. I didn't have any semi-sweet choc. squares so I ran 1/3 cup of choc. chips thru my Thunderstick Food Processor. I've made 2 angel foods so far w/my new Kitchen Aid &amp; they're both WONDERFUL! THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved this nice light and moist cake. Especially good for dieters. Had this for my daughter's birthday and everyone loved it. Florence"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oh My GOD!!!! I thought I was going to pass out from smelling it baking. It's awesome! I to added bittersweet chocolate, but in addition to the semi-sweet. I also grounded up some of the chocolate in my processor and sprinkled it on once it was cooled. I'll never make or eat regular angel food cake AGAIN! It just wouldn't be right.:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Honey"
},
"reviewBody": "I used 3 oz of unsweetened chocolate instead of the semi sweet called for in the recipie. We prefer a more rich tasting chocolate and this fit the bill perfectly. My husband does not like angel food cake because it's too sweet - but he liked this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "If it takes more than 2 people to eat this you made it wrong!!! This has quickly become a favorite in our house. It's definately worth the extra time &amp; effort this cake takes. Fresh strawberries &amp; whipped cream make this even more amazing, but they're not needed."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23733/chocolate-angel-food-cake-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
"name": "Chocolate Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23733/chocolate-angel-food-cake-ii/",
"name": "Chocolate Angel Food Cake II"
}
}
]
}
}
, "about": [
]
}
]