				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Mousse"
,"datePublished": "2000-04-08T14:13:28.000-04:00"
,"dateModified": "2022-12-05T11:12:48.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Sharon"
,"url": "https://www.allrecipes.com/cook/24328156"
}
]
,"description": "Traditional chocolate mousse recipe made with semisweet chocolate, hot water, and eggs."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/faD5ANF-jPewDmanxmtfu2IZ31M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/802464-14789d85bc834bb294ee6cdb775e715b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Mousse"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "123"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "156 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "106 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "88 mg"
,"sugarContent": "13 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup semisweet chocolate chips",
"5 tablespoons boiling water",
"4 large eggs, separated, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place chocolate chips in a blender; pulse until ground. Add boiling water and blend until chocolate is melted. Add egg yolks, one at a time, blending well after each addition; transfer to a mixing bowl."
} ,{
"@type": "HowToStep"
,"text": "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Gently fold egg whites into chocolate mixture. Pour mousse into wine glasses or other serving glasses and chill in the refrigerator until set, 2 to 3 hours."
} ]
,"recipeYield": ["7"]
,"totalTime": "PT135M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redsprinkles"
},
"reviewBody": "I can’t believe how easy this is!!! When I saw the steps I doubted it would be that good because of its simplicity, but it is excellent!! I think some of the people having trouble making this fluffy may be mixing the ingredients together normally instead of folding"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooper"
},
"reviewBody": "I liked it so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This makes for a quick dessert with intense chocolate flavor that is light and creamy. I find it to be very rich, so I used a variety of vintage punch cups for the perfect serving amount and to make a cute and interesting presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "I followed the recipe exactly, and it was delicious, but a bit gritty. It looked like all the chocolate melted, but maybe it hardened up some when I added the eggs. Very rich and firm with intense chocolate flavor though, so other than the grittiness, it was perfect. And so easy! I will try warming the eggs to room temp next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lenne Baldwin"
},
"reviewBody": "So easy! So scrumptious! Tasted like I cooked for hours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene Zagorski"
},
"reviewBody": "I’ve been making this recipe for years thank you for posting this! simple easy to follow turns out flawless everytime! I do the egg whites first set aside 5tbl of water is perfect haven’t had the chocolate seize yet. if your looking for decadence this is it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Notari"
},
"reviewBody": "Made this twice. The first time the chocolate did not melt completely. The second time, it was perfect. The second time, I made sure I ground the chocolate much finer. I also, made sure to beat the egg whites while I was melting the chocolate and adding the egg yokes. Had I done all of that the first time, I would have rated this recipe 5 stars. I also used 60% cocao chips. So much richer. A great recipe over all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma of 14"
},
"reviewBody": "I'm serving a light French-influened supper, so wanted something light and easy to make. This recipe served me well. It is super easy! It is also delicious and my Francophile guests loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dirtydan"
},
"reviewBody": "Incredibly simple and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AllyF"
},
"reviewBody": "Use good chocolate morsels. I used nestle and it would be better if you used a little better quality morsels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Bruegger"
},
"reviewBody": "I’ve never made mousse before and I found this recipe super easy. I melted the chocolate chips in a metal bowl over a pot On the stove and left out the boiling water. I still need practice with folding the egg whites into the melted chocolate but it still turned out nice. I did have some hard chocolate pieces in my mousse. I wonder if it’s because I took it off the warm water to fold in the egg whites. Anyone have this happen and know why?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TinyCook2003"
},
"reviewBody": "Easy to make, great taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lou Lou"
},
"reviewBody": "I added a dash of milk and a tiny bit of peanut butter to the egg whites. I also mixed in some peanut butter chips with the chocolate pieces; as well as some finely sliced chocolate noir with pistachio that I bought in sur de France. I had a little trouble folding the egg white mixture into the chocolate/egg yolk mix so I blended up a bit of extra chocolate with a dash of hot water and added it to the mixture for better consistency and richer flavor. Love your recipe and I thank you for it ! Elina"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "Very easy to make and tastes really good! I used it as a topping for a cream puff cake I made. Big hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "I loved this! I was very happy with the results. I mixed it up a little because instead of putting in the water all at once, as recommended, I put it in over the course of the recipe, which I would recommend. With this tweak my mousse was creamy, smooth, and delicious! I also made homemade whipped cream and ground up pistachios, chocolate, and salt, and used it as a great topping. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennifer"
},
"reviewBody": "I should have beat the egg whites first because it took so long the chocolate and egg yolks got hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Levy Kids"
},
"reviewBody": "I made this for a party and everyone loved it. Instead of eggs, I used whipped cream. I refrigerated it for 30 min. I also recommend serving with whipped cream on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I just made this. I didn't have any chocolate chips so I use butterscotch chips. I can't wait to try it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mommykahan"
},
"reviewBody": "The taste was ok but it separated. I was left with runy egg at the bottom of each cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shafs10"
},
"reviewBody": "This recipe was easy and quick. Ideal for last moment dessert preparation. Taste really good !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Q."
},
"reviewBody": "Worked very well for me. I used high grade dark chocolate chips. They melted instantly with the addition of the hot water, no need for blender, microwave or double boiler, although I was prepared to use the microwave. Be sure to have the egg whites beaten and ready for the final mixing so that the chocolate doesn't cool and set before you are finished. Makes a very dark, rich mousse, which I love. I added whipped cream on top which helped to soften the intense flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D.S.R."
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nessy3635"
},
"reviewBody": "Omg! This is some of the best Chocolate Mousse I've ever had. Great recipe, super easy, and it tastes DEVINE! Here this: when I was seperating the eggs, I got a double yolk!! Anyway, the recipe is so easy anyone can make it! And the Mousse tastes RESTAURANT quality! Two thumbs up!YYYYYYUUUUUUMMMMMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hannahkaleel"
},
"reviewBody": "I have made this recipe a MILLION TIMES!!! Its a hit and everyone loves it you would never know its so easy!!! I have made a couple of changes though, i met the chocolate in a double boiler, add no egg whites and just fold the chocolate into the whipped egg whites and let in set in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shingala"
},
"reviewBody": "So easy and so good! Items that are always on hand, great for those chocolate craving pinches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tetya"
},
"reviewBody": "Ridiculously Gooood! Very Rich! I made it as written for 7 servings and it fitted in 4 wine glasses. I was like, good thing I didn't rescale the recipe to 4 ppl because it just enough for 4. Put it into fridge for about 20 hrs. Next day I whipped up heavy cream and decorated with Strawberry and shaved chocolate. It was very delicious, as you can feel its naturally good without any packets of mixes... However its very rich. So maybe one full wine glass was too much for me, but my bro didn't complain about it as \"too much\":)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ Pickles"
},
"reviewBody": "Ok so I was nervous about raw eggs but decided to give it a go. I've never made mousse before and this was so easy. I used a double boiler for the chocolate and beat the whites like it said. Then after folding it together I worried like everyone else whether it would set. This was VDay dessert after all. It set by the time I got home 5 hours later. Now I must warn that it is ultra-rich which the wife loved. I'm not so much of a chocolate lover so she ended up taking mine to work this morning. As for presentation I used the raspberry sauce recipe on here and encircled it with the cream-filled strawberries recipe on here as well. A few fresh raspberries, whipped topping and shaved dove chocolate. Voila, I just have to say thanks to Sharon for the recipe, quick and simple and she told me it was the best thing ever. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baker's Square"
},
"reviewBody": "This was an excellent mousse, and so easy to make! My only complaint is that there's not very much of it. Next time I'll double the ingredients. I also found that putting the boiling water in the blender all at once didn't quite do the trick, so I boiled just a little bit more water and poured it in. Definitely a repeat recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raquel1"
},
"reviewBody": "This came out so rich and delicious it was a wonderful success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cameo"
},
"reviewBody": "I wanted to try a new mousse recipe and when I looked at this one, I was hesitant to try it but did so anyways. Steps are missing, and my mousse came out to a chocolate pudding consistency even when folding it gently. Never going to use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaybay"
},
"reviewBody": "this looks good but raw egg!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allya123"
},
"reviewBody": "wow this was surprisingly good. there are only three ingredients so i was alitte if-y at first, but it was amazing. its so simple to make and totally taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kora_lee"
},
"reviewBody": "Great mousse! At first I was doubtfull with there only being three ingredients, but it was simple and very chocolatey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bebeme7713"
},
"reviewBody": "it wasnt fluffy at all! i followed the ingredents but it was just a cup with melted chocolate ! it was good but come on"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABY"
},
"reviewBody": "This is so Rich and Creamy!!! I wouldn't change a thing...well maybe add a dollop of Coolwhip or a spray of Rediwhip :):):) Even though the serving size says 7 serving, I ended up with only 3 servings. Oh well...still 5 stars in my book :[]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra"
},
"reviewBody": "This is so good and ridiculously easy. I've made it plain and I've made it with almond extract (mix in about 2 Tbps with the boiling water) love it both ways!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jft135"
},
"reviewBody": "Very good, but very rich. Next time I'll put whipped cream on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thenuttfamily"
},
"reviewBody": "This was AWESOME! I have a VitaMix blender so, after reading some reviews, I made sure to pretty much pulverize the chocolate before adding the boiling water. Also, instead of folding the egg whites into the blender, I poured the chocolate into a bowl and then carefully folded the egg whites into the chocolate. It is very important to do this gently so everything doesn't collapse. Turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SLS73"
},
"reviewBody": "Consistency/texture is weird. Soupy when prepared but after a few hours in the refrigerator my husband described it as \"marshmallowey\" which was a perfect analogy. Nice recipe as there is no added sugar or heavy cream, ingredients are normally on hand, flavor was good, texture was just strange. Would possibly make again in a pinch?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBINBRADY"
},
"reviewBody": "Love how easy this recipe is with so few ingredients. I only had bittersweet chocolate chips the second time I made it so I added one teaspoon of sugar per ounce of chocolate. \r\nI like making this in my Ninja blender because it is much easier to get out all the rich chocolate goodness to blend into the egg whites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lil' chef"
},
"reviewBody": "I made this last night and wow! it was great! i let it set over night and this morning i tasted a little. the only thing, mine was kinda watery i would add a little less water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hpaller"
},
"reviewBody": "Good, but too little chocolate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "so rich and creamy, and so easy! my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meaghan1127"
},
"reviewBody": "i found this recipe almost a year ago and i LOVE it. Its so easy and so yummy i was going to try a diffrent recipe for mousse but i couldnt cuz i dont think another recipe would be as good! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "travelangel"
},
"reviewBody": "It was very yumm but also very rich tasting. I did melt the chocolate in the microwave first. I did end up with a few solid chocolate pieces after I mized in the egg, but my husband loved it and thought I had done it on purpose!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RecipeZAP"
},
"reviewBody": "good recipie. but dont grind the chocolate chips. wat i did is i put them in a mudium bowl and added about 5-6 tablespoons of boiling water. and took the pot (which had about 2 cups of water left) and put it on my counter and placed the bowl on top of the pot so the stam helped melt the choclate. and stirted it till the choclate was melted. the egg whited is wat maked the mouse very fluffy. i let it sit 4 a bout 20 mins. good, easy and cheap mouse."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fay"
},
"reviewBody": "Who would have thought that you could make chocolate mousse without cream? I didn't have semi-sweet chips so used milk chocolate instead. Also, followed the suggestion to use coffee in place of the water. When I first poured the mixture into the dishes, was afraid that it would be too runny but, after a few hours in the fridge, it set up to the lightest, airiest mousse I've ever made. Thanks for sharing your recipe - It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allison14"
},
"reviewBody": "Good, simple recipe. I usually make this once a month or so. Great desert to make when having company over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swimminash"
},
"reviewBody": "Happy to have finally found a recipe that doesn't call for heavy whipping cream, but uses cheaper, more common ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Delicious and light. I give it 4 stars because I was leery about the chocolate melting properly and mixing with the egg yolks, and I would prefer the eggs to be cooked as much as possible. I prepared everything in a double boiler, then folded in the whipped egg whites (with a little cream of tartar). I made a tart using a walnut crust...really delicious and the mousse came out very light. Fantastic as I was looking for one without cream, and I will definitely make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly McAllister"
},
"reviewBody": "This was so easy, that I was almost nervous about it, but it turned out great. I used a double boiler for the chocolate and then whisked in the boiling water. It came out incredibly rich and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOBER007"
},
"reviewBody": "This is a very easy way to get great results. My wife served the mouse in martini glasses with a piece of dark chocolate that she melted into a stick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jastya"
},
"reviewBody": "I am not completely new to cooking, but this is my first attempt at mousse. I'm assuming I've done something wrong, or the area I live in (very humid island) has affected this recipe. Even with close attention to the eggs, and folding in gently, this turned into a soup at the bottom and a slimy, bubbly mixture on top. I can't say I have the drive to try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mr. B"
},
"reviewBody": "This was a quick and easy recipe for a novice. It was delicious and my family really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "Fabulous. My chocolate mixture was a little too warm so the bottom of the glass had more of a pudding mixture and the tops were fluffy. I added some hazelnut extract to the egg whites. Really good I will repeat often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy T."
},
"reviewBody": "I really like this recipe! I added some dark chocolate shavings to the mousse, then served it with some whipped cream and more chocolate shavings. So simple and sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CeceMarie"
},
"reviewBody": "It was pretty good. I had a very hard time getting it to set, but it still tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissLovett"
},
"reviewBody": "I made this for a class Christmas party and everyone loved it! I couldn't quite get the eggs to whip right but once I'd chilled it the mousse was fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ted Streuli"
},
"reviewBody": "Good but not great. Had a hard time with these instructions getting the choclate to melt, and there's no way the egg whites were getting folded in with the chocolate still in the blender. Getting the chocolate out of hte blender proved to be its own challenge. On the bright side, it set up in less than an hour in the fridge. It was improved by whipped cream garnish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nefretini"
},
"reviewBody": "Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SaelinCooks"
},
"reviewBody": "Easy and tastes like mousse is supposed to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laura H."
},
"reviewBody": "Raw eggs!!! No thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli O'Dell Morris"
},
"reviewBody": "I have made something similar to this recipe in the past-In the other recipe, I used milk rather than water and cooked the entire egg, rather than using the egg whites. My family loved the taste, but it was so rich, they couldnt finish a small serving.\nI put the chocolate chips in a glass bowl and microwaved it for 45 seconds, then mixed in the boiling water. I used an immersion blender to mix in the water and the egg yolks one at a time. It worked great and not too much mess to clean up.\nI wasnt sure how the hot chocolate mixture would do with the egg whites, but they werent too bad to encorporate(folded them in with a large spatula)\nI put spoonfuls into glass ramakins and they set up beautifully.\nMy family loved the taste and texture-it was rich, but not cloying. They finished the entire cup&gt;(I got about 5 servings)\n\nGreat recipe-very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krstn12494"
},
"reviewBody": "This is really easy and tastes great! I did make the egg whites first so that I could fold it in right away. I was really GREAT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakergirl"
},
"reviewBody": "This was so GOOD. I had low expectations from this recipe. I wanted something very creamy and light and I doubted that eggs could give me what I wanted, but it was WONDERFUL!!!!!!!! I love this recipe!\nIt is very chocolaty so if you are not a big fan of chocolate, you might not like it. I used dark chocolate when I made this mousse, and we definatly need milk with it. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dotwarner"
},
"reviewBody": "It was soooo easy!!\nWhat happened to mine was I think I didn't melt the chocolate completely, so there's like super tiny chunks in the mousse which actually added specialty to it! weird but special* =P"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aderne"
},
"reviewBody": "this recipe was so easy and delicious i will definately be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "catmaxwell"
},
"reviewBody": "Very delicious! Great chocolate flavor, and I loved the texture. My family loved it and my sister was oohing and aahing the whole time she was eating it! I just made it plain, but it would be even better with some whipped cream to top it off. I'm saving this recipe, and I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iverylamemeh"
},
"reviewBody": "this one is easy to make and not too sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timiah"
},
"reviewBody": "Simply AMAZING! I was worried at first because the melted chocolate and whipped egg whites became rather soupy, but once refridgerated it was the perfect mousse. It tasted like I used dark chocolate [which is my favorite]. Oh and i used the double boiler method- worked perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah Phillips"
},
"reviewBody": "not too bad, pay attentiont to eggs!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Anguis"
},
"reviewBody": "This mousse is definately easy, and does taste good, but the texture is more like brownie mix than actual mousse."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steph H."
},
"reviewBody": "Really quick and super easy to make, and it actually tasted quite good. I microwaved the chocolate chips and then whisked it with the hot water until smooth, less dishes that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shiitakehappens"
},
"reviewBody": "THE BEST! Doesn't get any easier or more delicious. I melted the choc. chips in a bowl in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerri Leigh"
},
"reviewBody": "Very easy to make and very impressive to my guests. It made me look like I know what I'm doing! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Simpson"
},
"reviewBody": "delicious! try adding a layer of vanilla pudding or creme brulee...it looks amazing and adds a whole new layer to the flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sophi"
},
"reviewBody": "The mousse did not turn out fluffy at all. Instead, it was like a puddle of chocolate syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "20+yrs ago i first found this recipe in the 2nd or 3rd sequel to \"recipes from the back of boxes....\" i couldnt find my cookbook and was hunting online for awhile! so glad to find this. too bad for those who think this is too chocolatey! like so many simple things, overthinking this one can ruin it, but keeping it simple keeps it foolproof."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmencita"
},
"reviewBody": "this is such an easy mousse that I didn't think it would be that good but it is AWESOME and so, so easy!!!! I recommend it, for yourself or for a dinner party, it can look as elegant and elaborate as you want, all you have to do is decorate it with chocolate shavings. I didn't find it at all bitter, so you can add whipped topping if you like but its not necessary at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my family and they all liked it except my little brother. It was the first mousse I made and the first food I tried to make look fancy. I sprayed on some whipped cream, crunched up some Hershey Kisses and sprinkled it on, and stuck a peppermint stick on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TinaColada"
},
"reviewBody": "Over all decent recipe. Although, the end consistancy of the mousse isn't what I expected at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bekah Massey"
},
"reviewBody": "This mousse tasted fantastic. I did have a little trouble getting all of the chocolate out of the blender. I think it would be easier in a good food processer. Also, I don't think the servings are quite right (It made 3.5 servings for me.) I served this in a wine glass, topped with a little homemade whipped cream (I made the whipped cream a little less sweet so that it would balance with the rich mousse) and some chocolate shavings helped make a beautiful presentation when serving to guests. My guests loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frantic Cook"
},
"reviewBody": "Very impressive mousse! I melted the chocolate in a double boiler, because I'm paranoid about the chocolate seizing. I also whipped up a bit of cream, folded the chocolate in, and then added the whipped egg whites to make the mousse a bit creamier. I do like the fluffiness that comes from the egg whites in this recipe though... it's like eating a chocolate cloud! I used half milk &amp; half dark chocolate (found pure dark to be too rich the first time around), and waited until it had cooled to body temperature (test temp on your wrist) before adding the egg yolks. The chocolate-yolk mixture gets quite thick, but if you fold it right after you combine the yolk &amp; chocolate, it blends just fine. For added pizzaz, I drizzled some melted chocolate in random patterns onto waxed paper, cooled it in the refrigerator, then broke off the chocolate \"designs\" and stuck it into the mousse, which had been spooned into wine glasses. My friends loved the dessert, and now think I'm Martha, all for relatively little effort! Thanks for the yummy recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a wonderfully easy recipe but you would never know by the taste. My first attempt at chocolate mousse was a great success thanks to this recipe. I served it in margarita glasses and topped it w/ whipped cream sprinkled with chocolate slivers. I also stuck a Kit Kat bar down into the side of the glass. Beautiful presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had a lot of trouble folding the eggs in because by the time I beat the egg whites, the chocolate mixture had gotten too hard. If I were to attempt this again, I might melt the chocolate over a double boiler and keep it warm until it was time to add the egg whites.\r\n\r\nI've never attempted a chocolate mousse before, so I just naively thought that maybe the hardened chocolate mixture would magically blend with the soft fluffy egg whites. Yeah, it didn't.\r\n\r\nOh well, I ended up beating the chocolate into the egg whites and it still tasted good (its hard to screw up chocolate THAT much), just not fluffy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GMUCHEFWHIT"
},
"reviewBody": "Great finish to a classy dinner! I made it in my college dorm kitchen using a blender and a hand beater... no electric mixer... Yes, it was messy, but it tasted professional and could be done on a budget with limited cooking tools. Wowed a boyfriend with my domestic skills!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AlicePRiley"
},
"reviewBody": "This taste of this was good. But the amount of liquid seemed off. The chocolate chips didn't melt all the way. I wound up putting it in the micro for about 30 seconds each time I have made it. This recipe works for a quick chocolate fix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SARINPUNK"
},
"reviewBody": "This mousse was amazing!!! B/c some of the other reviews said it was a little too rich, I added some whipping cream to the melted chocolate. I thought I screwed up when I folded the egg whites in, but it turned out really well. If I can do it, anyone can!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Has been a big favourite since I introduced this in our restaurant. Economical to make and easy. Exactly the recipe I would be looking for , for my restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very basic recipe that turns out divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was very good! I look forward to making again! Very easy and light and fluffy! YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BOBBIETOO"
},
"reviewBody": "Found this to be almost too chocolatey...so added a bit of unsweetened whipped cream. Turned out great and with not as heavy a chocolate flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought that it was way to rich. Also, I am a very amatuer cook, so it was a bit hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm only 13 yrs. old and was able to make this. It tasted great and was easy to make!,however, it did make a little mess. Tastes excellent when scooped into chocolate cups!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried making this and it came out nasty..I did as the recipe called for and it still didnt come out.. I will not make it again. but at lease I tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SALLYLANKA"
},
"reviewBody": "I made this recipe a few times and I think it is delicious. It is fluffy and light like mousse should be, not a creamy pudding texture. If you want pudding texture, make pudding! My friends all love it when I make this rich chocolate mousse. It is a little bit messy to make but the taste is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "super swwet and overpowerfullingly strong in chocolate flavor. wouldn't recomend this to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A little more challenging to make, but to be expected for mousse I suppose. Delicious if made right, but rich!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19012/chocolate-mousse-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/365/desserts/mousse/",
"name": "Mousse Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1566/desserts/mousse/chocolate-mousse/",
"name": "Chocolate Mousse Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19012/chocolate-mousse-ii/",
"name": "Chocolate Mousse"
}
}
]
}
}
, "about": [
]
}
]