				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Pecan Delite"
,"datePublished": "2000-04-10T21:45:07.000-04:00"
,"dateModified": "2022-08-08T10:36:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Bonnie Lee"
,"url": "https://www.allrecipes.com/cook/3109903"
}
]
,"description": "A delightful, creamy-sweet pudding concoction fills this chilled pie with a rich pecan crust."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hMf_mwZhnAh9qUQF8CxJIVkFGJA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7659713-c341b4860a4c466b80561fcb905bc586.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Pecan Delite"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "62"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "422 kcal"
,"carbohydrateContent": "42 g"
,"cholesterolContent": "46 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "379 mg"
,"sugarContent": "27 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"0.5 cup butter",
"1 cup finely chopped pecans",
"1 (8 ounce) package cream cheese",
"1 cup confectioners' sugar",
"3 cups frozen whipped topping, thawed",
"1 (3.9 ounce) package instant chocolate pudding mix",
"1 (3.4 ounce) package instant vanilla pudding mix",
"3 cups milk",
"2 tablespoons chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cut the butter into the flour with a pastry blender or two knives, until mixture resembles coarse meal. Stir in pecans, press into bottom of a 9x13-inch baking dish and bake 15 minutes, or until golden. Cool completely."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, combine cream cheese, confectioners&#39; sugar and 1 cup whipped topping with electric mixer until smooth. In a separate bowl, whisk together chocolate pudding mix, vanilla pudding mix and milk until there are no lumps. Combine cream cheese mixture and milk mixture and stir until smooth. Pour onto cooled crust. Spread remaining 2 cups of whipped topping on top of pudding mixture. Sprinkle 2 tablespoons of chopped nuts over all. Chill in refrigerator until serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gekkolies"
},
"reviewBody": "I had been looking for this recipe for many years. My ex mother-in-law used to make this and it was always my husband's and my favorite recipe. I could never find it under chocolate delight because I didn't know I had to add pecan to that title. This is the best dessert I've eaten in all time, and I ate desserts every day for 71 years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Family favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Smith Powers"
},
"reviewBody": "My late great Aunt handed this recipe down. She said the secret to this recipe is to let the crust cool completely, that mix the cream cheese soften at room temp.,powder sugar and half the cool whip than spread it on the crust.Chill for one hour than mix the choc pudding and pour it onto the cream cheese, Chill for one hour than mix the butterscroth pudding and pour onto the choc, Chill one hour than top it with the other half of cool whip and with pecans. Chill one hour. Yes the layering and chilling each layer takes time but it looks so nice all layered.Love my Aunt way of making.Takes time to make her way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jae Cristian"
},
"reviewBody": "Loved this easy cream pie recipe , even though the crust was crumbly. Still fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "musicmom"
},
"reviewBody": "Light and delicious. I can't have chocolate so I added carob powder to the pudding and it came out great. The chocolate lovers didn't even notice the difference. Like others had suggested, I added 1 1/2 Tbs of sugar to the crust. Also, because one of the grandkids is allergic to pecans, I substituted salted cashews and the salt was a great counterbalance to the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Bertrand Vaughan"
},
"reviewBody": "Delicious! I sprinkled crushed Heath bars, toasted coconut and pecan pieces over the top layer of whip cream. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LPKMK5"
},
"reviewBody": "Great dessert! Follow directions to the T, and it turn out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Peterson Ligori"
},
"reviewBody": "I've been making this for a few years now and it is always the first dessert to be eaten up before the others at a potluck. I changed it this time, because my neighbor just found out he's allergic to nuts, so I put crushed up oreo's mixed with 6 tblsp of butter on the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheIronChef"
},
"reviewBody": "Very easy to make! I always use real whip cream instead of artificial stuff and it turns out much better every time! I would suggest greasing the pan before baking the crust as it has a tendency to stick to the pan afterwards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happylady"
},
"reviewBody": "This is such a good chocolate dessert. Everyone loves it and it's so easy to make. Give it a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "d_cookinggirl"
},
"reviewBody": "I have been making this recipe for years and everyone that's tried it absolutely loves it! I have never served it or brought it to an occasion where I haven't been asked for the recipe. I call it my delicious dessert, well.. because that's exactly what this wonderful and so easy to make dessert just is!! I often change out the flavors of the pudding combinations just for a fun variety, but my very best is all chocolate!! Love it!!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ariesgoddess77"
},
"reviewBody": "Mmmm! So yummy! I doubled the crust (on accident, but it worked!) and layered the cream cheese and pudding mixtures, as others have suggested. It was a hit and I will def be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathy"
},
"reviewBody": "My daughter made this for Christmas! It was wonderful...especially the pecan crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney Bennett Wilke"
},
"reviewBody": "Delicious! Based on other reviews, I doubled the crust, which worked out great. I also cut the sugar to 2/3 cup, added vanilla and a tablespoon of coffee liquor. Very tasty. Great dessert to bring to gatherings, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkstarfish"
},
"reviewBody": "This recipe is a favorite of mine. My mom made something very similar when I was a child. I substitute neufchatel cheese for the cream cheese, reducing the fat, and cheesecake flavored pudding for the vanilla pudding. The last time I made it, I also added a cinnamon sugar mix to the crust. This is one my kids ask for year after year, and its just heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Naomi"
},
"reviewBody": "The first time I made this recipe I followed the directions exactly. It was okay but not that great. The second time I changed several things. 1. I used a large square deep casserole dish . 2. I replaced the cool whip with, heavy whipping cream beat into whip cream. 3. The cream cheese and whip cream mixture I halved the powder sugar. 4. I replaced the vanilla and chocolate pudding mixture with butterscotch. 5. I layered the cream cheese mixture, then pudding then whip cream instead of mixing it all together. I loved this recipe with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie B"
},
"reviewBody": "Followed others suggestions and added about 2 tblsp. of sugar to crust recipe. Crust didn't really turn a golden brown even though I baked it about 25 min. which I think was too long. I would suggest not looking for it to turn brown but keep the baking time around 15 min. I layered the cream cheese layer, pudding layer (used about 2 cups of milk instead of 3 which was perfect) and whipped topping layer. It looked very pretty in the glass baking dish. Also, sprinkled top with Pecans &amp; grated milk chocolate (next time I will toast the pecans lightly). Everyone loved it &amp; said it was a keeper! It is surprisingly light too...I was able to have 2 pieces which is very rare for me with dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb10"
},
"reviewBody": "Great recipe and easy - I also layered - and added some chopped dark chocolate with the pecans sprinkled on top - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pjamas02"
},
"reviewBody": "I've had a similar recipe for 25 years, but i lost it. Although I prefer it layered and with only butterscotch pudding. No chocolate. No vanilla. I will probably use less milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ReneeB"
},
"reviewBody": "Same as the one I've had my favorites box for years! Everyone loves this dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassyinky"
},
"reviewBody": "VERY GOOD, thank you for sharing..everyone LOVED it..I didn't change anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TYKATHY"
},
"reviewBody": "Awesome, Family loved this. Made exactly as recipe says. Except sugar free instant pudding mix. Its all I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keuliss"
},
"reviewBody": "I made this for my dad's 60th birthday, per his request. He handed me the recipie that was one he had for years. I compared it to this one, and decided to make this one instead. The only difference was that his suggestsed you layer the cream cheese mixture and the pudding mixture rather than mix them together. Next time, I will try layering just for looks, but I don't think it will make a difference in the taste. Also, his recipie called for only 2 cups of milk, which I think I will try next time. 3 cups of milk seemed to make the pudding a little less \"set\". And lastly, his recipe called for grated Hershey bar on top, instead of pecans. So for next time: Iwould suggest that we try less milk, layer more and grate chocolate o the top. Yummy! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delia"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Sooo yummy! My late sister made this dessert 30 years ago and I'd been looking for the recipe. We called it Texas Dessert, but I've heard it called many different things. It was a BIG hit with friends and family when I made it for a World Cup party. I layer the cream cheese mixture, vanilla pudding then the chocolate pudding &amp; it tastes just as yummy but the presentation is nicer, I think. Also, instead of the pecans on top, I grate a Hershey bar. I will definitely keep this recipe and make it again! Thanks for bringing back great memories and making new ones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sooo yummy! My late sister made this dessert 30 years ago and I'd been looking for the recipe. We called it Texas Dessert, but I've heard it called many different things. It was a BIG hit with friends and family when I made it for a World Cup party. I layer the cream cheese mixture, vanilla pudding then the chocolate pudding &amp; it tastes just as yummy but the presentation is nicer, I think. Also, instead of the pecans on top, I grate a Hershey bar. I will definitely keep this recipe and make it again! Thanks for bringing back great memories and making new ones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cool"
},
"reviewBody": "My mother-in-la has made this for 30 years she layers the pudding mixure on top of the cream cheese mixture. She makes the recipe about a 1/3 larger than what the ingredients say here. She still uses the 9X13 pan to put it in. Use 2 chocolate puddings and on butterscotch. You won't taste the butterscotch but it cuts some of the sweetness. Mix it all just like the directions say"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbi H"
},
"reviewBody": "My mom made this over the weekend and it was fantastic! I can't wait to make it myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kjb1109"
},
"reviewBody": "Pretty good. Next time I'm going to add some brown sugar to the crust (and about a 1/4 cup more butter) and another chocolate pudding instead of vanilla for a more chocolatey flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Caves"
},
"reviewBody": "This is just perfect. Rich, but I like it that way. Turned out perfect, my husband thought it had too many nuts so obviously you can vary this! I loved it! Quick too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V. Gerling"
},
"reviewBody": "It's difficult to find a recipe that is easier and more delicious than this one. I've made it a million times and will make it a million more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Clum Nash"
},
"reviewBody": "So good and simple to make, favorite for my entire family. Sometimes i don't use nuts and just as good. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLBUMB"
},
"reviewBody": "Very sinful! I used sugar-free pudding and light cream cheese and it was still rich! Next time I'll mix the pudding more thoroughly, it was a little too lumpy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbbdirks"
},
"reviewBody": "This was a huge hit at a potluck I attended last week. Everyone loved them and many requested the recipe. Very good and very easy. Very similar to another recipe I make with pistachio and vanilla pudding instead of chocolate and vanilla. This is worth a try as well if you like those flavors. Will probably make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "USER"
},
"reviewBody": "I made this for our anniversary party and it was literally gone in minutes! I was afraid it might taste boring - like merely pudding on top of a crust, but it was delicious! (I had to put some aside so hubby and I could have some!) Everyone loved it and I had to give the recipe to at least 3 people. I told hubby I might try it again with a graham cracker crust, but he told me not to change a thing. The only slight problem I had was I think I should've creamed the cream cheese mixture with a mixer before adding it to the pudding mixture. I simply mixed it with a spoon. It made it a little lumpy, so I had to put it through a sieve to get the little lumps out. Otherwise, perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie Moody James"
},
"reviewBody": "I made this for my Husbands Birthday instead of a cake. He thinks this is the best you can eat. \""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cdmom"
},
"reviewBody": "This was sinful. The crust is yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mariewayne"
},
"reviewBody": "This was not what i expected. I would not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "This is fabulous and SO rich! Sometimes, I use ground walnuts in the crust and top it with either shaved bits of chocolate or chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PERIWINKLE22"
},
"reviewBody": "This dessert tasted like gourmet to me! I did follow other's suggestions and layered the cream cheese mixture separate, but will not do that again. I found that more time consuming, you could not see the separate layer and it'd taste the same mixed together anyway. I like to keep things easiest I guess. Overall, this is a great tasting dessert. I thought it'd just taste like chocolate pudding when I was making it, but the pecans and other things give it a surprisingly gourmet flavor. Would highly recommend this!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "MMM... MMM...Good!\r\nThis was very tasty! Very light dessert.\r\nI think I would add a little sugar to the crust the next time too. I layered the Cream cheese mixture and the pudding mixture like a couple people had suggested. I sprinkled the top of the whipped cream with Shaved chocolate, skor bits and pecan pieces. Fabulous!! Thanks Bonnie!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Ward-Scales"
},
"reviewBody": "This is a great treat. Only thing I will change about the recipe is adding sugar to the crust. My sister-in-law made this several times for the family and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this dessert was wonderful. It can get a little messy making it but it is worth the effort. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe and it turned out a sloppy mess. It did not set up and looked bad. I was asked to bring dessert for Christmas and I left the leftovers behind. They froze it and said it was good but, I will not make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Small"
},
"reviewBody": "I make this all the time for luncheons or special dinners. I layer the pudding mixture and cream cheese mixture (don't mix it all together). It looks great when sliced. On the top I sprinkle the nuts, but I also shave a small chocolate bar. Really gooood!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great dessert dish, especially for pot-luck dinners. I tried a variation, however. I doubled the crust layer (my favorite part) and instead of mixing the cream cheese mixture and the pudding mixture, I layered the 2, starting with the cream cheese. Then top with the remaining whipped cream and some chopped pecans, and ooohhh yummy! Stand back and listen to the applause!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19014/chocolate-pecan-delite/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2411/desserts/pies/pecan-pie/",
"name": "Pecan Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19014/chocolate-pecan-delite/",
"name": "Chocolate Pecan Delite"
}
}
]
}
}
, "about": [
]
}
]