				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Chocolate Cobbler"
,"datePublished": "2020-06-18T23:10:37.000-04:00"
,"dateModified": "2023-02-09T10:09:28.000-05:00"
,"author": [
{"@type": "Person"
,"name": "dylansmom"
,"url": "https://www.allrecipes.com/cook/849970"
}
]
,"description": "This rich chocolate cobbler is great for potlucks and get-togethers. It bakes up with a crunchy crust on top and ooey, gooey chocolate on the bottom!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bBZ5OcTtsMIYYwxHA5ZmykLiROo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8069099-a4c92e96c93b4b04a3b3a456e02ab030.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Chocolate Cobbler"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "487"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "319 kcal"
,"carbohydrateContent": "58 g"
,"cholesterolContent": "24 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "268 mg"
,"sugarContent": "45 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"6 tablespoons unsalted butter",
"1 cup self-rising flour",
"1.75 cups white sugar, divided",
"1.5 tablespoons unsweetened cocoa powder",
"0.5 cup milk",
"1 teaspoon vanilla extract",
"0.25 cup unsweetened cocoa powder",
"1.5 cups boiling water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Place butter into an 8-inch square baking dish and set in the oven to melt while it preheats."
} ,{
"@type": "HowToStep"
,"text": "Sift flour, 3/4 cup sugar, and 1 1/2 tablespoons cocoa together into a medium bowl. Stir in milk and vanilla until smooth."
} ,{
"@type": "HowToStep"
,"text": "Stir remaining 1 cup sugar and 1/4 cup cocoa powder together in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Remove the baking dish from the oven. Pour flour-sugar mixture over melted butter, then sprinkle sugar-cocoa mixture over top. Slowly pour boiling water over everything."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until set, about 30 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was great! And so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My friend made it at work n I aced it at home"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tom l"
},
"reviewBody": "Mmm mmm good. I love this cobbler !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunny Perdue"
},
"reviewBody": "i made it in my iron skillet. It's very close to a lava crunch cake Delicious and so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faith&fam"
},
"reviewBody": "Delish! Doubled the recipe but only used 8 Tbsp total of butter, subtracted 1/4 cup sugar with each sugar addition in recipe, only added 2.5 cups boiling water, and cooked for 40 minutes. \nMay try reducing sugar just a tad more as well as the water. Everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana Ray"
},
"reviewBody": "Followed recipe and it was perfect! Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mags"
},
"reviewBody": "I love this recipe. The first time I made it my overnight guest walked in her sleep and ate the leftovers in the middle of the night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TCJC99"
},
"reviewBody": "Wonderful, deceptively easy, fudgetastic ( a new word!) dessert. Got rave reviews and didn’t last long! A must with vanilla ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Knight"
},
"reviewBody": "One of the Most Delicious deserts I have made and extremely quick and easy to make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lea Faletti"
},
"reviewBody": "It's still in the oven but I've made this before with fruit and it was excellent!! Hubby saved me a piece."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Momma Kim"
},
"reviewBody": "I did something wrong. I thought I followed exactly. But it overflowed and basically all the flour/cake part was gone and stuck on the outside of the dish. I wish people could answer my comment and help figure it out. \nI didn’t have self rising flour and used 2 tsp baking powder. I have aluminum free baking powder which I normally don’t.??Wonder if that’s it. Also saw today people said 1 1/2 tsp baking powder and 1 tsp salt. I saw the 2 tsp in the comments on the more recent comments. \nIt is rare for me to have duds so I’m going to try again and master this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Aaron Bedal"
},
"reviewBody": "I followed the recipe to the letter and was quite disappointed; the pudding had the consistency of water and the cake/dough part was rubbery and very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gretchen Callison"
},
"reviewBody": "I didn't change anything, although later I realized my flour wasnt self-rising. It came out like floating chocolate islands. I used a slotted spoon to serve and we put whipped cream on top. It was still very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Fogdall Miller"
},
"reviewBody": "Like many others, I substituted all purpose flour + baking powder for the self-rising flour. I used a glass 8 x 8 pan and had to bake more like 40 minutes. It turned out beautifully! It looks terrible before it goes in the oven and you’ll wonder if it was a waste of time and ingredients, but no! It’s perfect &amp; delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "I baked this for 42 minutes and it was still extremely soupy. I let it sit and cool for over an hour and the chocolate sauce became pudding-like. I found it a bit on the sweet side, but tasty. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Purple Daisy"
},
"reviewBody": "This Chocolate Cobbler is so easy and very yummy.\nThe chocolate sauce turned out perfectly for me and for my son (who I mailed the dry ingredients to, pre-mixed in 2 ziplock baggies for each step, at Easter, during our COVID-19 sheltering in place) \nI added about 1/2 c Black Coffee as 'part of my boiling water'. It was great!! Still, One and a half cups total.\nI read that more than 1 person only used a half a stick = 4Tblspns of (real) butter and did that just fine, in an 8\"x 8\" glass pan/dish.\n If you are serving more than 4 people, double this recipe. See pic. The bowls seen there are fairly small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pam hurst"
},
"reviewBody": "Perfect!! No changes!! Made it exactly as recipe says. I let it sit on my counter for about 15-20 minutes After cooking it so that the sauce would thicken. Served it with vanilla ice cream . \nMy whole family loves it! Dont change anything:)\n(My oven cooks faster than most so i baked for 25 minutes and it was perfect)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yaya"
},
"reviewBody": "Everyone loved this recipe!! It is a keeper. It was not greasy-tasty w/frozen yogurt.\n\nI always make my own self-rising flour: \n\nSELF-RISING FLOUR\nTo make Self-rising flour: Mix together 1 C all-purpose flour with 1-1/2 t baking powder &amp; 1/2 salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Roberts"
},
"reviewBody": "Made it just as recipe directed; sampled and it was delicious hot from oven. Simple and elegant and quite saucy. Will be even better topped with ice cream or whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emma brown"
},
"reviewBody": "This is a family favorite and is so easy! The crunch on top and the sauce on the bottom, yum! Made as written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peege"
},
"reviewBody": "This is AMAZING!!! Soo easy to whip up &amp; I can't even begin to tell you how incredible it is! Wowwww! I would give it 10 stars if I could! Don't be scared of how it looks when you put it in the oven. Yes, it will look like soup, but trust me, it's the bomb Diggity!!!! Make sure to let it COMPLETELY cool off before serving, But make sure to warm each serving before eating, that way you will get the chocolate lava effect!! Top with some vanilla ice cream or whipped cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sjk"
},
"reviewBody": "Wow! I just had to make this after reading the weird instructions Bc I was curious how it would turn out. Followed the instructions = *perfect*! I made it in an oval casserole dish &amp; knew I’d need to increase the baking time by 5 min bc Corningware is thicker than a metal pan. Baked it till it wasn’t wiggling when I took it out of the oven. Maybe the reviewers w problems took it out too early or poured the boiling water too fast and broke up the crust? Don’t reduce the sugar - that’s what makes the crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I wanted something gooey and chocolate. This was perfect! I doubled the recipe since it was for a potluck. I baked it in a 13x9 pan for 50 minutes. I was really skeptical because it still jiggled when I took it out. But I had to leave so I went with it. The cake was cooked and hot fudge was baked right in. It seems like some magic must happen for this recipe because it doesn't feel like all those ingredients should add up to such deliciousness. My husband loved it. He thinks it tastes a lot like biscuits with chocolate gravy if you have ever had those."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele "
},
"reviewBody": "I just made this and tasted a bit of it and YUM!!! I have had it before because my girlfriend made this last year and then shared the recipe with me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Williams Nielsen"
},
"reviewBody": "My family asks me to make this every year at the onset of winter and many more times until Spring. It’s SO easy and yummy! And did I say Easy! It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aileen Lisette"
},
"reviewBody": "Everyone loved it. Since I didn't have self-rising flour, I used 1 cup of all-purpose flour and 2 tsp of baking powder. The batter part was a little too cakey. So next time, I will use 1.5 tsp of baking powder and 1//2 of salt like other reviewers suggested. I'll see which one comes out better. The first time I made this, the end result was a little on the greasy side and very runny. So this time I only used 5 tbl of butter. Perfect, it wasn't greasy or runny at all. I didn't think it was that sweet. I topped it with homemade whip cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deirdre D'Urso"
},
"reviewBody": "I made this tonight for mixed group of friends. Some are vegan yet told us they cheat once in awhile. She came back for a third serving and asked for the recipe! We all loved it and I used an 8X8 pan. I baked it for 2 additional minutes and followed other suggestions to use brown sugar for inside ingredients and white for topping. Also followed the non self rising flour suggestions. Did not add vanilla ice cream yet think it would have complimented it immensely. Rich, decadent and delicious! Will make again and probably to Thanksgiving menu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent M."
},
"reviewBody": "I needed a quick and easy 3 am chocolate fix so I made this chocolate cobbler. The batter had a very thick brownie like consistency so I had to add enough extra milk to make it a pourable batter. I substituted a 1/4 c. of Kahlúa and added it to the remaining 1 1/4 c. of boiling water. Also, I didn’t stop with 6 T. of butter. I added the whole stick. Yes, I did! I will be making this again. It turned out so rich and chocolatey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs.D"
},
"reviewBody": "I've made this dish twice in one week. The first time in 8x8 pan and, because that wasn't enough, the second time in a 9 x 12 pan. It is absolutely delish! beyond compare. This from a life-long chocaholic. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Was delicious, kinda thought it was weird when I put it in the over but then it turned out amazing! 100% will be making this again! I would recommend using whipped cream instead of ice cream cause it will be very sweet. Love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evie Hancock"
},
"reviewBody": "10 stars!!! And I sprinkle 1/2 cup chopped walnuts on top before baking. Serve warm with scoop of vanilla ice cream. Out of this world!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooking101"
},
"reviewBody": "Delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "awallace"
},
"reviewBody": "Great for chocolate lovers! This resembles a Jamaican chocolate pudding cake in its execution. It looks like you misread the directions when it's ready for the oven, but the result is a wonderfully moist chocolate delight. I added 1/2-3/3 cups of whole almonds for the heck of it. Pecans or walnuts could work as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miyo Cox"
},
"reviewBody": "This is my new favorite dessert! If it doesn't turn out, you did something wrong. The recipe is perfect as Is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "No way loved it!! Yes sure enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Harvey"
},
"reviewBody": "Awesome! Only change was 2 heaping tablespoon of Cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blueseller"
},
"reviewBody": "It's very good and extremely rich. We found it to be overly sweet, however, and reduced the sugar in the flour/sugar/cocoa mix down to 1/2 cup and in the pudding (sugar/cocoa mix) down to another 1/2 cup, bringing the total to 1 cup of sugar in the entire recipe. The chocolate was more pronounced and wasn't overshadowed by excessive sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina & Nina"
},
"reviewBody": "Tried this for the first time tonight as we were craving chocolate. I asked my husband if he liked it and he looked at me like I had two heads and said he** yes!! The only thing I had to accommodate for was the self rising flour which I didn’t have. I added 1 1/2 tsp baking powder and 1/2 tsp salt to the 1 cup flour and it came out perfectly. This will be a new favorite and will probably replace brownies! It is rich, has the crispy texture of cobbler with a chocolaty sauce underneath and is excellent with vanilla ice cream. Let it cool and the sauce thickens to a perfect consistency. It is the simplest and quickest dessert. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiger Lily"
},
"reviewBody": "My boyfriend got it into his head that plums chocolate taste good together, so asked me to make dessert with those two in it. When i found this cobbler recipe i thought it was perfect. Simple ingredients and easy steps. His sister and i loved it! The only thing changed was adding some plum slices tossed in brown sugar before topping with the cocoa as sugar mix. And i didn't measure boiling water out just ladled it on until my pan couldn't hold anymore, which was couple ladle fulls. The flavors were rich and chocolatey paired with tartness of the plums. It came out great paired with some vanilla ice cream! My only change would be that won't so much water next time i think the fruit released lot of own liquid when baking and, in turn, made it a bit too runny. But i highly recommend this recipe and I will definitely be adding this recipe my dessert staples!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Maggy"
},
"reviewBody": "Unfortunately this recipe did not turn out for me. After baking for 35 minutes it still looked exactly the same as it did when I put it in the oven. I searched for a different recipe and that one came out great. Sorry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Mallicoat"
},
"reviewBody": "Love this chocolate cobbler! Easy to make, 8x8 pan makes just enough! I serve with scoop of vanilla ice cream. Try the recipe, if you love chocolate, it’s a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "randia wainwright"
},
"reviewBody": "I had my first chocolate cobbler at the local dinner theater and this recipe was just as hood!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Td Waldner"
},
"reviewBody": "I made this for work they loved it and wanted more. It is very easy and good. I make it the night before and cover it when cooler. the next day it has the consistency of pudding on bottom with cake on top. It was liked cold as well as warmed up. This is one I will make many more times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Salas"
},
"reviewBody": "very delicious and easy recipe! I wanted to make chocolate cobbler for a long time and this one literally takes the cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GWP"
},
"reviewBody": "OMG. Just served this at a Christmas party. It was a huge hit! Everyone wanted the recipe. Soooo easy to make and sooo good. I will use this one again and again. Was a little worried cuz the recipe seems kind of odd...boiling water on top?? But it sure came through!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keep It Simple Cook"
},
"reviewBody": "Easy to make and quite tasty. The base was a bit dense but overall it was very good. We will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Verónica Gallo-Bambery"
},
"reviewBody": "Super easy recipe! My family loved it and my husband demanded the pyrex after everybody ate, so he can lick it. I followed someone's advise to add baking powder and salt to the recipe to prevent from buying self rising flour. The only thing I would change is instead of 1 cup of sugar and 1/4 cup of unsweetened cocoa powder for the topping, to perhaps 1/2 sugar and 1/4 cocoa - It was extremely sweet for me. Other than that it was delish and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vbiggs101"
},
"reviewBody": "Awful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "I was a bit skeptical with all that water, but it turned out great! Loved all that warm pudding in the middle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ScooterCooks"
},
"reviewBody": "Did not come out the way I expected. Had to cook it much longer than described to get it \"done\" and the outside was overdone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jada S."
},
"reviewBody": "This recipe was absolutely delicious! I added raspberries to make it extra delicious. I have made this a couple of times, and have been satisfied every time! I would totally recommend to put raspberries in it! The only reason I gave it four stars was because I changed the recipe a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sidney"
},
"reviewBody": "This was easy and very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wellsy2"
},
"reviewBody": "I actually made it by doubling it for a guy gathering but didn't think it was finished baking. As it turned out, it was fabulous but it does require more baking time when you double the size. I'll be making it again this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amy ashby"
},
"reviewBody": "This is just yummy! I doubled the recipe, but followed it exactly. Sugar overload! Loved it! If you're craving something ultra chocolatey and rich, this is it! I topped with Reddi Whip"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pb"
},
"reviewBody": "Yummy and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abby"
},
"reviewBody": "I was craving something chocolate and I just happened to have all of these ingredients in my cupboard. I used a cup of all purpose flour with the"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissa"
},
"reviewBody": "Oh my. Delish! I doubled the recipe using 9x13. Used only 8 tbsps butter, heaping tbsps of cocoa, 2 1/2 cups boiling h2o, decreased white sugar in base by 1/2 cup &amp; added 1/2 cup brown sugar, decreased sugar in topping BY about 1/4-1/2 cup &amp; baked exactly 25 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This dessert is delicious, my son loves it. In fact he just brought this up a week ago because I made this year's ago it was called chocolate pudding cake. Was excited to find this cause I'm not sure if I still have my recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjwinder"
},
"reviewBody": "Made as written, came out great!! It goes quick so best make a double batch. I may add a few caramels next time per hubby's request."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie Ratliffe Bowman"
},
"reviewBody": "My Fav!!!\nquick easy to make yet, delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "We didn't like this at all. Followed the recipe exactly. Just a lot of runny chocolaty sauce and clumps of rubbery dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leahb"
},
"reviewBody": "Amazing! We always whip some cream to go with this. Yummo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Johnson"
},
"reviewBody": "I switched the milk for heavy cream added till batter becames smooth. I also add a tsp of espresso powder to the batter and another tsp mixed in the topping. There are never any leftovers when I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShueJJ"
},
"reviewBody": "Made as directed. Kids loved it. Was pretty good. Probably will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jwegner"
},
"reviewBody": "Very easy, and so yummy! It's ended up being my go-to last minute dessert since I always have the ingredients. I do use less water, makes for a more fudgy sauce instead of runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Duff Robart"
},
"reviewBody": "I made this in Vietnam for my brother's restaurant. We did not have self-rising flour, nor do they have cocoa or baking powder here. We improvised by using dark chocolate hot cocoa mix which had sugar and vanilla in it. They do not have plain vanilla either. We had to use vanilla beans instead of the liquid vanilla. Also we could not find an 8x8 or 9x13 pan, so we used bread pans. The oven was a toaster oven. Boy, did we need to make changes! It actually didn't turn out too bad even though I didn't have any measuring devices and the butter was a big block of butter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicia"
},
"reviewBody": "Super easy and delicious! Everyone asked for more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amylou8209"
},
"reviewBody": "This is amazing! Like other reviewers said, the longer it sits, the thicker the sauce gets. I didn't have enough white sugar so I used brown sugar in place of all of the white sugar. I served this warm over vanilla ice cream and it was restaurant quality desert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lquillen"
},
"reviewBody": "Quick and easy recipe. Do not use all purpose flour (I did by accident once). If that's all you have, follow the Allrecipes recipe for converting all purpose flour to self rising flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Byrne"
},
"reviewBody": "This is our family's favorite chocolate dessert. We make it according to the notes at the bottom, adding instant coffee granules and pecans, and always serve it with vanilla ice cream. I keep self-rising flour on hand, so this was no problem for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARDUST_331"
},
"reviewBody": "Who knew something that looks so wrong going in would taste so amazing coming out? Followed the recipe almost exactly ( cut out a quarter cup of sugar from the sauce) and loved it, and was unprepared for how nuts the hubby and inlaws went over it. The hubby said it tasted just like the Hot Fudge Brownie dessert at the old Hot Shoppes, the predecessor to Marriott. It's very reminiscent as others have mentioned to a molten lava cake, it's like a soft hot brownie with chocolate sauce. It super very sweet as is ( especially served with ice cream), and will use 1/2 cup in the batter and 1/4 cup on top. Used Ghirardelli cocoa and might try a dark chocolate cocoa next time. I don't normally have self rising flour, so I made it using 1 cup of all-purpose flour plus 1 1/2 teaspoons baking powder and 1/4 teaspoon iodized salt. I only use 4 tablespoons butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovesoutherncooking"
},
"reviewBody": "This is like a molten lava cake. I have made it several times and do not change anything at all in the recipe. Must have ice cream with it! Rich, decadent and delicious; easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathleenElyse"
},
"reviewBody": "Really great dessert. I only used 4 tablespoons of butter. The only change I made. Comfort food at its finest!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOUBLEJS"
},
"reviewBody": "My family just loves this. I doubled the recipe and used a 9\"×13\" pan. It turned out great. My daughter said it definitely satisfied her chocolate craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Rae Wallace"
},
"reviewBody": "Loved this!! Growing up my Granny used to make chocolate gravy and biscuits and this reminds me of that. So, now I can have it as dessert!! The only change I made was to cut the butter to 4T rather than the 6T, I think I could reduce the sugar a bit and be fine, but it's quite delicious as it is. Wouldn't hurt to pair with ice cream, strawberries, cool whip, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CocoLoco"
},
"reviewBody": "This is just like a recipe my mom used to make when I was young, we added walnuts too. It was good, maybe should have cooked a little longer to make more pudding like as it was a little runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cardies"
},
"reviewBody": "Easy and every time it turns out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "proudncgirl"
},
"reviewBody": "I made this exactly according to the recipe, and it was incredible! Fast, easy and delicious...I will definitely double it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy J J"
},
"reviewBody": "Absolutely delicious! We only ever have all purpose flour, I went off of previous reviews that said to add 1.5 teaspoons of baking powder to the flour to substitute for the self rising flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue bean"
},
"reviewBody": "This recipe is like mine that I have been doing for 40+ years, however, mine states to have the hot water mixed with the sugar and cocoa and then dumped on top of the cake. I prefer mine but that's my opinion. They're both very good. The second round of sugar to be used in the sauce part for my recipe asks for brown sugar. Again, that is my preference. A good cake that I make at the last minute when I know someone is dropping in. I add walnuts or whatever nuts you have if you wish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oceanghurl"
},
"reviewBody": "I love this stuff. It's so cheap and easy to make. It starts off a lot like hot fudge cake. I like to put saran wrap over the baking dish for leftovers and reheat on the lowest oven setting whenever I want some. After a few reheats, the consistency becomes more akin to frosted brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "This is so good and simple for a quick chocolate fix! I can mix this up with ingredients I have on-hand most of the time, too. For self-rising flour, I just added 1/2 tsp. salt and 1-1/2 tsp. baking powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Slavens"
},
"reviewBody": "This is so simple, especially to taste as fabulous as it does. This will be my go to for a chocolate fix. Followed the recipe exactly, and it came out better than I even hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tracy E. Winters"
},
"reviewBody": "Too sweet, too runny even after cooling. I won't try this one again. I'm confused as to how this recipe got such good reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tami watland"
},
"reviewBody": "The first recipe I'd tried for this, didn't have cocoa in the batter and I think it was better than this one. This was good but awfully rich and like I said not as good as the one without the chocolate battee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Bartlett"
},
"reviewBody": "Made this for the hot bar at work omg just like it is but don't forget the ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "I made this recipe with no changes at all and it is delicious. One of the easiest chocolate desserts I have ever made. This one is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David DeBoer"
},
"reviewBody": "It was runny with all the butter in the middle. I didn't have self-rising flour and maybe that is why it turned out as it did. May try again with using baking powder along with the flour as one reviewer said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Taira"
},
"reviewBody": "Great! I loved how it made it's own hot fudge topping. It's so simple and cheap to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keri"
},
"reviewBody": "Taste like a molton cake. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Verneice Newell Richard"
},
"reviewBody": "it was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "I made this for my grown children and my dad, this is the best chocolate cobbler I have ever had. My sons gf asks me to make it all the time. I seen a review that stated the measurments were off, I am sorry but they are spot on! Maybe she misread the directions or doubled the recipe but the directions are not to scale so you need to keep that in mind when doubling this recipe. I always have to double this one. The onlything I did differently was to add some salt about a 1/4 teaspoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Fugate"
},
"reviewBody": "Very easy. My hubby loved it. Chocolatey pudding and crunchy topping. Will surely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jes"
},
"reviewBody": "Chocolate pudding casserole. I doubled the recipe and used a 9x13 pan. Not too sweet just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Freeman PA"
},
"reviewBody": "Never had cobbler before and everyone loved it. Will pass it on to the rest of my family and friends"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klchill"
},
"reviewBody": "Definitely serve warm, ice cream, homemade whip cream. Very rich and decadent dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cfarzley"
},
"reviewBody": "A chocolate lovers dream. Easy to make and just INCREDIBLE!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nedra J Divine"
},
"reviewBody": "Delicious!! Doubled the recipe and served it with cool whip. I think next time I will add a little less water and/or bake a little longer for the long pan. Wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THOMASSHERBOURNE"
},
"reviewBody": "My mother made a similar dessert using strong coffee in place of the water. Try it, it makes a lovely mocha sauce."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/69656/chocolate-cobbler/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/79/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/361/desserts/cobbler/",
"name": "Cobblers"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/69656/chocolate-cobbler/",
"name": "Chocolate Cobbler"
}
}
]
}
}
, "about": [
]
}
]