				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cinnamon Hazelnut Biscotti"
,"datePublished": "1998-12-08T13:01:52.000-05:00"
,"dateModified": "2022-12-27T14:21:26.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Kris"
,"url": "https://www.allrecipes.com/cook/24325321"
}
]
,"description": "Nutty hazelnut biscotti flavored with cinnamon and vanilla. These are simply delicious with coffee and they smell wonderful!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gWcttJTQkeyElU7Qmo-2UZKM74c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/114892-cinnamon-hazelnut-biscotti-chibi-chef-4x3-1-7524482017624a3b9ca4eec0f57ebffb.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cinnamon Hazelnut Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "434"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "138 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "25 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "89 mg"
,"sugarContent": "7 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.75 cup butter",
"1 cup white sugar",
"2 large eggs",
"1.5 teaspoons vanilla extract",
"2.5 cups all-purpose flour",
"1 teaspoon ground cinnamon",
"0.75 teaspoon baking powder",
"0.5 teaspoon salt",
"1 cup hazelnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together butter and sugar until light and fluffy. Beat in eggs and vanilla. Sift together flour, cinnamon, baking powder, and salt; mix into egg mixture. Stir in hazelnuts."
} ,{
"@type": "HowToStep"
,"text": "Shape dough into two 12-inch long logs; place on the prepared baking sheet and press down to 1/2-inch thickness."
} ,{
"@type": "HowToStep"
,"text": "Bake for about 30 minutes in the preheated oven, or until the edges are golden and the center is firm. Remove from oven to cool on the pans. When logs are cool enough to handle, use a serrated knife to slice the logs diagonally into 1/2-inch-thick slices. Return the slices to the baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake for an additional 10 minutes, turning over once. Cool completely, and store in an airtight container at room temperature."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lory Lagoyda"
},
"reviewBody": "I make this all the time; it is super easy and fast to put together. Often I’ll use lightly chopped pecans instead of hazelnuts, and I add 1/3 cup of mini semi-sweet morsels to the batter. Once the biscotti are cut and cooled, I’ll melt some more chocolate and spread across the bottom of each, setting sideways on wax paper until the chocolate hardens. I usually just melt the remainder of the morsels, though you could use chopped up 8 oz bar of chocolate of your choice, and either melt in a double boiler or melt in the microwave at 30 seconds to start, followed by 15 second increments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It sounds yummy. To make biscotti sounds difficult.. but isn’t. Try and enjoy, you will be hooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I enjoy the results. For me, the flavourings are kinda subtle and this cookie tastes pretty much like the basic biscotti dough with hardly distinguishable notes of cinnamon and hazelnut, which is not a problem in my book. I'm sure these would me for some excellent gift!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "natewalsh606"
},
"reviewBody": "I added chocolate to the top. I think it would be really important to get hazelnut pieces instead of wholes because a huge portion of them fell out when I cut it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahanna"
},
"reviewBody": "Great recipe! I toasted the hazelnuts and crushed them with a mortar and pestle before adding them to the batter. I reserved some to sprinkle on them afterwards too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clubby981"
},
"reviewBody": "Whoa. So good and easy throw together. Planning on making these again and again! Hello morning cup of coffee !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Todd Howard"
},
"reviewBody": "Amending my review to say they are just fine, I wouldn't change anything though I did dip the bottoms in chocolate and add extra hazelnuts.\nPrevious biscotti that rised higher had more baking powder than usual recipes, so I was comparing unfairly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KLJ"
},
"reviewBody": "Maybe I needed to take the advice and add chocolate because I felt as though the taste was good, but not outstanding. The texture was perfect though! Maybe if I tried again with dried cherries or cranberries or maybe some zest..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Miller"
},
"reviewBody": "Very good recipe, but next time I will double the cinnamon; could hardly taste it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DieBee"
},
"reviewBody": "Fantastic exactly as written! Absolutely my go to recipe for biscottis now. Made several times now and swapped with macadamia nuts and walnuts. Equally good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Wright"
},
"reviewBody": "First time Imade them, loved by all. Need to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Kohn"
},
"reviewBody": "I made with nutria shortening. Added spices along with the cinnamon, 1/4 teaspoon of good. Next I will try this again with gf flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "schnicole"
},
"reviewBody": "Made this a zillion times. I just made a gingerbread biscotti and it only asked for 1/3 cup butter, so I did the same for this recipe. I wanted it more dry/crunchy. Also I use almonds instead cause they are cheaper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MG"
},
"reviewBody": "This recipe has become our family’s favorite biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Parker"
},
"reviewBody": "This recipe was nice and easy to make. I made a double batch but I don't recommend doing that. My KitchenAid artisan mixer could not handle that much dough at once. My mixing bowl detached from the base several times. But if you're just making one batch I'm sure my mixer would handle that easily. I measured out the amount of hazelnuts as instructed, then I chop them up into smaller pieces. I did not bother removing the scans from the hazelnuts. After it was done I didn't notice any bitterness from the peel. I accidentally missed adding the salt but other than that I followed the directions and ingredients exactly. Did the Scotty ended up being nice and crispy but not to dance with just enough flavour but I didn't regret not cutting it in chocolate. This is a great recipe and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "I roast and chop the hazelnuts first. Instead of baking for 30 minutes, followed by another 10 minutes at 350 degrees, I bake them for 20 minutes at 350 degrees, then turn the temp down to 325 degrees an bake another 10-15 minutes. The texture is perfect for dipping in hot coffee and doesn't fall apart as easily as store bought brands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "I roast and chop the hazelnuts first. Instead of baking for 30 minutes, followed by another 10 minutes at 350 degrees, I bake them for 20 minutes at 350 degrees, then turn the temp down to 325 degrees an bake another 10-15 minutes. The texture is perfect for dipping in hot coffee and doesn't fall apart as easily as store bought brands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbi Larkins"
},
"reviewBody": "I always make biscotti for Christmas, and wanted to try a new recipe. I was quite happy with the way this turned out, and will keep the recipe to use again. The texture was perfect. The hazelnuts probably needed to be chopped a bit. The flavor is very subtle, which isn't necessarily a bad thing, but could maybe use a boost with something like chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "I made these but I didn`t have hazelnuts so i substituted almonds - they still tasted delicious, but looked very white. If I made them again I would add some chocolate drizzle, or some kind of colour to them to make them look a bit more appetizing. I also added additional cinnamon (1/2 tsp more), as I felt the recipe could use a bit more. All in all, tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron-jon"
},
"reviewBody": "Made them last year for Christmas and they where a big hit. Making them again. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2Bake65"
},
"reviewBody": "So, I'm a dough/batter girl. If that tastes amazing, then chances are - the final product will be also. :) This is a really very easy and versatile base recipe for other flavors - I made mine with lightly roasted almonds and 1/2 cup cranberries (along with the cinnamon) and called it Cinnamon AlmondBerry Biscotti. Sounds unusual, but the flavors play off of each other so well together! The first batch I made, I used the entire 3/4 cup of butter, I do think it was a little much, so I made a 2nd batch (same night!), using only 1/2 cup of butter and a tad bit less of the sugar. I think it was much better, but that's just my opinion! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Hamilton"
},
"reviewBody": "I found it to be a very easy recipe to make and my parents and my cousin love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dbarris"
},
"reviewBody": "Doubled the recipe, but original amount of cinnamon. Half vanilla, half lemon extract. Lightly toasted pine nuts, slightly chopped. Will be using this recipe often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chloe Weyer"
},
"reviewBody": "The taste itself was great! However, mine were crumbly. I also dipped the ends in melted chocolate :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissartorres"
},
"reviewBody": "I absolutely love this biscotti! I have made it for years now around the holidays and it has become a requested favorite from my family. With that said, here are some tips on how I perfected my recipe. :)\n\nUsually, I substitute almonds since hazelnuts can be hard to come by and are expensive. Even with the almonds, they are delicious. They are not as hard as traditional biscotti which I don't mind. \n\nI know others have mentioned that the biscotti is delicate and crumbles easily. I found a fix that seems to help with this. When preparing the nuts I grind them in my Ninja blender until it is becomes more of a powder. This allows the nuts to mix into the dough while reducing the air pockets that result in the crumbling. \nAfter they are done baking, I let them cool (sometimes by putting them in the freezer for about 5-10minutes) then I melt semi-sweet chocolate in a double boiler and drizzle it over the top of the biscotti. Make sure the biscotti is chilled or at least room temp before you drizzle the chocolate otherwise it will get too runny and make a mess. Once I've drizzled the chocolate, I pop them back in the freezer for another 5-10 to let the chocolate set. This step is especially helpful if you plan to package the biscotti for gifts as it keeps the chocolate drizzle from getting messed up and looking like a blob. \n\nI hope this helps! Enjoy the biscotti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EP Quinlan"
},
"reviewBody": "Substitute the hazelnuts for blanched slivered almonds. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RPESCI"
},
"reviewBody": "If you don't love this recipe, you don' love biscotti. I have been making it for years, many different recipes, and this takes the cake. It is really simple and you can modify the extracts, and nuts and it is simply delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "These were great! I did toast the hazelnuts and finely chopped them in the food processor before adding to recipe. Also, I used homemade butter. I was unsure of the dimension to roll it out so I rolled it out 12\" X 4 1/2\". Next time I'll aim for 12\" X 3\" and hopefully it will bake to 13\" X 3 1/2 - 4\". Decorated with chocolate, white chocolate, and more coarsely chopped toasted hazelnuts. I tried some with and without the additional chocolate and nuts and it is super sweet either way. Maybe I'll use 3/4 cup sugar for plain biscotti, 1/2 cup for chocolate covered, and replace the sugar with my sugar/stevia blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlecooker"
},
"reviewBody": "This was an awesome recipe! Tried using brown sugar instead of white, just to change it up, and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "collbert"
},
"reviewBody": "I substitute the hazelnut with 1/2 cup sliced almonds and 1/2 cup chocolate chips. I also split the extract and do 3/4tsp vanilla extract and 3/4tsp almond extract. Best biscotti recipe I've found so far. Next try will be with dried cherries and white chocolate chips....sooooo many options. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SER"
},
"reviewBody": "This is a great recipe and special thanks to Sue who suggested cutting them while they are hot with a bench scraper--just chop and they come out great! While great by themselves, I did add a layer of chocolate to the bottom of each--easy enough to do, just microwave some semi sweet chocolate and let cool a bit then spread or dip and let cool and dry. I think once you have the basic recipe down, you can substitute various nuts, fruits and candies as you desire. Love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MN Kitchen"
},
"reviewBody": "We have tried about 3 other Biscotti recipes and I will have to say this one was simple and the dough was fantastic to work with. We doubled the cinnamon and went rogue by adding 1/2 tsp ground cloves, 4 Tbsp Ghiradelli bitter chocolate, 3/4 c chocolate chips, substituted 1 c chopped pecans instead of hazelnuts and dusted the loaves with the chocolate powder and cinnamon before baking. Neat texture when all sliced up. Have decided to make this our 'base Biscotti' recipe for any other flavor combinations we decide. \n\nThe house smells awesome as we get ready for the holiday spirit to take over,,,,thanks to whoever put this winner together! Happy Holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R Schwarz"
},
"reviewBody": "Most delicious dessert I have ever made. Used hazelnut flakes from the store and only needed about 1/2 cup. Also doubled the cinnamon because I like some kick. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stress baker"
},
"reviewBody": "This is a fabulous recipe! I doubled the recipe and added an extra teaspoon of cinnamon and then drizzled them with white chocolate with a half teaspoon of cinnamon mixed in. These were a definite repeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hopkin78"
},
"reviewBody": "Really good and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anneboleyn"
},
"reviewBody": "Phenomenal. Oh my word. Delicious on their own, dunked in chai tea, coffee, etc. I coated the bottom side in semi-sweet chocolate, and my mother almost devoured the entire batch. As for the hazelnuts, I struggled. Apparently the trick is to boil 3 cups of water, add 3 tbs baking soda, and boil the nuts for 4 min, then run cold water over 'em, and the skins should slip off. Toast for 15 min @350, then chop. I want to make another batch, and my first isn't even gone yet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMILLER8705"
},
"reviewBody": "One of my favorite biscotti recipes! The dough was very easy to work with, compared to others I've used. Easy recipe to use as a base and change up without worrying about it getting ruined! Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mirimia"
},
"reviewBody": "fantastic and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christy Scott"
},
"reviewBody": "This is a great recipe, but a doesnt have too much flavor on its' own, i added a little ground cloves and extra cinnamon. Plus, it can be versatile, if you want to switch out the hazelnuts for something else, this is a fantastic basic biscotti recipe (i used shredded and strained zucchini with mini cinnamon chips once - awesome!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jreycooks"
},
"reviewBody": "I've always been scared to try making biscotti. I decided I should use this recipe for my first try. It was so simple and these turned out delicious! You can really taste the cinnamon in this. I'm giving it 4 stars because the recipe was easy to follow and make and the biscotti came out perfect. The cinnamon hazelnut flavor was okay to me. After making this, I realized I can use this as a base and change the flavors as I please."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "A friend from work brought this biscotti in so I had to try my hand at it. Sooo dissappointed in first batch. Not anywhere in this recipe does it say to CHOP the hazelnuts. I've never baked with hazelnuts before. The whole nuts just fell out and did not add to the flazor. I'll try them again...just because I've tasted the final product from elsewhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauraeaton77"
},
"reviewBody": "This is my favorite biscotti recipe. I have tried about 5 or 6 other recipes for biscotti and the texture of this one is the best, hands down. I use this recipe as base for all other biscotti recipes by omitting the cinnamon and hazelnut and adding whatever else I want instead. The recipe is best if you follow it to a T, but I have used margarine instead of butter and today I substituted chia seeds and water for the eggs because I had randomly come across a recipe for using chia seeds and water as an egg substitute and was curious how it would be. Incidentally, it's ok but it's better to use eggs! If anyone cares, the substitution is 1 TBS chia seeds + 3 TBS water, according to the internet. :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Moskal"
},
"reviewBody": "I crushed the hazelnuts in a processor. Used parchment paper and put the sheet on the middle rack of the oven. I also used more hazelnut extract instead of vanilla. They're AWESOME! Seriously. My parents are very picky and they had 3 each! I'll make this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I melted canned vanilla frosting and drizzled over the biscotti. I also used slivered almonds instead of hazelnuts. My husband -- who normally doesn't care for biscotti -- thought this was delicious and tasted like cinnamon rolls. Tasty and great with hot tea or coffee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rphilli"
},
"reviewBody": "This is the favorite biscotti recipe of my daughter and I. The dough is not terribly sticky so it is fairly easy to work with. I add about 1/4tsp more of cinnamon than the recipe calls for because that is our personal taste. We were making them for holiday baskets so we also melted some cinnamon chips and drizzled them over the top which gave them a beautiful look and kicked up the cinnamon quotient a notch and they were great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "thej"
},
"reviewBody": "We have made this recipe every year for the last 4 years. We give it as gifts to family and friends that continue to request it every year. We keep some for ourselves! We pretty much follow the recipe as written. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephW"
},
"reviewBody": "ohmy! These were so simple to make and super delicious. There's also a really good crunch to it. Two thumb up! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilyesau"
},
"reviewBody": "I was so surprised at how easy this was to make! As far as baking goes, this may actually be easier than homemade cookies! I made them for a bake sale at work, and they were a huge hit. In addition to the recipe, after the biscotti was complete, I used vanilla almond bark as a topping, and sprinkled more hazelnuts over them. Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilgagga"
},
"reviewBody": "honestly, the best biscotti I've eaten, better yet, Made!! this recipe is gold! I followed the recipe completely except for 1-2 tbs less butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Gansner"
},
"reviewBody": "The only reason I didn't give it 5 stars was because I was not fond of the cinnamon component. It wasn't that it was bad...I just like to dip mine in tea or coffee and I didn't feel that the cinnamon went with that. I didn't have enough Hazelnuts, so I did half hazelnuts half almonds. \n\nI'm just making a second batch now, omitting the cinnamon, subbed 1/2 ts of vanilla for almond extract and added mocha gel flavoring and walnuts. I think this is an awesome base recipe to play with and add whatever you like!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyssa"
},
"reviewBody": "This recipe was fantastic. The bake time was correct, the estimate of cookies made was correct, and it made delicious biscotti that held together and were just slightly chewy. I used hazelnut pieces with the skin on, and the cookies did not taste bitter to me. I would definitely make this recipe again as is, or possibly drizzled with milk chocolate or white chocolate on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madeline Stout"
},
"reviewBody": "What a wonderful recipe! It was so user friendly and easy! This was my first time making biscotti and I was so nervous because I've heard it's difficult to do well. These turned out perfect though! The perfect recipe for someone who has never made biscotti before. I'll never try another."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denisa"
},
"reviewBody": "These are really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freeda"
},
"reviewBody": "I followed this reciepe to a \"T\".. OUTSTANDING!\n My husband was amazed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "juliaem"
},
"reviewBody": "I made these as part of my cookie trays (Dec '11). I drizzled them with white and dark chocolate and they looked fantastic! They did soften up quite a bit, so I might increase the second baking time next time.\n\nI didn't find them too great--I thought they were kind of bland, but everyone else LOVED them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naan"
},
"reviewBody": "I have these in the oven right now for the second time this week. They are that good! I think the recipe is perfect as written, but I use macadamia nuts in place of hazelnuts and add white chocolate chips. After the cookies are cut and cooled, I drizzle white chocolate over them. This will be my standard recipe for biscotti from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "russiansweetie"
},
"reviewBody": "The best biscotti I've made so far. I love hazelnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlinden"
},
"reviewBody": "This was fabulous everyone loves it!! I did add cinnamon chips to the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "She loves to cook"
},
"reviewBody": "Toasted the hazelnuts and then peeled the skins. Baked for longer than recipe stated to get a crunchy cookie. Next time would increase the amount of cinnamon for a bigger flavour profile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twinklesmawmaw"
},
"reviewBody": "I had to leave a review on this delicious recipe! I followed the cookie part of it exactly, but I didn't have hazelnuts, and I made this as a present for my husband for Christmas; so I added chopped almonds and a big ol' handful of cranberries! I baked as instructed and this was/IS the most delicious biscotti I've EVER made! The cookie is perfect and I can tell it will hold whatever I choose to throw into it! Sooo much better than any I've bought! This is going to be a staple in my house since we are coffee drinkers! \nThank you for this recipe, it's glorious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cindylewhu"
},
"reviewBody": "The taste is good but the traditional biscotti crunch is not there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie M"
},
"reviewBody": "I've been making these for years...its the best biscotti recipe. Its demanded every year for Christmas. Love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is fantastic! I made the recipe as is, but I was out of hazelnuts so I substituted pecans and it's absolutely wonderful. After I sliced the cookies and baked them the second time, I left them in the oven after I turned the oven off and by the time the oven cooled the cookies had that perfect crunchy/crispy texture. I see lots of these in my future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "scsiguru"
},
"reviewBody": "I tried these in a biscotti pan and I tried them in a sheet pan like the recipe calls for. Either way they were not very good. Too crumbly, too sweet, too many hazelnuts. Not really what you think of as a \"biscotti\"...more like dried cake. Also, the dough flattened out way too much when baking. I will not try this recipe again. I found a nice pistachio/cranberry biscotti recipe from another site which I've already made several times. I will stick with that recipe...they are delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Gibeley"
},
"reviewBody": "Really delicious! I doubled the cinnamon and sprinkled a bit of it on top of the cookie loaf before putting it in the oven. That made the cinnamon flavor really stand out. Add a drizzle of chocolate and these are divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Indiana Mommy"
},
"reviewBody": "Let me say these were good even without the hazelnuts....I forgot to put them in the dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Garzone"
},
"reviewBody": "This is very good. I added 2 tsp of cinnamon, 2 tsp of vanilla, 1 cup of chocolate chips, walnuts instead of the hazelnuts and drizzled chocolate on top. It might have all been a little to much...the next time im not adding the chocolate chips or nuts....im just going for the cinnamon flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momoffive"
},
"reviewBody": "Dig it!!! Great base recipe...therefore if you want to make biscotti for the holidays use this recipe and then add whatever you'd like to it. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANZOTHEFABULOUS"
},
"reviewBody": "These are wonderful...a real keeper. I've tried lots of biscotti recipes and this is one of the best. I made them exactly like the recipe said. I used a pastry scraper to cut them when they came out of the oven. Worked like a charm! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "destinym"
},
"reviewBody": "Delicious biscotti! It's very light and crispy, yet not rock hard like other biscotti. I omitted the hazelnuts, and drizzled vanilla glaze. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SBC1023"
},
"reviewBody": "These are delicious and somewhat different than the usual almond biscotti. I did chop up the hazelnuts, but left the skins on. I also sprinkled cinnamon/sugar over the logs before the firs t baking. Be sure to let them cool about 15 minutes before slicing for the second baking, and turn them on their sides to bake.\n\nI discovered a cool product at Trader Joe's--a grinder containing sugar,coffee, and chocolate! Next time, I will use that instead of the cinnamoin/sugar for a \"Cappaccino Biscotti\"!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilbambella"
},
"reviewBody": "Really good! Needed a lot of bench flour since the dough was really mushy and sticky. I always cut my biscotti hot to avoid breaking them. These aren't very sweet which is fantastic in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brighteyedbaker"
},
"reviewBody": "Once I found this recipe, I haven't even bothered looking for another biscotti recipe. It's the perfect base for any adaptations. I wrote about my adaptation on my blog: confessionsofabrighteyedbaker.com, but these are the basics: I use 2 tsp of almond extract rather than the vanilla extract and skip the cinnamon so as to concentrate on the almond flavor. I either use 1 cup of slivered almonds or leave out the nuts altogether. I also prefer crispier biscotti than the original recipe makes, so I recommend doing the second bake for 10 minutes on each side. Once the biscotti have cooled, I pour melted dark chocolate on top (about 1 cup), and sprinkle slivered almonds over the chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmie"
},
"reviewBody": "This was my first attempt at making biscotti…and I will look no further for an amazing recipe! I love the hint of cinnamon and the powerful hazelnuts. These are perfect for dipping into a cup of hot, steamy coffee or chai tea. You will not regret investing your time and effort into these babies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "powersce"
},
"reviewBody": "you MUST try this recipe. Look no further!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chella"
},
"reviewBody": "I don't do well with baking, so when I chose to make this recipe for a gift, I decided to do a practice run first. \"They were fantastic!\" \"Looks like they came from a store!\" are the comments I've been hearing all morning. I don't like biscotti, so I haven't tried them. But I trust their opinions, so I am confident they came out very nicely. \n\nI did make a few changes. And when I make it the next time, I will do a couple more adjustments. On the advice of other reviewers, I doubled the cinnamon. However, my taste testers say you can still BARELY taste it. So, I'll be using 2 teaspoons of it next time. I also used less hazelnuts than called for and I did half vanilla and half almond extract. As for working with the dough, it really is very easy to work with! If you are having THAT many problems with it, you must've really messed up somewhere, is all I can say. During the actual baking process, I baked it for 25 minutes. I tried the serrated knife, but it still crumbled a little (I am going to cream the sugar and butter VERY well next time), so I'll give a butcher's knife a try next. The second time I baked them, I left them on for an extra 5 minutes and then I just shut the oven off and left them in the oven for 15 more minutes. I was a little concerned about how crispy they'd get, but they really are CRISPY! I am thrilled with the results and am very excited to give them away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Very Good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CassandraAnn"
},
"reviewBody": "love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phantommn"
},
"reviewBody": "First Biscotti try in my life and it worked great. It takes sometime to have the biscottis get hard as cookies, but I just left them a little longer and they were perfect. I even added some burnt cajeta, honey and brown sugar :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "So good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorrie Hayes"
},
"reviewBody": "LOVE this recipe as is, but I've also used this as a base recipe (without the hazelnuts) for assorted biscotti. TIPS: As another reviewer stated, definitely take plenty of time to thoroughly cream your sugar and softened butter. Skimping on that step could give you a crumbly biscuit (not what you're going for here). Also, use a good quality pure vanilla extract -- no cheap stuff. Varieties to try: Just the base recipe (no nuts); Craisins &amp; Pistachios; chopped pecans, etc. It's all good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "These were great! I had hazelnuts hanging out in my cabinet and I thought this would be a great way to use them. They were! But now I have to buy more hazelnuts to make them again! Softer and lighter than a lot of biscotti but still nice and crisp, a perfect compliment to coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "honeybee4christ"
},
"reviewBody": "Wonderful! I followed the recipe exactly, and got great results! I found that the thicker they are, the better they turned out for me. Three things to keep in mind: 1. Take the skins off the hazelnuts. 2. Dry them out really well for that real Italian biscotti 3. Turn them over! Thank you!! Def. a keeper :) I put chocolate on them and put them out by the coffeemaker for my coworkers. They were ALL gone!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful! I followed the recipe exactly, and got great results! I found that the thicker they are, the better they turned out for me. Three things to keep in mind: 1. Take the skins off the hazelnuts. 2. Dry them out really well for that real Italian biscotti 3. Turn them over! Thank you!! Def. a keeper :) I put chocolate on them and put them out by the coffeemaker for my coworkers. They were ALL gone!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmmcakes"
},
"reviewBody": "just made these for the 1st time, they are great! I dipped them in dark chocolate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkaeekj"
},
"reviewBody": "I really like the dough consistency in this recipe, and I will be using this as my base from now on. With my old recipe, I frequently had trouble with the dough crumbling when I cut it. I didn't have that problem at all with this recipe, and the dough didn't spread during baking. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ursula"
},
"reviewBody": "replaced hazelnuts with almonds and drizzled with melted chocolate. very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ainne"
},
"reviewBody": "This is a lovely biscotti! I followed other reviewers' advice and used 1/2 cup butter. The basic cookie is like an empty canvas. Use your imagination. After making the first batch according to Kris's recipe, which we all loved, I began to experiment. My favorite was using almond extract, candied ginger, and lemon zest. Dip the bottom edge of cooled cookie in white chocolate, and then almonds...delicious! Kris, thank you for taking the time to share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emi768"
},
"reviewBody": "Just tried these this past weekend....YUUUUUUMMMMMM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BakerChic"
},
"reviewBody": "The recipe was very good. Easy to mix and good flavor. However, being the first time I've made biscotti I thought the shaping directions were confusing and vague. I also don't think that biscotti is usually cut in 1/2 inch increments as called for in the recipe... more like 1 to 1.5 inches. Still, great for dipping in coffee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "krystal"
},
"reviewBody": "Turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackberry botanicals"
},
"reviewBody": "Amazing and well worth the effort"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryke"
},
"reviewBody": "More sugar cookie like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junie22"
},
"reviewBody": "Fabulous biscotti recipe. I didn't have hazelnuts on hand, so I used toasted walnuts instead. I made these as a dipper for chocolate fondue, and they worked out perfectly. I popped the rest in the freezer, and then I just ate plain or dunked in coffee. This recipe has been added to my list of holiday cookies, which I give away to family, friends, and co-workers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "I make these a lot. I recently gave some to my brother-in-law whose family is from Italy. He shared them with his parents and they said these are the best biscotti they have ever had. I do use almonds instead of hazelnuts and I add 1/4 tsp of almond extract. They are perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spotts06"
},
"reviewBody": "Great recipe. My only problem is that I have a hard time finding hazelnuts. Wonder what it would be like to substitute Nutella ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wordsmythwmn"
},
"reviewBody": "I have baked several different Biscotti Recipes from Allrecipes.com. THIS is the best I have made. A couple suggestions. This dough is moister than some when baked. I did the first bake for 25 minutes, rested the loaf for 5 minutes and sliced. I like my biscotti crisp. On parchment paper, I put the slices in 250 degree oven for 20 minutes, lowered the oven to 200 degrees for 20 minutes and then 170 degrees for another 30 minutes; turned off oven and let the slices cool inside the oven. PERFECTLY crisp. My variation on my picture is for Cinnamon BUTTERSCOTCH Biscotti, using this recipe, but replacing the hazelnuts with Butterscotch chips. ALSO, replaced 1/2 cup granulated sugar with brown sugar. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "travellingbaker"
},
"reviewBody": "So delicious! Not overly crunchy, but just right. I've been looking for a good biscotti recipe for a long long time. I'm so glad I tried this. Definitely going to make these again. They don't need to go in for 30 minutes. I wasn't watching it and it was almost burnt. I would say 15 to 20 minutes. This is a great base for many other flavours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FunkyApples"
},
"reviewBody": "Yum, yum, yum...these were superb. They were excellent...not too soft nor too hard like most biscotti I have tasted. I didn't have hazelnuts, so I added 1/2 cup of crasions and 1/2 cup of almonds. Once they had cooled down I dipped one side in white chocolate. Everyone enjoyed them with their tea and coffee. I will definitely be making these again. They will make a nice winter treat!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11525/cinnamon-hazelnut-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11525/cinnamon-hazelnut-biscotti/",
"name": "Cinnamon Hazelnut Biscotti"
}
}
]
}
}
, "about": [
]
}
]