				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cinnamon Rolls From Frozen Bread Dough - EASY"
,"datePublished": "2020-03-05T00:09:54.000-05:00"
,"dateModified": "2022-08-25T16:44:24.000-04:00"
,"author": [
{"@type": "Person"
,"name": "J Jones"
,"url": "https://www.allrecipes.com/cook/990622"
}
]
,"description": "This frozen bread dough recipe makes the easiest, tastiest cinnamon rolls filled with brown sugar, walnuts, and cinnamon, topped with sweet icing."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JWiqfEwt3xEuaQsBkhaLMWdhCc0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/968526-cinnamon-rolls-from-frozen-bread-dough-easy-sanzoe-4x3-1-471d5a5bc9244cc18fbf982689681fca.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cinnamon Rolls From Frozen Bread Dough - EASY"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "69"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "152 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "9 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "139 mg"
,"sugarContent": "12 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 tablespoons melted butter, divided",
"1 (1 pound) loaf frozen bread dough, thawed",
"0.66666668653488 cup brown sugar",
"0.5 cup chopped walnuts",
"1 teaspoon ground cinnamon",
"0.33333334326744 cup heavy whipping cream",
"0.66666668653488 cup sifted confectioners' sugar, or as needed",
"1 tablespoon milk, or more as needed",
"1 dash vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Lightly grease two 9-inch round cake pans with 1 tablespoon melted butter; set aside."
} ,{
"@type": "HowToStep"
,"text": "Roll bread dough out to an 18x6-inch rectangle and brush with remaining tablespoon melted butter. Mix brown sugar, walnuts, and cinnamon in a bowl; sprinkle over dough. Roll dough into a log, starting at a long edge. Moisten the other long edge with a little water; press to seal."
} ,{
"@type": "HowToStep"
,"text": "Cut log into 20 slices. Arrange rolls, cut-sides down, in the prepared cake pans. Cover with a towel and let rise in a warm place until doubled in size, about 1 1/2 hours."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Pour heavy cream over rolls."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden brown, about 25 minutes."
} ,{
"@type": "HowToStep"
,"text": "Make icing: Stir confectioners&#39; sugar, milk, and vanilla in a bowl until smooth and pourable. Add more milk or sugar as needed to reach desired consistency."
} ,{
"@type": "HowToStep"
,"text": "Drizzle icing over warm cinnamon rolls."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GiGi's Kitchen"
},
"reviewBody": "Love this easy recipe! I divided the dough and made 2 batches of 8. I did add more cinnamon and brown sugar. On the first batch I didn't use the heavy cream. The second batch I froze overnight and poured a little almond milk instead of heavy cream. My oven must cook faster as well I took the first batch out at 20 minutes and will check the second batch at 15 mins. The family loves the rolls. This is a great idea with the pre-made dough! Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Bell"
},
"reviewBody": "Easy, and delicious! a new family tradition has been discovered! thank you for the recipe, and thanks to everyone here for all of the tips"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sherry Taylor Wall"
},
"reviewBody": "Nothing special, definitely needs more cinnamon and I would use half regular sugar and brown sugar. I wouldn’t make again. But it all depends on your taste, husband loved it, me not so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lbuckle1965"
},
"reviewBody": "Delicious! I added golden raisins. I also assembled them in the evening, put them in the baking pan, covered them, and put them in the refrigerator overnight. In the morning I took them out, heated the oven to 200 F, turned off the oven and let them sit in the warmed oven for about 35 minutes to rise. Then I took them out, preheated the oven to 350 F, poured the whipping cream over them and baked them. I covered them after 12 minutes to keep the tops from burning, and baked another 8 minutes. They turned out perfect! I was a little hesitant about pouring the whipping cream over them, but it mixed with the sprinkled brown sugar to make the tastiest caramel on the bottom of the rolls! My husband said they were the best cinnamon rolls ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cold_feet_26"
},
"reviewBody": "I haven't tasted them yet but they look great. Next time I might not make as many so that they're bigger"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "My kids loved this and it was super easy. I did add a little extra brown sugar and cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulamarci"
},
"reviewBody": "We're hooked. So easy to make and delicious. One pan didn't last the evening. The other will be gone by lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JT1"
},
"reviewBody": "Easy and yummy, though it takes a bit of time for the bread dough to rise so it's not a quick process! I used pecans instead of walnuts and increased the amount of cinnamon ... both just preferences. Huge hit with family and friends!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marnie"
},
"reviewBody": "This was an incredible recipe and so quick and easy! The rolls were light and fluffy and perfectly moist. I used coconut milk instead of heavy cream because of my daughter's milk allergy. I also added pecans and a hint of nutmeg. For the frosting: powdered sugar, melted vegan butter and a couple Tbs of almond milk. (The milk allergy again) Move over Cinnabon, yours don't hold a candle to these! I believe these were the best cinnamon rolls I have ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "So easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VeggieBabe"
},
"reviewBody": "I just made this exactly as written and they came out almost perfectly. My oven must cook a little faster because they were ready at about 20 minutes. Can anyone tell me if the cream is 1/3 cup per pan or divided between pans? After reading the reviews I expected them to be a little more gooey on the bottom and mine were on the dry side. Still excellent as written though and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bangs"
},
"reviewBody": "Melt in your mouth good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Wilkins"
},
"reviewBody": "This turned out beautifully, and was super fast. I added pecans to the crumble. I only used half of the cream, which was plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NaniA"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Benson Barrante"
},
"reviewBody": "Just delicious! Took these to a meeting everyone loved them! Will make these again!! Didn't have heavy whipping crem so used 1% milk and butter instead, worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scharry Olds"
},
"reviewBody": "Absolutely the best cinnamon rolls ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jorji"
},
"reviewBody": "My husband said they were the best he ever had. The bread is light and the sweetness is perfect. I put some cream cheese in with the butter. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon K"
},
"reviewBody": "SO GOOD!! OK, I'm a totally new baker, and doughs are still really tricky for me, but I did these! Just a few thoughts for other noobs:\n\n1. I thawed the frozen dough overnight in the fridge in bread pans. Make sure to spray the pans and plastic wrap covers. Then, I took them out and let them rise for 1.5 hours. I covered a silicone cookie sheet on the counter and shook some flour on it and the rolling pin, rolled it out to fit the silicone, then used the silicone to help me roll it up. I used dental floss to cut them into 2-3 inch rolls, putting them into a buttered baking dish with a little space between each. I covered them back up, and let them rise for another 1.5 hours. \n\n2. I almost forgot the cream! I put them in, after 10 minutes let out a shriek, poured it over, continued cooking. What I didn't know was the cream makes a kind of caramel when it cooks with the cinnamon/butter/sugar in the rolls dripping. DELICIOUS!!\n\n3. I took the first pan out too soon, because the tops were brown, but the whole centers collapsed! We ate them anyway...lol. Second batch, I covered with foil and gave them an extra 10 minutes. PERFECT.\n\nSo, delicious, easy, best ever cinnamon rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "ROLLING THE DOUGH: I would help my mother make pecan rolls using frozen dough. The \"KEY\" to rolling the dough is to allow it to rise first before rolling it out. Thaw in fridge overnight then put in any large bowl, just be sure to coat the inside of it with a bit of butter/cooking spray to prevent sticking and cover to prevent a crust from forming. Once risen, deflate and start rolling on a lightly floured surface."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Allen"
},
"reviewBody": "Ridiculously easy. Didn't have the cream, and didn't bother with the icing. we were eating them right out of the oven. My new favorite!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugocook"
},
"reviewBody": "I took a chance and substituted 2% milk for the heavy cream. It's only 1/3 cup so I was careful with spreading it, and It turned out well that I couldn't make it without. I made 10 rolls from one frozen loaf and liked it that they weren't too small.\n ....if someone has a milk allergy I think almond milk would work well as it has a higher fat content. \n ... So glad I did not make icing as I found these sweet enough. \n...now I have to try and make homemade frozen dough with whole wheat. I looked at the storebought dough and it contains ammonium somthing...i have no idea what it is..but it doesn't sound good.\nTHANKS for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "Not only did I like this recipe for its time saving feature, but the fact that it calls for way less butter and brown sugar than many other recipes. The taste and texture was really good and they were quickly devoured by my clan. Thanks for sharing this recipe! It's definitely going on my \"keeper\" file!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roberta Pactricia Fischer"
},
"reviewBody": "I have a question do you thaw the frozen bread first then work with it and let it rise again &gt;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Mergen"
},
"reviewBody": "I did not pour the buttermilk over the rolls and they turned out just fine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Made these this Christmas morning!! Delish!! Who knew how much difference the cream would add. Amazing! And I even forgot the cinnamon. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mapp"
},
"reviewBody": "I added raisins but otherwise followed the recipe. Texture-wise they turned out beautifully. But they were way too sweet for my taste. Next time I will use half the sugar and forget the icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAXMOM2"
},
"reviewBody": "I make cinnamon rolls from scratch and I'd have to saw that this recipe almost beats mine! This is a keeper, as I love how fast this can be put together in the morning when you defrost the bread dough overnight in the refrigerator!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karla Cheek"
},
"reviewBody": "Its easy-to-use dough makes a fast cinnamon roll."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanHunt"
},
"reviewBody": "Perfection for those who want a homemade tasting cinnamon roll using frozen bread dough. Be patient with the dough when rolling. It needs to rest a few minutes inbetween rolling out. The addition of the cream seemed weird to me but trust me when i say it doesnt make it soggy just wonderful. The rolls are good with or without the frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Absolutely amazing! We're getting hit with a snowstorm and it put me in the mood to bake so I actually made these as a spur of the moment thing. I always have frozen bread dough on hand and usually end up making monkey bread with it and, for use in a different recipe, I happened to have heavy cream so, tonight I tried something different. I followed this recipe almost to the T, with the exception of adding a little more cinnamon while excluding the walnuts, and the rolls were superb. \nMy husband is finicky about certain cinnamon desserts but when he went back for seconds I knew it was a hit. \nI was sceptacle about the heavy cream but after tasting them...all I can say is...delicious! \nAs for the \"glaze\", I doubled the recipe and added a little extra vanilla. \nDefinitely will keep this as one of my favorite recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Cook"
},
"reviewBody": "I cut the rolls into fairly good sized pieces - about an inch each and baked in large parchment paper lined spring form pans for 33 minutes. Eight or nine 'buns' per pan seemed about right. They were excellent and very well received! I did add cream cheese to my icing for extra flavour and less sweetness.\n\nI will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kit-e-kat"
},
"reviewBody": "I love this recipe. Very easy and the rolls come out just like my mom used to make. To get the bread dough to rise properly, I take one loaf from the freezer, put it in an 8x8 or large pie pan, rub a little butter on top and cover with plastic wrap. This allows it to rise without getting those hard spots. When it has thawed and risen, I take it out and roll it into a rectangle, then add the filling. After cutting and putting the rolls back in the pan, I cover it again and let them rise until cooking (at least a couple hours, sometimes overnight). I have never tried to get two pans from one bread loaf as the recipe says. Seems to me they'd be very small. Oh, and before putting the rolls in the pan, sprinkle more brown sugar and a little butter. This gives the rolls that nice, sticky bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "runmommaseltz"
},
"reviewBody": "So easy to make! My 8 year old was able to help, too! The were moist and delicious! I made 4 batches today!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HateToBake"
},
"reviewBody": "I don't baked a lot and chose this recipe because it was supposed to be easy but by the time I (barely) got the dough rolled out, I wanted to scream. I forged on! Finally ready to roll it up...OMG...SHOOT ME...fail! I'm sure they will taste great even though they look terrible. Serves me right anyway, cuz I should have used handmade dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hun"
},
"reviewBody": "This recipe is so easy. I followed the instructions to the letter. My cinnamon rolls was the best. They taste better than the ones in Burger King.! My husband loved them. I'm in LOOOOOVE with this recipe. Thank you so much for sharing this easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is a great use of any leftover bread dough you have. I had some “Amish White Bread” dough leftover and I can tell you these rolls didn’t last long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bjdlr21"
},
"reviewBody": "These taste excellent. The only trouble I had was rolling out the dough. I should have allowed to thaw more completely. I also replaced Raisins for the Walnuts. So mix the Brown Sugar and Cinnamon together, sprinkle on the buttered dough. Then sprinkle your raisins on top of the brown sugar/cinnamon mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "marnie"
},
"reviewBody": "Disappointed! Turned out doughy on bottom even though let them get deeper golden on top then would have like. Really questioned the dumping of the cream on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dpalmer5"
},
"reviewBody": "These rolls were fabulous! Definitely Christmas morning worthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Warrick"
},
"reviewBody": "These rolls were very tasty and sweet. The reason for only 4 stars is that it was hard to roll the dough thin enough to make the jelly roll style, and when they rose, they uncurled quit a bit, but everyone liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edith"
},
"reviewBody": "So easy and delicous! Brought a pan to work and they were gone quick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "food fan"
},
"reviewBody": "Yum! Easy is right and tastier than the simple ingredients would lead you to think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "Easy, had that bread texture I was after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "Easy enough, but don't need the icing because they're sweet enough. Next time I'll cut the brown sugar back. This would be a 5 if it was a sweet bread dough instead of a regular bread dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev Tugnett"
},
"reviewBody": "Super easy AND super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danceislife1613"
},
"reviewBody": "Best cinnamon buns I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mhulse"
},
"reviewBody": "At this moment the rolls, such as they are, are rising. I thawed the dough in a baggie overnight in the refrigerator. When I tried to roll it out to the dimensions in the instructions, it kept springing back. I was never able to get it flat enough to roll up very well. Any ideas?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Dear CLOUDY 14, the Heavy Cream is poured over the dough in STEP 3. (it is written out after the oven temp setting.) Hope that answers your question."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsdrclay"
},
"reviewBody": "Cloudy 14 you pour it over the dough -see step 3."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mumsley200"
},
"reviewBody": "To Cloudy, I believe the heavy cream would replace the milk for the topping for the rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dsdarlag"
},
"reviewBody": "I've been making this for about 30 years and it is always a success...very quick, easy and yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gerlieve Oliver Thompson"
},
"reviewBody": "I tried this using the overnight method suggested on another site. The taste was yummy, but the dough was very tough. I don't know where I went wrong because they were minimumly handled. Not to be outdone, I tried this version and they were perfect...soft, fluffy, delicious. Success feels even better after a failure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emksnow"
},
"reviewBody": "Absolutely amazing! I made this recipe for my mom for mother's day, she was delighted when she woke up and found out what I was up to, but also a bit sad because she was on a diet (unknown to me at the time). She said she would have one, but she ended up having two, and one more the next day! These cinnamon rolls could not have been more delicious. Using frozen bread dough is so much easier and just as good as making homemade dough. I exchanged pecans for walnuts which turned out great! Definitely worth a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJWEYERMAN"
},
"reviewBody": "OMG The best! Could not believe how good these are and I didn't feel like I was cheating either. Thanks for the recipe. THEY'RE\n GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "Awesome rolls!! Will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tis' Tasty"
},
"reviewBody": "They just came out of the oven and they are so tender!! The heavy cream really added to the tenderness. This is my go to recipe from now on. Using frozen dough was perfect and saved time. It's hard to improve on this recipe; I just used pecans instead and made a mistake and added the heavy cream to the icing but I wouldn't change what I did...it added to the flavor of the icing. I just added more sugar to get to the consistency I wanted. My photo was too large to upload... :-( Thanks so much..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cori"
},
"reviewBody": "These were easy and delicious! Much cheaper than the store bought version as well. Cinnamon rolls are a Christmas tradition at our house and these will replace the store bought version from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wiccanwoman"
},
"reviewBody": "I was amazed at how easy they were to make but also how really yummy they were too! This recipe is great anytime but especially when you don't have the time to make dough from scratch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coffeecupp"
},
"reviewBody": "i have made these for years. they stay soft for days, if they last that long. you can use cream cheese and jam instead of butter and cinnamon in the middle for a different taste. the whipping creme is the key to these rolls. you will love them."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230133/cinnamon-rolls-from-frozen-bread-dough-easy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
"name": "Breakfast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230133/cinnamon-rolls-from-frozen-bread-dough-easy/",
"name": "Cinnamon Rolls From Frozen Bread Dough - EASY"
}
}
]
}
}
, "about": [
]
}
]