				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Classic Lard Two-Crust Pie Pastry"
,"datePublished": "2019-04-03T23:56:19.000-04:00"
,"dateModified": "2022-11-20T13:33:40.000-05:00"
,"author": [
{"@type": "Person"
,"name": "SandraJ"
,"url": "https://www.allrecipes.com/cook/2407927"
}
]
,"description": "This pie crust with lard, flour, salt, and ice water bakes up perfectly flaky and tender every time; add your favorite filling for a classic treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xCN5jgxgb4bVTQslcIA8uqwyn2k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1734366-341164ff08d242abb0433f77e7c7faf4.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Classic Lard Two-Crust Pie Pastry"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "38"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "268 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "292 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"1 teaspoon salt",
"0.66666668653488 cup lard",
"5 tablespoons ice water, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk flour and salt together in a large bowl. Cut in lard with a knife or pastry blender until the mixture resembles coarse crumbs."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle in water, 1 tablespoon at a time, blending gently with a fork or pastry blender until all flour is moistened and dough almost cleans the sides of the bowl."
} ,{
"@type": "HowToStep"
,"text": "Divide the dough in half and shape flattened rounds. Wrap in plastic and refrigerate for at least 1 hour."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made it, exactly as the instructions say. Tossed the lard in the freezer for 30 minutes beforehand, it wasn’t even that cold. Cutting the dough into the correct consistency was a cinch. I’m going to be using this recipe a lot! I would much rather use lard than crisco or vegetable products, and I was worried that it’d be difficult to cut the dough correctly. But no, it was easy as can be. I had the dough sorted out and packed up in less than ten minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DDatler"
},
"reviewBody": "I use whole milk instead of water and it makes a big difference in the finished crust. Flaky and melts in your mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Delicious! Very flaky and tender. So easy to roll out as well. Made it twice and perfect both times. I am thinking maybe the person whose pie turned out tough used too much water and mixed it too long/vigorously. Could also have used too much flour - if you scoop out the flour with the measuring cup (thus packing it in=more per cup measure) instead of spooning it gently in the measuring cup with a large spoon. My only problem with the recipe is that I use a 9.5 inch deep dish pie pan as I like to use 7-8 cups of fruit in my fruit pies. So the 2 c of flour recipe was not near enough crust for me. I really had to piece together the top crust and had almost no crust/edge on the outside of the pie. Easily fixed though. Just made the recipe the next time with 3 c of flour to 1 cup of lard, 1.5 t. Of salt and it turned out perfectly. This is the normal amount of flour I usually see in recipes for 2 crust pies. I am going to take one of the other reviewer’s suggestion of mixing the flour, salt, and lard ahead and having it on hand to whip up a pie at a moments notice! I also plan on bringing that make-ahead mix to bring to a vacation at a condo on the lake to be able to mix up a pie quickly on vacation. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RogerS"
},
"reviewBody": "This is a great, reliable recipe for a tender flakey crust. Lard has always been the best way to make a good pie crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roystahl"
},
"reviewBody": "We used leaf and non-leaf lard from our own little herd of homestead-raised American guinea hogs. At first I used pastry flour but this ended up way too wet and too greasy. I wonder if the lard from our hogs is different from commercial hogs or if the pastry flour was a mistake. It did taste good and did not burn the way butter pie crusts do, so I am going to re-do this recipe with regular flour and see what happens. I would also definitely add the COLD water a spoonful at a time only after you've incorporated the fat as indicated in the recipe directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alycia Keating"
},
"reviewBody": "Good recipe but I'd cut the water down to 2.5 TBSPs or so; 5 TBSPs left it almost gummy and I couldn't roll it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tedri Mumm"
},
"reviewBody": "I used to work at the family bakery and this is hands down the best pie crust I've ever made. I've made it several times and it always comes out perfect (though I usually need more than the recommended 5 tsps of ice water to get the right consistency--always eyeball it as your flour may be more or less dry.) 5/5 would eat a rock if it was wrapped in this crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kira"
},
"reviewBody": "I will never look for another pie crust recipe. This is the first time I've ever been 100% satisfied with the flakiness of the bottom crust. This was absolutely perfect. I think putting it on the bottom rack first at high heat was critical. I also followed a tip I saw online, of pre-heating the cookie sheet that the pie was going to rest on, so that the bottom crust was even more exposed to heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lvolve"
},
"reviewBody": "Followed the recipe. This is exactly my grandmother's. The difference was this. I used the potato masher to blend diligently BEFORE the Ice, Ice Cold water. Increased the water by one table spoon. The key is not to mix the dough too much just incorporate the water. Let sit for 5 minutes then blend with your hands to a WELL floured board. I made a pumpkin pie today and used the second crust for a chicken pot pie. Thank you so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Weyna Sands"
},
"reviewBody": "No changes and I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jesse King"
},
"reviewBody": "Delicious old-fashioned crust. Savory, flakey, bakes nicely golden, and it's easy to do. I used Merrill Snowcap Manteca."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Valerie Spara"
},
"reviewBody": "I have been baking for over 50 years and have had rave reviews from my mom's pie crust recipe and my number #1 favorite pastry pie crust from Southern Living recipe book. But when I tried this recipe, it was a nightmare trying to roll out. It kept falling apart. For the bottom pie crust, I spent most of my time patching it together. When I made the top pie crust, I had to keep sprinkling with flour and folding and rolling. It was far too time intensive to say the least. The pie came out flaky. After testing the crust , I can already tell from past experience with pie crusts that it will fall apart when slicing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "margomarie1"
},
"reviewBody": "It tastes SOOO GOOD. This is my go to pie crust. Took me awhile to get used to rolling it out, but practice makes perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol F"
},
"reviewBody": "Like others, I've been using this recipe for 40ish years and my Mom used it for decades more with the only difference being we made three times this recipe (6 c flour, 1 lb lard - there are 2 cups lard in a pound so 6/3 cups, 1 tbsp salt or a little less, but also 5 teaspoons brown sugar). It would be premixed and stored in the cupboard. When she needed a pie crust, she would measure out 2 cups for a two-crust pie and add enough water to bring the dough together - somewhere between 3 and 5 tbsp for 2 cups mix. No refrigeration Always ready Always delicious. Always flaky. I'm going to keep my extra in the fridge this time as I don't make pies as often. Waiting for my apple pie now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Apostolicmomma"
},
"reviewBody": "Tastes great as a crust for my chicken pot pie. Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances Dodger Basina Garcia"
},
"reviewBody": "Very nice recipe for a first time user."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinap"
},
"reviewBody": "This is the original pie crust my Great Grandma use to make. The trick is to make sure you get non hydrogenated leaf lard. Lard with non of the chemicals such as BHA, propyl gallate and citric acid. Lard is fantastic fat with no trans fats and actually healthier than butter or other fats. It makes for a perfectly flaky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "francine lemasurier"
},
"reviewBody": "I have been making this pastry for a number of years. It has never failed me. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "This was a good base to start with. I just subbed the AP flour with the wheat free blend I use when baking for my husband. I think it turned out to be one of the best pie crusts I have ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant K Montag"
},
"reviewBody": "yes I made it and it was the best as good as my mom's I became a pasty chef because of her you just can't get a shortening our butter crust to look like this ...this is a green tomato pie very good in ate most of it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CR Jeff"
},
"reviewBody": "Never had any luck making pie crusts, but this one turned out great and definitely my new favorite. I used a cheese grater to shred the lard and just stirred it with a spoon. I did add more than the 5 tablespoons of ice water and also added a touch of sugar. But the first time I had a flaky crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Candi Newcombe"
},
"reviewBody": "Hard as a rock, not fluffy or flakey and followed the recipe too. Going to go back to the food processor style.\nI've never been good with pie crust manually. Does it require special flour? How much needing?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ralph Richardson"
},
"reviewBody": "This is a basic recipe since time began. If you can't make this come out great then you better stick to the store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Layne"
},
"reviewBody": "No changes, and I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Went looking for a lard crust recipe to compare it to my Grandmothers recipe that I've had for forever... this is exactly the same and I've always thought my grandmothers crust was very flaky and delicious. So this confirms that the recipe I've relied on for many years is still the perfect crust recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RET2466"
},
"reviewBody": "Went looking for a lard crust recipe to compare it to my Grandmothers recipe that I've had for forever... this is exactly the same and I've always thought my grandmothers crust was very flaky and delicious. So this confirms that the recipe I've relied on for many years is still the perfect crust recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alanna Miller"
},
"reviewBody": "I'm so glad to find this recipe. It is the recipe that I have used for years, but lost. Heavy on the lard, yes, but we don't eat pie often enough to matter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margret Penny Doucette-Phillip"
},
"reviewBody": "rolled out perfectly!! easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcwatson01"
},
"reviewBody": "Excellent recipe for those who are allergic to dairy. Easy to make and comes out flaky and nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "danis brass"
},
"reviewBody": "Turned out Chewey and a bit tough, had hard time getting it to just stick or form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jason Cowley"
},
"reviewBody": "It was far to dry and would not even come close to forming dough, even with twice as much water added.\n\nMeasurements should always be given by weight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Fortner"
},
"reviewBody": "I have been using this same one for over 50 years. my mom always had me make the pies,she said mine came out better than hers. I noticed there wasn't any temperature or\ntime listed. For people new to this might be helpful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "k_mom5"
},
"reviewBody": "I've been using this pie crust recipe for decades. I no longer experiment with other recipes because nothing compares to this recipe my grandma always used. If I'm making four or more pies at a time, I use my food processor. My lard is always kept in the fridge, and before I begin, I place a glass of water in the freezer. (Cold ingredients ensure a more workable dough.) I briefly pulse the flour, lard, and salt to form pea-sized balls. I add between 4 and 6 T. of ice water, depending on humidity, until a ball forms. (A slightly sticky dough is easier to work with than one that's too dry.) Work quickly! Do not overwork the dough or allow the ingredients to warm to room temp! I bake the bottom crust for a few minutes before adding the filling. I've been told on many occasions, \"This is the best pie I've ever had in my life!\" \n****I often skip refrigerating the dough if I'm making one or two pies and have no problems."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/234976/classic-lard-two-crust-pie-pastry/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/818/desserts/pies/pie-crusts/",
"name": "Pie Crusts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17716/desserts/pies/pie-crusts/pastry-crusts/",
"name": "Pastry Crusts"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/234976/classic-lard-two-crust-pie-pastry/",
"name": "Classic Lard Two-Crust Pie Pastry"
}
}
]
}
}
, "about": [
]
}
]