				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Classic Minestrone"
,"datePublished": "1999-03-01T21:41:59.000-05:00"
,"dateModified": "2022-01-07T10:49:40.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "This is a traditional minestrone complete with leeks and zucchini in a tomato soup base with cannellini beans and pasta. Serve with grated Parmesan cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/K4ITuaso19rrwQvLvkedA2tpkuI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/448549-7ba872a62a274311b6fafd1465f80f98.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Classic Minestrone"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "289"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "320 kcal"
,"carbohydrateContent": "45 g"
,"fiberContent": "10 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "471 mg"
,"sugarContent": "8 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 tablespoons olive oil",
"1 leek, sliced",
"2 carrots, chopped",
"1 zucchini, thinly sliced",
"4 ounces green beans, cut into 1 inch pieces",
"2 stalks celery, thinly sliced",
"1.5 quarts vegetable stock",
"1 pound chopped tomatoes",
"1 tablespoon chopped fresh thyme",
"1 (15 ounce) can cannellini beans, with liquid",
"0.25 cup elbow macaroni",
"salt and ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat olive oil in a large saucepan, over medium heat. Add leek, carrots, zucchini, green beans and celery. Cover, and reduce heat to low. Cook for 15 minutes, shaking the pan occasionally."
} ,{
"@type": "HowToStep"
,"text": "Stir in the stock, tomatoes and thyme. Bring to a boil, then replace the lid, and reduce heat to low; simmer gently for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in the cannellini beans with liquid and pasta. Simmer for an additional 10 minutes, or until pasta is al dente. Season with salt and pepper to taste before serving."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "No substitutions but did add chopped beetroot leaves. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryBeth Hedlund"
},
"reviewBody": "I used the ingredient list as a guide (not good at specific amounts for most vegetable-based recipes). Swapped in parsnips for the zucchini (not a z fan), and used lemon pepper in place of salt (diet restriction of sodium). Cooked it all up in a big stock pot... delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TravelOn2"
},
"reviewBody": "I took the advise of other reviewers and made some modifications because I found this recipe bland without some additions. I added about 1.5 cups of tomato puree (a must!); sauteed 3 gloves of garlic in butter; added 2 bay leaves; Italian spices; extra oregano and browned a pound of ground beef. Did not have any cannellini beans so I used light kidney beans. With these additions the soup was 5 stars, without it....closer to 3.5 stars...maybe 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Drake Kohn"
},
"reviewBody": "It's a good place to start for a minestrone. Good flavors, just could use some more seasoning. Will make again and play with adding different veggies as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caoimhin"
},
"reviewBody": "Definitely will make this again. Made our own vegetable broth and used our canned tomatoes from the garden. Make sure you have fresh thyme. It really makes a difference. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen's kitchen"
},
"reviewBody": "Excellent! Great flavor. And diet friendly. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom McCullough Sr."
},
"reviewBody": "I made it according to the recipe except I used a can of diced tomatoes and included the juice. We sprinkled grated parmesan over each bowl for added effect. We loved it and will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kellya87"
},
"reviewBody": "I followed many of the tips others shared and this was awesome! It was indeed bland at first and improved vastly upon sitting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avery"
},
"reviewBody": "A couple of small changes are that I sautéed some pancetta before adding and sweating the vegetables, and I added some dried basil in addition to the thyme. And I used chicken broth instead of vegetable. Other than that I followed the recipe pretty closely with two big exceptions: 1) I steamed the green beans and added them at the last minute so they retain their bright green color and 2) I cooked the pasta al dente separately and added it to the soup just before serving. I've found from past experience that if you cook the pasta in the soup it becomes soggy and starts to soak up the liquid within a few minutes of finishing. The other side benefit of cooking the pasta separately is that you can reserve the pasta water and add it to the soup as it simmers to keep the liquid ratio about right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momma monkey"
},
"reviewBody": "I love The Allrecipes site. I consider myself a pretty good cook! However, no amount of compliments after 38 years of cooking meals for family and friends gives me as much pleasure and joy as looking through Allrecipes site to get IDEAS for meals. This Minestrone soup recipe is awesome as is. In my opinion it needs nothing else added. Of course we all have different tastes!! I like to use fresh or frozen veggies and herbs from my garden for all my recipes if I can. That being said, all of you reviewers that have to add this or that because it tastes, “bland”, maybe try using fresh or farmers market ingredients. I skipped the sauté in a pan step and sautéed in my slow cooker instead. That was my only change. Oh! And I added kale because my garden kale was very happy this year and produced until it snowed!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Kathryn Rodriguez"
},
"reviewBody": "I add paprika and cayenne pepper to mine. It’s super healthy and I freeze it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francelli Hernandez "
},
"reviewBody": "ADDED MORE PASTA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarine Koftikian"
},
"reviewBody": "It was good. Made it great by adding the following: 3 cloves of garlic sautéed, 1 extra carrot, 1 can of tomato paste, lamb broth, 1 lb of sweet italian sausage crumbled. Had it with baguette on the side and some blue cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mr. Paisan"
},
"reviewBody": "Came out great! I’m italian so I have to have meatballs in mine. I used small Angus Meatballs from Walmart..cooked them a little first then they finish cooking in the soup. And I used 1/2 cup pasta instead of 1/4 cup but again, it’s an Italian thing, ciao!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chrisss"
},
"reviewBody": "I made this recently and my kids never commented about it. Almost a week later and they are both asking for it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Smith"
},
"reviewBody": "Super easy! Great comfort food! My family loved it! I did make it vegetarian for us. So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alti"
},
"reviewBody": "And I’ll"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANISHE"
},
"reviewBody": "My go to soup recipe! I make this all the time in a big pot.\n\nDefinitely better the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yes, I will make this again. It was so good and healthy. I took it for a gathering and people asked me how to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angell7"
},
"reviewBody": "Yes, I will make this again. It was so good and healthy. I took it for a gathering and people asked me how to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timothy J Detiveaux"
},
"reviewBody": "Will definitely make this again, our family really enjoyed it. They even asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nicole"
},
"reviewBody": "I made this last week. It was a little bland, though I loved the leeks. It came out bland even with the addition of oregano, extra thyme. Definitely add the pasta separately if you make it, otherwise the pasta will get mushy! My husband highly disliked this soup, but I thought it was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Lee Dahl"
},
"reviewBody": "Just made this for dinner and it was sensational! I have made a point of working with dry beans more lately, and so instead of canned, I soaked and then cooked dry beans and added them. It was delicious, and made enough for 4 generous and hearty portions. I will definitely be making this again, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lps"
},
"reviewBody": "This soup is really good. I omit the zucchini and add jalapeño"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PsychDiva"
},
"reviewBody": "I absolutely adored this, but part of that was because I cheated and followed the advice of other reviewers. Here is my compilation of changes: add .5 tbsp of olive oil, 1 clove of garlic (sliced/chopped), 1 more zucchini, ~1 cup of shredded cabbage, 1-2 tsp of Italian seasoning instead of thyme, 8 tbsp of canned tomato sauce (puree was recommended, but I didn’t have that on hand), 1 can of Kidney beans (drained), 1 can of Garbanzo beans (drained), and used a total of ~1/3 cup of pasta. I used a gluten-free pasta that I trust and cooked it separately while the soup was in the 30 min simmer (step 2), then I added it during the directed time in step 3. Mind you, this turned out to be able to serve 8 to 10 people! (Calories were about 231 to 185 per serving, respectively.) This is a great dish and I love how great it came out! Thank you for this great recipe and thank you to the amazing reviewers that helped kick it up a notch! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toddle-do"
},
"reviewBody": "This is really good and even my 100 year old mom likes it. She pretty fussy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LJ"
},
"reviewBody": "Triple the pasta and amp up the seasoning and this is a very good soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKJwlz82"
},
"reviewBody": "This was very good. I made a few minor changes. I added 1t of minced garlic with the veggies. I added about 1.5C of cabbage. I used 1 can of Italian garlic, oregano, basil tomatoes. Added 1/2t of Italian seasoning instead of thyme and a few dashes of cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitch Ashcroft"
},
"reviewBody": "Awasome, simple. quick, healthy. A Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "telfakaye"
},
"reviewBody": "So simple and so good, there could be more flavor but you can always add spice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danaz"
},
"reviewBody": "This was an excellent recipe! My family absolutely loved it!! Wish I would have doubled it. \nI did tweak it just a little...doubled veggies (zucchini/carrots) left out celery. Fresh tomatoes are out of season so i used 2 cans of plum tomatoes and added some of the juice from one can. I minced 2 garlic cloves and put that in. Left out thyme and used 2 bay leaves and a shake of Italian seasoning. Used orzo pasta instead of macaroni. You can also sub small onion for leek.\nWill make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "Good base recipe. Two tips:\n1. add 1clove of garlic with the sauteed veg.\n2. intermediate step, after veg are mostly sauteed, add the tomatoes and thyme and cook for 2min. Then add a couple cups of tomato juice and reduce it down by half, THEN add the veg stock. Salting the tomato while reducing helps richen it as well. Idk why, it just works.\n\nI always add chopped kale (or spinach if you prefer) to minestrone, cause its good for you :) Also my opinion thyme and bay leaf ARE the appropriate herbs. AVOID THE TEMPTATION TO ADD BASIL.\n Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelly_N"
},
"reviewBody": "I made a lot of changes with spices and veggies based on other user reviews, but this recipe has always turned out great. I do use the canned tomatoes with tomato puree instead of fresh, I reduced the amount of thyme, and added an Italian blend of spices (oregano, garlic, basil, etc). This recipe does seem to get better flavor with time - it's even better as leftovers the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deaconjayz"
},
"reviewBody": "I added sliced fresh mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stacy"
},
"reviewBody": "Make ahead of time. Tastes much better day two or even day three."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brismo"
},
"reviewBody": "LOVED THIS! We left out the beans and added a little more pasta. My husband couldn't stop eating it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KDai"
},
"reviewBody": "spending time in Italy, this recipe brought me right back to dining on a piazza. I always add a bit more veggies than called for, and a can (or fresh cooked) garbanzo beans, too. Used organic chicken stock for more flavor, a can of tomato paste, a can of diced Italian tomatoes, plus more fresh. No one in Italy uses elbow, so instead I used mini farfalle, or orzo is nice, too. Very flavorful- recommend topping with a strong Italian cheese like pecorino romano. very delicious, and very authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyK"
},
"reviewBody": "Great recipe! I made the soup with homemade chicken stock, gluten free elbow noodles, and red beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bali"
},
"reviewBody": "awesome! I add Italian parsley, cilantro and potato. We like it very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom22GreatKids"
},
"reviewBody": "I've never even had minestrone soup, so this was my first attempt at making it. And while I have nothing to compare it to, I really enjoyed this. It was easy to make and was very comforting on a cool evening. I followed the recipe exactly, with the exception of using a can of great northern beans instead of cannellini. However, I don't think that would alter the end outcome too much anyway. Served mine with a crusty roll and a tossed salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sdasilva76"
},
"reviewBody": "I'm giving this 5 stars with the tweaks I made. I used half an onion instead of the leek, tow small-ish fresh tomatoes and 1 8oz. can of tomotoe sauce, less than 1 tablespoon of fresh thyme, white navy beans, small shell pasta and I didn't need any additional salt or pepper. I used Penzeys Spices vegetable soup base to make my stock and it was all the seasoning I needed. I couldn't believe how good this soup came out. The flavors are amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Parmley"
},
"reviewBody": "This is so fast, easy, satisfying, comforting, refreshing! I made it a day early then nuked individual bowls for four mins. topped with 1/4 cup of freshly grated parmesan then nuked it again for one minute. You could also add a piece of toasted bread under the cheese to make a giant crouton."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eirinlinn"
},
"reviewBody": "Wonderful recipe! I added one clove of garlic and potatos and doubled the macaroni and it was a very hearty soup! \r\nA bit of salt made this soup a lot better :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Fix"
},
"reviewBody": "This is a great recipe. It's the first time I made a Minestrone Soup. I had already bought everything, got home and decided to double the batch, and since I didn't feel like running out to the store again I improvised. I only bought enough broth, and leeks for one recipe, so I used what I had. I used green onion and I had beef boulion. I \"eye balled\" all of the ingredients and pretty much added more veggies than the recipe called for. Not by much but use your best judgement. Oh and I only used 1 can of beans. I can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PammieD"
},
"reviewBody": "Great hearty soup (both the the night of and the next day!). I've frozen a bunch so hopefully that works out well for me. I didn't \"change\" the recipe at all (aside from adding a clove of minced garlic), but I did use canned diced tomatoes instead of fresh (primarily because I'm about 12 months pregnant and easy is my M.O. these days!).\n\nFor those having troubles finding cannellini beans in the store - look for \"white kidney beans\"...that's what I found most of the major brands carrying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "natsavy"
},
"reviewBody": "This is a good start to a great soup. I refer to this recipe for the right balance of vege to liquid quantity. I start by browning pancetta cubes in some oil. Then I add the mix of vergetables + some fresh garlic. Instead of thyme I add in about a tablespoon of pesto, a few drops of green pepper Tabasco (Milder Jalapeno) and a piece of Parmigiano rind. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitbynana"
},
"reviewBody": "I have never made minestrone soup before in my life, but this looked so good, I decided to give it a try. I must say that I did make some changes after reading the reviews, so I could adjust it to my personal likes. Not to take away from this recipe, it just had a few things in it that I don't care for. It was easy to make the adjustments with the help of the reviews and it came out amazing. My husband and son-in-law both loved it as well. Thank you Michelle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimrn1963"
},
"reviewBody": "This is so easy and delicious! I did add 1 can of garbanzo beans, oregano, basil and then parmesan cheese on top. It was definitely better the next day! Thanks for the great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rfrangos"
},
"reviewBody": "This was a very easy soup to make. I am disappointed by the broth- it was much too bland for my family's taste. Next time I think I will add a clove of garlic and not so much thyme. By the time my husband (who never adds salt) put enough salt in to taste, he asked me to just add bouillon cubes to made it edible for the next day's lunch. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TandTmom"
},
"reviewBody": "This soup was delish, but I gave it only 4 stars because I did add a couple things...I added 1 clove of minced garlic to the veggies, and I added half of a can of tomato paste. Even my 8 month old LOVED this soup. I plan to double it next time so I can freeze one! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gramma's Apron"
},
"reviewBody": "Even my picky kid ate some vegetables with this soup. It was that good! Tasted very authentic to me. I gave it four starts instead of five because I had to add some tomato paste to richen the broth and used a bit of garlic, too, just because."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Great soup. I did make substitutions but that's the sign of a good, basic recipe. It can take altering and still be good. We used chopped onion instead of leek; canned tomatoes instead of fresh; kidney beans instead of green or cannellini beans; and more pasta than called for. Regardless, my daughter and I really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mikezcookin"
},
"reviewBody": "Good, but as said many times before, lacking.\n\nHardly \"classic\" as minestrone has been in Italy since Roman times, and everybody knows Romans didn't have tomatoes. Decent modern recipe, though..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "peruviana"
},
"reviewBody": "This is a good base for Minestrone but if someone wants a more substantial soup, try making it with beef broth using oxtails. I use a pressure cooker to cook the oxtails in water, with some chopped onions, salt and pepper. Then you can proceed as in the recipe, except I add cabbage and instead of thyme, I season it with a tablespoon or more of pesto. The oxtails will be very tender, so you can have them with your soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Rudd"
},
"reviewBody": "I have not made this yet, but a word about minestrone: Marcella Hazen sautes onions, carrots, celery, green beans, and cabbage in butter/olive oil mixture for 3 min each, consecutively, the cabbage for 6 min. I can't imagine this without cabbage. As is my family tradition, probably started by my Mom during the Depression, I use tomato juice for part of the broth, beef broth for the rest. I love it this way, but I'm sure other versions like this one are equally good. NOTE: Real minestrone is supposed to be super thick. This recipe isn't, but I like it more brothy anyway, so it suits me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annaclynch"
},
"reviewBody": "This recipe is good as a base yet spices have been left out....margoram, oregano, parsley and garlic. Other than that, it's spot on for a good minestrone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shirley Tom"
},
"reviewBody": "If you grate your own fresh parmesan cheese, save the rinds! Add them to your simmering soups for a wonderfull extra level of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "villajilla"
},
"reviewBody": "Make sure to put Parmesean cheese on it!!!\nYou can also add a bay leaf as the Italians do. Beef boullion works too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "souperdooper"
},
"reviewBody": "Have had much better soups. A great addition to minestrone which adds alot of flavor is fresh fennel. Next time I will saute fennel and garlic, skip the thyme and see if that improves the broth. I have used fennel and garlic in other minestrone recipes and love the flavor - thought I would try this per the recipe before I made changes. Too bland as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia"
},
"reviewBody": "This is a great recipe. I am adding chick peas instead of beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cls223"
},
"reviewBody": "I opted to try this but will stick with my other minestrone recipe which purports to be authentic Italian. For that, you add a potato, green cabbage (I often omit, doesn't make a difference), 2 zucchini, and you saute your veggies in stages (longest cooking first) in a 50/50 mix of butter and olive oil. Use canned tomatoes, it's fine. Also add salt, rosemany, black pepper and basil AND use beef stock/broth (unless you're vegetarian). The simmer for 1.5 hours, add the beans (no pasta) and simmer another 30-40 mins. It's a great recipe for a chilly fall day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jolley900"
},
"reviewBody": "This is def a make ahead soup. MUCH better on day 2 although very edible one day one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paintballdan"
},
"reviewBody": "Tasty, easy and healthy. All the family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erinjanice"
},
"reviewBody": "This was very tasty. Instead of beans and pasta, I used a \"minestrone mix\" which had a few types of beans and rice (had to soak 12 hours and cook 1 hour before adding to the soup). Regardless of that change, the vegetables and amounts were perfect and we thought it tasted good both right away and after a few days in the fridge. I loved how fresh it was :) I felt like I made a fancy dish, but all I did was chop up a bunch of vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "Easy to make soup. I usually leave out the leeks and add a diced onion instead. I also prefer orzo to macaroni."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "Great basic recipe you can tweak according to personal taste and what you have on hand. Personally, we prefer it with kidney beans, but cannelli beans are pretty good. I cut way back on the thyme, and usually use Italian seasoning. Fresh minced garlic and a couple of bay leaves add some nice flavor too. Thanks, Michelle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CatherineO"
},
"reviewBody": "4 stars as written, 5 with changes! Next time, I'll quadruple pasta to 1 cup, and add a little extra liquid (tomato sauce?) to make up for it. Also needs more seasoning - parsley, basil, oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovemypuppy"
},
"reviewBody": "I really love this soup! I was trying to make something vegetarian that was similar to a minestrone at my fave restaurant. This was as good. I used Italian seasoning and chickpeas instead of cannellini beans. I also used wheat pasta. It was very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RHEA1"
},
"reviewBody": "I liked the thyme in the recipe, of course thyme is one of my favorite herbs. Easy to make I also added red and orange sweet peppers and thought it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Cuadra"
},
"reviewBody": "Best one I have found so far! Very light, just how real minestrone supposed to be. To other raters who like more tomatoes or more of a thicker soup, please go ahead and modify it. But please dont say this is not good. This recipe is just perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Rachel"
},
"reviewBody": "This turned out absolutely delicious, and I am a hard one to please relative to soups. I made some minor changes to the version I created. \nRevisions:\n• 2 cloves of fresh garlic, minced added to the end of the saute (It's Italian, right?!? I mean you gotta have some garlic!!)\n• 2 cups canned tomato sauce &amp; 1 cup water with only 1 qt vegetable stock.\n• 1-1/2 tsp sugar (to compensate for the bitterness of the fresh tomatoes not being in season).\n• Substituted garbanzo beans for cannellini.\n• Used 1 tsp dried thyme in place of fresh.\n\nYUMMMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Hagerman"
},
"reviewBody": "I add garlic. I also add fresh spinach about the same time I add the beans. Use Extra carrots and zucchini and use a large can of diced tomatoes undrained. Let it sit over night and wait untill your going to serve it to do the step with the pasta and beans (and spinach)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sophiabakes"
},
"reviewBody": "This was very good, but only had a tiny bit of pasta. I will increase it next time. But overall the flavor was nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KANSASINMAINE"
},
"reviewBody": "I love this recipe. And it's versatile so that you can pretty much use whatever you have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Good! I took the advice of others and added diced potatos, garlic, oregano, &amp; bay leaf -- glad I did. I also used chicken broth because that's what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This was pretty bland as written but turned out excellent when I added more salt and pepper, some italian seasoning, basil and a dash of red pepper flakes. Took it to work for a potluck and it was a real hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tessuzie"
},
"reviewBody": "excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amelia"
},
"reviewBody": "Note: The 5 stars includes many changes. I added more veggies — more carrots, more celery, added potatoes, used canned and fresh tomatoes, a portebello mushroom and added a can of tomato paste. I used more pasta and about doubled the amount of spice, including fresh oregano and basil, not to mention four cloves of garlic. Also, with all this, I doubled the amount of broth. And let me say, yum. The basic recipe functions as an awesome base, from which you can do whatever you please. In short, it's exactly the kind of recipe I love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shelleywilsonaz"
},
"reviewBody": "Great base recipe to add your own twist. Next time I'll add potatoes to it and more noodles. I added garlic and spinach like a few reviews suggested, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "This recipe was so good and easy. The only changes we made was we added garlic to the olive oil in the begining before adding the veggies. We added frozen corn when we added the tomatoes. We also only used half of the vegetable stock but made up for it by adding chicken stock. This is a very healthy recipe and I plan on making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ildefonso"
},
"reviewBody": "This was excellent!! The only thing I did differently was add beef broth instead of vegetable to give it a deeper flavor. I added all my garden fresh vegetables and herbs. Yummm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zsuzsa1954"
},
"reviewBody": "This is a delicious soup! I made very little changes. I added fresh peas and used a can of chopped tomatoes with garlic and olive oil. I use a can of mixed beans ( that's all I had at home ). Everybody loved it! Made it several times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr. Gurutrang Singh Khalsa, DC"
},
"reviewBody": "Bellisimo!!! I mean really, this is very tasty, Vegetarian, subtle and hearty, just about as perfect, healthy and delicious as you can get, especially when sprinkled with real, finely grated, aged, parmesean cheese. The only 4 changes in the recipe I would recommend are; 1) Go easy on the salt for your sodium-concerned family and friends. The parmesean will more than make up for that. 2) Be sure to use fresh tomatoes on the vine and blanch and chop them for the flavor and aliveness of the food. 3) Add a few cloves of fresh, chopped garlic - yummy. 4) Consider leaving out the pasta, which my local, gourmet, Northern Italian restaurant chef says is a no-no in Northern Italy. He also says, meat or chicken is never used in classic, Tuscan minestrone, so this recipe is a perfect Vegan choice when the parmesean is omitted! Great recipe - Buongiorno! P.S. All of my vegetarian friends at the party I just served this recipe at last night raved! You should have seen them!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L B B"
},
"reviewBody": "Skipped the zucchini (don't like it); used canned tomatoes (too lazy), fresh green beans and added an onion...YUMMY, even straight from the pot. Parmesan on top = perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bambi Suits"
},
"reviewBody": "Good recipe...needs doctoring. Exchanged garbonzo beans for cannelli. Also excluded the celery and green beans. Instead added cabbage and flat parsely. I used 16. Oz of macaroni. This was way too much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dA"
},
"reviewBody": "Great recipe! I made a few changes: I added garlic and replaced the thyme with two bay leaves (removed after cooking), `1 tsp basil and 1 tsp oregano. I didn't taste it before refrigerating overnight (as per other reviewers recommendations) so I can only assume that letting it sit overnight is a MUST. I put this into 4 or 5 mason jars--each jar is a serving--and it's gone in two days. Thanks for a delicious and easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francois"
},
"reviewBody": "Thanks for this simple and delightful soup recipe! Sooooo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTOWNJULIE"
},
"reviewBody": "Everyone had seconds of this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Just made this and it was yummy. After other reviewers said it was better the next day,I can't wait for tomorrow. All I did different was to add some spinach and some fresh basil,which I have an abundance in my garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Tan"
},
"reviewBody": "It wasn't the best minestrone soup i've ever had. But I've improvise by doubling the tomato and adding some fresh herbs like basil, parsley.\nNot a 5 star recipe though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOLLE888"
},
"reviewBody": "Much more flavorful after a day in the fridge! I didn't add any additional salt because my veg. stock was very salty already. I did add some crushed garlic to the pot with the veggies. This is a delicious, fresh way to get a days serving of vegetables. My boyfriend said he would have liked more pasta in the soup, in which case I would increase the veg. stock (and for those of you mathmatically challanged, like myself, 1.5 quarts is equivalent to 48 ounces of stock)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Carey-Bradley"
},
"reviewBody": "I'd give this more stars if I could. I've done this any number of ways, plus exactly as the recipe states. One comment that I didn't see from others is to add a dash of hot pepper sauce to the broth, adds just a little extra kick that my family loves. You can use just about ANY veggies that you have on hand, I also add some diced cabbage, great! Thanks for the super recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne O"
},
"reviewBody": "Excellent! I quadrupled the recipe for a dinner party so I used a combination of cannelini, dark and light kidney beans, because that's what I had on hand. I made it the night before, let it sit in the fridge, and reheated it for dinner. I think it really helped the flavor set in all the vegetables. My friends still compliment me on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Treeskitchen"
},
"reviewBody": "I didn't have a leek so I used an onion and also used chicken broth instead of veg. Thought it had a nice fresh taste. Simple recipe... I liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke"
},
"reviewBody": "DON'T EAT TIL YOU'VE LET IT SIT OVERNIGHT! That's my best advice for this soup. After I made it the first day, it didn't even smell good. Second day I would've given it 4 stars, by day 3 I'm giving it 5 stars (but since that's a little long to wait to eat, I'll stick to the 4 stars). \nI'm a picky eater: don't like cooked carrots, don't like many tomatoes, and don't get enough vegetables or beans. But stick em in this soup and I'll eat them all! My two year old will too! \nI didn't like how long it took to make, but I'll pay the price to eat this again. \nAlso, I added another can of beans (turned out to be too many), put in about a cup of pasta with extra liquid (good amt of both), and put in italian seasoning. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jasmine Couillard"
},
"reviewBody": "This was a good basic recipe. I did not use leek as the grocery store didn't have any. I also used dried thyme. Otherwise I followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jasmine "
},
"reviewBody": "This was a good basic recipe. I did not use leek as the grocery store didn't have any. I also used dried thyme. Otherwise I followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lanem1972"
},
"reviewBody": "Read the reviews and added more canned tomatoes as well as garlic. Yummy! Will make it again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13163/classic-minestrone/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17038/soups-stews-and-chili/soup/vegetable-soup/minestrone/",
"name": "Minestrone"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13163/classic-minestrone/",
"name": "Classic Minestrone"
}
}
]
}
}
, "about": [
]
}
]