				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coal Miners Pasties"
,"datePublished": "1998-05-06T07:42:48.000-04:00"
,"dateModified": "2022-07-14T17:08:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kevin Ryan"
,"url": "https://www.allrecipes.com/cook/24325175"
}
]
,"description": "Homemade pasties filled with a savory combination of steak, potatoes, turnips, and onions. Perfectly portable for picnics or serve warm for a simple supper."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3tfh3xjlWfsqzJKAx_bgSuRkHBE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21349-3a7efdd3f8e54a5f81f9e3a2655f24b7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coal Miners Pasties"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "47"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "1186 kcal"
,"carbohydrateContent": "99 g"
,"cholesterolContent": "141 mg"
,"fiberContent": "7 g"
,"proteinContent": "45 g"
,"saturatedFatContent": "26 g"
,"sodiumContent": "2203 mg"
,"sugarContent": "6 g"
,"fatContent": "67 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 cups all-purpose flour",
"2 teaspoons salt",
"1.5 cups lard",
"10 tablespoons ice water",
"2 pounds top round steak, cut into 1/4 inch cubes",
"5 red potatoes, peeled and chopped",
"3 turnips, peeled and cubed",
"1.5 cups chopped onion",
"1 teaspoon freshly ground black pepper",
"1 tablespoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place flour, 2 teaspoons salt, and lard in a bowl. Quickly rub lard into flour with your fingertips until it resembles small peas. Pour in ice water and form into a ball. Add more water if it feels too dry. Divide dough into 6 balls; wrap in plastic and chill for one hour."
} ,{
"@type": "HowToStep"
,"text": "In a bowl, combine steak, turnips, potatoes, onions, remaining 1 tablespoon salt, and pepper."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll out one ball of dough on a floured surface to about 1/4 inch thick. Using a cake pan, trace a 9-inch circle in dough; cut out the circle. Place about 1 1/2 cups of steak mixture into middle of the circle. Fold edges of the circle up to meet along the top of filling; crimp dough along the top to seal. Repeat until dough is used up. Use a spatula to transfer pasties to an ungreased baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake pasties in the preheated oven for 45 minutes, or until golden. Serve hot or at room temperature."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "chihuahuabulldog"
},
"reviewBody": "The information at the first says savory on one end and sweet on the other. What happened to the sweet?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad William Harden"
},
"reviewBody": "This was a great recipe and a new favorite! Actually I was trying to find a recipe for a \"Cornish Pasty\" after seeing this on the Andy Griffith show, where an English guest makes these \"with afters\" ( or \"double-ended\") - meat and potatoes on one side and plum pudding on the other! We used this recipe and I used diced apples and pears with blueberry filling on the dessert side. I also added garlic on the savory side, and substituted butter for lard in the pastry. Make sure you put in a wall or shield of dough between the two sides, which I found suggested after some research on the English version. I ended up learning a lot about Cornish Pasties and Coal Minors Pasties!\n\nIt seems the debut on the Andy Griffith Show made quite a stir in England among bakers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "OwlCityEyes"
},
"reviewBody": "This recipe sucked. The dough completely failed at being dough. I followed every step, did everything correctly, and then when I went to roll out the dough, it fell apart. It was impossible to fold the dough over the meat filling, so we kinda squished it around the meat, and there were tons of holes all over. \nThen we tried to eat it. It tasted horrible. The crust was so horrible and dry that I just took it off and tried to eat the meat, potatoes, ect. I ate less than half of one before giving it to the dog to try. She ate it, but I could tell she didnt really want to. My mom even got sick. I followed the recipe and did everything the way it said to. :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisa Kilthau"
},
"reviewBody": "Perfect.... great crust... freezes very well.... but browned my meat first"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colton Mehlhoff"
},
"reviewBody": "I used cream corn in mine to make it creamy. Delicious. I wrapped them almost fully in foil. I cooked it at 300 for an hour and a half. Then opened up to foil and cooked at 400 for 20 minutes to darken the crust. Steak was super tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dia"
},
"reviewBody": "I am very popular in my family for this recipe. Thank you. Now my bucket list is to go visit Cornwall &amp; snack on a pasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "midwestern gal"
},
"reviewBody": "This looks very good. A real cornish pastie had the dessert on the back end of the pastry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Coastal Lady"
},
"reviewBody": "I'm from Northeastern PA..Coal country..we make these all the time for church fundraisers. Ground Beef, white potatoes, onions and served with Brown gravy. You can save tons of time at home by using pre-made pie crust. Layer Potatoes, meat then oniion seasoning with salt and pepper and some allspice as you go. NO NEED TO COOK ANYTHING BEFORE..bake hour or so in 375 oven...pour gravy over and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maggserroni"
},
"reviewBody": "Very good. Easy to make. I made it for my parents and my sister and they enjoyed it very much. I added just a hint of garlic powder and it was good. It smelled terrific and made mouths water as they came out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chloe5"
},
"reviewBody": "The only thing I did different was to eat this meal with a bit of ketchup. Fabulous recipe.\nThank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "The King's kid"
},
"reviewBody": "I'm rating my changes, not the original recipe. On paper recipe looked good, but found I didn't have turnips so used what I had on hand. I used frozen onions and fried them down to take the twange out. In place of turnips, I used 3/4 a small bag of \"stir-fry veggies w/rice\" and white potatoes in place of red. Reds have a better flavor. In place of round steak, I used 5 veggie meatballs I froze last year (this was a big mistake, as it made the recipe taste unusual). The pasties are huge, bigger than I had stomach for. I used 2 cookie sheets (3 on each). When all was in oven, I thought baking at 400 degrees would burn the dough but it did not. Actually, I added 5 minutes to the 45-minute baking time to get a golden color. The pastry was a little bland for me (I got spoiled making sugar-crusted appled pie from this site), yet it was flaky and didn't fall apart. Next time I make this recipe I'll be sure to use turnips. I may add a little sugar (for taste) to the dough. Thanks for sharing your recipe, Kevin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenice"
},
"reviewBody": "This is a great crust but the inside is pretty dry, I even made gravy from the steak that I browned and added it to the mixture and it was still to dry. Next time I will use a different meat and have gravy on the table as well and like someone else said, it has a lot of left over potatoes and turnip mixture, that is true, I guess you should use the tiny red potatoes and small turnips. This is a great recipe to try different fillings with. Oh yes and also, the next day the crust is still nice and flaky even after heating up in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kylie"
},
"reviewBody": "The meat was very good, but the crust was dry and crumbly. There were far too many potatoes and it was overall very bland. I think it could be better with a different crust and more seasoning. It was a good concept but I was not impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Story"
},
"reviewBody": "Pasties has been a staple in my husband's (Southern) family for decades. It has become our Christmas Eve dinner tradition for several years now. We don't add the turnips but would not be opposed to it. We do however add \"several\" (the more the better) pats of butter with the meat etc. It makes it nice &amp; juicy &amp; makes the meat more tender. My husband is the pastie maker &amp; it's wonderful. We always serve Mrs. Renfrow's Chow Chow with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary King"
},
"reviewBody": "my grandmother made these pasties back in the early 1920's. they grew there own veggies and meat so she was not out much. i remember her telling me about her making these and selling them to men that were working on FDR's reconstruction project here in alabama. i am so glad that you came up with is recipe because if have lost her original recipe she gave me. grandmother was the one who taught me to cook beginning when i was three and old enough to stand on a chair and stir ingredients in a bowl. i guess many of the older ladies can tell stories just like mine. i know when i was in high school and my sewing and cooking teacher was in awe because i already knew how to sew and cook. i hope you put more recipes from the 1920's and 1930's online so we can review and see if we can make them more healthy for todays lifestyle. mary king marob_532, ashville alabama"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debster"
},
"reviewBody": "I used to live in SD and would get pasties at King's Grocery across from the Homestake gold mine in Lead. This recipe is the closest I have ever made to their recipe. Wonderful! For breakfast try adding scrambled eggs, crumbled bacon and hash browns. I will be making these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BDennis"
},
"reviewBody": "This has always been a favorite. Although I make it with ground beef and it is never dry. I also didn't use turnips, just ground beef, onion and chopped/sliced potatoes. Since I had a big family I made it often in a pie plate. After slices were cut some topped it with gravy, chili sauce or ketchup. I alsways liked my plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sister-woman"
},
"reviewBody": "My family is from the anthracite coal region of Pennsylvania, and my grandmother would make them for us. She came from such a large family that they used hamburger instead of steak and my great-grandmother made them in the form of a pie rather that the traditional folded-over version. Regardless, they are WONDERFUL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Helen Halia Hanowsky Feeney"
},
"reviewBody": "delicious filling. i added sautéed onion and garlic. Pastry was a disaster. Too flaky. barely held together and had a funny taste. I grew up on pie crust with butter or vegetable shortening and it is much easier to work with.i will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweets"
},
"reviewBody": "These are excellent. I was born and raised in northern Wisconsin and my dad worked in northern Michigan for 10 years so we are very familiar with pasties. I make mine with ground chuck, carrots, onions, red potatoes, and rutabega. I also use the refrigerated Pillsbury pie crust (not the frozen Pet-Ritz kind) which makes them quick and easy to make and they still taste great. Now living in Texas with my Texas-born husband, he insists I add chili power and cumin to the filling. So nontraditional, but it's still good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "Everyone in the family loved this recipe, which is VERY rare. I made the following changes: Parsnips instead of turnips (what I had on hand). Fresh ground garlic pepper instead of regular fresh ground pepper. No added salt in the filling; it was salty enough with just the salt from the pastry and the garlic pepper - I couldn't imagine a whole extra tablespoon. I also chopped in some scallions and fresh parsley from the garden. I had quite a bit of extra filling and just baked that in a covered pan for leftovers. I agree with another reviewer that this makes a lot - only someone with a very hearty appetite could eat a whole one. Rave reviews all around the table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kayleigh"
},
"reviewBody": "I thought these had a lot to them but they were kind of bland without something to dip them in. Next time i think I will add more seasoning and more veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica Sablan"
},
"reviewBody": "This is an awesome recipe. Best served with gravy, melted cheese &amp; sour cream. This will be a regular item on my menu. However I think the dough has a better taste if you subsitute the lard with butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joyce"
},
"reviewBody": "Grew up on my mom's pasties. We use Round Steak &amp; Pork shoulder. Carrots, Ohion, Potato. Always eat them with ketchup. I'm not so good at the pastry but found that Pillsbury Pie Crust-in the red box is exactly the same taste as mom's crust. Always moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROG"
},
"reviewBody": "As a Minnesota Iron Ranger raised on Cornish pasties I note that the reason these are too dry is the lack of tiny pieces of salt pork in the mix. And only rutabegas are authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon H"
},
"reviewBody": "This was my first attempt to make pasties. My husband is used to the Upper MI Finnish pasties and this one was pretty close. I used shortening for the crust instead of lard since I had it on hand and it made the crust a little too dry. I also used rutabaga instead of turnips and it added a great flavor. The meat was probably too lean so be careful what cut you buy. Next time I will add carrots which most UP MI ones have. Overall I was very pleased with my first attempt. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MikeyB"
},
"reviewBody": "This is my favorite dish! I made it when I was in the military and it was an instant success with everyone. They last forever and taste great at room temp. The juices stay where they are and the pastie shell is the perfict blend of flavors to mix with the vege meat mix. I ate 3 of them when I made it the 1st time :-) I just couldnt stop. All in all a definate Yum Yum dish thats perfict for lunches and hiking trips and camping due to the fact it doesnt need to be heated to taste good. Just keep the shell from breaking and letting the juices out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jester"
},
"reviewBody": "Fantastic .. will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenoffun"
},
"reviewBody": "This recipe came out great! Cooked perfectly; very nice flakey crust with a beautifully moist meat/vegetable interior. Only compliant is there was a lot of leftover veggies. Next time I'll only use 3 potatoes, 1 large turnip and 1 onion. See Time Life American Cooking: Eastern Heartland cookbook, which has photos on how to assemble."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chef Hans"
},
"reviewBody": "These are good, it just seems like the dough should be different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TARENWALTERS"
},
"reviewBody": "Excellent, We love this recipe, it's simple and good tasting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "nice recipe although a little too dry. Top round is the wrong cut here - you want a cheap fatty cut which will help the moisture level.\r\n\r\nPuff pastry as one reviewer suggests is not at all authentic. Although of course if you like it, by all means.\r\n\r\nYTou can get authentic pasties around the old Cornish mining towns in Southwest Wisconsin (around Cassville)...good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "NB: A word to the wise - if you are visiting England, and want to experience a really decent Cornish pastie (this recipe barely hints at the gastronomic delights you can encounter there), you MUST get a pastie at Stein's deli, Padstowe (they are a tad spendy but they really are worth it), or Pronto Pastie, almost any place in the West Country. Also, for the most delightful cream teas and scones (scones are like biscuits but they come with clotted cream and strawberry jam) visit any of the tea shops at Boscastle - a pot of tea for 2 plus 2 fist-sized scones and jam and cream will set you back about $6! Boscastle is a truly beautiful, breath-taking fishing village, and you won't be disappointed!) ANYWAY, the pasties in this recipe were alright. I have eaten enough Cornish pasties in Cornwall to know a good one when I see it (or taste a good one when I taste it??), and this wasn't it really. The pastry was ok, though I much prefer a puff-pastry shell. The innards were dry and pretty tasteless, despite the fact I added A LOT of freshly-ground pepper, which is how traditional pasties are supposed to be... I suspect that good Cornish pasties can only be found it Cornwall...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkaeekj"
},
"reviewBody": "This recipie was pretty good and enjoyed by the family, however, I would recommened that you make up some beef gravy or other sauce to go with it. By itself it is tasty, but a little plain. Also, this recipie makes A LOT, as the pasties are very large. One pastie could feed 2 people, especially kids. I browned my beef first just to form a slight crust on the beef, and I also added about a tablespoon of flour to the beef mixture before baking to thicken up the juices a bit. Next time I'd try addind garlic powder to the beef to see if that makes it a little more flavorful. Thanks for the recipie, Kevin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are close to the pasties I grew up\r\nwith... My mother always just made \r\nregular pie pastry and used rutabega\r\ninstead of turnip and white pepper...\r\n\r\nThey are great hot, warm, cold or fried \r\n(if there are any leftovers)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "smothered in rich beef gravy GREAT!!!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12164/coal-miners-pasties/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
"name": "Savory Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15328/main-dish/savory-pies/pasties/",
"name": "Pasty Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12164/coal-miners-pasties/",
"name": "Coal Miners Pasties"
}
}
]
}
}
, "about": [
]
}
]