				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coconut Ice Cream"
,"datePublished": "2003-02-24T10:27:00.000-05:00"
,"dateModified": "2022-09-05T15:16:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SUEMB"
,"url": "https://www.allrecipes.com/cook/789264"
}
]
,"description": "This coconut ice cream is made with just 4 ingredients, including sweet cream of coconut, for an easy frozen dessert of super creamy eggless gelato."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/twRCGq6pMOWb1h7mdLgUGFNxPFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/679106-55a505f3926941cd9e473dba6899743a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coconut Ice Cream"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "357"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "407 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "64 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "22 g"
,"sodiumContent": "87 mg"
,"sugarContent": "32 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (14 ounce) can cream of coconut",
"1 cup milk",
"1.5 cups heavy cream",
"1.5 cups sweetened flaked coconut" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine cream of coconut and milk in a food processor or blender; mix thoroughly. Stir in cream and flaked coconut until combined."
} ,{
"@type": "HowToStep"
,"text": "Pour into the container of an ice cream maker; freeze according to the manufacturer&#39;s instructions. Store covered in the freezer."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is simply the best coconut ice cream I've ever had. I've made it for Christmas Eve family dinners for lots of years and am always asked to make it again. Love it. (It makes a nice little gift, too.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Oh my God. This was incredible. So simple too :) The cream of coconut was room temp, and I let the cream and milk stand out of the fridge for a half hour beforehand unintentionally. This accidentally increased the length of time the ice cream needed to run in the maker. This is the best ice cream texture and taste wise I've ever had. Soo light, yet rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used coconut cream, found it lacking in sweetness, not sure what wrong, but needs sugar in my opinion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This ice cream is so delicious and easy to make I'm embarrassed to tell friends how I made it. Instead of having a harsh, made-in-a-lab flavor that smells like suntan lotion, this coconut flavor is mild and delicate. I usually serve it with Kahlua or Tia Maria drizzled over the top, but chocolate syrup will definitely work too. I love coconut flavor but I'm not always crazy about the texture. Chopped pecans on top are a nice alternative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ehocevar"
},
"reviewBody": "This says one can and not how much cream. Also huge missing piece here is to BLEND the cream of coconut before using. Ended up having small fatty bits of coconut that made the texture weird. Recommend using vanilla to cut through any weird nutty flavor. Probably won’t approach coconut flavor in ice cream this way again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg"
},
"reviewBody": "Added the rest of the bag of coconut (1/2 cup). Everybody thought it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Davies"
},
"reviewBody": "I used half and half in place of milk. I only had unsweetened coconut cream so I added 3/4 can of sweetened condensed milk. It turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Cohen"
},
"reviewBody": "You need to keep in mind the capacity of your ice cream machine. 1/4 cup of flakes is sufficient. Otherwise ice cream is too coarse. Toast 1/3 cup of hazelnuts, cool them, and add during last five minutes of processing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamra Helquist Cordasco"
},
"reviewBody": "I made this but I added 3/4 cup of sugar and it seemed to blend better!!! Was SO yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katiea1"
},
"reviewBody": "OMGoodness! My new favorite flavor of ice cream! Super easy recipe. I followed the suggestion in one of the other reviews and added the coconut flakes to the milk mixture and blended it really well before adding the heavy whipping cream. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trg"
},
"reviewBody": "The bomb! The whole family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michael Tamburello"
},
"reviewBody": "Too much coconut cream is the problem I have with this recipe. The finished product can't freeze like ice cream normally does. The end product was too sweet and gummy. We thawed the product, removed a third of it, and mixed in heavy cream, a kiss of vanilla and sugar, which improved it greatly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Paul"
},
"reviewBody": "I give it a thumbs up. I made according to the directions and was very sweet. and creamy . The coconut flakes added a nice texture to it. The second time I made it I added some raspberries and also was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nela"
},
"reviewBody": "We LOVE this ice cream, make it all the time - huge hit but sinful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angela Duren"
},
"reviewBody": "this recipe would not fit in our brevel ice cream maker, so we reduced the cream and despite this and using sweetened coconut, it wasn't sweet enough. we aren't typically sweet lovers so I was really surprised. we used Kroger simple truth canned sweetened coconut milk, maybe it was the brand"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Brinkley"
},
"reviewBody": "I didn't change a thing, and it was delicious!! I shared some with my neighbor who said it was \"heaven!\" She said it was even better than Baskin-Robbins' Nutty Coconut, which has always been her favorite. I'm getting ready to make my second batch this weekend, so I'll take a picture to post."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Taylor"
},
"reviewBody": "My hubby said he would have married me right away if he knew I could make this. It is THAT good. I could never get it to thicken in my Kitchenaid Ice Cream Maker, but it does freeze in the freezer (and quite solid at that! You may need to let it in thaw for a bit first...or just eat it slowly...or put some in the microwave for a few seconds). To make this even more decadent, I cut up an entire milk chocolate Lindt bar and toast about 1/2C (maybe more?) slivered blanched almonds and throw them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kym Heiser"
},
"reviewBody": "If you follow the recipe you will make a deliciously creamy ice cream. I made this recipe in my breville ice cream maker and it was outstanding. I took the advice of another reviewer and actually blended my coconut pieces in with all the ingredients and it came out great. The ice cream is great on its own, or you can make tasty ice cream sandwiches with it. I used an oatmeal raisin cookie with mine, but the combinations could be endless depending on your creativity and taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Dose"
},
"reviewBody": "This was the hit of the summer. I do not put coconut shavings in the ice cream though. We prefer toasted coconut on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is the easiest ice cream recipe I've tried so far, so simple and it comes out great. I threw everything all at once into the blender and gave it a whirl. This is not creamy because of the shredded coconut but just top it with a hot fudge sauce and it's just like a frozen mounds bar. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "This is by far the best coconut ice cream I’ve had Ben &amp; Jerry’s coconut almond chip, RIP, and when I was a little girl, Baskin Robbins coconut chip (nobody I know remembers that they had one, I don’t get it. If you love coconut like I ALWAYS have, one would remember that delicious ice cream, yet people think I’m bonkers). The only thing I did was add chocolate chunks. Unbelievable!! Made it soooooo many times, as I LOVE coconut. Thick, rich, and creamy. Better than anything you could buy, and I know, I’ve tried them all. But also, nothing takes the place of homemade ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aleah"
},
"reviewBody": "This was so amazing! loved it! we didn't use the coconut flacks but everything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hildamae"
},
"reviewBody": "I love the subtle flavor of coconut in this ice cream. The flavor is delicate and not like the sickly sweet mess you purchase from a manufacturer.\n\nNote: I consider the shredded coconut a necessity and not an \"option\". I made this recipe with the shredded coconut and cannot imagine this ice cream without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blake Chef Simka"
},
"reviewBody": "I multiplied this recipe by eight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "French epic"
},
"reviewBody": "I couldn’t find a sweetened coconut cream so I bought the unsweetened so I had some sugar maybe not enough but it was still good! The flakes of coconut are a must to make your ice cream more authentic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol taylor"
},
"reviewBody": "Love this ice cream!! This is my second time, this time I left out the coconut because we like it smooth. Super ice cream to make when you don’t have time to cook &amp; cool a traditional custard ice cream. We added a teaspoon of coconut extract to up the coconut flavor. We sprinkle it with coconut when we serve. Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knich"
},
"reviewBody": "Terrific!! I used toasted unsweetened shredded coconut . Served ice cream with a wonderful hot fudge sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lauren Banks"
},
"reviewBody": "It just tasted like heavy cream to me and I added tons of toasted coconut flakes to the top. It was a disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayla"
},
"reviewBody": "Absolutely delicious. I really didn't expect it to be good since there are no eggs or sugar. Believe me it is perfectly creamy and sweet. I did put the coconut in blender first as others mentioned.\n\nI made a second time without the heavy cream since my Granddaughter can not have dairy. I just used another can of coconut cream. It was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sunny S"
},
"reviewBody": "The way it is described here, just blend and stir everything together didn’t work with our ice cream maker, I tried two times but both times the liquid got stuck to the walls of ice cream maker &amp; the blade and didn’t let it to turn ... unsuccessful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I made the recipe as stated. It. Was bland. Next time I will cut down the coconut to 1cup and add 1/4-1/2 cup of sugar. A little rum extract (so freezing isn't an issue) would be awesome for a little more flavor. I will try again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Gaylord"
},
"reviewBody": "This is a nice simple recipe that tastes great. It's creamy and sweet. I absolutely love coconut, but the full cup and a half of shredded coconut gives it too much texture. Next time I'll probably only add half of that. Flavor is perfect though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Ripley"
},
"reviewBody": "My husband loves this ice cream, it's better than what you can buy at the grocery store. The only change I made was to reduce the amount of coconut to 1 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "follychic"
},
"reviewBody": "First time I made cream in my KitchenAid Mixer Ice Cream Attachment. My son-in-law said it was \"The Bomb!\"...what's better than that....nothing! Daughter and husband loved it too. Follow the recipe as is for great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it like it said to. It is easy, quick and really yummy! I'm making it again today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle McWhorter Winningham"
},
"reviewBody": "I couldn't find the cream of coconut so I followed another user's suggestion and used 14 oz sweetened condensed milk and 1 1/2 t. coconut extract. It was the best coconut ice cream I have ever had. I will try it next time with the coconut flakes. I didn't use them this time because a person in our group doesn't like the flakes only the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alchemistoftaste"
},
"reviewBody": "I added 4 tbsp maple syrup \nIt needs something to make it creamer because it freezes hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "themomwrites"
},
"reviewBody": "Amazing!! Made it with dessicated coconut since that's what I had on hand and it was super tasty, froze well and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colette Tapp"
},
"reviewBody": "Tastes great but I would highly recommend letting the mixture chill overnight to get to proper temp before attempting to put in your ice cream maker. Churned for 25 mins and still didn't want to even come close to soft serve. Had to stop since I didn't want butter with all the heavy cream. Hope it sets up harder in the freezer ! It really tastes great tho !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lety"
},
"reviewBody": "It was too sweet for me so I added more milk and aside from the cream of coconut I also added coconut milk , coconut meat strings, chocolate sprinkles, and sliced almonds while on the ice cream maker machine. Turned out so delicious! I'll be making it again with the changes in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CandyBlue"
},
"reviewBody": "I doubled the recipe, because I love coconut ice cream. I used Coco Lopez brand cream of coconut which I found in the alcoholic beverage section of the grocery store. I didn't see 14 oz cans, so I used 15 oz cans and the end result was not overly sweet. It was perfect. I omitted the coconut flakes because my son doesn't like chewing on coconut. I think it's the dry texture of the coconut that he doesn't like. Because of this he says he doesn't like coconut, but I am determined to give him a positive coconut flavor experience! I love the combination of pineapple with my coconut flavor, so I also did the following: In a small sauce pan, over medium heat, I dumped two 8oz cans of crushed pineapple with their juice. I used two, because I doubled the recipe. I added 2 tablespoons of sugar (one per can, if not doubling recipe) and 1 teaspoon of cornstarch (half a tsp if not doubling). I reduced it a bit, stirring frequently, till a (chunky) syrup consistency. Then I put this pineapple mixture in a plastic dish, in the refrigerator, uncovered until cool to the touch. I added this to the ice cream maker about half way through the churning process, just to incorporate. (If you use a can of crushed pineapple and drain it and add that to the ice cream, you may get icy bits or crystallization of the pineapple juices, and it can be an unpleasant texture in your otherwise creamy coconut ice cream. The cornstarch adds a type of jelly-ness that will freeze much nicer and will"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kamaran Gay"
},
"reviewBody": "Just amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bird Lover"
},
"reviewBody": "Didn't have heavy cream so used half &amp; half and added 1 whole vanilla bean, scraping the seeds into the mixture for more flavor. It was very good but I felt a bit on the sweet side, perhaps because I didn't use heavy cream? I'll definitely make this again but will use unsweetened coconut to cut back on the too sweet flavor and will use half &amp; half again to cut back on the fat content &amp; calories. As another reviewer suggested I added the shredded coconut to the blender to chop it up into smaller pieces. One additional change I plan to make next time is to reduce the amount of shredded coconut by at least half as I thought 1-1/2 cups was too much and took away some from the creamy texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DiannaKM"
},
"reviewBody": "Very delicious! I used SWEETENED Cream of Coconut. \nI also added 1/2 tsp of Vanilla Powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaquelynny"
},
"reviewBody": "I made this for my mom and sister- instead of milk I used half-and-half and it came out awesome thanks for the recipe! I served with choc chips and chopped almonds and homemade whipped cream. Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Davis"
},
"reviewBody": "The ice cream is delicious and the recipe is simple. My wife couldn't stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Macier Crawford"
},
"reviewBody": "I was lucky enough to have the ingredients on-hand and absolutely loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janitplanet"
},
"reviewBody": "That just hit the spot. I'm pregnant and was absolutely craving coconut ice cream. I didn't even have cream or flakes, but I didn't care. I was desperate. I used whole milk and a little evaporated milk. As for the coconut part - I had a can of unsweetened coconut cream from Trader Joe's. If you're not sure which you have, just look the ingredients list. I was glad mine was unsweetened because I could control the sweetness and type of sweetener. I added 1/4 cup plus about 1 T. honey, and for me it was the perfect sweetness. I felt I could indulge more since I wasn't using refined sugar, and it wasn't overly sweet. Next time I'll try it with the cream, and I'm sure it will be richer and even more delicious. I imagine I'll make it over and over again for the next 6 months, and my baby might be a coconut fan like me. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry James Hubick"
},
"reviewBody": "Made this ice cream. I could not get Cream of Coconut so used coconut milk instead and sweetened with 1/2 cup of icing sugar and a teas of vanilla ( I use pure valnile from Mexico only) . Lets just say I licked the beaters of the ice cream maker clean. Will definitely make this often. It's nice knowing what goes into the food you eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bj1"
},
"reviewBody": "Great recipe. Simple ingredients and sooooo easy to make. I had only unsweetened coconut and the ice cream turned out plenty sweet. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Thornton"
},
"reviewBody": "This ice cream was so delicious! I ground up some semi sweet chocolate chunks and added it at the end which made it taste like mounds bar ice cream. Next time I will add some almonds and call it Almond Joy ice cream! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pizzadog"
},
"reviewBody": "I followed the recipe exactly, including the sweetened coconut but it still wasn't sweet enough. It had no body, wasn't creamy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linde"
},
"reviewBody": "Made the recipe exactly as posted. Ground the coconut too. It was really bland. Quite surprised since I was expecting to like it. I used Coco Lopez. I'll pass it off as vanilla!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bonchef"
},
"reviewBody": "didnt have cream of coconut so used coconut milk instead. \n\nused .5 cup sugar + 1 cup unsweetened coconut flakes\n\ndelicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Nguyen"
},
"reviewBody": "For those who can't find sweetened coconut cream, use coffee mates coconut creme!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Johnson"
},
"reviewBody": "Really good stuff. The first time I made this had a big mistake - used Trader Joe's Coconut Cream, which is thick and creamy but not sweet, so after tasting while mixing, did a rush fix by adding agave syrup which wasn't cold. That seemed to throw off my Kitchen Aid enough that it didn't set up well until after @2-3 hours of freezer time. I also added store-bought toasted coconut flakes about 15 minutes into the stirring process. The ice cream was great tasting (We liked the toasted coconut in the texture) despite the near miss of using Coconut Cream rather than Cream of Coconut, such as Coco Lopez. Have followed directions with the right stuff since then and it is a fun flavor change from vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria Shelby"
},
"reviewBody": "Read the reviews so made a few modifications. Added touch vanilla extract, pinch salt and ground up coconut in food processor. All these suggestions are right on target. I also used a stick blender to incorporate ingredients as well as whip in some air to the mix. I used Coco Lopez and thought it was a bit too sweet. Good but sweet for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tbwaz"
},
"reviewBody": "This is our all time favorite ice cream that we've made for several years. We've made it with different add-ins and our favorite has become the one we where we use frozen coconut and 1/2 cup chopped macadamia nuts added to the mix after blending the liquids. We get rave reviews anytime this one is served!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisha D."
},
"reviewBody": "Although I omitted the flaked coconut, this ice cream turned out amazing. For convenience while having a cookout, I prepared the ingredients about three hours early. I used my Kitchen Aid mixer to combine, poured into my ice cream maker bowl and refrigerated until we were almost ready for dessert. 30 minutes later, we had homemade coconut ice cream. I served with homemade blueberry pie and my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Christians"
},
"reviewBody": "I used coconut milk instead of cow milk and half and half instead of heavy cream. Watching calories. Worked out great! I, too, recommend tossing the shredded coconut into the food processor for a smoother ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeri"
},
"reviewBody": "This was the first ice cream I made in the new kitchenaid attachment and we enjoyed it. We didn't add coconut into the batter but I liked it with a drizzle of chocolate syrup and plenty of toasted coconut on top. With mine the batter needs to chill (in the freezer for a half hour to an hour) before you put it in the ice cream maker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anmullins"
},
"reviewBody": "UPDATE: I made this recipe for the second time and it was flavorless. Really disappointing. I realize that it matters what kind of Coconut Cream you use. DO NOT use the Trader Joe's version -- this is bland as all heck. Taste the cream and make sure it is sweet before you make this recipe. I think last time I just went to a store that mostly sold south american products and it came out great! \n\nOLD REVIEW:\nThis recipe is amazing! Anyone who is complaining about it, probably didn't follow the directions and used coconut milk or water instead of cream. Use coconut cream! And definitely put in the flaked coconut (found in any supermarket next to the chocolate chips!). I was truly surprised at how creamy this ice cream came out without cooking it like a custard. I was also surprised at how sweet and delicious it came out without adding any sugar. Plus, it is so easy. I'm going to make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine James"
},
"reviewBody": "I used Coco Real brand cream of coconut in a white squeeze bottle, got it in the liquor section, with the mixers. It's thick and sweet...if it's not, you have the wrong coconut product. However, mine came in a 21 ounce bottle, so I had to guess how much to use. I added about 1 1/3 cups and the ice cream was just a little bit on the sweet side, that combined with the addition of Baker's sweetened angel flake coconut. (I put about 1 cup coconut in Ninja/food processor and buzzed it to about half size to lessen final chewiness). Next time I'll go with 1 cup cream of coconut and a teaspoon of coconut extract and see how it turns out. I also stirred 1/2 cup each of chopped pecans, walnuts and sliced almonds at the end, they gave a nice crunch and helped offset the sweetness, which was not overpowering, just a tad too sweet. It tasted like Baskin Robbins Nutty Coconut. A flavor explosion in your mouth, my husband said. For those who said it didn't turn out, you did used the wrong ingredients, please don't slam a good recipe by giving it one star because you changed ingredients. The recipe does not use sugar because the cream of coconut is sweet enough. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Bungay"
},
"reviewBody": "I love this recipe - no cooking and super easy! First, chill all the liquid ingredients - it helps the ice cream set up. Next, put the coconut flakes (I used 1 cup of unsweetened) in the blender and blend until the coconut is the texture of corn meal - do this so your ice cream isn't chewy. Add the liquid ingredients. Chilled cream of coconut will separate and solidify so don't be surprised. Also, I used 2 cups of heavy cream rather than just 1.5 cups. This made the ice cream smoother. Blend it all together, transfer to your ice cream maker, and voila! Perfect coconut ice cream. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "We love this! We added in some crushed drained pineapple! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hamstar55"
},
"reviewBody": "Super easy recipe and tastes really good! I bought cream of coconut from Trader Joe's and added 3/4 cup sugar. I think it could actually get away with a little bit less sugar than that. The recipe was too much for my Cuisinart ice cream maker so next time I need to reduce it a little bit. I noticed with egg-less recipes the consistency isn't as thick/firm. I am able to scoop it but it melts in your mouth very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phoov23"
},
"reviewBody": "Making this even as I write! Wanted to use up some cream that was getting old, so I used all heavy cream with the creme of coco and the coconut. Spectacular! BTW...You'll know you have the right coconut product when you open it. If it isn't very syrupy and sweet...stop! The creme of coco is just sweetened condensed milk that happens to be made with coconut. If you have any doubts you can do what someone else did. Use an equal amount of regular sweetened condensed milk with some coconut extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorn Randall"
},
"reviewBody": "I wanted a coconut cream frozen yogurt so I replaced the milk with Silk Almond Vanilla and the cream with plain Greek yogurt. Neither my coconut nor my coconut cream were sweetened so I added I/2 cup powdered sugar. Really tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Townie Ice Cream"
},
"reviewBody": "As an ice cream, it was not good. Not the rich, luscious coconut flavor I'm searching for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MINDY1315"
},
"reviewBody": "This is exactly what I was looking for.... and I can't believe how easy this recipe is to make. I was originally looking for a coconut pineapple ice cream recipe, but thought I would first look for just a coconut ice cream recipe. When I saw a couple of the reviews that mentioned adding in crushed pineapple, I decided to try it too. I made the recipe exactly as written, but right before pouring into my Cuisinart ice cream machine, I added a 20 ounce can of crushed pineapple (I bought the kind in juice, not syrup) . But first I used my wire mesh strainer to drain the pineapple juice off the pineapple, and I pressed the pineapple gently to make sure it wasn't too wet before I added it to the creamy coconut mixture. I didn't want the extra liquid to ruin the recipe results. I turned on the machine and poured in all but a cup of the mixture. The pineapple adds volume so I was afraid it may overflow if I poured all of it in. After about 20 minutes it was thickened nicely. I put it into a quart ice cream carton (I bought a bunch of these online - they are perfect for storing your ice cream - you know the white cardboard round ones with the lids). Into the freezer it went. Of course, there was a bit left over that my husband and I divided up and ate immediately - it was every bit as delicious as the coconut pineapple ice cream we had at a fancy ice creamery in Florida!! Absolutely amazing flavor - this one does not disappoint with weak flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mona Grace"
},
"reviewBody": "I was not satisfied with the texture and flavour of this recipe the first time I made it. I had dissolved the creamed coconut in hot water (I didnt use the canned variety, but instead the boxed) and this made the ice cream more icy and flavourless. I adjusted the recipe to 1.5 cups milk; 1.5 cups half and half; 1 x 170 g box Grace Pure Creamed Coconut; .5 cup toasted coconut; dash of almond extract; dash of white vanilla extract. This made an improvement in the recipe.\n\nI still need to play with this recipe to give it more flavour and use the heavy cream to see if it will make the ice cream more creamy in texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chickie_poo"
},
"reviewBody": "Awesome coconut ice cream! The best I have ever eaten. Will make this over and over again. Perfect with no changes to the recipe at all. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gandy"
},
"reviewBody": "It was a bit sweeter than I like my ice creams. I think less cream of coconut or more heavy cream might make this better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb V."
},
"reviewBody": "This is a very good recipe. I am planning to pair it with homemade piña colada ice cream topping! Remember that there is a difference between coconut cream and cream of coconut. Cream of coconut is very sweet and used in piña coladas. Coconut cream has NO sugar just like coconut milk. I recommend tasting it first if you are not sure which you have. If it isn't sweet, then you have the wrong kind for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vira"
},
"reviewBody": "Just tried this recipe and my family loved it! I did tweak it a little because I didn't have what the recipe called for exactly. I used 2 1/2 cups half and half, cream of coconut, and scant 1/4 cup sugar, 1 cup of sweetened coconut flakes. It was smooth and creamy and tasted great with store-bought pound cake. Will keep this one handy as it's easy to put together in the morning to be ready for after dinner desert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Lynn Stevens"
},
"reviewBody": "So simple, So versatile! My first run at this recipe was also the first time I used my new electric ice cream machine. I have had trouble with a few recipes since, that were more complicated, THIS one was a (tropical) breeze. I opted to leave the flake coconut out, and blended it afterwards with coconut rum and fresh pineapple juice. Mum has a new favourite \"adult milk shake\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanieocnj"
},
"reviewBody": "Both my fiancée and I agree this was one of the best Iced Creams we have ever had. And it was so incredibly simple. Better than any store bought by far. The only thing I did different was that I toasted the sweetened coconut a little bit. It was awesome. This time I am going to add some fresh pineapple chunks. Yumm!!!!! Btw, maybe try some chocolate chips and almond slivers for a frozen/creamy Mounds candy bar. Ohhh, maybe I will try that instead of the pineapple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chillea"
},
"reviewBody": "This recipe is bomb dignity It was so simple to make and I couldn't wait for the churning process to end to taste because I didn't add any sugar. It was sweet and creamy full of coconut flavor. I don't understand why some of the reviewers said not sweet and no coconut flavor so sorry to say they are absolutely wrong. I added the mounds coconut in the food processor like one of the reviewers noted and it did made it creamy and I stirred in heavy whipping cream. Now waiting for the final process to chill will give you an update when it finishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel"
},
"reviewBody": "This was easy and delicious! I did change it a bit to used whole almond milk instead of regular milk and unsweetened coconut. I found that the cream of coconut made it sweet enough and the unsweetened organic coconut flakes are not as long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby Preece Burkowsky"
},
"reviewBody": "Absolutely heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RicCrouch"
},
"reviewBody": "This is one of my favorite ice cream recipes. The flavor is perfect, the texture is the smoothest I've ever had, and it is so unique that it catches people by surprise! I top with crushed coconut and it is far better than a certain name-brand version of Pineapple Coconut ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robinnnnnn93"
},
"reviewBody": "so simply delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TammyRandy Velasquez"
},
"reviewBody": "This is the perfect coconut ice cream recipe. We loved it! I added toasted, flaked coconut and an 8oz bar of bittersweet chocolate, chopped, during the last 2 minutes of freezing. Fantastic!\nTammy V."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella Kupkake"
},
"reviewBody": "BEST ICECREAM EVER!!!!I give it 10 stars, yummy and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAMELA D. aPROpos of nothing"
},
"reviewBody": "I had a can of Coco Lopez lite hanging around so used it for this. Left out the coconut. Served Almond Joy-ish. Scooped ice cream and drizzled with ganache then sprinkled with toasted chopped almonds and toasted coconut. Delish! EDIT: Made again with full fat Coco Lopez and just half and half. Worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anjea Ray"
},
"reviewBody": "I just made this tonight. It was absolutely delicious! It was creamy and smooth texture. Next time I want to add either pineapple at the end or swirl some dark chocolate sauce into it, yum! The flavor is full and super coconutty. I opted to leave out the shredded coconut as I don't like the chewy texture.\n\nI think the people that made it used either coconut milk or coconut cream instead of CREAM OF COCONUT. They are NOT the same thing. Cream of Coconut is found with the mixers in the wine/beer section of grocery stores, and is a pre-sweetened coconut mixture used as the base of pina coladas and the like. If you used coconut milk or coconut cream instead, there is no sugar in this and it will not only not be sweet, but it will have minimal flavor and will turn very icey with tons of crystals after sticking the container into the freezer to harden because of the excess water content."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duana"
},
"reviewBody": "This recipe was really a hit with my family....I changed a few things. I added coconut extract (tiny bit) and about 3/4 cup of granulated sugar. Next time I plan on doubling the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "Taste was OK, but not creamy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rookiechef"
},
"reviewBody": "This coconut ice-cream is good if you are looking for an ice-cream that tastes like whipping cream, with a little coconut kick. I slightly toasted the coconut and blended it in a food processor with the other ingredients so the coconut was pretty fine. I prefer the flavor of the Best Vanilla Ice Cream on this site made with half and half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "merkalee"
},
"reviewBody": "Simple, quick, delicious, and the leftovers kept very well in the freezer. I used one cup of (unsweetened) coconut milk in place of a portion of both the milk and the cream, just to increase the coconutty-ness of it. \n\nWe served it with some ganache I had leftover from a previous dessert and it reminded me of a Mounds Bar! Yummmmm! My guests thought I was very \"gourmet\", but it really couldn't have been simpler!\n\nAnd even though I really didn't have enough ice for the ice cream maker and just had to make do with the small amount that I had (plus, I stopped it too soon), it turned out only slightly more \"milkshake-y\" than I had hoped. But it was still just as thick as many other homemade ice creams I've had, and definitely very rich and creamy.\n\nIn short, good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan c."
},
"reviewBody": "Wonderful. I omitted the coconut from the ice cream, but served it with toasted coconut, toasted almonds and warm fudge. Everyone loved it. Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chrismar"
},
"reviewBody": "I truly love coconut ice cream. This is my favorite recipe. I rated it a 4 because the first I made it, I followed the recipe exactly, and while that was good, the second time I made the following changes. Instead of dairy milk I used silk coconut milk. I do not like coconut in my ice cream so I toasted it and put it on top. Delightful!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Mc."
},
"reviewBody": "Oh my heavens this ice cream is delightful! (Or *was*, considering it's gone already &amp; I only just made it last night!) I tweaked the recipe a tad due to not having the exact ingredients on hand (&amp; due to impatience), and I will make it the exact same way next time:\n1 1/4 cup fat-free milk\n1 1/4 cup regular whipping cream (not whipped)\n14 fl oz cream of coconut (squeeze bottle found in drink mixers section)\n\nBlended *everything* together in blender (misread original recipe directions). Let mixture chill *maybe* 10-15 minutes in fridge, probably less. Let it churn in ice cream maker for about 30-40 minutes max. Ate some incredibly delicious but super soft ice cream, &amp; threw rest in freezer over night. PERFECT. (Even the hottie at work thought so!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B808"
},
"reviewBody": "Delicious and refreshing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "Rich, creamy explosion of coconut flavor! This is also one of the easiest ice creams I've made as it calls for so few ingredients and no extra steps like cooking the custard or mixing and chopping. This is a lovely, pure white ice cream, easily adaptable to endless toppings or additions if you choose, though it is perfect just as is. For this occasion I just drizzled some chocolate syrup on the plate and added a few fresh raspberries and chopped chocolate covered almonds. I followed the recipe exactly as written, but chopped the coconut finely in my food processor. I added the coconut to the cream mixture and then let it steep its flavor into the mixture while chilling in the fridge for several hours. This is one of those few recipes that exceed your expectations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Leeper"
},
"reviewBody": "This was just OK for me - not very sweet. Also, there was about a cup too much liquid for my particular (Cuisinart) ice cream maker so it overflowed which was annoying. Not sure if i'd make this again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandmotherof6boys"
},
"reviewBody": "My husband loves coconut so I made this for him. He ate the entire thing by himself. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WTS"
},
"reviewBody": "ABSOLUTELY WONDERFUL! I used the Kitchen Aid iced-cream attachment and it came out perfectly. Smooth, creamy, and delicious. I did not have any coconut to put in but it did not matter. It was very very delicious. Use the Kitchen Aid attachment for 30 minutes until it starts creaming up to the top. Then I transferred it into a plastic container for an overnight freeze. VERY VERY nice... worth a repeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cali Girl"
},
"reviewBody": "I have been craving ice cream lately, but I'm vegan, and the closest source of vegan ice cream to me is 135 miles away, and I can't buy vegan ice cream and get it home. SO... I made this recipe but subbed So Delicious vanilla coconut milk (the kind for drinking/cereal) for the cream and milk. I used the cream of coconut and the full amount of flaked coconut, which I left whole. This stuff is SOOOO good. I couldn't stop stealing bites out of the top of my Cuisinart as it froze."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/59188/coconut-ice-cream/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
"name": "Frozen Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1556/desserts/frozen-desserts/ice-cream/",
"name": "Ice Cream"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/59188/coconut-ice-cream/",
"name": "Coconut Ice Cream"
}
}
]
}
}
, "about": [
]
}
]