				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coconut Macaroon Brownies"
,"datePublished": "2020-06-18T23:05:53.000-04:00"
,"dateModified": "2022-07-14T16:23:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Valerie Hatfield"
,"url": "https://www.allrecipes.com/cook/24329113"
}
]
,"description": "These decadent brownies have a delicious layer of coconut sandwiched between two chocolate layers. They were requested at a political campaign, at a social party and at my fiftieth anniversary."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ojhAiqoftZzSqm0OuhCU0Z0h3fI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3222206-c8b9fb5337f14f48803a28f98574a149.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coconut Macaroon Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "120"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "479 kcal"
,"carbohydrateContent": "52 g"
,"cholesterolContent": "76 mg"
,"fiberContent": "5 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "125 mg"
,"sugarContent": "36 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 cup butter, softened",
"2 cups white sugar",
"4 eggs",
"1.5 teaspoons vanilla extract",
"2 cups all-purpose flour",
"0.75 teaspoon cream of tartar",
"0.5 cup unsweetened cocoa powder",
"0.5 cup chopped walnuts",
"4 cups unsweetened flaked coconut",
"1 (14 ounce) can sweetened condensed milk",
"1 tablespoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream together the butter and sugar. Beat in the eggs, one at a time, then stir in 1 1/2 teaspoons vanilla. Combine the flour, cream of tartar and cocoa; stir into the egg mixture until well blended. Fold in walnuts. Spread half of this mixture into the bottom of the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Make the middle layer. In a medium bowl, stir together the coconut, sweetened condensed milk and 1 tablespoon vanilla. Carefully layer this over the chocolate layer in the pan. Top with the remaining chocolate batter. Spread to cover evenly."
} ,{
"@type": "HowToStep"
,"text": "Bake for 45 to 50 minutes in the preheated oven, until top is no longer shiny. Cool in the pan before cutting into bars."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The brownie is very thick, hard to spread and not really enough for a 13x9 pan. Should have followed my instincts and used a 9x9 with half the coconut mixture. I can’t see how this could bake for 45+ minutes. We’ll see, it’s in the oven now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly C"
},
"reviewBody": "I made this recipe exactly as it is written. It didn't need the whole cooking time, though. They were just OK. It is definitely way too much of a coconut layer. Could be about 1/2 to 2/3 of the amount and be better. I would not make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Maximalee Gonzalez"
},
"reviewBody": "They are too sweet, cut down the sugar and the condensed Sweetened milk , this made it too sweet!!! I will not make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Alexander"
},
"reviewBody": "Really good, too good. I now have to make them for EVERY office function."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "It was very rich. I give it 3 based on coconut mixture and prep and cook. The coconut mixture is extremely sweet and I used unsweetened and toasted the flake. It's the condensed milk that makes it too sweet. Also some of the coconut mixture stuck to the edges of my pyrex and it made it difficult once cooled to cut into neet squares. The taste is there, mimicking a mounds bar but sweeter. Very rich and will satisfy a sweet tooth. But don't plan to serve neatly as it will crumble and stick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SimonT"
},
"reviewBody": "yes i absolutely loved it! thought it was undercooked but was just the condensed milk that makes it go slightly goey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aerix88"
},
"reviewBody": "It was relatively easy to make. The only part I had trouble with was adding the cocoa mixture into the main bowl; it definitely thickens up which makes it harder to stir. I didn't change anything and I would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BEVANGELISTA"
},
"reviewBody": "As others said, this made a super sticky thick batter. After fighting with the bottom layer (tried butter on my hands, oil spray on a silicone spatula, nothing worked), I figured out how to spread it when I got to the top layer. Have a cup of water nearby and whenever your spoon gets sticky, dip in water. The water will allow you to spread the batter evenly and smoothly. I used 3 eggs for fudgy brownies. I used the full 4 cups of coconut since the Bob's Red Mill unsweetened shredded coconut bag has 4 cups, but next time I will use only 3 cups. The coconut layer was too thick and a little dry. Definitely use unsweetened coconut; it would be way too sweet if you use sweetened."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Since other reviews were not positive about the brownie I used 2 box mixes, one for the bottom and one for the top. That made it a bit too thick for the 9X13 pan and caused my edges to be on the extra done side. My co-workers thought that was a bonus. I used sweetened coconut and it was not too sweet. I'll make it again in a larger pan or not use quite all of the brownie mixes. Mine did not look like the photo as the coconut layer mixed in with the bottom brownie layer but the bottom line was still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "I did omit the walnuts because some folks had nut allergies, but these came out wonderful. Everyone in my bunco group loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andreas Sørensen"
},
"reviewBody": "These were great! To make it more chocolatey I added half a large plate of 70% dark chocolate. Amazing and soft brownies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sam Styles"
},
"reviewBody": "Nice flavours with the coconut and walnuts. Personally added in more walnuts. Brownie part was too cake-like and would've been nicer with the use of actual chocolate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathleen Salvio"
},
"reviewBody": "This recipe is lacking something. When eat a brownie I want something rich and chocolatey,,,while the chocolate and coconut is a perfect pair in my eyes, this recipe needs a boost in the chocolate! Very blah...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alexandra"
},
"reviewBody": "These brownies tasted great! However, there was not nearly enough brownie batter to cover a 13x9 pan twice (for a top and bottom layer). The problem is that the batter is too viscous to be able to spread it thinly enough. I ended up having to use all the brownie batter on the bottom layer and putting the coconut mixture on top. Next time, I will either double the brownie batter portion or use a smaller pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious recipe and great idea! Only complaint is that it is very sweet. The next time I make this recipe I may use only half a can of sweetened condensed milk instead of a whole can. Also I felt the coconut flavor was overpowered by the dulce de leche so next time I may use sweetened coconut milk and toast the coconut flakes beforehand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "janthewoman"
},
"reviewBody": "I followed the recipe exactly and removed the pan from the oven after 45 minutes, the minimum baking time given. The brownies are so dry that I almost don't want to serve them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "torib72"
},
"reviewBody": "I used gluten-free flour. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momoftwo"
},
"reviewBody": "Rich but perfectly flavored. My mom made this recipe with additional frosting on top which is even better. These freeze really well if you can't eat them all at once. Will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANNAMA"
},
"reviewBody": "four stars but an option to be upgraded: I want to try with the changes some other cooks suggested. 4 cups of coconut is way too much, tends to result in a dry middle layer; the idea of adding cottage cheese and/or eggs could be worth a try; the brownies texture is a bit cakelike... so, it could be improved but it's a very good start"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thelmavp"
},
"reviewBody": "These were delicious! I followed the recipe just as written and they turned out well. Everyone loved them. Made them twice in a week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lee Knox"
},
"reviewBody": "I made these brownies using the original recipe because I loved the combination. First problem I ran into was spreading the brownie layers. They were thick and difficult to spread, both bottom and the top. Second, the baking time is wrong for these. I always bake ten minutes less than a recipe calls for, just in case. I bake these for 35 minutes and I should have baked them 30 minutes or less. Lastly, the brownies came out dry, I don't know where some said they came out cake-like??? I couldn't believe no one complained about this recipe, but after reading a lot of the reviews, most people used other brownie recipes or box mixes. I think I read one review complaining about this recipe being dry. It has a good taste, it's just too dry, even with the coconut center. If I make this again, I will make adjustments and see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ray Nuss"
},
"reviewBody": "I first made this as stated in the recipe and found the brownie was too cake-like and the coconut layer was way too thick. The next time I made it I used my own recipe for fudgy brownies and reduced the coconut layer in half. I baked it for 30 minutes at 350 degrees F and they turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Wanda Holcomb"
},
"reviewBody": "I love this receipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheffxmcp"
},
"reviewBody": "Hi Valerie !! Awesome recipe !! I made it for a group of friends and they went like hotcakes ! They all think I'm their resident chef ( of which I am but c'mon, I do it for a living ! :) ) As some people mentioned, there was more filling than brownie. I just made extra brownie mix and that settled that. Also for those who found it a little difficult to spread out the batter an easy remedy for that is to just run your fingers (or pallette knife) under warm water and just push it around til in goes into place. Bravo !! It's a keeper Val !! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim"
},
"reviewBody": "Such a fantastic dessert!!! I loved it and so did other friends that tried it - some getting quite addicted to it! The brownie is very light as other reviewers noted (i.e. not fudgey), but I thought it was great! I will definitely make this again without any changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noeller67"
},
"reviewBody": "These were definitely better after sitting overnight. I used Trader Joe's cocoa and the brownie part wasn't nearly as dark or chocolatey tasting as it looks in the photo, which was disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Newman"
},
"reviewBody": "Excellent recipe. The taste is absolutely wonderful. The ease is a 4 to 5. It makes quick, cleans up in just a few minutes and will go into my favorites. Thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bruce Evans"
},
"reviewBody": "The brownie part was heavy, very cakey, and dry, and the top layer of the brownie did not adhere to the coconut layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Browning"
},
"reviewBody": "These are quite possibly the best brownie I've ever made or eaten! This one's a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherelle Cartwright"
},
"reviewBody": "Since I used sweetened shredded coconut I reduced the amount of sugar added by 1/2 cup....that way I got the flavor of dark chocolate that I like in the brownie (not too sweet). The batter was pretty stiff and couldn't really cover the way would like so I think I will increase or double the ingredients. I couldn't stop eating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marie Gibbs Garofano"
},
"reviewBody": "Found this very difficult and time consuming to put together. Thought the coconut layer had too much vanilla flavor. Will probably not be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VER"
},
"reviewBody": "These brownies were amazing. I doubled the recipe which was good, because my neighbors kept knocking on my door for more. These will definitely be added to the list of \"Christmas cookies\" that I bake for the nurses at our clinic.\nThanks Valerie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Hensley"
},
"reviewBody": "These are great. Easy to make. My family and friends love them. I used sweet coconut. Next time I make it I will double the brownie part to make more fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shirline Housman"
},
"reviewBody": "Really good but very rich, it made too much for just me and my husband so unfortunately some was wasted. I also used sweetened &amp; roasted coconut mix so that probably contributed to it being so rich with the sweetened condensed milk. My husband loved it but even he couldn't keep eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodIsLove"
},
"reviewBody": "A dense and intense chocolate/coconut brownie! Will definitely make this again, with a few changes. Because the recipe calls for unsweetened coconut, this makes the filling a bit dry. As some others did, you could use sweetened coconut instead, or do a mixture of 1/2 and 1/2 which I will try next time. Also, I would cut the amount of the coconut filling in almost half. Unless you absolutely can't get enough coconut, it seemed a bit too much. Might also add chocolate chunks, as well. Decadent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "As suggested, I tried this filling with another brownie recipe - so this rating is for the filling. I liked it on a spoon, but notsomuch in the brownies. I thought it would be creamy maybe? 'Didn't do it for me, but I'm glad I tried it. 'May just add whipped cream or whipped cream with some cream cheese to the filling for an amazing frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Henderson"
},
"reviewBody": "I wanted them to be moister."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary H"
},
"reviewBody": "Loved this! Used a ghirardelli mix with fudge frosting. Baked in 8x8 pan and used 4 oz coconut and half can sweetened condensed milk. Amazing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maegan Ellicott"
},
"reviewBody": "I only used the coconut filling from this recipe, so I don't feel that I can give it 5 stars as I didn't use the whole recipe. I used the \"fudge brownies 1\" recipe for the brownie. I read the reviews that mentioned a cake like brownie and I don't like those at all. The brownie I used is fudgey, but that might be a problem too. The coconut filling was great but because it was so thick and heavy, I couldn't keep it separate from the bottom layer. After making a mess I decided to just mix it with the bottom layer and keep the top layer clean. It turned out great! I will definitely use this filling again but be more careful about bake times. It adds a lot of moisture but is totally worth it. It tastes just like a german chocolate cake really easy and far better than you get at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KSCK1"
},
"reviewBody": "Saw this recipe and decided to use my boxed brownie mix that was in my cabinet! Added the coconut mixture in the middle, along with some chocolate chips, walnuts and caramel bits. Then added the top brownie layer. Delicious! Not changing the original recipe, just used it as a spring board. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karajean"
},
"reviewBody": "I USED A BOX OF FUDGE BROWNIE AND MIXED IN SLICED ALMONDS. THEN SPREAD BUTTER ON A 13X9 PYREX PAN AND SPRINKLED A COAT OF FLOUR ON LIKE YOU WOULD FOR CAKE. I LAYERED THE BOTTOM OF THE DISH WITH HALF OF THE MIX. FOR THE FILLING I USED ONE BAG OF SWEETENED COCONUT, A CUP OF WHOLE MILK, AND 1TBLSP. VANILLA. IT CAME OUT LIKE IT HAD CHOCOLATE FROSTING IN THE CENTER. THEN I SPREAD A LIL POWDERED SUGAR ON THE TOP. THE BROWNIES WERE DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mac Derringer"
},
"reviewBody": "didn't change a thing and it came out fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Menashe"
},
"reviewBody": "I made this recipe over the weekend and we loved it! It came out a lot like the picture and it was so yummy! I added extra cocoa because others mentioned it wasn't very chocolatey! I also only had sweetened coconut on hand so that's what I used. Thanks so much, Valerie, for sharing this with us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GFWMOMOF2"
},
"reviewBody": "Could I reduce the amount of sugar since I only have sweetened coconut?and still have them come out ok?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tturnerez"
},
"reviewBody": "Way too dry and bland. I think could be very good with some changes though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leah"
},
"reviewBody": "So, I can't review the actual brownie part of the recipe (bc I used a box!), but the filling, to me, was too gooey. I used just over 3 cups of coconut (that's all I had left and wasn'to going to the store for more). They were hard to cut and didn't present well, but the guests at the party were raving about them... So I guess that's what's important. I love the idea, but I'm not sure that I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rervine"
},
"reviewBody": "Made as is. I like my brownies with more chocolate but got rave reviews at the bbq. Next time I think I will try as others have done and use a different brownie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zuzana Halbgewachs"
},
"reviewBody": "These are fantastic. I used my brownie recipe as many other reviewers. We could not stop eating these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trouties"
},
"reviewBody": "OH......MY.......WORD!!!!! These are unbelievably delicious. I used 2 Ghiradelli Brownie mixes as the base, made the coconut filling per the recipe, and baked per the box mix instructions. Perfect for a 9x13 pan. Sooooo easy, but gourmet taste out the ying-yang!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori "
},
"reviewBody": "I followed this recipe exactly. The brownie is cake like. The batter is thick so a bit difficult to spread. I prefer more fudge like brownies so next time I will use Hershey's Best Brownie recipe. The filling is great. I bet brownie frosting on top would be criminal. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim C."
},
"reviewBody": "Oh this was delicious!!!! Instead of using walnuts in the batter, I substituted with 3/4 cup milk chocolate chips. MMMMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HESSELMJ"
},
"reviewBody": "I made this recipe as written. Yummy. I think I'll add more condensed milk to make the middle layer creamier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "Such a hit, and easy to make! Great tasting brownie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess Schultz"
},
"reviewBody": "Believe it or not, I'm allergic to coconut but had a HUGE bag given to me for some odd reason, so I decided to find a recipe to use it - THIS ONE! I brought them to work and they were all gone, no crumbs even with in 25 minutes! One coworker said \"This is the best sweet thing I've literally ever had.\" Job well done for not being able to taste my treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mitzymoo"
},
"reviewBody": "when i first made these i used a box mix just because we had one and i needed to use it. I was kinda worried that their was too much milk in the coconut mix. it seemed like it wouldn't bake at all. but i checked on it every few min and realized that it was fine. but i would suggest not using AS much evaporated milk in it. maybe about half a can or a tiny bit more. but they are realy good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brit"
},
"reviewBody": "These are really mild! They are more like a scone bar then a brownie. Still good, serve with coffee and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KERRI SKRUDLAND"
},
"reviewBody": "Yum! These were good. I used sweetened coconut, as I could not find unsweetened, and omitted the walnuts because we don't like them. Like some others have said, I would have preferred more fudgy brownies, but these were tasty nevertheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Schnase"
},
"reviewBody": "What a great recipe! I did go with the suggestion of only using 3 cups coconut &amp; 3 eggs. Turned out perfect! Be careful not to overbake though because they tend to dry out easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nmschalk"
},
"reviewBody": "added 8oz package of cream cheese and 1 egg to coconut filling. These are amazing like that!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MARIAH321"
},
"reviewBody": "WHile the filling for this brownie is brilliant, the brownie itself left much to be desired. After reading the reviews I decided to shorten the time in the oven and they are still a little dry. Next time I use the filling I will try a different brownie recipe....also I would consider only dabbing on the top layer so you get a marbled look. I think the coconut filling would be BRILLIANT if toasted slightly....and letting bits peek out under the top layer is how I would accomplish that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn"
},
"reviewBody": "I doubled the amount of coconut and forgot the second dash of vanilla extract and I chose NOT to add the nuts (hubby doesn't like them) and I added mini chocolate chips to the coconut mix and they came out FABULOUS!!! Absolutely lovely! We will be making these again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Marshall"
},
"reviewBody": "First, let me say, this is the first brownie I have ever made that didn't come out of a box. I am the worst baker EVER! With that being said, I felt like giving it another try, and decided to try my hand at this recipe. I'm not sure what anyone else is referring to when they say the brownie part wasn't good, or was dry. These were AWESOME. Moist, delicious, tasty!!! Thank you so much for posting this recipe. The compliments I got from making these made me VERY happy! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Marsh"
},
"reviewBody": "Wonderful! I used the filling with another brownie recipe, but I think next time I'll try the original brownie recipe instead. We loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chicaD"
},
"reviewBody": "I'm only rating the coconut mixture and the idea of sandwiching it between brownies. I used a box mix to save on time, but otherwise followed the instructions...Wonderful! Even the folks who said they typically didn't like coconut LOVED them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "These brownies are super good. I took them to my in laws for New Year's and everyone loved them. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jjjames"
},
"reviewBody": "Pretty good. A little too sweet for my taste, but everyone else loved them. Mine didn't cut like pictured either. The center kinda integrated with everything else in a sticky sweet goo (a delicious goo according to my friends), so presentation was rough. Still good, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I rarely review recipes but felt I should share my experience with this one because it is dry and rock hard! Not too sure exactly what I did wrong but I won't be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "These were amazing...Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "I did not care for these at all. As other people have commented, the brownie was very dry and crumbly, so maybe a box mix would be best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stitchinthyme"
},
"reviewBody": "As others have said, the rating is mostly for the filling. Since so many people seemed not to like the brownie part, I decided to try the \"Fudge Brownies I\" recipe with this filling. It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "imabaker"
},
"reviewBody": "I made this with no alterations and baked it for the called for time of 45 minutes. It was very dry and bland tasting. I won't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenniferm1"
},
"reviewBody": "Thank you for sharing this wonderful recipe!! It combines my two favorite ingredients coconut and chocolate!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I enjoyed this dessert but the brownie part just wasn't that good, I found it a little dry and cakey. Needless to say, it crumbled when cutting it up. I don't think I'll make it again unless I use a different recipe for the brownie part. And instead of giving it 5 stars after making so many changes we should start reviewing the recipe itself! Just food for thought"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rrmarlnee"
},
"reviewBody": "The flavor of these brownies is excellent! I gave it a 4 instead of a 5 because, like many, the brownie is more like cake and I like my brownies more dense. Also, they were a little dry so I think the baking time could be shortened up a bit to help with this. I like the idea that many have about using their favorite brownie recipe and using this filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TwinsMom"
},
"reviewBody": "These were wonderful! I did cheat and use a box mix for the brownies, but the filling was amazing. I used regular sweetened flaked coconut, and the result was a very sweet, moist, macaroon filling. We all loved them, and will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Becca"
},
"reviewBody": "These weren't quite what I was wanting but they were still very good. Used sweetened coconut and it was still okay, just cut down the amount of condensed milk. Very thick brownies, even in a 13 x 9 pan. Also added almond slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOPHILLIPS"
},
"reviewBody": "These are rich - next time, and there will be a next time, I'll cut them into smaller servings. The coconut layer DID full me when checking doneness. The toothpick kept coming out moist because of the middle layer so I overbaked them a tad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKOONUS"
},
"reviewBody": "These were good. I followed the recipe exactly, but I did not include the nuts. I think they would be better if it was 3 cups of coconut, and add pecans and some caramel between the layers. I took them to a party, and they were a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela F."
},
"reviewBody": "Great idea however mine came out way to dry. I think 45-50 mins is way to long. These brownies are not that thick. I think 30-35 mins would have been plenty. If it wasnt so dry these would have been to die for! I will make these again with shorter bake time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Schoolin' Mama"
},
"reviewBody": "These are to die for! Of course, sugar is my friend! Everyone in my family (who likes coconut) loves them! Definitely do not overbake and keep well-covered, if they last more than a day! I even substituted 1 tsp. baking powder the first time because I didn't have the cream of tartar, and they were fine. I've made them 3 times in as many weeks for get-togethers. Definitely need coffee (or milk for the littles)! My favorite dessert recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aussiemum"
},
"reviewBody": "Good, not excellent. It's too sweet. One piece is enough for the whole day. 100% guilt when you eat it. I can actually feel gaining weight while eating it. yikes! I'll probably make it again but will reduce sugar by 1 cup. Maybe increase the cocoa powder to 3/4 cup. I can't taste the chocolate because the sweetness is overwhelming. The coconut macaroon filling is super sweet. Check in 30 minutes of baking, you don't want to overbake or it will come out dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Loved this recipe. I followed the directions and they came out perfect. They are sweeeeet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsJPS"
},
"reviewBody": "These are pretty good, not quite what I envisioned, but not bad. I didn't bother trying to hunt down any unsweetened coconut and just used the regular sweetened kind. It's sweet, but it's dessert, right? I didn't make the brownie recipe listed but used a box mix instead, as a shortcut. I don't know if I'll make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "qayaqgirl"
},
"reviewBody": "HUGE disappointment- made for my valentine after reading several great reviews. Flavor was generic/boring, coconut layer pulled apart from chocolate. And was a big hassle to make spreading dough. Probably worst recipe I've done from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HT27"
},
"reviewBody": "so so so good! i made this recipe with 1.5 times the brownie, so as to have a good coconut-brownie proportion, as some reviews stated there wasnt enough brownie. The cake was thick and rich, the coconut tasted FAB, the brownie, yes it was cakey, but SOO good! i also preffer fudgy brownie but i suppose with this coconut in it, it might have all been too....fudgy? AMAZING, with defoo make it again! however, i baked in a 9x13inch, and the middle wasnt properly done, not that it matters, it added a creamy touch to the cake and was amazing. the top was perhaps too hard, i tried to bake it long enough to have the middle as baked as possible and burnt the top a lil! oh well... EVERYONE went crazy about this, even those which dont like coconut so much! definately a keeper!! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Miller"
},
"reviewBody": "I made these brownies and I did not have unsweeted coconut so I used sweetened. I also ended up melting the butter completely which I believe helped make the batter more spreadable which some reviewers have complained about. We served the brownies with a mixture of blueberries and strawberries over the top with cool whip. I will definately make them again because they were relatively easy to make and very delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Trapp"
},
"reviewBody": "Relatively easy to prepare and very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "These are incredibly rich but sooo good! When I make these, I line the 9x13 pan with aluminum foil and grease the foil, so that I can take the sticky brownies out easily and peel down the foil, then cut them up. It's so much easier than cutting them out of the pan because the macaroon layer gets very sticky. Yum! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynnje"
},
"reviewBody": "Excellent! I confess I used boxed browines and only used the filling which was wonderful. When I have more time I will make the browines from scratch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lesley W."
},
"reviewBody": "I've made these brownies twice now. I think they are to die for! The only reason I didn't give the recipe a 5 was because it is a little difficult to make. The brownie mixture is SOOOOO thick that it is almost imposible to work with. I had to add some milk to it just to be able to get the top layer spread out. Other than that, this recipe is fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msjjones"
},
"reviewBody": "major winner. every one loves these.\nI usually frost them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britishcolumbiagirl"
},
"reviewBody": "The rating is for the filling; as others suggested I used a different recipe for the brownies (Fudge Brownies I from this site). The coconut macaroon filling is a nice way to \"dress up\" regular brownies. I used a 9X9 pan because I like thick brownies and baked for approximately 60 minutes. Very good! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baton Rouge Mom"
},
"reviewBody": "These were AWESOME! I notice everyone else pointing out that we are supposed to use unsweetened coconut, but I used sweetened because it is what I had, and it was devine. I wouldn't change anything. The batter was very thick, so it was hard to spread, and I found that I had to spread it with 2 fingers with a little butter on them- the spatula just was clinging to the batter. I made them in a 9x9 bar pan and thought the thickness of the layers was absolutely perfect. These are just great and are definitely staying in my recipe box. We burned our mouths on them because we couldn't wait till they cooled to taste them, and they were worth it. They are even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krikker1212"
},
"reviewBody": "These are the BEST brownies I have ever tasted! They're like gooey almond joy bars. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "These taste best after being refrigerated over night. If I made these again, I would put only three eggs in it instead of four to make it less cake like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaley_Rae"
},
"reviewBody": "I messed these up but everyone was still eating them!! First, I used SWEETENED coconut..but it wasn't that bad with it. Second, I only used about 3 1/4C of coconut; making the middle ubstable. The bar would not hold it's shape from there, either. When the top started cracking, I took it out. It was not done!! I then cooked it full time and then some..It was still great though!! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "POLARBEE"
},
"reviewBody": "These were very rich but delicious! They were sent to work with my husband and his office ate them up in record time. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie C."
},
"reviewBody": "This rating is for the filling, it is wonderful! After reading the other reviews I decided to use the filling with my favorite brownie recipe. I also used 1&amp;1/2 brownie recipe to give a better brownie/filling ratio. I made 4 different types of brownies and these are by far the best. I used the Baker's One Bowl Brownies recipe from the Kraft web-site for my base. Thanks for sharing Valerie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WhatADish"
},
"reviewBody": "These are really good, but if I made them again I would change some things. First of all, the coconut layer. It is really thick, I think there might be more coconut that brownie! It's a tiny bit dry too, I would maybe use 3 or 3.5 cups of coconut next time (and keep the milk the same). That would cut down on the thickness of that layer also. I checked these at 40 minutes and they were done. I think they might have been a bit over-done, so I would check at 35 next time. These cut very well and look fancy, I love how they turned out. It was really, really hard to spread the brownie batter (both times). I used Bob's Red Mill unsweetened coconut, and 1/2 cup whole wheat pastry flour. I have been wanting to make these all year and I'm glad I finally had an excuse to make them! (Taking them to a function tomorrow). Thanks for the recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25016/coconut-macaroon-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17019/desserts/cookies/macaroons/",
"name": "Macaroon Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25016/coconut-macaroon-brownies/",
"name": "Coconut Macaroon Brownies"
}
}
]
}
}
, "about": [
]
}
]