				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coconut Macaroons II"
,"datePublished": "1997-12-29T11:42:52.000-05:00"
,"dateModified": "2022-08-08T10:46:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ROBIN JOYE"
,"url": "https://www.allrecipes.com/cook/907397"
}
]
,"description": "This is a very simple coconut macaroon recipe that uses only 4 ingredients. Condensed milk gives it a richer flavor than most."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/InpPl4TqJJvUw0dL0Fmoj8dY9c0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4336370-e7eeb1d534c4472088fc350bc8c71c87.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coconut Macaroons II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "160"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "132 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "6 mg"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "69 mg"
,"sugarContent": "15 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"5.5 cups flaked coconut",
"1 (14 ounce) can sweetened condensed milk",
"2 teaspoons vanilla extract",
"1.5 teaspoons almond extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (180 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In large mixing bowl, combine coconut, sweetened condensed milk and extracts; mix well."
} ,{
"@type": "HowToStep"
,"text": "Drop by rounded teaspoonfuls onto aluminum foil-lined and generously greased baking sheets. Bake 8 to 10 minutes or until lightly browned around the edges. Immediately remove from baking sheets. Store loosely covered at room temperature."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIKU333"
},
"reviewBody": "Loved the recipe! I got shredded coconut and it seems more dense so I used 4 cups lightly packed. I also did refrigerate the batter overnight and used a cookie scoop - baked for almost 20 minutes, and they are amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "4 ingredients and gluten-free!! You don't expect to get all the great macaroon flavor, but these are the best macaroons I've ever had. I melted some chocolate and dipped the tops of some of them in the chocolate - big hit!! I cooked them 4 minutes longer than the recipe called for. You just have to watch macaroons. They're kind of tricky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "Made as directed and they were wonderful and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lenny2"
},
"reviewBody": "I've never been much of a coconut person, but my husband and son are. I decided on a whim to try this recipe, since it looked quick and easy and I figured they'd like the cookies even if they were only passable. ;)\n\nAs it turns out, they're quite a hit! I didn't change anything about the ingredients, simply mixed well by hand and scooped balls (well-packed) using a smallish cookie scoop. I baked them on a sheet lined with the nonstick foil, no grease or butter added. I did bake at 325 degrees, for approximately 15-17 minutes. I let them cool on the sheet for a good 5 minutes before removing them to a cooling rack, and they came easily off the nonstick foil using just my fingers. \n\nBoth my husband and son loved these, as did my in-laws, who were visiting. What surprised me most was that I loved them, too! But they really are quite sweet, and we found that just one cookie with an espresso was a perfect treat. Thanks for sharing the recipe! I'm very happy I tried it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I made this and it was quite delicious. I accidentally made the first few batches using tablespoon size macaroons and they were soft (still good). The teaspoon size definitely makes for a more stable consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "I have been making these for years but without the almond flavor ( just 3 ingredients- coconut flakes, condensed milk and vanilla) but I love to add chocolate chips to this mixture about a cup and mix it right in . I recommend parchment paper over tin foil as the condensed milk can spread a little under the macaroon . That spread is yummy though and when toasted - I take a kitchen shear and trim the excess if I want more of a rounded shape and it is delicious- ok maybe its just an excuse to eat the browned edges. . My son LOVES these and I have never brought them anywhere without someone asking me for the recipe. I have scooped them and dropped onto sheet using large spoons and made larger pieces as well as a little ice cream scooper for smaller mounds. Smaller mounds may brown better in some ovens and may be easier to eat. The toasted coconut is the best part so browning the edges and even a little more browning all over is a good thing. Don't be afraid to over bake . One time they didn't cook as much underneath so I put them back in for longer and closer to bottom of oven. Too close to top of oven and tops may brown faster and underneath may not have cooked ,so it will still be gooey. That may have happened to some . Notice where you place them in oven , smaller mounds and longer cooking may help. Also make sure you're using condensed milk and not evaporated. Cans look very similar. You want them more toasted looking as that holds them more together and less gooe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary lou"
},
"reviewBody": "Turned perfect and a huge hit with friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "animaarbor"
},
"reviewBody": "I have made this in the past and loved it. I am also looking for a version that I can adapt for vegans -- without having to deal with Aquafaba. I am going to try making a vegan version of this using vegan condensed milk. I would also avoid aluminum foil. I made with parchment paper. I'll report back on how well it works in its vegan incarnation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "This was absolutely delicious! A little on the sweet side for me but still really tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rainey_Johnson"
},
"reviewBody": "awesomw"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Van Bakel"
},
"reviewBody": "Very yummy. I really packed the coconut down when I was measuring it. Also, I had to form them into tight round shapes before putting them on the tray to keep them from falling apart but that did the job and they were great. \n\nI used a medicine syringe to make the chocolate swirls on top and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine James"
},
"reviewBody": "This recipe is a recipe that was used in a grocery store bakery (back when things were made from scratch). Don't understand why people want to go to all the trouble of whipping egg whites. This recipe is quick, nice and chewy, tasty and keeps well. For STICKING problems, always use PARCHMENT PAPER on your cookie sheet. It is GLUTEN FREE without any effort (rice flour, xanthan gum, etc)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helene"
},
"reviewBody": "These were the best macaroons ever! They were as good as my Mother's. We melted 1/2 cup of chocolate chips and a capful of canola oil and drizzled over these. Wow. No words."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roger Gerick"
},
"reviewBody": "I've adjusted the recipe and method, and it's become the craze of the neighborhood. The ingredients are the same, but I add (2)6 oz. bags of dark chocolate chips and (2) 6oz. bags of dried cranberries. Put the cranberries, coconut, and chocolate chips in a fairly large bowl and use a spoon to thoroughly mix it all up while it's all dry and will mix evenly. THEN, put the condensed milk in a container and add the extracts and mix with a whisk thoroughly. Pour the liquid over the dry ingredients and mix thoroughly with your hands, making sure to get ALL the coconut coated with the condensed milk mixture. And, like some have said here, I let it stand in the fridge for a couple of hours or more to get it easier to work with. I've found that using two iced-tead spoons work great to make the cookies with. I use an insulated cookie sheet with a sheet of parchment over it, and some spray oil on it to add insurance to keep them from sticking. Then, like others have suggested, I use a slightly lower temperature oven, 325 degrees, and watch them to take them out when they start to brown around the edges, usually about 16 to 18 minutes for the first batch, and a minute or two less for the subsequent batches. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elaine Kester Rentz"
},
"reviewBody": "Great taste... But wish I had read the comments first about dough in fridge and molding into tight balls. First batch were tasty but with runny, burnt edges. I cut off that part and they were fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbalagia"
},
"reviewBody": "I make these every year at Passover and they never fail to impress. I omit the almond extract and add mini chocolate chips. Everyone at work always asks me when I'm bringing them in again!\r\n\r\nThe mixture is very sticky, but I bake them on parchment paper and let them cool a bit before moving them to my cooling rack and I've only rarely had one fall apart due to the heat. (I accept these as worthy offerings.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charcar"
},
"reviewBody": "I just tried this recipe and they came out beautifully. I prefer the loosely put together shape where the flakes poke out here and there and toast a little. Has anyone tried adding a pinch of salt to balance out the sweetness ? Even with unsweetened coconut flakes it's a tad bit sweet for my own taste, but it may be normal for macaroons. Thank you for sharing this recipe. (I tried one with flour and it was dry and dense, rather than chewy and gooey)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "They're best dipped in melted semi-sweet chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veggietress"
},
"reviewBody": "love this recipe! I baked mine at 325 for a little over 20 minutes and got a nice toasty outside and chewy inside. Everybody that tries them loves them! Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgkent422"
},
"reviewBody": "This is the first time I've used this recipe, and after reading the reviews I was not sure if I should try it or not. I just took the first batch out of the oven and didn't have any problems with sticking or gooieness. I turned the oven down to 325 as suggested in many of the reviews and let them cook for around 20 mins. I used ungreased parchment paper. The only other thing I did was roll them by hand, then roll them in extra coconut. They turned out beautifully, and smell great! I hope they taste a great as they smell/look."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "edna"
},
"reviewBody": "very tasty and very easy, great recipe for Passover.\nbake on parchment paper and you will have no worries with sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah Brandt"
},
"reviewBody": "After I made it the first time by following your instructions step for step, it wasn't till i came back and read other people's reviews and remedies to make it better. I don't want to have to experiment with a recipe for it to work, it would be nice if you had these helpful hints in your directions from the beginning. Happy Cooking and Have a nice day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AugustineH"
},
"reviewBody": "A very quick and simple recipe, not to mention tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bubbejo"
},
"reviewBody": "This is the recipe I've been looking for, minus the almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrilyn Fisk"
},
"reviewBody": "Great recipe. First time I tried it the macaroons came out perfectly. Very easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "Quick, easy and they taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ETRochester"
},
"reviewBody": "I followed the recipe to a T, and was very disappointed that the cookies were all stuck to the foil. They were inedible--if I tried to pull them off with a spatula, they took the foil with them. My only other option was prying them off with my fingers, which is pretty unappealing considering I was planning to bring these to my in-laws for Easter. I did read the reviews ahead of time and saw to generously grease the foil over the pans. I thought two tablespoons of canola oil spread out with a paper towel was generous enough... I guess not. If you try these, I suggest using double that amount of oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "inounvme"
},
"reviewBody": "Maybe I'm not destined to make Macaroons this is the second recipe from this site. No luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gluten-Free Mom"
},
"reviewBody": "With a new gluten-free diagnosis, I am on the hunt for foods that will prove to my son that his taste buds can still be happy. This was our first recipe, and he said, \"This is the best thing I've ever tasted!\" Super simple, made exactly as described (but cooked it at 325 for about 15 minutes). Easy, yummy, a total keeper in our new gluten-free recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MARIA71267"
},
"reviewBody": "Terrible....I had no success with these...they were runny and didn't like the tecture....I am a great baker and have no idea why these did not work for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MariaSK"
},
"reviewBody": "Great, easy receipe. I used 60% cacao chocolate ships, which cut some of the sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele_One_L"
},
"reviewBody": "I don't like coconut so I've never had a macaroon before....that is until now! I made these for the first time today (they are on the cooling rack as I type this). These are wonderful! Chewy and crunchy but they do stick to your teeth a little. I used a cookie ice cream scoop to \"shape\" these. I lined my baking sheets with parchment paper then sprayed the paper with Pillsbury flour (like cooking spray). I followed the recipe to the \"T\" except that I cooked them for about 15 minutes. I'd try this recipe again but I think I'll make them a little smaller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathleen"
},
"reviewBody": "These are fabulous. Much better than store bought. Made them as the recipe says. Didn't have a problem with them falling apart as I pressed them together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trodriquez"
},
"reviewBody": "tasty!!! coworkers who hate coconot LOVED them...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Peters"
},
"reviewBody": "Amazing! I had to try this recipe because of how simple it was and the results blew me away. I followed some of the other recommendations in the reviews and had no problems making the cookies. I even had someone who hates coconut go back for seconds on these. Thank you for the wonderful recipe which is now part of my favorites collection!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rlh47"
},
"reviewBody": "Good, easy recipe. I made these for Passover this year. I found that the smaller I made the macaroons and the more tightly I pressed them into a ball, the better they held up in the oven and after. I followed other comments here and refrigerated the mix first and reduced the heat to 325 and cooked them longer. Also, I could only find sweetened coconut at my grocery store. I toasted this coconut beforehand, which I think helped reduce some of the sweetness in the final cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Beth"
},
"reviewBody": "I made this for Passover this year. The cookies were a huge hit with everyone other than myself. I found them way too sweet- but looking at the recipe, I kind of knew they would be. Everyone else adored them! As suggested, I baked them on parchment paper. After allowing them to cool for a few minutes, they just popped off, easy as pie (or macaroons)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PeteCo"
},
"reviewBody": "I had 3 problems with this recipe since I've only had store bought ones I'm not sure if my results were normal. 1. too sweet for my tastes, since all the sugar is the condensed milk, I'd have to cut it with regular milk and I'm not sure how that would effect the consistency. 2. I found the almond/vanilla extract over powered the taste of the coconut. 3. The center was under cooked, but this was partly my fault because I made the cookies too big. Needless to say it's tricky to fully bake them without burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stacy"
},
"reviewBody": "I made these cookies for Christmas. They were a hit with the whole family. One thing I tried cooking them on the foil and they stuck badly, the next batch I just greased the cookie sheet and they were great and easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "these are super easy and yummy! I found no need for flour or any other alterations. Each batch produced rounded mounds of gooey coconut. I used silpats on my cookie sheets and removing the macaroons was effortless! A little melted chocolate really rounded these out nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "They came out perfect. I used unsweetened coconut and 1/4c. measuring cup to mold them, so they were huge, but nice and chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsjlandy"
},
"reviewBody": "I don't really like coconut... at all. I'd never had a coconut macaroon either so I had no idea what they should taste like. My husband loves them and bought one from a high-end bakery that he said was horrible. I was happy to see how easy this recipe was! He did most of the work himself and they still turned out great ;) I like that they're ooey gooey moist on the inside and just a little bit crisp on the outside. Our first batch is already gone. His co-workers are asking him for the recipe now. We're planning on making more for Christmas, this time with chocolate and sliced almonds on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "What a wonderful treat! We had a small dinner party and everyone kept saying \"okay, one more please!\" When you put the mixture in the fridge it makes forming the balls easier. Thank you for a tasty treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "amcase83"
},
"reviewBody": "These were okay. Flavor wasn't bad and they were very easy to make, but I wasn't wowed by them. These definitely do need to get removed from the pan immediately as they will begin sticking. Contrary to everyone else's experience about having better results if they refrigerated before baking, I actually had a worse result. I made a batch and immediately baked, and they held their form fine. I refrigerated the next batch for about 20 minutes, and these ones fell apart when I tried to remove them from the pan, and I even baked them an extra 2 minutes. I probably won't make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "These were absolutely delicious. I tried to make them right after I had mixed them and had a bit of a mess so I stuck them in the fridge for a few minutes and it made it super easy to get them into little balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Novakovich Gray"
},
"reviewBody": "I've been using this recipe for years. I must say that I can't stand coconut....but I LOVE these cookies! The only trick is removing them from the pan immediately after they come out of the oven because they do get sticky. But they're well worth the trouble."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "This is the best macaroon recipe ever. It is so simple to make, and deliciously chewy without being hard. It retains it's moisture extremely well. A big plus is that it's not just another cookie, and it stores well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saminnnn"
},
"reviewBody": "These are the best macaroons I've ever tasted. They are so easy to make, and they taste delicious. I keep getting asked to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maegyn"
},
"reviewBody": "I think this is a good recipe though I increased the coconut for a denser texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Depping Nielson"
},
"reviewBody": "Wonderful! I wanted to make my parents some travel goodies and these turned out great. I took the advice of others and reduced the heat to 325 and cooked for about 20-25 minutes. I also refrigerated the mixture for about an hour before forming them with an ice cream scoop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Biker Chick"
},
"reviewBody": "Just wonderful! Absolutely fool proof!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DSCOMPTON"
},
"reviewBody": "They're a holiday classic! The photo showed chocolate and it sounded great, so I gave it a shot! Melted chocolate chips, put the melted chocolate in a ziplock bag, cut off the corner and squirted it on. Turned out fabulous! Tasted great and looked even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicole pinnell"
},
"reviewBody": "This was very easy to make. I also put mind mixture in the frig for about a hour. I found that baking it on just my well greased cookie sheet worked better then the tin foil. I also added about 1 tsp. of coconut extract to the mixture to. These were really tasty. I'm making another batch for Christmas. The first ones didn't last long. lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "daidai"
},
"reviewBody": "MUCH too sweet (although it was probably partially due to the fact that I used sweetened coconut) and did not stick together while I was taking them off the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janet"
},
"reviewBody": "Way YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "These were really good. I used extra coconut flakes. Next time I'll add a little flour so they hold together more firmly. *** Update*** not sure if the flour helps much or not but putting the dough in the fridge for a little while before rolling helps and also squeezing the balls a lot when rolling them. Also, cooking spray works MUCH better than butter for keeping the macaroons from sticking on the baking pan. Foil just makes it more complicated, so skip that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nwright01"
},
"reviewBody": "When I made the macaroons, they seemed to melt apart. Even when cooled the macaroons would not stay together. Tasted great in spite of how it looked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Just OK"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GALAJO"
},
"reviewBody": "These cookies made a mess. I used Coconut Macroons III from the same sight and got a much better result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karla"
},
"reviewBody": "This is a mixed review. First off, I may have done better at this if I had reviews. I found the cookies too messy after baked, in fact, after the first batch, I tossed the rest of the mix out. Totally unlike me to do that, but was just tired. Wish I had saved it. Later, I took the \"cookies\" I had made, and rolled them into smaller balls and froze them. When they were solid frozen, I dipped them into melted bittersweet chocolate, and set to cool, where they became little \"mounds\" candies. At the two Christmas parties these \"candies\" attended, they were an amazing hit. This will teach me to toss out my mistakes, could have used several more pounds of these wonderful candies. Thank you for such an amazing recipe for candy centers. now I am going to try the cookies again, following some of the tips other have given."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOYCE"
},
"reviewBody": "My first batch stuck like mad to the well greased parchment paper. But the taste was great! So I added about a scant 1/2 cup of flour to the coconut batter and worked it in with my hands. I add green food coloring, rolled into teasppon sized balls and place a sliced candied cherry on top. Bake for 10 minutes on a well Pam sprayed cookie sheet... no parchment paper. The results are EXCELLENT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PLujan"
},
"reviewBody": "I read all the reviews and had great results. I used 6 cups of packed shredded coconut, and cut the almond extract to 1 teaspoon. I think it helps to mix the vanilla and almond extract in the sweetened condensed milk before mixing with the coconut. Chilling the dough for a couple of hours helped and I also used parchment paper and sprayed with Pam. As recommended by others, I reduced the temperature to 325 degrees and baked longer--anywhere from 12 to 18 minutes. Some batches took longer to get golden brown. This was easy and the macaroons turned out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bess Lyon"
},
"reviewBody": "I must say, this is a pretty bad recipe. It took alot o improvising to make this work. For starters, I added flour and grated almonds.. yum..... and then I dusted these with cinnamon befog I popped tham in the oven- and they still did not turn out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEB"
},
"reviewBody": "I've been making macaroons this way for years too, and I'm always having people ask me for the recipe. I do find that it matters which brand of coconut you use, as far as them holding together. Other than that, though, they come out perfectly every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jenni"
},
"reviewBody": "I really enjoyed the almond extract flavoring. I will try them again but on a lower temp setting for a longer cooking time. The milk mixture spread out of the coconut balls while cooking leaving the middles uncooked. I had to basically burn them to get them to stay together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "celena"
},
"reviewBody": "sorry to go against the grain but...not a very good macaroon recipe. the only reason i gave it 2 stars is because it was so easy. the taste is not the same as the recipes with egg white. if you want a sweetened condensed milk flavor, go with this recipe. however, if you prefer a very coconut flavor, find a recipe with whipped egg whites instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I changed the quantities up on this recipe but used the same ingredients. Used 3 cups of coconut (I chopped it up very fine), 1/3 cups sweetened condensed milk, 3/4 tsp. of vanilla and 3/4 tsp. of almond extract. I sprayed my cookie sheet very heavily with Pam and cook the macaroons until the tops start to turn light brown. Then after they are cool, I drizzle a chocolate ganache on the top (1/2 cup semisweet chocolate chips and 3 TBS. heavy cream. They always turn out perfect and I get tons of compliments! :) Thanks so much for sharing your recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "NESSY_19"
},
"reviewBody": "I don't know what happened, I followed all the directions to a T, and got an awful mess. This was a waste of time and money!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa"
},
"reviewBody": "I thought this was a great recipe! I always love recipes that have few ingredients. I changed a couple things- I left out the almond extract just because I don't like the taste, and I cooked for about 20 minutes at 325. These were fantastic, I can't stop eating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROSEBUD929"
},
"reviewBody": "Great recipe. There is no need to put them in the refridgerator. I followed the recipe and when it was time to put these on the cookie sheet I rolled them in some extra coconut. It came out great. The dried coconut got toasted and it made them look like snowballs. There was no oozing, nothing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ps Ski"
},
"reviewBody": "This is a perfect recipe! I used an air cookie sheet and simply greased it with crisco shortening, made balls then taped them slightly to flatten. 15 minutes cooking time, 2 min. cooling. Excellent results. I did chill for 30 minutes. This IS a no brainer recipe! Thanks for sharing...you rock!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LILBEAVER"
},
"reviewBody": "I had my doubts, especially trying to get them off the cookie sheet---but oooohhhhh, sooo good....they didn't last long enoughto get stale"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori C"
},
"reviewBody": "I have used this recipe for several years... a BIG hit. I omit the almond extract though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjo"
},
"reviewBody": "Have used this reacipe for years! I added orange extract instead of almond and drizzled dark chocolate ganache once they were cool. HUGE HIT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "morecookies"
},
"reviewBody": "The worst recipe I ever made. Did exactly as the recipe called for but ended up with a gooey mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELWINGS"
},
"reviewBody": "Easy, Simple and Delicious! I was a little scared at first mixing the whole can of sweetened/condensed milk in, it seemed like it was so much! But after baking and cooling, they turned out perfect and delicious the whole family loved them. And it was so quick and easy! I have to say (it could be my oven) that it took ALOT longer in the oven than the noted 8-10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "With more instructions, this recipe is great. Chill the batter. Use your hands to form balls and squeeze the daylights out of them to make them firm. And to avoid excess sweetness, use unsweetened coconut. I like Bob's Red Mill Unsweetened Flaked Coconut. There are exactly 5.5 cups of coconut in the package, so it works perfectly with a 14 oz. can of sweetened evaporated milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I took most of the suggestions, e.g., packing the coconut, refrigerating the batter, rolling into balls, using parchment paper, which said no greasing necessary, and the cookies held together well. I used more than a teaspoon for each cookie, so only got 30 cookies. I baked in two batches. The first I baked for 10 minutes, the second batch for around 13 or 14 minutes. The second batch came out looking and tasting better and didn't stick to the paper at all. Hopefully they'll taste better tomorrow, but cooled out of the oven for about an hour, they are rather gooey and taste extremely salty for some reason. I used 2-1/2 tsps. of vanilla extract and 1 tsp. of almond extract. I melted some milk chocolate chips and spread some on the second batch. Haven't tasted them with the chocolate yet. Waiting till tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "chellebelle"
},
"reviewBody": "I've never been very successful with this recipe. The ones that don't stick to the foil and that get cooked to a firm state are really good, but there are far too few of those compared to the burned bottoms and uncooked middles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Congrats to all of you who got these to work, but for me this was the worst recipe I've whipped up in a long time. The ingredient list practically defies logic anyways. I followed the recipe and all tips provided in the reviews and what I ended up with was a giant mass of burned sugar &amp; coconut. The stuff actually burned to parchment paper. I finally saved the rest of the mix by adding ab out 1/2 cup of flour or so. Edible but certainly not great. The coconut/sweetened condensed milk/extracts mixtures is great in the raw form...it just doesn't turn into macaroons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CATHYGE416"
},
"reviewBody": "So simple to make and a huge hit with the whole family! We drizzled melted chocolate chips over the top for an extra special touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PINEAPPLE738"
},
"reviewBody": "The macaroons came out great! I followed the suggestions of chilling the mixture before baking. I threw it in the fridge overnight and baked them in the morning. I didn't use the easy release foil, instead I greased the sheet generously. The suggestion of leaving the macaroons on the pan for two minutes does help in removing them. After removing them, I placed the macaroons on a lined a sheet with wax paper and threw them in the fridge (it holds its shape better). I kept everything in the recipe the same except for the amount of coconut: I used three bags of the bakers brand flaked coconut. The batch made about 80 macaroons. I was skeptical at first, but everyone who tasted it, loved it...it's especially great if you dip them in chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SmilingRedhead"
},
"reviewBody": "I've found the PERFECT combination for this recipe. I use 2 (14 oz) bags of Baker's brand coconut then the sweetened condensed milk and the extracts. I chill my mixture for two hours so it's easier to work with. I roll a teaspoon of the mixture between my palms lightly to form a ball and drop on the cookie sheets. I bake them for 12 min at 325 degrees. They're easier to remove from the tray if you let them set-up on the tray for 2 min. after removing from the oven. I allow them to cool on wax paper, then dip the bottoms in melted semi-sweet chocolate and put on a wax paper lined cookie sheet in the frige. They are incredible and look so pretty with my holiday cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "NURSE kAREN"
},
"reviewBody": "These taste good, but don't hold together at all.Also stuck to the pan despite using Pam.I am still looking for a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LYNN39SCAF"
},
"reviewBody": "too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "REBE424"
},
"reviewBody": "I consider myself to be a good cook and have made many recipes from this site. However, these came out HORRIBLE. I made them for Passover to take to my in-laws, and now I have to throw them in the garbage and buy some from the store instead. First of all, they don't taste like the traditional macaroons everyone expects to have on Passover. Secondly, I had to increase the time by about 12 minutes to get them the proper color, but doing so caused the bottoms to stick to the foil and become a complete waste of time and money. Never again will I make these awful excuses for macaroons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This wasn't quite what I was expecting. The flavor is a little off for macaroons, tasting slightly of caramel and coconuts. What's more the texture was way too chewy. With some melted dark chocolate and a little caramel topping, they do resemble Girl Scout Samoas, however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L&Cnummies"
},
"reviewBody": "Thanks so much Robin! I made the cookies just as the recipe directs, except I did take the advice of other reviewers and chilled the dough, and I lowered the baking temp to 325 and baked them longer. I pushed a Dove chocolate candy into the top of each right from the oven, let it melt then swirled it for a chocolate topping . My in-laws are big coconut fans--they joked that after almost 30 years together that fighting over these cookies is the only thing that has made them consider a divorce! I also put the baked cookies under a low broiler for a few minutes (under close watch) to get them nice and crispy on top. My father-in-law is a paver and I told him that if he could mix cement he could make these cookies--so simple and so worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIARANSALEE"
},
"reviewBody": "I rolled these and also used the release foil they were PERFECT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOUSEHOLDBAKER"
},
"reviewBody": "This recipe is awesome. I would strongly recommend chilling the mixture in the fridge for about an hour or so and rolling into balls in your hands..kind of messy but worth it. (I put the bowl back in the fridge while I waited for each batch to bake in the oven. Also don't make the balls too big then you will need to cook them longer and they will be mushy instead of chewy.) Flatten the balls a little on your cookie sheet lined with some Non-stick/Easy Release Reynolds Foil. When you take them out of the oven let them cool for a few minutes before you try to remove them to a cooling rack, they just pop right off the foil, didn't even need a spachula. Very easy to make and taste great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm glad I read the reviews about chilling the mixture. I omitted the flavoring extracts, and instead added about 1/3 C Irish Cream, and three well beaten egg whites (to offset the added moisture). Tasty! I also dipped some in melted chocolate. Excellent co-worker treats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crochetshannon"
},
"reviewBody": "The taste of this recipe is great! The only problem I had was it stuck to the pan. I did take the advice of another person to refrigerate mixture and this helped to prevent it from spreading to thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I gave this a \"2-star\" not for taste (they're delicious!), but for lack of instructions. The recipe as it's written sounds super simple.............but if you follow it exactly, without first reading several prior reviews, you'll have a sticky mess, with macaroons that fall apart and are really difficult to remove \"right out of the oven\" as the original recipe states. I ended up, after the first batch, actually using my hands to roll into balls, pressing the mixture so it would hold together. Simply \"dropping by teaspoonfuls\" as instructed, doesn't give enough body to keep the macaroons together. I also had to keep putting the macaroons back in the oven to cook more than 10 minutes. If I use this recipe again, I'll know how to do it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy recipe, although I found that refrigerating the mixture for a couple of hours, then rolling into balls, and flattening them a little helped them to stay together. Also, I used Reynolds' Release Nonstick foil which worked wonderfully to keep them from sticking to the foil. I also upped the temp to 375 degrees after testing a first batch at 350 for 10 minutes (not crispy enough for me). Ten to twelve minutes seemed to be the right amount of time. I also immediately removed the cookies from the foil-lined sheet onto another sheet of Release Nonstick foil, which made for easy removal when cool. Very rich and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MURROW5"
},
"reviewBody": "The flavor was very good but they didn't stick together well. Yummy but hard to serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WhatADish"
},
"reviewBody": "Very easy to make, sweet and tasty. I love how simple they are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first attempt at macaroons. Delicious! Very easy to make. Since I was out of vanilla extract I subbed it with maple syrup and it worked out perfectly! The bakery down the street makes wonderful macaroons at a buck a piece! Thanks Robin for saving me tons of money by sharing this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food Fanatic"
},
"reviewBody": "Such a simple recipe and great flavor! I divided the batch up and baked one right away, and one batch the next day after being refrigerated, and noticed a huge difference. The refrigeration helped to prevent the macarooons from spreading too much. I baked until browned around the edges as well as toasted on top. Another suggestion-dip in chocolate laced with orange zest. YUMMY!! Will use again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "NEBCOOK"
},
"reviewBody": "Very tasty but had to scrape them from the greased parchment paper with a spoon, really wished I had read more than the first page of reviews before making to see that there were some problems with them. Followed the recipe exactly and none were able to be picked up and eaten, too gooey, probably won't make them again..."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10344/coconut-macaroons-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17019/desserts/cookies/macaroons/",
"name": "Macaroon Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10344/coconut-macaroons-ii/",
"name": "Coconut Macaroons II"
}
}
]
}
}
, "about": [
]
}
]