				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coconut Curry Tofu"
,"datePublished": "2002-01-07T10:02:14.000-05:00"
,"dateModified": "2022-10-11T13:39:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "kath"
,"url": "https://www.allrecipes.com/cook/3417220"
}
]
,"description": "This exotic dish is easy to make, and blends the exciting flavors of ginger and chile paste with fresh vegetables in a creamy coconut milk base."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rjnWFkjUrYvX3QZrJ1UCUGoFbPo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4x3-KH_063022_AR10871-e1577dc3eab84379a05ba5f31fa90961.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coconut Curry Tofu"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "737"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "232 kcal"
,"carbohydrateContent": "17 g"
,"fiberContent": "5 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "680 mg"
,"sugarContent": "5 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 bunches green onions",
"1 (14 ounce) can light coconut milk",
"0.25 cup soy sauce, divided",
"0.5 teaspoon brown sugar",
"1.5 teaspoons curry powder",
"1 teaspoon minced fresh ginger",
"2 teaspoons chile paste",
"1 pound firm tofu, cut into 3/4 inch cubes",
"4 roma (plum) tomatoes, chopped",
"1 yellow bell pepper, thinly sliced",
"4 ounces fresh mushrooms, chopped",
"0.25 cup chopped fresh basil",
"4 cups chopped bok choy",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Remove white parts of green onions, and finely chop. Chop greens into 2 inch pieces."
} ,{
"@type": "HowToStep"
,"text": "In a large heavy skillet over medium heat, mix coconut milk, 3 tablespoons soy sauce, brown sugar, curry powder, ginger, and chile paste. Bring to a boil."
} ,{
"@type": "HowToStep"
,"text": "Stir tofu, tomatoes, yellow pepper, mushrooms, and finely chopped green onions into the skillet. Cover, and cook 5 minutes, stirring occasionally. Mix in basil and bok choy. Season with salt and remaining soy sauce. Continue cooking 5 minutes, or until vegetables are tender but crisp. Garnish with remaining green onion."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cereal4dinner"
},
"reviewBody": "I thought this recipe was great! I ran out of curry powder after 1 tsp so I added a tsp of cumin and a little extra soy sauce. I subbed baby portobello mushrooms for the button mushrooms, cherry tomatoes for roma, and without fresh basil, I had to use dried. Fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Goodknight"
},
"reviewBody": "Absolutely delicious and healthy dinner! It's very versatile and can be modified to fit your preferences. I didn't have fresh tomatoes or peppers, so I used sundried tomatoes and tomato paste. Also tossed some garlic and chopped yellow onion in there. I used red curry paste and sprinkled in some coriander just because I love it in curries.. oh, and regular coconut milk because I wanted it to be creamy. I'm sure this would have been gorgeous exactly as written, but as you can see it's the type of recipe that's forgiving to changes, however, I'd try not to omit the fresh basil- it truly elevates it. This was heavenly spooned onto warm garlic naan but it would be just as incredible on a bed of Basmati rice, which I'm already looking forward to for lunch tomorrow. Thanks very much for a recipe I'll enjoy often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maureen medd"
},
"reviewBody": "great stuff. I didn't have boc choy so I substituted frozen, well drained spinach. I will be making this a lot. Looking forward to using boc choy next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmayael"
},
"reviewBody": "I made this recipe and me and my husband loved it. I didn’t have much of the vegetables such as the tomatoes so I substituted with zucchini and also added onion and spinach. It came out delicious! Ohh and also added a bit of honey to make the sauce a bit sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patrick Babin"
},
"reviewBody": "Don’t throw away the white onion pieces! They are garnish. I couldn’t find fresh basil so I used 3 table spoons of dried because it’s all I had. Turned out yummy but I did sprinkle a little more salt. I could handle more chilli sauce to but I like it spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "corahh"
},
"reviewBody": "I started this recipe then discovered my tofu was frozen. I substituted chickpeas for tofu. Also had some fresh vegetables that I needed to use so added green beans chopped to 1 inch long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth Sassoon"
},
"reviewBody": "Love this recipe. Reading other people comments I'll fry the tofu first next time so it stays firmer. Will also add a bit more curry. I didn't have bok Choi so used green cabbage and still came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Rosenberg Miller Mess"
},
"reviewBody": "I liked the recipe, but it needed some sweetness so I added brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara McLaughlin"
},
"reviewBody": "I made this recipe once and followed the instructions to the T. I did add bamboo shoots though. This recipe is flavorful and the lite coconut milk makes it lower in fat, however, the sauce is really watery. If I made it again I would definitely want to add something to thicken the sauce, whether that is full fat coconut milk, arrowroot powder, flour or something else entirety, I’m not sure, as I haven’t experimented with this recipe yet. I would also add minced garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kjggx2"
},
"reviewBody": "Perfect just as is. I did use extra firm tofu and pressed for about an hour prior to cubing. Making a double batch next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allicia Boutte"
},
"reviewBody": "I love the delicate coconut sweetness in contrast with the heat from the Chile paste. I made one adjustment, I omitted the tomatoes. In my opinion, tomatoes would taken this Thai infused dish into another direction. I can't wait to share this with my friends. I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Psaledakis"
},
"reviewBody": "The first time I made it I followed the directions and I liked the way it came out. The second time I only had chicken and no tomatoes. I added 2 tsp. of fish sauce and about 2 tsp. of chili paste also. And I added soy sauce to taste but not as much as was called for. My kids really liked the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "alex"
},
"reviewBody": "Awful just awful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deb"
},
"reviewBody": "Great recipe, cleaned out the fridge and can’t stop snacking. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Hirsch"
},
"reviewBody": "I think it would be richer with whole coconut milk, but did not make the change. It was very tasty even without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elya Gutkovsky"
},
"reviewBody": "The recipe turned out a bit bland so I had to add more salt and doubled the amount of curry paste and brown sugar. Was pretty good after that. Don't expect a creamy consistency, too many veggies and tofu water down the broth. Overall a pretty healthy meal. I prefer a creamier curry personally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Council"
},
"reviewBody": "We gotta tired of trying to figure out what meat to eat and adding tofu was something we liked with korean food so we thought we would try this... Flavors did not disappoint. We were nervous because we have never cooked with tofu before but found this to be excellent..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "We really, really liked this one! Didn't change anything, but next time I'd drain the tofu better so that it holds its shape better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Declan"
},
"reviewBody": "I just made this recipe and it tastes amazing coming off heat, I’m sure it’ll be even more so once it has sat in the fridge for awhile. As others have described, I squeezed out the water in the tofu overnight using paper towels, 2 plates, and another container on top. I then baked the tofu in oven using an oiled aluminum foil lined baking pan on 400F for 20 minutes, flipped, then another 15 minutes, which made them nice and crispy. I made several substitutions and revisions to the recipes, the main changes were: 1) I cooked the onions first, added 3 cloves of minced garlic, then the rest of the veggies, then the liquid, in order to bring out the aromatic flavors better; 2) I used spinach instead of bok choi; 3) for the chili sauce I used Sriracha sauce, and added 2 diced Anaheim chili peppers for even more of a kick; 4) I used 1T total of salt; 5) I used full fat coconut milk from Thai Kitchen brand; 6) I doubled everything. Cheers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristyg"
},
"reviewBody": "Outstanding. No leftovers. I served over basmati rice made in rice cooker with a Not Chick’n cube. I left out bok choy but plan to add either green beans or spinach the next time. Also will try some of the reviewers methods for drying/firming tofu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claypool Felix "
},
"reviewBody": "Easy to make and perfectly bright curry packed with flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brookexox"
},
"reviewBody": "Next time we will try adding a bit of cornstarch to thicken the sauce. Regardless, it was delicious and simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lourdes"
},
"reviewBody": "Delicious as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "Easy, healthy, and delicious. I usually find tofu to be a terrible addition to any recipe, but this wasn't too bad at all. Also the non-tofu parts were awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Plotts Kinnon"
},
"reviewBody": "Yum, yum, yum! I used a full 8oz mushrooms and full fat coconut milk, but otherwise followed the recipe exactly. It was delicious - a great addition to our plant-based repertoire!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Whitney Milburn"
},
"reviewBody": "Very good, and yes, it's spicy - which I love. Only tweaks I made were: I used Lite Coconut Milk, and spinach instead of cabbage. I also removed about 1/8c. of the hot broth, dissolved a Tablespoon of corn starch in it, then re-added it to the sauce, to thicken. I like to do this often in many dishes I make. Gives a slight silky texture. Used another reviewer's tip and pressed the tofu, then sliced it and popped it in the oven (170) for about 25 minutes. Was nice and meaty when done. I made wild rice with this dish but clearly jasmine rice would have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Baldschun"
},
"reviewBody": "Easy to put together and very good. Added a small zucchini sliced on the bias and served over basmati ric. Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca V"
},
"reviewBody": "What I love about this recipe is that its so adaptable! Made several substitutions, using what I had on hand. But as long as you have the tofu, coconut milk, and some spices and veggies, you can make it work. If my husband will eat tofu and ask for seconds, it must be good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Ojeda"
},
"reviewBody": "I was a little nervous about the spiciness of this recipe, but OMG it was delicious. I'm not big on spicy foods and although it definitely cleared the nasal passageways, it was hardly spicy. (Could have been the type of chili paste I used - Idk). \n\nThis was my first time cooking with a lot of these ingredients. I followed everything basically to a T, but I did use green pepper instead and the store didn't have fresh ginger so I bought a paste as a substitute. No basil either. I, also, browned my tofu in olive oil over high heat before adding it to the mix and then I served it over brown jasmine rice. SOOOOOOO YUMMY! \n\nThank you so much for sharing this recipe. I will continue to make it again and again and again and again...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anj"
},
"reviewBody": "I made it my own way. I added garlic, ginger, and dried red chilies. I sautéed that with the mushrooms then added the curry, sautéing for a few more minutes. I then added the coconut milk and brought it to a boil. I added some frozen broccoli, cauliflower, and carrots and cooked for 10 minutes. I then added bok choy and kale and cooked for 5 more mins. Delicious. You can use whatever vegetables you want as it does not have to be the exact ones as stated in the recipe. Drain the tofu, wrap in paper towel, and put a weight on it for one or more hours. Brown the tofu using a bit of cooking spray or coat the pan with olive oil (it's healthier than frying) Tofu done using this method tastes better in any vegetarian dish as the texture is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Excellent flavones"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geneen Massey"
},
"reviewBody": "I made this with smoked tofu. Yummm. It's a bit runny, so seems best served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqui Galik"
},
"reviewBody": "Much better than I expected! I wouldn't change a thing. Spicy, but not too much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Clark"
},
"reviewBody": "Prepared just like the original recipes. Delicious! Perfect consistency to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Max75"
},
"reviewBody": "It was good but not spicy enough for my taste. I would add a bit of fresh red chile to give it some kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Lang"
},
"reviewBody": "Doubled the coconut milk and made it into a soup. We loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovefood"
},
"reviewBody": "This meal has lots of great flavor! I've cooked it several times and used chicken and tofu, both were great. It is also fantastic as seconds for another day. Although, it's so good if I plan to have left overs than I need to double the recipe because I tend to pick out the first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha"
},
"reviewBody": "I'm not a big fan of tofu but my son has decided to go vegetarian so I gave this a try. We both really liked it and the tofu was actually a nice change from meat, and a LOT cheaper. Bonus! Thanks for the recipe, will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracycarnes1"
},
"reviewBody": "Excellent! I have been looking for any recipe made with tofu, that tastes really good. This is a keeper. I followed it. I worried about the sauce being enough, so I cooked it with the lid on the pot. There was plenty of sauce. I can't wait to try it tomorrow for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joleanek"
},
"reviewBody": "The first time through a recipe I stick to the text. This one was easy, and it did not disappoint: layers of exotic flavors! I know we will continue to use this one, but I can easily see adding pineapple chunks into the mix! I served it over jasmine rice, and will try it over brown or brown jasmine for better nutrition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "awelker"
},
"reviewBody": "I've made this recipe many times, and my family loves it. It isn't a 'hot' spicy dish as is, but very flavorful. With and without rice, tomatoes, ginger, basil-I've gotten many compliments. The hardest part about making this is the food prep."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allyson "
},
"reviewBody": "I loved this. The sauce is rich and well balanced. It would be versatile with meats, fish and veggies. I made it as written. Yummmmm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquie"
},
"reviewBody": "Yum! I will make this one again. I pressed some liquid out of the tofu by putting it in between 2 cutting boards with a water jug on top for 30 minutes (I got this idea from another commenter). I then coated the tofu with flour and fried it in 2 TBLS of sesame oil until it was crisp. I kept the tofu and other ingredients separate until the last minute so that the tofu wouldn't get too soft. I served it with rice and enjoyed it as much as some of the other Asian food I ate while living in Asia. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne"
},
"reviewBody": "Very good;I did choose to brown the tofu and mushrooms before adding the sauce to the skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "esther"
},
"reviewBody": "This was tasty! Didn't have the bok choy, so we added extra pepper; added tomatoes later so they wouldn't cook down so much; added a tsp of corn starch dissolved in cold water at the end to thicken the sauce; no chili paste, so we used a tsp of chili sauce; and sliced the tofu in 1/2\"x 3/4\"x 3/4\" pieces (we prefer tofu with more seasoned surface area). Nice and saucy... Served it over rice. Ate the very little bit of leftover in a wrap with a few tablespoons of guacamole for lunch today... Odd combo, but delicious! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christaandcaleb"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maricel Edwards"
},
"reviewBody": "This is uh-mazing! The flavors are spot on and rich and truly satisfying - no anemic blandness here. I used spinach instead of bok choy because that's what I had on hand, as well as tossing in some cauliflower for some added crunch. A definite keeper, especially served over roasted cauliflower rice. I may just go vegetarian if I can find more recipes like this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Davis"
},
"reviewBody": "I added chicken and tofu to mine and it was amazing!! It's very light and flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IcuRN"
},
"reviewBody": "Very yummy. I added extra chile paste for spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "danyelle"
},
"reviewBody": "This was just okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kumi Taylor"
},
"reviewBody": "I love this! I didn't make many changes at all, it's delicious and bursts with flavor. Great over steamed rice. I will definitely make this a part of my rotation! The only thing is, I didn't have chili paste so I was concerned but it still turned out great without it. I don't have a lot of time to cook so I just threw all the veggies in my processor. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VL"
},
"reviewBody": "I love this!! Such a luscious blend of flavors!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Dawn"
},
"reviewBody": "Really tasty! I am trying to incorporate more tofu dishes into my diet and this will definitely be one I make again and again. Sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Watson-Senior"
},
"reviewBody": "Delish. I recommend you to try. I don’t add all the chili paste. About 1/8 t. My husband doesn’t like spice. I love spice, but, it bothers him when too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmyllyLace"
},
"reviewBody": "Healthy &amp; wholesome. A perfect comfort meal for cold weather. It is a very balanced vegetarian dish that satiates any carnivore &amp; non-curry eater. All ingredients are easy to find. Easy prep work &amp; cooks in minutes. Pour over brown rice. Had no difficulty cooking this recipe for the first time. Turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "Surprisingly tasty although I had to use more curry paste, but I love my curry strong! You wouldn't notice it is vegetarian!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gvc"
},
"reviewBody": "Delicious! This recipe is so easy to make. I made it with the veggies I have on hand , kale, carrots, celery, onions and it was still tasted good. I wind up adding pork meat. I sauteed the pork with the veggies and boil the coconut milk with the other ingredients in separate pot. Then i poured boiled coconut milk over sauteed veggies, meat &amp; tofu and let it boil. My daughter really loved it. But i prefer fried tofu's texture. So next time I'll fry the tofu first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark E Morley"
},
"reviewBody": "This was perfect just the way it is written. Both me and my mom loved it. It is simple to make. I also drained the Tofu and let it sit to get the liquid out of it. Next time I would use full Coconut Milk instead of the light so the sauce would be thicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mem"
},
"reviewBody": "Very tasty and easy to make. I had to use up some chili peppers from the garden so added them as well. Made it very, very spicy but extremely good. I didn't add the sugar (personal preference). Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjc_cooks"
},
"reviewBody": "This is a very easy, quick recipe that tastes pretty good. I use pressed tofu, which doesn't fall apart and has a texture that I like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Azure Wilson"
},
"reviewBody": "I made this exactly to recipe, except that I only had one bunch of green onions. I thought that the flavor was pretty good, but I agree with the other reviewers that browning the tofu would help. I also think that I might sub some of the soy sauce for fish sauce next time, as I think it would give the dish a more complex flavor. Using plain curry powder, I thought the flavor profile was a little flat. Yes, lots of flavor, but it didn't seem well rounded to me. Perhaps using a Thai curry paste might also bring in some different tones. However, I went back for seconds, so it's definitely a recipe I want to work with again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lenny_apple"
},
"reviewBody": "I really like this recipe. Instead of bok choy, I used rainbow chard. Next time I will try the recipe with less soy sauce; I think 3 tablespoons will be enough. I used 1/4 cup like the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "A little bland - could use some more spice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Petunia"
},
"reviewBody": "Great recipe. I decided to make it the day before so the flavors could meld together. After reading the comments I'm glad I did. The kitchen smells wonderful. I did add garlic though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DaJung"
},
"reviewBody": "Like many others, I substituted spinach for bok choy. I also added twice the amount of mushrooms. What a delicious recipe. Thank you so much! Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherLilly"
},
"reviewBody": "This was delicious. We had to make a few minor changes based on the season and what we had at hand. We used red curry paste instead of powder, sirachi chili sauce instead of paste and added a couple of diced thai chili peppers, and canned diced tomatoes instead of fresh since it's still winter and I can't stand greenhouse tomatoes. We loved it. Can't wait to make this in the summer when we can use fresh tomatoes, peppers, and thai basil from our garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chayalang"
},
"reviewBody": "Excellent. Followed the recipe exactly. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Ann LeSage"
},
"reviewBody": "Great flavor, great texture. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rudysmom"
},
"reviewBody": "Awesome! Love the kick and all the flavour! Going to try it with some Salmon next time instead of tofu. Think it will rock. Big thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew"
},
"reviewBody": "I made my own tofu for this and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ameeadora06"
},
"reviewBody": "I wrapped the tofu in paper towels and sqeezed dry under cutting board for about 15 minutes, then baked my tofu pieces on each side at 400 degrees, until I reached the firmness I wanted. When all was said and done, I found that the sauce was bland. In a pinch, I grabbed the good ol' ketchup bottle and gave it a good squeeze, probably at least 2 tablespoons, mixed and found what I was looking for. Good base recipe to evolve your personal tweaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "monie389"
},
"reviewBody": "I wanted to love this but didn't. Tasted more like an Indian curry dish more than anything. Couldn't taste the coconut milk at all. Just my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie Moulton"
},
"reviewBody": "Made this with spinach and curry paste instead of powder and skipped the chile sauce to make it milder for the kiddos. Served over rice it was very good. The sauce was thin, but could be easily remedied with a little flour, or boiling down for longer. I would recommend pressing your tofu, it lends to a better texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dessert lovver"
},
"reviewBody": "Good. Didn't have all the ingredients but still came out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CStar"
},
"reviewBody": "I thought this was an easy curry to make, as it was my first curry recipe I have tried! I loved the bok choy in it, as well as the fresh basil. I found it did not have as much \"coconut milk\" taste as I like and being a spice wimp I actually would make it a bit spicier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "somersun"
},
"reviewBody": "Very tasty! I would use less peppers next time, but it's just a personal preference. The sauce was the best part of the dish and I will be doubling next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GravyBabyMama"
},
"reviewBody": "I made this for dinner tonight and it was DELICIOUS! I used fresh spinach instead of bok choy since it's what I had on hand. For the chili sauce I used one teaspoon of Siracha and one teaspoon of crunchy garlic chili oil from the asian store. So good! It had the right amount of kick and the mellow flavor of the coconut milk balanced it all out. Great healthy vegan dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sls035"
},
"reviewBody": "I don't give many reviews but I have to on this recipe. It was absolutely amazing. Flavors were great and easy to make. I served it with Jasmine rice and it was a perfect meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mags"
},
"reviewBody": "This dish was flavorless and watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MeAspiringCook"
},
"reviewBody": "Love this! Good flavor, easy to make. Even my 4 year old, who is in a \"spaghetti &amp; watermelon only\" phase, ate this, though she did tell me it was a little spicy (I'd cut down on, but not eliminated, the chili). And for the grown-ups in the family, it was a complex enough flavor that it satisfied :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Hamlin"
},
"reviewBody": "This recipe is awesome. I doubled the sauce and added extra chili. I highly recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "graceismine"
},
"reviewBody": "Loved this! I followed most of the directions. However, I drained, diced my tofu, and then placed it on a cookie sheet in a 175 degree oven for 30 minutes. I then browned it in a pan with coconut oil to give it a nice crispiness. I didn't add tofu into mixture until I added the bok choy. I used Curry Paste in place of curry powder. We also love spicy foods, so I added about 1/2 TB sriracha sauce. Served over Jasmine rice and it was delicious. We are not vegetarians but like to eat vegetarian a few times a week. This is a definite keeper recipe that we both loved. You can easily tweak it to your liking. Thank you very much for sharing! :O)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Wilson"
},
"reviewBody": "This is a foolproof recipe that has great flavor and makes for fantastic leftovers! Don't leave out the bok choy...it adds a lot to this dish. We left out the chile paste and used green or red curry paste instead, and added a bit of chile powder...great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tharrah"
},
"reviewBody": "I followed the recipe exactly and it was delish! I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherZ"
},
"reviewBody": "I made this and it was delicious. I cut my tofu into little triangles and dry fried it a bit before making the recipe to try to improve the texture a little and it didn't fall apart as bad as it probably would have. I used regular coconut milk instead of light and a pinch of dried basil instead of fresh because its what I had. Otherwise, followed recipe exactly. It was delicious over jasmine rice! Would definitely make again:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Delicious recipe! Just the right amount of heat and flavor. Make it as written except I browned the tofu in a thin layer of oil over med-high heat prior to adding. So scrumptious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cookie_cooker"
},
"reviewBody": "This recipe had such high reviews that I was super excited to try it, but this was a fail for me... If you make it I suggest the following (which I didn't do, but wish I had) 1) stir fry the veggies and spices in one pan 2) bring the wet ingredients to a boil in another pan with a little corn starch to thicken the sauce 3) double or triple the ginger and brown sugar 4) use less than half of the soy sauce and leave out the salt. I also wrapped the tofu in paper towels and placed a weight on top of that for 1 hour to firm it up a bit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Brant Goose"
},
"reviewBody": "I made this but i dipped the tofu in egg, cornstarch, sugar and deep fried. I only used 1 bunch of green onion, and chopped it all up fine. Than used 2 heaping teaspoons curry powder instead. Didn't bother dividing the soy sauce. A 1 heaping brown sugar and 1/2 teaspoon of brown sugar, i like sugar. Didn't have chili paste or tomatoes so i used 1/4 cup tomatoe sauce and 2 teaspoons hot sauce. Don't add hot sauce if your curry is \"hot\" already, i added the hot sauce to my mild curry powder. Didn't have bok choy so i used mostly the white crunchy part of lettuce. The leavy part you can save for salad, serve on side. Didn't have yellow pepper. Used a couple teaspoons of black pepper instead. Didn't have mushrooms so i used red kidney beans instead. Didn't add any basil. Didn't use any salt. It was extra saucy, first bite seemed spicy but it's so good and full of flavor so i served it over rice, soaked up the extra sauce. NO LEFTOVERS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JoeyPrice"
},
"reviewBody": "I really don't understand how, but this recipe came out very bland. I didn't make any changes other than searing the tofu and was very surprised at how little it tasted like...well, anything. I guess that is not exactly true, each bite tasted enough like Thai curry at the start to get me excited, then *poof*, flavorless. I'll try one more time, maybe with more curry powder and chili paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nawal F"
},
"reviewBody": "I used the curry as a base, then added tofu and other vegetables ...perfect taste.\nMy family enjoyed, and my daughter who is a Thai food lover asked me what restaurant I ordered my curry from?!!!\nThanks for the recipe Kathy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "echalkley"
},
"reviewBody": "I changed all the veggies (only had a bag of frozen zucchini and peas, 1 can diced tomatoes, and 1 carrot). I hate soy sauce in curries and subbed in fish sauce (only ~2 tbsp). I realize this makes it less vegan, but meh. I also doubled my curry powder and put in my Vietnamese chili garlic sauce instead of chili paste. Despite all the changes, this came out really tasty and could definitely point newcomers to curry in the right direction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penguanne"
},
"reviewBody": "My non-vegetarian husband loves this dish! It's extremely flavorful, with a great blend of seasonings. A definite repeat recipe. **I couldn't find chile paste, so I got red curry paste for a substitute. It tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZeldaSayre"
},
"reviewBody": "This isn't the weirdest AR curry I've made - that honor goes to Keon's Slow Cooker Curry - but as I was putting it together, I still thought, \"Seriously?\" Coconut milk, yes; curry powder, yes; soy sauce, yes. Any two of the three, absolutely. All three together? Whoa, that's weird. The combination is a little different than anything I've had before - simultaneously both Indian-ish and Thai-ish, as you'd expect, but you know what? It's good. And really easy. And really good for you. I can definitely envision swapping the curry powder for Thai curry paste sometimes, but it's totally good as written. I had to play with the veggies a little; my pepper was mushy, and my store didn't have bok choy. I used half a bag of shredded red cabbage and some celery instead, which worked just fine. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "usnwife20"
},
"reviewBody": "I made this last night for my husband and I. He is a curry fanatic, he said it was a very good base for curry, he just wished that it was hotter. SO next time I will add 2 tablespoons of chili paste. The only thing I did differently was I used regular coconut vs light. I don't do \"lowfat\" things, especially since you can take the can of regular coconut milk, take half of it, mix it with water... wahla!! Light! And you get more bang for your buck! This is a pretty great vegan recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StrawberryJam"
},
"reviewBody": "Tantalizing spice buffet for your taste buds. This is pretty yummy. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alissa Wied"
},
"reviewBody": "This was my second recipe I tried with tofu and really enjoyed it! I didn't have bok choy on hand, so I used another reviewer suggestion of using spinach and only used about 2 cups. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristie"
},
"reviewBody": "This was a very easy, yummy recipe. My whole family loved it, even my picky daughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessielee"
},
"reviewBody": "Very good and easy to make- I suggest adding a little extra salt, and red pepper flakes for those that like it spicy!! We ate this with rice, but it's hearty enough to eat without. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah"
},
"reviewBody": "Wow, this is delicious! I used super-firm sprouted tofu, which I cubed and pan-fried beforehand to give it a crispy \"skin.\" I set it aside and added it to the dish at the last minute to prevent it from getting soggy. Omitted the mushrooms (boyfriend doesn't like) in favor of extra tofu, and used fresh spinach instead of bok choy because the selection at the supermarket looked a little sad. I could only find regular coconut milk, but I think the extra creaminess was worth the calories! Served with steamed rice, this was great!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/45688/coconut-curry-tofu/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
"name": "Cuisine"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/45688/coconut-curry-tofu/",
"name": "Coconut Curry Tofu"
}
}
]
}
}
, "about": [
]
}
]