				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Coconut Macaroons German Style"
,"datePublished": "2020-06-18T23:13:15.000-04:00"
,"dateModified": "2020-06-18T23:13:15.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MOTTOS"
,"url": "https://www.allrecipes.com/cook/357154"
}
]
,"description": "Kokosmakronen, the German style macaroon. These are more of a meringue cookie. A must for the Holidays."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/giB2yisNrpbLjq4t9H__HCLGXgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27517-d93e164ac8ec4020aa04aeeb31ebe76a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Coconut Macaroons German Style"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "81"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "49 kcal"
,"carbohydrateContent": "9 g"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "22 mg"
,"sugarContent": "8 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2.75 cups flaked coconut, toasted",
"4 egg whites",
"1 cup white sugar",
"1 teaspoon ground cinnamon",
"0.5 teaspoon almond extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 250 degrees F (120 degrees C). Line cookie sheets with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, whip egg whites with an electric mixer until stiff enough to make a mark through with a knife. Gradually sprinkle in the sugar, cinnamon and almond extract while continuing to mix on low speed. Fold in toasted coconut by hand. Spoon or scoop onto the prepared cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake for 20 to 25 minutes in the preheated oven, until cookies are dry and peel of the paper easily. Cool on wire racks and store in an airtight container at room temperature."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Smith"
},
"reviewBody": "I love this recipe! Every time i make it, it is a huge success , and so well loved by all.. Thank you for submitting this/sharing this recipe! I've always made it exactly as the directions state, except this time i am out of Almond Extract and used Lemon..It is delicious! One thing though, if using anything other than almond, keep in mind, a little goes a long way! Mine are quite strongly lemon, lol..Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Llianne"
},
"reviewBody": "These are very easy! If you prefer a definite coconut flavour try subbing in coconut extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Benita Diakow"
},
"reviewBody": "Made these for Christmas, followed recipe but used oblaten. Came out perfect! Tried to add photo but it won't let me, your loss! Lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Nunez"
},
"reviewBody": "These are really yummy. The next time We make them, I plan on adding a healthy pinch of salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zubeida Shariff"
},
"reviewBody": "They turned out great I didn't have shredded coconut instead had the almost powdered one used it and tasted great. The only thing I will do different is bake for 5 more minutes to get them crispier. I did bake them again for 5 more minutes and like them more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Madeline"
},
"reviewBody": "Overall, it was a great recipe. I actually ended up halving it due to the fact that I only needed around 16 (I only had enough mixture for 12, however). I made it to share with my German classmates at a small party. Huge hit; they were all gone within a time span of 5 minutes. Even my German teacher liked them! \n The only problem I had was that the mixture was quite runny. The egg whites would not solidify, however I believe that it was because I did not add as many egg whites as the recipe originally called for. \n As a side note, if you want your coconut toasted quickly, place it in the oven and broil it for a few minutes. Be sure to keep a close eye on it however; it finishes in less than 3 minutes time. \n I would definitely recommend this recipe. However, I would say just stick to the recipe exactly. Besides, they'll all be gone before you know it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "antsy"
},
"reviewBody": "These turned out a sticky, but very tasty, mess. Tastes like coconut rice crispie treats. I tried cooking last batch a bit longer... but in the end, they all turned gooey. I'll give em another go at some point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cyndi Kirkpatrick"
},
"reviewBody": "I would decrease the sugar by at least a quarter - they were very *very* sweet. Otherwise, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KANDIYOHIV"
},
"reviewBody": "Since it was specified whether to use unsweetened or sweetened coconut I tried two batches and used one of each. Sweetened has better texture but is too sweet. Also, I cooked mine for 27 minutes (past what the recipe suggests) so took them out but I still think they could have used more time in the oven. They're still kind of loose in the middle and fall apart too easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladybug"
},
"reviewBody": "My family and friends love this \"Coconut Macaroons German Style\" recipe! I have made it at least a dozen times. Thank you MOTTOS for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia Arrowood"
},
"reviewBody": "I did not add the cinnamon to this batch of cookies. I am baking them at 250F as directed in the recipe and will see how they turn out. I did not put parchment paper on the bottom of the cookie sheet, just buttered the sheet really well. I am going to do this recipe again but will use a mixture of ground hazelnuts and almonds. Again, no cinnamon, just the almond extract. I just love the fragrance of almond extract. Happy to report that I baked them at 250F for 20 minutes and there was absolutely no stickiness. I did not do the parchment paper, just buttered the cookie sheets. These are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMIMAC"
},
"reviewBody": "These were very easy to make and very good. Made them for my son's German class and they were a hit. My son already requested I make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kbatten1989"
},
"reviewBody": "SO YUMMY! I toasted in oven- using low broiler for 5 mins just to give a really sexy golden brown color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carollrar"
},
"reviewBody": "These are the kind I love. A few changes: toast coconut at 300 and stir after ten minutes, repeat. Don't get darker than beige. If you usually keep sweetened coco, you need half of less sugar. If you like them very crisp as I do, bake at 300 and watch carefully after 20 min and take one off when you think they look right and try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amysue"
},
"reviewBody": "Love these cookies! So easy for a non-baker like myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen R"
},
"reviewBody": "This recipe worked perfectly the first time! And it's raining outside. This is definitely a keeper. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "njj"
},
"reviewBody": "good flavor - cinnamon really adds a nice taste. Crumbled too easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowpens"
},
"reviewBody": "Very nice and easy to make. It was a bit gooey and soft in the middle, but I like it that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "leahturtle"
},
"reviewBody": "I followed the directions, but they came out so sticky!! I wouldn't consider them a cookie anymore. The taste was good though..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twink"
},
"reviewBody": "Great easy recipe, that is now a new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "madamemagpie"
},
"reviewBody": "Mom and I were looking for a wheat and starch-free macaroon and came across this one. We deleted the cinnamon and used vanilla instead of almond extract for a regular sort of macaroon. \n\nThe parchment is absolutely necessary we found out. We thought that greasing the Air-Bake cookie sheets with butter would do the trick, but the cookies stuck anyway.\n\nFabulous cookies. And wonderful with home-made chocolate icing :) The crumbly bits we scraped off the cookie sheet went great on caramel ice cream, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aunt Stace"
},
"reviewBody": "These were delicious fresh out of the oven. Not so great the next day though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mimip1903"
},
"reviewBody": "maybe i did something wrong. my friend was there when i made them and they just didn't harden. they were mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lbencho"
},
"reviewBody": "These cookies are really good, but mine were REALLY sweet. I followed the recipe exactly, but the cookies did need the full 25 min and usually at my altitude things cook faster than the suggested time. They would be 5 stars but they were too sweet. Next time I'll try unsweetened coconut or cutting down the sugar or both."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MariaSK"
},
"reviewBody": "I'm not sure what I did wrong, but we didn't eat these. They seperated in the oven, becoming watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "These did not remind me much of my German family's coconut macaroons. They were appallingly sweet...perhaps it was because the shredded coconut I used was the sweetened variety. The recipe doesn't specify. Still, my 12-year old son liked them. The baking time is much longer than the recipe calls for, I found...probably closer to 35 minutes. A long wait and little reward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kalynn Sinnamon"
},
"reviewBody": "Yum yum came out perfect! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karen Pardee-Kasperek"
},
"reviewBody": "These were really unacceptable!!! I tried cooking at both temps (250 and 350). I live in Colorado with no humidity and they were really goooooy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I love baking!"
},
"reviewBody": "These were good and more like a meringue with coconut. They were very light and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel P"
},
"reviewBody": "EXCELLENT! Made these for my gluten-free husband and we both loved them. The almond extract, cinnamon and coconut are a great combo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaylex85"
},
"reviewBody": "OMG I thought these sounded familiar so I decided to make them. Once they came out of the oven and I smelled one I knew exactly what it was. My Oma (grandmother in german) makes these every year for xmas!! I can't believe I made them and they were so easy! This is a recipe I will treasure forever as my Oma has. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danedame"
},
"reviewBody": "These cookies are just delicious. The only problem I had was that I must have made the cookies too large because they didn't \"dry\" enough. Some were very gooey on the inside but we managed to consume them in spite of it! I will absolutely be making these again but with some changes... Instead of 1 teaspoon of cinnamon I'm cutting it back to 1/2 and instead of using 1 cup sugar I'm going to cut back to 1/2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda McAnulty"
},
"reviewBody": "Just made these today for husband to take to work tomorrow and already 1/2 are gone! These are AWESOME! I'll be making another batch tonight! Followed recipe to a T!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pandora"
},
"reviewBody": "I really like the flavor of this cookie. I did bake them at 350 like other suggested except it took longer in the oven for them to become golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELT829"
},
"reviewBody": "I have never eaten a macaroon, let along baked them, so I had no idea if they came out right. I thought they were a little on the sweet side, so next time i think I'll cut back on the amount of sugar. Shared them with friends and received rave reviews. I will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahK"
},
"reviewBody": "These light, tasty cookies were a hit at my office Christmas party and at home. These will definitely become a standard on my Christmas cookie trays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen B"
},
"reviewBody": "These worked out fine. I cooked them until stiff and then let cool down. They are good, just not wow. I love meringue and love coconut, so I thought these would be amazing, but I won't be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieBlair1979"
},
"reviewBody": "This is a simple, fool-proof meringue cookie. I piped these with a huge star and it worked well-- go fast though!! The fat in the coconut starts breaking down the egg whites rather quickly. If you're having problems, read any online tipsheet for meringues. They're really rewarding and fun!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Islander"
},
"reviewBody": "I used finely shredded unsweetened coconut and my macaroons came out dry at 20 min. The people that are saying that you need to cook these on a higher temp. to produce golden macaroons must not be toasting the coconut first because then they are golden when you start -- just keep that in mind if you do use the requested toasted coconut per the ingredient list. You probably want to do one or the other -- cook longer at high temp or toast beforehand, not both. I think I'll try this again using less coconut (since unsweetened is a bit drier) and since finer shredded coconut fills more space in the measuring cup. This had such good reviews, it's worth trying again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leo"
},
"reviewBody": "These cookies taste very good. All the flavours definately mesh well. Personally, they're a little sweet for my liking, but I'm sure that my boys will eat them up in no time. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aDashofThat"
},
"reviewBody": "Very good! Not to sweet, just right for everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "These cookies taste very good, but definitely need extra baking time, at least 10 minutes more otherwise they deflate the minute you bite into it. The cinnamon and almond with the toasted coconut is a great combination. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farah Malik"
},
"reviewBody": "i had been loking for this recipe for ages.in our country i didnt know what it was called lol! but now i know and will make it quite often.thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brinker1975"
},
"reviewBody": "These were pretty good and two-thirds of them were gone the first night. I used tin foil instead of parchment paper, which worked well as long as the cookies were completely cooled. I also baked them at least twice as long. This made them mostly crispy with a little bit of chewiness in the center. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IBTOUGH"
},
"reviewBody": "I'm giving this a 4 star simply because they were crumbly. The taste was a 5 star. I will make again to see if the crumbles happen again. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Filippone"
},
"reviewBody": "This recipe was PERFECT. Everyone who tried them was overly impressed with how soft and chewy they turned out. I dipped them in melted chocolate and sprinkled with some coconut flakes. Beautiful presentation, moist and flavorful... I can't ask for a more perfect coconut macaroon recipe =o)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicity"
},
"reviewBody": "Amazing! I'm on a very restricted diet and these were to die for! Although I have to agree with the other reviewers, it was much better baked at 350F for less time. (I did about 12 minutes) I tried both ways, and the first time at 250F they were mainly just meringe and crisp and totally white. At 350F they were slightly chewy inside and lightly browned and crisp on the outside. I did bake them on convection the second time. Overall amazing recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Wow. These were easy and yummy. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "After starting on the meringue portion of the recipe, I realized I only had 3/4 cup of flaked coconut!! I thought it would be a disaster, but I went ahead and tried to subsititute the remaining measurement with finely chopped almonds. I also didn't have almond extract so I used vanilla. And I had to adjust the cooking temp and times, probably because of my mistakes. Oh yeah, I also didn't have parchment paper so I used foil :) BUT...I was so pleasantly surprised that they actually came out GOOD! So, all this is to say that you can really botch up these cookies and they will still turn out! Next time, I'll try to make the cookies as directed and see what they're supposed to taste like, but just know that if you don't have the exact ingredients or measurements, they'll probably still come out ok!! Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IRISHDAUD"
},
"reviewBody": "Holy cow these are amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyrenee726"
},
"reviewBody": "These cookies are awesome! They didn't take long and I wasn't sure that I had done them right as they were sort of sticky on the inside. I worried that they may not be done. I read some of the reviews though and it looks like it's just a personal choice. Mine came out with a crunchy outside and chewy inside - they are super good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed this recipe exactly put the cookies kept sticking to the parchment paper and egg white kept seeping out of the cookie dough. They created a sticky mess and even after cooking them for another 30 min, they would not bake through. NOt one of the better recipes I have tried"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADY_ULALA"
},
"reviewBody": "Another favorite! I love the slightly crunchy outside and chewy of the coconut on the inside. Really good. I used sweetened coconut and cartoned egg whites. I did have to bake slightly longer to get \"golden\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "guitargirl576"
},
"reviewBody": "Absolutely delicious and so easy to make! I wanted them softer so I baked them at 350 degrees until they started to brown. Am making for Christmas presents!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Beth Ellenbogen Schopf"
},
"reviewBody": "I do not typically like Macaroons, but I am giving this recipe 5 stars because these were the best Macaroons I have ever had. I followed the recipe exactly with one exception. I reduced the amount of almond extract because I do not care for the flavor. My husband still loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn"
},
"reviewBody": "Very easy and good! I made half batch of these and half of the Chocolate Meringue Cookies - verdict was for the chocolate ones. So I melted some semi-sweet chips, dipped the bottom of the Coconut Macaroons and let them dry. Wonderful! Best of both worlds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tat"
},
"reviewBody": "This recipe is excellent as is. Baking it at 350 for less time until golden resulted in sticky cookies that really couldn't be eaten while keeping your fingers clean. I put them in for 12 more minutes on 250, and they turned out great. Macaroons are supposed to be crunchy, anyways. The almond extract adds an excellent flavor, and the cinnamon doesn't distract from the coconut taste at all. Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FATIMAGRRL"
},
"reviewBody": "This is a great cookie! I live in high altitude and it's raining outside and they still came out perfect. I let my mixer do all the work and they are light, crispy and chewy on the inside. Great flavor too! I'm bringing them to a german themed potluck and I think they will be a success. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WhatADish"
},
"reviewBody": "These are so good. I made them to use up 4 egg whites I had sitting in the fridge. Something went wrong, and they never really worked as a meringue, so I threw them out and started over with fresh ones. This recipe came together perfectly the second time. It was beautiful. I used unsweetened coconut, which was a wise choice. It would have been way too swee otherwise. I love the flavors of cinnamon and almond in here. The outside texture is a crisp meringue shell almost, and the inside is a chewy coconut macaroon. I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle Sims Roberts"
},
"reviewBody": "We had these at a German bakery and loved them, this recipe is very close to the bakery recipe. I made these for Christmas and everyone loved them. Very easy to make and wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Sweetman"
},
"reviewBody": "I love this recipe! It is so easy and quick. I have a spritz recipe that calls for 3 egg yolks. No unused egg yolks. Next time I won't toast the coconut quite as much. I used Almond flavoring. The coconut lovers in my family love these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wchrist"
},
"reviewBody": "This was pretty good!! Though it stuck to the wax paper, even though i oiled it. the cookies had a really nice coconut taste. i added some crushed walnuts and i think that made it taste even better. my grandma loved these, as she loves coconut. Ill make these again if i get ahold of cocnut, as they are yummy and healthy. =D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MaddogBabytooth"
},
"reviewBody": "These were very good and different. My product came out best when I followed the baking directions. They came out crisp on the outside and melted in your mouth. I also tried a higher temp. as recommended by others, but they turned out sticky that way. I used a two teaspoons to make them round and of equal size as I found that by dropping them onto baking sheets made them less predictable in stickiness. Overall, they were very good and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kimber Mc"
},
"reviewBody": "I followed the directions exactly, and these cookies were terribly sticky. Even after cooling, they were just a sticky mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNIEOSBORNE"
},
"reviewBody": "We really like these. My Celiac daughter loved having a yummy treat at Christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Hersey"
},
"reviewBody": "Made these since I had lots of leftover coconut from Coconut Cream Pie. I almost forgot about the toasted ones and was wondering why it wasn't a bit more.. thick. But that was my own fault. I'm working on a batch now, with one done and cooled. These are really, really good. Entire family likes them, even my brother who hates coconut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "M. Bliss K."
},
"reviewBody": "I baked these @ 350 degrees until they were lightly browned on top and then let them cool all the way. I wanted them to be a bit chewy and it worked! I thought they were phenomenal. It is best if you make them as small as possible. A drizzle melted chocolate is nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancy"
},
"reviewBody": "I was first scared to be the first one tried this recipe, but let me tell you it is so good, I did not toast the coconut as the recipe says, and did not add the cinnamon, so good,thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cmerun6"
},
"reviewBody": "I made these for my husband and other coconut lovers . This recipe is very easy to follow. The comments I have received from everyone is that it's a very light and tasty macaroon. I strongly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maximilliane"
},
"reviewBody": "Another way to bake them so thatthey stay soft and fluffy is to set the oven to 350 F and only bake the cookies for 5-6 minutes until they are slightly golden. They will still be a little bit sticky but that's ok They will loose their stickiness when they cool down."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/95782/coconut-macaroons-german-style/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
"name": "German"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/95782/coconut-macaroons-german-style/",
"name": "Coconut Macaroons German Style"
}
}
]
}
}
, "about": [
]
}
]