				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Collins Goulash"
,"datePublished": "2019-04-02T02:53:35.000-04:00"
,"dateModified": "2022-10-01T19:50:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Mary Smallwood"
,"url": "https://www.allrecipes.com/cook/4518703"
}
]
,"description": "This goulash recipe is what you need when the family is hungry and you have hamburger in the fridge. This tasty, creamy dish will fill everyone up."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0kcNTYtSloUOyA44Sye6dVJkJY8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7054296-0f231100825b47b7bc4513ef481b93e6.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Collins Goulash"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "55"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "486 kcal"
,"carbohydrateContent": "49 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "2 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "623 mg"
,"sugarContent": "4 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (16 ounce) package elbow macaroni",
"1 pound ground beef",
"1 (8 ounce) package cream cheese, softened",
"2 (10.5 ounce) cans condensed cream of mushroom soup",
"1 cup milk, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once water is boiling, stir in macaroni and return to a boil. Cook uncovered, stirring occasionally until pasta is tender and cooked through, about 10 minutes. Drain well."
} ,{
"@type": "HowToStep"
,"text": "Cook ground beef in a skillet over medium heat, breaking meat up as it cooks until beef is browned and no longer pink. Drain excess fat. Stir in cream cheese until melted, then mix in condensed soup until thoroughly combined. Stir in milk, about 1/4 cup at a time, until the mixture has the consistency of gravy."
} ,{
"@type": "HowToStep"
,"text": "Stir in macaroni, bring to a simmer, and serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very nice ! Mine too is More like stroganoff but it’s how we like it , thank you for your seasoning ideas ! Thanks for sharing !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Shine"
},
"reviewBody": "Made it to the T. Then added a twist! Capers 1/4 c. Just took it beyond! Great dinner for the whole family and then some. Everyone enjoyed! Quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Brubaker Parker"
},
"reviewBody": "My kids love it (and my husband does too)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "I made this tonight and followed other suggestions to add onion and garlic to the meat as it browned. I also added salt and pepper and mushrooms. Still the end result was a little bland. My hubby who thinks most food is too salty said it needs more salt or something. I also feel 16 oz of macaroni is too much. The basic flavor was good so I’ll keep working on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mickey Reynolds"
},
"reviewBody": "I didn't take a picture of it but it came out very good. I sautéed onion with the ground beef. But it is good with small beef cubes etc. I also used jumbo macaroni noodles so it looked like it was a lot of food for our family. everyone ate a lot of it and it was very hearty as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "June Tennant"
},
"reviewBody": "Throw in a can of tomato soup and canned diced tomato and omit the cream cheese. Makes lots and everyone loves it. Like another review said add milk ...but I only added it if it's too thick like when you heat up the left overs (if there are any) More seasoning as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlemrsroberts"
},
"reviewBody": "amazing and easy.\nI used taco seasoned ground turkey meat, onion, lots of garlic and seasoning. will make again we love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eliot Rose"
},
"reviewBody": "The 2nd can of cream of mushroom soup was overkill. I added more milk to compensate for it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ruthncls"
},
"reviewBody": "I had to use ground turkey since my husband is on a bland diet, but this turned out spectacular. I did add a few more seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Crystal Johnson"
},
"reviewBody": "This was quite bland. It definitely needs some seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Todd Simpson"
},
"reviewBody": "Was good. Added a chopped onion &amp; Old Bay Seasoning, salt/pepper. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelsey Bolton"
},
"reviewBody": "...if its too bland and want a quick fix add a packet of dry lipton soup mix or brown gravy mix along with your personal seasoning favs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "Liked it but definitely need to add your own seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim3611"
},
"reviewBody": "Added a few items for additional taste. Fresh mushrooms, diced onion, some chili flakes. Could still use some others but was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "txcatmagnet"
},
"reviewBody": "This is a recipe that my husband's grandmother made for us and I loved it. The only difference is that she put diced onion and frozen whole kernel corn in it also (I use half a 1 lb. bag). She used medium-sized egg noodles for the pasta. It does add a few more minutes to the meal, but I saute half a sweet onion and one clove of garlic, after I brown my ground beef and drain off the fat. I season the beef well while it is cooking (I use Tony's) but any type of seasoning is good. I use only one can of cream of mushroom soup and wisk it together with the cream cheese and one soup can of milk. Then throw it all together back in the skillet and let simmer for a few minutes. I was so glad she taught this to me. I make a meal of it with a salad and some good rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "This is man pleasing good and got raves from my husband. It was so easy to fix and pretty much all I had to do was open a couple of cans and stir once the meat was browned. Easy, fast, and it made my hubby rave so it's a winner! All I could taste was cream of mushroom soup but my family loved this so it will go into my \"KEEP\" file. Thanks for the yum yums."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlyssaL93"
},
"reviewBody": "I was slightly hesitant to try this recipe with all the reviews of it being too bland, however, after making it I had to create an account on here to make sure people know that it is far from bland. Clearly those who think this recipe is too bland are either way to stuck up and not used to a food budget or just didn't season properly.\nHow can ground beef, onions and salt and pepper ever be too bland? \nThis recipe is delish and on top of that, it serves plenty for little cost. I absolutely love the taste and versatility of this recipe. 5 stars any day :)\nIf you aren't sure if this recipe is for you or not, just give it a shot! I'm sure you wont be disappointed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarpuff"
},
"reviewBody": "I was skeptical but pleasantly surprised. Tasted like a poor man's beef stroganoff. I will add onions and mushrooms next time. Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Borky00"
},
"reviewBody": "Quick and easy, I added a little spice to the meat. I followed the recipe and the only down side was reheating leftovers was a little dry but that can be remedied easily enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Me_Chelle"
},
"reviewBody": "STOP!! This dish tastes just like mushroom soup and macaroni. I'm not the greatest cook in the world but this is the most bland meal I have ever tasted. I even tried to salvage this by adding sour cream, garlic, mushrooms, and a ton of salt &amp; pepper. (I never cook with salt but had to do something). The cream cheese was unnecessary and as soon as dinner started to cool, the cream cheese made the dish coagulate &amp; it was even more difficult to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly A Underwood-Myers"
},
"reviewBody": "This was very easy and was yummy! I added salt, pepper, garlic and onion powder based on other reviews and it was wonderful. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "riverrose05"
},
"reviewBody": "Good, with a few additions - hence the 4 stars. It was a little bland, so I added the onions and a little salt and pepper. I also love more of the cheesy flavor - so I tossed in a handful of shredded cheese. Turned out great and the husband liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HOLLYBELL"
},
"reviewBody": "I am eating a bowl of this now. Very good. Creamy. My 10 yr old liked it and so did my husband. We added spices like others suggested (salt, pepper, garlic, rosemary). It's a keeper---good weeknight supper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TB"
},
"reviewBody": "We tried this last night and I was surprised by how well it was received by all my guys. I did make some changes though. I added minced yellow onion, green pepper, mushrooms and lots of garlic powder while the beef was browning. I only added one can of soup but almost 2 cups of milk because I added the uncooked pasta to the pan and needed the additional liquid for it to cook properly. I also added oregano, thyme, salt and pepper to the final 10 min. I think it would have been too bland for us without these additions but overall a very easy and tasty recipe. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MARKUSANDEMILY"
},
"reviewBody": "2.5 to 3 stars as written, because it's lacking in flavor and definitely needs some seasonings. I threw in garlic and onion powder, salt, and a generous amount of beef bouillon and it came out all right. Tastes a bit like a simple beef stroganoff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Quick and easy - and better than hamburger helper. Everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peachxringsx17"
},
"reviewBody": "This dish is great &amp; a quick fix. I made it to pack as my lunch for work for the week &amp; I think it'll last the whole week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "UALMEIDA"
},
"reviewBody": "My mom made a simpler version this dish all the time. (Didn't think it could get any more simple? Just omit the cream cheese and brown the ground beef with onions.) In college this was my homesick meal and it would cheer me up every time. Back to this recipe: To the browning ground beef I added about 2 Tbsp dried onions and 1 Tbsp garlic powder. While the pasta was boiling I added about a cup of fresh peas. I cut the cream cheese in half, used just one can of soup and half a can of milk (soup can). Creamy and rich but not overpowering. Next time I'll add some salt, maybe 1/4 tsp. I'd also add coarse ground pepper if it didn't give me heartburn :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna Gibson"
},
"reviewBody": "I made this tonight, my kids took one bite and exclaimed \"mmmmm\". That alone makes it worth 5 stars to me. I added some onion, garlic and seasonings while I browned the beef but otherwise made as directed. It made lots of sauce, I was even able to freeze some. Thanks for a great recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahB"
},
"reviewBody": "Loved this recipe. It's quick and easy which is what I need during the weekday for my family. I didn't have the mushroom soup so I ended using cheddar cheese soup which was awesome. I also added about a cup for frozen pea's just to get a vegetable in there for my kids to eat. Next time I will try with the mushroom soup and fresh mushrooms. Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "yelkcubj"
},
"reviewBody": "This is a bland recipe. While I'm not the best cook in the world, I'm decent... but I could not rescue this. If someone else has a good suggestion for how to improve this thing, PLEASE share. Even after adding onions and mushrooms sauteed in butter, along with Worcestershire sauce, rosemary/Italian seasoning, salt/pepper... it was not worth the effort. To quote my spouse, \"It's not horrible... it's just kinda there.\" And my favorite review of all comes from my six-year-old son: \"This is the boringest thing I've ever eaten.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "I followed the other suggestions and added onion and mushrooms. Browned them in a couple tsps of butter. Added a can of cream of mushroom w/a can of milk and cream cheese. I ended up using some frozen meatballs I had in the freezer and added some worshershier sauce. This is a keeper but I don't think it would have been good w/o the onion &amp; mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "daisy may"
},
"reviewBody": "Was bland even after seasoning with a variety of spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelli McGourty"
},
"reviewBody": "definatley needs salt and pepper. Something didn't seem right with the consistency of the sauce, after adding the noodles the sauce was too thick to bring to a simmer again and I used 1c milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iheartgnomes"
},
"reviewBody": "i used tomato soup instead of cream of mushroom because that's how my dad usually makes it but very tasty &amp; easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aimee Amaya"
},
"reviewBody": "This was fast and easy... The kids loved it... It was too bland for me even with all the spices i added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Fleck Domingue"
},
"reviewBody": "Very easy and quick. I added an onion to the ground beef and seasoned to my family's liking. To each their own for seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gopintos"
},
"reviewBody": "5 stars for quick. 5 stars for easy. 5 stars for tasty. 5 stars for cheap. Just 5, 5, 5 all the way around. I did add some s&amp;p and little garlic powder. No need to go adding a bunch of other stuff. While it would be good I am sure, I was just trying to stretch the food budget and start making a few recipes without all the other stuff and see how much I can save. This dish cost somewhere around $9. Can't hardly beat that. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda McNeese"
},
"reviewBody": "Addition of the seasonings suggested for flavoring make it delicious (seasoned salt, garlic, rosemary, salt, and pepper). I add crushed garlic clove instead of garlic powder. To make this even a quicker meal, I ended up using a 16 oz. box of quick cooking pasta that cooks in 3 minutes if you are in a real pinch for time and it is still delicious. I usually use whole wheat pasta for a healthier meal for your family and it's still delicious. If your family loves mushrooms you've got to add it to the recipe, makes it even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilguardian137"
},
"reviewBody": "The dish was fantastic and I will make again for sure. Not trying to be rude, but the dish can only be bland if its not seasoned properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BERKLAN"
},
"reviewBody": "Quick, easy and the kids love it. Can't beat that with a stick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "W Hamlett"
},
"reviewBody": "My family and I really liked this. It is good as is but would also be good with some onion sauteed in with the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candi"
},
"reviewBody": "I make a variation of this all of the time! I do, however, do a few things different: - I use about a cup of milk, instead of cream cheese - I add at least 2 cups of sliced fresh mushrooms (cooked with the ground beef) - I use plenty of seasonings while cooking the beef ( garlic powder, seasoning salt, a little rosemary, black pepper - all to taste) - and I use several different types of pasta. Sometimes I use spaghetti, sometimes penne, scoobidoos, rotini, etc - depending on what we feel like. They are all wonderful. This is one of our family favorites!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carrie T"
},
"reviewBody": "This one is 3-4 stars. It's pretty bland, but my kids will like it. If I make it again, I'd probably add some beef bouillon granules for flavor--maybe parsley too. I had already added diced garlic and onions to the beef when it was cooking, as well as some black pepper. Also, this recipe makes a lot!! I have some in the freezer....Good recipe, just not my favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "rachel"
},
"reviewBody": "Very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nani “Squeekie” Otani"
},
"reviewBody": "When the kids are 'starving', and you have maybe 10-15 minutes to get the food on the table before they riot; THIS is the recipe for you! serve with any kind of fruit and/or vegetable salad. I add a half bag of frozen mixed veggies, but do what ever you must do to make it your own. Thanks, Lilgirl, for reminding us that simple is best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ct"
},
"reviewBody": "Sounds great :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Tracy Williams"
},
"reviewBody": "This was really an easy dish for a quick dinner. It was easy on the pocketbook to shop for too. I added S/P and some finely chopped onion which only made is more yummy. This is the kind of dish that will stick to your ribs. It is good served with a fresh salad or fruit."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214761/collins-goulash/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17046/soups-stews-and-chili/stews/goulash/",
"name": "Goulash Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214761/collins-goulash/",
"name": "Collins Goulash"
}
}
]
}
}
, "about": [
]
}
]