				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Corned Beef and Cabbage"
,"datePublished": "2000-03-15T16:14:38.000-05:00"
,"dateModified": "2023-01-24T10:37:22.271-05:00"
,"author": [
{"@type": "Person"
,"name": "Laria Tabul"
}
]
,"description": "Corned beef and cabbage simmer with potatoes and carrots for a traditional Irish meal that&#39;s the perfect centerpiece for St. Patrick&#39;s Day."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xPSGbNV0amXHKsAG6sU4zgE8mf4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16310-corned-beef-and-cabbage-i-DDMFS-4x3-19a894131bbf4ecea8a539a2e53f17ab.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6298731723001",
"description": "If you need something else to do with your brisket, besides using the smoker, try this excellent traditional recipe.",
"duration": "PT4M31S",
"name": "How to Make Corned Beef & Cabbage",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/fdb67068-145b-4f6f-8bd5-d0f0af2f36c0/33313c49-4957-43fc-9f25-7f5cc5b7e0d3/1280x720/match/image.jpg",
"uploadDate": "2022-02-26T23:00:06.948-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Corned Beef and Cabbage"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1381"
}
,"cookTime": "PT150M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "839 kcal"
,"carbohydrateContent": "69 g"
,"cholesterolContent": "147 mg"
,"fiberContent": "12 g"
,"proteinContent": "50 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "3378 mg"
,"fatContent": "41 g"
,"unsaturatedFatContent": "0 g"
}
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["Irish"]
,"recipeIngredient": [
"1 (3 pound) corned beef brisket with spice packet",
"10 small red potatoes",
"5 medium carrots",
"1 large head cabbage" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9hSA3eGZeSqkOEc_80dTOzIZZhA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16310-corned-beef-cabbage-mfs-047-step1-d10506228b354d55bc8420c907854ef0.jpg"
}
]
,"text": "Gather all ingredients."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/XIMS2q6SwPQJKBCWPSYqbPeHhvs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16310-corned-beef-cabbage-mfs-048-step2-c17eed59ff08498783a5e66b5a74c9bb.jpg"
}
]
,"text": "Place corned beef in a Dutch oven and cover with water. Add spice packet, cover, and bring to a boil. Reduce heat and simmer until corned beef is just about fork-tender, about 2 hours."
} ,{
"@type": "HowToStep"
,"text": "While the corned beef is simmering, cut potatoes in half. Peel carrots and cut into 3-inch pieces. Cut cabbage into small wedges."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/e8hFEE3XyiTdfP3hxYQNYLe7B2M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16310-corned-beef-cabbage-mfs-050-step4-7e591006d8fe402880d6c6fd42919085.jpg"
}
]
,"text": "When corned beef has cooked for 2 hours, add potatoes and carrots; cook until vegetables are almost tender and meat is fork-tender, about 10 minutes. Add cabbage and cook until tender, about 15 more minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xPSGbNV0amXHKsAG6sU4zgE8mf4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16310-corned-beef-and-cabbage-i-DDMFS-4x3-19a894131bbf4ecea8a539a2e53f17ab.jpg"
}
]
,"text": "Remove meat and let rest for 15 minutes. Leave broth and vegetables in the Dutch oven.Slice meat across the grain. Serve with vegetables and broth."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bethluteraan"
},
"reviewBody": "Delicious! I added one large onion and a Tbsp of pickling spices to the water with the corned beef. The veggies were a bit soft but the flavor was amazing. Next time I will cook the veggies with the cabbage as to not overcook them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AL204MB"
},
"reviewBody": "This was simple and very good. Veggies were perfect, cabbage was crisp and meat was tender. Will do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myra"
},
"reviewBody": "I added some pepper corns and coriander seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgia Fogo"
},
"reviewBody": "Tonight was the very first time I ever cooked corned beef and cabbage. The corned beef was so tender it could be cut with the side of a plastic fork and the flavor was perfect. This recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe very carefully. What a mistake! The corned beef turned out well. Too bad the vegetable were WAY over cooked! The carrots were so soft they fell broke into pieces and the potatoes were starch balls that disintegrated when they were spooned out of the pot. Only the cabbage was spared from being boiled to tasteless-ness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNNESTWINS"
},
"reviewBody": "Did I say YUMMY?!?! Made exactly as recipes states. Absolutely delicious. And thank you to the member who recommended using the broth for split pea soup. Happy St Patty's Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy B."
},
"reviewBody": "I have been making my Corned Beef and Cabbage the same way for years and it’s always a hit and SO TENDER!! Is the key!! *4 lb ROUND cut. ( Can use Point Cut, but you end up with less meat that if you used a 4lb. Point Cut.) Round cut is perfect for longer slow cooking. * Remember, the lower and slower the MORE TENDER. :-). Too fast and high temp setting, your meat will not be as tender. *Put in Crock Pot with its included seasonings from package. Cover meat with 3 or 4 cans of Coca Cola. Yes! The soda! Need more liquid to mostly cover meat? Add some Apple juice.. I like to pour about 1/2 Cup of real real Maple Syrup the top of your Brisket when it begins to cook. If you don’t have Maple Syrup, that’s fine. *Turn Crock Pot to HIGH for 1 to 2 hr. Until low boil. Reduce to Low and slow cook for 8 hours. *Remember the lower and slower the more TENDER. 3 hours before done add Red potatoes, not fully peeled. Create a peeled “belt” around its “waist” which allows liquid to slowly enter into the center of the potato for better flavor. ( See photo for example of potatoes cut before I added the rest of the ingredients.) Add mini carrots or regular carrots peeled or unpeeled, however you like them. Cut down the center then width wise to desired size. Or just cut widthwise without cutting lengthwise. *Meanwhile, With sharp Chef knife, Cut cabbage in half then cut those to halves in half to make 4 quarters.Lay cut side down over carrots and potatoes 1.5 to 2 hours before Corned Beef is done.Or steam in separate pot, cut sides downward in about 1 to 2 inches of liquid made from from the crock pot, some vegetable or chicken stock/broth and and top with butter once fork tender but still Al dente. *Serve w any kind of Mustard as a condiment. *Leftover corned beef is great for cold or warm sandwiches. I like heated on a roll with melted Swiss cheese! Enjoy! *Can also make Corned Beef Hash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Have not tried this but sounds absolutely delicious. I'm wondering if this could be made in slow cook crackpot instead of Dutch oven, and how would it be adapted to do so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Save the juice, it makes a great stock for split pea soup. If you add corned beef chunks it's even better. Just refrigerate the stock overnight to skim off the fat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Hiles"
},
"reviewBody": "This recipe was easy to follow and it came out perfect 👌🏼"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashleyfoster92"
},
"reviewBody": "So far love it it's my 1st time making it it's easy to make but the potatoes I did 20 min's and the rest I follow the recipe but I used shredded carrots already"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thank you! I customarily have someone besides me cooking, but this year I was on my own. Came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great. A simple recipe my 12 year old can follow. She wants to make this for St Paddy’s day when she gets home from school today. She doesn’t like the way I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a nice American dish, not Irish. I love the convenience of it. If you're looking for real Irish food, you're better off with things like colcannon or a stew. Lamb is also a good option, as a stew or a pie with tatties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scaredycat"
},
"reviewBody": "Pickling spices can be added when cooking if your corned beef does not come with a spice pack. I also add a bit of brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Augusta"
},
"reviewBody": "perfect. Make sure to cook the cabbage last and not too long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luke Tansey"
},
"reviewBody": "i am in love with you,i love your personal touch is amazing,,luke"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Been making this for 50 years and still loving it. I do shortcut the cooking time by pouring off about half the liquid into another large pot with a steamer insert when the beef has about 1/2 hour to go. I then replace the missing liquid in the beef pot with more water (very hot) to finish the cooking and use the scavenged liquid to steam the veggies while the beef is finishing. The steamer with the \"beefy spiced water\" flavors the veggies without soaking them and everything is piping hot when all is done. I get the potatoes going and then add each of the veggies as the clock runs out - the timing of each addition based on how crisp I want them. I , like some other readers, add onions and sometimes green beans (which might be bordering on sacrilegious) to the pot. We eat the sliced beef with a side of \"sauce' (horseradish mixed into sour cream.) Absolutely, YUMMY! I'll be shopping for a brisket today! P.S. I prefer Flat cut just because there is less fat and it slices into more attractive slices. Some say Point cut is more flavorful because it has more fat but unless you ate them side-by-side I don't think you'd find an appreciable difference I also recently tried buying a whole brisket and corning it myself. Mine had not been trimmed (I don't know if that's an option) and at least 1/2 was fat to be trimmed away. It was a real JOB! The brining process also requires special spices which I had to buy AND some days of baby-sitting - I found the whole process very tedious. The end result was good - a different flavor than I am used to but very good. Not sure I will do it again - ideally, I'll get my sister to try doing it and then get her to share the result with me - LOL !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LRM"
},
"reviewBody": "What do I do if I live where seasonings don’t come with the meat? What seasonings should I use?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SA Giles"
},
"reviewBody": "This is so easy in the crockpot! Once you have made it you can tweek it how you want. I add an onion. Some times I use brussel sprouts instead of cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a can of guinness to the pot along with water. Deicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Handsaker Pauly"
},
"reviewBody": "Simply the best 👌 I cut my carrots 🥕 into disks and left my potatoes 🥔 whole but used the smallest out three bags will definitely make again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Easy and delicious! I usually hate cooking so hubby does it all. Once in awhile I'll give it a try. This recipe was perfect for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe. We always add a beer and a pound of kielbasa cut up. Adds extra flavor and meat too..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Corned beef is a family favorite treat that's always a special treat in our home. We've been making it for years. We usually boil until simi-tender then smoke it for about an hour or so and always add garlic and some other seasoning as well! We also do a more traditional version of throwing it into the crock pot with the seasoning packet, extra pickeling spice, garlic, dehydrated onions, and sometimes a little bit of beef bouillon. Then add in potatoes 15 mins before you're ready to eat then about 5 mins before you're going to pull it out add the carrots and cabbage!!!! Either way is super amazing!!! This recipe is good but could always use some extra ingredients too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I double the recipe and use 2 bottles of IPA or Guiness, depending on what's in the fridge, along with the water to cover. I also add 2-3 Vidalia onions each cut in about 6-8 wedges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "F Garcia"
},
"reviewBody": "I add minced garlic and sliced onion. And never ever peel the carrots. wash, yes, but never ever peel. It takes away soo much flavor that compliments this dish so well! adding the veggies in stages is crucial for texture, not to mention retaining their nutrients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved this educational video on making corned beef. Amazingly easy and simple to follow. Thank you. Something a Leprechaun might say... \"When you make a wee wish on a green four-leafed clover, may your belly stay full and your cup runneth over.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "This was a wonderful change for a holiday meal! Perfect one pot recipe when you have 100 other things going. Wanted to try beer (will next time) but stuck to half water/half vegetable broth. Yes, I added a controversial onion 😉, roughly chopped and right at the beginning so the meat simmered in an onion spiced broth. We did all our veggie prep the night before so while we were entertaining and as the timer went off, went back and dumped in. We thought this recipe as stated was divine! Thank you Laria! This might be a new Christmas tradition for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm Irish and grew up with Corned Beef and cabbage. NEVER EVER use onions unless you are such an onion fanatic that you put onions in your cheerios! This is a very excellent Irish food even though in Ireland they didn't have Corn Beef, but a definite Irish staple outside of Ireland. I do put Guinness Extra Stout in mine and/or some Jamesons! If you have never had good Corn Beef, then use this just as stated, then as you do it again, add &amp; subtract to it as your taste buds desire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alynxia"
},
"reviewBody": "The simplicity gives it the perfect flavor. The cured corned beef adds the \"salt\" and the spice pkg adds bay leaf and mustard. Perfect combination. Cooking times on the veggies is important, otherwise, the potatoes and carrots will get overly cooked. Really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coralie"
},
"reviewBody": "This was amazing. (Previously, I had always cooked corned beef in the oven and skipped the cabbage, etc). We served it with mustard, horseradish and Old Bay Seasoning. And steamed green beans. Yowzaa!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug Brown"
},
"reviewBody": "I love this Corned beef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Rich"
},
"reviewBody": "I made this and it was amazing! I did add chicken broth and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I add onions and rutabaga to the recipe. I also cook the cabbage last."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My corn beef is bigger than 3pounds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah "
},
"reviewBody": "This was the easiest and best corned beef &amp; cabbage I ever had. I will make this again and again and again. I did add the butter to the top of the cabbage like she did in the stove top recipe with some pepper and we couldn't get enough. My husband absolutely loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The recipe turnout awesome I didn’t make any changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy G"
},
"reviewBody": "It came out perfectly! Bravo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Such an easy recipe. Because of family preferences, I added onions and garlic, but otherwise followed the recipe as written. The beauty of its simplicity is that everyone can \"dress\" it on their plate; that is, some family members add horseradish sauce, others don't add anything extra, but I add mustard. A meal to satisfy various tastes when followed as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Chan"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added onions along with the potatoes and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added onion, it rocked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a fantastic recipe. You just need to add a little time (and some more vegetables) if you are using a larger brisket."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "keebdaisy"
},
"reviewBody": "As is, not very flavor full and I always do as is the first time to truly give the right review. After the first sit down with the meal I then added carraway seeds, and some celery salt and onion salt and pepper. So much better. With all the cabbage and potatoes you need more than just the spice packet that comes with the corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am a huge fan of corned beef and cabbage, and this recipe turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Cooked for 2 hours and not even close to done! Very frustrating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy Peasey Corned beef is not always in the stores, but it is there for St. Patrick's Day. Here is an easy recipe that tastes great! Here is to the sort-of Iriish part of the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helena"
},
"reviewBody": "Perfect as written, easy to make, delicious and colorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuiceMom"
},
"reviewBody": "Perfect! I did add a beer to the braising liquid, but other than that no changes. So yummy. I was really sad that I did not have leftovers because I'm sure it would make an EXCELLENT corned beef hash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Followed recipe exactly, Did 10 hour cooking time for a St Pats 🍀dinner that was delicious! Best I've done. Irish soda bread was great with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kellygirl"
},
"reviewBody": "I cook the corned beef, adding 10 peppercorns, bay leaves, 10 whole cloves, a quartered onion, celery, and a dried red pepper. I also add 1/2 cup vinegar in the last 30 mins of cooking. Remove the meat, strain, and cook the veges in the broth. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kclemmons"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Morris Smidt"
},
"reviewBody": "I have never made corned beef and cabbage but decided I wanted to try this year. I followed the crockpot instructions in the video which added onions that are not included in the recipe. I didn't have beer so I added 4 beef boullion cubes along with water. In addition, I added 4 garlic cloves in with the veggies because everything is better with garlic! When I added the cabbage after 8 hours, I was skeptical about how good a dinner that had boiled in water all day was going to be. I didn't need to be worried because everything tasted great - veggies needed a little salt but the corned beef was tender and flavorful. I learned I didn't need quite as much water but otherwise the crockpot directions in the video were spot on. We will definitely be having corned beef and cabbage on St. Patrick's Day from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This the first time I have made corned beef and cabbage. I loved it. The only thing I might change is cutting the potatoes and carrots a little smaller. Great recipe, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heath Hunter"
},
"reviewBody": "Used Dutch oven and seared bottom in wagu rendered fat. Don't forget the season packet sticks to the meat or it will also get seared, lol.... then flush cold water through package into Dutch oven. Used 1.5 stella beers. Timing for veggies was right. Forgot to skim foam, but was just fine. Classic cb&amp;b"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pearl"
},
"reviewBody": "this was delicious!! a few addl notes for myself though: fat side UP spices on fat side not meat side skim the fat before adding veggies, otherwise it's too greasy otherwise it's perfect and my go-to recipe for this. goes great with the Amazingly Easy Irish Soda Bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knokeka"
},
"reviewBody": "This was a total slam-dunk for my hubby and me! I did everything to the recipe, except added a can of beer to the water when cooking the beef brisket. The rest of it was according to the recipe. This was, hands down, the best beef brisket dinner we have had! Perfection! My husband kept saying how he wished his father (now passed) was alive to be able to taste this, as he loved a good corned beef dinner! Wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Liebold"
},
"reviewBody": "This turned out yummy. I used two cans of Guinness and water to cover the corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Raxter"
},
"reviewBody": "Simple, easy to follow, and most of all good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi MacDougall"
},
"reviewBody": "Great instructions. I usually dump everything in at the beginning. It's hard to remember when you only make dish once a year. I made just as instructed. But I do add a splash of vinegar and some brown sugar. Great dinner thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teresa Adamic"
},
"reviewBody": "I cooked a 2.3 lb corn beef and 2 hours and I couldn’t get the fork to come out easily so I continued cooking it for 6 more hours. I added the potatoes and carrots on simmer. The recipe never said to bring to a boil. The video showed it was boiling. Needs clarification. After 10 minutes the veggies were still RAW! I will never use this recipe again. It was cooked on the stove top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "unicorns416"
},
"reviewBody": "I usually make my corned beef and cabbage in my crock pot. I forgot to put it on this morning before I started running my errands. I made it on the stove following the steps above and everything turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stefanoamellayahoocom"
},
"reviewBody": "Variety and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorri Cole"
},
"reviewBody": "Was delicious Had to cook vegetables separately"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added some brown sugar too not to much just two cubes Yum Happy Saint Patrick's Day Also have a @GuinnessUS #Stout with it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! I chose this recipe because today is St Patrick’s day, and I wanted to celebrate. I can’t recall the last time I ate corned beef, but it’s so tender and delicious that it will become a regular meal for me. Thank you for providing a simple and delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Carriere"
},
"reviewBody": "The recipe is wonderful and I followed your directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan France"
},
"reviewBody": "It was excellent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this in 21 and I'm making it again in 22. It's really good but I do add 1 to 2 bottles of Guinness Beer to give it that extra Irish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Countryman"
},
"reviewBody": "I used frozen carrots 🥕 instead of regular one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Similar to the standard recipe that I've used for years, except I cook the corned beef with packet, onions, and garlic first, then remove the brisket, cover with foil, and simmer the rest of the vegetables in the broth for an hour. Only because my Dutch oven won't hold it all at once. Delicious every time, no matter what order you cook them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joni Endicott"
},
"reviewBody": "The recipe was great, but in what universe to carrots and potatoes cook in 10 minutes? I started them 1 hour and 40 minutes after starting the beef simmering, simmered 30 minutes, added the cabbage and simmered another 15 minutes. Great taste and a fun meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dannette Weathers"
},
"reviewBody": "I added some crushed garlic. This recipe is the same as my Grandmother taught me. It’s so delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy to put together and delicious!! Made a great early St. Paddy's day dinner for friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Sovey"
},
"reviewBody": "Great simple recipe....one tip though....rinse the Brisket to lower the salt content and add a can of Guiness or equivalent dark bitter ale and crush 5 cloves of fresh garlic...... yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Agree with \"Protomind\". All the taste has to come from the corned beef and vegetables alone. For heaven's sake, don't add spices, wine or flavored broth. Do not \"brown\" the meat. It doesn't do the texture or flavor any favor. It doesn't hurt to throw in a couple of large, sweet onions for the last 30 to 45 minutes. They do complement the cabbage. I simmer (maintaining a very low boil or bubble throughout) the corned beef for five hours and add the potatoes and carrots for the last hour or so. Yes, you don't want mushy cabbage. You do want the corned beef flavor in it. Cut it into wedges and throw it in the pot for the last thirty minutes of cooking. For the hearty souls in the crowd, serve with a good cream horseradish sauce on the side. Penname: \"Dergen\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "I thought it was absolutely delicious!!!! For those people who haven’t even tried it &amp; tell everyone to do this &amp; this &amp; this, write your own recipe &amp; leave others alone!!! It’s their recipe, write your own!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JakiiRSM S."
},
"reviewBody": "This is the way mom used to make it. It ends up with the best of flavor when all veggies are cooked in the broth. Adding a little onion and garlic is a plus. Also serve in big ole bowls because the broth is so tasty it's like a soup. You don't want to miss any of it with a big loaf of crusty bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCOUTERBRUCE"
},
"reviewBody": "I added 6 whole onions to the veggies. Great recipe for times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve C"
},
"reviewBody": "I added onion, peppers, mushrooms, potatoes, celery, and provided Sauer kraut for those who liked a tang. It was so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made corned beef and cabbage this way for many years and it's delicious. Nowadays however, I use my electric pressure cooker; it's quicker and easier cleanup (so call me lazy!) The meat goes in the pot with it's own juices, some water and 1/4 to 1/2 cup of GOOD quality, cloudy, apple cider vinegar, depending on the size of the meat. Please DON'T use the clear, cheap cider vinegar - you won't get a good result. I cook the meat for 40 minutes, then add the cabbage, carrots, some chopped onion and let it go for another 10 minutes. It turns out delicious, with a hint of tangy flavor from the vinegar. My husband is a mashed potato fan, so I make them to go with it; he LOVES this meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I add beer and two cartons of low sodium beef broth. It really adds a depth of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brenda H"
},
"reviewBody": "No way does this corned beef cook for 3 hours and it’s tender. The flavor was good bc I used a flavor packet included when I bought the beef brisket. I only made this dish once and many years ago so I forgot that it took so long to be done. So I will make this again but I will be better prepared and allow for a day to make it. I did search making this and found it may be made in a slow cooker but one needs a large one. I used a cast iron dutch oven. The carrots and potatoes went in when it had about a half hour to go and shortly after the cabbage cut in small chunks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katey"
},
"reviewBody": "Good for the most part. But actually had to double the cooking time. The package said 90 minutes per pound and that was definitely more accurate. Had to add a bit more water as it boiled down but needed to continue to cook. But delicious as always. Made some soda bread to go with it from another allrecipes recipe (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xm5c46268y"
},
"reviewBody": "Delicious! Just like my mom use to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Malone"
},
"reviewBody": "I added a half cup of brown sugar and it turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jldarabos"
},
"reviewBody": "Perfect as written. No reason to change a thing. And this was my first time ever cooking corned beef. Was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Lohman"
},
"reviewBody": "One of the most amazing things I have ever eaten, and so incredibly easy to make! Instead of putting it in the oven, I chopped the veggies and threw it in a crockpot and it was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Mahoney"
},
"reviewBody": "This was quite easy and delicious! Followed tips to boil off the fat scum before adding seasoning. This method made it easy to control when the veggies were cooked so I didn’t have mushy cabbage. The beef sliced up nicely and was so good. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Very easy with excellent results. \nWhile cooking corned beef and cabbage is low on the skill level, it is not a recipe one cooks often. Having a goto reminder is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Sehmer"
},
"reviewBody": "As others did, I included a can of beer with the water that I covered the brisket with. That was the only change. The meat was really tender!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith N"
},
"reviewBody": "This was a simple and delicious recipe. It was my first time preparing corned beef or cabbage but we all enjoyed it. I had to add some salt and pepper to the finished dish (personal preference) but the rest was great as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Little"
},
"reviewBody": "Super easy and very tasty!! I added a couple bay leaves while I simmered the meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leticia Giles Pouliot"
},
"reviewBody": "I thought the Corned Beef turned out pretty good. There were not enough seasonings for the veggies though. They just tasted too plain, and if you read the recipe I guess they are. I think I figured that the meat might give them more flavor, but not so much. If I was to do it over I would add additional spices and onion. I would have also made this in a stock pot. My large dutch oven was not big enough for the beef and all of the veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom’s Mom"
},
"reviewBody": "This was the best corned beef and cabbage we’ve ever had!I followed the instructions almost exactly, and added just a few other ingredients based on other reviews: a bottle of beer, a few cloves of garlic, some peppercorns, and two bay leaves. I rinsed the beef before cooking but left the fat on, and scraped it off before slicing. So tender, juicy, and flavorful! The carrots were a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenwwjdn"
},
"reviewBody": "it reminds me of my mothers. She made it every St. Patricks day. My father was part Irish and he loved that meal.. My whole family loves this meal. Its on the stove right now. It smells wonderful."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/472/main-dish/beef/corned-beef/",
"name": "Corned Beef Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1449/main-dish/beef/corned-beef/corned-beef-and-cabbage/",
"name": "Corned Beef and Cabbage Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/",
"name": "Corned Beef and Cabbage"
}
}
]
}
}
, "about": [
]
}
]