				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cottage Pudding (Cake for Strawberry Shortcake)"
,"datePublished": "2020-06-18T23:44:52.000-04:00"
,"dateModified": "2020-06-18T23:44:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kaylene"
,"url": "https://www.allrecipes.com/cook/740782"
}
]
,"description": "This moist and sweet cake is perfect for making homemade strawberry shortcakes. It&#39;s also great just by itself too!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uic8d0LGc5HyOevh8JWxTYaYegU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1130792-50c8cc47596c4d02b54439852ace4fa9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cottage Pudding (Cake for Strawberry Shortcake)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "109"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "277 kcal"
,"carbohydrateContent": "45 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "220 mg"
,"sugarContent": "24 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"2.5 teaspoons baking powder",
"0.25 teaspoon salt",
"0.33333334326744 cup vegetable shortening",
"1 cup white sugar",
"1 egg",
"0.5 teaspoon vanilla extract",
"1 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9-inch square cake pan. Whisk the flour, baking powder, and salt together in a bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat the shortening and sugar with an electric mixer in a large bowl until light and fluffy. Beat in the egg and vanilla extract until smooth. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Pour the batter into prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack."
} ]
,"recipeYield": ["9"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANDT2"
},
"reviewBody": "This cake was delicious. I plan to use it for the base of all my summer fruits. This time, I had it with strawberries. I decreased the sugar by 3 tablespoons, and had to bake the cake about 15 minutes longer than the directions say. I'm sure it would have been fine with the called for amount of sugar, but we don't like things too sweet. Give this recipe at try. You'll really like it. UPDATE: I substituted 1-to1 gluten free flour for regular flour, and decreased the sugar to 3/4 cup. As previously noted, I again had to bake it about 12 - 15 minutes longer than stated in the recipe. The results were excellent. It looked and tasted the same as when previously made with white flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlhnslr"
},
"reviewBody": "My daughter has taste buds where she can tell what is in or left out of most foods making her a discriminating eater. She loves this cake. It is not the biscuit texture most people are probably used to. It is very soft and does not brown in the oven. I used butter (not oil), just slightly less sugar, and baked for exactly 25 minutes. It was a perfect bake both times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookindot"
},
"reviewBody": "This cake is awesome.......and so easy! I used unsalted butter instead of shortening and everything else as written. So versatile, you could top it with any fruit or dessert sauce. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ET1"
},
"reviewBody": "This is an old New England recipe. Was very popular during the Depression. My Grandmother taught it to me as her Grandmother taught her. It is great by itself as well as any topping. She would make it in winter with a warm cream glaze that soaked into the cake. In summer it was great with any fruit and whipped cream. ....and always butter. My Grandmother always said...no reason to live if you don’t use butter!! Thanks for the trip down memory lane. Missing Grandma now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyLPC"
},
"reviewBody": "This was wonderful! I was worried about it drying out so I reduced baking time a little, but I didn’t need to worry. Super moist and tasty. I served it with scoops of homemade ice cream and fresh berries for a tasty summer dessert in the back yard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "I usually make the standard biscuit-type shortcake which sometimes ends up being too dry, especially if you don’t have enough juice from the berries. This recipe is perfection and so much better! I made it to bring to a small gathering and it was a big hit. When I offered the leftover portion to the hostess and she eagerly accepted it, I was disappointed to be going home with not even a crumb! The texture and flavor is wonderful with berries and would be yummy even on its own. As soon as I buy more berries I will be making this again!! I made the recipe exactly as written and wouldn’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HUSHPUPPY"
},
"reviewBody": "I'm giving this five stars because this is fantastic! I looked up \"Cottage Pudding\" and this is an American dessert from the 1800s. The recipe first appeared in Fannie Farmer's Cookbook from that time period and has many versions over the years. A pudding is a British term for a bread-based dessert, though I've heard the term also used for any dessert. This cake could be the base for strawberry shortcake, or baked as a cobbler with the fruit of your choice, or topped with a hard sauce. It's a sweeter cake and imo much better than the traditional shortcake. I swapped butter for the shortening, but will probably try the shortening the next time I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Hoxie"
},
"reviewBody": "I usually take the easy way out when it comes to shortcake and reach for the Bisquick. NEVER AGAIN, not after making this recipe. It was perfect in every way; taste, texture, crumb, everything. My housemates raved about it. So easy because it uses ingredients that are already around the kitchen. Not going back to the box, ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Atkinson"
},
"reviewBody": "I had never had homemade shortcake before. We always bought the sponge cake cups from the grocery store. This shortcake is so incredibly delicious and easy to make. 45 minutes from beginning to end. Very Very Very Simple!!! I’m already planning my next shortcake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PEGGY221"
},
"reviewBody": "Nice flavor - would be best as cupcakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jngauvin"
},
"reviewBody": "Excellent shortcake recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myna"
},
"reviewBody": "Delicious! I made it as directed, and it was perfect with strawberries, lots of juice to soak into the cake with whipped cream on top. I think I will serve it with peaches tomorrow. This will always be my choice for shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I will use this recipe from now on.\nIt is so simple and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margaret Fitzgerald"
},
"reviewBody": "I made the cake without recipe changes. It has a nice dense texture suitable for shortcake. For me it was a bit on the too sweet side, but other family members liked it as is. Next time, I might reduce the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Ellie"
},
"reviewBody": "Husband made this for my birthday, I had requested strawberry shortcake. It was perfect with strawberries and whipped cream. Also, simple enough for my husband, (who doesn't bake EVER) to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melody Schmidt"
},
"reviewBody": "Very easy recipe to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rainincj"
},
"reviewBody": "I did the high altitude adjustments and this cake turned out great @"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Giana"
},
"reviewBody": "Excellent cake recipe for strawberry shortcake. I used butter in place of shortening and it was moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clare"
},
"reviewBody": "I'd been looking for a shortcake recipe that wasn't dry and tasteless when I came across this one. Followed the recipe exactly except I used the suggestion to add some butter with the shortening. Perfection! This will be my shortcake recipe from now on. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUEGIRL5"
},
"reviewBody": "Perfect little cake for strawberry shortcake--- cross between a sponge cake and a biscuit. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "Moist, dense yet fluffy, good flavor; makes a good strawberry shortcake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VelloraCooks"
},
"reviewBody": "This was a nice little cake for strawberry shortcake! I made these as cupcakes (backed about 20 minutes) and they turned out nicely. They weren't too sweet, so it didn't overpower the strawberries. I would make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M_Ellery"
},
"reviewBody": "I doubled the recipe to fit into a 9x13 pan, thinking a 9x9 amount would not be enough. But it certainly would have been - this goes a long way! It was quite good, crumbly, and soaked up my strawberry juice nicely. Next time I won't double the recipe as I will have to buy like 6 more containers of strawberries to use it all up. Also, I used butter rather than shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Vaie"
},
"reviewBody": "Loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dyany"
},
"reviewBody": "By far the best cake for strawberry shortcake EVER EVER EVER! You can eat this straight, even. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Nikolaus"
},
"reviewBody": "I also used butter and this cake is amazing with strawberries. I'm going to make it now and serve with fresh blueberries! No more box shortcake for my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Douglas"
},
"reviewBody": "Following other reviewer's advice, I changed this recipe a little, and it was perfect! I exchanged the shortening for butter, and since I used salted butter I left out the salt. I cut back just a tiny bit on the sugar, but I could have cut a little bit more. I would definitely recommend this recipe with that modification. I might even do half shortening half butter since it seemed very buttery, but since I haven't tried that I won't 'officially' recommend that modification. Just a little side note, and it should come out pretty fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libby Minner Miller"
},
"reviewBody": "Just like my Mum used to make many years ago for her Strawberry Shortcake. Dense but fluffy.. Raises high. I baked in 7 X 11 \" pan for about 30 min ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidelc"
},
"reviewBody": "MMMmmm. I followed this recipe to a tee. Can I say how good the batter was!? It pained me to even put it in the oven! I just wanted to eat the whole bowl!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel castrovinci"
},
"reviewBody": "Perfect! I ran out of store bought shortcakes and didn't feel like running to the store. This recipe is so easy and I had all the ingredients on hand. I followed the recipe as it is but I used a Yorkshire pudding tin to make single serving cakes. Popped them in the oven for 13 minutes. Worked out great and the family can't stop eating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "griffinsgramma"
},
"reviewBody": "i would give this three stars, I didn't think it was anything out of the ordinary, but my husband loved it and ate 2 huge pieces after his first piece. Followed the recipe exactly. Next time would likely add a little more vanilla. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danna Roberts"
},
"reviewBody": "I followed the instructions exactly and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Snow Williams"
},
"reviewBody": "I used butter and lowered the sugar to 1/3 cup. My husband raved over this recipe. We've used different fruits as well, anything works! we will use this recipe over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shirley P."
},
"reviewBody": "The cake didn't have much flavor. I'm going back to an old-fashioned sweet-biscuit type of strawberry shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blayne7"
},
"reviewBody": "AMAZING!! I was looking for a recipe that would be close to what my mmom makes for strawberry shortcake. She calls it one egg cake, but I didn't have luck searching for that. I am so glad I found this recipe. It is DELICIOUS! It's light and fluffy. Someone commented that it's not very sweet, so I sprinkled sugar on top before baking it in a pie pan. I loved the sugary crunch on top. Other than that I made no changes to the original recipe. I will be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovemydanes"
},
"reviewBody": "While I only make strawberry shortcake a couple times each year, it's the dessert I enjoy most of all. Strawberries in season macerated in sugar, a big bowl of heavy cream whipped with a little bit of superfine sugar...but then came the problem of the shortcake. Over time, I've tried many kinds of 'shortcake' and while some were quite lovely, nothing made me stop searching for something better. Until now. THIS IS WHERE MY QUEST ENDS. The only modification I made to this recipe was to double it and bake it in a 10x14\" pan. I didn't substitute anything, so as to be able to judge the recipe as written. It's perfection - a sticky, tender, just-sweet-enough crumb that happily soaks up strawberry juice and is the peerless hybrid of biscuit and cake. I'll never make another shortcake! Thank you so much to Kaylene for submitting this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skweeky"
},
"reviewBody": "I've made this a bunch of times- doubled it for a crowd, made it in muffin tins, used it for pineapple upside down cake. It's great no matter what you do to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzi S."
},
"reviewBody": "So delicious! My number one choice for dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol k Knutson"
},
"reviewBody": "Didn't &amp; wouldn't change a thing!! Browsing through recipes today, &amp; saw this shortcake, same as mine !!! Got recipe from our neighborhood grandma!!! Remember when growing up there was always a grandma in the neighborhood !! Mine was grandma B&amp; she was great!!! Anyway only thing different? She sprinkled sugar on top before baking, but I swear, she put sugar on top of everything!!! Never had any problems with recipe, why try to fix it, when it isn't broke? Enjoy All-Recipes site!!!! So, saved to recipe box, that way can share also!! C.K."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carla"
},
"reviewBody": "This Cake is fantastic! It's easy to make, it's sweet, but not overly sweet. I didn't change a thing, didn't have to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "I misread the size for the pan and I had to bake it another 15 minutes because I used an 8\" square. Thanks for posting this recipe. Perfect for these strawberries and cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tisha"
},
"reviewBody": "When I was looking for a cake for the strawberry shortcakes a client requested, I tried this one. It got such amazing reviews. The taste was somewhere between a biscuit and a cake, tender, moist, and just the right amount of sweetness to compliment the berries. Topped with homemade whipped cream and it's a hit! No changes needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjc_cooks"
},
"reviewBody": "This is an easy recipe that yields a really moist, tasty cake. Everybody loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Bloemen-Dow"
},
"reviewBody": "I made this the other day for my family. My 9 year old now calls it his favourite cake! Making it again today I also swapped the shortening for becel margerine, excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "switch"
},
"reviewBody": "I made this exactly as the recipe. It was awesome. My husband loved it and so did our friends. The best shortcake I have made in a long time.\n\nThank you for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "Made this a few days before Easter and I froze it for freshness. Once thawed I topped it with whipped cream and strawberries. It was dense and moist. Really good for the whip creme and fresh strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Fabulous! I can't stay out of it. So, sooooo good! Mine did take an extra 14 min. to bake....not sure why. I double checked my oven temp &amp; it was right on but maybe it wasn't hot enough to start?? IDK, just keep that in mind, just in case you have to bake longer also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "This is a good shortcake for strawberries. It rose up nicely and baked well, although I had to bake for 16 additional minutes as it was no where near done at the 25 minute mark."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "Wonderful cake to serve as the base for strawberry shortcake. The cake soaked up the syrup nicely. We really enjoyed this easy to put together cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "merhope1011"
},
"reviewBody": "I followed others' suggestions and substituted butter for shortening and did not make any other changes to the batter ingredients. I chose to make cupcakes (1 dozen) out of the batter. I greased (w/shortening) and floured each cup in the pan. I like to use a regular sized ice cream disher for measuring out batter into cupcake/muffin tins, and I was able to fit one leveled scoop of batter plus maybe a third into each cup in the tin. **This did require a lot of scraping of the bowl and the disher to fill each of the 12 cups equally. Baked at 350F for 20 minutes and they came out just barely browned around the edges. The taste is plain for us just by itself, but it will be perfect for individual strawberry shortcakes. **We live in Northern CO and also have a gas oven; I would watch carefully if you choose to bake these as cupcakes to make sure they don't get dried out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelodwro"
},
"reviewBody": "I work at a special needs hospital, the clients and staff alike love this shortcake.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tish"
},
"reviewBody": "This is exactly the one egg cake recipe my mum,then sisters, then me, then my nieces - well, you get the picture - made for our favorite b-day cake! With this cake, cut right from the pan, we'd pour homemade chocolate sauce/syrup or a lemon sauce. Sometimes I'd cook up a batch of pudding and use that for the sauce. I believe the name and the dish is one example of many New England quirkly named items from way back in the day. Ever hear of blueberry slump? Apple pan dowdy? Johnnycake? I think mum's recipe did not even have a heat level or time! Right now I'm salivating at the memory...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "This was delicious. Ran out of strawberries and whipped cream so we happily finished it off without. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Pickerrell"
},
"reviewBody": "Perfect! Just what I was looking for in a shortcake to have with strawberries and whipped cream. I used butter-flavored shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelster"
},
"reviewBody": "perfect. I don't like the crumbly biscuit shortcake, this is a mix between that and cake! Perfect with the strawberries that have been soaked in sugar, lime and tequila."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "I loved this cake. I will make again and again! I made it exactly as recipe stated. HOWEVER I needed to cook it almost 50 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "The submitter describes her grandmother's cake quite accurately, and Hubs and I were both pleased she decided to share the recipe with us as we enjoyed it a great deal. It's tender, sweet and moist, perfect as shortcake, but I could easily see this as cupcakes too. Even a 9x9\" cake tends to be too much for Hubs and me, so I baked these in a 6-heart shaped individual Wilton cakelet pan, which yielded 12, perfectly portioned little cakes. One or two per serving is quite sufficient and the rest I simply froze for quick future desserts. The recipe is perfect as is - those grandmas sure did know what they were doing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanilla Sugar"
},
"reviewBody": "Our prefferd cake for strawberry short cake..... However I did sub butter for veg shortening!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brwnsgr2862"
},
"reviewBody": "Lovely recipe! I did substitute butter for shortening, and it baked for much longer than 30min (about 40-50). I'm thinking next time I'll bake this in a half sheet pan to make serving strawberry shortcakes easier :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "This was exactly what I was looking for. Made this for my mother's birthday after she told me this was her and my grandfathers favorite way for for any kind of fruit shortcake wither it be strawberries, blueberries, blackberries, etc. I doubled the recipe and put it in a 13x9 backing dish and it had to bake for 50+ minutes for the center to cook but came out great. I even had a chunk with sausage gravy over it which was surprisingly quite excellent (course I had to have a second helping) LOL."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Granny Made It Best"
},
"reviewBody": "Like other reviewers, it took about 50 min. to bake. I believe I should have used two pans instead of one and of course, it probably would have cooked in 25 min. In the directions, you will notice the person who submitted the recipe used the word PANS instead of pan. Therefore, I believe two pans are needed instead of one. I was not impressed with the cake, but my husband liked it. He's like Mikey though, he will eat anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thedailygourmet"
},
"reviewBody": "This is a KEEPER! The only swap I made was to use butter in place of the shortening. This was perfectly moist w/ the right amount of sweetness. I could see this being a great base to morph other recipes off of."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I admit I had reservations about this cake but wanted to try it because I wanted to make strawberry shortcake and wanted to try something other than my usual and this cake notes that it is for shortcake recipes. I still wasn't convinced when I made the batter, still wasn't convinced when the cake was baked but was overwhelmed when I put it all together because it made the best ever strawberry shortcake! Outstanding!! It's sorta like a cross between a sponge cake and pound cake, not one or the other but both somehow. It soaked up the liquid from the berries, had a perfect crumb, was moist, slightly sweet and just made the dessert. On it's own it doesn't seem to be anything special but when combined with sweet juicey fruit and whipped cream it's perfect. This would be good with peaches too. Thanks Kaylene for sharing your Grandmother's recipe! It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Willoughby"
},
"reviewBody": "I made this tonight to use with some fresh strawberries. 5 votes of mmmmm from my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debskitchen"
},
"reviewBody": "I used butter instead of shortening. And everyone L O V E, loved it! Added Fresh bluberry Compote, vanilla pudding, whipped cream. I will be using this recipe for years to come. Can't wait for strawberry season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheHobbitBaker"
},
"reviewBody": "This is awesome shortcake!!! Not really too good for eating by itself, but with strawberries and whipped cream, it can't be beat!!! Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie Coma"
},
"reviewBody": "I made this for the first time over Labor Day weekend 2011. The shortcake is very good...just what you would expect taste and consistency-wise. I used my 9x9 inch metal pan and the baking time was 30 minutes (checked after 25 min as in directions). I did not turn the cake out onto another plate...just left it in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHARRYN"
},
"reviewBody": "Made this exactly to the recipe and it was a hit. I'm going to make it as a sheet cake sometime and frost it with a strawberry glaze and then whipped topping. Should be awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susanb"
},
"reviewBody": "This cake was delicious topped with strawberries and whipped cream for dessert and served plain as a coffeecake with breakfast the next morning. I did sprinkle it with cinnamon and sugar before baking it and I used softened butter in place of vegetable shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow this cake was fantastic! A perfect intersection of biscuit and cake for strawberry shortcake. It combines the sweet, delicateness of cake with the heartier texture and outer crust of biscuits. The crust on this cake was actually the best part -- an almost caramelized, lightly crunchy exterior. Awesome! \n\nI did use butter instead of shortening, which I suspect helped with the yummy carmelizing on the crust. I put it in an 8\"x11.5\" pan (all I had available), which I'd sprayed, lined with parchment and sprayed again. It needed about 33 minutes to come out toothpick clean and was perfect that way. Came out of the pan with the crust in tact and beautiful.\n\nI usually find strawberry shortcake bases too bland or too tough and biscuit-like. This one was none ot those things and will be my only base for shortcake from now on! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Daus"
},
"reviewBody": "GREASE AND FLOUR YOUR PANS!!! It just says grease in the instructions. I had to make a second double batch because it stuck to the both pans. BUT ~~~This was so good! I doubled the recipe because I was going to do more of a double layer cake presentation with strawberries and whip cream. My son wants it as his birthday cake with frosting (not a berries and whip cream kind of kid). It did take longer than the time it says, but then again, I had to lower my oven temp by 25 degrees because I was using darker non stick pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tbone5866"
},
"reviewBody": "Maybe my expectations were all wrong in terms of what a shortcake really is but i didn't care for the taste of this cake at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caddie"
},
"reviewBody": "Oh. my. word. This is so super divine! It is SO fresh and moist and just wonderful!!! This is gonna be a regular in my house! Its so delicious it doesn't even need a topping! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "I made this last night for my bf's birthday cake. I followed the recipe to a T, and it came out perfect. I sliced it in half horizontally, filled &amp; topped it with homemade strawberry whipped cream &amp; strawberry purée. &amp; ending it with sliced fresh strawberries on top. Best strawberry shortcake ever! Huge hit! Thank you. This is my go to from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darceyn"
},
"reviewBody": "Made it just like the directions... it did cook about an extra 17 mins to make the middle not doughy. It was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helena"
},
"reviewBody": "This is the One Egg Cake my mom would bake as an afterschool snack for us!(This was some fifty plus years ago!) It was the best! She would sometimes add orange or lemon zest to change it up! What a joy to find this recipe! I am going to bake one right now and surprise my mom w/ some!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKIECRAZYMOM"
},
"reviewBody": "I have been making a recipe that is very similar, only thing different is that some of the measurements of the ingredients are slightly less. I have been making this cake for 25+ years. Would not make anything else for our shortcake, the recipe can be doubled with no problems, just use a 11 x 13 or similar size pan and I have always greased the pan with some spray Pam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tolly"
},
"reviewBody": "I was shocked to see this recipe. My husband makes this and a home made chocolate sauce to go on top. He got the recipe from his mother 40 years ago..it is the BEST!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edna Mallet-Park"
},
"reviewBody": "I have been making this recipe for years and years, I sometimes add blueberries in the recipe and then use it with a hot brown sugar sauce over it, delicious. It is the only recipe I use for Strawberry shortcake. \nI have it in y recipe box as a \"one egg cake\", but the recipe is the same as this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shan82902"
},
"reviewBody": "I've been looking for a simple but good shortcake recipe. I love strawberry shortcakes, and never made 1 myself. And this was my first 1 I made, and it seemed so easy compared to the rest. And so glad I picked this 1 to try. You won't be sorry to try this! I didn't have any strawberries, I just wanted to try it before i went out and bought some. And this is good all by itself! Yummy, I'm sure even better with the strawberries! And I read some of the other reviews, and some had different timing then what the recipe had said. Mine came out right on time, 25mins exactly. I guess it just depends on your oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pbrooks_2000"
},
"reviewBody": "This cake is, unfortunately, too good. I ate entirely more than my share! At first I thought the taste of baking powder was too strong, but later decided that was part of why I liked it so much. I did have to keep resetting the timer to get it done in the middle. So, my question is...should it be cake like in the center, or should I have pulled it out after 25 minutes, so it would be like pudding in the middle? Whatever...I like it a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Oh my gosh, this is so yummy! The only change was, I made it with butter instead of shorting. I served it with fresh strawberries and pineapple topped with homemade whipped cream with a bit of cream cheese in it. This is a dessert I will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paleonyx"
},
"reviewBody": "I followed the recipe as written, very simple and delicious! I will be trying this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic recipe! I made it exactly as directed. I sprayed a 9x9 baking dish, sprayed it with non-stick spray, put down parchment paper, sprayed again, and it came out of the pan beautifully after cooling 10 min. The only reason I didn't give it 5 stars was because I also had to keep it in the oven longer. In total, almost 50 min in the oven for a toothpick \"inserted into center comes out clean\". It's late, and I'm really tired, BUT..I put my strawberry sauce and homemade whipped cream on top of a slice of it while it was still warm and my tummy is ooooooooh so happy! YUM! I would like to experiment with this recipe. Like adding perhaps 1/2 tsp of vanilla next time, maybe sub half the shortening with butter. Just for fun, NOT because it needs it. OH, also, DO NOT skimp on the sugar. Thank you! ps..I'd love to know why it's called Cottage Pudding cake lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I made this for the first time, and it is very good. We did eat it as shortcake, but is good alone. I even put too much shortening in by mistake and it still turned out good. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Green"
},
"reviewBody": "made this exactly as stated in recipe and it came out perfect. Great texture and taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "This is our favorite base for strawberries (or any other fruit). I prefer to use butter and this has to be extremely well creamed with sugar. You can also cut back on sugar by 1/4 cup. Do not overmix when adding flour and milk. These are just a few tips on this little gem of a cake being successful. Can also be used for an upside down cake - the possibilities are endless. Enjoy and thanks for submitting something straightforward and simple."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/218000/cottage-pudding-cake-for-strawberry-shortcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/218000/cottage-pudding-cake-for-strawberry-shortcake/",
"name": "Cottage Pudding (Cake for Strawberry Shortcake)"
}
}
]
}
}
, "about": [
]
}
]