				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crab-Stuffed Filet Mignon with Whiskey Peppercorn Sauce"
,"datePublished": "2019-04-02T02:44:51.000-04:00"
,"dateModified": "2022-06-07T20:37:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SUEZINOHIO"
,"url": "https://www.allrecipes.com/cook/583817"
}
]
,"description": "Delicious filet mignon stuffed with succulent crab, wrapped in bacon, and topped with whiskey-peppercorn sauce. Time consuming, but just as good, if not better than any high-end restaurant recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hcJkdxJ5q-pg-dLuVC7xGQYD_Pg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4472385-b0a36eda735c44ef98eca86c26a6d122.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crab-Stuffed Filet Mignon with Whiskey Peppercorn Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "317"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "748 kcal"
,"carbohydrateContent": "7 g"
,"cholesterolContent": "215 mg"
,"fiberContent": "1 g"
,"proteinContent": "41 g"
,"saturatedFatContent": "25 g"
,"sodiumContent": "1175 mg"
,"sugarContent": "0 g"
,"fatContent": "57 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"2 tablespoons olive oil",
"1 teaspoon minced onion",
"1 teaspoon minced green onion",
"1 teaspoon minced garlic",
"1 teaspoon minced celery",
"1 teaspoon minced green bell pepper",
"2 tablespoons shrimp stock or water",
"1 (6 ounce) can crab meat, drained",
"2 tablespoons bread crumbs",
"1 teaspoon Cajun seasoning",
"1.25 cups beef broth",
"1 teaspoon cracked black pepper",
"1 fluid ounce whiskey",
"1 cup heavy cream",
"4 (6 ounce) filet mignon steaks",
"4 slices bacon, cooked lightly",
"salt and cracked black pepper to taste",
"1 tablespoon olive oil",
"1 clove garlic, minced",
"1 teaspoon minced shallot",
"1 cup crimini mushrooms, sliced",
"1 fluid ounce whiskey",
"1 teaspoon Dijon mustard" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make Crab Stuffing: Heat 2 tablespoons olive oil in a large skillet. Saute onion, green onion, garlic, celery, and green pepper until tender. Stir in shrimp stock, crab meat, bread crumbs, and Cajun seasoning. Remove from heat, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Prepare Peppercorn Sauce: In a small saucepan over medium heat, combine beef broth and cracked black pepper. Simmer until reduced to 1 cup, stirring frequently. Add 1 ounce whiskey and cream. Continue simmering until reduced to 1 cup. Remove from heat, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Prepare Steaks: Slice a pocket into the side of each steak, and stuff generously with crab stuffing. Wrap bacon around the side, and secure with toothpicks. Season to taste with salt and pepper; set aside. Heat olive oil in a large cast iron skillet over medium heat. Saute garlic and shallot for 1 minute. Stir in mushrooms, and saute until tender. Remove mushroom mixture, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Place steaks in skillet, and cook to desired doneness. Remove from skillet, and keep warm. Deglaze skillet with 1 ounce whiskey. Reduce heat, and stir in peppercorn sauce and Dijon mustard. Add mushroom mixture, and reduce sauce until thickened. Remove toothpicks and bacon from steaks, and arrange steaks on a plate. Top with sauce."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Nevarez"
},
"reviewBody": "Great recipe. Worth the time and great choice if trying to impress someone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Oliver"
},
"reviewBody": "Time consuming but delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Packers Fan"
},
"reviewBody": "Made the recipe as stated. Nothing else to say by DEE-LISH! We loved it (steak was perfectly rare for us) and will definitely be making it again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimbali00"
},
"reviewBody": "Came out perfectly! We like our steak well done, so I seared it in the skillet then cooked in the oven for 15 min and under the broiler for 5 to crisp. Delish! \n*Used foil to keep it from drying out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norman Dynneson"
},
"reviewBody": "It was as good as others have said. A perfect Valentine dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Maria Venturini"
},
"reviewBody": "I have made the recipe so many times for so many occasions and for so many different people and the result is always the same - sheer delight!! This dish is amazingly delicious. Everyone I have ever made it for absolutely loves it. It is a very simple and quick (I might add) recipe especially if you know what you are doing and if you know how to manage your kitchen. \n\nThe reason for my review after making this recipe so many times before and aside from my compliments, is that I couldn't help but strongly disagree with a review that said it takes more like 3 hours to prepare than 1.5 hours to prepare......oh, please! If this simple, yet fabulously chic and delicious recipe takes more than an hour and a half, then excuse me but you clearly do not know the first thing about time management in a kitchen. This recipe takes me much less time than the allotted 1.5 hours - much less. Cooking does not require approximation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "Our guests were very impressed. I went heavy on the garlic - today I am paying for that. That said, if I had sautéed longer at the prep level the taste would have mellowed. On the \"cooking longer\" note, when I prepped the stuffing I did not let it fully warm up - a mistake. the preferred doneness of the steak was rare and that did not allow the internal temperature to rise to \"cook\" the stuffing - in fact is was cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lazy Acres 1"
},
"reviewBody": "Excellent! Takes a lot of time but worth the wait."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn and Dave"
},
"reviewBody": "WOW!!.... a lovely delicious meal.... lots of prep and timing involved, but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janellesue82"
},
"reviewBody": "Absolutely perfect meal to prep and enjoy together!! Beautiful, savory and a definite repeat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bodat57"
},
"reviewBody": "Made this a number of times. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this a number of times. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brianq727"
},
"reviewBody": "Holy moly! Wow this was probably the best meal I've ever made. My wife asked to make crab stuffed filet thinking I couldn't do it and this recipe blew her pants off. \n\nYes it takes some time to reduce the sauce but was completely worth the effort. The rest of the meal was simple to make and only required some mincing and mixing. I opted to make shrimp stock and use it vs. water. (very simple recipe to make the shrimp stock). \n\nIf you want to impress someone this is the meal to cook for that special person. Wow wow wow, it's that good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Kraengel"
},
"reviewBody": "Incredible!! Easy and fun....wonderful with fresh guacamole and rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erich J"
},
"reviewBody": "This was great. I pretty much followed the recipe except omitted the green bell pepper and added some potatoes. I didn’t have shrimp stock or clam juice so I substituted a Korean shrimp paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Jordan Stankiewicz"
},
"reviewBody": "Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "Fabulous meal but a ton of work. I mostly followed the recipe but did make more crab stuffing as others suggested. I ended up with a bit extra and made a couple small crab cakes out of it for the side.\n\nMy only real modification was to cook the filets with a Sous Vide which required some change in the process, and I skipped the bacon. I cut the pockets into the filet before cooking, then seared them on my grill and put in the (warm) crab stuffing at the end. Because I didn't cook the filets in the pan, I didn't have the benefit of the glaze in the pan for the sauce. I added the juices from the bag that I cooked the steak in, but the gravy still turned out lighter in color than shown in the picture. But, it was still very flavorful. I used brandy instead of whiskey because I'm not a fan of whisky.\n\nThis is definitely a 'do again'.....when I have a lot of time to prepare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Myfobo"
},
"reviewBody": "I agree with other reviewers, this was time consuming but very pleased with the results. Made for an excellent valentines dinner for 4. Will absolutely be making again but won’t bother with the stuffing. The whiskey sauce is the star of this recipe - I used Jack Daniels - next time I will double the sauce and skip the stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitty"
},
"reviewBody": "I didn’t make the crab stuffing but we loved the sauce. I also found it took longer to reduce than recipe suggests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Billock"
},
"reviewBody": "The whiskey peppercorn sauce was incredible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cortney Yates"
},
"reviewBody": "This was AAAHHHMAZING!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abby Allen"
},
"reviewBody": "My husband and I made it together for our Valentine's Day dinner. It was amazing! Not difficult at all. We made sure to have everything prepped and ready to go. It did take awhile to make, but that was half the fun of it and we'll worth it! Special dinner for a special evening :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hawksmeals"
},
"reviewBody": "The sauce rocks!! The whole family loved the mushrooms (which I added more than called for), all the seasonings were great. We must be spoiled though, living close to the NW. We purchased crab that had been processed in a jar as apposed to fresh, and it was absolutely disgusting. Ruined the tenderloin flavor, and almost the sauce. If your used to \"fresh caught\" seafood, skip the crab, and just stick to the sauce. Cast iron pan completely makes for a perfect deglazing of the flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JP1"
},
"reviewBody": "Pure Awesomeness...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdonahue"
},
"reviewBody": "Very good but we need to double the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nyegrace"
},
"reviewBody": "This is AMAZING!!!!! It was very time consuming but worth every second. I took others' advice and made the crab stuffing and sauce earlier in the day. Per their advice, I doubled the crab stuffing, which wasn't really necessary and cost $$. I had plenty left over and ended up making five crab cakes with it. I also microwaved the bacon to cook it slightly before wrapping the steaks. I ended up getting 8 oz. tenderloins and needed more than one slice to wrap around. If you prep ahead like this, finishing this amazing dish is easy. The sauce didn't thickened as much so I just added cornstarch to get the right consistency. I invited eight people for a wine tasting dinner party and the red wine complimented this meal perfectly!! Everyone raved about it!!! I fixed it with the All Recipes butternut squash risotto (fabulous!!!) and served asparagus as well. It was a HUGE HIT!!! There are actually three separate recipes in this one which is awesome...the crab stuffing could be used in stuffed mushrooms and they would be incredible. And the sauce!! It is, BY FAR, one of the best I've ever tasted and could be used on many types of meat or chicken. Try this!!! Your friends will rave about it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christian"
},
"reviewBody": "The only reason I didn't give this recipe 5 stars is because of the all the prep. There is ALOT of prep before hand. When we made it, we used Knob Creek whiskey which added that wonderful flavor to it. After everything was made and put together, it was kind of messy to eat. Definitely will take another go at this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosy Amodio"
},
"reviewBody": "Made this spectacular dish for Valentines day with twice baked potato and lobster tail (I submitted the photo). I followed the advice of a few reviews, prepared the stuffing and sauce reduction the night before. This recipe was not difficult. It surprised and pleased the pallets of all my guests!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Ovsiyenko"
},
"reviewBody": "This is time consuming but worth every minute!! It's wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Pye"
},
"reviewBody": "I cook my filets in the pan, then broil then for about 10 minutes, depending on thickness. I also use about a cup or so of whiskey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "Fabulous. Made it for a gourmet dinner and everyone raved about it. Steak melted in our mouths. Our expectations were high and it surpassed everything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slim Jim"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste"
},
"reviewBody": "Tried this recipe this evening and I got thumbs up, all around! It was absolutely delicious, and contrary to the many comments about it being too time consuming, I had it on the table in less than an hour, from start to finish. I served it with whipped potatoes and steamed asparagus and Cherries Jubliee for dessert! Definitely making this again! I give it 5 stars!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Rote Jr"
},
"reviewBody": "as a second option add Dijon mustard to taste along with fresh sliced mushrooms,add mushrooms just prior to service,the residual heat will cook the mushrooms perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Obviously it's a special occasion only kind of dish, but it was so very worth the work. That sauce was one of the best things I've ever tasted. I didn't change a thing, nor would I. This is a delicious, elegant meal, perfect for an anniversary or the birthday of someone you REALLY love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jose Hugo"
},
"reviewBody": "I made this last night for my grandmas retirement dinner, and let me just say it turned out amazing!!!! The filets that I had were so big, I had to use 2 pieces of bacon to wrap each one. I used cherry wood bacon which had an awesome taste. The steaks I had were about 2 inches thick, so I had plenty of room to stuff crab in them. As far as cooking them, I didn't use a pan. I first put them in the oven on 380° for about 10 minutes. Just enough to get a nice brown on the outside. I set them to the side for a little bit, so I could finish my parmesan risotto and grilled asparagus with a balsamic glaze. After that, I put the steaks on the grill for about 5-10 minutes. By the time they were done, they were nice and red on the inside. They were a beautiful medium rare. Would highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tonks"
},
"reviewBody": "I used rum instead of whisky for taste preference, so this likely could have been a 4 star recipe if I had used the whisky instead (taste might have become palatable with cooking - who knows?)\n\nIt was quite tasty overall, but not as good as I was expecting. With all the work involved, I probably won't make this recipe again. Perhaps some alterations, such adding the mustard right at the end to keep the flavour sharp, or making a sauce with lump crab meat and serving it on top of steak. And more flavour in the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marissa"
},
"reviewBody": "I have made this several times and still get excited making it. This is the best steak I have ever had!!! That cream sauce is killer and adding a crab stuffed steak....really what more can you ask for. DON'T CHANGE A THING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris L"
},
"reviewBody": "Amazing, it even tasted good with the $5 fillets in a package from Walmart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Winfield"
},
"reviewBody": "Absolutely Amazing! I used pretty big sized filets (toward the .85-1 mark) so I definitely doubled the crab filling (even though I only made two steaks) Also- I forgot to add the dijon mayo at the end, and it still turned out great! This is time consuming, so set aside about 2-230 hours to get everything ready (veggies, potato, etc)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Maria Corteo"
},
"reviewBody": "Amazing is the only word to describe this recipe! Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly"
},
"reviewBody": "Love, love, loved it!! I purchased the filets at Walmart with the bacon already wrapped on the filets. I think next time I will grill the steaks first and then stuff the crabmeat. I served with roasted red potatoes and fresh asparagus. It does take time to make but well worth it. Thank you for sharing your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Segner"
},
"reviewBody": "I made this for my boyfriend and he said it was the best steak he'd ever had in his life. Everything about this recipe is wonderful and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MS Gulf Coast"
},
"reviewBody": "I cooked this last night and it was wonderful. The whiskey-peppercorn sauce is a great compliment to the crabmeat stuffed filet. Like others it does take a little longer than 1 1/2 hrs to make. I did find that the sauce had to be cooked above a simmer to thicken enough for the steaks. I served with a basic risotto."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Younglove"
},
"reviewBody": "Switch number 1 to number two and prepare number 2 first. That helps the length of time the very worthy reviews say make it take too long. i did manage to make everything (including baked asparagus and red potatoes) in the 1 1/2 hour, but i busted butt to do it. It was fantastic and worth every second!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlemissyt"
},
"reviewBody": "This recipe was great! I made this for my boyfriend last night, Valentine's Day, and he thought I was the best cook ever. I followed the recipes exactly except for the shallot. It turned out to have great flavor, and took less time then I thought after reading through the reviews. Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guin Fam"
},
"reviewBody": "I loved this recipe but I cannot fairly attest to the original. I altered it more due to a lack of items rather than a disagreement with any of the instructions. I didn't have green onion or shallots and I added an extra can of crab meat. Also, I thought that mushrooms would go great in this recipe so I added them as the sauce cooked down before I read that there were actually mushrooms in the recipes that were supposed to be added later. And I forgot I was out of whipping cream so I used half &amp; half. However, the main thing I did differently, was that I used Venison back strap for this recipe, not filet mignon. It was amazing. No game taste, the meat was tender, the flavors worked perfectly. This recipe is delicious and flexible. It is a little time consuming but not difficult and very very worth it. Even my two 4 year old picky girls loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bud Humber"
},
"reviewBody": "Delicious! Enjoy the cooking process, have some wine, relax and the whole thing is great. I would add more sauce because ours reduced no problem (we used 10% cream). I also pre-cooked the bacon in the oven on a cookie sheet for 8 minutes on 350 to reduce the fat and ensure it was cooked. Obviously not a quick 'work night' meal and neither should it be. I'll repeat for sure but hold the crab in reserve for those 'special nights'. Thanks for the recipe Suzie! - Bud"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Steve Blaufuss"
},
"reviewBody": "This recipe is okay. The flavor of the sauce is certainly what makes this recipe stand out. However, I found that for such a time consuming recipe; the payoff wasn't nearly worth the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAGIRL"
},
"reviewBody": "Absolutely amazing. I made it last night, using two 6 oz. filets that I stuffed with the crab mixture. I made the full amount of stuffing, but it was more than I needed for two filets. I'd say it's the perfect amount for three well-filled filets, but you could stretch it to fill four filets. We ate the extra in the bowl. It was that delicious. I started the sauce early, since I read that it takes a while to reduce. So it worked perfectly. The sauce was ready the same time that the filets were done. About 45 minutes from start to finish, but not labor intensive. I made our other dishes while the sauce was reducing. Really delicious with a wonderful sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashbeem"
},
"reviewBody": "This was incredible! We had to make a few modifications in our house because the only available filet mignon at the store was some small medallions so we couldn't quite stuff them. We made crab cakes on the side instead, and served both with the sauce. I have been hunting for a good peppercorn sauce recipe for quite some time-- this one will be added to my books. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Wow! Company worthy and restaurant quality. We did not do the crab stuffing as we enjoy filet and did not want to detract from the beef. Yes, the sauce takes a while to make, but there is no need to reduce the broth and pepper over med stirring constantly&gt;&gt;&gt; I boiled it down on high in a minute or 2. But before you put the cream in let it cool a minute, and that's when you need to take your time. We enjoy mushrooms with our steak and doubled the mushroom mixture&gt;&gt; can't imagine it would be enuf otherwise!!(used button mushrooms) and surprisingly I did not need to double the sauce. I'm surprised there were no instructions on actually cooking the filet. I used a piping hot cast iron skillet it to sear it (same one I did the mushrooms in), reduced heat a little and cooked til desired doneness (a couple we put under the broiler). Served with asparagus. Outstanding, will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Duckworth"
},
"reviewBody": "We had this same recipe last year in Dublin at a Restaurant called the Lobster Pot, being from Maine we skipped the Lobster and went for the steak, having for two weeks indulged ourselves with the finest seafood in the world....bar none, Ireland is tops for all things coming out of the ocean. \nThis dish does have a lot of steps and ingredients but if your fixing it for company you can do everything ahead of time and put it in holding pattern.....till it's time to sear the steaks, which really goes fast. This dish may also be fixed with a top-grade sirloin like they do in Ireland, but be aware their restaurant grade sirloin is far superior to ours, so buy the best or stick to a filet mignon tucking a scant teaspoon of frozen butter in with the crabmeat. This is absolutely my favorite meat dish...decadent! It is so rich, avoid the temptation of having rich side dishes, herbed/buttered string beans and a pretty salad w/pears/currents/chevre with a dash of Cherry Basalmic....oh my!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naydeenie"
},
"reviewBody": "Wow, so this recipe is a good one! HOWEVER, like some of the reviewers said, this DEFINITELY takes longer than an hour and a half!!! I should have known just by looking at the ingredients, but it took about 3 hours or so. And also, EXPENSIVE. I only made this because my grandpa came to town and wanted something fancier- and he bought the groceries (had most of the ingredients already), which were a staggering $80!!!!!! for 4 people...ouch. Either way, he appreciated my effort and both him and my husband were raving until we went to bed. I probably won't make this again unless it's a VERY special occasion and someone else is buying!!! But, all in all, great recipe...this is one of the few recipes I've done that I wouldn't have been able to come up with out of my head, and it was succulent. If you have the time and money, it's worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnapoli9800"
},
"reviewBody": "It was so worth it! I made it for my two girls and my neighbor and my youngest daughter finished off everything and then some! I can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Baker"
},
"reviewBody": "Yep. Well worth it. Buy the best cut of meat possible. Sauce was fantastic. Think I'll forgo the bacon next time. Crab stuffing was great. I put it on top instead of stuffing and grilled the filets instead of doing them in the skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Baker"
},
"reviewBody": "Yep. Well worth it. Buy the best cut of meat possible. Sauce was fantastic. Think I'll forgo the bacon next time. Crab stuffing was great. I put it on top instead of stuffing and grilled the filets instead of doing them in the skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nurse cooksalot"
},
"reviewBody": "This recipe is phenomenal! I reserve it for special occasions only, as it does take some time. The crab stuffing is great, but i prefer to put it on top of the steaks and drizzle everything with the sauce before serving. I also suggest partially cooking the bacon before attaching it to the steaks, it just makes it a bit crisper at the end. The sauce does take a while to simmer down, but if you start it first, and let it go while you do the rest of your cooking and prep work, its not so time consuming. During the final simmer, just keep your steaks warm and get your vegetable side or salad ready, then it doesn't feel like it took forever. I like to serve it with mashed potatoes to soak up any leftover sauce on the plate! Wonderful dish, I highly recommend it, especially if your trying to impress!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dawn Norby"
},
"reviewBody": "Only made the sauce. Won't make it again, as was told there wasn't a bold enough flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marni Nelson"
},
"reviewBody": "Amazing. The mushroom sauce was unbelievable. It did take a long time to reduce but it was well worth it. There was almost too much going on, with the crab stuffing and the bacon wrapped around it. It would be just as great with a simple steak and the sauce. I did everything exactly like it is written but I used two 8 oz filets and stuffed them with more of the crab filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnn Rajczewski"
},
"reviewBody": "I made this recipe just as Sue wrote it and found it to be perfect! If there was alot of prepping, I never noticed! It was well worth any time I put into making it. I made this as a special dish for my husband for Valentine's Day. It was outstanding! My husband loved it! I will make this again and again. Thank you for a keeper recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanie"
},
"reviewBody": "made this a few yrs back and it was to die for!! lost the pecipe but thank goodness this website still has it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MG648"
},
"reviewBody": "Awesome! Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoolia"
},
"reviewBody": "This recipe is spectacularly good. The flavor in the sauce rivals any I've had at high end steakhouses. I agree with a number of the other reviewers that you should allow yourself PLENTY of time for this recipe. It took me just under 3 hours. I think prepping the ingredients the day before for the crab stuffing might help. Prepare for the cream sauce to cook down slowly; it took over 40 minutes on my stove. All that aside, fabulous and will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAPAW JOE"
},
"reviewBody": "Great Sauce!! Made original recipe for entire meal first- Used just sauce recipe for grilled steaks ! What I did was use a lesser pc. of steak in the cast iron skillet to get my yum-yums to deglaze for final steps! I made extra sauce for freezing! Sauce is also good on roast beef!! Thanks- PEACE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michael7667"
},
"reviewBody": "This was AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cgillogy"
},
"reviewBody": "Very good, I could actually feel myself gaining weight, but that's the point with something like this, and totally worth it. Very, very, rich, but very, very, satisfying. I'll be making this again, although prob only about once or twice a year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "I am only rating the Peppercorn Sauce, as I served this on boneless pork chops! The tast was PERFECT and exactly what I was looking for. The sauce did not thicken and I wish the recipe gave some approximations of time for the sauce to reduce. Next time I may add cornstarch or something to thicken the sauce a bit. Thank you for sharing this wonderful sauce recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna Doyle Lundy"
},
"reviewBody": "The peppercorn sauce was so easy to make and was absolutely delicious although not the best for you! However, the crab stuffing was way too salty and I like my food well seasoned. I also don't think the crab stuffing really complimented the rest. I would rather have these steaks with the sauce and a crab cake on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "josef2"
},
"reviewBody": "Is this food or heaven? Holy crud this is good. It's a heavy meal but I loved every single torturous bite of it, nearly rupturing my stomach to finish it all :-)\n\nI'm not crying about it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah"
},
"reviewBody": "I made this dish for Valentine's dinner and my boyfriend absolutely LOVED it. He said it was possibly the best steak he had ever had! I don't eat meat so I can only speak from the look on his face and what he told me but DELICIOUS :) I omitted the crab stuffing at the suggestion of a lot of people on here and he didn't seem to miss it. He said it was perfect without it. I will definitely make this again. THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Joiner"
},
"reviewBody": "Definitely took a long time to prepare the sauce (maybe an hour) but my boyfriend and I loved this. We used Woodford Reserve whiskey and we think it made a big difference. Cooked in the skillet this time but will probably grill the filets next time. Served with roasted garlic mashed potatoes and roasted asparagus. Great for Valentine's Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "I really wish I could give this 100 stars! I didn't make the crab stuffing but I'm rating this for the sauce. It was one of the best things I've ever made from this website. First, let me say, that it is time consuming, but, oh so worth it. When my very fussy, picky husband said it tastes like something you get from a 5 star restaurant (and he'd eaten all over the world) then I know I've got a winner. The method of reducing the sauce takes about 45-50 minutes. I kept checking it but it looked like it was reducing, but finally, it seems in the last 5 minutes it reduced to the most best flavor, thick sauce. Then using the crimini mushrooms was so great and the whiskey was perfect. I will definately be making this again and plan on serving it to guests next time. Thank you so much for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becca"
},
"reviewBody": "Just a personal taste, but I preferred these without the crab stuffing. Not only does the crab stuffing make this dish shoot way up ($$), but I thought it tasted too rich and added a lot more steps of work! The sauce is great, and so I will make this again w/ just the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina Preston"
},
"reviewBody": "wonderful. Great flavor, great recipe, just have to alot time to make this and it really isn''t that time consuming gj suezinohio you've got my stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JJsMama"
},
"reviewBody": "This was absolutely delicious. By far one of the best recipes I've ever made. The sauce by itself was to die for and deserves 10 stars, it can be used on so many different things. It's a very pricey meal which is why it sat in my recipe box for over 2 years. We made it on Christmas Eve and even though I made the crab stuffing and began the sauce, as well as stuffed the steaks beforehand, it still took forever. I don't think I'll make this again because after all the time it took and the cost of the meal, we might as well have went out to eat. It was very very good, though and kind of made me feel like a chef :) Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Creampuff"
},
"reviewBody": "My daughter-in-law and son made this for my birthday celebration (so I can't speak to the ease of prep.) but it was just wonderful! The crabmeat stuffing was great in the filet and the sauce put it over the top. They served it with a salad and steamed asparagus. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessa Schober"
},
"reviewBody": "Just the sauce - def takes hours to reduce. This is very good, but not 5 star. Very rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaydee Mae"
},
"reviewBody": "INCREDIBLE! It really isn't difficult to make, but comes out very impressive. We stuff our filets with the crab mixture, wrap in bacon, and put them on the grill. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tnbollar"
},
"reviewBody": "Took WAY too much time to make this dish and the taste wasn't anything worth spending so much time on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrey Vensky"
},
"reviewBody": "Stunning! Made it for my wedding anniversary and everyone wanted seconds (alas, there were none). I only made two substitutions - user whole green peppercorns for the sauce and wholegrain mustard instead of dijon. Oh, and I flambeed the steaks as well. Turned out excellent, thankyou author!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LatinaCook"
},
"reviewBody": "I liked this A LOT! Made exactly as directed EXCEPT I used half and half instead of heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TURBOSAUR"
},
"reviewBody": "This was fantastic, however I like my filet mignon a little on the rare side. I didn't like the idea of the crab meat on the inside soaking up all the blood and juces from the raw beef and I knew that the bacon wouldn't cook crispy in the time it takes to cook a rare steak. I skipped the bacon completely (c'mon, who needs crab stuffing, cream sauce AND bacon??I just can't handle that much giult in one meal!) instead of stuffing the filets, I seared them on the stove in a hot cast iron pan, then moved them to a foil lined baking sheet, I topped them with the crab meat stuffing, a small pat of butter on top and put them under the broiler until the stuffing browned on top. It was spectacular"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was dissapointed! For all the work and such a fancy-sounding title, I had hoped for better flavor. There are better steak recipes on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "pinksnowflakeliz"
},
"reviewBody": "I was dissapointed! For all the work and such a fancy-sounding title, I had hoped for better flavor. There are better steak recipes on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ssiano"
},
"reviewBody": "I hate to give 2 stars..... But.. I followed the recipe as is. The bacon surely needs to be cooked prior to wrapping around the steak (otherwise it won't be cooked at all)... I LOVE steak and seafood... We bought really nice filets and couldn't even taste the flavor of the meat because it was so ovewhlemed with the sauce &amp; stuffing. The stuffing doesn't even have crab taste to it. This was a great idea, but didn't pan out well for a couple who LOVE the flavor of a good steak and fresh crab meat..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LadyTerp"
},
"reviewBody": "I agree with the other reviews, awesome, awesome, awesome meal! Restaurant quality, but I am so tired after making this meal. I would buy all the ingredients already minced, and I personally would skip the mushrooms. I also made potatoes and asparagus to go with it. Tasted great! I used J.Daniels for the whiskey. I was confused about cooking the filet, but I placed it in the skillet and turned it over about three times and then placed it in a 350 degree oven for about ten minutes. Turned out perfectly medium. Put the thick cut bacon in the oven on 450 for about ten minutes, keeps it's shape better in the oven when you cook it what way. My filets were about 3 inches thick, so adjust time accordingly. Great, great recipe, terrible to make on a work night :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen w"
},
"reviewBody": "Sooooo gooood! My husband loves this so much. I don't do seafood so I had my steak without the crab stuffing and it was very good. It was a very special romantic dinner and I couldn't have chosen a better meal for him. I will definately be fixing this for him again and again. I didn't think it was to time consuming to make, but then again, I love to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sooooo gooood! My husband loves this so much. I don't do seafood so I had my steak without the crab stuffing and it was very good. It was a very special romantic dinner and I couldn't have chosen a better meal for him. I will definately be fixing this for him again and again. I didn't think it was to time consuming to make, but then again, I love to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Skinner Reitemeyer"
},
"reviewBody": "Delicious. Everything blended together perfectly! Only problem I had was it was hard to tell if the steaks were done due to the stuffing and bacon! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovefood"
},
"reviewBody": "i have prepared this dish for years. we have a large family and i cook alot. my 5 boys can't get enough of this and it always ends up the birthday request meal. although time consuming - this is more than worth the effort. since you will be stuck in the kitchen anyway, don't use canned crab. large chunks of king crab legs make it that much more special and eliminates the salty/fishy flavor some have mentioned. the sauce - by far - the most outstanding. make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Johnson"
},
"reviewBody": "The peppercorn sauce is WONDERFUL!! The filet is the sauce delivery device and the stuffing is the icing. I sopped up the last bit of sauce in the pan with a slice of bread it is that yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erin mc"
},
"reviewBody": "I decided on this recipe for my boyfriends special birthday dinner, I did find it took a bit of time, but I did expect that, and in the end, it was all worth the effort!! I always pre-measure and pre-chop everything, so cook time wasnt too bad, just had to keep popping into the kitchen to stir.My boyfriend said it was the best meal he has ever had!! These steaks definitely top anything we have ever had in any fine dining restaurant. I will definitely make again!!\nRevision: June 20/10 - This has become my boyfriends requested meal for special occasions, the revisions I have made in the several times I have made it are as follows... I buy my filets from M&amp;M meat shops, they come in various sizes and are already bacon wrapped. I stuff with straight crab meat, you wont know the difference and it cuts down on the amount of work to do, and lastly I make sure to start the whiskey-peppercorn sauce an hour before I plan on cooking, because the sauce takes a long time to reduce and thicken to the proper consistancy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Zacks"
},
"reviewBody": "I followed this recipe exactly as written, and it was FABULOUS! The only thing I would change is to double the sauce :) Yummy!! It's totally worth the time it takes to prepare..Thanks for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rachelw"
},
"reviewBody": "A few things about this recipe, parts of it are delicious but very time consuming. I made this for my husband and I on Valentines day thinking it would be a nice dinner. I think it took 2 1/2 hours to complete. My husband enjoyed it, but I didn't as much. I thought there were too many flavors for this dish. If you decide to make this dish, I recommend skipping the crab stuffing. I LOVED the whiskey sauce reduction, but the crab stuffing overpowered the rest of the delicious flavors (in my opinion.) I also recommend skipping the bacon wrapping, unless your meat isn't as nice of a cut. I feel this was an unnecessary use of calories as the whiskey peppercorn sauce has enough flavor on its own! In any case, just know that it takes more time than it says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JeanneBean"
},
"reviewBody": "I thought this was very good, but my husband who loves surf 'n' turf said he did not care for the two to be wed, if you know what I mean!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "peist"
},
"reviewBody": "This took me just less than an hour but it is a recipe for females as you certainly need to be able to multitask. The verdict was ....... gorgeous. All the tastes were divine. I think the pepper sauce was the classiest bit. My first time making a pepper sauce...... so proud!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joannie"
},
"reviewBody": "tasteful - next time I wouldn't stuff with the crab though. Maybe just put it on top of the meat unless you like your meat well done. We are rare - medium rare people and the blood just sat on top of the crabmeat. The sauce was excellent. Would make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa A."
},
"reviewBody": "SAUCE REVIEW ONLY: Yes, it takes a long time, but it is not involved. It really is worth it, great sauce! I prepared it for Valentine's Day for my husband and served with a Filet Mignon, Roasted Asparagus, Baked Potato, and Crab Cakes (I opted to make a different Crab Cake recipe to serve verses stuffing the steak with the Crab Stuffing). Next time I will prepare the sauce with a Boneless Ribeye as the Filet Mignon isn't what makes it special. You really should try the sauce recipe, you won't be disappointed. Just allow at least 2 1/2 hours for it to do its thing. And I did heed warnings and used lower sodium Beef Broth. Was a good idea indeed."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46815/crab-stuffed-filet-mignon-with-whiskey-peppercorn-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1024/meat-and-poultry/beef/steaks/filet-mignon/",
"name": "Filet Mignon Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46815/crab-stuffed-filet-mignon-with-whiskey-peppercorn-sauce/",
"name": "Crab-Stuffed Filet Mignon with Whiskey Peppercorn Sauce"
}
}
]
}
}
, "about": [
]
}
]