				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cranberry Raspberry Sauce"
,"datePublished": "1998-12-22T11:53:02.000-05:00"
,"dateModified": "2022-09-26T15:10:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ryan Downs"
,"url": "https://www.allrecipes.com/cook/24327842"
}
]
,"description": "This raspberry and cranberry sauce is enriched with red wine for a wonderful sauce that goes well with turkey at Thanksgiving or goose at Christmas."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/2ruIDylpwncS9ddmVFJ9ZWRmeiY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1515745-e822730dffc44d0b9d6195c0c4014fb2.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cranberry Raspberry Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "45"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "106 kcal"
,"carbohydrateContent": "23 g"
,"fiberContent": "3 g"
,"proteinContent": "0 g"
,"sodiumContent": "2 mg"
,"sugarContent": "18 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"12 ounces cranberries",
"2 cups raspberries",
"1 cup Merlot wine",
"0.75 cup white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Put cranberries, raspberries, Merlot, and sugar in a large saucepan. Bring to a boil, stirring occasionally. Use a whisk to mash cranberries. Reduce heat and simmer for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Serve hot or pour sauce into a container and refrigerate to serve cold."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "I made a variation of this and everyone loved it. I used natural Apple juice instead of the Merlot. \nI also used 1/2 fresh raspberries and 1/2 fresh blueberries instead of all raspberries. I also cut down on the sugar—2/3 cup is all I used. Now I make this every year!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beccy"
},
"reviewBody": "It is delicious, I did change a couple of things; 1/2 merlot, 1/2 OJ, used a sugar substitute too. No one could tell the difference. This definitely will become a staple for our Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gotrecipe?"
},
"reviewBody": "Don't know if it was me, the Merlot or the Cranberries, but mine was really, really tart!!! Or....maybe that's just the way it is suppose to turn out. Nevertheless, for my taste, I had to add more sugar which helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Lilly Bretz"
},
"reviewBody": "I made it minus the merlot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E. B."
},
"reviewBody": "This was a huge hit! I used fresh cranberries &amp; fresh raspberries. I did make a slight change, because I didn't have Merlot; so, I used Sangria, instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HpyDncr"
},
"reviewBody": "Delicious This was great. I just took a little sample taste when it was done Nice flavor Tart but a little sweet too! I'm excited I followed the recipe only thanks to others suggestions made it with apple sauce instead of merlot. My Mom is super dissapointed not to be able to get the raspberry cranberry sauce in a can anymore and I said why not see if I can do it myself. Tomorrow I will procure some gelatin mix to see if I can make it jellied and give Ocean Spray a run for their money. Yeah DIY'ers! I hope it turns out ok after this step and that it will last till the weekend Acck it's only Monday! THanks again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Shamai"
},
"reviewBody": "I just used water instead of wine and the taste was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUEROADS"
},
"reviewBody": "I made this because my niece loves the canned variety, but was recently diagnosed with an allergy to corn and there is corn syrup in the canned. Allrecipes to the rescue! This is super simple and as others, I used apple juice instead of the Merlot(we are not wine drinkers so I did not have any). I also made a second batch without the raspberries. Both were easy and delicious! Easy to make and put in the fridge the night before. I like canned, but I love these so much more!!! Am a type 2 diabetic so will try it next time with Splenda!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAE2"
},
"reviewBody": "I only used about 1/3 (+) sugar, and apple juice instead of Merlot. \nThis was FABULOUS!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wehrborn"
},
"reviewBody": "First time anyone had seconds on cranberry sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rottieprincess"
},
"reviewBody": "This was really tasty and easy to make. I did substitute a few things. I used about 3/4 cup of frozen and thawed raspberries and 1/4 strawberries and 1/4 cup of black raspberries. Instead of the wine I used white grape raspberry juice and reduced that to about 2/3-3/4 cup due to the additional liquid from the thawed, previously frozen berries. Let it come to a boil and reduced to a simmer and cooked about 12 minutes. I just gauged it by consistency and letting the cranberries burst. Thickens even more in it's own when chilled. Tasted awesome warm or chilled! Perfect blend of sweet and tartness. Definitely will make again and experiment with other berry options!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joellyn Crowley (JCrow)"
},
"reviewBody": "This was the first time I made cranberry sauce from scratch instead of opening a can. I used the suggestion of apple juice, but used a little less than a cup. I ended up with just a little more than 2 cups of fresh raspberries so I used a little less sugar. I added orange and lime zest. It came out perfect and the right consistency (not too thick and not too watery). I made this 2 days ahead and unfortunately due to a storm knocking out power we didn't have it on Thanksgiving. It got a little more tart over that time so I may not cut back on the sugar next time. Tastes great on cheesecake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Oh my gosh, this is awesome! I'm not a cranberry sauce fan, but I always feel I should serve it at Thanksgiving because it's traditional. This is the first recipe that has actually wowed me! I did add a dash of cinnamon and 1/4 t. of orange extract. I wanted the orange flavor, but I didn't want to dilute the merlot flavor. (If you don't have orange extract, you could probably use orange zest.) The merlot is what really makes this sauce a standout! (BTW, I think this is the first five-star rating I've given on this site!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "Unlike many cranberry sauces, you really taste the fruit, not just sugar. The two fruits partner well, and the reduced sugar is a definite plus. Used a potato masher to lightly crush the fruit. Liked this a lot, and this will be my Thanksgiving cranberry sauce this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb McCleary"
},
"reviewBody": "Used Apple juice instead of wine and ended up using a full cup of sugar. The raspberries make this WOW! \nI would like to try this drizzled over a slice of cheese cake ;-).\nGonna make this for Thanksgiving every year from now on. Hope there's enough left over to use with a pork roast too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoeyB"
},
"reviewBody": "Very tasty. Very easy to make. Took about 20 - 25 minutes in all. The sauce has a nice sweet / tart flavor. I used 1/2 cup Beaujolais Nouveau wine &amp; 1/2 cup water. Can still taste the wine, but it is not overpowering. I also used 1/2 white and 1/2 dark brown sugars. Goes well with turkey (obviously) but also good with chicken or pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julieannimal"
},
"reviewBody": "I never cared for cranberry sauce but I made this for Christmas dinner and everybody including me loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robin"
},
"reviewBody": "I doubled the above recipe for Thanksgiving and my house and then when it was at Heidi's. It really cooks down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ISHDI"
},
"reviewBody": "Oh, my, this is wonderful! Like others, I made with apple juice rather than wine, although I'd like to try again with wine for comparison. It's nothing like a traditional cranberry sauce ... it's sweet, but with the tart bite from the cranberries, too. Suspect it would be wonderful over ice cream or spongecake ... or both! Anxious to taste it on the turkey on Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MarinaDCA"
},
"reviewBody": "Really good with the raspberries. I used hard cider instead of Merlot however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hstraw"
},
"reviewBody": "LOVE this recipe. Have been using it for a few years and it is always a hit. I use only 3/4 merlot, and 1/4 cup OJ. Also add in a little orange zest. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darci"
},
"reviewBody": "Delicious and easy! I served this for Thanksgiving and even those who don't usually enjoy cranberries loved this! The raspberries give it a sweet kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Simple Pie"
},
"reviewBody": "Yummy! Substituted apple cider (for the kiddie's palates) as suggested in another review. I wish it had been a little thicker, but that's just my preference. It tasted amazing and was so easy. I think this will be our new holiday cranberry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "Very good! I just made this for a huge Christmas party I'm hosting tomorrow and it turned out excellent! Here are the changes I made to the recipe: I used apple juice instead of the Merlot...b/c several of my guests are expecting. Also, I used half white sugar and half brown sugar...just my own preference. Finally, I added 1/2 t. vanilla and 1/4 t. cinnamon to the mixture while it was cooking. I can't taste the cinnamon much but the vanilla really added some great flavor. Great recipe as is...or altered a bit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "I had really high hopes for this, but it never quite lived up to them. I made this the day before, and it was definitely better cold the second day, but even after adding more sugar, it was too tart for my tastes and was just okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMBER523"
},
"reviewBody": "This is an excellent recipe for an interesting twist on Cranberry sauce! I used 1 cup of apple cider instead of the Merlot. Everyone passed up the traditional sauce to have mine!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLyn"
},
"reviewBody": "One word: Amazing. My dad hates cranberry sauce, but I made him try it since we usually just have the stuff from the can, and he LOVED it! My brother started putting it on everything, and when I say everything, I mean EVERYTHING. Rolls, turkey, sweet potatoes, even apple pie. I used apple juice in place of the Merlot and it turned out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. M."
},
"reviewBody": "used frozen raspberries and dried cranberries since that's what i had on hand. and apple juice (excellent suggestion from other reviews) sweet - ate with chicken and salad. will love to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skrib"
},
"reviewBody": "I did tweak this a little! Used apple cider instead of merlot (I would like to try with the merlot, but the rest of the family abstains) and used frozen raspberries. I'm now asked to bring this every holiday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMDOUG"
},
"reviewBody": "OH SO GOOD!!! I modified by using Cabernet instead of merlot, but still delicious! I even used the leftovers to flavor a filling for a chocolate cake. I've made cranberry-raspberry sauce for years without the wine, this addition takes the flavor out of this world. I will absolutely make this again, and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARGOSHKA"
},
"reviewBody": "wonderful cran-raz sauce. I doubled the recipe for thanksgiving dinner and all my guests were impressed. And best of all, it was so easy! I'll never buy cranberry sauce from the store again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GEORGESGIRL99"
},
"reviewBody": "I followed recipe exactly, all we could taste was Merlot. It was ok but next time I will either cut down on the wine or not use this recipe at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "This had a unique taste, but was not as thick as I like in a cranberry sauce. I agree with other reviewers that it yielded WAY too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sueon"
},
"reviewBody": "This is a good sauce for Day After Sandwiches, pork and probably chicken.\n\nMy only tip is that you don't need to worry about mashing the cranberries, they do that all by themselves. As they simmer, they pop. The dish comes out a gorgeous color. If you want color at your Holiday table, this dish will provide that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KIRSTIN243"
},
"reviewBody": "Not a bad sauce. It worked very well in the day after turkey sandwiches, but it wasn't quite thick enough for my tastes and the recipe yield is way way way too much ( I could have fed a family of 30 with this much sauce)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had never made cranberry sauce before, but this one turned out sooo good! I was easy and tasted incredible. I put it on just about everything, from the turkey to the ham to the rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CMDKQB"
},
"reviewBody": "Quite good, not for children because of the liquor involved, but all the adults at Thansgiving liked it. I only gave it 4 stars because although it wasnt bitter like regular cranberry sauce, it was quite tart and it hurt my teeth, so I highly recommend taking a small amount at first until you see if you like it, no sense in wasting valuable space on your Thanksgiving plate with something you may not enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANNLAGO"
},
"reviewBody": "Aside from having made tto much, this recipe went over with family and friends really well. Everyone loved it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMSIZEMORE"
},
"reviewBody": "I get so many compliments on this sauce. It is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "We substituted apple juice (1 C.) for the merlot, it's cheaper and the sauce turned out great. It went well with our turkey, and the children even liked it because it wasn't as bitter as traditional cranberry sauce. It also tastes great as a spread for rolls."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9376/cranberry-raspberry-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1260/side-dish/sauces-and-condiments/sauces/cranberry-sauce/",
"name": "Cranberry Sauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9376/cranberry-raspberry-sauce/",
"name": "Cranberry Raspberry Sauce"
}
}
]
}
}
, "about": [
]
}
]