				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cranberry Almond Biscotti"
,"datePublished": "1997-11-12T21:12:20.000-05:00"
,"dateModified": "2022-08-08T10:47:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KATHIANNE"
,"url": "https://www.allrecipes.com/cook/215375"
}
]
,"description": "I modified a recipe to make this a darker biscotti. For a richer almond flavor, use almond extract instead of the vanilla."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BlHZhersQn612pSUHDIx8kRI_kk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/141445-49a5b294f7be4ee7987c182be5f1cbd7.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cranberry Almond Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "148"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "189 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "25 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "92 mg"
,"sugarContent": "20 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2.25 cups all-purpose flour",
"1 cup white sugar",
"1 teaspoon baking powder",
"0.5 teaspoon baking soda",
"2 egg whites",
"2 eggs",
"1 tablespoon vanilla extract",
"0.75 cup sliced almonds",
"1 cup sweetened-dried cranberries" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (170 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine dry ingredients in a medium sized mixing bowl. Whisk together eggs, egg whites, and vanilla or almond extract in a separate mixing bowl."
} ,{
"@type": "HowToStep"
,"text": "Add egg mixture to dry ingredients, mixing just until moist, using an electric mixer on medium speed. Add dried cranberries and almonds; mix thoroughly."
} ,{
"@type": "HowToStep"
,"text": "On floured surface, divide batter in half and pat each half into a log approximately 14 inches long and 1 1/2 inches thick. Place on a cookie sheet and bake 30 minutes or until firm. Cool on a wire rack about 10 minutes, or until cool enough to handle."
} ,{
"@type": "HowToStep"
,"text": "Cut biscotti on the diagonal into 1/2-inch slices. Reduce oven temperature to 300 degrees F (150 degrees C). Place cut biscotti upright on a cookie sheet, spacing them about an inch apart, and bake for an additional 20 minutes. Let cool and store in a loosely covered container."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Patricia Territo"
},
"reviewBody": "I was not impressed with this recipe. Good ingredients and time and effort just produced a cookie...not a good biscotti that is the right texture and taste. These came out TOO SOFT and if you cooked longer they came out too dark and almost burnt on bottom. I am very familiar with this cookie and this recipe was a big disappointment!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Idaho Gems"
},
"reviewBody": "Dough was sticky and hard to handle but i buttered my hands and that helped. Came out nice just be sure to leave some room between the loaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mihoulahan"
},
"reviewBody": "Nice texture. Great looking. A little dense, very crispy with some chew from the cranberries. Only area for improvement was it lacked some flavor. Second batch: soaked craisins in some port then drained. Toasted slivered almonds. 1 T. Almond extract. 1 tsp cinnamon. 1/2 t. Nutmeg. Used 3 whole eggs for more chew while still very crispy. Great dipped in coffee or desert wine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Mashigian"
},
"reviewBody": "Good recipe. I didn’t know if I should have greased the pan. It stuck a bit but turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TucsonBet"
},
"reviewBody": "Delicious and easy to make. I added orange zest as suggested by others. Perfect complement to the cranberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loni Ellis"
},
"reviewBody": "My son (diabetic) was crazy about this. I doubled the receipt. I made it sugar free, substituting Sweet &amp; Low (22 packets to 1cp white sugar.) I used the cranberries, substituting pistachios with almonds. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "James W"
},
"reviewBody": "No flavor.\nI added orange and lemon zest which helped but overall There was no flavor to these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Skinner"
},
"reviewBody": "I made biscotti for the first time using this recipe. I followed the recipe exactly (using Almond extract) and it turned out perfectly! Have since made it again for work - and will make again for gifting. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina Truesdell"
},
"reviewBody": "Used the recipe as is and it was the vest biscotti I have made. Got rave reviews from friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Howard"
},
"reviewBody": "I did use the almond extract. I love these. Perfect snack with a cup of tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fantage Dove"
},
"reviewBody": "I haven't tried it yet since it just came out of the oven, but it looks delicious. Can't wait to try them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julieart"
},
"reviewBody": "So easy and delicious! I actually forgot the almond flavoring and ended up drizzling it on top before it went in the oven and it came out fine (although I think it obviously would be better if incorporated). Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Walchuck"
},
"reviewBody": "omg! these are amazing! I was worried too because of them not having any butter or oil. Fear not!! I also liked the suggestion to bake them in 6 inch rounds instead of long loaves to make longer biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bizguy"
},
"reviewBody": "This is a great biscotti recipe! It was easy to make and the biscotti is not sweet and heavy. I made 2 variations, 1 cranberry-almond with almond extract and 1 apricot-almond with vanilla extract. I dipped the tops in some Merkins dark chocolate wafers melted down which added a nice touch I think. As suggested by another, I added my fruit and almonds to the dry ingredients while mixing which produced an even distribution in the finished biscotti. I didn't wait for the biscotti to cool after the first cook , but cut it into slices and then spread those out on the pan and right back into the oven at the lower temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinMommy"
},
"reviewBody": "These are great! I used 1 T almond extract in them for great almond flavor. I did find that 30 minutes was not enough for the first baking - they were still doughy inside. Next time I think I'll try 35 or 40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Merlin"
},
"reviewBody": "I was hopeful that this would be a healthy recipe, with no oil n all that. Except for reducing the sugar by 2 tablespoons, I followed the recipe to the T. Yet the biscotti turned out almost as hard as a rock (even tougher than my dog's milk bones). I've always made biscotti using another recipe that uses 1/4 cups of olive oil. Should've stuck to that cos they always turn out perfectly. Too bad I've drizzled chocolate over this one, otherwise they could've gone to the pooch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ali"
},
"reviewBody": "Just FYI for those of you making this, it says to add all the dry ingredients together...... THAT EXCLUDES THE CRANBERRIES AND ALMONDS. But it still came out tasting good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Ann DiMuccio"
},
"reviewBody": "I followed the recipe as written . The cookies were great. I made them in the morning and they were gone by evening. I make biscotti often. This recipe is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Williams"
},
"reviewBody": "Delicious and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nadiajc"
},
"reviewBody": "It's ok, added orange zest and almond extract to first batch; added lemon zest and almond extract to second and no cranberries. I feel like it's not too flavorful, needs something else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pinky Chang"
},
"reviewBody": "Made this three times! Excellent recipe!\nThe recipe called for 2 eggs, and 2 egg whites. \nI actually only used 2 eggs , and it turned out to be good! My family and friends loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LinRupp"
},
"reviewBody": "With tips on making biscotti taken to heart I have made this one several times now and is my favorite of 5 recipes I have tried. The mess of shaping in flour, no more! I moisten my hands and transfer from bowl to parchment paper lined jelly roll pan and form. Re-moisten hands as necessary. SO much less mess and no added flour makes this really light and tasty. I use 1/2 Tbls almond extract and 1/2 Tbls vanilla extract and a dash of salt. We now enjoy this every morning with breakfast. Thanks to my daughter-in-law for making this for me at Thanksgiving where I fell in love with it. Less sweet than so many other options."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna"
},
"reviewBody": "This is a very tasty, pretty biscotti. It's not as dry and hard as some, loved it. I used half vanilla exract, half almond flavoring. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DR L ZEE"
},
"reviewBody": "I did not like this recipe at all. I found it easy to whip up without using a mixer (a big plus for me) but the flavour was just not great. The texture was more like Mandlebread than biscotti, very dense (which I don't actually mind). My husband like them but I won't be making this recipe again. I'll have to look for something better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally Parks"
},
"reviewBody": "Love this cookie and made it exactly as listed on the recipe. I have also made the cookie and omitted the second baking, this makes it easier for my children, who have braces, to eat. I am sure the Orthodontist appreciates not having to replace brackets and bands from heavy chewing of the twice baked biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Rettinger"
},
"reviewBody": "I did add an extra egg. Honestly I thought this was the best thing I ever made. I added slivered almonds on the top then drizzled with dark chocolate once they cooked. I will use white chocolate next time though just for aesthetics."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heaward"
},
"reviewBody": "Delicious. I made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Chris Harrison Boeh"
},
"reviewBody": "I really like this recipe. This morning, I guess because I felt so relaxed sitting in the sun, drinking tea and munching this biscotti, I looked up the history of biscotti on Wikipedia. Apparently, it was originally created as a waybread for travelers, soldiers, sailors, etc. The name \"biscotti\" means \"twice baked\". The second baking removed all excess moisture, allowing the bread to keep for long periods of time. The lack of oils also helps with this longevity. This recipe is closer to the original soul of biscotti than most other recipes I have seen and I like it for that reason as well as its simplicity and adaptability. I have replaced 1/3 of the flour with whole wheat, cut back the sugar in the dough, (instead rolling the logs in sugar before baking) and added a great variety of fruits and nuts (last night was apricots, pistachios and cashews). This is a recipe I'll make again and again as a light and tasty companion for my daily cups of tea. I might even try it the more Italian way with an after-dinner glass of vin santo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Goodwin"
},
"reviewBody": "Perfect, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Douglas Doucette"
},
"reviewBody": "This dough was so sticky. Almost impossible to work with to form log on sheet. Despite adding extra flour, needed to cook sliced bread almost 30 minutes finish. Taste was ok but not outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Ciletti"
},
"reviewBody": "I made these without cranberries..I didn't have any on hand. I really like them, very nice recipe and quite simple to make. I used almond extract instead of vanilla. Nice and crisp and great dipped in a glass of milk. They taste like the almond cookies you get from Chinese restaurants. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valley29"
},
"reviewBody": "I used fresh cranberries and a bit of honey and it was AMAZING. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rosemarie"
},
"reviewBody": "Just okay. I shaped them directly on the baking sheet because it was impossible to form a log on a floured surface. I had to continuously wet my hands because it was very sticky. I sliced the biscotti with a pizza slicer as soon as they came out of the oven. Let them cool first as the recipes suggests. I am not sure I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OTPotato"
},
"reviewBody": "Excellent Easy Recipe! The omission of a Fat/Oil Ingredient leaves one's hands Clean for Dipping on the Go - rather than leaving them Oily and Slick. It also makes for a Marvelous Hard Crunch Texture that I was Especially Impressed with. Perfect for a Beverage! They are not Too Sweet which Enables Them to be Highly Compatible with Add ins/Garnishes if Desired. A flexible Recipe that can Easily be Adapted to one's Needs. Gmclearn's Tips are Spot on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S Taylor"
},
"reviewBody": "I don't think people realize that authentic biscotti does not contain oil or butter. I followed the recipe exactly and used the almond extract. I also used the reduced sugar cranberries which are still very sweet. The first time I made it I thought it was just a tad too sweet, I like a slight tartness to the cranberries, I made a second batch right away (because the first batch was disappearing too quickly, ahem . . . you know who you are!), and used the reduced sugar cranberries instead and it was perfect. It's become my standby recipe. There's nothing like a cup of tea with biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CakeGina"
},
"reviewBody": "I found I had to alter a few things to make this recipe work. Instead of using 2 1/4 cup of flour I used 2 1/3 cup of flour as others had complained of a very sticky batter. I used 3/4 White sugar and 1/4 Brown sugar as I find it gives a more balanced taste. I did sub out the vanilla extract and use an almond emulsion along with an orange oil which really amped up the taste. The cooking time was way off for me, I had to bake them 10 mins longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kibs1982"
},
"reviewBody": "I was watching Giada on the Food Network one night. She was featuring a biscotti recipe but I wasn't a fan of her ingredients. I decided to search for cranberry almond. I found this recipe and loved it. I took two things from Giada - I added ORANGE ZEST and I toasted the almonds on the stovetop for 3-5 minutes. I added the orange zest to the mixture at the same point as the cranberries and almonds. Fabulous! I will absolutely use this recipe in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liebs"
},
"reviewBody": "Made it exactly as is. Followed other's suggestions to cut the loaf before cooling. Worked very well. Next time, I would brush the loaf with egg wash (using the left over yokes) to brighten up the color a bit and also try the tip about the orange zest. Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josie"
},
"reviewBody": "Didn't change a thing! Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Driggers"
},
"reviewBody": "Delicioso! I followed the recipe exactly (using almond extract instead of vanilla) and it was delicious. I guess you could add chocolate chips if you wanted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lissab91"
},
"reviewBody": "I won't try this again. It wasn't very sweet and was instead a bit plain and salty, so it tasted more like Irish soda bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Brown"
},
"reviewBody": "My mother loves Biscotti but with health issues she no longer can make it. Needless to say I have made a lot of Biscotti for her. This one is fine but not that special. She liked it but what ever I make for her she says is great. One thing I have found with just about every recipe I have tried is they never come to the size loaf they write. So no matter what you do the log will be smaller than listed. I was lucky to get a 12\" by 1/2\" high log. But for practice this was alright."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SQUEAKYCHU"
},
"reviewBody": "I doubt if I'd make this recipe again. I used the almond flavoring. The dough came out too dry. I had to add a tablespoon of water to it to get it to stick together. The cookies stuck to the foil on which I baked them at first; then they stuck to the cookie pan without the foil on the second baking. They came out rock hard. I know biscotti are supposed to be somewhat hard, but mine came out like bricks. They tasted pretty good, but not spectacular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christie Mason"
},
"reviewBody": "Mine turned out really crumbly in the dough stage, and seem not to have cooked all the way on the second baking. Help?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "y0rick"
},
"reviewBody": "First time making biscotti, and I was very happy. Used almond extract instead of vanilla and added 1 tbsp of orange zest. CRUNCHY biscotti with great flavor. I sliced when loaves came out of oven with good success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KathyC"
},
"reviewBody": "I have tried this recipe twice, then tweaked it so it was not so dry and flaky. I added fresh orange zest and a few Tbsp of the juice too plus coconut flakes and left out the nuts and cranberries. It turned out wonderful!! Dipped in dark chocolate to compliment the orange flavor made them so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Izzy"
},
"reviewBody": "Made two batches today. Liked the one better with almond extract.as opposed to vanilla. I used pistachios and cranberries. I'm considering dipping them in semi sweet chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tea Berries"
},
"reviewBody": "The BIG problem I had with this recipe was telling you to let it cool before cutting it up. Most everyone knows the consistency of biscotti... they're hard and brittle. If you let them cool and THEN cut them, they'll shatter. You HAVE HAVE HAVE to cut them fresh out of the oven before they start to set. They're like \"crispy\" chocolate chip cookies... gooey at first then as they cool, they harden so you're limited on time. \nOtherwise, The recipe was pretty good. I couldn't find my quartered almond pieces, but I added LOTS of dried cranberries so I'm afraid the extra solids in the cookie may have made them hard to stay together... not sure though. I would have added them, if I could have found them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mara"
},
"reviewBody": "Great recipe... they're still warm from the oven and I've eaten three... I made these according to directions for oven temp, bake time, and ingredients. The only thing I added was cornmeal for the extra 1/4 cup of flour and the zest of two lemons. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tmcp"
},
"reviewBody": "Great recipe.. I melted dark chocolate chips in a pie tin in the residual oven heat after I removed the biscotti and dipped the cookies on the long flat side. I used cranberries and almonds, but am going to try with mini chocolate chips and walnuts next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie"
},
"reviewBody": "I took another reviewer's advice and cut the biscotti right out of the oven without letting it cool; it worked perfectly. The biscotti is very crunchy and tastes delicious. Next I am going to try orange zest with almonds. I can't wait to enjoy it with some coffee in the morning and ice cream at night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Rosier"
},
"reviewBody": "Made this the other day and am very pleased with how they came out. Love that it has no fats/oils/salt. I replaced 3/4C of the white flour with whole wheat and added walnuts instead of almonds. My family really enjoyed them and I'm making another batch right now to bring to my sister who lives 4hrs away. The use of a pizza cutter really makes cutting these a breeze! I've never made biscotti before this xmas and I'm hooked! Oh, another thing about this recipe is that you can use the basic ingredients and add anything under the sun. Enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "epriedane"
},
"reviewBody": "Delicious!!!!!!!Sorry who could not make it, even its very simple. Just dont blame recipe, its perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Ries"
},
"reviewBody": "You'd never know there was no butter or fat added to this recipes. I vary it too with whatever dried fruit or nuts I have on hand. For me 3/4 cup sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Mclaughlin-Carello"
},
"reviewBody": "Great flavor! Easy to make! No crumble &amp; easy clean up! Used 3 whole eggs one egg white (by accident and still turned out perfect) added 1.5 tsp Cinnamon &amp; .5 tsp Nutmeg. Cran-raisins 1 heaping cup!!!! YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catinthehat"
},
"reviewBody": "This was my first attempt at biscotti and they came out GREAT!!! After reading a few of the reviews I cut back the sugar to 1/2 cup and also substituted half of the flour for 100% whole wheat. Next time I'll add a bit of orange zest to kick up the flavor a little. Super easy and VERY tasty!! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bubba"
},
"reviewBody": "I found the easiest way to shape the dough was to sandwich it in plastic sheets then turn it onto a parchment paper. No touching, no sticky hands, no mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jules"
},
"reviewBody": "At first I had my doubts because the dough was so soft, but they came out beautifully. Keeping this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin' for cash"
},
"reviewBody": "These are really good biscotti! I used coarsley chopped pistachios instead of the almonds. I also added the rind of an orange, and some of the juice ( a few tablespoons, I didn't measure) because the dough seemed a little dry. I took another reviewer's advise and used sugar instead of flour when shaping them into two logs. I stood the slices on the cookie sheet for the second baking, this way they don't have to be flipped half way through baking time. This is a very traditional recipe with no butter or oil added. I used my KitchenAid mixer, had no problem with crumbling or dough being too wet as others have mentioned. Love these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ky. tester"
},
"reviewBody": "I must have done something BAD wrong..Stickiest mess I ever got into and was disappointed with the outcome. Sorry to say I cannot recommend this one.\nOne star is being generous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RGEM"
},
"reviewBody": "This recipe is very tasty and easy to make. A definite winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "peanut"
},
"reviewBody": "Would someone please tell me how you \"form\" or shape soup? With all the liquid from the 2 eggs and egg whites and the amount of flour called for, that's what I ended up with. A mess. I've made biscotti before and always had a rather stiff dough to work with. I was stunned at this recipe and kept rereading it and rereading it to see if something had been left out....like a bag of flour or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "Very easy and very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother Ann"
},
"reviewBody": "Delicious and pretty on the cookie tray. I loved the flavor of the almondsd and dried cranberries. I used vanilla extract when mixing the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyd_Delve"
},
"reviewBody": "i have tried several biscotti recipes from this site with varying degrees of success (from dismal failure to kind of edible) but these are the business! they are easy to make, delicious to eat, and turn out like a proper biscotti! i substituted 3/4 cup of Splenda for sugar, and added 5 drops of Almond Oil in addition to the almond extract---they are terrific! thank you for a wonderful recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernie"
},
"reviewBody": "This is a keeper! I ALWAYS follow the recipe as written to begin with. This one doesn't need any tweaking! But I would add that if this is the first time anyone is going to try making Biscotti, here are a few tips on getting the Biscotti batter onto the cookie sheets. You will need two parchment paper lined cookie sheets, one for each Biscotti log. I sprinkled a bit of flour on an area of the parchment paper approximately 14 inches long by 1 1/2 inches wide. I put half the batter (about four big spoonfuls) down the center of each cookie sheet. Then I smoothed the batter into shape with a butter knife. This skips the step suggested in the original recipe that says to make the logs first and THEN transfer to your cookie sheets. This is very sticky batter, and can be very messy. My results were wonderful! Now that I know I've got a keeper, I'm going to start to \"tinker.\" I think the first thing I\"m going to do is drizzle white chocolate over these for a real gourmet treat. Thank you for a great recipe. Happy Biscotti everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinman"
},
"reviewBody": "At last, without oil. Using parchment paper works for me. Also find working and shaping the dough\ninto logs with a silicon spatula eliminates sticky hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianemwj"
},
"reviewBody": "I had absolutely no problem with the dough being runny. Maybe it's because I used white whole wheat flour from Trader Joe's, but the dough was easy to pat into 14-inch logs and was not sticky at all. I also used half sugar and half splenda, and half almond and half vanilla extract. I cut the biscotti as soon as it came off its first bake and had no problem with crumbling either. I must have just gotten lucky. This was incredibly good and I can't thank you, Kathianne, enough for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilbambella"
},
"reviewBody": "These are the first biscotti I have ever made and they were fantastic! A little tough to mix together and a very sticky dough but it turned out great! I had used a good amount of flour on the board to roll it up and used parchment paper on the cookie sheets. Thank you for making me unafraid of biscotti!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "I love this recipe. I use the base ingredients and then modify it by leaving out the cranberries and almonds and adding in cinnamon or cocoa powder (and increasing the sugar by about a quarter cup). This recipe is also a favorite with my nephew who is teething, I just leave out the cranberries and almonds and is a perfect for him and much cheaper than teething biscuits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daizy"
},
"reviewBody": "I made this recipe for dessert when we had friends over for dinner. We served it with Amaretto flavored coffee and everyone kept talking about how wonderful it was! I will make this again soon!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "igotthejoyjoyjoydowninmyheart"
},
"reviewBody": "This is my go-to biscotti recipe. I add a little bit of almond extract in the recipe too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "themrs720"
},
"reviewBody": "These are good. First attempt at biscotti. The gooey texture of the batter kind of suprised me a bit, but no worries: the biscotii came out great. Definitely use almond extract and not vanilla. This makes a huge difference. I followed the recipe but took the advice of another and added orange zest. I also used half splenda half white sugar. Next time I may add semi sweet chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolmomof3"
},
"reviewBody": "This was so delicious, they came out perfectly! My only problem was I think I overmixed it a bit,and it was so sticky I could hardly roll it out....but that was my mistake! Still ended up being amazing, and I will be making this many more times in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ezmars"
},
"reviewBody": "I just want to say that the two logs you create are only about 3 inches wide but they spread considerably during baking, creating the classic biscottic shapes.\nI also substituted a little coconut flavor for the vanilla and used white chocolate chips and macadamia nuts. They were VERY tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "star4dance"
},
"reviewBody": "This.. this right here is an AMAZING biscotti! I love how there is no oil or butter in it. Biscotti is a pretty expensive treat to come by and I'm elated to know that I can now easily make it! The only infinitesimal issue I had with this recipe was the fact that the consistency of the batter.. was sticky and also NOT a dough. It was more like a sticky cake batter type thing. So, I did not log it. Instead, I let it just spread out as a circle. Either way, I cut it into straight lines and the biscotti looked and tasted FABULOUS! I used both almond and vanilla extract, used half brown sugar, and added 1 tbs of lemon zest. next time, I think I'll just use all almond extract and cut down on the sugar a bit. THIS is my new all-time favorite biscotti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOOKIE2680"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "great recipe. hard to work on and set on side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie C"
},
"reviewBody": "All my friends know 'I don't cook',but I was desperate. Trader Joe's stopped carrying my favorite biscotti! I found your recipe to be the closest to what we got from the bakery in Tuscany.[&amp; Trader Joe's]The first time I used brown sugar,1/2 vanilla &amp; 1/2 almond extract,but no cranberries.Wonderful! The results encouraged me to try again,but followed your recipe more faithfully except for all vanilla &amp; I'm still experimenting. Thanks as I was afraid I would have to go thru 'biscotti' withdrawal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shannon M."
},
"reviewBody": "This biscotti was good, but nothing exceptional. I followed the recipe exactly and think some modifications could be used to improve on it. Next time I'd definitely use almond extract in place of the vanilla, and I'd add some other flavor enhancers (maybe orange zest...) Anyways, good, but not amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "knbishop"
},
"reviewBody": "I made this recipe for my husband and I to take as snacks on a hike. Upon reading the recipe I found the one tablespoon of vanilla extract seemed to be a little much, so I added just half a teaspoon of vanilla and a quarter teaspoon of almond extract. When I brought the dough together I thougut it a bit looser/gooeier than I anticipated. I found it eaven harder to get it formed into the \"log\" shape in which it needed to be. I was worried it would flatten out in the oven, but was pleasantly surprised when I peeked through the door, about ten minutes into baking, to see evenything was puffing up nicely. I baked them on parchment so when I removed them from the oven, I just pulled the parchment up from the cookie sheet and moved it, dough and all, to the cooling racks. After cooling, slicing was a breeze and I moved them back into the oven on cookie sheets lined with parchment. Ultimately, the stickieness of the dough concerned me, and I think the use of parchment paper made the whole process easier. This stuff even sticks to wax paper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BigShotsMom"
},
"reviewBody": "I followed the recipe exactly, but my dough came out too runny to shape. I ended up putting it on the parchment paper and shaping that then freezing the whole thing to get it to hold the shape. Once it baked the parchment just peeled off (love that stuff!) Since I had read so many comments about it crumbling, I used a very sharp serrated knife and sliced as soon as they came out of the oven while they were still on the parchment paper. The inside was a bit undercooked, but I was able to slide each slice onto a clean cookie sheet for the second bake. Amazing, but the finished result looks ok and tastes quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JMK1801"
},
"reviewBody": "didn't hit the spot. not much flavor. It looked very pretty :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tania"
},
"reviewBody": "I had a hankering for cranberry almond biscotti and came across this recipe. Definately a keeper! I rather liked the lack of fat in the recipe. The cookies don't need it, they are supposed to be dry. That's the point of biscotti. I did drop the vanilla to 2 tsp. however because I am a cheap cook and I buy good vanilla. 1 Tbsp is a little too rich for my blood for one cookie batch. They still tasted good. I also used whole almonds and that was just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "I love this recipe! I found I don't have to change a thing to get them to turn out. I tried using almond flavoring and that worked also. Great treat to go with an afternoon latte!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef4Six"
},
"reviewBody": "FANTASTIC!! This biscotti was perfect! Everything you think about a biscotti - is what this is! Long and thick and ultra crispy, yet has a nice delicate flavor! I don't know why other recipes are used - when this one is so low in fat and so easy to make! It is really versitile! I used 3 eggs instead of the 2 eggs and 2 egg whites. I also used a little less sugar than what was called for - and it was sweet enough. I have made it as written and I have also made it with other modifications. I made it into Coconut Biscotti by omitting the almonds and dried cranberries, and added 2 cups of flaked sweetened coconuts and 1 tsp. cinnamon. I also made it with chocolate chips and sprinkles some cinnamon sugar on the sliced biscottis when the baked the second time. They were all fantastic! I will be making this again! UPDATE - I made these for PASSOVER! Instead of the 2 1/4 cup flour - i substituted 1/2 of that amount of matzo cake meal and 1/2 the amount of potato starch! I also made another batch and instead of flour used 1/2 the amount of matzo meal and 1/2 the amount potato starch - both came out great - but i liked the one with matzo cake meal as it has a finer crumb than matzo meal. - Both were fantastic! I used chocolate chips instead of the almonds and cranberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy P"
},
"reviewBody": "these were fantastic. They were very easy to make. I made them for a get together and got tons of compliments. I had a little trouble using my hand mixer as the dough rode up. Next time I'll use my mix master. Also all the tips about keeping your hands wet were right on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmclearn"
},
"reviewBody": "This is what traditional biscotti is *supposed* to taste like. Biscotti is not supposed to have oils or fats in them and are supposed to be one of the more nutritious cookies that you can make as a result.\n\nWith that said, I have made this recipe a dozen or so times and I have added a few things that others may find handy:\n\n1) You can \"knead\" the cookie dough in the bowl you are working with. You may need to wet your hands to avoid copious amounts of batter sticking to you.\n\n2) Add the almonds and cranberries to the dry ingredients as it is far easier to incorporate them into the dry than the wet.\n\n3) Add lemon zest or orange zest to the mix to make the cookies even more aromatic and enjoyable. \n\n4) Instead of the \"logs\" that are suggested, create 2 giant cookies about 5-6 inches in diameter. Put them on baking paper to ease in cleanup and removal. The cookies will be cut in straight lines and result in large biscotti instead of smallish ones. With a circle, there is not need to cut on a bias, since any angle is straight in a circle.\n\n5) If your fingers can stand it (or use an oven mit), cut the biscotti into fingers almost immediately upon removing them from the oven. The biscotti will still be soft enough not to crumble when you cut them and you can save 10 minutes of cooling time.\n\n6) Ensure that the second time you bake them, you lay the fingers bottom-down instead of possibly on their sides. This will prevent uneven browning on the sides.\n\n7) Coat with chocolate o"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAULA"
},
"reviewBody": "This recipe was extremely easy to make and low in fat to boot! I used whole almonds instead of sliced and it turned out perfectly! I will definitely be making this biscotti recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia McCallum Casner"
},
"reviewBody": "loved this recipe! turned out just as I hoped it would. I added ground anise seed to 1/2 of recipe and omitted the cranberries. left the other 1/2 as directed. both came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SIOCHANLEAT82"
},
"reviewBody": "Really good. I coated mine with melted white chocolate after they had cooled. My father-in-law couldn't keep his hands off them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ChefWannabe"
},
"reviewBody": "Easy recipe, and the cookies look very nice, but taste is a bit bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jarero98"
},
"reviewBody": "Delicious! My first biscotti recipe. I was a little sceptical when I had the gooey ness all over my hands but after they were done...delicious. Next time I will but butter on my hands before trying to \"mold\" it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tracy Richardson Rudin"
},
"reviewBody": "Not bad, not great. Easy to work with, not a lot of crumbling, but is so dry and hard I wonder how long they will keep. I liked the \"Cranberry Pistachio Biscotti\" recipe on here much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ileana"
},
"reviewBody": "These Biscotti were wonderful. I made some changes because I didn't have some ingredients. I substituted 1 Tablespoon of vanilla for the 1 Tablespoon of almond, and I substituted chopped pecans for the almonds. I rubbed my hands with butter like one of the reviewers suggested and did everything else the same. The biscotti came out really really good so this must be a fail-proof recipe! I'll definitely make this again plus it was fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "this is such a hit! I sometimes substitue the orange cranberries from Trader Joes and they are to die for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VIRGOVICKY"
},
"reviewBody": "I am baking them for the second time right now so i don't know what the finished product taste like but they look very pretty. They were so simple to make. I added chocolate chips to half the batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Party Chef"
},
"reviewBody": "Made these this morning and I am enjoying them right now with a cup of hot tea. Yummy. Easy recipe, great results. I melted a cup of white chocolate chips and with a spoon drizzled it on biscotti. I used almond extract which I think is better with this type of cookie. Thanks Kathy for this wonderful biscotti recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweet cheeks"
},
"reviewBody": "My first time making biscotti, and this recipe made a differance. Easy, easy and tasty. This was a keeper and changing the add-ins is real easy. I'll will make these again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10159/cranberry-almond-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10159/cranberry-almond-biscotti/",
"name": "Cranberry Almond Biscotti"
}
}
]
}
}
, "about": [
]
}
]