				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crawfish Etouffee Like Maw-Maw Used to Make"
,"datePublished": "2000-10-13T03:03:41.000-04:00"
,"dateModified": "2022-07-14T17:45:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Rita Ester"
,"url": "https://www.allrecipes.com/cook/168702"
}
]
,"description": "Crawfish, onions, green bell pepper and garlic, seasoned with cumin and Worcestershire sauce, cooked etouffee style. Serve over rice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SVX7Nc5cN_LN2vCmXlt5mRvw-Og=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17672-d9d0a627aeab4c81a11194a78a3357c3.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crawfish Etouffee Like Maw-Maw Used to Make"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "54"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "535 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "242 mg"
,"fiberContent": "2 g"
,"proteinContent": "18 g"
,"saturatedFatContent": "29 g"
,"sodiumContent": "421 mg"
,"sugarContent": "3 g"
,"fatContent": "48 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup butter",
"2 tablespoons all-purpose flour",
"2 onions, minced",
"1 green bell pepper, diced",
"3 cloves garlic, diced",
"16 ounces cleaned crawfish tails",
"1 teaspoon ground cumin",
"0.125 teaspoon Worcestershire sauce",
"0.125 teaspoon hot sauce",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a stock pot, melt butter over medium heat. When butter is bubbling, add flour to make a roux, stirring constantly to prevent or remove any lumps. Cook the roux for 5 minutes. Do not brown."
} ,{
"@type": "HowToStep"
,"text": "Stir in onions and bell peppers; saute 10 minutes, or until onions are translucent. Add garlic, and saute for 3 minutes. Stir in crawfish tails. Slowly pour in enough water to reach a little thicker than soup-like consistency. Season with cumin, Worcestershire sauce, hot sauce, and salt and pepper. Reduce heat, and simmer for 10 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nunes1845"
},
"reviewBody": "One of the ratings to this recipe says they're from South Louisiana and says this recipe is a great recipe with a bunch of exclamation points. They also state that we in South Louisiana don't use any tomato NOR A ROUX. Am I mistaken in reading this recipe that it very well DOES include a roux? Anywho, this recipe is pretty close to perfect. The only reason I gave it a 4 instead of a 5 is because she didn't use the entire trinity. She left out the celery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Jobe"
},
"reviewBody": "I love that this is an authentic recipe using no tomato products. It's the real deal. However, I found it a little bland for my taste. I substituted chicken stock for water in the etouffee and still bland. We added more hot sauce and a garlic pepper seasoning at the table. Maybe it will be better tomorrow as many left overs are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika"
},
"reviewBody": "This is a delicious recipe. I would use less butter next time, other than that, I followed the recipe exactly how it was listed. I loved it...thank you. I'm definitely making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "uh huh"
},
"reviewBody": "I’m sure it was made with love but lacks all flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Davita Bell"
},
"reviewBody": "Loved it. Added a little more heat and shrimp. Hubby is a big fan. Will be making again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frank Zerbi"
},
"reviewBody": "I used the recipe for leftover turkey. Made a double batch with Crawfish, shrimp and turkey. Added some pitted black olives and a bit of prosciutto as well. It was my first attempt at etoufee, and certainly not my last. Rave reviews all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawgfan"
},
"reviewBody": "Spent a few years in Louisiana and this is a true recipe for authentic étouffée. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alfons1313"
},
"reviewBody": "Great Recipe\nNext time will make a 'lil spicier. I’m a very spicy fan. Definitely recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "I love this recipe. I added a little spice with some cayenne pepper to give it a little more bite. I have made it twice in one week because it was sooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ColeyMarie"
},
"reviewBody": "Way too much butter, like way too much butter. Then, it specifically says to Not Brown the butter? This is the key step in the aesthetics of this dish. It should be browned (slowly). Lastly the amount of time to simmer the crawfish turns them to rubber. Ill be looking elsewhere for a recipe. Thanks though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "curlycajun6"
},
"reviewBody": "I'm from Cajun country, and with some tweaks, it's right on the money (as it sits now, this is about a 3). It's not Cajun without the holy trinity of onions, bell pepper, and celery, so add 3 or 4 celery stalks to the vegetables, but cut the celery pretty small so it will cook at the same rate as the other veggies. I also added liquid crab/shrimp boil seasoning--it makes a big difference!--about three tablespoons of tomato paste (never tomato sauce), Tony Chachere's to taste, basil, bay leaves, and parsley. I added more of the Worcestershire sauce, too. I served this to a few people from back home and they couldn't stop raving about how much they missed real Cajun food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Finally! A true etouffee without tomatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brian"
},
"reviewBody": "this was great all at dinner loved it,very easy to make.will make it a day ahead becaus the left overs were even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larnie Staton"
},
"reviewBody": "This was my first time cooking cajun and I followed the recipe EXACTLY as written. I thought it was pretty doggone good! My wife loved it and took some to work and let a \"cajun\" coworker try it. Bravo Zulu!!!!! This weekend I'm trying it with shrimp. Thanks Ritalee!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carli"
},
"reviewBody": "This was an excellant dish! My mother really liked it. My only addition was a few stalks of celery to the saute. I also only used 12 oz. of crawfish. This was because I could only find packages of crawfish in this amount at my grocery store. I thought two of these packages - 24 oz. - would have been too much. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baileywifey"
},
"reviewBody": "This recipe came out very well! My hubby is a crawfish eater and he loved it. I did use chicken broth instead of water and I added cayenne and green onions. Good flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spaces"
},
"reviewBody": "Next time I will reduce the amount of butter by half. Otherwise a pretty good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Wow! This was the best new recipe I've tried in a while! Just made a few small changes: 1) Cut the butter/flour in half, worked out wonderfully. 2) Doubled the garlic (always do) and added more of all the seasonings + ground red pepper. 3) Used a splash of chardonnay and then chicken broth instead of the water. Dinner was amazing with some brown rice and french bread! Thank you RITALEE76 I will be making again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liza Frydenlund"
},
"reviewBody": "Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "countrysquire"
},
"reviewBody": "This is the best creole etouffee recipe. Not too spicy and not too bland. Very much an old New Orleans recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorrie"
},
"reviewBody": "This is a WONDERFUL crawfish etouffee recipe!! I have tried many different recipes over the years and this is by far the best!! I added LOTS more worcestershire and hot sauce to add more of a punch. I didn't measure, just added to my liking. It spiced it up but didn't make it too spicy that our kids didn't like it. My husband bragged for days about how good it was and how it needed to be on the weekly menu!! I served it with toasted french bread baguettes...bon appetite!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leesa"
},
"reviewBody": "Excellent. My husband is from East Texas-West Louisiana. He thinks this is better than any he has ever had. We added a little more spice to it - doubling up on the hot suace and adding quite a bit of Tony Catcher's. Can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef 'Chelle"
},
"reviewBody": "yum! Added shrimp also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith Gerharz"
},
"reviewBody": "We liked this recipe a lot but next time I would add cajun seasoning, this recipe needed a little more heat. Instead of water I used an eight ounce bottle of clam juice. Next time I'll play around with it a little more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vin"
},
"reviewBody": "I added celery and green onions, and a large assortment of spices. Turned out amazingly, even though I didn't have a whole pound of crawfish to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SusanVL"
},
"reviewBody": "While I live in IA I was still able to get the crawfish. Next time I'll leave them out...too fishy of taste. Don't know if it comes from getting them in the midwest, or if it just their taste. Tried making them one more time, less the crawfish, thus using chicken in their place. LOVED the recipe.Worth trying!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Sher"
},
"reviewBody": "This was so yummy! I listened to the suggestions and added a few things like bay leafs, paprika, lots of cayenne, garlic powder (in addition to the sliced garlic), chicken broth instead of water and a little bit of lawrey's season salt. My roommate said it was soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kira"
},
"reviewBody": "Dee-licious! This was the first time I made etoufee and it turned out fantastic. I added some celery and Tony Chachere's but stuck to the recipe otherwise. My children absolutely loved it and my husband, who is the toughest critic, said it was \"good\". I will definitely make it again and maybe I'll try it with shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "Great starter recipe - I left out the cumin/worchestire and in its place added some Tony Chachere's. My picky children (3yo &amp; 15mos) gobbled it up! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISTILW"
},
"reviewBody": "I decided to make etouffee when I saw crawfish tails on sale last week and even invited some friends who used to live in Louisiana over for dinner. My husband was really concerned because he's the one who usually \"cooks Cajun.\" I searched this site for a recipe that looked most authentic to me and saw this one. We all LOVED it!! I added a little more worcestershire and a little bit of garlic powder, but other than that, I didn't change a thing.\n\nWe served it over rice, with a salad and French Bread on the side. There was not a drop left in the pot and everyone raved over it. I highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GoneSideways"
},
"reviewBody": "I was severely disappointed in this Etouffee. The flavor was severly lackcing. We added creole seasoning to make it edible. Once we did, my husband at the whole thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSICA971"
},
"reviewBody": "WOW, served with fritos this is excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather R."
},
"reviewBody": "I am also from South Louisiana. One reviewer said to not add tomato product or tomato paste to the recipe because the true recipe doesn't include it. Well, my mother has always used just a tiny bit of tomato paste and her etouffee is delicious. If you are from Southern Louisiana, then you already know that mostly everyone's family recipe differs just a little. I am as Cajun as it gets. Anyway, this recipe has a great flavor and is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "betsy"
},
"reviewBody": "This recipe was very easy. The taste is much better the next day. Does not come out looking like the picture. Much lighter in color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev N."
},
"reviewBody": "I was positively sick of tomato based etouffee when I stumbled upon this excellent recipe. It had a nice flavor to it which wasn't overbearing at all. The ingredients were simple and the instructions easy to follow. I, like many others, added much much more hot sauce and cayenne to suit my tastes. Will definitely make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great base recipe. I don't like spicy food and still felt like the recipe needed more hot sauce. At first it really only tasted like onions and peppers. We added more hot sauce, more Worcestershire, more butter, more flour and MUCH MUCH MUCH more crawfish. I also thought although it tasted good at that point it needed something else. It just didn't look right. So, we put in tomato sauce. It was just whatever we had left over already in an open jar. I believe it was a garlic and onion blend tomato sauce. Served this over rice and it was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SPEARFISHER"
},
"reviewBody": "Well. I thought this was kind of bland. I added more spice to it and it came out good. But just following the instructions, it was bland...to me. 1/8 tsp of anything is not much. 1/8 tsp hot sauce is negligible to me. I didnt even know the hot sauce was there. I added some more cumin and more worchestershire sauce, even some cayenne. THEN it turned out good. good base though for creating something different. I will use it again with my own changes. I do appreciate the recipe. I just tend to like things more hot and spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thanks. Great recipe. I have to use the frozen crawfish tails. Good over grits, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SPARKIE63"
},
"reviewBody": "Very good recipe and easy. We added thyme, basil and bay leaf and instead of water we used chicken broth. We will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is incredibly delicious. I got the hungers for etouffe after reading the Ya-Ya books by Rebecca Wells. My husband says it tastes just like what he remembers from his boot camp days in Louisiana. The only substitutions I was forced to make were shrimp, cuz crawfish are hard to find here in a small town in the Pacific Northwest, and a red bell pepper cuz the green ones were pathetic. This is definitely a keeper and I would not hesitate to recommend it. Thank you, Rita."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEETERBUG"
},
"reviewBody": "This recipe was pretty good and easy to follow. However, I didn't think it called for enough seasoning. I have no idea how much worcestershire sauce or hot sauce I put it, but I just kept adding it and tasting it. After doing that it was VERY good. I also substituted shrimp for crawfish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I live in New Orleans and have all my life. DH is pure cajun and moved from west Louisiana a few years before we married. I agree about the tomato (I've never had true etouffee with tomato in it, maybe a creole, but not etouffee). I didn't like the worchester or cumin, which I use in many recipes but never in cajun/creole recipes. Ommitted that, added thyme, a touch of rosemary, basil, and bay leaf. I also used shrimp stock instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm sorry, I don't agree with all the other rave reviews...I thought this was very plain and extremely bland. I've never had etouffee before, so if I don't know what I'm talking about,sorry, guess I'll just have to vacation in the bayou to see what it's really all about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm from South Louisiana and this is a great recipe!!!!!!!!!!!!!! This is a true recipe, the original crawfish ettoufee recipe is not made using any type of tomato product in it nor does it use any type of roux.It's butter, crawfish fat, crawfish, onions, bellpeppers and seasonings. It's the crawfish fat that really makes the taste. DO NOT add in tomato sauce nor paste!!! You will not get the true taste using Chineese crawfish, the Louisiana crawfish still has some of the fat left on it which will enhance the taste. Thank you Mr. Rita for sharing with the readers a true Louisiana dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MARK88KEYS"
},
"reviewBody": "I put a small can of tomato paste in this one for the finishing touch. Overall, really good!\r\nMark Peter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MADPRATT"
},
"reviewBody": "This is really good etouffee. I added some items such as bay leaf, thyme, paprika (quite a bit), and cayenne. I also used shrimp instead of crawfish. Next time I will use broth instead of water to give it more depth in flavor. Adding this to dirty rice really makes the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLCIZME69"
},
"reviewBody": "Totally awesome!! Will definately make again! Made a double batch and STILL didn't have leftovers!!~ YUM-YUM!!~"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CCORTES"
},
"reviewBody": "I made this for my husband who is a very picky eater and he loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first attempt at etoufee, and it was so easy and delicious!! We loved it! Good Stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really enjoyed this recipe but I'm used to the flavor that our favorite restaurant Jakes has. I'll work on the seasonings a little but then again, we ate the whole thing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22732/crawfish-etouffee-like-maw-maw-used-to-make/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1425/soups-stews-and-chili/stews/etouffee/",
"name": "Etouffee Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22732/crawfish-etouffee-like-maw-maw-used-to-make/",
"name": "Crawfish Etouffee Like Maw-Maw Used to Make"
}
}
]
}
}
, "about": [
]
}
]