				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Creamy Asparagus Pasta"
,"datePublished": "2018-03-21T12:19:41.000-04:00"
,"dateModified": "2022-12-28T15:30:10.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Heidi S"
,"url": "https://www.allrecipes.com/cook/243196"
}
]
,"description": "This creamy fresh asparagus pasta recipe is made with sautéed asparagus, garlic, light cream, linguine, and lemon juice in just 30 minutes!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1SVHgOPM0PFNLXIdmjetsvrsmnM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/966206-creamy-asparagus-pasta-Paula-Todora-Paula-T-4x3-1-df6605cdd7e1467f826a4a6c7126844b.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Creamy Asparagus Pasta"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "66"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "247 kcal"
,"carbohydrateContent": "44 g"
,"cholesterolContent": "10 mg"
,"fiberContent": "4 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "31 mg"
,"sugarContent": "1 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 pound fresh asparagus, trimmed and cut into 2 inch pieces",
"2 tablespoons butter",
"1 clove garlic, minced",
"1 pint light cream",
"1 pound linguine pasta",
"1 lemon, juiced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a pot of water to a boil. Boil asparagus for 3 to 4 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "In a large saucepan melt butter over medium heat. Sauté garlic and asparagus for 3 to 4 minutes. Stir in cream and simmer for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, bring a large pot of water to a boil. Add linguine and cook for 8 to 10 minutes or until al dente; drain and transfer to a serving dish."
} ,{
"@type": "HowToStep"
,"text": "Stir lemon juice into asparagus mixture; pour mixture over pasta."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ronna"
},
"reviewBody": "This is a good base, but as many others have said, you need to tweak it to suit your tastes. I saute the asparagus with garlic, lemon pepper, and olive oil for 5-6 minutes. It is a shame to boil it. Cook till the doneness you like - we like it tender-crisp. If I have cherry tomatoes, I throw about 10 in for the last 2 minutes. The sauce is better with a few red pepper flakes and parmesan and cream cheese, to your taste. WIth tweaks it can be 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gr8cape"
},
"reviewBody": "I usually don't care for cream sauces with pasta but decided to try this recipe because I had all the ingredients. It was really good! I sautéed fresh mushrooms, and the asparagus in olive oil, butter and garlic. I added some pepper flakes and chopped fresh chives when I added the cream to the asparagus mixture. Right before serving I added the juice of one lemon and some salt and pepper. Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sks61"
},
"reviewBody": "Absolutely no flavor at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Very good I used half cream and half milk. I omitted garlic but added lemon zest grated as well as the juice . Also I sprinkled with Parmesan before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke Clendenen"
},
"reviewBody": "So easy, so yummy!! Add some parmesan cheese and you are in for a seriously decadent meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meme Young"
},
"reviewBody": "I had to make some of my own additions. I used heavy cream instead. I add lemon pepper chicken (Cut up), onion, green onion and I tripled the recipe as well as I feed a big family. Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy Tina Stevens"
},
"reviewBody": "I couldn't decide which this dish was? I'm very critical about food! I would give it a 5, but, my even more picky Teenager would give it a 4. 4 1/2 it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Marie Natal"
},
"reviewBody": "This is delicious pasta with a rich zesty sauce. I tweaked a couple of the measurements in this recipe to achieve preferential consistency. In addition I added cream cheese and parmesan to thicken my sauce and add hearty flavors. The lemon gives this a tangy but supremely delicious flavor. Red pepper flakes and additional seasonings were added. This recipe can be duplicated with a variety of desired vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I like the overall taste of this but I do think it needs a little salt and perhaps more garlic or some Parmesan? As is, I found it to be rather bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elana"
},
"reviewBody": "Good.. Added onions and garlic and roasted red peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "loveontopbrownie"
},
"reviewBody": "I enjoyed cooking your recipe. I felt it was missing some things too so I added grated parm cheese and white pepper. I used whole wheat pasta but should of used the regular. Overall very easy dish. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Todora (Paula T)"
},
"reviewBody": "Easy to make and delightful to eat-will make again. I couldn't resist adding a little freshly-grated parm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "One of my favorite for a quick lunch on the weekends. I only use 1/2 the box of linguine though or I seem to have too many noodles leftover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz S."
},
"reviewBody": "This came out great. added a little more garlic and asparagus because I like a lot of color and the flavor was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Hervieux"
},
"reviewBody": "This was delicious, but I made the following changes. I added mushrooms (2 packs precut cook down), I sauteed mushroom, garlic (I used 8 cloves pressed), asparagus in olive oil and butter, added white wine (pinot grigio), I used 1 cup heavy cream (could add more), and juice from 1 1/2 lemons, salt and pepper. I really enjoyed it, the flavor was delicate and very enjoyable surprise. I will make this again and again. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "requeenb"
},
"reviewBody": "It is pretty easy to make. It has a very mild taste. I perfer a stronger taste so I added salt and pepper and 9 more cloves of garlic. It does not overwhelm it at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "caymango"
},
"reviewBody": "A bit bland (would add parmesan next time), but easy to make and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNNTTT"
},
"reviewBody": "Use half butter/half olive oil for sauteeing. I don't boil the asparagus first. I either add cooked chicken at the end, or diced (1\" cut) seasoned chicken with the garlic. Use two cloves garlic and a little seasoned salt or perhaps cajun seasoning. With the cream I sometimes add a little cream cheese. I like lots of sauce so I never reduce the amount of cream. Everyone loves this dish. Always use a fresh lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdubs101"
},
"reviewBody": "I used double the garlic and half the lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is soooo delicious, I even eat it cold. Absolutely love this recipe, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April Ard Louviere"
},
"reviewBody": "I did like this dish. it was easy to make and did not require a million ingredients. I agree with the other comments, the sauce did take longer than 10 minutes to thicken. I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "littlenicoleo"
},
"reviewBody": "adding 1/4 cup of shredded parmesan cheese at the 10 minute mark of the simmer for about 2 minutes makes this dish perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momtocooper"
},
"reviewBody": "Enjoyed this very much as did my 8 year old son and husband. Did add some grated cheese when it was cooking to thicken. I also would add some salt and some kick to take it up a notch next time. Will save this in my file to make again. Thanks for posting :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsty Buchanan"
},
"reviewBody": "Very easy and so tasty with the addition of bacon and substitution of evaporated milk in the place of cream. I also did not boil the asparagus first as I prefer it with a bit of a crunch and nice green colour. Next time I would reduce the amount of pasta too as I used a pound of dried pasta and it was way too much, soaking up all the sauce. I would also increase the amount of asparagus as I love the stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TwoSweetPickles"
},
"reviewBody": "I found this recipe when I was looking for ways to use up some asparagus that I'd had for several days. I roasted the asparagus rather than sauteeing it and I used a bit less butter, more garlic and angel hair pasta instead of the pasta suggested. I also added some leftover roasted chicken. It was quick and easy and tasted good...thanks for a great starting point with this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had no problems with this receipe except, like everyone else, it took a bit of time for the sauce to loose some of it's liquid. I cooked my asparagus for four minutes, strained it, and then rinsed it with cold water until the asparagus were no longer hot. I then cooked the garlic with the butter and added the asparagus. After that cooked for a minute or two, I added 3/4 cup of cream. To help thicken it up, I added some parmesan cheese. At this point I started my pasta and once that was finished, so was the asparagus sauce. Towards the end, I added half a lemon's worth of juice and then just before we ate it, I added the other half of lemon juice. Add sea salt, pepper, and more parmesan and it's great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LauraV"
},
"reviewBody": "Very good! I added parmesan cheese to the sauce and sprinkled in over it at the end as well. (Only b/c I had it on hand) I may have boiled the asparagus too long, it got very mushy and I will probably only saute it next time. Very tasty!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINCASUE"
},
"reviewBody": "Just finished a bowl of this..YUMMO! I had some fresh asparagus, I was afraid that it could go bad, so fixed this for my lunch. I roasted my asparagus, and used more garlic. Used a whole lemon and ended up putting some lemon pepper in, just what it needed. Will be making this again, for sure. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Really good! I did use heavy cream because that's what I had and added parmesan cheese like one reviewer suggested. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "This was very good, with a few changes. I lightedned it up by using half milk-half chicken broth as the liquid. Then added 4 oz. low fat cream cheese. Doubled all the garlic and seasonings, and added some cajun seasoning and red pepper flake. I also added 1 cup mozzarella and 1/2 cup parmesan to melt in and thicken sauce. The lemon juice at the end is a must-it really pulls all the flavors together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Harrin Ratliff"
},
"reviewBody": "After having read several reviews, I used this recipe and added a few things. I pre-cooked the asparagus after having tossed it in a dipping oil (8 min. at 425 degrees). I sauteed the garlic with a carton of sliced mushrooms. I had to add cornstarch after about 10 minutes of simmering the cream sauce. I also added 1/2 tsp. of Garlic Garlic, a heavy dash of pepper and seasoning saltk, 1/2 to 1 tsp. of Pasta Sprinkles (from Penzey's). After the sauce thickened, I added about 1/4 c. shredded Parm. cheese with the lemon juice. I topped the cooked pasta with the asparagus (I did not want it to cook more in the sauce) and about 1 cup of cubed turkey tenderloin. Then I poured the sauce mixture over the pasta, asparagus and turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MammaJo"
},
"reviewBody": "Wow! I pared this recipe down for just one person and it was FABULOUS! I will be making this one again, that's for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rude Nun"
},
"reviewBody": "Very good, but a tad bland. I'm thinking it needs herbs. A great base recipe tho'."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melonie111"
},
"reviewBody": "I liked this simple recipe a lot. It needed a bit of salt and pepper and some parm cheese but overall I loved it. Great idea, simple and fast. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Delicious! Made a few adjustments; *steamed asparagus to \"al dente\" then added to sauce of sauteed *3 T butter,3 cloves of minced garlic, 1/2 cup sun-dried tomatoes and 1/2 c freshly grated parmesan. Forgot the lemon juice and probably could use even more garlic/tomatoes. It just keeps getting better! Hubby and I loved it, and picky 6 yr old ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kelly jo"
},
"reviewBody": "I agree with the previous reviewers that it took longer than 10 minutes to thicken the sauce. Instead of adding extra roue, though, I added 1/2 cup of parmesan cheese which made the sauce that much creamier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cranappleberri"
},
"reviewBody": "Even though I found this to be a little bland, I gave it three stars because I loved the creaminess of it and I think it's a great base to add some other flavors in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin O"
},
"reviewBody": "Pretty good for being a low-cal dish!! I spruced it up a bit with some salt and pepper and just a little more garlic than what the recipe called for. I also didn't squeeze my lemon to it's fullest, fearing that my boyfriend wouldn't like it. I think it was just the right amount. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Trivelli Milillo"
},
"reviewBody": "This recipe needed a lot of adjustments to suit our tastes. I used 2 tbsp butter and 2 tbps olive oil, i sauted the garlic with the asparagus unil tender and moved to the side. I used fat free half and half and almost 1/2 cup of parmesean cheese, the juice of one lemon and let it simmer for a bit. added the asparagus back to the pot and heated through. added salt and fresh black pepper and called it dinner. \nWill make again and may make a few more adjustments as I go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FatDave"
},
"reviewBody": "I thought that this recipe used too much lemon. Cut the lemon in half and it is much less overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "After suggestions from previous reviewers, I steamed seperately the asparagus and some thinly sliced sweet potato (yam). Added garlic when sauteing some onions and then added cream - once it was thinkened I drained and added the veges. Added a pinch of salt with lemon juice. Tasted great. Would make again. \nCheers CJ Thorpe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amninta"
},
"reviewBody": "This was really heavy, I think next time I'll make half the sauce. The taste was good though, but it was missing something extra...chicken! Again, next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DAELITH"
},
"reviewBody": "This didn't turn out well for me. Sauce never thickened even after 20 minutes and some corn starch thrown in. I ended up straining the asparagus and just tossing it and the pasta with a little butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen"
},
"reviewBody": "Very good dish! The only thing I did differently was add 4 cloves of garlic (love garlic!), used a different pasta because I had it in the house, and used heavy cream (because I didn't pay attention when I bought it at the store). I also steamed the aparagus instead of boiling it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chel79"
},
"reviewBody": "My cream sauce curdled, so I threw together a quick lemon butter sauce. It turned out fine and saved dinner from being a total loss. Aside from that, I felt that the subtle flavors of the aspargus were cooked away. It would be better off lightly cooked or broiled with a little butter and garlic. I probably won't attempt to make this again. Thanks anyways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Weber"
},
"reviewBody": "don't use canned asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thisni Caza"
},
"reviewBody": "Excellent. I didn't alter any of the ingredients during cooking, but did alter the methods. I put the water on for the pasta first thing, thinking it would be easier (and tastier) to keep the pasta warm, if needed, than the sauce. I did not pre-cook the asparagus, just sauteed with garlic. The sauce was not too thin, as mentioned by previous reviewers, but I did make a half-recipe. The delicate flavor of the asparagus comes through beautifully. I did not find this dish bland at all. I did sprinkle with garlic pepper and Parmesan after serving, but I sprinkle garlic pepper and Parmesan on most of my food =) ... Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Dish was GREAT! The only that I might change is adding another clove of garlic. But, it was very easy to make and a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a good recipe but we added sun dried tomatos, a little cream cheese(to thicken the sauce), and fresh parmesan cheese all to the sauce while it was cooking. It was very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was surprisingly simple and quite yummy. I didn't have any light cream so I subsituted for a cup of skim milk and a cup of heavy cream and it came out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BONF"
},
"reviewBody": "This is quite good and very easy to make. I thought it needed something more so I put in fresh mushrooms and it added a lot of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FAIRYFAHRENHOLZ"
},
"reviewBody": "This was a pretty good sauce with a lot of potential. It definately took longer than 10 mintues to thicken, so plan on at least 20 minutes (and be flexible in cheating by adding a bit more roux (1 tablespoon each melted butter and flour mixed well) to help speed things up). As far as flavor, I felt this recipe needed quite a bit more lemon to spruce it up. The lemon and asparagus go wonderfully together, so don't be shy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TERESA BAKEHORN"
},
"reviewBody": "This is very easy to make. It does take longer than 10 minutes for the sauce to thicken and by that time the asparagus was mush. Needed some more seasonings for more flavor unless you like a very mild pasta dish. Next time I'll keep some steamed asparagus to serve with the sauce in addition to what is in the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Was a tasty dish, but it took longer than 10 minutes for sauce to thicken. I also could not locate light cream so used 8 oz. of half&amp;half and 8 oz. of whipping cream as a substitute. I had to add some cream of tartar to make it thicken up."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25323/creamy-asparagus-pasta/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25323/creamy-asparagus-pasta/",
"name": "Creamy Asparagus Pasta"
}
}
]
}
}
, "about": [
]
}
]