				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Creamy Coconut Milk Rice Pudding"
,"datePublished": "2019-04-03T23:56:00.000-04:00"
,"dateModified": "2022-11-18T10:26:25.000-05:00"
,"author": [
{"@type": "Person"
,"name": "awakenedone"
,"url": "https://www.allrecipes.com/cook/awakenedone"
}
]
,"description": "This coconut milk rice pudding is a warm and comforting treat that is perfectly spiced and loaded with tasty fruit; a delicious winter dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9ePrUx_M053AC7Ikz5nZ5AL36TU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9059403-ada7fc1614174a7ba894e40ce8fa630a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Creamy Coconut Milk Rice Pudding"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "34"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "72 g"
,"cholesterolContent": "52 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "138 mg"
,"sugarContent": "44 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 cups water",
"1.5 cups basmati rice",
"3 cups coconut milk",
"1.5 cups raw sugar",
"0.5 teaspoon sea salt",
"1 cup whole milk",
"2 eggs, beaten",
"0.25 cup unsalted butter",
"1 tablespoon vanilla extract",
"2 teaspoons ground cinnamon",
"1 teaspoon ground nutmeg",
"1 (15 ounce) can sliced peaches, drained and chopped",
"1 cup raisins, or more to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, about 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Combine rice, coconut milk, sugar, and salt in a large saucepan; bring to a boil. Reduce heat and simmer until pudding is thick and creamy, 18 to 20 minutes. Stir milk and eggs into pudding, stirring constantly to keep pudding from sticking, at least 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove pudding from heat and stir in butter, vanilla, cinnamon, and nutmeg until thoroughly mixed. Fold peaches and raisins into pudding; serve warm."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyisnyder"
},
"reviewBody": "Wow! This blend of flavors is incredible. I did not have whole milk, so used almond milk instead. I also used 2/3 of the recipe, as I only had one can of coconut milk, which was only 2 cups, but ended up adding the full amount of rice (regular long grain rice) in order to absorb all the liquids. I tossed everything except the rice and peaches into a saucepan and stirred until the butter melted, added the peaches and rice, then let it sit for about a half hour. Finished it off for 2 minutes in the microwave to further absorb the liquid. It is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tammy Lynn"
},
"reviewBody": "I like the idea of this recipe. It should have been really good. But the butter, cinnamon, nutmeg and sugar all need to be cut in half for my tastes. It was way too sweet for me. It was very creamy, and the peaches are a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "This is a creamy and delicious pudding. I followed the recipe as stated except for three things: used 3/4 c white sugar (which may be as sweet as 1-1/2 c raw sugar..I don't know), added two handfuls of raisins when adding the eggs and milk, and finally sprinkled the cinnamon and pinch of nutmeg to individual servings. There are many comments about changes other cooks have done with success. I enjoy this dessert!! Light, not too rich, and while warm, I couldn't leave it alone. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blackhighheels"
},
"reviewBody": "Yum! This turned out pretty well, although I did follow the advice of others and cut the sugar by half. Even then it was a touch on the sweet side. Also, I cut back on the spices. To be honest, I think I liked it best just before adding the spices. The next time I make it I will just sprinkle cinnamon on the portions of people who want it. Finally, I found that after 18 minutes, my rice was not yet the right texture. I dumped in some more milk and cooked it for another ten minutes. That was the right amount of time for my rice to become the perfect texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iuli Heckman"
},
"reviewBody": "Cut sugar (white) in half, omitted nutmeg (just a matter of personal taste) and added just diced, drained mango from the can. Came out delicious, my kids couldn't eat it fast enough!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Richter"
},
"reviewBody": "I used half the sugar and half coconut oil/butter to equal the butter.\nCame out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Donithan"
},
"reviewBody": "Very tasty, but as others have said, 1.5c of sugar seemed like a lot for 3 cups of rice. Others have said they cut the sugar in half, but I thought maybe that was overkill, so I cut down to 1c, which is cutting by 1/3. And that was 3/4 cup turbinado sugar with 1/4c white sugar, because I thought I might not care for all turbinado. It's borderline too sweet, so next time I make it I'll indeed cut back to 3/4c. Also, a quarter-cup of butter seemed like a lot, so I used only 3T and it tastes fine.\n For the spices I went with only 1T cinnamon and 1t nutmeg, and that was plenty for my taste.\n To me, rice pudding HAS to have raisins, but I didn't want to just add them at the end like the recipe says, which wouldn't give them much time to plump up, so I added them when there were 5 minutes left of the 18-20 minute boiling period. That gave them that 5 minutes, plus the 2 minutes after adding the milk &amp; eggs, plus the time for the pudding to cool down, and that seemed to be about right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DD in AZ"
},
"reviewBody": "Very good flavor, except it didn’t set up like a pudding after chilling it. The consistency was loose. I agree with others that the sugar could be reduced. Also, for aesthetics, I like my rice pudding to look white and then add cinnamon on top. Adding vanilla, cinnamon makes the pudding turn brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I made this for my family and they LOVED IT!!!! I do t even like rice pudding and I like it ALOT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy Williams Little"
},
"reviewBody": "Used less than half the sugar and it was still nice and sweet. Also skipped the peaches and used candied ginger and dried blueberries instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ralybuch"
},
"reviewBody": "Great recipe. Thanks for sharing. The next time, I make this tasty dish, I am going to reduce the sugar by half. And whatever fruit is on sale, is the fruit I will be using."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danika Jove-Julien"
},
"reviewBody": "I made this rice pudding using canned coconut milk and vanilla almond milk. I used brown sugar, 1/2 the butter, 1/2 tsp less of the cinnamon, 1/4 tsp only of the nutmeg, and it came out amazingly!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Very easy to make and took exactly an hour, probably a few minutes less. I used all coconut milk and coconut sugar. I added extra vanilla (I like the flavor) and kept all other ingredients and measurements the same. I tasted it before adding the butter and probably could have done without it, but alas, I added it anyway. I will definitely make this again with some of the other variations I've read in the review section."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gailene Green"
},
"reviewBody": "I made it and love it. I did a couple of minor substitutions to deal with dietary restrictions and preferences: \n1) instead of raw sugar I used Sucanat (dehydrated sugar cane juice);\n2) instead of whole milk I used Almond beverage;\n3) I grind my own cinnamon using cinnamon sticks to avoid possible additive fillers often found in store bought ground cinnamon;\n4) did not add peaches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2301360087"
},
"reviewBody": "Made an account just to praise this recipe!\n\nI made this in my rice cooker, and it came out perfect (you need to keep an eye on it, though). I omitted the nutmeg and only used half the cinnamon as I was afraid of losing the other flavors in there. The raw sugar adds an extra dimension. I will surely be serving this at this winter's holiday potluck. The perfect combination of exotic (because of the coconut) and traditional (because of the raw sugar and the cinnamon)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SamanthaCooksAndBakes"
},
"reviewBody": "I've made this several times and it always turns out perfect. I changed the whole milk so that all the milk being used is coconut and it's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toovak"
},
"reviewBody": "This was fantastic. Best ever. I didn't use the coconut milk, though, and put in an extra stick of butter. I didn't have all the rice on hand, so I used lentils to fill it out. Other than that, exactly as the recipe dictated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany"
},
"reviewBody": "Delicious, creamy pudding. I just loved it! All I had was coconut cream, so I used 2 c of the cream, then balanced out with more whole milk. I also don't like things too sweet and watch my sugar intake, so used only 1/2 c sugar and it was still wonderfully sweet and mild tasting. One more modification--I used yolks only. I made the basic version and then let people add raisins, cinnamon, nutmeg, or fruit as they preferred, and got a lot of compliments. Thanks for the excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Reid-Anderson"
},
"reviewBody": "I love this recipe, but I made some changes that made it even better. I simmered the milk in chai spices (from my local spice store), and only added a little additional nutmeg. I added 2 fresh, chopped fuyu persimmons along with the raisins. \nA beautiful fall/winter dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MD_Co"
},
"reviewBody": "This was delicious! I made it with short grain brown rice which gives it an excellent slightly chewy texture. I also only could find organic coconut creamer at the store which worked great. I used only about 1tbsp of butter and it came out really good. Next time I'll cut the sugar way down (probably 1/2 or 1/3 of the suggested amount) and just add enough to taste since it was very sweet.\nOverall a great recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scriptbff"
},
"reviewBody": "I did everything verbatim EXCEPT nutmeg and it was soooo delicious!! WIll make again and again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John peoplefox"
},
"reviewBody": "Sooo bad yet sooooo goood.\nwill try to find a way to substitute the unhealthy with multiple healthy ingredients ;) Over all 9.5/10 i did nut extract instead of vanilla though. I tried this recipe with vanilla and wasn't a big fan. Vanilla is overpowering. I reduced the vanilla by half next time and i couldn't help but feel it needed ice-cream as it was overly vanilla tasting again. Third time i substituted nut and even my women asked for seconds, just use the same amount of nut as they use vanilla in the recipe and your cool bannanas mate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rjhmomma"
},
"reviewBody": "Very tasty. After reading the reviews, I cut the spices to 1/2 tsp. I substituted goat milk for the cow's milk and replaced 1/3 of the vanilla with coconut concentrate for extra coconuty flavour. Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "Delicious. I used cardamon in place of the nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "slathermonkey"
},
"reviewBody": "A really great recipe for a large quantity of rice pudding BUT don't add all the cinnamon. I would just add 1/4-1/2 teaspoon. Also, be sure to temper your eggs. I it weren't for the cinnamon, I'd give this a 5 star recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niagara_kim"
},
"reviewBody": "By far, the best rice pudding recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jane"
},
"reviewBody": "This is sooo good! I made a few changes, some out of necessity and some because I wanted to experiment. I didnt have basmati rice so I substituted arborio instead. I wasn't sure how I would like the cinnamon on the pudding (can't stand the taste of nutmeg so that was a no brainer to leave it out lol) so instead I left it out and exchanged the vanilla for half coconut extract and half rum extract. Once it started to cool down I added some very well drained crushed pineapple to the pudding. It was like a Pina Colada flavor. Would for sure make it that way again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Troyer"
},
"reviewBody": "One caution! If you want the coconut flavor ADD THE CINNAMON TO TASTE! Same goes for the nutmeg and vanilla. The only change I made was scaling back the nutmeg to about 1/2 tsp but I wished it had coconut flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amazon"
},
"reviewBody": "Very versatile recipe, quick and easy to make. Delicious! I used half coconut milk, half almond milk and left out the eggs. Will definitely be making this again! SO GOOD, I just Had to add a photo :)\n\nP.S - It is quite sweet, I personally love it that way, but if you prefer a less sweet rice pudding, you may want to cut out some of the sugar :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandiW"
},
"reviewBody": "This rice pudding is amazing. I had to make some changes because I didn't have some of the ingredients. I didn't have whole milk (or cream), so I left out the sugar and added a can of sweetened condensed milk at the beginning and probably about 1/2 c. of 1% milk at the end of the cooking time. I also added a little bit more coconut milk, but not much and some chopped Pink Lady apples. I didn't try it, but I'd be willing to bet that some chopped cinnamon and sugar almonds would make an amazing addition as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Osborn"
},
"reviewBody": "Very easy to make. I cut the sugar and butter in half, it was still very rich and plenty sweet. I reduced nutmeg to half a teaspoon and the spices were perfect for me, but I like my recipes a bit heavy on cinnamon, but it does overpower the coconut taste a bit. I slowly added one cup of the hot rice mixture to the eggs, and then added the eggs/rice mix back into the main dish. I will make this again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen Tyree"
},
"reviewBody": "I used regular sugar and the 1 1/2 C may have been a 1/4 cup too much. But husband loved it and that's what matters!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/234371/creamy-coconut-milk-rice-pudding/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
"name": "Custards and Puddings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14442/desserts/custards-and-puddings/rice-pudding/",
"name": "Rice"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/234371/creamy-coconut-milk-rice-pudding/",
"name": "Creamy Coconut Milk Rice Pudding"
}
}
]
}
}
, "about": [
]
}
]