				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Creamy Chicken Cordon Bleu Casserole"
,"datePublished": "2019-04-02T03:00:08.000-04:00"
,"dateModified": "2023-02-09T14:03:46.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Felicia"
,"url": "https://www.allrecipes.com/cook/3205914"
}
]
,"description": "This chicken Cordon Bleu casserole features all the fixings of its namesake baked into a rich, creamy, and delicious dish perfect for entertaining."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NlCGWwbS6lKiq1K8i20M-JCJxSU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3575635-creamy-chicken-cordon-bleu-casserole-Rebekah-Rose-Hills-4x3-1-b67a288ff02f4e62a8ce790a0875f351.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Creamy Chicken Cordon Bleu Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "170"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "455 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "110 mg"
,"fiberContent": "1 g"
,"proteinContent": "30 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "687 mg"
,"sugarContent": "3 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (8 ounce) package wide egg noodles",
"2 cups chopped cooked chicken breast",
"8 ounces cooked ham, cubed",
"8 ounces Swiss cheese, cubed",
"1 (10.5 ounce) can reduced-fat, reduced-sodium cream of chicken soup (such as Campbell's® Healthy Request)",
"0.5 cup 2% milk",
"0.5 cup light sour cream",
"2 tablespoons butter",
"0.33333334326744 cup seasoned bread crumbs",
"0.25 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook egg noodles in boiling water, stirring occasionally, until tender yet firm to the bite, 7 to 9 minutes. Drain and transfer noodles to the prepared casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Top noodles with chicken, ham, and Swiss cheese. Mix together condensed soup, milk, and sour cream in a medium bowl until combined; spoon over noodle mixture in the casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a skillet over medium heat; cook and stir bread crumbs and Parmesan cheese in hot butter until crumbs are well coated, 2 to 3 minutes. Sprinkle over casserole."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until casserole is bubbling and lightly browned, about 30 minutes. Allow to cool for 10 minutes before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is really good, but when I made it again I added 1/2 cup chicken broth to the soup mixture and it came out so much creamier and had better flavor. Love this recipe, will definitely make it often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dottie"
},
"reviewBody": "Easy and quick, pretty tasty too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a win for me and my family. I read the comments and changed the method a bit by mixing the sauce with the noodles and not just spoon dropping it on top as suggested. Also I added some spices (because not using any seemed wrong!!) I put in onion and garlic powder and a touch of Italian and cayenne seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geoteacher"
},
"reviewBody": "This dish was wonderful. The family loved it! Based on the concerns about flavor and moistness from other reviewers, I made a couple of modifications. I seasoned my cubes of chicken as they cooked with a garlic, herb, sea salt, and pepper seasoning and used the same seasoning in the sauce. I also added 2 tablespoons of Dijon mustard to the sauce (similar recipes online called for this). I doubled the sauce and it made the dish nice and creamy, but not soupy. Used a 12.5 ounce package of noodles cause I couldn’t find a 8oz package. Also, I used regular sour cream and cream of chicken and herb soup. I mixed the sauce, noodles, cheese, and meat together, placed in pan, and then topped with that tasty topping. I used Panko bread crumbs and doubled the topping. Turned out beautiful and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Whole family loved it. Used ingredients I had on hand: rotisserie chicken, regular sour cream, skim milk, and shredded Swiss. I layered it as suggested and had no burnt noodles. Instead of making the topping for it I used French’s Onions, and added them at the 20 minute mark like you do for green bean casserole so the did not burn. It was phenomenal! Highly recommend you try this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jami"
},
"reviewBody": "This recipe is amazing! I did the following tweaks. I cooked the noodles in chicken broth instead of water. I kept half the broth and when I combined the sour cream, soup, ham (I used tiny diced ham, like for salads) and chicken (I used a pre-cooked, separated rotisserie chicken), I poured the hot broth over all to melt the swiss cheese (here I used Kraft swiss singles and used the whole package). On top of the mixture I added fresh basil leaves and used Italian bread crumbed with SHREDDED parmesan cheese. My whole family ate till they were almost sick! LOL SOOO good..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Deal"
},
"reviewBody": "I made this recipe exactly as written and it was delicious! The casserole was creamy and the cheese was gooey. I live alone and the recipe serves 8 so I will have to eat it for days and I'm not mad about that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dorothymwhite66"
},
"reviewBody": "I made this exactly as shown in the recipe. I found the chunks to be very unappealing so I made it again with thinly sliced ham, chicken and cheese. I also cut back a bit on the ham as I found it dominating the dish in the original. With the changes made I loved the dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SColson782"
},
"reviewBody": "Pretty tasty! I prepared this on the stove top, and left off the bread crumbs and Parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was outstanding! Daughter, son in law and 2 grandkids inhaled it. I doubled the recipe, used 16 oz bowtie pasta and rotisserie chicken. After making this the grandkids proclaimed \"grampa rocks!\" Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "This was delicious! I boiled the raw chicken cubes in the pot of water that I boiled the noodles in, and used a regular 12 oz package of noodles and it was perfect. Also, used cream of mushroom instead of cream of chicken because I had it on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Bauer"
},
"reviewBody": "Yummmmmmy!!! I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abudoggie"
},
"reviewBody": "This is my favorite casserole I've made, EVER. It is SO good.\nMy leftover chicken was originally baked with mayonnaise, salt, pepper, and rosemary, so it had some flavor already.\nChanges: I used fusilli noodles because they're my favorite.\nI used full fat sour cream (about 8 ounces) and regular cream of mushroom soup.\nI added spices because I always do - black pepper, cayenne pepper, Lawry's Lemon Pepper and some Italian seasonings.\nI made twice the amount of topping because I love topping.\nIt was amazing and I can't wait to make it again. \nI'm serious. This thing is killer good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maryann"
},
"reviewBody": "Very simple and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janell Osborn"
},
"reviewBody": "Could use maybe two cans of cream of chicken or mushroom. Mine seemed a touch dry but the flavor was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I think I expected too much from this, it was just ok. not very creamy . will try again and maybe mix the ingredients together before adding to the pan or just making more of the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shana Moreland"
},
"reviewBody": "My husband luvd this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tracie Bare Carter"
},
"reviewBody": "Made it exactly as written. Simple to make, seconds eaten by 5 of our 7 eaters. Teenager son asked for leftovers after his activity tonight. Will put in our rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "My grandchildren loved this - the adults did too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie"
},
"reviewBody": "I followed the suggestion to mix everything except the bread crumb mixture together, then add to the prepared pan. Also covered with foil for the first 20 minutes. Noodles were not dried out. This was a HUGE hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Edrington"
},
"reviewBody": "Loved this recipe! It was everything I hoped it would be. I wouldn't change anything. I can't imagine making a regular chicken casserole again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mnsodi"
},
"reviewBody": "My husband and I loved this recipe! It was relatively easy to make and didn't require a lot of time to prepare. We will definitely be making it again. I cubed a large chicken breast and sauteed it with olive oil and seasonings while I was preparing the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "horrorshow"
},
"reviewBody": "I made it as is but I didn’t use anything “light” or “low fat” and added bacon, garlic, and green onions. My family is in love :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmfroehlich"
},
"reviewBody": "This was awesome!! First words out of my husband's mouth was oh that's good. He took another bite and said Wow yeah that's awesome. 3rd bite he said oh yeah I could definitely over eat this stuff. I took another reviewers advice and used 1 cup of both milk and sour cream and it was plenty of sauce and super creamy. This is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aletta"
},
"reviewBody": "I used sage stuffing mix with the parmesan cheese for the topping, it was delicious. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "So easy, everyone loved it, just don't tell E that it contains Swiss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TERESA CELLURA"
},
"reviewBody": "A very good versatile recipe. I doubled the recipe but I had run out of cream of chicken soup so I substituted 1 can cream of celery and 1 can of chicken gravy. Everyone really liked it as it was all gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cmccar64"
},
"reviewBody": "This was delicious! I substituted mayonnaise for the sour cream. Next time I would mix half the sauce with the noodles, layer the ham, chicken and cheese and top with the remaining sauce. The noodles were a little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eponymous74"
},
"reviewBody": "I followed this recipe exactly and served with a kale salad. I didn’t even mix the noodles and sauce. Just poured it on top like the recipe says. It was delicious. No leftovers. I cannot say enough about how delicious this was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginney Ford"
},
"reviewBody": "This is soon good! I took someone else's suggestions and added 2 tbls of wine and a squirting of dijon mustard. I doubled the recipe to make two dishes and gave one away. delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill528"
},
"reviewBody": "A wonderful easy pantry dinner. I used canned chicken, worked beautifully. Did not have regular Swiss, so used gruyere cheese. Wish I had this recipe when my kids were small, they would have gobbled it up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chunkmrmom"
},
"reviewBody": "My husband loved it! It seemed a little bland to me. I made it exactly as written but next time I’ll add onion, mushrooms, garlic, seasoning salt, and paprika"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shara Nicole Cherepes"
},
"reviewBody": "I make this for my kids and they love it. I use provolone instead of Swiss, (I like cheesy and do this with my regular cordon Bleu). I also leave out the sour cream and add frozen peas and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sarah Aldrich"
},
"reviewBody": "very bland and boring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommaCat"
},
"reviewBody": "Great recipe! I like more sauce tho so will increase it next time. I pressure cooked my chicken breasts for 5 minutes in a 1 cup water to 1 Tblsp liquid smoke and it was great!! I used Italian style bread crumbs and browned it all under the broiler for about 3 minutes. I did not make it fat-free tho!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IfIHadATail"
},
"reviewBody": "This is now my favorite casserole to date. Thank you for sharing I love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wolfinsc"
},
"reviewBody": "This was a very satisfying dish. I followed the direction and made no additions or changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "This is ok. It had way too much Swiss cheese for me. It's a big heavy gooey cheesy mess. It'll probably sit like a rock in my stomach for the next 24 hours. But yeah, it does taste pretty good, I guess. If there's a next time I'll reduce the cheese and maybe add a little vegetable matter, I dunno - celery? Not sure what. Or maybe there won't be a next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bethany Bacher"
},
"reviewBody": "Flavor is good, and it’s super easy! Only reason I didn’t give it 5 stars, is because it’s a little dry. I would make more of the sauce next time. Maybe even double it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This was phenomenal. I had great expectations and this recipe exceeded them. \nI lightly salted and peppered my chicken and cooked in olive oil to begin with. And I changed very little otherwise. \nI left out milk because we don’t usually have it. Also with the exception of crumb topping I just mixed everything together as I prepped it in one dish and added a few tbsp of butter to the meat/noodle mix. \n\nGREAT RECIPE!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kovanda"
},
"reviewBody": "Excellent! Made it according to recipe, but replaced sour cream with yogurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Rachal"
},
"reviewBody": "I added 2 T Dijon mustard and substituted Durkees fried onions for the bread crumbs and parmesan. My husband, who usually sticks his nose up at casseroles liked it a lot. My grandkids LOVED it, having seconds and thirds!!\nThis is definitely going into my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "For2natemom"
},
"reviewBody": "We altered this to be lactose free with Parmesan aged over 12 months, Lactaid Sour Cream and Campbell’s Golden Mushroom soup. It was a hit! We have also made it following the recipe as called for, also good! I would however alter the topping... I feel it doesn’t have enough crunchy topping to cover the whole casserole and the addition of Parmesan during the cooking leaves you with a gooey awkward mess to spread. I’ve altered the topping to be as follows: Cook a fair globe of butter/margarine in a pan, mix with one sleeve of ritz crackers, crushed to oblivion... cook until ritz have absorbed butter (we use Canoleo margarine) sprinkle over top of casserole and cook. Once removed from oven, sprinkle with a LIGHT coating of grated Parmesan (the fresh stuff is less salty and more tasty than the kraft kind)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vancemccracken"
},
"reviewBody": "This was popular with everyone at the table. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mhenry02"
},
"reviewBody": "I didn’t have any regular ham, I used deli ham sliced up. Also used Cream of Bacon instead of Cream of Chicken, and Mozzarella instead of Swiss as these are what I had on hand. My very picky son has already had 2nds, I will take this as a win!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Bortz"
},
"reviewBody": "Just made this for dinner. It was so delicious. I used panko bread crumbs instead to make the topping just a bit more crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristingraceful"
},
"reviewBody": "Loved it! Made half the recipe in a 2.5 qt casserole, it was the perfect size. Several people thought the sauce was a little light, so I did about 1.5 times the sauce, and mixed all ingredients together (except topping) before putting in the dish. This helps distribute the sauce so it’s not dry. Noodles near the top edge may get a little crispy but that’s normal. The only extra flavor I added was a dash of Dijon mustard to the sauce. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne"
},
"reviewBody": "I made this just as it called for and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NatalieJHannah"
},
"reviewBody": "Creamy and delicious! A hit all around- will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Litster"
},
"reviewBody": "I loved this. I followed the recipe best I could, but I didn't have any sour cream or parmesan. I make my own 'cream of' soups so I used that. I did add quite a bit of extra milk and some water to ensure it stayed creamy while cooking instead of drying out. I covered with foil for the first 15 min. My kids weren't really fans of this but that just meant there was more for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adria Rahtz"
},
"reviewBody": "I omitted the sour cream and parmesan because I didn't have them on hand. The whole family loved it, even the grandkids. Next time I might add more \"sauce\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roni Sue Santulli"
},
"reviewBody": "Very quick and easy, I used Perdue Shortcuts, light sour cream, 1% milk, and low fat swiss cheese. Have been making weekly and everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "manecat"
},
"reviewBody": "Hubby fell in love with this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "very tasty -- nice variation from my chicken cutlets!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This sounded so great (all ingredients I know I love) and when I made it... no disappointment! I LOVE this! The only thing I did different was using shredded swiss instead of cubes. And we did mix it all around a bit instead of just layering (which I think I'll try next time since a few noodles did crisp a bit when they were poking above the cream mixture). The mixture of cream of chicken with milk and sour cream is so creamy, smooth, and delicious! And I loved the bread crumb, Parmesan, butter mix too! I almost want to add even more of both of those, but it's so decadent as-is, I probably will shy away. One thing that may have also made a difference was the way the chicken was cooked in advance (I imagine the kind of chicken and how it's cooked can have some affect on how this turns out and there are no instructions on that part of the process). I boiled chicken breast strips in a bit of water seasoned with poultry seasoning and it came out moist and flavorful, which I still tasted after preparing the casserole. I used precooked Ham steaks from Costco and just cubed the ham (it maintained it's lovely flavor too). I've been grading my dinners as I make them, and this one was an A+! It will definitely be back on the menu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Didn't think it had much flavor. Won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "This was very tasty, but gave it a four star as I changed it a bit. Like one of the other reviewers, the older I get the more I don't like using canned creamed soups (and I didn't have any) so I drenched the chicken breast chunks in a few tablespoons of flour that I had seasoned with garlic powder, seasoning salt, pepper, ginger, paprika and a pinch of cayenne and mustard powder. Then browned the chicken and removed it and made a white sauce with light cream, sour cream and a chicken boullion packet. Then put the casserole together and baked it. My husband who usually only likes crispy chicken recipes really liked this. I had cut the recipe in half as there are only two of us, and after 2 healthy portions, there is enough left over for lunch tomorrow - yay! Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mary438"
},
"reviewBody": "I generally stick to a recipe as written the first time I make it. This as written is very bland, and I didn't even use the low/non-fat soup or sour cream. I thought it odd there wasn't ANY seasoning. I will make this again, but will be adding SALT along with cutting back a little on the pasta. It begs for something else that I've yet to figure out, perhaps a little chicken soup base, fresh parsley and pepper.\n\nEDIT: Finally got back round to this recipe. Here are the changes I made and it turned out delicious! \n\nCut the chicken into bite sized pieces, seasoned w/salt &amp; pepper then sauteed chopped onions in the pan before cooking it. \n\nSubstituted cream of chicken with herbs for the soup. \n\nCombined all ingredients (minus topping) in a large bowl and added about a cup of sour cream total. \n\nAdded salt and pepper to taste and about a teaspoon of chicken soup base. Then added a splash of white cooking wine and some fresh chopped parsley. Sprinkled shredded mozzarella cheese on top. \n\nFor the topping I melted 3 Tbs of butter and added bread crumbs until it was moist, but crumbly. Then sprinkled on top of everything. Baked about 40 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie"
},
"reviewBody": "I made it exactly but added cooked Steam Fresh Broccoli that I cut up and added on top of Chicken &amp; Ham and doubled the Parmesan &amp; butter. This is outstanding 1 dish meal, so creamy and good. Great dish to have for something quick even company with some crusty bread and a salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NORMA47"
},
"reviewBody": "I used cream of chicken with mushroom soup, and about two tablespoons Chardonnay. I don’t know if it made it better than the original recipe but it sure was fantastic. I only had about. 1 3/4 cup of chicken. It was great! I also had a good quality wide noodle. Will be made many times again.\nI used leftover ham that has been studded with cloves. Home made baked ham is so much better then deli ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmhkiki"
},
"reviewBody": "I mixed everything and then added the topping. I used shredded Swiss cheese and a honey ham steak. The chicken was made with salt, pepper and oil on the stovetop otherwise followed the recipe exactly. Tasted great. Husband and i both had seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Oyebanji"
},
"reviewBody": "loved it super easy, I didnt even bother with the bread crumbs and oven part to save time just made the sauce in a pan and added the meat and pasta"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Booth"
},
"reviewBody": "This casserole is quick, easy, and super delicious!!! The only thing I changed, was, stirred everything together then put in the casserole dish, topped with the bread crumbs and back 25 mins.! All done!!! I will make this many times again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Beckett"
},
"reviewBody": "I added more bread crumbs for the topping, It was really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harmony"
},
"reviewBody": "Really liked this casserole - it's very rich but definitely has all of the flavors of Chicken Cordon Bleu! Make sure you dice up the Swiss, I cut them very small but it made the dish to have the little pops of Swiss! I think it was much better than if it had been grated. I can see this going into the \"Comfort Food\" box of recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pipersmom"
},
"reviewBody": "Definitely a \"make again\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntylene"
},
"reviewBody": "This was delicious. I had some yellow pepper and onion I needed to use up so I sauted them and poured them over the pasta in the pan. I didn’t have any bread crumbs so I crushed some rice krispies mixed with dried onion rings and butter and put it over everything. I loved the flavour of the onion rings so might do that again. Easy to put together and really good. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystal m"
},
"reviewBody": "This recipe is phenomenal. I followed another reviewer's advice and doubled up on the sauce- VERY important step if you plan to have left overs! \nThis is officially one of my go-to comfort foods....just make sure you hit the gym really hard before making this so all the calories dont make you feel guilty!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victory4Kids"
},
"reviewBody": "After the first bite, the family proclaimed that this recipe was a keeper. I did mix the chicken, ham, and cheese in with the sauce. it was so creamy and cheesy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drummer Dude"
},
"reviewBody": "A rare recipe that I follow to a tee. Very tasty dish. 5 stars. Will be making again soon. Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Murray"
},
"reviewBody": "Within 2 bites, picky hubby stated it was REALLY good. Things he likes typically get an \"it's OK,' so this was off the charts. Putting this one on the make again list per his request!!!\n\nMy review: creamy enough but not too much, flavorful and just the perfect amount of taste you expect for cordon blue - tasty but not over-powering, delicate texture with the noodles instead of super-dense. Took the easy route: found black forest ham ends at the deli and chopped at home, extra flavor and super cheap!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peg Peppler"
},
"reviewBody": "My MIL was in the mood for a chicken casserole so decided to look for something different and came across this recipe. In general I thought it was good but being an avid cook, I cannot help but tweak things here and there. I had Gruyère cheese on hand so opted to use that for the Swiss cheese. I also had regular cream of chicken soup and regular sour cream on hand so used those. I sautéed onions and mushrooms in a little butter and added a teaspoon of minced garlic. I deglazed the pan with some dry white wine. Based on some other reviews, I decided to increase the amount of sauce and am glad I did. Some suggested doubling it but I went with an additional 50% which for us seemed the right amount. I used low carb penne (Dreamfields) instead of noodles as I thought they would stand up to reheating better (my MIL and husband love left overs!) I used cracked pepper in the sauce. I also increased the amount of topping as 1/3 cup seemed pretty scant so would suggest doubling the crumbs and Parmesan (and increasing the butter accordingly. ) I baked the casserole covered without topping for about 30-40 minutes, stirred the casserole well, and then added the topping and baked uncovered for another 15-20 minutes. I thought it was delicious as did my husband and MIL. The reason for four stars instead of 5 was that I think without my tweaks it would have been too bland for our tastes but all in all a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Viki M Colonna"
},
"reviewBody": "I made this with no changes . It was yummy and I will definitely be making it again! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "This was a great casserole recipe. I did think the recipe needed a bit more flavor added. I added in some finely chopped onion, garlic powder, and parsley. Next time I will double the sour cream and milk to make it creamier. It was just a touch drier than I like. I baked it covered in the oven for around 20 minutes til bubbly. Then uncovered and topped with the butter and breadcrumbs, for the remainder of the time and turned on the broiler the last couple of minutes to get a nice brown on the breadcrumbs. I used panko breadcrumbs to get a nice crunch on top. 4 stars as written, 5 stars with the additions. Thank you for the recipe. I will for sure make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev Matheson"
},
"reviewBody": "Over good. Didn't make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheriw"
},
"reviewBody": "My family really enjoyed this! Since it's not always easy for me to find meals that they all like, this gets five stars! It really is tasty with good flavors - stick-to-the-ribs comfort food. I used the ingredients I had on hand (regular soup, regular sour cream, skim milk), and I almost always use crushed Ritz instead of bread crumbs for casseroles. Since it's kind of bland-looking, I served with broccoli and a green salad. I like another reviewers idea of mixing everything together, then putting in the baking dish. I may try that next time. Thanks for sharing! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Mower Dodge"
},
"reviewBody": "I didn't have egg noodles, so I ended up using farfalle (bowties) instead. I did throw in some fresh broccoli that I had on hand, to round out the meal. The family really liked it - there were no leftovers. Next time I think that I will double the recipe - I have an 11-year-old son that eats everything that you put in front of him, and eats 5 meals a day (what I wouldn't give to have that kind of metabolism). This is a great way to use up leftovers, and a super easy weeknight meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Wingate"
},
"reviewBody": "This turned out to be an easier way to make Chicken Cordon Bleu than the traditional method. It's a great way to use up leftover ham! Actually, I borrow an idea from another recipe, then used this recipe for the remainder procedure. I cut raw chicken breast in chunks, dipped it in a seasoned flour and sauteed it. Then I combine all the ingredients except the cheese. I covered the casserole then baked it 20 minutes, uncovered it and added the cheese and baked another 20 minutes. Next time I think I would add the bread crumbs on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maria"
},
"reviewBody": "Kids loved it but the adults weren't crazy about the noodles. Really easy, will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Redondo Mama"
},
"reviewBody": "Good, solid comfort food dish and great for using up leftovers. Of course, I subbed in what I had, which was chipotle-seasoned chicken that I had left over from the night before, I chopped up some deli ham I had in the fridge and used cubed, sharp cheddar in place of Swiss, grated Romano in place of Parmesan, and crushed Ritz crackers in place of buttered bread crumbs. I layered and baked as directed and had no issues with dry noodles. I wonder if some are experiencing dry noodles because they're mixing all the ingredients before putting in the dish? By topping the noodles, chicken and cheese with the soup, milk and sour cream mixture, no noodles were exposed to the heat of the oven. Finished off with a generous sprinkling of Romano and the crushed Ritz crackers. Delicious and my kids and husband ate it up! I will definitely save this and use it with other leftover variations in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan in Rochester MN"
},
"reviewBody": "This is delicious! I doubled the saucy part and make in 2 square pans so I have one for my family and one to share. I mix it a bit but my husband isn’t big on the ham so I kind of “sprinkle” the ham and chicken on and gently fold it in. My mouth is watering thinking about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bevr"
},
"reviewBody": "This was a great casserole. Loved it. Only change i made was adding sauteed onions with the breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SABL"
},
"reviewBody": "Didn't have Swiss so used mix of mild and sharp cheddar. I usually dislike recipes with canned soups, but this was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Krissy Robbins"
},
"reviewBody": "Husband loved it! Needs a little more seasoning for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Venus Brian RapEdson"
},
"reviewBody": "It's very good. I didn't use fat free ingredients and I added poppy seeds to the topping. The kids liked it and it was pretty easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "penelope"
},
"reviewBody": "I use mixed macaroni. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Harms"
},
"reviewBody": "Awesome recipe. Easy to make. Delicious flavor. Will definitely become a new family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katyplease"
},
"reviewBody": "I will make this again. I am at an AirBnb house so had to use dishes they had...no 11x9 so had to use a 2qt square glass dish. Used medium sized egg noodles made a whole standard sized bag, but left out about a cup cooked so as to not fill up the whole dish. Used 2 chicken breasts, a cup of diced ham, and everything else same as recipe. So if you are in the same position as me then it is still possible to make with a different sized dish. It was really tasty and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandyS"
},
"reviewBody": "Very easy and yummy! I also tried this with some variations in ingredients. I omitted the chicken, doubled the ham and mixed in grated asiago cheese, finely diced red pepper, seasoned with a spicy Italian mix and fresh chopped parsley! Yum! Not your grandma's ham and pasta casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snhall1214"
},
"reviewBody": "This was PHENOMENAL! The only change I made was to substitute rice for the noodles (personal preference). I'll definitely be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Very rich and I made exactly as written. Not appealing to the taste buds. Husband said it was OK but not a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I made this casserole exactly as the recipe said and while quite good, it seemed a little bland to me. One thing I noticed in most of the other reviews was that they stirred everything together rather than layering it. I think that may have made it more flavorful. I will also add some salt and cracked pepper when I heat up the leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Shockley"
},
"reviewBody": "This was really good! I followed the recipe pretty closely, but I didn't have cubed ham, so I used lunch meat and my swiss was slices. I also didn't have seasoned bread crumbs, so I just sprinkled basil, oregano and garlic powder over it. As I made it, it was a solid 4...so if I did it right, I guarantee it would be a 5. I don't understand how anyone would find this dry. It was great with the amount of sauce called for. I didn't even mix it together, I spread it over the top as the recipe said. I'll make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda O'Brien Lindenthal"
},
"reviewBody": "I did not have sour cream, so i left it out. A new favorite comfort food recipe for my family, we loved it. Sometimes the simplest recipes are the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Jackson"
},
"reviewBody": "Good use of leftover ham, but fairly unmemorable. Don't know that I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shellee"
},
"reviewBody": "I really liked this recipe and so did my boyfriend. I didn't have time to go to the grocery store so I had to substitute a few items. I used cream of mushroom soup, bergenost cheese (muenster/havarti style), and rotini pasta! I did use 1.5 c sour cream and 1/2 cup milk plus 1/2 c chicken broth, since I didn't have cream of chicken soup. I mixed it with all other ingredients and sprinkled with bread crumb mixture. loosely covered and man was this good! I did add green onion. Next time I'll shop first and make as directed but I'm really glad I found this recipe, needed to use up chicken and ham. Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "307"
},
"reviewBody": "Delish! I used small cubed cooked chicken, and good quality deli ham slices cut into bite pieces. It had all the flavor I would expect of a chick cordon blue., and I even used cooper sharp cheese instead of Swiss. Took me more like 35-40 min to prep, but was worth it. served with a side salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Henderson"
},
"reviewBody": "This is definitely a keeper! I followed other reviewers' suggestion of using 1 cup of milk and 1 cup of sour cream for the sauce. It could have been a little more creamy, so next time I'll probably use 1 1/2 cups of each and 2 cans of cream of chicken soup instead of one. I will also cover with foil to prevent noodles from drying out. Other than that, it was very cheesy and delicious! My 90 year old grandfather even liked it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Englund Denman"
},
"reviewBody": "My husband loved this and I will make it again. I did my best to make it lower sodium and it still came out great -- low sodium Swiss Cheese/ham/soup, and unsalted butter for the bread crumbs. I used penne pasta instead of noodles. I also used broiled chicken tenders that I prepared myself, seasoning with fresh ground pepper and basil flakes -- I broiled the chicken for only 9 minutes which made is just exactly done -- the meat was tender, juicy and not over cooked in the finished casserole. I mixed the ham, swiss and chicken before putting it on top of the pasta. followed directions and spooned the \"sauce\" mixture over the pasta/meat -- the end product had sauce and cheese distributed evenly throughout the whole dish. Steamed broccoli and/or salad make perfect sides. I am guessing that you can even add frozen peas or broccoli florets into the mix before baking if you want a one-dish meal."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231154/creamy-chicken-cordon-bleu-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17371/main-dish/chicken/chicken-cordon-bleu/",
"name": "Chicken Cordon Bleu Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231154/creamy-chicken-cordon-bleu-casserole/",
"name": "Creamy Chicken Cordon Bleu Casserole"
}
}
]
}
}
, "about": [
]
}
]