				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Cream Cheese Cookies I"
,"datePublished": "1997-12-17T10:33:58.000-05:00"
,"dateModified": "2022-07-14T17:16:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Robin"
,"url": "https://www.allrecipes.com/cook/24327709"
}
]
,"description": "These cookies are delicate when made with a press, or hardy when dropped by spoonfuls. I fill centers of press cookies with preserves or a chocolate chip for added variety."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/U88xHeC-it_rqK_oOg71qi9FO6A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4455965-8cd7be5e1cc5436b97f739a11f1cdacc.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Cream Cheese Cookies I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "246"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "54 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "22 mg"
,"sugarContent": "3 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup butter, softened",
"1 (3 ounce) package cream cheese, softened",
"1 cup white sugar",
"1 egg yolk",
"0.5 teaspoon vanilla extract",
"2.5 cups all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream together butter, cream cheese, and sugar until light and fluffy. Beat in egg yolk and vanilla. Stir in flour until well blended. Drop dough by spoonfuls or use a cookie press to place onto prepared cookie sheets. If using floral cookie press design, make an indentation in the center with a thimble, fill with preserves, or press candy into center."
} ,{
"@type": "HowToStep"
,"text": "Bake for 15 minutes in preheated oven. Cookies should be pale."
} ]
,"recipeYield": ["72"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Kurtz"
},
"reviewBody": "I use the whole package of cream cheese. I measure vanilla with my heart. If I want a slightly more molasses background flavor, I will use brown sugar. I prefer to cook the cookies for just the exact amount of time listed, which can result in a very light cookie. I’ve made these before, and put a little finger print in the center and some jelly. I didn’t use the cookie press for this as I have in the past, I only had a piping bag available."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamagee"
},
"reviewBody": "Worked well for cookie press. I did take another reviewers suggestion and added some strawberry jello till I got a pink color I liked (I also did hearts). I also added 2 tbs marachino cherry juice and a few tbs of powdered sugar to balance out the added liquid. Everyone loved them, said they taste like strawberry cream cheese, pretty and yummy. Also, I did use the full 8oz cream cheese. Ive noticed over the years many recipes that are not from the Northeast US, call for 3oz, in my area we have 8oz bricks of cream cheese as the standard, I believe other areas may have 3oz whipped tubs as their standard. I dont think this is a typo, Ive seen dozens of recipes that call for 3oz and I just use my 8oz and the recipe turns out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ldyreds987"
},
"reviewBody": "They were good. They came out odd shapes though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarcookie123"
},
"reviewBody": "SUPER easy and delicious! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cal516"
},
"reviewBody": "Used 8oz Cream Cheese vs 3. Taste was fine but Cookies were dry &amp; crumbly. Too much flour? Probably won’t make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peekaboo2u"
},
"reviewBody": "I have never before left a review. But I’m going to leave One now! These cookies are amazing. I can’t stop eating them. Will make them over and over and over again. Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I followed the recipe, perfect. I use a kitchen scale for the cream cheese and the cookies are perfect. I enjoy reading the variations offered, and then, why mess with a good thing?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael Walkins"
},
"reviewBody": "I had to use margarine, as I am allergic to butter, so the taste was a bit different. I compensated by adding 1/4 tsp lemon juice and 1/4 tsp pink salt. I also lessened the flour by 1/2 cup because my dough was getting too stiff to use a press. For a finishing touch I added a half of a cinnamon sugar pecan in the middle of my pressed cookies. Very tasty and festive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "This is almost exactly like our family recipe. We used a whole egg and a teaspoon of baking powder. \nI used 8 oz of cream cheese per the reviews and the cookies were really heavy. \nDidn't like the texture so won't do that again. \nOur family likes lemon, so I sub 1 tablespoon of lemon juice for the vanilla. \nI also make a glaze of lemon and powdered sugar after baking and then decorate. These are much bettter if you use a cookie press. Chill the dough a bit in the cylinder before pressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Brice"
},
"reviewBody": "I love the cookie itself, it's not overly sweet. I used all kinds of toppings, different jams, pecans, cranberries, choc chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Revesz"
},
"reviewBody": "Tried this using 8 oz cream cheese cuz I can't get enough of it. Great easy recipe! Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maura Quast"
},
"reviewBody": "I used 8 oz cream cheese with 2 cups flour and a tad more vanilla extract. Half of cookies were thumbprints with blackberry preserves and other half were thumbprints with chocolate. I did have some dough left over so I made 6 plain cookies afterwards. My batches needed a lot more baking time (they both were still raw at the 15 min mark in the oven). So my cookies had to bake for 23-25 minutes at 350 degrees but then again I used parchment paper to line my cookie sheets for quick clean up so maybe that was messing with timing. I did find that the dough is sturdy and thick enough when raw / not very wet or sticky so I was easily able to work it with gloved hands. Easy recipe and pretty basic yet somewhat mild flavor. Reminds me of a milder shortbread flavor and the cookies were soft with a little bit of crunch. I might add some more cream cheese and different flavorings to my next batch I make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefPotato"
},
"reviewBody": "Yummy and easy recipe and it’s hard to mess up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shnitzel"
},
"reviewBody": "These were good, I did put in more cream cheese and did not have a problem. I would add even more next time. Say 6oz - Dec 2022 made again - 8 oz of cheam cheese - very good. Pretty easy to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Barton"
},
"reviewBody": "This recipe is great! I used a full 8 oz block of cream cheese because I love the cream cheese flavor. I made no other changes and the cookies are wonderful! As a side note, I purchased a new OXO Good Grips cookie press and this recipe is almost identical to the recipe included with the cookie press. A couple of things to note: The OXO recipe specifies Unsalted butter, and says to cube the cold butter. I think this helps to minimize the stickiness when using the press. This is now my go to sugar cookie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Beth Bannon"
},
"reviewBody": "FOR GODSSAKE take the recipe down! If it's wrong , please correct it. NOT 3 oz of cream cheese. It's 8 oz. People are making it incorrectly and not knowing it until it's too late. Wasting their time and money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "I love the texture but it really didn't have much of a taste but next time I will put a frosting on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Hildegard Mazzulla"
},
"reviewBody": "I was so easy. I use a the bottom of a highlighter to push small \"thumb print\" shapes, then filled them with semi-sweet chocolate chips. When the cookies came out of the oven, I use the flat edge of a knife to spread the chocolate in the dip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolR"
},
"reviewBody": "I made these exactly like the recipe shown, with 3 oz of cream cheese. They have a delicate flavor and texture, perfect with coffee or tea. I baked them as drop cookies and will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Leary"
},
"reviewBody": "I love this recipe! I made 2 different batches. I added chopped pecans to 1 batch and covered them with confectioners sugar. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMR"
},
"reviewBody": "Used 8 oz cream cheese as others had suggested and rolled them into one inch balls which I flattened slightly. Made a small indentation with the back of a teaspoon and filled with raspberry jam. Very good cookie and could really taste the cream cheese. Would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bettycrocker"
},
"reviewBody": "I used almond extract in place of vanilla because they taste more \"Christmas-y\" to me. I would have given 5 stars except that the dough didn't work well with the cookie press. I tried to do a drop cookie instead but they didn't spread so I had cookie drops and strangely shaped Christmas trees. I will use the recipe again (with 8oz of cream cheese) but will try rolling them into balls then pressing them down with the back of a spoon so they can all be uniformed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Maxwell"
},
"reviewBody": "They are rather quite easy and fast to make if you're a seasoned cook. I'm not into cookies but tried this recipe cause I was bored of the chocolate chip and the oatmeal cookies. I wanted something different for the family to snack on at work/school.\n\nI used 1 block/250g/1cup/8oz. of cream cheese and 1tsp of vanilla since why not? \n\nThe only problem was that the recipe didn't specify that if you shape them like a ball (since I don't own a cookie press nor do I want one), they would retain the shape, unlike oatmeal or chocolate chip cookies.\n\nHowever, I think this is a bonus cause once they cool, you can dip them in chocolate and have them be hard shelled cookies! Soft, chewy, and puffy! It's a cheesecake in less than 30mins!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Kennedy"
},
"reviewBody": "I'm making these as I'm writing this. I made thumbprint cookies with this and slightly flattened with a glass dipped in sugar. Its the cream cheese cookie iv been lookin for! Pretty as a picture and taste wonderful. Oh, I did use 8oz. cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irasema Klos"
},
"reviewBody": "Excellent recipe. Worked perfectly on our press. Just 1 modification which resulted to a successful outcome. We added almond extract as oppose to vanilla. These babies flew.\nYummy and thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSADUFFY"
},
"reviewBody": "Rated it on recipe as presented. I had no issues with taste or being able to use it in a cookie press. I did lower temp to 350 deg. but only because I have a convection oven. I do think it's worth considering adding more flavor if you aren't going to ice them or use much sugar for decorating. I've made lots of Spritz recipes, and use of more vanilla or swapping for almond, orange, lemon or peppermint extracts is common if you aren't decorating much. I do like this recipe best of the ones I've tried. A hint for cookie press is I don't chill the dough unless it starts getting sticky, but I do put my silicone sheet or nonstick cookie sheet in the freezer, so the cookies stick to the pan and not the cookie press. I use parchment a lot for baking, but find it doesn't work with these. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Julia Kim"
},
"reviewBody": "Too sweet, the cookie came out really thin so it didn't take the shape of the cookie press. Also crumbled apart easily. Followed recipe to a tee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Antaya-Boland"
},
"reviewBody": "I put in an 8oz block of cream cheese and a small package of strawberry jello. I don't have a cookie press so I dropped by teaspoons. You must press down a bit; the cookies do not spread when cooked. I baked only 10 minutes. The are awesome and the colour is very bright."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wifey216"
},
"reviewBody": "First time using this recipe and I have to say it is really gd!! I used 8oz of cream cheese and 1 tsp of vanilla, also I used more flour on the ones in cookie press. Ones with apricot in the middle I did not use extra flour. I would make these again my kids cannot get enough of them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ashley Nicole Holden"
},
"reviewBody": "Even with 8 ounces of cream cheese the flour is way too much. \nIt took way too much cream cheese to fix it...so I strongly suggest you add a cup of flour or less and check the texture...and taste...definitely taste it!!! And have others too..in case you taste it too much!! If you change the serving amount to less, definitely check."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pink J"
},
"reviewBody": "I used 8oz of cream cheese and added a dash of salt as I was using unsalted butter. Also only used 2C of flour (but next time, I would use likely 2 1/4 -1/2C. I thought my dough was good but it ended up being a touch too soft to use in my cookie press). Great to use in cookie press. I also use the dough to make thumbprint cookies using jams, as well as just plain round cookies with a pecan pressed on top. Really yummy. For some reason though, at 325F, I had to bake my cookies for about 20mins (and even longer for thumbprints... approx 22mins). Overall, I would definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JenSeeker"
},
"reviewBody": "I used 8oz of cream cheese every time.\nI treated them like oatmeal cookies in that I rolled them into walnut sized balls then flattened them with a glass bottom covered in sugar.\nMy topping experiment was a success in that I used applesauce in leiu of preserves. Then sprinkled cinnamon on the top. They were delicious with coffee.\n\nToday's experience is the same recipe, adding chocolate chips to the mix. They smell amazing thusfar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Danielle R"
},
"reviewBody": "I did not care for this recipe. I followed the recipe to the letter, and the texture was like a dry biscuit. The flavor was not sweet at all. I tried to underbake a batch to make them less dry, and it was still the strangest texture ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "thekingswife"
},
"reviewBody": "I tried 2 batches of this recipe. Both times with a slight adjustment to the second batch they seamed to turn out slightly dry. They were not bad tasting just slightly dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smkiya"
},
"reviewBody": "These cookies are delicious! Like many previous reviewers, I used 8 ounces of cream cheese and I used a little more vanilla (about 2 teaspoons - I usually add extra vanilla to recipes). I also put maraschino cherry halves in the center of the spoonfuls of dough before baking. After baking and cooling I sprinkled some powdered sugar on top. I added the recipe with the modification to my recipe book. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mira.k"
},
"reviewBody": "Wow! \nGreat recipe. I made it exactly as noted in the recipe. And the cookies were wonderful! I have an older large cookie press from Williams and Sonoma that is sadly no longer available, I used it to make these cookies and it is the very first recipe EVER that worked immediately with the press. Every single other recipe that I have used with the press goes through a bit of an adjustment period with the first few cookies going through the press. The very first cookie was absolutely perfect! And the cream cheese adds a wonderful moist texture. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Hay"
},
"reviewBody": "I've tried this recipe as written in the past, and have been rather ho hum about it, it was very floury and no cream cheesy enough. This time around I increased the cream cheese to 8 oz, decreased the flour to 2 1/4 cups and increased the extract (I used lemon) to 1 tsp. The batter is DIVINE. I have to wait a couple days till my teenaged girl elves come help me with the baking, and I did that on purpose so the cookie batter could get all friendly with itself. So far so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mandy Elizabeth Billingsly"
},
"reviewBody": "added chcolate and almonds and much emproved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stephoney"
},
"reviewBody": "Very tasty cookie with the full 8 oz of cream cheese used instead of 3. I also added a tsp of baking soda to the mix to make them puff up a bit and opted for 1 tsp of vanilla instead of 1/2. I'm a ridiculous vanilla fan. I always double to amount. They're probably perfectly fine without the extra, too. I added semi and milk chocolate chips to the dough while mixing and dropped by large tsp. They turned out great. Both my son and husband loved them in their lunches :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SpiffyRik"
},
"reviewBody": "I just finished devouring this recipe! I used 8 oz of cream cheese and 1/2 tbsp vanilla. I also popped in some semi-sweet chocolate chips and about 1 tbsp lemon juice and 1/4 tbsp key lime juice for some tartness. My husband loves them and I like the sweet and tangy mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eireann_nm"
},
"reviewBody": "This is a great base recipe! I made chocolate cheesecake cookies with my cookie press and they came out wonderful! Even my boyfriend (who doesn't like cookies, which is nuts, who doesn't like cookies???) loved them!! I used 8 oz. of cream cheese, 1 and 3/4 cup flour, 1/4 cup unsweetened cocoa and at the last minute I added a splash of Kahlua so I added 2 more tbsp of flour.This is absolutely going in my recipe box at home!! Also, I only had them in for about 11 minutes and that was enough. I wanted them soft like cheesecake :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingDiva"
},
"reviewBody": "VEEEEEEEEEEEEEEEERRRRRRRRYYYYYYYYY GOOD~!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Koekje"
},
"reviewBody": "I would recommend trying the recipe AS IS before making changes. I altered the recipe per reviews and shouldn't have done that. I will retry the recipe again. I had to pipe my cookies out; the dough was too sticky for my press. The taste was OK, nothing WOWWY."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "elzbth488"
},
"reviewBody": "I used the entire 8oz of cream cheese and these cookies were fabulous! Strawberry preserves pressed into the center made a delicious strawberry cheesecake-ish cookie! I made these for Christmas and they were a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JMANSUR"
},
"reviewBody": "This is a great recipe! Also, I just want to say that recipes are all different and so are tastes, so please don't assume that it's a typo or mistake just because you disagree. I just found the original Mirro cookie press cream cheese cookie recipe that my mom used EVERY YEAR FOR FIFTY YEARS, and it also calls for 2 1/2 cups of flour and 3 oz. of cream cheese. The cookies are fantastic. My mom is an exceptional baker as well. So, sure, add 8 oz. if that's what you prefer. However, please don't condescend to the person who wanted to share her recipe. It's a good one, even if it's not exactly to your liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babigyrl"
},
"reviewBody": "Be very careful! These are the BEST cookies ever! And are extremely addictive! Once you start, you will not want to stop. By dropping spoonfuls you will get small bite size cookies which are perfect. Before baking I brushed the tops with egg whites then added colored sugar crystals for the holiday flare. Be creative. Add what ever you want to the tops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buddingchef"
},
"reviewBody": "Just like how mom used to make them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsten"
},
"reviewBody": "Wow! These were great! As long as you add 8 ounces of cream cheese and maybe a bit more vanilla extract this works! Be prepared to freeze part of the dough because this makes a lot of cookies! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith"
},
"reviewBody": "I am defiantly going to try this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Avalas"
},
"reviewBody": "These are very good when made with the 8 oz of cream cheese and only 2 cups of flour. The dough works well in the cookie press. With the cream cheese, the cookies will come out thinner than your traditional spritz, so that's good to know up front. The taste of these is fantastic and very soft and buttery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deborah"
},
"reviewBody": "These are a delightfully light cookie. I love the cream cheese doesnt overpower the butter flavor. \nThey make excellent cut out cookies if you chill the dough well and in small batches. They are done before they are brown. Bake only until lightly golden around the edges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MINI"
},
"reviewBody": "Great tasting cookie. I made a half batch using the drop spoon method and filled the centers with blackberry jam. I used 3 oz of regular cream cheese and 1 oz of strawberry cream cheese. Good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veb"
},
"reviewBody": "I think this recipe is fine on it's own. Traditionally I have used 4 oz cream cheese for every 2 cups of flour so that is the only change I would make (less 1/2 cup flour - increase 1 oz cream cheese.) especially if you intend to use some type of jelly as the flavor of cream chees + jelly can be very overpowering. Additionally you can relace the vanilla with preserves or cherry flavoring for an added touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "frankschick"
},
"reviewBody": "I used the suggested 8oz of cream cheese, cut back on the flour too. The dough tasted fabulous. But too sticky to get through a press. Just spooned it onto the sheet. They are bland as anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristyn000"
},
"reviewBody": "I like this recipe ALOT.the only thing I changed was 3oz cream cheese to 8oz. I liked them plain tho, and everyone else loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bcornette"
},
"reviewBody": "Not very flavorful. Kind of bland. Won't be making this again. I'm sure if I had not of put in EIGHT ounces of cream cheese instead of THREE, it would have been a lot worse...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Devin Stasicha"
},
"reviewBody": "Recipe tasted great but I followed some other reviews and backed off the flour to 2 cups. Cookies were a little too sticky even after refrigerating for 1 hour. Other than being hard to get out of the cookie press- great tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana Sweeney"
},
"reviewBody": "I took the advice of another reviewer to add a package of strawberry jello and increase the cream cheese to 8 oz. Cookies baked 8-9 minutes only--at the recommended 15 they were burning black!\n\nDough was a little sticky...I probably should have used the full 2.5 c flour rather than cutting back to 2 as so many reviewers said.\n\nStrawberry Cheesecake cookies were tasty though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Used an 8 ounce package of cream cheese and 2 cups of flour, with these changes, these cookies are probably my favorites ever. I have done them plain and with strawberry and blackberry jam. Also tried chocolate chips but they are better plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy476"
},
"reviewBody": "Followed recipe exactly and they turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nates-mom"
},
"reviewBody": "I made these cookies for Christmas, but I added a little twist. I stuffed the cookies with a little banana and some chocolate chips in the dough.. my son and I loved them so much we didnt share... lol.. amazing!!!! will def use this again =) thx so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these for Christmas trays, and filled half of the cookies with apricot preserves and the other half with strawberry jam. After they cooled I criss-crossed each cookie with a a glaze made from powder sugar, softened butter, a little milk, and some almond extract. The cookies are beautiful on trays, and tender and delicious. Also easy and actually fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidibsmom"
},
"reviewBody": "I made these for Christmas trays, and filled half of the cookies with apricot preserves and the other half with strawberry jam. After they cooled I criss-crossed each cookie with a a glaze made from powder sugar, softened butter, a little milk, and some almond extract. The cookies are beautiful on trays, and tender and delicious. Also easy and actually fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sharrie"
},
"reviewBody": "I made these cookies last night and OMG my kids were eating the crumbs off of the plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dmseck"
},
"reviewBody": "These are now on my yearly Christmas cookie list! 5 star flavor, but you REALLY do need 8 oz of cream cheese -- thus, 4 stars. Also used 1/2 cup unsalted butter &amp; 1/2 cup margarine, for the flavor &amp; texture. 2 1/4 cups flour, 3/4 cup sugar (filling adds adds to the sweetness, so I cut back on the sugar), and almond flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "audra71"
},
"reviewBody": "After reading reviews, I made these this morning. I did use 8 oz cream cheese, and 2 cups flour (all purpose flour, because it's what I had). When I tasted the dough, it did have a shortbread type flavor, so I added 1/2 c chopped pecans. Once baked (mine took 17 min to get firm enough to move), they are delicious, and have a great cream cheese flavor. I'll be making these again, thanks to the great reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Earlshoney"
},
"reviewBody": "THESE ARE THE BOMB!!! A little like biscuit consistency but more moist. I made exactly as directed and they were gobbled up. Already on my list of Christmas cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauralee78"
},
"reviewBody": "omg I made these cookies with 8 oz of cream cheese and found that they were amazing perfect for any occasion! They look pretty with cherries or preserves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrew's Mommy"
},
"reviewBody": "These taste really good, but did not work in my cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "l make alot of cookies over the holidays and this year l decided to start early. This receipe is definately one that l will make every year from now on.Moist and delicate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Beaudoin"
},
"reviewBody": "very good recipe I did them as a drop dough and I will defanitly make them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jojo"
},
"reviewBody": "I used the 8 ounces of cream cheese as suggested and 1 3/4 cups of flour. I also put rasberry perserves on top. But I have to say that these cookies reminded me of a biscuit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holls"
},
"reviewBody": "As some pointed out added 8 oz of cream cheese and lemon juice with rind the kids went crazy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Becka Bush"
},
"reviewBody": "I have to say i was very disappointed with these cookies. I followed the recipe exactly and they taste just like salty flour with a little cream cheese aftertaste. sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teaky"
},
"reviewBody": "This is the easiest cookie recipe I have ever used. I modified it somewhat and used 4 oz of cream cheese. I pressed a pecan half into each cookie and drizzled them with a glaze of powdered sugar, milk and vanilla. I will keep this recipe close for a quick treat or dessert. I'm sure it will encounter several variations, this is an excellent base for lots of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christie Biggers"
},
"reviewBody": "These were an absolutely delicious base, but they are a touch bland without some decorating or interesting additives. I dipped each in little red and green nonpareils and they were lovely but I couldn't help wanting to turn them into sandwich cookies with some chocolate fudge. All in all, I loved them and I will be making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Definitely use an entire 8oz block of cream cheese. Three ounces doesn't cut it. Also cut the flour back a bit. Makes all the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emma"
},
"reviewBody": "I couldn't get these to stick from the cookie press at all. I tried chilling the dough, chilling the sheets, nothing worked. I ended up dropping them on the sheet, rounded but they didn't cook all the way through in 15 minutes. Won't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnny T"
},
"reviewBody": "My Mom has been making these cookies for Christmas since I was a little boy (48 now...). She always doubled the batch and made half green and half red (she used 8oz. cream cheese for each batch), then she Pressed them through cookie press in Tree shapes and wreath shapes. She used Chocolate, colored and many other type of sprinkles. She used Rum extract on a small handful of a batch. Every year everybody looked so forward to these cookies!!!! Now that she has passed I make them, but must have made a mistake with the flour when rewriting it.... they always tasted too flour-ey... but thanks to you great people I fixed it, made them and they are great!!!! Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather McCarron"
},
"reviewBody": "This is the same recipe that my grandmother who was born in 1903 used. It is correct as written. The cookies get there sweetness from the sugar spinkle on top. Instead of using a cookie press, I roll the cookies, dip in sprinkles and flatten with a glass bottom. They look like bakery cookies and ALWAYS get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bee"
},
"reviewBody": "good recipe ...needed to use eight ounces cream cheese....they were good but wanted more cream cheese taste so added another three ounces....better...next time will use even more cream cheese...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulainwv"
},
"reviewBody": "I've had this recipe for years, but there are just a few slight alterations to this one. Reduce the flour to 2 1/4 cups, add 1/2 tsp cinnamon to the flour, and use 1/2 cup softened butter &amp; 1/2 cup margarine. ( I most always use Land O Lakes for both). Chill the dough in fridge for about 30 minutes. Use cookie press as directed. This was passed down from my mom. They make the best cookies and taste even better a few days after they are made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TamaraB"
},
"reviewBody": "I made these cookies today with just two small changes to the recipe- used one whole package of cream cheese (8 ounces) rather than the 3 ounces as written in the original recipe and I doubled the amount of vanilla to 1 teaspoon. The cookies came out great- nice, delicate flavor and soooo easy to make. I sprinkled red and green colored sugar on top before I put them in the oven to make them more festive looking for Christmas. I will be adding this recipe as one of my regulars for Christmas cookie baking for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roni"
},
"reviewBody": "First time using cookie press... a disaster. wound up just spooning the dough on a cookie sheet. Very disappointed. BUT.....the tasted great with some strawberry jam in the centers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olay"
},
"reviewBody": "These are my favorite! I have the same recipe, I've made'em a zillion times, they don't need more cream cheese, my recipe calls for 1/4 teaspoon of salt, I roll the dough in the balls and press with flour dipped fork, keep them in the 375 degree oven untill golden brown( only takes a few minutes)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ashleigh McClune"
},
"reviewBody": "Something must be wrong with this ingredient list, b/c 2 1/2 cups of flour was way too much... the cookies tasted very floury when they were finished. Either they would need more of everything else or less flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "minnymouse41"
},
"reviewBody": "I have been making these for years &amp; I always use 8 oz of cream cheese &amp; only 2 cups of flour. I usually make these for Christmas &amp; use the star tip on my cookie press. I put red and green candied cherries on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blah Blah"
},
"reviewBody": "i made a variety of homemade cookies for my wedding last december, and these were amazing! i did follow the advice of some of the other chefs and changed the recipe to 8 ounces of sour cream and cut back on the flour a bit. my four star rating is only because the original needs to be altered. thank you for this recipe robin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Erin Helms Nilles"
},
"reviewBody": "NOT GOOD AT ALL. I even used the suggested changes. I put in 8oz of cream cheese and cut back on the flour. They still tasted like bland flour cookies. I can't believe the ratings are as high as they are. I have never rated anything this low, but the consistency wasn't good, the flavor wasn't good, total waste. We threw them away after we each ate one..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tstone97"
},
"reviewBody": "Although my husband LOVES these cookies and has requested me to make these again, I have to say that I absolutely did NOT like them. Shouldn't ever have to add any thing like blueberries in order to like something that I bake but...these are just not the greatest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JILLIANBEE"
},
"reviewBody": "I LOVE these. They are so easy to make and they are delicious. I use 8oz cream cheese, 1 tsp vanilla extract (or almond if I want something different), and 2 cups of flour. After they are somewhat cooled I sprinkle with powdered sugar. They taste even better cold! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anika"
},
"reviewBody": "These were good cookies, but not outstanding in any particular way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lyuda"
},
"reviewBody": "I made these as drop cookies and added 8 oz cream cheese as others have suggested. They had a very strong cream cheese flavor, so I may try to add jam and/or white chocolate chips next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CTORSLOG"
},
"reviewBody": "Five stars when using 8 ounces of cream cheese instead of the 3 ounces noted in the recipe. Because I did not have a cookie press and wanted to do something a little different (other than simply making drop cookies), I chilled the dough for about 1 hour and then rolled the dough into small balls, pressed a Hershey's kiss in the middle, and sprinkled the cookies with colored sugar. They turned out great. I will definitely be making this again. I believe another reviewer said she added some Jello mix to her batter with great success. I think I will try doing that next time--maybe use strawberry Jello for Valentine's day when I have to make cookies for my daughter to bring to preschool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "This recipe is even better with a different flavor of cream cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patk5"
},
"reviewBody": "Recipe is fine. I add a quarter teaspoon lemon extract &amp; yellow food coloring. Use swirl template of cookie press. Garnish with red sprinkles &amp; half a Marascino cherry. Bake 10-15 minutes, but don't overbake. Makes a great cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rreinhar"
},
"reviewBody": "Followed the suggestion of 8 oz of cream cheese. Good Flavor but WAY TO STICKY for a cookie press!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DanO"
},
"reviewBody": "8oz Cream Cheese needed as other mention. Cookies were good but I found that you need to refrigerate the dough before using a cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lucky2030"
},
"reviewBody": "Was this recipe suppose to have baking powder in it? The cookies came out very flat. They tasted good, I used 5 oz. of cream cheese &amp; about 1 3/4 cup flour. I used my cookie press, worked great !"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10204/cream-cheese-cookies-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
"name": "Drop Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10204/cream-cheese-cookies-i/",
"name": "Cream Cheese Cookies I"
}
}
]
}
}
, "about": [
]
}
]