				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Creamy au Gratin Potatoes"
,"datePublished": "2000-02-06T14:23:07.000-05:00"
,"dateModified": "2023-01-31T05:51:55.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cathy Martin"
,"url": "https://www.allrecipes.com/cook/5910"
}
]
,"description": "Au gratin potatoes made with thinly sliced potatoes and onions baked in a decadently rich and creamy Cheddar cheese sauce until tender and bubbling."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/r3xput4ZXJPWudVsNkAct2cfJZs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/15925-creamy-au-gratin-potatoes-mfs_121-ae0ff47de55f4b838fdddd4243aad285.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1561185882001",
"description": "See how to make the best scalloped potatoes recipe.",
"duration": "PT3M41S",
"name": "Creamy Au Gratin Potatoes",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2019/12/creamy-au-gratin-potatoes.jpg",
"uploadDate": "2021-03-03T12:58:57.325-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Creamy au Gratin Potatoes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "5929"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "499 kcal"
,"carbohydrateContent": "49 g"
,"cholesterolContent": "77 mg"
,"fiberContent": "4 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "683 mg"
,"sugarContent": "9 g"
,"fatContent": "25 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 medium russet potatoes, thinly sliced",
"1 medium onion, sliced into rings",
"salt and ground black pepper to taste",
"3 tablespoons butter",
"3 tablespoons all-purpose flour",
"0.5 teaspoon salt",
"2 cups milk",
"1.5 cups shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C). Butter a 1-quart casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Layer 1/2 of the potatoes in the bottom of the prepared casserole dish; season with salt and pepper. Layer onion slices over top, then top with with remaining potatoes. Season again with salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a medium saucepan over medium heat. Gradually whisk in flour and salt and cook, whisking constantly until raw flour flavor has cooked off, about 1 minute. Gradually add milk, about 1/4 cup at a time, whisking well after each addition to incorporate; the gradual addition and whisking of milk will help avoid lumps in your sauce."
} ,{
"@type": "HowToStep"
,"text": "Cook, whisking constantly, until the mixture has thickened, 3 to 5 minutes. Stir in cheese all at once; continue stirring until melted, 30 to 60 seconds. Pour cheese sauce over the potatoes, and cover the dish with aluminum foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/r3xput4ZXJPWudVsNkAct2cfJZs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/15925-creamy-au-gratin-potatoes-mfs_121-ae0ff47de55f4b838fdddd4243aad285.jpg"
}
]
,"text": "Bake in the preheated oven until potatoes are tender and sauce is bubbly, about 1 1/2 hours."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenwife"
},
"reviewBody": "This was great! Everyone loved it. I followed the recipe exactly except chopped the onions as others suggested. I also uncovered for the last 20+ mins to have it golden. Yum! A food processor makes this meal prep a breeze! (Slicing potatoes thinly, shredding cheese, and chopping onions) Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "Delicious! Made as directed. Cooked additional 15-20 min without foil to get a little brown on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happychef"
},
"reviewBody": "I caramelized the thinly-sliced onion rings in butter (ghee, actually) first, then added the flour and gradually stirred in the milk. Then I added salt, pepper, 1 cup of cheddar and 1 cup of Swiss cheese. I layered the thinly-sliced potatoes in a buttered casserole and poured the sauce on top. I used a fork to lift the top potatoes so that the sauce covered all layers. Then I topped it with more grated cheddar. I baked it with the casserole lid on for the first 50 minutes and then removed the lid and baked it for another 20 minutes. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added paprika to the top before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Love for Sunday dinner with the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucie"
},
"reviewBody": "This has become a family favourite! Creamy, cheesy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "made it last night but did not eat it until the next day. (was taking it to elderly mom). It was a hit. Loved it and wants me to make it again for her. Easy and simple to make. I sliced and boiled/cooked my potatoes 1st. Minced my onions instead of slicing them, used less onions. Wanted to make sure it was not too much.. Followed the other parts of recipe as stated. Placed in oven at 400 for 40-45 min to allow onion and cheese to do its thing. Came out great. Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Conway"
},
"reviewBody": "Was definitely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this recipe for company, every drop was eaten. I followed other users advise and cut the onions smaller. Uncovered dish for last half hour. Delicious and will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roseyroseyjj"
},
"reviewBody": "This dish turned out exactly the way I was hoping for. I read several Au Gratin recipes and chose this one for its simplicity. I used Russet potatoes and changed the 2 cups of milk to 1/2 &amp; 1/2 milk plus 1/4 cup whole milk. I changed the flour to 1/3 level cup. I wanted to be sure there was plenty of Bechamel to make the potatoes extra creamy. I buttered the baking dish and put 1/2 cup Bechamel on the bottom of the pan. Then I put in a layer of 1/8\" sliced potatoes, a layer of onions thinly sliced and roughly chopped onions and 1/4 cup shredded Mexican blend cheese (that's all I had on hand). Start each layer with Bechamel. I made 3 layers all together and topped it all with the remaining Bechamel and 1/2 cup cheese. Bake at 400 on middle rack for 30 minutes then turn it around so it will cook evenly, and cook for another 30 minutes, remove the foil, and bake another 20 minutes. It was divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "YUMMY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "avastarr11"
},
"reviewBody": "Although I should’ve used a slightly larger pan, I followed the recipe to the “T!” It was awesome! Thank you😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Baldwin"
},
"reviewBody": "So good! I'm glad I listened to the reviews and minced the onions instead of slicing them into rings. They give the perfect flavor but blend into the potato texture so you don't even realize they're there (good if you have picky kids). Also, definitely recommend cooking uncovered for the last 30 mins to brown the top nicely. I cooked mine at 425° for 1.5 hours but i also used a deeper dish and had 4 or 5 layers (onions sprinkled between each layer)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya Richter"
},
"reviewBody": "I make it a lot hubby and both my boys love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzflack"
},
"reviewBody": "Delicious. I used 1 cup heavy cream and one cup 1/2 and 1/2. Everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "This recipe was so flavorful and visually appealing. I sliced potatoes thin on #1 of the mandolin. I incorporated 1/2 cup of Brie that I had on hand. Also used dried diced onions instead of slicing fresh. Baked uncovered and it took 40 min to bake. Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Webber Akre"
},
"reviewBody": "I made this for New Year's Eve lunch to go along with beef tenderloin, and creamed spinach. Whole family, including me, LOVED them. I try not to change up people's recipes too much. Since I had 7 people, I just kept slicing potatoes on my mandoline until I had enough for 3 layers. Minced onion super fine and spread over first 2 layers. I doubled sauce recipe and used a combo of whole milk and cream as well as a combo of Swiss and Cheddar. Also, I baked it the night before and just warmed up in over for about 20 minutes to get top nice and brown and bubbly. Excellent potato dish, but it won't help you lose any weight! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Next time will pre-cook potatoes half way in microwave so cooking will not take 1 1/2 hrs. Good recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wgkelley"
},
"reviewBody": "Delicious! I sauted the onions for a few minutes and that was a nice addition. Used half sharp cheese. Don’t use skim milk or add more flour to make it thicker. Spray the Pyrex first - they stick bad if you don’t."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I liked the recipe as a base.... My upgrades: caramelized the onions... added chopped cooked bacon... seasoned potatoes with salt, garlic granules, black pepper... last 20 mins uncovered and topped with a breadcrumb, garlic, and parmesan mixture... finished baking until topping was browned... turned out delish! P.S. \"sliced thin\" means thin... based on any au gratin I've ever had, I would never go thicker than 1/8 of an inch! If you don't have a fancy gadget, the best option outside of using a nice sharp knife is the \"slicing\" side of a cheese grater... works great! For a richer roux, I slightly brown it before adding liquid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin Ives (talentd1)"
},
"reviewBody": "I liked this basic recipe. Some comments that it was flavorless depends on your tastes IMO. So, I added a dusting of garlic powder, onion powder, Hungarian paprika, and a small amount of chili powder to the potatoes before adding the sauce. Sprinkling this preparation on each level of the build. Then, after cooking let it rest overnight before reheating and serving the next day. My one critic of this recipe is the covering of the potatoes does not allow browning, even in a 400 degree oven for 1.5 hours. So when I reheated, I left the foil off. Absolutely creamy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tuxthelux"
},
"reviewBody": "Perfect, just what I was hoping for! I did add about a TBSP minced garlic, used Panela and sharp cheddar and lots of pepper. Very good. Allrecipes is #1 in my book."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crustina"
},
"reviewBody": "This was very good. My whole family enjoyed it which is a huge deal in my household. After reading comments I did something I usually don't do and made changes to the original recipe on my 1st try. Sorry! I know I don't like it when others rate a recipe based on a bunch of changes but it was a good base! I used sharp cheddar (reserving some to add on top at end of cooking), added 1/2 tsp of ground dry mustard, 1/2 tsp of garlic powder and pepper to taste to the salt that was whisked into the flour/butter mixture. Used heavy cream instead of milk (bc I needed to use it up). I used my food processor to slice the potatoes thin and fast! Chopped the onions and caramelized. Chopped bacon and cooked it and sprinkled it on top at end for garnish with dried chives. Removed from oven at 1 hr and 15 min. Added reserved cheese and broiled a tad. The edges browned quite a bit. Maybe bc of the cream but it was a good cheesy browned. Will make like this again but use milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessie Parsons"
},
"reviewBody": "Not sure how this got such a good rating. They are flavorless and just not good at all. I would rather eat them from a box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "resy"
},
"reviewBody": "Delightful Didn't change a thing. Well, more cheese obvs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Took the \"bland\" comments to heart and zhuzhed up the sauce. Nice. But really - \"Butter a 1-quart casserole\"??? I'm pretty sure you meant 2-quart - that's what I used and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good basic recipe. My tweak? Sautéed diced diced bacon and jalapeños and layered with the onions Added just the right amount of kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HisRed"
},
"reviewBody": "It worked on a technique level but is super bland made as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bixby9797"
},
"reviewBody": "Excellent and easy. I used aged Vermont Cabot Hunters Sharp Cheddar. Put a 1tbs garlic powder and 1 tsp Old Bay Spice into the sauce and topped with a sprinkle of fresh rosemary from the garden. Only cooking difference is I removed the foil with 20min to go and watched for it to brown. Just watch how thick those potatoes are sliced. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this, would be better topped with mozzarella cheese 10-15 minutes before pulling out of the oven, just enough to get bubbly and brown. Garnished with chives!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This came out really good! I cut the recipe in half, but otherwise made it pretty much as written. I didn’t use Russets, and substituted a medium shallot for the onion. I used a combination of Jarlsberg and some local “Asiago” (which is nothing like actual Asiago, but still a nice cheese). I sliced the potatoes and shallot pretty thin with a mandoline. After an hour at 400 the potatoes were done, and I cooked it another 10 minutes with the lid off. I probably shouldn’t have, it did come out a little bit dry. But still rich and cheesy. I’d thought about adding some nutmeg or mustard, but I’m actually glad I didn’t. Though it’s kind of simple, the flavors of the potatoes, cheese and milk is really good. I think I’ll cook it at 350-375 next time, it got kind of crusty on the bottom and sides."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband ranted and raved about these potatoes. I grate my onion and you don’t get strings of onion. I’m making them again tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made gratins before, and I have to say this was a disappointment. Milk instead of cream is a poor choice, cheddar cheese instead of such a finer cheese like Gruyer. This turned out technically correct, but was a big disappointment. Look for a receipe that doesn't need to base it on a rue and that is more rich in butter, cream, and a better cheese. 25 years of culinary experience, and I'm really disappointed in myself foe trying this receipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this dish! My guests raved about it and wanted the recipe! I made it as written and wouldn’t change a thing, other than removing foil for last half hour to brown the top a bit. Thanx Cathy! I’ll be keeping this one in our rotation for a long time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Welch-Little"
},
"reviewBody": "Made it as the recipe is written and loved it! Maybe next time I'll use sharper cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian J Winberg"
},
"reviewBody": "I have made this many times, I slice my onions as called for, I slice my potatoes thin on a mandolin along with the onions, I make my own cheese sauce and I do uncover for the last 1/2 hour or so.. sometimes I add bread crumbs for a topping.... delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DASH"
},
"reviewBody": "Very good and easy to make! My guests loved it!,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Venado"
},
"reviewBody": "Loved it Cathy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I prepared this recipe last night and followed it to the \"T\". Potatoes sliced extremely thin and all other directions in place as well. Baked at 400 for 2 hours...potatoes not done for 2 3/4 hours. Cheese sauce over cooked and almost totally burned. If I do it again I will parboil my potatoes (as suggested by my husband beforehand). Had guests over for fresh salmon I caught the day before and the only thing my husband requested be done well turned out to be a bust. I'll listen to that inner voice that says \"boil the potatoes\" next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't use the flour , it still came out perfect👍"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We loved this recipe. I added some Gruene too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curtis Lambert Jr"
},
"reviewBody": "I followed this exactly as it stated, but sliced the potatoes thinner at 1/8\" with a mandolin ! Sliced the onion rings to 1/4\". I uncovered it with 10 minutes left to brown the top, actually took about 15 minutes to get it the way I wanted. I used medium cheddar cheese. I love the big pieces of onions ! Serving this tonight with a roasted chicken and steamed broccoli !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was so easy to follow and looks like the pictures!! I have made this over the years not following a specific recipe. I am happy I decided to Google a recipe, which makes a difference. I am using vanilla soy milk the only milk I had. I am anticipating a sweet kick😁"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sautéd the onions and (added) garlic in butter, boiled the potatoes for 10 minutes before slicing, added fresh thyme and cooked uncovered for the last 30 minutes. Turned out very good. Everyone had seconds and thirds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stillsmiling"
},
"reviewBody": "The first time I made this I used the cheese indicated in the recipe and found it quite bland. The second time I used smoked Gouda and shredded parmesan instead. I also sprinkled Lawry's total seasoning and crushed pepper on both layers of potatoes. In my dad's words it was \"really scrumptious\". I also used half'n'half instead of the milk. This is my current favorite side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Did not have cheddar so used mozzarella.more of a subtle flavour. Also added a sprinkle of nutmeg. Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was fantastic. I added ham, garlic, and smoked paprika to mine. An hour and a half was the perfect cooking time and I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Pretty good overall, but if I make it again I’ll definitely make some changes. It’s lacking flavor in my opinion, and I think the onion would be much better if it were diced. I didn’t like the large pieces of onion at all. I also think it needs garlic, maybe minced in between the potato slices or added to the sauce. The sauce was okay, but it needs way more butter in my opinion. I sliced the potatoes as thin as I could (maybe 1/8 in.) and they turned out perfectly cooked. Overall I did like them, but I think they could be better. I definitely want to try these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Anything I melt cheddar cheese in I add 1/2 teaspoon ground dry mustard, it gives it nice depth. I also added 2 Tablespoons of dry chives. And I chopped the onions. Very good recipe! 4.5 stars definitely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "just added chopped green onions and basil on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James St Gelais"
},
"reviewBody": "Easy and good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lou Rou"
},
"reviewBody": "The first time I made this I followed the recipe exactly. My family liked it but we all agreed we didn't care for the onion being in rings. The next time: the onions were smaller, I didn't obsess about perfect layering of potato slices, used a little half and half in place of some of the milk, and added just a touch of nutmeg. For our family, the changes made all the difference. But you will love the recipe 'as is'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve been making this for years. It’s a go to, surprise, few people make it but love it recipe. So easy and delicious, I do uncover to brown a bit and depending on slice thickness I make cook a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Murray"
},
"reviewBody": "Easy way to make augratin potatoes with creamy cheese sauce then bake it. Next time I'll add garlic or bacon 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are the BEST Au Gratin potatoes ever! Super easy too! I didn’t change anything about the recipe. They are perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Essence40"
},
"reviewBody": "Made this as instructed, and with suggestions from others. I seasoned the potatoes, and added more cheese in the middle. I also chopped an onion and sprinkled cheese on the top. I also broiled it for about 5 min to brown the top. For my first time making this dish it came out pretty good. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It turned out amazing! I added a 4 cheese blend as well as garlic powder and it was fantastic. Great recipe and pretty easy to modify"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat DeLorenzo"
},
"reviewBody": "What a wonderful recipe! Easy to make and delicious. I followed the recipe with only a few minor changes -= chopped the onions as suggested and added garlic powder to the cheese sauce. I used extra sharp cheddar and it was perfect! I will be making this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pueblorod"
},
"reviewBody": "Real easy to make, turned out great!!! I added a about one pound of sausage to make it a meal. Everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany Burch"
},
"reviewBody": "Loved it 🥰 Followed instructions used my stone casserole dish no burn. Baked 400 for 1 hr turned off stove and let finish bake for existing 30 mins. Tip sprinkle cheese on top 5-10mins before removing from stove. I sprinkled too early and top fried as you can see. Try it and enjoy 😉"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim P"
},
"reviewBody": "Definitely a crowd favorite and was a hit for Easter dinner. Thx!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy to make and yummy. I sliced the potatoes thinner and seasoned between each layer. I added a layer of breadcrumbs in the top for a crunchy layer. Took an hour to cook and did not bubble over. Will make this again 👍"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’m sure this was a good recipe but something went wrong when I made it. Followed instructions to a T (only omitted onions). The cheese sauce didn’t melt down into the layers of potatoes, it stayed on top of potatoes. Potatoes cooked through but turned grey?! I was embarrassed but my family said they still tasted good. Any thoughts on what went wrong? Thanks 😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious!! I’m gluten free, so I used cornstarch instead of flour. And I used two cups of shredded cheese. 🙂"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katlar"
},
"reviewBody": "Made this one day ahead of Easter, with the only alteration the onions, which I chopped instead of sliced. Shredded a block of sharp Vermont cheddar. No alterations to recipe, and baked as instructed. However, refrigerated it when cooled and did not serve it til a day later, when I reheated it for close to an hour (covered with foil) but at 350° since it was already baked. Potatoes cooked perfectly, sauce creamy and cheesy, mild flavor but great with Easter ham. Will make it again, perhaps w/ added bacon if it’s served with beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow......what a delicious dish. On my sauce I added potato bake sour cream and chives sauce and roast potato spice masterblends. Finished all at once. Round 2 is around the corner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GAHAGAN"
},
"reviewBody": "Even my husband, who claims that he doesn't like au gratin potatoes, likes this. I've made it several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marlene Harkcom"
},
"reviewBody": "I was kind of surprised that this recipe had you sliced he's a quarter of an inch thick. I cut it that thing because I wanted to try it the way the recipe said but in tasting it they just seem to be a little thick for what I expect an au gratin potato to be. However the flavor is very good. The recipe is easy to follow and that's great for any kind of a recipe. I think that in the future I would slice the potatoes thinner. It's definitely a good one to customize. I added in some powdered mustard and a little bit of fresh ground nutmeg just because I like those flavors in cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it !!!! v 4/16/22 I added dip which is the sour cream white kind that has onions in it, I also added chedder cheese, Lots of it on top of the onions - Just put it in the oven, so, haven't tested it yet - It's for Easter dinner tomorrow with my Ham !!!!! :) It looks super rich, I can't Wait to taste it tomorrow !!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I made this dish 4 years ago and every time we have a family gathering this is requested! I use a mandoline slicer for the potatoes. It's much easier. I don't use as many onions as the recipe calls for. Also slice the onions very thin. They'll melt into the sauce and potatoes. One more thing, if your review states the recipe is bland it's the cheese you're using. Try sharp or extra sharp cheddar. If you use a mild cheese, your dish will be bland. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried making it today following the recipe exactly as it is and the taste was pretty bland. I suppose next time i need to improvise by adding in garlic powder and slightly more salt than what the recipe calls for, also i believe the sliced onion needs to be cooked in butter till its caramelized a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tarheel98543"
},
"reviewBody": "So delicious and easy to make! It has become part of my family's Christmas Eve dinner tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Most of the reviews were great. Didn’t anyone find the potatoes bitter? I used russet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaygee516"
},
"reviewBody": "I made no changes except for making extra cheese sauce. It almost looked like it was swimming in the sauce before I put it in the oven. But the potatoes absorbed the cheesy goodness and the leftovers were perfect too. The onion layer added such a delicious layer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancy rankin"
},
"reviewBody": "I have a small collection of favorite Gratin and Scalloped Potato recipes. Chef John's recipe will be added with the following changes: substitue 1 cup of cream, Monterey Jack cheese, plus extra and some chopped onions instead of rings, sprinkle garlic powder, cubed ham and uncover the last 30 minutes. Be sure to add a drip pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SanteeOlive"
},
"reviewBody": "Very bland. Not worth the effort of making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TamTam"
},
"reviewBody": "Amazing. I used a wonderful Irish cheese and Swiss and sharp cheddar, and I’ll tell you you, this was delicious. I’m not a fan of potatoes, but even I loved it! The sauce would be outstanding as a base for mac and cheese. It’s all in the cheese selection folks. Think out of the box, take chances!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha"
},
"reviewBody": "Followed directions with one exception. I added 3 slices of chopped bacon! Everything is better with bacon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edward Swartz"
},
"reviewBody": "We made it to recipe,but added bone in pork chops right in the casserole. Talk about \"YUM\" !!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bibi Tu Sabes"
},
"reviewBody": "My 14 year old daughter made this last night and it was delicious. We did add garlic :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Tanet Johncock"
},
"reviewBody": "I substituted Smoked Gouda with Bacon for the cheddar cheese. Delicious, not as “cheesy” but smooth and creamy. I also diced the onions and added a little minced garlic to the butter, flour and cheese sauce. Tonight we are putting it on the Recteq smoker for extra smokiness! Will be awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "collinscindy83"
},
"reviewBody": "It was perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marisaknoesel"
},
"reviewBody": "I made this delicious creamy potato dish FIVE times since I first came upon it three weeks ago. I reduced the liquid mixture which avoided overflow while baking. I used 1 C milk and 1/3 C chicken broth; total 1 1/3C. I, also, lightly topped the casserole with a mixture of bread crumbs, panko, and grated cheese. You could use any one of these ingredients or all three! I found a 350° oven was perfect and baked it for 50 minutes with foil and 10 minutes with no foil to form a crust ontop. Do check your potatoes for doneness with a knife; you may need to leave it in a little longer depending on your oven. Let it sit a while before you dive in because it is piping hot and so delicious you don't want to burn your mouth like I did the first time! Winner winner! Really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mccdillon"
},
"reviewBody": "Made this for the second time this evening. My girlfriend and I both really dig this recipe. Might play around with different chesses next time just to see how it turns out, but this recipe is great as it is no question, we highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shari_barcenas"
},
"reviewBody": "Delicious 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "23455"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "deidre_d_2000"
},
"reviewBody": "I made the sauce exactly as the recipe said. It turned lumpy in the oven. I will try a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "devanz364"
},
"reviewBody": "It was flavorful, creamy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artisantechnologies"
},
"reviewBody": "I doubled the recipe for a large group it was a great hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kycarson1933"
},
"reviewBody": "Easy to make and tastes delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "richlamey"
},
"reviewBody": "Made this as a side dish for a holiday pot luck (5x ingredients). The only deviation from this recipe is to add pepper right before placing it into the oven.\n\nWas a hit, the dish was scraped clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sophia"
},
"reviewBody": "*COOKING SHORTCUT*\nInstead of baking for 1 1/2 hours, bake for 45 minutes (still at 400 F), then broil on high for 15-20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue Neyland"
},
"reviewBody": "We made this recipe as part of our Christmas dinner. I didn’t care for it for several reasons. I can see where it might be a good recipe if I modified it but I didn’t since it was my first time making it. I found there to be too much onion and too much cheese sauce. I was overwhelmed by the rich thick creamy sauce. I will lighten it up if I make it again. I would use a sharper cheese but less of it since it will have more flavor. I would also cut the onion in half and slice it very thin. I think putting it in a more shallow baking pan will help too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "earol"
},
"reviewBody": "Made it Christmas morning. Turned out great and it was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "davidctomlinson"
},
"reviewBody": "I've made this a few times, people have 2nd helpings. I clean the potatoes carefully, peal and them slice on a mandoline. 5 medium large potatoes does the trick. I also slice the onions on the mandoline, just as thick. And I love onions, I use 1 or 1 1/2 medium white/yellow onions. Salt and pepper on both layers of potato.\n\nUse a 2 inch or deeper glass/ceramic baking dish. Too shallow and it can burn/get crunchy.\n\nCheese sauce, I use /2 milk and 1/2 heavy cream to cut down on lactose. and at least 1-2 cups of cheese, according to taste. \n\nCook at 400 for 1 hour and test a potato and a shred of onion. Done when tender.\n\n200 grams of gouda make the best you've ever had, 300 grams is even better.\n\nI've also made it with Monterrey Jack, yellow cheddar, and white cheddar. Pick your cheese. It'll be delicious."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
"name": "Potato"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16371/side-dish/potatoes/potatoes-au-gratin/",
"name": "Potatoes Au Gratin Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/",
"name": "Creamy au Gratin Potatoes"
}
}
]
}
}
, "about": [
]
}
]