				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Creamy Caramel Flan"
,"datePublished": "2000-09-19T15:50:41.000-04:00"
,"dateModified": "2023-01-31T11:32:20.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jo Poynor"
,"url": "https://www.allrecipes.com/cook/24324399"
}
]
,"description": "This flan recipe uses condensed and evaporated milk with cream cheese for a rich and delicious baked egg custard with a wonderfully thick texture."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EfYQLbkL9OUp1Wta67GFGuRbnYM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8898771-bb3a3e29d9164683ae4680f2a1f486e5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Creamy Caramel Flan"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "692"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "350 kcal"
,"carbohydrateContent": "41 g"
,"cholesterolContent": "142 mg"
,"proteinContent": "11 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "191 mg"
,"sugarContent": "40 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.75 cup white sugar",
"1 (8 ounce) package cream cheese, softened",
"5 large eggs",
"1 (14 ounce) can sweetened condensed milk",
"1 (12 fluid ounce) can evaporated milk",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cook sugar in a small, heavy saucepan over medium-low heat, stirring occasionally, until golden. Pour caramel into a 10-inch round baking dish, tilting to coat the bottom and sides. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat cream cheese in a large bowl until smooth. Beat in eggs, one at a time, until well incorporated. Mix in milks and vanilla until smooth. Pour into the caramel-coated baking dish."
} ,{
"@type": "HowToStep"
,"text": "Line a roasting pan with a damp kitchen towel. Place the baking dish inside the roasting pan on the towel, then place the roasting pan on the oven rack. Fill the roasting pan with boiling water to reach halfway up the sides of the baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the center is just set, 50 to 60 minutes. Cool on a wire rack for 1 hour, then place in the refrigerator until completely cooled, 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "To unmold, run a knife around the edges of the baking dish and invert onto a rimmed serving platter."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT615M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margarita Melian de Ortigas"
},
"reviewBody": "I have made flan before and what I always do is to cover the container tightly with aluminium foil before placing in the oven. This recipe is good, have tried before without the cream cheese. Will no try it with cream cheese, I am sure it will be delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia Ruiz"
},
"reviewBody": "Love this recipe! Easy to follow and delicious. My family loved it and how creamy it was. I added cinnamon to the mix. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "5 star recipe, I would suggest to add a 1/4 teaspoon more vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I ruined two baking pans making this flan. 1st try, I poured the carmel into a warmed glass pyrex pie dish. As I was blending the other ingredients, I started to hear the glass pan slowly cracking apart! It continued to crack to pieces as the carmel cooled. 2nd try, I poured the carmel into a round metal cake pan. Seemed fine at first. Poured the flan mixture over the carmel and hear some cracking noises. Chalked it up to expanding/contacting metal. Later, after cooking and cooling, I flipped the flan out of the pan to find that it had also intricately cracked the bottom of the pan. Did anyone else have this experience? What am I doing wrong?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mynameischef"
},
"reviewBody": "Quick and easy. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "santiagosrus"
},
"reviewBody": "This recipe was delicious! If you have never made flan before, do yourself a favor and Google how to make the caramel. I tried twice using this recipe's instructions. It was a bust both times. I turned to Google and decided to use a microwave method for the caramel. It used water and sugar in a pyrex bowl. It had to cook a long time in the microwave, over 12 minutes in my microwave. The sugar had just started to change color so I set the timer for 2 more minutes and it burned. I learned that as soon as the caramel starts to change color, microwave it from 15 to 30 seconds at a time until it is a nice caramel color. I nailed it on my 4th try! I will definitely make this again. It was a huge hit! I absolutely love it! I'm certain I won't have any trouble making the caramel now I have it down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barr Marla"
},
"reviewBody": "The only change is that I cook them in 6 ramekins. The easiest flan ever to make. My husband can’t get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AliAtl"
},
"reviewBody": "This turned out amazing! I was intimidated by this but after reading the reviews I preheated my pie dish before pouring in the caramel. I also took the advice of letting the cream cheese and eggs come to room temp and then put everything in the blender to get the mixture really mixed well. I let it sit all night and the next day in the fridge until dinner time. I took this to a wine group dinner party last night and it was a huge hit and probably as good as if not better than any restaurant flan. I served with homemade whipped cream (light on the sugar to combat the sweetness of the flan and with a little vanilla extract) and sliced strawberries. Thank you for sharing this recipe. I will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yommy2829"
},
"reviewBody": "This was creamy, delicious and super easy to make! I used a jar of caramel instead of making the topping myself and i mixed everything in the blender. Everyone loved it, thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuciaB"
},
"reviewBody": "I did everything as directed. Didn’t have cream cheese so I added an extra egg. It took 1hr 15 min to bake. So delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KerryB"
},
"reviewBody": "I made this recipe as written and it turned out great! I made sure to bring the eggs and cream cheese to room temperature as recommended in other comments and warmed my cake pan before adding the caramel. Melting the sugar is a slow process at med-low heat and stirring constantly, be patient it will get there. The reason I gave 4 stars instead of 5 is because it was a little too dense for my personal tastes. I will probably try a more traditional flan next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pallavi Ramu"
},
"reviewBody": "It was definitely not as picture perfect as seen but everyone who tried it can’t stop talking about how good it tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Dodson Mogg"
},
"reviewBody": "This was my first time making flan of any sort. I found the recipe to be simple. I mixed all my ingredients in the vitamix. Because I use fresh eggs from my chickens and they're on the small size, I used 7 whole eggs. I did use bakers sugar for the caramel and it was easy peasy. I placed my dishes in the oven while it was preheating and once the caramel was ready, poured it into the warmed dishes. Because I'm inpatient, I ate one of the small ones after it had only been in the fridge for about an hour. Of course it had cooled for an hour on the rack prior to that. It was so decadent and the texture and flavors were divine. I can only imagine how wonderful it will taste after being in the fridge for an entire day. YUM! The only thing I did differently was to add the scrapings of a vanilla bean as well as the vanilla. I will definitely make this again as it's not too sweet and is very creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Anne"
},
"reviewBody": "I used 3 whole eggs and 3 yolks, which made the custard very creamy, and I added 2 tbsp water to the sugar for the caramel sauce. I found if you don’t add water to the sugar, most of the caramel sticks to the pan when it hardens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHines"
},
"reviewBody": "So easy and good! I would suggest using a blender to mix the custard. And the caramel worked fine but"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sallie Olan"
},
"reviewBody": "I made this recipe in the blender. I ended up with 2 flans. I used 8 inches, 1 3/4 in deep, circular pans for the flans. I made the caramel twice, but 3/4 cup of sugar covered each pan but now I have to much residual caramel in them. I used 12 oz regular milk and 4 oz of half and half because didn’t had evaporated milk. They shrinked after refrigerated. But, tasted really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Campione Mikol"
},
"reviewBody": "This was simple &amp; delicious! I read the reviews and followed the advice to heat the dish in the oven before pouring the sugar in. I didn’t use the towel in the pan but did put it in a pan of boiled water in the oven. I used an 8” round and cooked a full hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Garcia"
},
"reviewBody": "No cause its my first time making it ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hobbyfarmgirl"
},
"reviewBody": "Changed nothing and came out super delicious. It was a hit for New Year's eve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trina Mcclure"
},
"reviewBody": "A standard cream cheese flan recipe that is easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdrienneSz"
},
"reviewBody": "Recipe was excellent. Because I was nervous about burning the sugar, I didn't let it get dark enough. That affected the depth of flavor, so when I make it again I will be more confident."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Portalatin"
},
"reviewBody": "First of all I will start by saying that I have never ever ever rated or reviewed a recipe. After doing this recipe a few times, I finally got this recipe right, I had to write a review. I followed the recipe ingredients to the T..don’t change a thing..BUT I feel the cooking time is a bit off. This recipe call for 50 to 60 minutes. I suggest you bake it for 1 hour and 20 minutes. Believe me you will not regret it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JackieC"
},
"reviewBody": "Made this exactly to recipe. I had never made Flan before. Loved it! Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Contreras Alexander"
},
"reviewBody": "This recipe is amazing and simple! For the sugar, I took others advice and put my glass pan in the oven first. This make it easy to coat the bottom of the pan. Also I let my eggs and cream cheese get warm, helps with lumps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Diaz"
},
"reviewBody": "If done correctly it's perfect. Like cheesecake flan. I love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Graber-McConnell"
},
"reviewBody": "My family's favorite. The cream cheese adds so much to the taste and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Lesly "
},
"reviewBody": "I had started to write a review but it was submitted prematurely. This flan is the splitting image of the best one I have ever tasted. That was about 7 years ago and the recipe was never to be found again. I did remember the majority of the recipe, just not how many eggs. This recipe was exactly the same and gave me a measurement for eggs. It turned out exactly like how the other flan tasted! I was soooo happy! I couldn’t wait overnight to eat it so I placed it in the freezer before unmolding and just remember the sugar and added some water to the caramel to give me more sauce. The caramel sauce is my favorite part. I usually dislike the eggy flans since most people curdle them and they are barely smooth. Flan de queso is my favorite. (I am Cuban). This is an authentic recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Ramirez"
},
"reviewBody": "Goodness, gracious ... this was so good. I used 7 eggs instead of 5 because, I thought it called for 7. It was so easy to make. \n\nYou will eat the whole flan in one sitting. If you’re planning on losing weight, stay away from this recipe. You’ve been warned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkg"
},
"reviewBody": "I've made the recipe 3 times now . On the 2nd and 3rd try I decided to lighten it up a little and used only 4 eggs and 4 oz. of cream cheese. My guests loved it. The texture was still beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sdcosmo61"
},
"reviewBody": "Worst recipe ever! EPIC FAIL..My advice would be to find another recipe.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maria holm"
},
"reviewBody": "Absolutely delicious. I followed ever detail of the recipe and it turned out great. You really need to follow the after baking instructions and allow an overnight cooling. Very rich. Very good. This is the flan I crave"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kiki"
},
"reviewBody": "I did not make changes; I will not make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Proctor"
},
"reviewBody": "I’ve never made or even tried flan until I made this for my sister-in-law a few days ago. She said the taste was great but perhaps it was cooked a little too long. Next time I make this, I will take it out of the oven at approximately 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debi Spillman Tisdale"
},
"reviewBody": "perfect as is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "I cooked it for an extra 22 minutes because the water bath was not at boiling temp when I put it in the oven. Haven't eaten any yet. As I can't post with out giving it a rating I will rate it 3 stars now and adjust after I and my guests enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evee "
},
"reviewBody": "I made the mistake of just mixing everything together at the same time the cream cheese was a little clumpy. Also make sure you let the Carmel harden before pouring the mix into the baking pan. But it came out delicious! Will be making again soon. Reminded me of home in Miami."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TTDiDi"
},
"reviewBody": "Very well received dessert. I put everything in the blender and stained after to ensure no lumps. Very creamy texture and the inclusion of cream cheese cuts down on the usual sweetness of this dessert. With regard to the caramel, I made the custard first and let that sit while I did the caramel so there was not a chance for it to get hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crisppey"
},
"reviewBody": "Yummmm, so good! Love this and so did my guests!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maly Cruz"
},
"reviewBody": "Fantastic, I absolutely loved this recipe, so much so that I am about to make it again for the second time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crusader59"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Colton"
},
"reviewBody": "Flan de queso mm my favorite type of flan! I admit that I used a jarred caramel sauce because I made this recipe to use it up, but I know the original would have been better! I used very high quality eggs and vanilla bean paste. My cream cheese wasn't quite soft enough so I poured it through a sieve before putting in the dish. Wonderful flan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Really didn't care for the texture. This is definitely NOT a flan. I'll be sticking to my traditional flan recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BakingAddikt"
},
"reviewBody": "Good in flavor, but very much like a cheesecake. Very dense and a small piece goes a very long way. Flan from what I've been making is definitely not similar to cheesecake. But I suppose this recipe would suit those who dont like the taste of egg in a dessert. My family thought of this as more of a caramel flavored cheesecake, and I only added half (4oz) of the cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iliana Figueredo"
},
"reviewBody": "Very creamy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dfc"
},
"reviewBody": "ANOTHER All Recipes triumphant to add to my \" EXCELLENT. RE-DO, EASY\" of my on-line cook book! Thank you All Reciepies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody O"
},
"reviewBody": "This was my first attempt at making flan. I followed the recipe exactly as written and my flan came out perfect. I was nervous this morning when it came time to flip the flan onto another plate as I keep thinking that the flan was going to split or crumble into several pieces. I decided to let the mold sit in a pan of warm water for a few minuets just before flipping (like you’d do with a jello mold) It worked out wonderfully. The flan released and remained intact with all that delicious caramel sauce oozing on top. I made this as my Christmas dinner and boy was it delicious. This flan was creamy, smooth and rice. It will now be something that I will make on a regular basis."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "The flan part was delicious! Tasted just like flan I had in Ecuador. However, the sugar stayed hard so there was hardly any liquid sugar on the flan. Will try it again but change that part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anela Bautista"
},
"reviewBody": "It’s tastes amazing and everyone loved it. The only problem was that it was cooked unevenly, which really bugged me. The middle cooked slower and by the time it no longer resembled pudding, the edges were very thick and eggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Domingo"
},
"reviewBody": "Perfect. My family gobbled this delicious flan in one sitting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FunkyCowgirl"
},
"reviewBody": "VERY good recipe! Still, it needs a few tweaks to be perfect, for my tastes. Next time, I will add 2 or 3 more eggs, to lighten the density and I will double the caramel sauce. \n\nA few tips, for less experienced cooks:\n\nMix it in the blender! Start with the eggs, blend until light and foamy. Add softened cream cheese and blend until mixed, then add the rest. \n\nIf you're not experienced at candy making, try caramelizing the sugar with the wet method. \n\nDon't worry if caramel hardens, as long as you have spread it in baking dish. It re-melts, in oven. Don't overcook it, easy to do. \n\nBefore unmolding, put baking dish in pan of hot water for a few minutes, to help soften caramel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anifreak61"
},
"reviewBody": "My entire family loved this recipe. My only suggestion would be to mix the ingredients in a blender. The first time I made it I used a mixer and it came out lumpy. The second time however, I used the blender and what a difference that made.end result was creamy and smooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I made it exactly as written and it came out perfect and delicious. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianna"
},
"reviewBody": "Made this many times, really delicious and creamy (not eggy) every time! Highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Glynn Stocker"
},
"reviewBody": "I never written a review on a recipe before....this one deserved it! Fabulous. Made exactly as written. My book club raved about how good it was and all wanted the recipe. Sinfully yummy. Make it! Hint: warm baking dish oven before pouring the melted sugar and coating. Gives you a little more time to get the liquid distributed before it hardens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XimyP"
},
"reviewBody": "This is a delicious flan. I would recommend to start by boiling the water first to have it ready and make sure you have a baking dish that is taller that the dish where you will put the hot water, so that if the water boils in the oven, it doesn't get into your flan. When you make the caramel, the trick is not to let it burn and also work QUICKLY turning the dish, so that it sticks to the edges without solidifying. Also be careful not to burn yourself with the hot water when you take it our of the oven. I made the recipe exactly as it was described and it was just wonderful! It tastes like a flan with a cheesecake texture. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Made it 3 times and perfect ever time. No substituting, delicious according to my husband who loves this creamy delight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Jacques"
},
"reviewBody": "For your benefit please take ten and read my learning curve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Tirado Page"
},
"reviewBody": "I made my caramel in the pan that I was going to bake the flan in - one less dirty dish and the caramel sticks to the pan better. Give the caramel a chance to cool off or when you pour the mixture in the pan it will make the flan have cracks in the flan. Came out super creamy and now I have to make another one as the one I made has seemed to have disappeared. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sand Puppy"
},
"reviewBody": "I have made this many times for my fiance, since flan has been his favorite dessert ever since he had it in Mexico over a decade ago. \n\nI initially chose this recipe because I had never even eaten flan before (let alone made one), but I knew how to make a cheesecake so I figured I would be less likely to screw it up. I'm glad I picked it, though, since he absolutely ADORES this recipe! All of our friends go crazy for it, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noemi"
},
"reviewBody": "easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stircrazy"
},
"reviewBody": "Made this a few times now for pot lucks and special occasions. It seems to be a hit with everyone. I've even had a few requests!. The only change I have made is by adding orange, lemon, or lime zest. All three flavors are delicious it's just personal preferences, vanilla is ok too.....but it's vanilla:)\nA tip to avoid the melted sugar hardening quickly in the pan. Put the pan in the water bath in the oven while the oven is pre heating. Take the pan out of the oven once your melted sugar is ready and pour the melted sugar into the hot pan and set aside until you have the egg/cream/milk mixture ready."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzyq"
},
"reviewBody": "Loved it and so did all who had some. Even those who don't really care for flan because it's too custardy. Creamy and delicious! And don't be afraid of the caramel....it just takes being patient!\nAnd make sure the cream cheese is at room temperature. Otherwise you’ll have lumps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NINA24"
},
"reviewBody": "So delicious! A lot of people complimented me on it. I followed the recipe as is, except that I used 4 eggs, and I can't say 5 would have changed anything. All my ingredients were room temperature. I used a 10 inch springform pan that I sealed with foil to prevent all the liquid from seaping through during baking. It was a little thin though, so next time, I might use a smaller springform pan. I also put all the ingredients in my blender.. easy easy and fabulous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "This tastes really great - the whole family loved it! I made it exactly as written. Some other reviews had trouble with the caramel but I made mine - just sugar - in about 7 minutes. I did warm the pan in the oven while it was heating and everything turned out a dream. One note about the pans - you really need a proper deep cake pan (NOT springform as water will get in) - I used an 8\" pan with 3\" sides and it was perfect. I did have a 10\" pan but found it wouldn't fit into any of my baking pans for the \"bath\" - I also would find it challenging to find a 10\" rimmed platter (and it does need a rim as the caramel is runny) - so the 8\" was great to fit into a baking pan and onto a plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Matthews"
},
"reviewBody": "I use brown sugar and water heated for a couple of minutes on the stove for the caramel..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Mini Baker"
},
"reviewBody": "I made this flan a few times and everyone in my family loves it. It looks pretty and tastes like a creamy cheesecake. So easy to make too! It's wonderful for entertaining as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "facsnmex"
},
"reviewBody": "Great and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jorge Amaury Lembert"
},
"reviewBody": "Excellent recipe, just did a little less sugar for the caramel and half the cream cheese, AWESOME!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vand1016"
},
"reviewBody": "this is my same recipe. We cook it in baño maria. put the flan in an aluminum bowl, cover it with aluminum foil and place the bowl inside of a pot with boiling water about half way up the bowl. Also, if you put the ingredients in a blender, it makes the filling extra creamy. VERY good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pikle"
},
"reviewBody": "This was my first time making a flan and this recipe was extremely easy to follow &amp; the results were amazing. This is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dldennis01"
},
"reviewBody": "Yummy! The flan I've made in the past didn't involve cream cheese, but I love the addition of it to make it creamier. There was some of the caramel left/stuck to the bunt pan, but the flan was covered enough when I turned it out. If you like a lot of sauce, I'd melt more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goldie Hollaway"
},
"reviewBody": "It was a total hit! My family, friends and I loved it. It's great that it only takes 5 eggs. I've seen recipes that requires almost up to 12 eggs! I will definitely do this again! It's so easy and very creamy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mattyramirez09"
},
"reviewBody": "It's wickedly delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love recipes"
},
"reviewBody": "So good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "My husband has been making this flan for years for him and his family. They just love it so this is his 5 star rating. The caramel takes soooo long to make. I dread helping make it because of that. I made a suggestion to my husband that next time we try another caramel recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fati"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "f1shst1x"
},
"reviewBody": "This turned out perfect. After beating everything together, I noticed some really small lumps of cream cheese, so I poured the mixture through a wire mesh strainer into the pan. No lumps to mess up the texture! Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cynthia mills"
},
"reviewBody": "I made this for my Aunt and Uncle they loved it!! I love the texture. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Rodriguez"
},
"reviewBody": "Love the texture &amp; creaminess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yese"
},
"reviewBody": "I followed the advice of other reviews and mixed the wet ingredients at room temp before starting on the sugar. I used a handheld mixer instead of a blender and it turned out great. I have never made caramel before so when my sugar started clumping and taking forever to melt I did freak out a little bit. After a couple of calls to my mother, I was assured it was normal and the sugar melts soon after it starts clumping, which in this case it did. Don't be scared to use med-med high heat otherwise you'll be stirring the sugar for 45 min just like me. While I was making the caramel, I put my glass dish in the pre-heated oven so that when I poured the sugar it would not immediately harden. I also put my dish in a (hot - I forgot and put cold water) water bath for even baking. I didn't know what the recipe meant by \"set\" as I have never made flan so I baked it until it was firm which made the consistency closer to a cheesecake than a traditional flan which wasn't a problem because after refrigerating it, it was delicious and creamy!! Also - I added vanilla to the wet ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Deb2011"
},
"reviewBody": "I made this today. Was very excited to think it would be a creamy flan. Unfortunately, still turned out with that slick eggy texture, even with the cream cheese, I used a glass 10\" pie plate and the recipe was way too much for that size pan. I am looking for a recipe my daughter-in-laws grandmother made almost 8 years ago. It was perfection. Smooth, creamy, and I can still remember the wonderful rich flavor and texture that just melted in my mouth. She had lived in Peru awhile as a missionary, and I believe the recipe might be from that area. Alas, she is unwilling to part with her recipe, so I continue my search, and many flop recipes, as this one was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie"
},
"reviewBody": "I made this recipe with the following changes: Instead of condensed milk, I used whipping cream and instead of vanilla I used a teaspoon fresh lemon juice. On the next day, I made a lemon meringue and pour it on the cheesecake instead of a crust.This was a surprise for my son,and he loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raealonzo"
},
"reviewBody": "Truly one of the best easy recipes for first time bakers. Super easy and taste delish! Have made this 7x and all a success. The helpful comments made by Nicole and Tracey on this site helped make this Creamy Flan a success! RAE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenndls"
},
"reviewBody": "I am a big flan lover but a novice when it comes to cooking. I made this for Thanksgiving and it was a hit. I took another reviewer's advice and made the caramel with 1/4 cup water and 1 cup sugar in the microwave. I put it on high in 2 minutes increments. I would stir it every 2 minutes. Mine caramelized in around 5 minutes. Also II mixed everything in the blender and strained it. it was Sooo perfect. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannie"
},
"reviewBody": "I just wanted to add something about the caramel, If you poor it into a cold glass pan and it hardens, there is no need to panic. All you need to do is continue with the rest of the ingredients for the flan poor it over the hard sugar/caramel then bake it in the water bath and the temp from the oven will melt the caramel and it will turn out just fine. I learned this on accident. I did the same thing as Nicole on a different flan except I didn't start over I just went with it. It was delicious. As far as the flan that the caramel stayed in the pan well that might be because it wasn't caramelized enough when you pored it. Or it just could have been a fluke. :) Happy baking everyone"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Calla47"
},
"reviewBody": "I just put it in the oven. What a mess. I guess 10\" baking dish does not mean a 10\" pie dish; what size eggs? The caramel is so hard I'm afraid someone will break their teeth. Hope it's good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "China0613"
},
"reviewBody": "Make this recipe all the time! It is awesome. Always get request to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patrice"
},
"reviewBody": "I tried this recipe for the first time, two weeks ago and it came out perfect! Everyone loved it, and I am making another one right now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tonika"
},
"reviewBody": "I made this recipe and had GREAT TROUBLE with the sugar/caramel part. I saw, as I just looked through, that you have a good article on making caramel, but I was unable to copy or put those instuctions into my recipe file or to print the various ways make the caramel. Would you either e-mail the instuctions or tell me how to copy your article. Tonika. arnold6297@cox.net"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Delicious. I prefer the less eggey consistency of this flan. I did not have any problems with the caramel. I also sprayed PAM on my pan, which might have helped. Either way, the caramel will breakdown in the fridge and become a sauce, so don't worry if you have problems. I used a 9\" cake pan. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheriw"
},
"reviewBody": "So delicious! Brought it to a work potluck, and my coworkers loved it. A few mentioned that they liked it better than the traditional (read: eggy) flan. I used the ingredients as listed; even though I had read the reviews about using a blender, I thought, \"Surely my trusty Kitchenaid mixer will make it smooth.\" Nope ... I ended up pouring it into my blender;. the cream cheese would not blend in otherwise. I realized when I was pouring the custard into my pan that it was too small, so I made one 8\" and two little custard cups. I will buy a 10\" round pan just to be able to make this again! A delicious and beautiful dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lausol"
},
"reviewBody": "To those who get concerned about the caramel going hard immediately after it's poured... don't worry about it. Leave it like that, pour the flan mixture and bake... the water and the heat takes care of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherry_vinigrette"
},
"reviewBody": "This is EXACTLY the thick flan recipe I was looking for! I had an amazing special flan dessert in a Tex-Mex restaurant called \"El Jarrito\" in Katy, TX. Their flan was thick, almost as thick as a cheesecake, but soft and creamy. This was over 5 years ago and I still remember how great it tasted and loved its texture. This recipe is just like what I had - I'm so glad you wrote that this flan was a cross between an egg custard and cheesecake because that's exactly what it is. Thank you, Jo, posting this recipe - it's perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKJ"
},
"reviewBody": "Wonderful recipe! First time making it and it was great! Yes, when I made the caramel and put into pan, I had to work quickly with a spatula to spread around as much as possible because it does harden up quickly! But it's OK...when it bakes, it'll become juicy. After I flipped it out of the pan, there was still some hardened caramel in the pan, but I just stuck the pan in boiling water to remove and it worked great. I actually used a 9\" pan instead of 10 (was all I had) and that worked just fine as well. It set up nice, flipped out nice and overall, looked wonderful. Everyone loved it! Will definitely make again! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bxcitykitty"
},
"reviewBody": "Delicious! The flan I normally make doesn't contain cream cheese but is very similar so I tweaked a bit. I used Neufchatel cheese instead of cream cheese and covered the baking dish with aluminum foil. I also used fat free evaporated milk and 1 cup of sugar for more syrup and it came out fantastic. The cheese actually helps balance out the sweetness and makes it extra rich and creamy. I'm definitely making this from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monicasull6"
},
"reviewBody": "So Yummy! It's consistency is more like cheesecake. Hardest part about the recipe is waiting the 8 hrs until you can eat it. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dorkzoe"
},
"reviewBody": "I used 3 eggs instead. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah"
},
"reviewBody": "Yum! This is my favorite flan recipe hands-down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAlva"
},
"reviewBody": "Made it for christmas this year and everyone loved it. Ended up making four for every home i went to."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22220/creamy-caramel-flan/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
"name": "Custards and Puddings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14445/desserts/custards-and-puddings/flan/",
"name": "Flan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22220/creamy-caramel-flan/",
"name": "Creamy Caramel Flan"
}
}
]
}
}
, "about": [
]
}
]