				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crispy Pork Carnitas"
,"datePublished": "2014-10-09T20:25:29.000-04:00"
,"dateModified": "2022-11-22T13:44:04.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "This carnitas recipe is Chef John&#39;s method for slow-roasting pork in lard, citrus, garlic, and fragrant spices until tender inside and crisp outside."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KcnwI3Ipd9SkV65nLatZs0SZZAs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1622724-crispy-pork-carnitas-Rock_lobster-1x1-1-bdc77df0eb65481aacbe2719923ed885.jpg",
"height": 900,
"width": 900
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3826399163001",
"description": "See how to make tender, tasty carnitas for tacos.",
"duration": "PT6M58S",
"name": "Crispy Pork Carnitas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2d7d4e4e-0ae7-45a2-bdfe-f823cb9c5f06/700e2913-9041-4d46-a35d-74cb64be50a0/1280x720/match/image.jpg",
"uploadDate": "2021-07-05T11:52:46.330-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crispy Pork Carnitas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "182"
}
,"cookTime": "PT220M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "317 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "89 mg"
,"fiberContent": "0 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "1036 mg"
,"sugarContent": "0 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 pounds boneless pork butt (shoulder)",
"8 cloves garlic, peeled",
"0.25 cup olive oil",
"1 orange, juiced, orange parts of peel removed and sliced into thin strips",
"1 tablespoon kosher salt",
"2 bay leaves, torn in half",
"1 teaspoon ground black pepper",
"1 teaspoon ground cumin",
"0.75 teaspoon ground cinnamon",
"0.5 teaspoon Chinese 5-spice powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 275 degrees F (135 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Remove fat from pork; cut meat into 2-inch cubes and roughly chop fat."
} ,{
"@type": "HowToStep"
,"text": "Mix together pork meat and fat with garlic, olive oil, orange peel, orange juice, salt, bay leaves, black pepper, cumin, cinnamon, and 5-spice powder in a large bowl until pork is coated completely. Transfer mixture to a 9x13-inch baking dish. Cover the dish tightly with heavy-duty aluminum foil, then place on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until pork is fork tender, about 3 1/2 hours."
} ,{
"@type": "HowToStep"
,"text": "Set an oven rack about 6 inches from the heat source and preheat the oven&#39;s broiler."
} ,{
"@type": "HowToStep"
,"text": "Remove garlic, orange peel, and bay leaves from the baking dish. Transfer pork to a colander set in a bowl. Pour accumulated juices from the baking dish over pork. Return pork to the baking dish and drizzle with some accumulated juices."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KcnwI3Ipd9SkV65nLatZs0SZZAs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1622724-crispy-pork-carnitas-Rock_lobster-1x1-1-bdc77df0eb65481aacbe2719923ed885.jpg"
}
]
,"text": "Cook under the preheated broiler for 3 minutes. Drizzle more accumulated juices over pork and continue broiling until crispy, 3 to 5 minutes. Transfer pork to a serving plate and drizzle with remaining accumulated juices."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT235M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this about 5 times and amazing every time. I generally go with the exact recipe and everyone loves it. Making it again tomorrow for a group. The flavors are amazing I think the cinnamon and 5 spice are the key. Make it like it’s on the recipe and you will be very happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TeeHarvey"
},
"reviewBody": "Usually, I love Chef John's recipes and no matter the recipe, I make it as written the first time. I did take the reviews into account this time and used 1/4 t cinnamon and 1/8 t Chinese five spice. It didn't work for us. It was okay and we ate it, but the cinnamon was simply overpowering. You have to really like cinnamon (which I thought I did) to love this. I'm going to save the technique because they were so tender and we loved the crispiness, but use more traditional seasoning next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeannie"
},
"reviewBody": "After years of trying various carnitas recipes, we've settled on this one as the best. We double the cumin and substitute Italian seasoning for the Chinese spice. I also substitute wine in place of the o.j. and omit the cinnamon which smothers the other flavors and seems not to belong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannine Gama Hubbard"
},
"reviewBody": "I followed this recipe exactly and it was VERY GOOD!!! I probably could have taken it out of the oven after three hours, as my oven runs hot but the meat was falling apart and delicious! Making it again tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Pirollo"
},
"reviewBody": "I pretty much followed the directions verbatim and it was just superb really really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BettyCrocker"
},
"reviewBody": "This recipe was delicious, although my family prefers it without the Chinese Five Spice and Cinnamon, substituting some chili powder instead. It’s definitely a recipe that you need to plan in advance for, but it is SO worth it! My house smelled absolutely amazing when I made it the first time and everyone was salivating by the time dinner time came around. I’ve also pressure cooked it in my Instant Pot when I’m in a hurry (actually doing that now, as it’s too late in the day to cook in the oven), and it’s been tender and delicious…but definitely not crispy unless I throw it in the oven afterward. I highly recommend you try this recipe, but if you don’t like the taste of cinnamon or clove, you might want to substitute it, as I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Yum! I followed all of the other comments and skipped the orange juice, cinnamon, and five spice. I added a little oregano, thyme, and smoked paprika. It was delicious, but I would cut back on the salt next time. Really, all it needs is salt and pepper. The roasted garlic is delicious, so don't toss it. The cooking method was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annabelletrevino06"
},
"reviewBody": "I made this for an assignment, it was cooking and reviewing a dish from the Spanish-speaking part of the world. And it turned out amazing! I did a few things differently to make it a little more authentic; I took the cinnamon and the Chinese 5 spice powder out completely and replaced it with some adobo seasoning, and I replaced the orange and orange peel slices with 1 squeezed lime. I also altered step six. All I did was drain the meat and removed the bay leaves and garlic cloves. Then I drizzled the meat like it calls for. Other than that, this was an incredible recipe! The whole family loved the pork. ¡Muchas gracias!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randall"
},
"reviewBody": "This was OUTSTANDING! My only deviation was we used a pork loin we had from a warehouse club, not a pork shoulder. It was flavorful, tender, succulent, moist - everything I wanted in a slow roasted meat. We make a lot of pulled pork, with a more paprika forward rub. This replaces it hands down. \n\nWe used aluminum steamer pans with lids to cook it in and it worked beautifully. Watch the broil part, we did have one get a touch extra crispy. But once shredded you could not tell the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrianErin Carr"
},
"reviewBody": "This is by far one of our family's favorite meals. I would never think to use cinnamon, but to me, that is what makes this dish! I couldn't find the 5-spice, and I do leave out the garlic (for dietary reasons), but it is still a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jimmy Parks"
},
"reviewBody": "very good even better the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Letícia Guimarães"
},
"reviewBody": "This was incredible!!!! I've made carnitas in the instant pot before, but these are sooo much better! So crispy, juicy and delicious! I'll definitely be making it more often --especially with the Costco size pork butt..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bunny R."
},
"reviewBody": "This recipe is absolutely delicious. All of the ingredients combined work so well together. The only thing I did different is that after I trimmed some of the fat, I cut into 4 large pieces and cooked it in the crockpot on low for about 8 hours. I then shredded the meat and placed in a shallow dish. I reserved some of the juice and drizzled on top. I broiled on high for about 5-10 minutes until pieces were crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kbeisly"
},
"reviewBody": "Loved this. I had to make a few changes as I’d initially planned on using a recipe that took 2 hours, then decided it was too bland. Once I found this recipe, it was too late to cook it for over 3 hours. So I cut the meat up in smaller chunks and cooked it at 375 for 1.5 hours then 350 for 30 minutes, then used the broiler per the recipe. I did not include all the fat for health reasons. I didn’t have Chinese 5 spice, nor the components to make it, and in consideration of the comments about cinnamon in several other reviews, after putting the dish together in the pan, I sprinkled cinnamon, fennel seed, and cloves on top very lightly. I will definitely make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jweaver"
},
"reviewBody": "Love this recipe! It is true to the authenticity of carnitas and I’ve made this several times. I do cut back on the cinnamon just a bit. I’ve cooked this per the re pie and I’ve cooked this in my insta pot and finish under the broiler. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bsnbarber"
},
"reviewBody": "I have made this many times, always scarfed up.Always follow the recipe but this time (today)took out some fat and added bacon grease from this morning.Comments were \"this better than ever\".TY Chef John ,the Bob Ross of cooking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jill greywolfe"
},
"reviewBody": "I was beginning to think these were a figment of my imagination!!! Years ago I had a couple bites of my dates cubed pork carnitas and I have been looking for them ever since - all I could find is shredded pork and I just can't with shreddid anything...Thank you Chef John for confirming I have not, indeed, lost my mind! Made 100% according to recipe - so crispy, so moisty. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina C"
},
"reviewBody": "Loved loved loved it!\nMaking again today for my son and his family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Emmie Lopez"
},
"reviewBody": "Since I'm technically rating a recipe, I can only give two stars. My husband is from Mexico so I'm always trying to recreate his favorites. He told me not to use cinnamon but I convinced him that we should try it so that we can adjust next time, if need be. He was right. So right. I'm not sure why it's added in this recipe. It was pretty disappointing. The other flavors were great, but the cinnamon is unnecessary and not authentic. If you're a big fan of cinnamon, maybe you'll love it. I love cinnamon in many things, but this isn't one of them. Skip the cinnamon, in our opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steeve Laplante"
},
"reviewBody": "I used to do carnitas in slow cooker but this recipe is way better and the broiling make each bite a real bliss"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beverly Berry Kerr"
},
"reviewBody": "Served this over rice with vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Hoverman O'Neal"
},
"reviewBody": "Amazing. Best pork carnitas ever. Only change I would make is less cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mechelle Delgado"
},
"reviewBody": "Definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Franni !!!"
},
"reviewBody": "I love this recipe and I’m a habitual tacos carnitas eater. I go light on the 5spice and add just a dash of cinnamon and swap the orange for lime juice, no rind. I crisp it under the broiler at least twice as long as Chef John describes and it is amazing. Chop some onion and cilantro, wrap it all up and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Biscuit"
},
"reviewBody": "For the first time out, I like to follow recipes as written. I followed the recipe as instructed. This was very delicious and will make again. The next time though I will probably reduce the cumin, it was a bit overpowering for my taste. Others may like it “as is” so don’t be afraid to try. I will say that the “crispification” process was magnificent! It added so much to the flavor and texture. Excellent tacos with diced onion and cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "devonne Barron"
},
"reviewBody": "This quickly became a family favorite!! I didn't have some of the spices but I used a few other spices I already had with a bit of the cinnamon. Carnitas come out perfect every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susulu"
},
"reviewBody": "Loved it. I used the cooking method exactly and because my family wouldn’t appreciate the cinnamon or orange flavour I took a few recommendations from others and used as well oregano, thyme, paprika. It was delicious! I shredded it and put it in a tortilla with cabbage, guacamole and salsa! Huge rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SpycGyrl"
},
"reviewBody": "Love it with changes. The technique was top shelf and I know certain regions in Mexico use cinnamon in meat, but I prefer it without. (I skipped the 5 spice too)\nI added more cumin, onion, and a little Goya red cooking sauce I had leftover. I'm using the leftovers for pork rolled into a flour tortilla (instead of chicken) stuffed with cheese and fire roasted corn burritos with sour cream sauce. Chicken Enchiladas with Creamy Green Chile Sauce on this site. I'll serve those with avocado, cilantro, tomato on a bed of lettuce for dinner tonight.\nThanks for learning a new cooking method!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItsRandom"
},
"reviewBody": "I was hesitant about the cinnamon, but stuck with the original recipe and they turned out wonderful. So flavorful. Put it on a tortilla with homemade hummus and salsa, a bit of avocado, and shredded shredded lettuce for some crunch. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Milbank"
},
"reviewBody": "I left LA in '91. I just made the best carnitas I've had since I returned to my NJ homeland. It may be the best carnitas I ever had. I can't wait to make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LKH"
},
"reviewBody": "I liked the cooking method, time was perfect. Will make again without cinnamon, unusual flavor, perfume or something.\nLiked the orange and garlic. The crisping under the broiler really makes it beautifully browned. Great with the warmed flour tortillas, a little sautéed onion and sour cream. Will make again with spice I prefer. Thank you, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Andringa Faber"
},
"reviewBody": "I made it how the recipe was written, except I didn't have the Chinese 5-spice powder, so that was omitted. My family loved it, even without the 5-spice. I served it exactly how Chef John recommended, and it was delicious. The pork butt that I used was closer to 4.5 lbs, but I didn't adjust the measurements of the seasonings. Thanks for the great recipe, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meowitzer"
},
"reviewBody": "Another Chef John hit. My husband said it tastes like we got it from a restaurant. And this was even without the orange people because I had no oranges, so I just used orange juice. (Editing to add this:) I also didn't have Chinese five spice so I substituted cinnamon, cloves, and more cumin. Chef John is awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa O'Sullivan"
},
"reviewBody": "I followed all of the directions and added a little shake of paprika. These are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChaCha"
},
"reviewBody": "Made it just as written - except doubled the recipe. It was awesome! Great flavor, all spices and combinations work. The pork is delicious even before crisping it up. Thank you for a great recipe - already made it twice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crazy4cakes"
},
"reviewBody": "Normally I make and review the original recipe, however, based on other reviews I made a couple of changes. I omitted the cinnamon and Chinese 5 Spice, and added 1/2 tsp coriander, 2 tsp chili powder, and 1 tsp oregano. I also added 1 yellow onion chunked. I used the peel and juice from 1/2 a large organic navel orange and followed the technique exactly. I finally found the richness and depth of flavor other recipes were lacking. This is fabulous served with pico de gallo, sour cream and lime wedges. Making this my go-to from now on, all other carnitas recipes are out the door! Bravo Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "Really good! Very interesting spice combo. Perfectly tender meat inside a nice crusty outer layer. My husband loved it. And so did I."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliehm"
},
"reviewBody": "We love Chef John. After reading other reviews I cut back slightly on the cinnamon but I’m not sure I needed to. Nothing was overpowering, very flavorful. Appreciate the step by step directions. We served this pork with 5 spice roasted potatoes &amp; green beans. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MYPRETTYPEONIES"
},
"reviewBody": "I followed the advice of others. Skipped the cinnamon, orange, and five spice. Added oregano, onion powder &amp; lime zest/juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ny2nc"
},
"reviewBody": "Family loved it but will omit or reduce amount of cinnamon next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyzabro"
},
"reviewBody": "Great recipe. So yummy. I accidentally forgot the garlic and it was still good. I did add garlic powder to compensate. Can’t wait to make this again, not forgetting the garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Cotter"
},
"reviewBody": "BOMB. A little putsy, but worth the extra effort to cube it and crisp it under the broiler. Do not do what I did and accidentally buy a pork shoulder picnic roast; it had a large bone in it. I also didn't thaw it thoroughly as it was frozen around the bone. 20 minutes into trying to cut the meat off the bone I was regretting not throwing the whole thing in the oven. 4 hours later I did NOT regret the extra time I took to cube it, because increasing the crispy surface area was SO worth it! \nI had a 7lb roast so I almost doubled the recipe. Did not use 5-spice, used half the cinnamon, added 1 tsp each of dried oregano and thyme. Was still great, most of the salt came out in the juices, so basting the meat during the broiling process added much of that flavor back. That being said I think I would use half the salt next time. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duane Knight"
},
"reviewBody": "Instant family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miranda879"
},
"reviewBody": "Leave the cinnamon out &amp; this recipe is a homerun!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Popp"
},
"reviewBody": "Next time I would only use about a third of the orange and add onions....otherwise, delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRSPIKE"
},
"reviewBody": "I have made this many, many times just as written and it is always delicious. One of our favorite meals. Now days though I put it all in the pressure cooker for 60 minutes under high pressure with a little added beef broth. I still finish it under the broiler just like Chef John to get it crispy. Turns out great and saves me some time. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonomahungry"
},
"reviewBody": "I made the recipe exactly as presented. It was Fantastic. This one I will definitely make again. My husband, who is a Carnitas freak!, loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stuman491"
},
"reviewBody": "I really enjoy this recipe. I have made it a few times and although I never quite get it crispy, it is delicious every time. I definitely agree that some fresh pico de gallo is the perfect compliment for this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "I make this dish every once in a while and it always turns out perfect. Always get rave reviews. Big hit in my house and co workers who have had the privilege to sample."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Robinson"
},
"reviewBody": "No more carnitas at the mexican restaraunt! These are the best I've had. I'll make them at home from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorraine Magrino Palmateer"
},
"reviewBody": "It was ok, I think the seasoning was off for me and my taste. It wasn't worth the effort. Sorry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Kalfas"
},
"reviewBody": "These are the best carnitas that I ever had. Better than a restaurant! Chef John always makes me look good to my friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrst"
},
"reviewBody": "Made it exactly as written. Those who wanted cinnamon and Chinese five spice omitted must not be Yucutan frequenters. Óle Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Byron Reber"
},
"reviewBody": "I did a thorough trimming of the fat, and did not re-add it to the pork cubes, becuase I did not watch the video. That being said it came out perfect. In my opinion the written directions should be as comprehensive as the video."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "We liked this, but the orange flavor was a bit overpowering. Next time I will try reducing the amount of orange zest, or maybe even eliminating the orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hadsit"
},
"reviewBody": "Absolutely perfect made exactly as the recipe stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Markm1991"
},
"reviewBody": "Very good recipe. I followed the directions exactly, even my picky 9 year old liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jtms"
},
"reviewBody": "I’ve tried other carnitas recipes, and I typically use a slow cooker version, and more often than not I’m disappointed in the results. Not this time. This recipe was spot on. I didn’t change a thing. Absolutely loved it. Not sure why people leave reviews and say they’ve changed this to that, substituted a for b, used this instead of that, deep fried instead of baked, left this out, added that in. Thanks for reviewing a completely different recipe. If you can do cinnamon, five spice, and cumin, this is for you. Don’t change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NWguyy"
},
"reviewBody": "Made this recipe for my wife and mother in-law, WOW!!\nThis recipe is fantastic, the carnitas turned out great and the crispy bits was the best part. \nServed street taco style, corn tortillas, pick de Gallo, shredded cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustinMeck"
},
"reviewBody": "Love it. The orange peels are essential to that authentic tanginess. We like ours a little crispier, like it came off of a parilla so I broil it a few more rounds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Ruthenberg Jackson"
},
"reviewBody": "This recipe is amazing! I have never made carnitas before and the meat turned out just beautiful. I left out the cinnamon, as others suggested. I added paprika and onion powder instead. It takes a long time to cook, but it’s not labor intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alissa Mulligan"
},
"reviewBody": "Your family will think you’re a magician! Mine LOVED it and all moaned as it fell apart in their mouths. Make it. You’ll love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANTABIROSTRIS"
},
"reviewBody": "OMG PEOPLE whaaaaaaat are you talking about?!? Make this exactly as Chef John says, you wil not be disappointed. Just ridiculous, melty, flavorful, makes your house smell amazing pork goodness. This is absolutely delicious. The cinnamon and Chinese 5-spice does not overwhelm, it boosts the pork flavor like I’ve never experienced before. I had a 7.6 lb pork butt, bone in, and it took me a minute to cut it all up and I could have gone a wee bit smaller on the chunk size. I doubled the recipe to account for the amount of pork and had to split it between a 9x13 and an 8x8, but even just eyeballing it, it worked out spectacularly. My husband tried it and closed his eyes while chewing, it was so good (a la Remy in Ratatouille). Don’t be afraid, make it just like it says. Watch the video. You won’t be sorry. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These came out so tender and amazingly flavorful! I didn't have the 5-spice powder, but used everything else on the recipe. I left it a few minutes less on broil than what's specified on the video, but they still came out crispy enough and absolutely delicious. Definitely one of my favorite pork shoulder recipes here!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billie Garcia"
},
"reviewBody": "This is by far the best carnitas recipe I have ever tried...and I have tried some of the best!!! Was afraid to use the cinnamon and Chinese spice after reading reviews so I used a regular carnitas spice medley of oregano, crushed pepper, onion and garlic powder. Was so easy... have always cooked the roast first and then shredded it. This is so much quicker and easier. Next time I may try the slow cooker. Thank you Chef John!!!You NEVER disappoint!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne reese"
},
"reviewBody": "This was a big hit at my house! Even the kiddos were requesting it to take for lunch to school. Broiling made all the difference in the texture of the meat. Absolutely faithful to the flavor of the original with a little lighter cooking style. Loved it and we will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aiza"
},
"reviewBody": "I didn’t add the Chinese powder but the rest was identical to recipe. The broiling without flipping is genius."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ekbrook"
},
"reviewBody": "Great flavor and sooo many potential topping options. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Oliver"
},
"reviewBody": "Very good recipe, used pork and lamb with sliced bell peppers red onions and minced garlic. This version made carnitas tacos with assorted aiolis The meat was tender and very juicy served as shown by Chef John and also on leftover buttered angel hair pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quiqui Dagle"
},
"reviewBody": "Perfect, this is how I like carnitas with a mixture of salsa verde and crema."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christian Dupont"
},
"reviewBody": "i sure did change a couple of things.... :)\n\nI substituted the chinese 5 spice and the cinammon chilli powder and lemon pepper. I also added the juice of 3 fresh limes.\nIt came out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsie Jaimes"
},
"reviewBody": "Followed recipe exactly, except for Chinese five spice I didn't have, I just used Goya all purpose seasoning instead. These carnitas were delicious!! I'm planning a family dinner with these later this week, can't wait because I know they'll all want the recipe! So good! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Hogg"
},
"reviewBody": "I typically don’t like or write reviews that deviate from the recipe. That said, there were so many negative reviews on the cinnamon, that I substituted half teaspoon of chili powder and chipotle chili powder, also added a quarter cup of root beer soda as my pork was leaner than expected. Also used entire head of garlic and some adobo sauce for some heat. Simply fantastic and I am sure if you are a fan of cinnamon Chef Johns recipe will suit you. A word of caution. Last instruction says baste meat with some fat drippings and broil for 3 minutes, then repeat. Fat can pop up and catch fire in broiler. As others recommended I reserved garlic to spread on tacos for next meal. Made Jasmin rice with half of reserved liquid, half water, diced onion and chopped orange peel from recipe. Served carnitas over. This is definitely a keeper. Simple, easy, light clean up. Ideal to serve guests as you won’t be a slave to the meal in the kitchen. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alene"
},
"reviewBody": "The technique is a keeper! This has been the best texture and tender carnitas result we've tried. The flavors weren't exactly what we wanted, but that's okay. We'll play up the orange and lime more next time. We haven't found our ideal cumin ratio. I'm allergic to cinnamon. I'm well aware of how often it ends up in dishes...even savory. You have no idea. It's in mass market chillis, all kinds of restaurant meat dishes, and of course 80% of desserts. Finding it here was not a surprise. I bet it tastes delicious (I love cinnamon but my body hates it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cardiacolt"
},
"reviewBody": "Chef John has done it again! This may take some time but the cooking process ensures absolute tender meat. Don’t forget to brush the juices in between broiling! I used all the ingredients but I didn’t have pork shoulder, I settled for boneless pork ribs and trimmed most of the fat off and chopping up to throw in with the mix. It’s crucial to do this as the fat gives a lot of flavor to it. My GF and I had this for dinner and she couldn’t stop licking her fingers. This is a winner for me, I mean us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni"
},
"reviewBody": "Best tacos ever! I omitted the cinnamon and orange peels, just used some orange juice. Added some garlic salt and onion powder. I make a lot of tacos and this was by far the best! Topped it off with a pineapple Slaw. My new fave!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OdaMae"
},
"reviewBody": "Wow! After reading several reviews regarding the cinnamon, I was skeptical but as a NATIVE south Texan, I can vouch for the authenticity of these carnitas, the flavor is SPOT on! I kept the spice proportion as written but adjusted for the amount of pork. The grocery store only had \"value packs\" of pork carnitas, so I put half in the freezer for a later time. I think I cut the pieces too small as the 3 1/2hr cooking time made them literally ready to fall apart, the technique \"saved the day\" after broiling. (Yeah, I took the rest, out of the freezer the next morning, cuz they're THAT good!) Cut them more \"chunky\", \"stumped my toe\" with the spices, reduced cooking time to 3hrs and tossed them between each broil to acquire an even crispiness , for the next batch. I have so many questions for Chef John regarding his background, how he finds the right combination of spices for his consistently authentic recipes, and profession. Another hit, Sir!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanja Draper"
},
"reviewBody": "Delicious flavor (omitted the chinese five spice, though) and texture, that few minutes of broiling is key. Patting myself on the back for cooking this in disposable foil pan:). Another winner from Chef John! (if you don't know his baked chicken wings recipe, do yourself a favor and look it up)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandi Holley"
},
"reviewBody": "Such a delcious recipe. My family loves it. We now make this pretty regularly and the left- overs are just as amazing as when freshly made. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jimmy Parks"
},
"reviewBody": "very nice no five spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Demogorgon"
},
"reviewBody": "Made this today. A few people mentioned the level of cinnamon, so I cut the amount in half. Other than that I made it as written and it was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "This turned out great! I've been craving carnitas. I doubled the spices, and used Chef Johns flour tortilla recipe. I did use pork loin, instead of shoulder, because its what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "This is the most delicious meat ever. I've done it as written many times. Today I seared the meat, then put it in the crock pot with everything. Finished it in the oven and it was amazing, but slightly easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clmayfae"
},
"reviewBody": "If I could give this recipe 10 stars I would. This is hands down the best meat I’ve ever tasted. The meat turned out perfectly tender and juicy with a little crisp on the outside. Everything about this recipe even from the very beginning is filled with delicious aroma and tastes. The video is very instructional and easy to follow. Chef John has become my families new favorite chef. Almost every night I hear “is this one of chef Johns recipes?” Because everything he creates is scrumptious. TRY THIS RECIPE... EXACTLY HOW IT IS. You won’t be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sydney Cleary"
},
"reviewBody": "Did not use the cinnamon or Chinese spice and it turned out pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Lanzillotti"
},
"reviewBody": "Easily the best carnitas recipe you’re going to find. It’s super simple and is almost cool proof. I do add smoked paprika, chipotle and ancho chili powder to the spice mixture for more complex flavors. Always a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Bryan"
},
"reviewBody": "Excellent! Made this and mixed it with broccoli coleslaw with a ranch based sauce... The flavors are wonderful together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reid Winchester"
},
"reviewBody": "Saw that a lot of people were saying not to use cinnamon, and to use limes instead of oranges. It came out AMAZING! The only thing I would recommend is to shred the meat before you put it in the broiler and use a thinner baking sheet for broiling, otherwise the top crisps too much while the middle is still juicy. Overall, a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Bair"
},
"reviewBody": "Very good recipe. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steve&diane"
},
"reviewBody": "Amazing recipe and really authentic tasting. I follow the recipe every time and it is amazing. I suggest watching the video."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Newberry Parks"
},
"reviewBody": "Made this tonight and it was delicious. The meat was ender and juicy and the flavors worked great together. My only change was that I used 2 cinnamon sticks instead of the ground cinnamon. I made a slaw with fresh lime juice, cilantro and pinch of kosher salt and ate it all on corn tortillas and garnished with pico de gallo. We will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rox"
},
"reviewBody": "No on the 5 spice and cinnamon. Tasted awful. Cumin and chili powder is all that is needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Michael Johnson"
},
"reviewBody": "After reading the first few reviews, I did omit the cinnamon and five spice, adding in coriander and granulated garlic. I think I will try it with both another time, I read further reviews and they liked it as is. My hubby loved it and so did I. I plan to reheat what was left adding sautéed onions and bell peppers and maybe some mushrooms. Super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Campbell"
},
"reviewBody": "The flavors blended very nicely, a rich and satisfying meal that disappeared quickly. I like Chef John's way of adding orange peel--I am now using that method in other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debbie Ritter-Williams"
},
"reviewBody": "I'm planning to make this tonight and have a question. The instructions say to chop up the fat removed from the pork ... but never says what to do with it after it's chopped ... Put it in the baking pan with the meat for flavor?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arod0815"
},
"reviewBody": "This is a fantastic recipe. I modified to use a cup of orange juice instead of an orange, and substituted Fiesta Pork Rub in place of the cinnamon and Chinese spice. The first time I made it hubby ate almost 2 lbs by himself. Highly recommend!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trisha"
},
"reviewBody": "These are fabulous!! I followed the recipe and they turned out perfect! Can't get enough of them. Excellent Chef John! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Cassel"
},
"reviewBody": "Simple to make with a definitely distinctive flavor. We all loved it and look forward to coming back to this recipe many times in the future !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JETLAG70"
},
"reviewBody": "this is the best i made so far! the family loved it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/239786/crispy-pork-carnitas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
"name": "Pulled Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/239786/crispy-pork-carnitas/",
"name": "Crispy Pork Carnitas"
}
}
]
}
}
, "about": [
]
}
]