				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crunchy Eggplant Parmesan"
,"datePublished": "2019-04-02T02:58:01.000-04:00"
,"dateModified": "2022-12-22T20:40:49.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Mama Smith"
,"url": "https://www.allrecipes.com/cook/mamasmith"
}
]
,"description": "A deluxe version of eggplant Parmesan is layered like a lasagna with panko-breaded eggplant slices, Italian-blend cheese, and Parmesan cheese in prepared pasta sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GNzCkuwOeaGg0B7oxSUKSVYz6vY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/880565-crunchy-eggplant-parmesan-Stirring-up-Trouble-4x3-1-2211b3a4ee4b497c902728483cce0596.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crunchy Eggplant Parmesan"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "195"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "350 kcal"
,"carbohydrateContent": "35 g"
,"cholesterolContent": "121 mg"
,"fiberContent": "4 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1524 mg"
,"sugarContent": "12 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"cooking spray",
"2 eggplants, peeled and sliced crosswise 1/4-inch thick",
"2 teaspoons salt, or as needed",
"4 eggs, beaten",
"1.5 cups panko bread crumbs",
"2 tablespoons dried Italian herb seasoning",
"2 tablespoons olive oil",
"1 onion, diced",
"2 cloves garlic, minced",
"4 cups prepared pasta sauce",
"2 cups shredded Italian cheese blend",
"0.33333334326744 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C). Spray an 11x13-inch baking dish and 2 baking sheets with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Place eggplant slices on racks over the sink or paper towels and sprinkle both sides of slices lightly with salt. Let eggplant drain for 30 minutes, rinse, and pat dry with paper towels. Place eggplant slices on prepared baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until eggplant is soft, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour beaten eggs into a shallow bowl; combine panko bread crumbs with Italian seasoning in a separate shallow bowl. Dip eggplant into beaten egg and press into panko crumbs to coat. Place breaded eggplant back on the baking sheets and spray the slices with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Set oven rack about 6 inches from the heat source and preheat the oven&#39;s broiler."
} ,{
"@type": "HowToStep"
,"text": "Broil eggplant slices until tops are golden brown, 2 to 3 minutes; remove slices, turn, and spray other sides with cooking spray. Broil until golden brown 2 to 3 more minutes. Remove eggplant and turn oven temperature to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Heat olive oil in a skillet over medium heat and cook and stir onion and garlic until onion is translucent, about 5 minutes. Stir in prepared pasta sauce and remove from heat."
} ,{
"@type": "HowToStep"
,"text": "Spread 1/3 of the pasta sauce into bottom of the prepared baking dish. Top with half the eggplant slices, half the Italian cheese blend, and half the Parmesan cheese. Spread another 1/3 of the sauce over the layers; layer the remaining eggplant, remaining pasta sauce, Italian cheese blend, and Parmesan cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake casserole in the 350 degree oven until cheese is melted and bubbly, about 30 minutes. Let stand about 10 minutes before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT155M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jagpot"
},
"reviewBody": "Well this is a family favorite. I did soak the eggplant in salt water then rinse, dry,egg dip panko and oven for 15 mins flipping once. My sauce was Rao's and a can of Manzo tomatoes with Italian seasoning added. What I did add were mushrooms and diced chicken on each layer. This is actually an over the top dish. Most everyone in the family does not like eggplant but this dish is the exception. I also did not think it took that long to make even with cooking the chicken breast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene Beville"
},
"reviewBody": "I followed the recipe and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny Sheehan"
},
"reviewBody": "This is definitely mine and my family’s favorite way to prepare eggplant parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norsey"
},
"reviewBody": "This recipe is awesome .Everyone raved about it! The only thing I added was fresh basil on top! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "I thought this was very good. I served it as an appetizer. I agree with others and dipped the eggplant in flour first, then the egg and added a little Parmesan cheese to the Panko. I also left the skin on and washed it. I used this as an appetizer and it was nice and crunchy. I stopped after baking it and did not add any marinara sauce or cheese and served it with ranch dressing; however it would be good dipped in Marinara sauce without the mozzarella cheese. I will try the recipe as Eggplant Parmesan next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Johnson"
},
"reviewBody": "It was good many steps though. The only thing i'd change is that there's too much Italian seasoning and it was overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "Delicious! I love the broiled eggplant. I have never been able to get it without it absorbing the oil. I used more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Holman"
},
"reviewBody": "Loved this recipe! The eggplant was both soft and crispy, yum!\n\nI"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tori Ogren"
},
"reviewBody": "I changed it up a bit. I used a three stage dredging, and pan fried the eggplant.\n\nI kept the sauce separate so the eggplant would remain crunchy.\n\nIt is fabulous! I also added a pinch of red pepper flake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skeet"
},
"reviewBody": "My wife didn't know she liked Egg Plant until I made this ; ) I got raved reviews and made a believer out of her."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drenee"
},
"reviewBody": "Absolutely fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Short Grizzle"
},
"reviewBody": "This is a fantastic dish. I had tomatoes from my garden, so I prepared the sauce from them. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathyt"
},
"reviewBody": "I have used different sauces. one high-quality sugar-free jarred sauce and once with my homemade sauce. This has become my favorite dish to make. The Eggplant stays crunchy and it's just delicious! We serve it with angel hair pasta and salad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Hodgson"
},
"reviewBody": "Delicious and relatively easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Plunk"
},
"reviewBody": "I flowered, egged and breaded then fried! Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Made almost to the directions only used a few tip from other reviews. Dipped in four before egg, cooked after flour, egg, panko dipping not before. Then broiled as directed really makes it nice and crisp not mushy. I made the marinara. Used extra garlic, fresh basil and chopped parsley to sauce. Excellent recipe my husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsCassell6"
},
"reviewBody": "I love Eggplant Parmesan, and this recipe rocked. I didn't sweat my eggplant for 30 minuted but did soak in cold water for ten minutes. I used Italian breadcrumbs because i didn't have panko. Even my oldest who thinks eggplant is slimy had seconds! Score! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Buk"
},
"reviewBody": "I tweaked it a bit like others by first dipping the eggplant slices into flour, then egg wash then Panko crumbs. It’s a delicious dish and I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L Dillard"
},
"reviewBody": "I wanted to make this recipe because I thought the texture of the panko would do it, and it turned out great. Not too wet. I didn't have the parmesan blend but I did have some mozzarella slices. So, I layered with mozzarella and plain parmesan. It was a little labor intensive, but well worth it. Will be saving some for a couple of meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brian forchheimer"
},
"reviewBody": "If this recipe didn’t taste so good, I would not go through the hassle. The extra steps, sweating, baking, broiling, are well worth the time. This is really good eggplant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Junebug"
},
"reviewBody": "This is an excellent recipe for eggplant. I halved it, and still had leftovers that reheated well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joanne"
},
"reviewBody": "Definetely will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy"
},
"reviewBody": "Love the texture, crunchy as you can get from the oven. Put some vegan touches, absolutely delish,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "loishavasu"
},
"reviewBody": "It had a good flavor and tasted even better reheated. The only reason I gave it four stars was due to the amount of time required. It’s not a recipe I would do in a normal day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Made it as recipe dictates. Absolutely great and easily frozen. I could see using this as a basic recipe but adding in all of the ratatouille veggies (besides eggplant, adding in roasted onions, zucchini and peppers). Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristi Stout"
},
"reviewBody": "Only used 1t italian seasoning.... think it would be too salty with suggested amount"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary M Vance"
},
"reviewBody": "This turned out great, the eggplant was tinder and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Howard"
},
"reviewBody": "The amount of sauce used definitely impacted the overall dish. The eggplant were nice ad crisp until being baked with all that sauce for 30 min. Next time around I will use 25% of the sauce called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Looper001"
},
"reviewBody": "This was an excellent way to prepare the eggplant without all of the oil! I did spray a little cooking oil on the slices before broiling as I thought they would be a bit too dry. I also added red wine to my sauce. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Osborne"
},
"reviewBody": "Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Sanders"
},
"reviewBody": "Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktwilliams"
},
"reviewBody": "I typically don't rate recipes strictly out of laziness. However, this recipe was so delicious, I felt it really deserved praise! It was a bit time-consuming, but now that I've completed the process once, it will be much easier next time. And there will definitely be a \"next time\". I don't think I'll ever fry eggplant again! I know many cooks frown on jar sauce, but that's what I used and it was tasty. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren Tonge"
},
"reviewBody": "This was so tasty! and my boyfriend even liked it after previous negative eggplant opinions Lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candace N David Bonham"
},
"reviewBody": "The eggplant is going in and out of the oven 3 times, its seems a bit over-processed. Any hint of nutrient is being sweated, baked, broiled, and baked again until this recipe no longer qualifies to be listed under the \"healthy\" section. For the sauce I put it in dollops on top of the eggplant to not loose the crunch. For easier serving, layer the eggplant in stacks. Took us 3.5 hours. So tasty I give it an A+."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Weinrich"
},
"reviewBody": "Delicious! it is not an easy recipe, it takes quite a bit of time to prepare it, but it turned out quite good, &amp; the prep was worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Anderson"
},
"reviewBody": "I really wish I could just add a comment instead of rating this recipe. I only did steps 1 through 6. Following AhhhJDew's advice not to do the initial bake first, but to dip in flour, egg wash and then panko and bake for 15-20 minutes. When I saw the eggplant after the panko bake I coated the one side with a small about of spaghetti sauce, topped with a Italian blend of shredded cheese and returned to the oven until cheese melited. The results gave a tasty eggplant appetizer. When the weather is cooler I will do the casserole part. But, many thanks for the recipe - with out it I would not have gotten the appetizer. I do plan on doing the casserole version when the weather becomes cooler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "The first time we made this I followed the receipt as written (except for the precooking). It was good, however in our opinion the eggplant was too soft and lost its crunch.\nEver since then we ,like most reviewers made additional changes. We grow Ichiban eggplant which is long and skinny. The skin is thin and tender (no peeling required) and the seeds are small. \nMy step 4 included coating them in whole wheat flour seasoned with pepper, dipped in the beaten eggs, then panko crumbs mixed with Italian seasoning and grated parmasean cheese.\nI followed the broiling instructions (step 6). My step 7 was placing the cooked eggplant (somewhat overlapping) into a small casserole dish or small cast iron skillet coated lightly with cooking spray. I moderatly spooned homemade chunky marinara sauce on top and sprinkled with grated mozzarella cheese. Placed it in a 350 degree oven and baked until the cheese melted.\nThe eggplant retained its crunchiness and was delicious. I have made this several times and its perfect every time.\nIf we have too much eggplant, after its broiled and cooled I place some of it in the icebox and bake it later in the week. It keeps for serval days, I'll try freezing it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made a few eggplant Parmesan recipes in the past but did not like them. This one my husband made exact to the recipe and LOVED IT! I made a simple sauce by sweating the onion and garlic in a little olive oil then adding a cup of Passata. Let it simmer for about ten minutes. It was ready for the recipe. Once he coated the eggplant with the bread crumbs (he used crushed corn flakes) he put the tray in the refrigerator for about an hour before cooking. We have found this helps to get the egg and breadcrumbs to really stick. A great recipe. Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jan"
},
"reviewBody": "I thought it was delicious. I served leftovers the next day over spaghetti noodles. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kan Singh"
},
"reviewBody": "So hard to make but it's tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikko"
},
"reviewBody": "Excellent recipe! I have made it twice now because it is so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "saminiccole"
},
"reviewBody": "I really enjoyed it. Looking at the picture, I see that I cut the eggplant wrong, but it was still really good! I also got a little impatient waiting for the eggplant to soften so the thicker pieces kind of seemed like an apple or raw potato, but that's my fault. Overall, I would make it again, but I'm going to be more patient when cooking it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KittyCatD"
},
"reviewBody": "I loved this recipe! It is a weekend undertaking for sure but well worth the effort! I used a homemade sauce that I had in the freezer and I added goat cheese for a nice topper! I even made a lactose free cheese version for my husband he loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Staceyl1"
},
"reviewBody": "Simple to make and delicious!! A Superbowl dinner success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple to make and delicious!! A Superbowl dinner success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melody cramer"
},
"reviewBody": "Wonderful. My family loved it. First time I've made eggplant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimi"
},
"reviewBody": "I've made it few time and is always great! Of course I tweak it a bit...use A LOT less onion, probably more garlic and don't need 4 eggs. Last time I didn't have enough eggplant so I used zucchini also. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cbhecker"
},
"reviewBody": "Not that crispy (made as per the recipe) but delicious! Will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy McAuliffe"
},
"reviewBody": "I'm not a fan of eggplant, for some reason, but when I saw this was crispy eggplant, I thought I would try it. I, my husband, and my 18-year old son all loved it. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nearcon"
},
"reviewBody": "I will make it again but it's a lot of work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susanhull72"
},
"reviewBody": "This is my basic go to recipe for eggplant parm. Easy, good, gets the eggplant cooked thoroughly. I make my own pasta sauce...cheaper, fresher and tastier. No, not as easy as opening a jar, but easy enough to make while the eggplant bakes. Really has that homemade taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I'm not much of a cook but I do love eggplant parm. I followed this recipe using my own sauce. My husband and I devoured it...just as great the next day! Next time I will slice the eggplant 1/2\" instead of 1/4\" to make them easier to work with. I only wish the prep was less work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuniperBreezes"
},
"reviewBody": "This was so easy and delicious! I used unsweetened almond milk instead of egg due to food allergies and it was a perfect substitute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rza raz"
},
"reviewBody": "Turned out really great! I think I used 3 eggplant from my garden and just layered them on top of one another. I also used 2 Classico Tomato Sauce and it was extra yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Woodrup"
},
"reviewBody": "I have never made eggplant parmesan before, so am delighted to find a recipe that I can stay with. I did as one person suggested and didn't cook the eggplant first. I did use a purchased sauce but cooked it down for an hour to make it richer. This recipe does take a lot of time but well worth it.\nDelish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PuggyK"
},
"reviewBody": "My eggplant wasn't as crunchy as I was hoping for but the taste was still good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justinre"
},
"reviewBody": "Delicious! Used the recipe as is and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Rader"
},
"reviewBody": "My husband (who doesn't really like eggplant) &amp; I loved this dish! I cut the recipe in half since it's just the 2 of us &amp; it still was enough for 4 servings, because I served it with angel hair pasta. It is a little labor intensive, but well worth it! I absolutely would make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kellyann"
},
"reviewBody": "This was a good eggplant but I would not make it again as there were way too many steps that could have been eliminated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bgaw57"
},
"reviewBody": "This is the best eggplant Parmesan and rivals that at restaurants. I followed the recipe, but added mozzarella cheese aside from not peeling the eggplant. Will definitely be adding to our menu rotation. There were more dishes to wash but no frying, a plus. Next time I'll take others suggestions and prep the extra egg plant (bake 15 minutes, then dip in egg and breading) and freeze, for a quicker dinner option when time is limited."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mccharlotte"
},
"reviewBody": "Wonderful recipe. The perfect amount of oil, cheese and seasonings, and I loved the Panko crust. My tweaks: I added chopped fresh tomatoes to the pasta sauce as they are coming in from the garden now. For the cheeses I used equal parts parmesan, fontina and fresh mozzarella. My three medium sized eggplants were picked yesterday so I did not peel. The perfect early harvest recipe. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beach girl"
},
"reviewBody": "We loved this recipe. Great flavor &amp; healthier than the usual Eggplant Parmesan. I used Bertolli sauce with tomatoes &amp; basil. I will make this again &amp; again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bettie Anna Seibels"
},
"reviewBody": "I made this with ichiban eggplant and served to people (who don't particularly like eggplant ) and got rave reviews. Frozen, it traveled well and was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KVarn"
},
"reviewBody": "Delicious! Had lots of eggplant from the garden and this was a great recipe. I followed it exactly, except I sautéed mushrooms along with the onions for the sauce. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eliana"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeacherLauren"
},
"reviewBody": "These turned out so well the first time I made them, that I have made them 4 or 5 times since. The one and only thing I do differently is add a layer of chicken parm on the bottom and stack it with the eggplant parm on top (My husband doesn't like meatless dishes). Delicious every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mymahriyah"
},
"reviewBody": "I made a few changes: I did not precook the eggplant before beading. I beaded it raw after sweating it then cooked it breaded at 450 for about 10-15 mins. I also used mozzarella for the cheese. And finally I did not have enough eggplant to layer so I just did a single layer in the baking dish. \nMy husband and I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kay Freeman"
},
"reviewBody": "Hubby and I made this while on vacation and followed the recipe exactly except for adding a few mushrooms to the sauce. I was super - excited but was expecting something different, at least crunchier than basic eggplant parm, but i couldn't tell the difference. On the plus side, I did learn about \"sweating\" eggplant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jurce9"
},
"reviewBody": "A wonderful version of eggplant parm. I've always found it a tedious dish to make, with varying results each time. This version is going to be my new go-to recipe! I followed the instructions exactly and was delighted with the outcome! The kids and hubby all gobbled it up! It did soak up a lot of the sauce, but also remained crunchy. I used jarred Mario Batali's Marinara and it was perfect! I also think this can be served as an appetizer If you stop at the step just after broiling. Just serve the baked crispy eggplant with some warm marinara for dipping! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Beard"
},
"reviewBody": "It was delish, but not crunchy. It was delish without it though. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "babskitchen"
},
"reviewBody": "My husband really does not like eggplant parmesan but decided to give it a try since I was really jonesin' for some. He really loved this recipe, but I found it to just be so-so, especially with all the steps involved. Think I'll stick with my old stand-by."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "andrea"
},
"reviewBody": "Unless you want a \"heavy\" eggplant dish this one is not for you. The Panko breadcrumbs really absorbed much of the liquid and made this dish almost \" bread like \". Next time I might try doing half of the eggplant in the Panko or simple stick to the old fashioned way of using only seasoned breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "moelevine"
},
"reviewBody": "The result was dry and not great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetiecook"
},
"reviewBody": "This recipe is AMAZING! It melted in my mouth. I skipped step 2, and added lasagna pasta. Also, instead of the Italian Cheese Blend, I used just plain mozzarella, which made the dish richer. Even though it was a bigger project, it was totally worth it :-). I'm sure I'll cook it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon R. Lopez"
},
"reviewBody": "Loved this and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie MacFabe"
},
"reviewBody": "I added bulk Italian sausage to the sauce, and used gluten free Panko crumbs. I also added some shredded parmesan to the mozzarella. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "Delicious! Next time I will definitely only make half though! Just my husband and I only ate 1/3 of what I made. Also, make sure you have time to prepare it, because it did take me all of 2 hrs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "Like many others - I didn't pre bake the eggplant-but otherwise used the recipe as is. The family really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin P"
},
"reviewBody": "Made this according to the recipe, used 2 jars of marinara sauce and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Great recipe! I made this for a huge family get together for a lot of people on my husband's side that I never met. I didn't want to fry the eggplant as I had so much other work and cooking to be done. The only thing I changed was I didn't bake the eggplant before I breaded them. I took the advice of another chef! regardless, it came out wonderful and I got many, many compliments. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I followed the recommendations to skip the baking in step 3 and to dip the slices in flour before the egg and added grated parmesan to the breadcrumb &amp; seasoning mixture. I had beautiful crispy eggplant rounds after the breading &amp; broiling, so I was careful not to smother them in too much sauce, which I did the first time I made this, allowing their sides to remain exposed and crunchy. The result was amazing! The dish tasted like veal parmesan that I remember from my childhood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "irishrose60"
},
"reviewBody": "I give this recipe 5 stars!! I am not much on eggplant, but this dish was awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "It was easy even during the height of the evening rush picking a teen up from soccer practice and one from football practice. YUM! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Fleming"
},
"reviewBody": "Changed out the parmesan to mKe it vegetarian used mozzarella and.provolone as parmesan and.asiogo are not vegetarian. Turned out wonderful.\nPop"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KisstheCook"
},
"reviewBody": "I have never has eggplant before and this always looked good so I attempted it. I did skip the first step to bake it before battering and I made a homemade tomato sauce from another recipe from this site. I didn't like it, but this was my very first time cooking and eating eggplant. Next time I'll use a jar sauce and plain panko bad crumbs instead of the Italian that is bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cariffle"
},
"reviewBody": "FANTASTIC! The best Egg Plant Paresan I ever made. I fixed up the store purchased sauce with some fresh sauteed onion 4 more cloves of Garlic some fresh flat leaf parsley and basil and simmered while tended to to egg plant. I did peel my eggplant as the skin can make it bitter. I also used aged pamesan cheese and Mozerlla as it is what I had on had. Great reviews from my fiance. Will be definately making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarahbeth"
},
"reviewBody": "I made a few slight moderations. I only sweat the eggplant half an hour to save time. Then I used 2 eggs beaten (not sure why you would need 4 unless they are massive eggplants). I left out the onion and Italian seasoning and instead just used basil and salt and pepper to taste. Lastly I pre-baked the eggplant on each side 10 minutes and only cooked it with the sauce and cheese for 10 mins. It turned out beautiful, crispy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charity"
},
"reviewBody": "Amazing: layered sauce with meat added in, with eggplant as directed, zucchini raw sliced, ricotta an 8 oz container, then re layered with +spinach leaves. Can't mess this one up!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judi"
},
"reviewBody": "I made this yesterday for m"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Let's Cook Mama"
},
"reviewBody": "I followed the suggestions of others of tossing uncooked eggplant slices in flour, then dipping in egg, then into breadcrumbs. I also made extra and just parcooked them until slightly browned, let cool, then put into the freezer on the baking sheets and into a freezer bag once frozen. Now I can just bake them up the next time we want them. I also didn't bake them with the sauce. I just kept the broiler on and melted some parmesean on each slice, plated them and topped with hot tomato sauce. This way they stayed super crunchy. My husband who supposedly hates eggplant parm ate two servings. Whoot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KayB"
},
"reviewBody": "This was okay. I say that because I was not blown away by it based on the amount of work it required. I guess I don't see the point in doing all the steps to ensure a crispy breading when you are just going to cover it all in sauce and cheese. It had a good taste overall but no one noticed that the eggplant or breading tasted any different than how I would usually make it. I did brown up some mild Italian sausage and added it to the sauce which added a lot of additional flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin White"
},
"reviewBody": "Store was sold out of panko, so I substituted Italian bread crumbs!! Was still a great dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynnhardman"
},
"reviewBody": "Delicious! Added diced fresh tomatoes to the sautéed onions and garlic and simmered while roasting and broiling the eggplant. Made for a chunkier marinara. Everyone in my family loves this recipe! Have shared with many friends who also love!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AhhhJDew"
},
"reviewBody": "This recipe could achieve true greatness with a few IMPORTANT adjustments: 1) DO NOT cook the eggplant slices before coating in egg and breadcrumbs. 2) Dip in seasoned flour FIRST as follows: After sweating the eggplant slices, dip in seasoned flour on both sides, and THEN dip in egg, and THEN in breadcrumbs. Continue as directed. Now, the key to any Italian red sauce recipe is the red sauce. You need a solid marinara to make this perfect, not a crummy jarred sauce. You're gonna go through all this work only to smother your delicious, crunchy eggplant with a jar of Ragu??? No way. Master a basic marinara and you can have it ready while the eggplant is sweating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "Great recipe! I even shortened it by draining the eggplant slices and then just dipped them in egg and Panko crumbs and baked until golden brown. I then continued with the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BandMom"
},
"reviewBody": "Time consuming prep but well worth it. The family loved it, even me - a professed hater of eggplant. Making it again tonight by special request."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debbi"
},
"reviewBody": "Pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Smith"
},
"reviewBody": "This was fairly quick, and extremely tasty. My whole family loved it, including my six year old who is very picky. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dasofoto"
},
"reviewBody": "I enjoyed this recipe a lot! The ingredient that sets it apart from the other recipes is the panko bread crumbs. I tried another recipe which called for Italian Seasoning Bread Crumbs. The texture and taste did not even match this recipe. This recipe is closer to what I am use to when ordering it from a restaurant. It's all in the bread crumbs, in my opinion."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223358/crunchy-eggplant-parmesan/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/22472/main-dish/vegetable-main-dishes/",
"name": "Vegetable Main Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17635/main-dish/vegetable-main-dishes/eggplant-parmesan/",
"name": "Eggplant Parmesan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223358/crunchy-eggplant-parmesan/",
"name": "Crunchy Eggplant Parmesan"
}
}
]
}
}
, "about": [
]
}
]