				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crunchy Almond Biscotti"
,"datePublished": "2020-06-18T23:54:53.000-04:00"
,"dateModified": "2020-06-18T23:54:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "kel7298"
,"url": "https://www.allrecipes.com/cook/kel7298"
}
]
,"description": "Almond biscotti are wonderfully crunchy cookies perfect for dipping in your morning coffee. While it takes time to bake, the cookies stay fresh when stored in an airtight container."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZGZBiXBjvl-waLTs5ZbbOiATNOU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4308877-7a07d00c6b3545dabb8f27f6ab4badcd.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crunchy Almond Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "29"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "90 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "20 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "36 mg"
,"sugarContent": "6 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup blanched slivered almonds",
"3 large eggs",
"1.5 teaspoons vanilla extract",
"1 teaspoon almond extract",
"2.25 cups all-purpose flour",
"0.75 cup white sugar",
"1 teaspoon baking powder",
"0.125 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Spread almonds on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Toast almonds in the preheated oven until lightly browned and fragrant, 8 to 10 minutes. Allow almonds to cool."
} ,{
"@type": "HowToStep"
,"text": "Reduce oven heat to 300 degrees F (150 degrees C). Lightly grease a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Lightly beat eggs, vanilla extract, and almond extract in a bowl. Combine flour, sugar, baking powder, and salt in another bowl. Gradually beat egg mixture into flour mixture with an electric mixer until dough comes together. Add toasted almonds and mix until just incorporated."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out on a lightly floured surface and shape dough into a 3x14-inch log. Transfer log to prepared baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until firm to the touch, 30 to 40 minutes. Allow log to cool on a wire rack for 10 minutes. Transfer log to a cutting board and cut into 1/2-inch thick slices, using a serrated knife. Return biscotti slices to baking sheet, cut-side up."
} ,{
"@type": "HowToStep"
,"text": "Return biscotti to the oven and bake until biscotti are firm to the touch, about 20 minutes. Flip each cookie and continue baking until toasted, about 20 minutes more. Cool biscotti completely before storing in an airtight container."
} ]
,"recipeYield": ["28"]
,"totalTime": "PT200M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "longsunrise"
},
"reviewBody": "great recipe. The biscotti comes out nice and firm and holds up well to dunking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Petty"
},
"reviewBody": "Never made biscotti before, thought I’d got it a go only had brown sugar and had make my own baking powder. I didn’t have almond extract and also added lavender. It’s pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Step"
},
"reviewBody": "Meh. I must have mixed it too long or not long enough. The matrix was mealy and not much buttery sugar flavor. I used local black walnuts and that flavor was strong in a good way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debora Elle"
},
"reviewBody": "forgot to take a pic! the dough was super dry and I added some butter and cashew milk to try and change the texture. It was still hard to mold and ended crumbling a lot after baking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Whitney"
},
"reviewBody": "I used half almond flour and half AP flour. I also added a little oil from the top of a jar of almond butter and added orange zest. Super tasty. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hezziilishus"
},
"reviewBody": "I was craving some biscotti a couple of weeks ago and found this recipe... It hit the spot! Just be careful how long you toast it at the end, it can get REALLY hard, but otherwise, I love this!! I've also substituted Orange flavoring for the almond flavoring and added chopped dried cranberries - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "altoturtle"
},
"reviewBody": "I followed the recipe exactly. The biscotti spread out in the oven. They were extremely dry and hard in the end, almost inedible. Cookies need oil or butter for moisture and depth of flavour—these were clearly lacking that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROCKNBOZO"
},
"reviewBody": "These are wonderful. Exactly what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Followed the recipe as written and they were wonderful! A flavorful, crunchy almond biscotti. Definitely will do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie"
},
"reviewBody": "Tried this today as my very first attempt at biscotti. Easy recipe, excellent results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Luke Hunter"
},
"reviewBody": "I liked it but have a few issues with how the recipe is laid out. The first batch really didn't turn out well but the second was much better with these adjustments.\n\n (.(.1.).) First off it may be oven heat (mine could be hotter than 350) but even with a normal oven 8-10 minutes is wayyyy too long for toasting almond slivers. It should be about 3-5 minutes with stirring the almonds about every 1.5 minutes until you smell the toasty aroma when you open the oven.\n\n (.(.2.).) Do not mix the sugar in with the other dry ingredients. Mix sugar/eggs/vanilla&amp;almond extract and then add the sifted dry ingredients in thirds. After each addition mix well until fully comes together. Final dough should be sticky not crumbly (which is why they include the part about shaping with flour).\n\n (.(.3.).) Watch for the bake times. 30-40 is way too long for the first bake in my opinion, I would do 25-30 mins. After cutting the slices I would do 10-12 mins on each side. These should be baked not burnt to death. Again could be my stove running on the hot side but I'm making these in the dead of winter in Minnesota so it's not like there is excess heat in the air.\n\n (.(.4.).) Finally since I'm giving these as a gift, I take a small cup and melt 70% cacao chocolate in the microwave (30 seconds then stir; repeat this 3 -4 times until chocolate is dissolved and runny). I dunk each biscuit in chocolate and let dry on wax paper. Adds a nice elegant touch and balances the sweetness of the almond e"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candace"
},
"reviewBody": "I've tried few to several biscotti recipes so far and found that I prefer the texture of those containing little to no fat. These remind me of ones I like by Trader Joe's and remember that the ingredient list had only eggs and no oil/butter. My first trial batch came out quite hard, though. Compared to other recipes I've seen, this one calls for longer first and second bake times which yielded overly browned and very hard cookies. I also think my oven's a little potent. \n\nBut, I'm not deterred from trying it again with shorter bake times and maybe a slightly lower heat. I hope they'll be perfect with those adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sc B. McKinney"
},
"reviewBody": "Followed recipe exactly and found these to be about the hardest biscotti I have ever had in my entire life even after not only dipping but soaking so I could actually eat them. The flavor was great but I will try one more time because I believe the additional baking time after cutting the pieces is too long. I think I might try about 5 minutes on each cut side and sample to see if I am right. If I am I will comment and rate accordingly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie M."
},
"reviewBody": "This is a great recipe! Not sure why other reviewers are complaining about them being dry...it's biscotti, they're meant for dunking in tea! Mine puffed and toasted perfectly! Great base recipe to mix it up with different add ins. Will definitely use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KrunkyTheKat"
},
"reviewBody": "This recipe was pretty easy, but I thought there were too many almonds. Next time I'll only add half a cup. When they cooled I dipped them in some melted chocolate for an added kick. Years ago I worked in an Italian restaurant and our baker made outstanding biscotti and I've been trying to duplicate his quality ever since then, without success. The flavor of this recipe is okay, but the texture is a bit off, maybe I didn't cook them long enough (followed the directions) but there is an unpleasantly chewy subtext...too many eggs? I'm not going to try a butter-based biscotti recipe because traditionally they aren't made with butter, but for now this recipe will do whenever I get a hankering for biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan scalise"
},
"reviewBody": "Great recipe. Perfect biscotti. I will use this for a base for many different variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GR8DO"
},
"reviewBody": "These are delicious and a true biscotti, perfect for dunking! I've made them as written and also with the addition of orange zest. Great either way! Some reviewers stated they did not get brown. If you want some color to them and you have a convection feature on your oven try this: In the first phase of baking follow directions as written...after cutting turn on your convection bake feature and bake 15-20 per side. You'll achieve a nice light brown color and the results are quite the same!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scootergirl"
},
"reviewBody": "Loved this recipe! I did add about 2 tbs. water and used Spelt for the flour (organic variety of whole wheat). It turned out great with great flavour (yes I'm Canadian).\n\nScootergirl"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "Delicious, very easy. OF COURSE these cookies are dry; they're meant to be that way. Very nice dipped in a hot drink or nibbled on as-is; drizzling some melted chocolate on them is good, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "Let me preface with the fact that I am NOT a cook or baker at all so my talent level is very limited. Made this yesterday and they were very flavorful except mine came out extremely hard. You could break a tooth. If dipped in coffee for a bit naturally it was edible. Looking at other recipes, perhaps it is the butter that makes it more fluffy/softer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dayna V"
},
"reviewBody": "my batter was sticky...used a little more flour to knead. I used 3/4 almonds chopped and a 1/4 cup almond flour. these do not spread at all. I made two blogs, 2 1/2 x 13in. baked for 25 min first and then 15 on the second. they were undercooked on first bake so the texture was off. still tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chico"
},
"reviewBody": "Dont mess with perfection!!!I have done and redone this recipe......always a hit....When a recipe is altered it is no longer the same recipe.???????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Inky"
},
"reviewBody": "Oh my! I don't often leave reviews, but this requires my two cents! This is a FABULOUS recipe. It is easy --and delicious! I am always confused by people who review based on how the changed the recipe. Leave it alone... it needs no changes! Someone mentioned they did not have them \"toast\" in the final baking process and that they were very pale. Mine are a lovely golden color. This is going to be my go-to recipe from here on out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucille Naber"
},
"reviewBody": "made these for my sister she loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LCB"
},
"reviewBody": "I have baked for many years and have made several biscotti recipes. This recipe stumps me. The flavor is terrific however I do not understand why they do not brown at all. If you do not mind the white exterior of the biscotti enjoy the flavor but they are not toasted looing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kel7298"
},
"reviewBody": "I use this recipe as a base to make other flavors as well. Just substitute the sugar with brown sugar, the almonds with walnuts, delete the almond flavoring, then add mini chocolate chips for Chocolate Chip Biscotti. I also sprinkle any that contains chocolate with flaked salt. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SUZIE"
},
"reviewBody": "These are very dry without butter and not as rich. They don't spread when baking so remain 3 inch slices. Great for dipping in your coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "Just finished baking these and they are yummy. I substituted 1 cup of the flour with almond flour which I make from the almond pulp when I make almond milk. I was out of almond extract so used a little rum extract. Can't really tell in the flavor though. I also used brown sugar instead of white and added in some chocolate chips along with the almonds. The house smelled so good it was hard to wait through the second baking. This recipe was really easy. I put it together in between doing other stuff. In my oven it took 50 minutes the first baking. I'll be making this again and use it as a base to try other flavors as well."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232700/crunchy-almond-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
"name": "Nut Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
"name": "Almond Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232700/crunchy-almond-biscotti/",
"name": "Crunchy Almond Biscotti"
}
}
]
}
}
, "about": [
]
}
]