				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Crème Brûlée French Toast"
,"datePublished": "2001-05-10T20:02:38.000-04:00"
,"dateModified": "2022-09-05T12:52:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SANDIPANTS"
,"url": "https://www.allrecipes.com/cook/296522"
}
]
,"description": "A rich crème brûlée French toast casserole that can be made ahead of time using baguette slices or challah for the ultimate brunch treat!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lVEEyjuYMOcrTV2W9WAq1GT77RQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3410-creme-brulee-french-toast-LynnInHK-1x1-1-a21d222a4e274eb0b173e356149e11c8.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2929265634001",
"description": "See how to make a rich, puffy, custardy French toast.",
"duration": "PT2M9S",
"name": "Creme Brulee French Toast",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/1b288992-19f2-46b5-847a-6fdf7cc9a283/73c4f76f-da92-4f64-a2f4-715ea693bdb1/1280x720/match/image.jpg",
"uploadDate": "2021-07-11T21:41:41.823-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Crème Brûlée French Toast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "1038"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "510 kcal"
,"carbohydrateContent": "59 g"
,"cholesterolContent": "218 mg"
,"fiberContent": "1 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "359 mg"
,"sugarContent": "39 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.5 cup unsalted butter",
"1 cup packed brown sugar",
"2 tablespoons corn syrup",
"6 (1-inch thick) slices French bread",
"5 large eggs",
"1.5 cups half-and-half cream",
"1 teaspoon vanilla extract",
"1 teaspoon brandy-based orange liqueur (such as Grand Marnier®)",
"0.25 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a small saucepan over medium heat. Add brown sugar and corn syrup; stir until sugar is dissolved. Pour into a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Remove crusts from bread and arrange in the baking dish in a single layer. Whisk eggs, half and half, vanilla, brandy, and salt together in a bowl. Pour over the bread. Cover and chill at least 8 hours, or overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Meanwhile, remove the dish from the refrigerator and bring to room temperature."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lVEEyjuYMOcrTV2W9WAq1GT77RQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3410-creme-brulee-french-toast-LynnInHK-1x1-1-a21d222a4e274eb0b173e356149e11c8.jpg"
}
]
,"text": "Bake, uncovered, in the preheated oven until puffed and lightly browned, 35 to 40 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT540M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this so many times and it is so good that I get depressed when it's almost gone. The only problem is that it is probably not the healthiest thing to eat if you have clogged carotid arteries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Moore"
},
"reviewBody": "I absolutely love making this recipe. I was never a fan of French toast until I tried this recipe out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this french toast for years and it is always a hit. I use french bread and cut it into cubes. I always make sure to bring it to room temp before I bake it off. I also put the brown sugar mixture on the top of it before I put it in the oven. It turns out great each time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Pillow- Moley"
},
"reviewBody": "I make this for breakfast events and it's always a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edgar Ortiz"
},
"reviewBody": "I used Sara Lee brioche slice bread Substitute Grand Marnier with pure orange extract"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used brioche bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not really french toast imo. This is a casserole.... I make mine by making normal french toast, topping with custard and then caramelized sugar shards... This is more accurate to creme brulee and french toast. Sorry... not sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aizausa20"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is to die for. I make it every year for Christmas Brunch and it’s a huge hit! You won’t be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Jones"
},
"reviewBody": "I make a new French toast casserole every Christmas morning. This may be my keeper. The consistency was just to my liking (I followed the recipe exactly). Sometimes these casseroles just don’t cook all the way through, and you get a soggy bread effect that’s just...ew. Pleasantly surprised at the nice chewy mouth feel that permeated the entire dish. Didn’t need syrup either, because it was so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Diaz"
},
"reviewBody": "I love this - it is PERFECT for Christmas morning breakfast!! I set it to bake as we open gifts. I use challah bread and I cut them into chunks instead of slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candydiva04"
},
"reviewBody": "I made this for Christmas breakfast this year and it was a huge hit with the adults. My kids are picky and don't \"like\" new foods the 1st time they try them. Even my typically low sugar, plant based, super clean eating husband went back for seconds! I made the recipe as directed. The only things I did differently were to use store bought brioche, and sub OJ for the alcohol, and sprinkle cinnamon and dried orange peel on top before I marinated it. After cooking (i cut the crusts so it was all congealed together into one huge piece of French toast),we flipped it over when to broil the sugar. I also used dark brown sugar and a mix of dark and light corn syrup. Not too sweet, not too eggy and it tasted like creme Brulee. This is our new Christmas breakfast tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flem217"
},
"reviewBody": "I’ve been making this for Christmas morning breakfast and holiday potlucks at work for almost 15 years. I don’t change a thing, other than maybe being too tired to bother cutting the crust off. Every holiday I get an email from one of my current or previous coworkers asking for “my” French toast recipe. I always laugh, remind them it’s not mine, and forward them the link to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Marie Vierra Rippee"
},
"reviewBody": "I have made this for about 20 years now. Substitute any kind of thick bread with crust. Hawaiian bread, Jewish hallah bread (I probably spelled that wrong) or french bread and potato bread. With regular butter or unsalted. It’s delicious and super easy!!! Makes Christmas, Mother’s Day or Easter brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j. cook"
},
"reviewBody": "Superb!!!! Used French baguettes as that’s what the store had. Sliced pretty thick to avoid the it being too “eggy”. It was essential to coat both sides and soak thoroughly before baking. I did add cinnamon. Thanks for a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Creme Brulee French Toast by Sandipants. 'Decreased sugar to 3/4c. 'Subbed Gran Marnier w a half t orange extract; subtle, yet effective. Greased the dish &amp; left crust on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "Loved it! Did not refrigerate prior to baking . Took 1 hour to\nbake properly. Did not add orange liquor but did sprinkle cinnamon on top prior to baking ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahna Parlette"
},
"reviewBody": "Honestly this recipe is so easy to make and it came out absolutely perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Worozilcak"
},
"reviewBody": "I’ve been making this for 35 years, we just call it Brunch French Toast. Add sliced Granny Smith apple on top of sugar/butter mixture, then bread. I’ve learned that a baguette works out best for a crowd. 2 slices make a serving. We are a family of 10 and I make two of these for brunch. Leftovers If any, go home with them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcus Cox"
},
"reviewBody": "Dish turned out great! I made it for my wife for Mother’s Day! She said it was restaurant quality. I added an apple and peach brandy compote on top, really took it to the next level!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker78"
},
"reviewBody": "It was easy to do and turned out great. I went with 5 eggs since we like custard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikole Greene"
},
"reviewBody": "This recipe is amazing. My family devours it in one setting! I substitute the bread with Challah bread. it adds more flavor and texture to an already delicious recipe. I also add in cinnamon, nutmeg and orange zest. Otherwise, the recipe is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOREA"
},
"reviewBody": "Delicious! Can’t eat more than one (rich), so plan accordingly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "edg"
},
"reviewBody": "Always looking for a new flavor profile for a do ahead, baked french toast. This was delish.!!! My substitutions, sugar beet syrup instead of corn syrup because I had it, another egg and a bit more milk was going for more custard. Love doing these in a clear glass baking dish, the eye appeal is awesome even before the aroma rises."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "This is amazing, I like to use Pepperidge farm French toast bread in this recipe. After it bakes I flip it out upside down on to a cookie sheet and broil them for an amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KyoBiscuitKitty"
},
"reviewBody": "Turned out great. Made it for Valentine's weekend breakfast. Must be using baguette slices in the video though. Six slices of full size French loaf wouldn't fit in the 9x13. It held four but that was plenty. Recipe says remove the crust, video says leave it on. I left it on and it came out beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Very good, and easy to prepare. I added a little extra Gran Marnier and used four eggs based on other reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yuchie"
},
"reviewBody": "Excellent recipe and it is SO easy!! I made it for brunch and it was a huge hit. I didn't have half &amp; Half so I used the Heavy Cream I had on hand. I omitted the liqueur because I didn't have that either. Used maple syrup instead of corn syrup and reduced the brown sugar to 3/4 cup and it was plenty sweet at that. Also only used 4 eggs. You can't go wrong with all the delicious ingredients - I added cinnamon on top and it was amazing. Next time, I will add cinnamon to the mixture and broil it like others said or even try to pan fry it to get a harder crunch on the outside. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "euro-d"
},
"reviewBody": "it was delicious and so freakn easy to make too!\nbit more sugar than what I'm accustom to so will make it again with less.\ninstead of brandy I chose to use Port wine. ;)\nevery one that has tried it has loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karriv"
},
"reviewBody": "Amazing orange custard flavor with crisp brown sugar glaze topping if you flip it over and broil on low for a few minutes as suggested by others. I only had Texas toast so we can’t wait to try it with a rustic bread or croissant! I went heavy with the Grand Marnier and used the zest of an orange. We served it with extra thick cut bacon and Raspberry Blood Oranges. Perfect Birthday in Bed Breakfast! My hubby said it was best French toast he’s ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WISEREADER"
},
"reviewBody": "A staple in our house for any holiday brunch. Super easy, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksb"
},
"reviewBody": "I made no changes to the recipe presented and it was absolutely delicious. The 1st time I used dark brown sugar and the 2nd time we made it with light brown sugar. The dark brown sugar, in my opinion, is the way to go. Both tasted really wonderful but the dark brown makes a better presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Birkner Brown"
},
"reviewBody": "Absolutely amazing. Our family finished the whole pan and wanted more! I followed the recipe with these exceptions: used a whole loaf of French bread except the very ends, did not remove the crusts. I used 1 tablespoon of vanilla, and 1 tablespoon of Grand Marnier. This was a mistake on my part, but it tasted great, so no regrets! I refrigerated overnight, then let it come to room temperature in the morning while getting ready. I did sprinkle cinnamon on the bread before placing in the oven. I will do this recipe again, with the same methods, as this was fantastic! Definitely my standard go to for brunch for every holiday. I plan on making this again for New Years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jose Roman"
},
"reviewBody": "I made a Christmas variation of this using Italian panettone (the short wider one) and used 3 eggs and a third of a cup or egg substitute also used maple instead of corn syrup and sprinkled some cinnamon and nutmeg on it. It came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Heffner"
},
"reviewBody": "Everyone loved this! I made almost exact to the recipe, except used 3/4 cup of brown sugar as suggested and was generous with the liquor and vanilla. I also turned the temp up to 450 F for the last 3-4 minutes. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Singelakis-Bandy"
},
"reviewBody": "This is a family favorite, especially during the holidays!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yayaski"
},
"reviewBody": "It is tasty but I will only cut the bread 1\" thick next time and I will soak them first in the batter on both sides to evenly absorb. I had to freeze them for a few days but that wasn't a problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rach"
},
"reviewBody": "Made this and let it sit overnight in the refrigerator for guests that were coming over the next morning. It was so easy to make and they loved it! I did reduce the egg and half and half as other reviewers suggested, also added a bit of cinnamon. It was definitely sweet, but that was pretty obvious from the ingredients list. My company said it was like getting the center of a cinnamon roll with each bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WARREN4"
},
"reviewBody": "I used orange juice concentrate instead of orange brandy; otherwise the same. Great taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tom Bell"
},
"reviewBody": "Wonderful! I realize that it can be an advantage to prepare something like this in advance such as the night before, but I have made this twice now on the spur of the moment with very little soak time and it turn out amazing. As with some others I changed the corn syrup to maple syrup and cut down the sugar to 3/4 cup and think that I will try 1/2 cup next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Donna Powell"
},
"reviewBody": "Been wanting to make this for months.. Finally got around to it and this dish did not have a creme brulee taste at all. I read so many reviews and incorporated what I thought would be good. I used maple syrup in place of the corn syrup and orange extract in place of the Grand Marnier as some suggested and it was waayyyy to \"orangey\". The brown sugar/butter mixture was gloppy and did not pour easily into the pan. I did use 2 day old french bread which made a nice thick piece of French toast. I also did not make ahead. I used 4 eggs which worked just fine.. I added banana slices when serving this to my boys (9 and 14) and they did say it was good (but this was after I added more of the brown sugar mixture on top). We also used more maple syrup. Overall, this dish tasted nothing like Creme Brulee. Next time: no orange flavored anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine1026"
},
"reviewBody": "Second year I have made this for Mother’s Day. I had to double the recipe in order to make enough. I used 8 eggs because I didn’t want it to be eggy. I also decided to add a bit a cinnamon sprinkled all over. Instead of using the French bread from the bakery, I decided to buy panifique which I feel was way better (also got better reviews) I prefer to leave the crust. At the end, like most suggested, I did broil it. The few that had it the year before, said it was way better this time around. Good luck"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey Richards"
},
"reviewBody": "Made it just as the recipe states. Excellent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan T-O"
},
"reviewBody": "Made this with sourdough French bread &amp; replaced the corn syrup with maple syrup since that's what was in the fridge. So yummy, and sweet enough that there was no need to put more syrup on the finished toast (although we did top it with some fresh raspberries). Loved it, will be making it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Ruhstorfer"
},
"reviewBody": "Made one change, and it was still amazing! My store was out of French Bread, so I ended up using texas toast. The entire family asked me to make it again. So it looks like I'm going to have to double the recipe for the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Newsom"
},
"reviewBody": "Made it and took it to work. I had to substitute a tsp each of orange and brandy extracts for the liqueur and it worked amazingly well. I also sprinkled cinnamon on top before placing in the refrigerator. Will definitely make it again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Randleman"
},
"reviewBody": "Sweet, &amp; gooey. Definitely need no syrup with this recipe. Tasty but sweet. Temper with something salty or savory. Worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veras kitchen"
},
"reviewBody": "The family loves this recipe! Creme Brulee for breakfast. I love that it’s something I can make the night before and just throw in the oven on busy holiday mornings. If you want a dish that ensures your adult children will be on time for brunch...this is it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "This is so good. I followed other reviewers advice. I flipped half way through cooking. My husband thinks I am Julia Child."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Love this recipe! I’ve made it several times. I always use challah bread and it’s wonderful! No need to cut off crusts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy, P&C Mom"
},
"reviewBody": "Made per the recipe, except for subbing maple syrup for the corn syrup, which was a good call. Didn't flip halfway through cooking, and definitely should have. Ended up with a tasty, but eggy slop on the bottom. Was very easy, and would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Pister"
},
"reviewBody": "I’ve made this for Xmas morning the last five years.\nEveryone loves it, and the aroma is intoxicating in the house.\nI serve it wuth fresh fruit and it’s wonderful.\n\nMake sure you refrigerate overnight so the flavors marry.\n."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Sweeney"
},
"reviewBody": "I made this for an after Thanksgiving breakfast and it was really excellent. I made exactly to the recipe but found the cooking time was considerably longer than called for, even in my convection oven. Still, this is a recipe the whole family loved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandma toni"
},
"reviewBody": "This is a GREAT breakfast dish! I've made it several times, however, the most recent time I used Challah bread from Publix, it was the best yet!! I tweaked the recipe a little. Make it the night before, spray baking dish with PAM, use 6 eggs, Challah bread, and 1 tablespoon of grand marnier. Once it's ready flip the dish onto a serving platter so all the gooey good stuff is on top, delicious!,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Hicks"
},
"reviewBody": "Added cream cheese during last 10 minutes or so of baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Jane McGuire"
},
"reviewBody": "I probably will not make it again. I like my French toast more crisp. The flavor was good. Might try some variation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbesc"
},
"reviewBody": "This recipe is loved by my whole family. Instead of one layer of bread, I used two layers of sour dough bread with crust. I poured half of the egg mixture over the first layer of bread, sprinkled it with cinnamon and then added second layer of bread and poured the rest of egg mixture over it and then again sprinkled cinnamon on the bread. This way all the egg mixture is absorbed by the two layers of bread and was not custard like as some have described. Plus there is more yummy to eat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moonflower1313"
},
"reviewBody": "Great recipe! Delish and relatively easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "carol"
},
"reviewBody": "Didn't like it too soggy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dina Glasser"
},
"reviewBody": "Followed the recipe with no changes. It was delicious ans everyone loved it. Especially my spouse who i not a big fan of sweet things. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph"
},
"reviewBody": "I made no changes, but I may in the future, as I will be making this regularly!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dudette79"
},
"reviewBody": "Very simple to prepare and received lots of compliments. I will be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Cutlipp"
},
"reviewBody": "I made this for my \"Toast and Theology\" breakfast and Bible Study. I made one change and used frozen OJ concentrate (2 tbls) instead of Triple Sec. I hah some left over so I took it to the Police/Fire Dept. The Chief told me later that \"it was Heavenly.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHol"
},
"reviewBody": "Love this French toast! I always make it the night before so it is super easy the next day. Everyone always raves about it and wants me to make it for every brunch event. I do use challah bread instead of French since it is denser and I think that really helps it hold up with in the egg mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Gillespie"
},
"reviewBody": "Only put a half a cup of brown sugar no corn syrup no salt a teaspoon of orange zest and a half a teaspoon orange concentrate and everything else the way it says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foodyjane"
},
"reviewBody": "I didn’t have 1” thick French bread, nor could I find any that wasn’t already sliced at my local Kroger, so I used a loaf that was pre sliced and squeezed 7 slices into the pan. With less bread, the mixtures of wet ingredients were so sweet that my family all stopped eating at or before 2 slices and normally they love sweet food. The flavor is delicious and the recipe as is is very decadent! The bread remained soggy after 40 min of cooking but my guess is that thicker slices would have helped. I decided it would be nice to do the work ahead of time and just cook in the oven as this recipe states because mornings are hectic in my house with 2 kids and some days 2 adults rushing off to drop kids and get to work. Pleasantly surprised by the flavor, will either use less sweet ingredients next time or thicker bread. Perhaps both. And I had read some reviews and since I never use corn syrup I used maple syrup instead. Plenty delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marcoSuzi"
},
"reviewBody": "I made this according to direction, EXCEPT, since this was a brunch for adults only, I added white rum instead of the other liquids. Gave it a slightly different taste, but, I did make 2x as much and there was nothing left! Great recipe! Will definitely make this again, but thinking that orange liquor would go as well, as long as no children are b\neing served the same portions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn Watts"
},
"reviewBody": "The recipe was changed so much in the video. Crust on, crust off. Orange zest and maple syrup, but no corn syrup. . \nThis is really 2 different recipes from written vs. video. \nTrying to find orange brandy was not easy. Grand marnier is really cognac. Found Apple, pineapple and peach brandy, but no orange. \nGrand Marnier better be on you liquor shelf already or get ready for extreme sticker shock. Miniature came in handy at $6.00. That will make about 4 batches. \nOk so I made it with part of the crust cut off, the size dish called for hold 8 slices easily. \nI only use salted butter in my home, so I just omitted the 1/4t. salt, called for. \nSprinkled with conf. sugar and cinnamon when served. \nNot bad. Family liked it as a change from regular French toast. \nIt was good and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilou"
},
"reviewBody": "Happened to see this recipe &amp; happy I did. We had it this morning &amp; it was wonderful. I saw a couple of reviews that made me use 3/4 cup of brown sugar &amp; Maple syrup instead of corn syrup. Also used 2 tsp of Orange Liquor instead of 1 tsp.\nIt turned out GREAT. My husband liked it too, which for him is sometimes unusual. Will make it again. Marilou"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lou Lombardi"
},
"reviewBody": "No changes made to the recipe. Family loved it. Will make it again. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norma Tamez"
},
"reviewBody": "This was a relatively easy recipe with good results. The recipe states to remove the French bread crust but the video shows otherwise. So I didn’t know which way to go so I left crust on. It was very good but it was a bit tough on the crusty edges. The recipe does not say to serve it by flipping it over and it should cuz it looks very moist with a sugary layer resembling maple syrup . Otherwise the top is quite dry and crusty looking. Flavor was wonderful. However I may add a little cinnamon to the egg batter and pecans to the brown sugar layer before pouring the Egg Batter over the bread. But it was excellent Without any changes. I like to always prepare a recipe as stated then make the necesssry changes to accommodate my families likings. I topped it with sliced Bananas and almonds. And there was no need for maple syrup if you flip when you serve. My husband dubbed it a Vegas Breakfast. I will make this for guests next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Nicholson"
},
"reviewBody": "Yummy! This is a hit...everyone wanted seconds. Easy to make too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billmessinger"
},
"reviewBody": "Made this for Mother's Day breakfast, everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim VanSant"
},
"reviewBody": "No changes,will make again. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moesweets"
},
"reviewBody": "I’m so happy that I tried this, it was GREAT. After reading other reviews, I used 4 eggs, added some cinnamon, and nutmeg. I also baked it a little longer than suggested and I was extremely pleased."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maricar4"
},
"reviewBody": "I filled the Recipe therefore no changes were made. \nYes, I will make it against n.\nThank You"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abbey"
},
"reviewBody": "This was a success at a Mother’s Day brunch— however I want to caveat upfront that my rating is based on suggested modifications I made, not the original recipe. I made the caramel exactly as stated in the posted recipe. I used about 3/4 of a loaf of challah cut in thick (1 inch+) slices. I cut the slices in smaller pieces to fit more in my 13x19 casserole dish and to make easier for serving a large crowd. \n\nFor the custard, I used the recipe but added orange zest as recommended by another reviewer. Since many reviewers noted it was too eggy, I slowly added the custard until the bread was thoroughly moistened. That was about 2/3 of the custard. I covered the dish and refrigerated overnight but reserved the rest of the custard separately. The next day, I added a few more spoonfuls of the custard over the bread before baking for 45 minutes. It was PERFECT!! Next time I make this, I would probably reduce to 3 eggs and 1 cup of half &amp; half. Overall, an excellent combo of flavors and no need for extra syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian M."
},
"reviewBody": "I found this recipe on All-Recipes years ago and have made it oodles of times for special days. Everyone loves it! It's absolutely scrumptious! I may try some of the suggestions I see here just to lower the nutritional cost. Oh, but it's so good as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "Why would anyone say it was \"too custardy\" when that's what cream brulee is! We loved it as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat"
},
"reviewBody": "I made following recipe using Trader Joes Brioche bread. Baked for 35 minutes and flipped when done and did a low broil on the lower rack for a few minutes. I did sprinkle cinnamon before baking. Got to room temp before baking. It is sweet but good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Mowbray"
},
"reviewBody": "Excellent recipe. It was a hit at our brunch for 15. I wouldn't change a thing, and didn't change anything. Some reviewers suggested flipping the French Toast but it looked awful, so I put it back. There was a lovely sauce under the toast - and the toast didn't harden on the bottom as a least one reviewer said was a problem. I'll be making this again. Thanks to the poster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "I used 8 slices of french bread, as that was required to fill the pan. Delicious and my mom and I would have eaten the whole pan together by ourselves if we hadn't restrained ourselves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FoodisGood"
},
"reviewBody": "Made this for brunch and everyone loved it! After reading the reviews I subbed maple syrup for the corn syrup, used 4 eggs, used 3/4 c of brown sugar, added cinnamon to the top, and flipped the toast over half way through bake time. I have to say I would have preferred a little more liquid because it was just a tad dry but that could have been because I used dense challah bread. Will definitely make again and adjust the liquid next time,."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kw20147"
},
"reviewBody": "This was easy to make. I read reviews on this so I made a few modifications; used 4 eggs, used lactose free milk, added extra teaspoon of Grand Marnier. I let this set overnight. Popped it on the oven without bringing it to room temperature and it was fine. I sprinkled cinnamon on top before baking. It was prefect for my family. No leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XMilfyx"
},
"reviewBody": "OMG....you must try this!! Thanks for the recipe because now it's part of our family tradition!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri D"
},
"reviewBody": "Amazing French Toast recipe! I started out with a local bakery country French bread, quite dense and delicious. Although this recipe would have been great as is, the toast became exceptional with double the Grand Marnier and more vanilla. Also, once the French toast was almost finished, I removed it from the oven, carefully lifted each piece from the dish and quickly fried in butter on the non-caramel side only for a golden finish. Remarkable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Falklian"
},
"reviewBody": "The flavors were amazing, but I wasn't a huge fan of the texture. More like bread pudding than french toast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "I made it but I did change the brown sugar amount to 1/2cup and the corn syrup to a little less than 2 tbsp. I also cut more than 5 slices of bread. Baguette is the best and do cut off at least half the amount of crust and I arranged it in a 9\" x 13 glass casserole dish and covered it with saran wrap. I also spooned the egg mixture over the bread about an hour or so after I placed it in the refrigerator. In the morning, I sprinkled cinnamon over the top of the bread and baked it for 25 mins. Very good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DePere Nancy"
},
"reviewBody": "I made only one change. I used brioche bread. Next time I would substitute maple syrup also. I loved the recipe and will make again. I had a little trouble with the caramel bottom. It became quite stiff and gooey when I tried to serve it. Maybe that's just what's supposed to happen. I'm going to try again because the taste was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene Anderson"
},
"reviewBody": "This is so decadent! Wonderful for company brunch. Soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "I added a bit of nutmeg and cinnamon to milk mixture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "I have made this for every Thanksgiving, Christmas and Easter morning breakfast for the past five years as well as any other occasion when I am serving brunch. Prepping the night before and only having to pop it into the oven makes it even better. The only change is that I use Panettone for the holidays and regular French bread during the summer. Everyone raves and I have passed the recipe on to a number of people. Not for calorie counters though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreen"
},
"reviewBody": "Yummy! Made a 9x9 pan since we are a small family. Reduced quantities (3 eggs, 1 cup milk, 1/2 cup brown sugar, etc.), also, as suggested in other reviews, used maple syrup and orange extract. Don't forget to flip the slices before putting in oven, which also adds some of the caramel to the 'top'."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "diane703"
},
"reviewBody": "Pretty much just a glorified version of Grandma's bread pudding. Nothing revolutionary there nor would I call it \"French Toast\". But as a bread pudding variation? I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "Quick and easy to prepare, and delicious! I used brioche and left the crusts on. Next time I may add toasted pecans!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Cairo"
},
"reviewBody": "Always a favorite in our house. I like to impress guests with this too. I leave out the orange flavoring, but that's the only change I make. anyone commenting about the custard consistency being unfavorable, obviously does not know what creme brulee is, js."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spence3787"
},
"reviewBody": "Wow - great - also omitted the corn syrup - plenty rich and sweet as is - adding Saigon Cinnamon about 3 tsp helps. Also took the suggestion of inverting when serving since it looks great upside down. To accomplish this, I used round pyrex pie plates and cut the bread to fit - one plate serves 3-4 . Just carefully loosen the toast around the corners and flip onto dinner plates (too hot to use a plate on top and flip) - also used my challah baked in a loaf pan. Any flavored liqueur works. Some topped with berries, whipped topping, powdered sugar but adding too much extra sweet stuff is not my preference and the caramelized crust makes a great presentation"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy McKay"
},
"reviewBody": "we all liked this recipe turned out perfectly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle Patching"
},
"reviewBody": "I've made recipe several times &amp; it's always received with great raves! Orange flavoured brandy isn't something I always have on hand, so I use sherry - it's excellent with raisin cinnamon bread too!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/35255/creme-brulee-french-toast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
"name": "French Toast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/35255/creme-brulee-french-toast/",
"name": "Crème Brûlée French Toast"
}
}
]
}
}
, "about": [
]
}
]