				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Curried Butternut Squash and Pear Soup"
,"datePublished": "2020-06-18T23:39:05.000-04:00"
,"dateModified": "2022-02-23T14:36:52.000-05:00"
,"author": [
{"@type": "Person"
,"name": "blancdeblanc"
,"url": "https://www.allrecipes.com/cook/frazzled-pan"
}
]
,"description": "My family loves this creamy and satisfying soup with the comforting flavors of butternut squash and curry. Serve topped with frizzled onions."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Om6BlT0lY4pGLJ053IvjCLQtFgc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5398264-f06d1fa3da3642a0a88562c9e8bb39b0.jpg",
"height": 844,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Curried Butternut Squash and Pear Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "526"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "169 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "20 mg"
,"fiberContent": "7 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "888 mg"
,"sugarContent": "9 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (2 pound) butternut squash",
"3 tablespoons unsalted butter",
"1 onion, diced",
"2 cloves garlic, minced",
"2 teaspoons minced fresh ginger root",
"1 tablespoon curry powder",
"1 teaspoon salt",
"4 cups reduced sodium chicken broth",
"2 firm ripe Bartlett pears, peeled, cored, and cut into 1 inch dice",
"0.5 cup half and half" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Cut squash in half lengthwise; discard seeds and membrane. Place squash halves, cut sides down, on the prepared baking sheet. Roast in preheated oven until very soft, about 45 minutes. Scoop the pulp from the peel, and reserve."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a large soup pot over medium heat. Stir in the onion, garlic, ginger, curry powder, and salt. Cook and stir until the onion is soft, about 10 minutes. Pour the chicken broth into the pot, and bring to a boil. Stir in the pears and the reserved squash, and simmer until the pears are very soft, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender. Puree in batches until smooth. Return the soup to the pot, stir in the half and half, and reheat."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mzw"
},
"reviewBody": "I made this exactly as instructed. I make several butternut squash soups, and never add milk or cream to keep the calories down. But I added half and half this time, and it makes a huge difference. It is very creamy and very filling. The curry is not overpowering and the pear/ginger somehow are just enough sweetness to balance the curry, without it tasting more like a recipe that has apples and cinnamon etc. We LOVE this recipe. It is simple and now it is my favorite butternut squash soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelli griffin"
},
"reviewBody": "I make this soup regularly now, it's so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMP"
},
"reviewBody": "Made exactly as directed - but added crumbles Italian spicy and sweet sausage at tend - AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bprime1982"
},
"reviewBody": "Amazing recipe for main course, or as an appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D'Anne Avotins"
},
"reviewBody": "This was the best butternut squash soup I've ever made and I make that soup a lot! the curry plus the pear.... outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindabob"
},
"reviewBody": "Made this soup many times and it is always different as I add the different spices mentioned in a few of the reviews. Also I put all ingredients in a slow cooker and double the recipe. So much easier. Add the coconut milk or cream at the end after the puree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PenT"
},
"reviewBody": "I have tried many recipes, but this one was by far my favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raechael"
},
"reviewBody": "Delicious! I love this soup. Healthy, filling, and delicious. Cant beat that! Great recipe! So glad I tried this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I love the flavors in this recipe. I made it exactly as described and it was delicious. I actually tripled the batch to freeze the leftovers for later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina0017"
},
"reviewBody": "Absolutely delicious! The only thing I changed was I substituted onion powder for onions (because I didn't have any) &amp; garam masala for curry powder (because I didn't have that either). I also added some cayenne powder for a lovely kick and omitted the half &amp; half and the soup was more than filling! Was hesitant about adding pears but they were a tasty addition that countered the heat. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "IMy family loves this recipe and Ioften cook it in a crock pot. I still roast the butternut squash to add flavor. I also add a can of coconut milk instead of 1/2 and 1/2. This one is a real keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Howe"
},
"reviewBody": "Added roast pumpkin to the butternut squash and pears"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeeBee"
},
"reviewBody": "This is a family favorite. My in-laws, husband &amp; I love love love it. When we make it at home we use coconut milk in place of the half &amp; half. In some cases we add an extra pear. We also started using the frozen ginger cubes (3) with extra curry to taste. That being said the recipe is still absolutely delicious in its true form as it is listed in her recipe. Thank you so much for sharing this oh so good soup recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maurice Genereux"
},
"reviewBody": "the curry is subtle and nicely complements the pear and butternut squash....delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RobinEllen"
},
"reviewBody": "My favorite! I don't use half and half. It's creamy enough without it. Great to freeze and share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roxythegoddess"
},
"reviewBody": "I loved it, my boyfriend loved it, and I'm making it again for sure! I used homemade vegetable stock in place of chicken broth, and I used unsweetened almond milk in place of the half-and-half , but it still turned out very flavorful, rich, and super creamy. The spices and flavour profile are on point - thanks for the great recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rolande"
},
"reviewBody": "Although I had to make substitutions (pumpkin instead of squash), plain yogurt instead of cream) , this was the kind of soup I was after. Hearty, creamy, and with refreshing ideas for ingredients and combinations . It opens up another healthy way to eat more plant based foods. The best part is my husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mesch"
},
"reviewBody": "Really loved the flavors in this. I used frozen cubed butternut squash that I roasted for a bit in the oven for 30 min at 350 degrees. I added 1/2 tsp of cloves. I left on the pear skins. We will definately make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Love this! Double the curry powder and add blue cheese crumbles on top and amazing. Freezes well too. I use immersion blender and much less hazardous than the blender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brini"
},
"reviewBody": "Delicious! Used coconut milk instead of half n half. Freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alysse"
},
"reviewBody": "Holy *bleep* this soup is amazing. If you like curry and squash, you will like this and must make it immediately. Slight alterations - I added garam masala along with the curry powder (don't skip the garam masala, those flavors go perfectly with squash and pear) and I used a can of coconut milk rather than half and half to make it more like curry. I also got a little creative and cubed up a slice of naan and fried it in some butter to make croutnaans. Do it. Do it all. Now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandra4384"
},
"reviewBody": "This is the best, crowd pleasing, easy to make, soup. we make this over and over again. I just use 1tsp dried ground ginger instead of fresh, it's way easier. Sometimes I'll add an extra pear or two in there as I live the sweet taste it adds. I'm more sensitive than most to spicy stuff so I cut way down on the curry powder and add like 2 tbsp of paprika. I've used 5% cream when I don't have half and half and it's just the same. It's also way easier to just use an immersion blender and just blend it up in the pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Heywood"
},
"reviewBody": "The blend of the ingredients is creamy enough. I did not add the cream and my family loved it. The best soup ever dad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "exartizoimages"
},
"reviewBody": "Made this for the first time, excellent! I forgot the half and half but I don't think it could make it any better than it is.\nDefinitely a keeper! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie "
},
"reviewBody": "THis is by far one of the best soups ever. I make it about a dozen times every fall. I now use coconut oil to sauté for the extra flavour and a ton of ginger, probably a quarter cup of it. I use 1 1/2 times the recipe for the average supermarket squash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Delicious. I microwaved the squash because it’s faster and halved the curry since I was afraid it would be too strong. What I great fall soup. Enjoyed by everyone"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "haf"
},
"reviewBody": "First, I made three times the recipe because our limited pear harvest was only 9 pears. Second, I added a tad of cayenne and some mace. Third, I cooked Half the recipe with half and half and the other half of the recipe with coconut milk. And lastly, it was great. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra53"
},
"reviewBody": "Delicious...I added half and half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tellie Kruger"
},
"reviewBody": "Absolutely amazing recipe! This is my family's favorite soup, even my 3 year old requests it We eat it with warm Naan bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wileykyotesupergenius"
},
"reviewBody": "I didn't have curry on hand, but it turned out lovely! I will double the batch next time I make it so I have some for another day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Bauermeister"
},
"reviewBody": "I made it exactly as the recipe stated and it's amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "Awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabella Bear"
},
"reviewBody": "Oh yummy, I used soy creamer instead of half and half and it was very good. Perfect time of the year since all the squashes are starting to come in, fresh butternut and crisp pears, great combination,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "10.20.16 Didn’t frizzle any onions, but I wouldn’t change a thing in this recipe. What the curry powder and pear bring to this soup is almost beyond words. I had part of a butternut squash already cut up, so I just cubed the rest, drizzled a little olive oil over it, and baked for about 30 minutes in the 350°F oven. Don’t even bother looking at another recipe for butternut squash soup because this one's the Superstar (and I’m tried a number of recipes, too). So glad I’ve found this recipe, only wish I’d found it sooner! ******5.14.18 UPDATE: This has become my favorite soup ever, seriously belongs in the “Hall of Fame.” I’ve made it so many times that I’ve lost count, and rarely, will you find my freezer without a container of it. I let my pears get REALLY ripe (scary ripe I suppose) until they’re super sweet. I don’t even peel them anymore, just core, chop, and into the pot. Don’t think I’ve ever served to anybody who has not asked for the recipe. It’s savory, sweet, and has just enough of a hint of curry powder (I use Madras) that you know it’s a really different butternut squash soup. Can’t say enough good things about this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Lemon"
},
"reviewBody": "I made this exactly as the recipe was written. It was great, tasted like restaurant soup. It did have a sweet flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FloridaFun"
},
"reviewBody": "Made it exactly as stated &amp; it was wonderful. The second time I made it I added wild rice as my hubby likes rice in soup. I added few dots of sour cream and red chile paste for color and some sunflower seeds for crunch. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JessicaD"
},
"reviewBody": "Iv'e made this recipe twice, once with pears and once with apples. As is, it's a 4 star, with apples it's a 5 star recipe! I think the apples provide the perfect amount of tartness and flavour that pears are lacking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "puerca83"
},
"reviewBody": "Absolutely delectable! Definitely keep the curry powder in the recipe as this really makes it! Made this for Christmas dinner and it got raves. I followed the recipe pretty closely, except I was trying to use up the fresh pears around my house, so I put in 4 pears instead of just 2. I also put in a full stick of butter to make the soup more creamy with the additional fruit and about 1 extra cup of whole milk in addition to the cream. If you have an immersion blender, use that to puree the soup to save on mess and get it extra smooth. Added lots of ground black pepper to taste and served topped with savory croutons. SO DELICIOUS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeff2001"
},
"reviewBody": "Made with one apple instead of pears and use olive oil (,instead of the butter) for sauteing the onions. Omitted the 1/2 and 1/2. Used 8 cups of low salt chicken stock. Excellent and very healthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Richards"
},
"reviewBody": "I didn't have half &amp; half so I used canned coconut milk. It was good, could have used a little more spice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasper byte"
},
"reviewBody": "Great ingredients! I made mine Vegan, coconut oil and coconut milk, added the cinnamon and nutmeg like someone suggested and it did make it a 6 star recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathrine Watson"
},
"reviewBody": "Love this soup. \nI omitted the cream. \nInstead of onion I used one leek. \ninstead of 2 pears I used 3. \nI would like to know the nutritional values here and I don't know or can't see the link. Anyone?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosalba DeBenedictis"
},
"reviewBody": "I love the concept of butternut squash combined with onion, garlic and I used three pears! I did cut back on the amount of curry one teaspoon is more than enough and added a dash of nutmeg, cinnamon and cayenne pepper. Pots on the stovetop as I type this review and I know I’ll love it more to come!!! I also used my stick blender to purée right in the soup pot make clean up much easier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita"
},
"reviewBody": "don't change anything in this recipe. It's perfect as it is. I did use hot curry from Penzy's and it was spectacular!! Added crunchy garlic croutons on top.... The best butternut squash soup I have made:) try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUNISIANSWIFE"
},
"reviewBody": "delicious. easy to prepare. the key is the roasting of the squash. I also roasted the onion and garlic. I only added a tad more curry powder out of personal preference, some black pepper, and a bit of cilantro. didn't use the heavy cream; only used a bit of fat free half &amp; half. Love this topped with a dollop of greek yogurt. Very comforting. I think next time I will leave some chunks of pear; otherwise the flavor of the pear gets a bit lost in the soup. thanks for this super easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "Made exactly as directed tonight. It was okay. Not my favorite butternut squash soup recipe but okay anyway. Easy enough to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rms1019"
},
"reviewBody": "Bland. Will keep looking for the perfect curried squash soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine MacLean"
},
"reviewBody": "Followed the recipe per directions. My son and I really enjoyed it and I will make again for us. My husband (not surprising) didn't love it. He prefers savoury to sweet and there is definitely a high sweet content. I made in large pot and used immersion blender. Served with crouton recipe (from here) and it was a great compliment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This was great! Don't skip the companion recipe for Frizzled Onions, they're a perfect accompaniment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KONWAL"
},
"reviewBody": "This was good, but not as flavorful as I had hoped. Before adding the half and half and serving I added more of all of the seasonings called for, some ground nutmeg and a shot of sherry. That seemed to help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosebud"
},
"reviewBody": "Great taste and consistency. I didn't have half and half so substituted coconut milk and doubled the curry to my taste. Hubby loved it and told me I could make this anytime. What a great soup of for a chilly fall day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libbey"
},
"reviewBody": "I have made this recipie every year for the past 3 yrs! I have to say it is one of my all time favorites!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rileypoodle"
},
"reviewBody": "By far one of my favourite recipes, I always come back to it in the fall when squash is in season! Don't skip the step of roasting the squash, I tried that once and it wasn't as flavourful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "My friends said they liked it, but I think this soup was rather bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "golson"
},
"reviewBody": "Amazing. If you don't like spicy dishes all that much, which I don't usually, then only use 1/2 tablespoon of curry so it doesn't compete with the rest of the flavors. This is the best butternut soup I've tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulette"
},
"reviewBody": "I followed the recipe pretty closely except for lowering the tablespoon of curry to a teaspoon. It is excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessica_l_whitlow"
},
"reviewBody": "Love this soup defiantly a must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chowchowred"
},
"reviewBody": "Dialed back the curry to 1/2 tlbspoon, still really spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Pfaff"
},
"reviewBody": "I see that a lot of people made changes to this recipe, but I made it just as written and thought it was delicious! I will definitely make this again, and I might add some turmeric next time with the rest of the spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Jane"
},
"reviewBody": "We needed to do something with the extra butternut squash from Thanksgiving, and this recipe turned out to be ideal. The only change was in not adding the cream. It still came out extremely tasty. We will definitely be making this again.\n\nTip to self: The \"Grandmother's Buttermilk Cornbread\" recipe on this site made into muffins are a great accompaniment to this soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie DeCosta"
},
"reviewBody": "My family loves this soup. We have made it several times and we OMIT the half n half to keep it dairy free. Don't even miss it! Easy recipe to make too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LLC"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Biggers"
},
"reviewBody": "Made the soup with just a few changes to the original recipe. I added some cinnamon, nutmeg and honey. The taste is delightful and my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebraK"
},
"reviewBody": "This is my go to recipe for Butternut Squash soup. Instead of half and half I use canned full fat coconut milk. Sometimes extra curry. Everything else just like the recipe. Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teacher Sue"
},
"reviewBody": "Love this recipe! Best one I have tried. We used our Asian pears because we had a bumper crop this year. Wouldn't change a thing. It is good with or without the half and half for those who want to eliminate a few calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I followed the recipe close to the given. I really like curry, but found the specified amount a little too much. Did not add the cream, but still found it very smooth. Saved some for my 8 month old grandson, before adding the spices. He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay-vz"
},
"reviewBody": "Amazing. This recipie is so easy and so delicious. I added an extra 2 tablespoons of curry powder. I've sent this recipie to multiple people and they all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clayher"
},
"reviewBody": "I used frozen, cubed butternut squash. After roasting the squash with a little oil, salt, pepper and garlic powder, I followed this recipe. I didn't have pears so I used some applesauce which worked well.\nThis was bar far the best butternut squash soup I've made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene Braithwaite"
},
"reviewBody": "Such yummy squash soup! I forgot to add curry powder, added only 2 cups broth &amp; had no pear, but it was still tasty. To speed up the process, I steamed the squash with a steaming basket in a pot with a lid above boiling water on top of the stove... which probably takes 1/2 the cooking time. I also used Coconut Oil to saute the veggies which worked out well... &amp; replaced the 1/2 &amp; 1/2 with Coconut Milk which was delish. I'll be making this recipe again... &amp; I'm anxious to try it with the curry powder this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Martin"
},
"reviewBody": "This soup is so flavorful and wonderful! Restaurant quality and excellent for any occasion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Techmama"
},
"reviewBody": "I made a vegan version the second time around, using olive oil instead of butter, coconut milk and vegetable broth instead of milk and chicken broth. Delicious either way. Also good with one apple and one pear. I roasted the onion, apple and pear with the squash. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alden McGillea"
},
"reviewBody": "When I make this again I'll use a little more curry to taste and more butter and cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chutanne"
},
"reviewBody": "One of my favorite soups. I don't bother with half and half and instead of baking squash, I put it in microvave for appx. 16-17 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ndalum2002"
},
"reviewBody": "Wonderful! Made this with only one alteration - I roasted all of the ingredients except the ginger (because I forgot) along with the butternut squash (henceforth to be known as BS). It was so flavorful and delicious even my husband, who HATES BS, said it was great and I should make it again. I love BS soup and think this was probably the best that I have ever had. Will be adding this to the rotation of winter soups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Farough"
},
"reviewBody": "Great recipe! I used whipping cream instead of the half and half, it made the soup so fluffy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna P."
},
"reviewBody": "This soup is delicious, exactly as is. As a newer Thanksgiving hostess, this has become my signature dish, and everyone's favorite Thanksgiving tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "obrosie"
},
"reviewBody": "This is my go-to soup recipe, we absolutely love it at my house! It's especially good if you have a decent curry powder with a little bit of kick to it. Depending on how big the squash is (and your texture preference), the given liquid may be a bit too much (but if it's big squash, it's perfect). For reference, I like my soup to be thick and velvety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "One of the very best soup recipes I have ever made, absolutely delicious as is! I have made it twice and will likely make it again as the squash and pears are in season now. It is a keeper in my repertoire. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Kimball Jimenez"
},
"reviewBody": "This was really good! I used fat free Greek yogurt instead of half and half and it taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melinda"
},
"reviewBody": "I took Foodloves suggestion and roasted the ingredients for about 40 minutes in the oven at 375 F until tender. I then sautéed the roasted vegies in the butter along with the curry powder for a few minutes. Four cups of water was added and all was mixed together and then blended in the blender. I returned this mixture to the pan and added the milk rather than cream and heated it all up. I and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doc G"
},
"reviewBody": "Love it! The Consistency is perfect, the flavor exceptional. I did not have fresh Ginger so I substituted dried. I am not sure if this made much of a difference, excellent none the less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "idahomort"
},
"reviewBody": "I will definitely make this again, and I will definitely not use as much curry as this calls for next time. It's pretty much the only thing you can taste. I think it could stand more ginger as well. Probably double what it calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessellessica"
},
"reviewBody": "My changes: \nQuadruple the recipe, otherwise you only get 4 large bowls.\nI didn't have curry, so I used Spice Road's West-African Citrus Spice and it was incredible. \nI omit the cream and use Osem vegetarian broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "Delicious! The pears and ginger make it very sweet, and the combination of flavors is perfect! I made some minor changes (1 Tbs olive oil instead of all that butter, whole milk instead of half and half, garlic powder instead of fresh garlic, and half buttercup, half butternut squash), but I don’t think those changes would change the soup much. Loved it! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liz"
},
"reviewBody": "Really enjoyed this soup. Its a nice change and very easy to make. Will make it again but maybe roast the vegetables first as another review did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "songanddance"
},
"reviewBody": "I have made this soup MANY times, and it is one of my favorites. I often substitute apples for the pears, veggie broth for the chicken broth, and I don't add the cream. (I want to keep it as healthy as possible.) I also cook the onions in a little broth instead of butter. I only use 1 teaspoon of curry, and that is still plenty spicy. Since I usually have squash already cooked and pureed in my freezer, I can have this soup ready to eat in less than half an hour. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lori1977"
},
"reviewBody": "I used coconut oil in place of the butter, used apples instead of the pears, and didn't even need the half-and-half at the end. This was delicious!!!! Plus, it was so easy to throw together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darleene65"
},
"reviewBody": "absolutely loved this soup, first time ever trying a butternut squash soup but love the hint of ginger in the flavor. I didn't put in the pears because I didn't have any so I grated 1 small potato into soup for thickening and was VERY pleased with the results. Will definitely be making this for Thanksgiving as an added treat before dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melia"
},
"reviewBody": "Most amazing soup! There are NEVER leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EmWillFish"
},
"reviewBody": "Delicious soup! Excellent for a cold day. Would be nice with a type of garnish..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AletheaSwanson"
},
"reviewBody": "This has become one of my favorites! I keep the seeds and bake them with a bit of olive oil, salt, and curry powder and sprinkle them on top of my soup. Adds s nice crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catlady"
},
"reviewBody": "This is a very delicious soup. I will be making it again. Thanks for the recipe. I substituted 4 cups of water with two veggie broth bouillon cubs in place of the chicken broth. Also the 30 minutes of cooking is not necessary. while you are sautéing the onions garlic and spice cook the pears with about 1/3 cup water on a low simmer for 5 minutes or until soft. Then add them to the pot. Next add the broth and squash. You can use a hand blender or pour it all in a glass blender and blend before you heat it all up. You do not need to cook just let it get to the desired temp and serve. the less you cook the soup the more nutritious and colorful it is. Also you can skip the half and half. It is just as good if not better without. Taste it before you add it and you'll see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris12804"
},
"reviewBody": "Very easy. Loved the addition of the pears. I didn't have fresh ginger, just used spice. Still very delicious I will make this soup again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Very good. Used 3/4 tsp of dried ginger in place of fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen1211"
},
"reviewBody": "Left out half and half and added 3 oz goat cheese instead - amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goodeating"
},
"reviewBody": "This was excellent. I took a previous review and roasted everything together for about 45min, then sautéed in olive oil and added curry, salt, and vegetable broth verses chicken. I didn't use any half and half because I didn't want any dairy components. I will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ambur"
},
"reviewBody": "Wonderful recipe I have made again and again. I omit the half and half but serve the soup with a small dollop of sour cream. I have made this with and without pears and both are equally good. I've also previously used apples instead of pears. This always gets rave reviews in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carrie Rose"
},
"reviewBody": "This soup was fine. My family ate it, but we had lots left over and nobody was enthusiastic about it. I won't make it again because there are some other really fantastic butternut squash soup recipes on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lfalke"
},
"reviewBody": "This was the hit of my Thanksgiving get together! I used olive oil instead of butter and vegetable broth instead of chicken broth to make it vegetarian."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/189936/curried-butternut-squash-and-pear-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/175/soups-stews-and-chili/soup/fruit-soup/",
"name": "Fruit Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/189936/curried-butternut-squash-and-pear-soup/",
"name": "Curried Butternut Squash and Pear Soup"
}
}
]
}
}
, "about": [
]
}
]