				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Dad&#39;s Pad Thai"
,"datePublished": "2020-03-04T23:58:32.000-05:00"
,"dateModified": "2020-03-04T23:58:32.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jenny"
,"url": "https://www.allrecipes.com/cook/817429"
}
]
,"description": "Why eat out when the best traditional Pad Thai is made right in your own kitchen? This is the best Pad Thai recipe ever. My father&#39;s Pad Thai is better than most Thai restaurants! I like it because of all the fresh ingredients, it is not greasy. It&#39;s satisfying and healthy. There is no meat in this recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4upMbfTop9BYPKfYZghpM7HmxPM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/31762-b86a86cad04c4ada8844b23cb1396ba7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Dad&#39;s Pad Thai"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "144"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "554 kcal"
,"carbohydrateContent": "62 g"
,"cholesterolContent": "186 mg"
,"fiberContent": "7 g"
,"proteinContent": "18 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1421 mg"
,"sugarContent": "15 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.75 pound bean sprouts",
"6 ounces pad thai rice noodles",
"4 eggs",
"salt",
"3 tablespoons lime juice",
"3 tablespoons ketchup",
"1 tablespoon brown sugar",
"0.25 cup fish sauce",
"3 tablespoons peanut oil",
"1 tablespoon minced garlic",
"1.5 teaspoons red pepper flakes",
"2 cups grated carrots",
"0.66666668653488 cup chopped peanuts",
"1 cup green onions cut into 1-inch pieces" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a pot of water to a boil. Blanch the bean sprouts in boiling water for approximately 30 seconds, remove, and drain well. When the water returns to a boil, add noodles. Cook for 3 to 5 minutes until tender but firm; drain and rinse under cold water"
} ,{
"@type": "HowToStep"
,"text": "Beat the eggs with a pinch of salt in a small bowl. Stir together the lime juice, ketchup, brown sugar, and fish sauce in a separate bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat the oil in a wok or large skillet over medium-high heat. Fry the garlic for a few seconds. Add the pepper flakes and carrot, and cook for one minute, then remove. Add the beaten egg, and gently scramble. When the eggs have set, pour in the carrots, sauce, bean sprouts, noodles, peanuts, and green onion; toss together."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ne14chocolate"
},
"reviewBody": "We added a few chicken breasts (cooked before the garlic) and added an extra T of brown sugar and 1/4 c. peanut sauce. We could have cut back on the chopped peanuts. It was a little over the top on the crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Hiles"
},
"reviewBody": "It was the best pad Thai I’ve ever made. I like that the ingredients were easy to find. The flavours were delicious and enough sauce to cover the ingredients. I added chicken and more veggies, broccoli and orange peppers along with grated carrots. This will be my pad Thai recipe from now on!!!!! No more store bought sauce loaded with sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Llianne"
},
"reviewBody": "What a flavourful dish!! I traded the shrimp and eggs for diced chicken and it was terrific!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Theresa Bales"
},
"reviewBody": "I made it for the first time and loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stuman491"
},
"reviewBody": "I really enjoy this recipe. it's easy to make and delicious as is. I make a few changes, but these are not necessary as the original recipe is quite nice. I like to add some thinly sliced red and yellow peppers to get more vegetables in there. I also use soy sauce instead of fish sauce. I just don't like fish sauce much. I like to add some peanut butter to the sauce as well. If you like spice some siracha mixed into the sauce is great too! Thank you so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StaceyL428"
},
"reviewBody": "This was great! I prefer to measure by eye and adjust seasonings by taste, perfect recipe of seasoning. I used chicken and omitted the ketchup because I didn’t have any, I added a tad bit red curry paste as well. All of us really enjoyed and will be making again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "carmicjam"
},
"reviewBody": "Not my favorite. It was too tart &amp; too salty &amp; not sweet enough. I added additional sugar which helped. Don't think I'll be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fab5Freddy"
},
"reviewBody": "Made it without meat, tasted delicious. Going to add less fish sauce more brown sugar next time to get more of the restaurant flavor. Kids loved it too. Thanks Daddy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "This tasted great!!! Next time I will add cornstarch--it was a little too soupy--but will definitely make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DashielB1"
},
"reviewBody": "This recipe is AMAZING!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "pretty delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KrisIntheKitch"
},
"reviewBody": "Too much fish sauce, recipe did not yield enough sauce for us, and I felt the instructions should have been broken into more steps. My bf loved it, it was just ok for me and the fish sauce made my house super stinky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terrvu"
},
"reviewBody": "really good, but I did make some modifications. did 1/2 fish sauce &amp; 1/2 soy sauce (as FS can be strong!). sauce wasn't too sour, but I did use heaping tablespoons of sugar.\ndont cook the noodes ( 1/2 packet) instead just soak in hot water to soften (otherwise mushy noodles).\nadded some cut celery for crunch. I beat the eggs and cooked in the microwave before adding to noodles. doubled the sauce and chopped parsley for finishing touch at end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoraGregory"
},
"reviewBody": "This was really good, but it didn't taste exactly like the pad thai at my fabulous local thai restaurant. I think I need to use something different besides fish sauce. I wonder what oyster sauce would do. Also, I wish they would say what brand and the exact name of the noodles to use. That is always so confusing when I go to the store to buy \"pad thai noodles\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "I'm so glad I tried this, much easier to control the heat level than at a restaurant. It turned out better than expected. The only change I made was to add thinly sliced chicken to make it a very satisfying meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mayura"
},
"reviewBody": "This was good! Out of personal preference, I omitted bean sprouts and green onions. Used only 1/2 tsp of red pepper powder, I didn't want to overkill the spiciness, although I couldn't taste the pepper at all, so maybe more is ok! I used 2 tbsp of fish sauce and 2 tbsp of soy sauce, and that worked better for me in terms of flavor. Next time I'll try adding some peanut butter too. I also added some cubed tofu, fish cake cut into strips, and used 2 eggs. The whole recipe took me about 45mins to make! I went from not very hungry to very hungry while making it. I also think that the serving size is a bit off... I had to use 8oz of noodles to feed four people!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Bee"
},
"reviewBody": "This was great, I made a few adjustments to the cooking method but the flavors were good. I added shredded chicken but will try shrimp next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "Nice recipe. Traditional pad thai is made with several hard to find ingredients, and I never thought ketchup would be a suitable substitute for some of these. Turns out it's a great sub. My tip: skip the boiling water for the noodles. Just put them in a bowl of very hot tap water while you prep the rest of the dish. They'll be perfectly al dente when you are ready to cook them. Boiling risks over-cooking the noodles which makes for a gummy mess of a dish. Also, fish sauce is crucial IMO. It may stink, but it adds a depth of flavor to the overall dish that you can't get with soy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria T."
},
"reviewBody": "This was SO good! I'm not sure why some people didn't like it. It really is restaurant-quality pad thai. Per other reviews, I substituted the fish sauce for soy sauce, added 2 tablespoons of peanut butter, and doubled the sauce. You MUST double the sauce. The only criticism I have is that I was SLIGHTLY tangier than I thought it would be, so I think next time I'll just put less lime juice. I added chicken, just as a personal preference. This was super easy to make and my entire family loved it! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "very good BUT needs some of those changes others suggested. It was too sour so I added more sweetener, almond butter (peanut allergies in my home) and some sesame oil too. Next time, I'll lessen the sour ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JSteve88"
},
"reviewBody": "I used this recipe for my first time making pad thai and it couldn't have went better! Easy to make and so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TP"
},
"reviewBody": "In my attempt to copy the best take-out pad thai ever, I made this recipe. The only major substitution I made was soy for the fish sauce, plus I added some peanut butter to the sauce. It turned out WAY BETTER than the take-out pad thai. NO MORE TAKE OUT FOR US!!!!! My kids even loved it, but I will back off the red pepper next time (family preference). I loved the spice, but it was a bit much for them. THANKS FOR SHARING!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Pen"
},
"reviewBody": "I've made this recipe many times and it's my favorite Pad Thai recipe! Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coribs"
},
"reviewBody": "Very yummy dish made with many of the other reviewer's suggestions including adding chicken. Also added 1 T peanut butter to the sauce, a pinch extra sugar and cut the fish sauce with soy sauce (i used 1:1 soy sauce and fish sauce instead of 1 full 1/4 C fish sauce)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lorelei_sis"
},
"reviewBody": "Whew! I just made this and my lips are on fire. The amount of red pepper flakes sure does the job. I'm not sure how much I liked the whole brownsugar, lime and ketsup mixture, It was a little too much like BBQ (I didn't add fish sauce, I used gluten free soy instead) I think in the future I'll be looking for another recipe to use. Overall it tastes nothing like Pad Thai I've had at Thai restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erika Hays"
},
"reviewBody": "We loved this... Not a bite left!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hodgson668"
},
"reviewBody": "Anybody else get confused and screw up making this based on the way the instructions were written????\nThe way step 2 reads, I mixed the egg, kept reading then added the lime juice, ketchup... etc. Got to the end of the sentence and saw it was supposed to be in a separate bowl. \nIt should read: \n2. Beat Eggs with a pinch a salt. In a separate bowl mix together Lime Juice, Ketchup ... etc.\nDespite screwing it up it did tasted pretty good so I will give it 4/5 stars. I found it need more sugar and improvement on direction. Then again, maybe I am just slow or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri-Lynn Chaffey"
},
"reviewBody": "Delicious! I'm a big fan of ginger-y pad thai though, so I added a fair bit of ginger and squirted a little extra lime on the finished dish. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eva Hagerman"
},
"reviewBody": "It tasted good, but not really what I expected for a Pad Thai recipe. My search continues..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happymomof2"
},
"reviewBody": "Very good only put less red pepper flakes so was not as spicy and my little girl gobbled it down as well as my picky husband and for a change I got to eat the same food as everyone else I'm the only vegetarian in my house..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dranoel"
},
"reviewBody": "Note: paragraph two... do not add the sauce to the eggs! You won't like it. Otherwise, I doubled sauce. Added ginger &amp; peanut butter as others suggested. Broccoli &amp; mushrooms worked well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gantert"
},
"reviewBody": "Wow, this is a terrific recipe. I'm sure it would be great as is but we all have our own tendencies. I added more garlic, substituted bar-b-que sauce for the ketchup (which made it sweeter) and only used two eggs. I also doubled the sauce and added tamarind. I will be making this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L to the K"
},
"reviewBody": "Loved it! This recipe definitely exceeded my expectations! Full of flavor! I just added a little chicken and left out carrots because I don't like them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Rush"
},
"reviewBody": "This recipe was spot on, just like the Thai restaurant that we usually visit. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Rush"
},
"reviewBody": "This recipe was spot on, just like the Thai restaurant that we usually visit. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiska_Kiska"
},
"reviewBody": "Just awesome. I excluded the fish sauce, and replaced the sugar by honey. It's just the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PainterSusan"
},
"reviewBody": "This was pretty darn close to the Pad Thai at our local restaurant. A few too many carrots though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeff Bluemel"
},
"reviewBody": "after we cooked this my wife would not let us keep this int he house. that fish sauce is very smelly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beatrizgb"
},
"reviewBody": "I made this recipe just doubling the sauce mix... my friends always ask me to cook it for them... one of them went on honeymoon to Thailand and when they came back the asked me to cook it because they didn't have one that was as good!\nmy husband that is an amazing chef adds a little sweet corn to it... it' s good either way..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mrstoller"
},
"reviewBody": "Too much fish sauce for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I love pad thai and I am always trying to make it so it tastes as good as my favourite Thai restaurant. This definitely was not one of them. While it was ok, it just wasn't what I expecting to taste. I found the fish sauce was really overpowering and I could taste the ketchup even though there wasn't much in there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tierra Thompson Lowry"
},
"reviewBody": "I did not like this one bit. No one in my family could eat it because it was so salty. Way too much fish sauce. Was very disappointed. Darn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WeekendWarrior"
},
"reviewBody": "Great recipe! It wasn't a peanut oil mess like most Pad Thai dishes. The boyfriend got overzealous with squeezing limes, but it turned out great when I replaced the fish oil (yuck) with extra lime juice. I served it with Spring rolls (see:Thai Basil Rolls with Hoisin-Peanut Sauce). It was a hit around the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kirsten Mitchell"
},
"reviewBody": "This was so-so, but not as good as the Pad Thai you get in a good Thai restaurant. I probably won't make this again and will look for a better, more authentic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "misha"
},
"reviewBody": "I did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "uncanny"
},
"reviewBody": "Pretty good with changes. Per other reviewers subbed soy sauce (tamari, actually) for fish sauce. I started out doubling the recipe but it ended up, after experimenting, about triple (or more) of the sauce. I made A LOT of noodles, pan frying in two batches, adjusting the sauce in-between. I put in sweet chili sauce, peanut butter, and some rice wine vinegar to broaden the flavors, it tasted like sweet soy sauce at first. I kept adding more ketchup and more lime juice until it tasted okay, also I think the peanut butter was the magic ingredient. Then a teaspoon of garlic chili paste for heat. I screwed up on the second batch, forgetting to fry the eggs first, so I tried to add it in the middle of the pan then combine with the noodles. Maybe if I had patience it would have worked. I ended up with a huge globby mess, granted it tasted okay. I found that even if it looks like too much sauce, add more. The next day it will be very dry. I will definitely make this again, though not in such a huge quantity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mellow_everest"
},
"reviewBody": "Have made this several times, exactly as is and I love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vicki0894"
},
"reviewBody": "its a good recipe. subbed peanut oil for a tbs of aactual peanut butter and added a drizzle of sesame oil toward the end of the drying prcess when the stove was off. noodles are a bit dry. i recommend adding a slash of milk or chicken broth, etc"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juseman"
},
"reviewBody": "great recipe, my sister says it is better than her restaurant experiences. I too. dooubled up on the sauce and also subbed in tamarind sauce for ketchup. It doesn't taste exactly like authentic pad thai to me but it is perfect for vegetarians and you can add whatever flesh you want if you prefer. I also put in 1 tbsp of crushed chiles and sometimes use fresh thai chilies for a little more heat. Overall a great recipe and at least I'm not disappointed like when I have it at a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Mahaffey Catanzariti"
},
"reviewBody": "wonderful, quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanda9"
},
"reviewBody": "We loved it! It was easy to make and was well worth it. I cut the red pepper flakes quite a bit, so that my husband and I could season each to taste. And I added the green onions to the carrots the last few seconds that they cooked, to make them a bit milder. We will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BethAshley"
},
"reviewBody": "Made this for the first time tonight. Nice flavour but next time I plan on reducing the spouts and doubling the sauce. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EmilyC"
},
"reviewBody": "I made this recipe last night for dinner and I really enjoyed it!! However, my boyfriend and I are carnavores.. so I made some changes. I added small shrimp, chicken pieces and tofu. I also double the sauce. I would deffinately make this again when im craving Thai!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kris.c"
},
"reviewBody": "This is my favourite pad thai recipe! I've made it many times now. The only change I've made is substitute soy sauce for the fish sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JPMJ"
},
"reviewBody": "I used sweet chili sauce instead of ketchup, as that seemed a little more Thai, and left out the chili flakes. I added peanut butter to the sauce and added fried tofu as well. I used a whole 16 oz package of noodles so I had to make a lot of sauce. I wouldn't recommend using that many noodles-- it was very difficult to mix in the pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ReelLove"
},
"reviewBody": "Sweetness problem solved! Use sweetened lime juice (you'll find it near drink mixes), and 2 T peanut butter or 2 extra Tablespoons of brown sugar. To bump up the nutrition I only used 1/2 the noodles and added 3 cups of thin sliced cabbage, plus tofu, red bell peppers, and zucchini. You can hardly tell the cabbage from the noodles if you cut it right. Excellent dish, you only needed 1 T of oil if you use a nonstick skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mbg2688"
},
"reviewBody": "Very delicious! I made this last night and added cooked shrimp and water chestnuts. Only change I would make is to use a bit less fish sauce- it was really quite salty. I'll try adding peanut butter like the other reviews recommended in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heather88"
},
"reviewBody": "This is my go-to pad thai recipe! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shopj"
},
"reviewBody": "My husband and I really liked this recipe. I did follow some of the suggestions and tweeked the recipe a bit. I doubled the sauce, adding only the lime juice and ketchup for one recipe. I did add a bit more brown sugar and creamy peanut butter. I also sauteed some cubed tofu with the carrots. The result was quite tasty. THanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zoso0429"
},
"reviewBody": "This is truly one of the best/easiest pad thai recipes I've found, very close to the pad thai we get here in the city. My boyfriend and I have been trying to perfect pad thai recipes for years, but now that he's tried this one, he's hooked. We make it all the time. I did make a few changes. I didn't have peanut oil, so I added about an 1/8 cup of peanut butter to the sauce mixture, which turned out well. I also cooked chicken seasoned with salt and pepper before hand and added it in to make Chicken Pad Thai. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GlacierFreeze"
},
"reviewBody": "Yum! This is a great basic recipe. I added one package of tofu that I cubed and stir-fried and garnished with some cilantro. I also had to add more brown sugar to the sauce than was called for. I thought that 4 eggs was just the right amount, definitely not too many. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Witmer"
},
"reviewBody": "Love this with chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkowal"
},
"reviewBody": "was not the most authentic tasting pad thai but still tasty. there is just too much fish sauce i think, it kind of makes it smelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inez"
},
"reviewBody": "Delicious! Even my small children (who are very picky eaters) ate it and loved it. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Unfortunately unedible- way too much fish sauce in my opinion... and ketchup? In Thai food? I thought it sounded like a bad idea... and it was. Oh well, I'll keep looking for a good pad thai recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erink"
},
"reviewBody": "My boyfriend has an allergy to all nuts and I have been talking about making him a NUT FREE pad thai for sometime. I found this recipe and it seemed good as it didn't have peanut butter in it. Here were the changes: sesame oil instead of peanut oil and sunflower seeds instead of peanuts. It was amazing and he didn't know the difference. I did a little but I was still very pleased with the out come!! This will be made again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "OCEANVIXEN79"
},
"reviewBody": "Thank god I tasted the sauce before I poured it on my noodles! Too salty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mschirber"
},
"reviewBody": "good, but not authentic, and a very heavy ketchup flavor. i took the suggestions of others and added some soy sauce, peanut butter and a little more brown sugar. with broccoli, bean sprouts, sugar snap peas and tons of cilantro it turned out pretty great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rhmboo"
},
"reviewBody": "I agree with reciperenegade.also, whatever you do, do not overcook the noodles like me and end up with mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RecipeRenegade"
},
"reviewBody": "This was a pretty good starting point for a Pad Thai recipe. The only substitution I made was to use sesame oil because we didn't have peanut oil, and I cooked some chicken separately (with a scaled-down version of the sauce) to put on top of my husband's portion. It ended up tasting REALLY salty for my taste. I think I'll try what some other reviewers suggested, and increase the sauce, but change the ratios a bit. I'll probably add a bit more ketchup, and maybe replace some of the lime juice with tamarind. I think it also could have benefited from some cilantro before serving. Next time I will also probably just add the bean sprouts without blanching them, as that took out nearly all of the \"fresh\" aspect of the bean sprouts. My husband and I both thought it could have used a little more kick, so I'll probably also use more red pepper flakes. But, all in all, the recipe was straightforward and easy to follow, and yielded an acceptable Pad Thai. I'll be adding this to my repertoire, so I give it four stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "appleallen"
},
"reviewBody": "I'm vegetarian so I used tofu &amp; no fish sauce. It was a little too tangy for me so next time I'd use a little less lime juice &amp; more brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I thought this was just ok. I was expecting something creamier and more like one I've had in restaurants. It was a bit sour at first, then I added more lime juice and peanuts which seemed to take care of that. There also wasn't enough sauce for the noodles to adequetely coat them. I ended up only putting half of the cooked noodles in the skillet to blend it together to get the most of the sauce it yeilded. I was skeptical about the ketchup, there was another recipe I was thinking of trying that did not use ketchup. The presentation looked nice but I might try another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "heatherteeter"
},
"reviewBody": "I was not impressed with this pad thai. Although the ingredients are common, and it is relatively easy to make, if you are expecting a flavor like \"real\" Pad Thai you won't get it here. Unfortunately, if you want that authentic taste, you need to use authentic ingredients. The flavor of this recipe was tart (because of the excess lime juice), and slightly bland (boring). I would not recommend this recipe if you have tried good pad thai before. If you are a first time taster, you might enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpvargas"
},
"reviewBody": "Awesome, but add 1 T peanut butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ansola"
},
"reviewBody": "I made this last night for dinner and when I first tasted it last night I thought the ketchup was WAY to overpowering. However, I put it in the fridge overnight and took it with me to work for lunch today. YUMMY! Overnight the ketchup flavor diminished and it is just lovely now after re-heating and adding a bit of soy sauce. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denice"
},
"reviewBody": "Yummy Delicious! I love this recipe! I topped it off with a peanut sauce &amp; satay chicken....Fabulious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pinkypink"
},
"reviewBody": "My poor boyfriend attempted this recipe as a suprise dinner for me. To put it nicely, we did not care for the taste, and he followed the recipe exactly. We went to a restaurant for good Thai. Thanks but no thanks and never again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenniferm1"
},
"reviewBody": "I did make some minor changes like less lime. Plus, instead of using peanuts, I put a few tablespoons of peanut butter into the sauce then blended it. Thanks for a great recipe, my family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy X"
},
"reviewBody": "Wow - this wasn't bad! It was definitely better than store-bought \"pad thai sauce\" in a can or pouch. I was surprised I had all the ingredients at home. I also added 1 cup of chopped cilantro. Next time, I would probably double the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wendynik"
},
"reviewBody": "I would agree with others, this was okay but it had a strong ketchup flavor to it. I will say it was very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley X"
},
"reviewBody": "Very yummy! However, needed to make about 4 times the sauce in order to coat the noodles, but the taste is fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susanne"
},
"reviewBody": "I agree with the other reviews, add tamarind paste (maybe a teaspoon) and a little extra brown sugar than the recipe calls for. Don't forget cilantro and I use cabbage instead of carrots. Great base for a difficult dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "J "
},
"reviewBody": "Tasted Good (even though I messed up the recipe a bit). The only thing I have against it is the amount of salt in it. It has much more than other pad thai recipes on this site"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "My family, known for their staunch adherence to blasé American cuisine, loves this recipe! It's energy intensive and will leave your sink full of dishes to be washed, but it's well worth it. I'd suggest wrapping the bean sprouts in cheesecloth before blanching them (makes it easier to remove them) and going easy on the hot pepper flakes (you can always add more when the dish is on your plate if you want). Also, use soy sauce instead of fish sauce to save a fish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon"
},
"reviewBody": "Great recipe! I definately will be making it again. I love Pad Thai and this is by far the best recipe I've found. I did add chicken and a little cilantro but otherwise made it just as the recipe read. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stepharoo"
},
"reviewBody": "This is an absolute crowd favourite!! I hate seafood and substituted soy sauce instead of fish sauce... I have made this a few times now and just love it! \nAlso: if you are looking for something to go with it try the Peanut Butter Chicken Skewers on this site, simply amazing! The peanut butter sauce is so authentic, my husband likes to put it on top of this pad thai.\n\nThanks for a GREAT recipe! We use it all the time! It impresses company too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kay"
},
"reviewBody": "this combination turns out with a sauce that is both too sour and too fishy. i cut the fish sauce down to about 2 tablespoons and add one tablespoon of peanut butter, which seems to help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mo"
},
"reviewBody": "Thank You!!!! I was looking for a Pad Thai dish that didn't call for tofu or Tamarind sauce.This was the best one. I added creamy peanut butter and coconut milk. I added two tablespoons of Peanut butter and two tablespoons of coconut milk to the mix. I added extra ketchup and it worked:)\nVery easy to do.\nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I had been wanting some great pad thai- especially after making some out of a box the other day (not a good idea). \nI added a little more pepper flakes to give it a kick. If you don't like spice I would recommend putting less in. I also substituted soy sauce for fish oil and it was just as delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I couldn't get enough of this! My husband enjoyed it too. Tasted just as good as what I've had in good Thai resturanuts. I made a couple of changes after reading reviews - I did not add the ketsup and I added an equal amount of soy sauce as what was required of the fish sauce. I also cooked the eggs separately and added them toward the end. Delicious. Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DT & Hel"
},
"reviewBody": "Delicious! We chose this recipe because most of the others we saw required tamarind, which we had never heard of. We substituted soy sauce for fish sauce. We also used scallions instead of onions, crushed our peanuts (plastic bag + heavy jar), and did not use carrots. We threw in some pre-cooked frozen shrimp from trader joes and used the trader joes rice noodles.\nIt looked and tasted like your typical restaurant pad thai. Mmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sony20"
},
"reviewBody": "Pretty good recipe. Added 2Tbsp of peanut butter to thicken the sauce a little. Also, would cook the eggs separately next time, and add toward the end so they don't get too mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I spent a lot of money buying the items for this recipe and it was horrible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aminarose"
},
"reviewBody": "this was my first time eating and making pad thai -- i thought this recipe was delish! i used chicken and shrimp...and i added a pinch of ginger [powder] just for a kick, plus its really healthy! didn't have much PB in the house, so only used 1/2 tablespoon...i will definitely be making this again! thanks 'dad'!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flowerenvy"
},
"reviewBody": "This was the first time i had ever made Pad Thai. Everyone in my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Erika"
},
"reviewBody": "I've been looking for a recipe for good pad thai for a while now, constantly disappointed with the ones available, and this was no different. I will NEVER make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "Very Bland, only flavor was the spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ginajason061403"
},
"reviewBody": "This was the worst pad thai I have ever had. It tasted like fishy noodles! YUCK!!! My husband and I threw the whole pot out and went out to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Clay"
},
"reviewBody": "One of my favorite's! I do make it my own though. I sautee a chicken breast in cilantro and cumin then set it aside to add in later. I only use two eggs and I double the sauce. I sub Soy for fish sauce and a T of peanut butter for a nuttier flaver. \n\nI always serve this with \"Broccoli with Garlic Butter\" and everybody raves!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/68129/dads-pad-thai/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
"name": "Thai"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/68129/dads-pad-thai/",
"name": "Dad&#39;s Pad Thai"
}
}
]
}
}
, "about": [
]
}
]