				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Dad&#39;s Leftover Turkey Pot Pie"
,"datePublished": "2007-11-25T16:40:50.000-05:00"
,"dateModified": "2007-11-25T16:40:50.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Rob Neil"
,"url": "https://www.allrecipes.com/cook/2598848"
}
]
,"description": "Classic turkey pot pie recipe made with leftover turkey, veggies, and ready-made pie crusts for a post-holiday comfort food win. Recipe makes two pies."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-5KPCGyHj8ks6Ktnz7BImDk5qf4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/215447-dads-leftover-turkey-pot-pie-LSH-2-2dea87b51dca4308a09e85e35c20e88e.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2011328821001",
"description": "See how to make a quick pot pie with veggies and leftover turkey meat.",
"duration": "PT5M2S",
"name": "Dad’s Leftover Turkey Pot Pie",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/10/28/215447-dads-leftover-turkey-pot-pie-LSH-2000.jpg",
"uploadDate": "2021-06-25T09:21:07.411-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Dad&#39;s Leftover Turkey Pot Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "1464"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "539 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "65 mg"
,"fiberContent": "4 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "651 mg"
,"sugarContent": "3 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 cups frozen peas and carrots",
"2 cups frozen green beans",
"1 cup sliced celery",
"0.66666668653488 cup butter",
"0.66666668653488 cup diced onion",
"0.66666668653488 cup all-purpose flour",
"1 teaspoon salt",
"1 teaspoon ground black pepper",
"0.5 teaspoon celery seed",
"0.5 teaspoon onion powder",
"0.5 teaspoon Italian seasoning",
"1.75 cups chicken broth",
"1.3333333730698 cups milk",
"4 cups cubed leftover cooked turkey",
"2 (14.1 ounce) packages pastry for a 9-inch double-crust pie" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place frozen peas, carrots, and beans in a saucepan with celery; add enough water to cover and bring to a boil. Reduce heat to medium-low and simmer until celery is tender, about 8 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "While the vegetables are simmering, melt butter in a saucepan over medium heat. Add onion and cook until translucent, about 5 minutes. Add flour, salt, pepper, celery seed, onion powder, and Italian seasoning and whisk until a paste forms, about 1 minute. Slowly whisk in chicken broth and then milk until incorporated; bring to a simmer and cook, whisking constantly, until sauce thickens, 3 to 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove thickened sauce from the heat; add cooked, drained vegetables and cubed turkey and stir until filling is well combined."
} ,{
"@type": "HowToStep"
,"text": "Set out two 9-inch pie dishes. Fit one pie pastry into the bottom of each dish. Spoon 1/2 of the pot pie filling into each dish, then lay the remaining pie pastries over top. Pinch and roll the top and bottom pastries together at the edges to seal. Use a sharp knife to cut several small slits in each top pastry to allow steam to release while cooking. Place pies on baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 15 minutes. Check the top crusts for browning; if they are browning too quickly, cover with aluminum foil. Continue to bake until the crusts are golden brown and the filling is bubbly, 15 to 20 more minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-5KPCGyHj8ks6Ktnz7BImDk5qf4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/215447-dads-leftover-turkey-pot-pie-LSH-2-2dea87b51dca4308a09e85e35c20e88e.jpg"
}
]
,"text": "Remove from the oven and cool for 10 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RBZA"
},
"reviewBody": "Family adores Marie Calendar’s Turkey Pot Pies - this was so much better! I used the same quantities of ingredients but replaced the green beans with diced potatoes that I boiled with the celery, carrots and peas. I have this yummy spice blend from Trader Joe’s called Everything But the Leftovers so I replaced the celery seed, onion powder and Italian seasoning with like amounts of that. Butter was salted so I omitted that. I doubled the black pepper cause we like it that way. For turkey I cut up one of those whole turkey breasts from Costco. Into bite sized cubes. My daughter made her first butter crust using a food processor recipe. We replaced a tablespoon of the water with vodka. As you can see, tender flaky crust and a solid filling! I might double the sauce next time to have extra to pour over. This amount completely filled my deep dish Pyrex and required two crusts. I also added 15 minutes covered at 375 to the cooking time cause it wasn’t bubbling - well, it’s fairly solid so that’s probably why. It didn’t seem to suffer for the extra time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing and simple and whomever gave a 1 star review did something wrong. Simple and easy. I had a leftover turkey I wanted to use. Baked it and 5x the recipe for a Pot Luck at church this evening. Even the Littles are eating already so if children between 11-17 like it ... that's all she wrote. I had to omit peas but the rest was loved!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Galpin"
},
"reviewBody": "I love this recepie been coming to it for the last 5 years.. I put potatoes in mine and fresh carrots. Maybe less salt but everyone's loves ir. It's thick and beautiful! Will always ❤️ come back."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making this recipe for 8 years!! The sauce is the best, I make extra to pour over the top of each slice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great and easy recipe. I have made this 3 times now and receive rave reviews. I use all fresh vegs adding corn and mushrooms steamed for 3 minutes. But you could use whatever veggies you have on hand. I use a Costco rotisserie chicken. Yum. I divide the filling and make 2 pies with pastry dough on top only. I bake one and freeze the second one. This recipe freezes extremely well. I have used turkey and chicken. Love either one. Thanks Dad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this recipe 4 times. Everyone always enjoys it. Tops any store bought pie. Thank you🙂"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S. P."
},
"reviewBody": "Excellent recipe!!! I absolutely love that it makes two pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Felgner"
},
"reviewBody": "Excellent filling. I never thought I'd be able to make such a great base from scratch. I used leftover smoked turkey. I made the crust linked in the recipe and it was flaky and buttery, following the careful instructions to not over mix. I did not use green beans. I added potatoes because I had some leftover baked ones in the fridge. I also added poultry seasoning in the filling. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michael george"
},
"reviewBody": "Used it again for the 5th year. No complaints from anyone!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "This is so easy and super delicious that my entire family here asks me to make it twice a week... Thanks a lot for making the best recipe ever 🙄😁😁😁💕"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monchee"
},
"reviewBody": "This is a really good base recipe. There is a tad too much pepper in my opinion since that was the most forward flavor while eating it, but otherwise, all of the quantities were right on. I didn't need quick so I used fresh carrots, broccoli, potatoes, celery, (all diced pretty small) and onion, and frozen peas. I sauteed the onion and boiled the rest for about 8 minutes as directed, but added the peas to the mixture at the very end. It worked out great. I did add all of the spices to the butter and onion (along with five cloves of minced garlic) as they cooked to pull their flavors out. I cooked the butter and flour mixture for about five minutes to develop some flavor and then I added cream instead of milk along with about a tablespoon of lemon juice to brighten up the heaviness a bit. I made them in individual pot pie dishes 1.25 cups of mixture per pie with a homemade buttery crust and it was incredible and super filling. The filling gave enough for four more individual pies so that's in the freezer for next time. I am so happy with the quantities in this recipe. The balance of sauce to meat and veg was really perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best pot pie ever! Moist and flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef WannaB"
},
"reviewBody": "Was a real banger in my house. Both pies almost completely destroyed. Changed nothing. Did let filling cool a bit before adding it on the crust, and I used Pillsbury pie crusts, I won’t be waiting for holidays to make Turkey dinners here anymore. An excellent use of leftovers!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaye Love"
},
"reviewBody": "Delicious!! I changed a few things, but kept the seasonings the same. I subbed diced potatoes (cooked until firm tender) for the green beans. I used fresh carrots that I cooked with the potatoes and I added fresh garlic. I halfed the recipe to make one pie. So good! But the following day, it was even better. This is definitely going in my Turkey Leftover rotation each year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time making Turkey pot pie and I’m never straying from this recipe! I changed up the spices just a tad bit otherwise followed directions and the pie came out perfectly! I also brushed egg white and sprinkled coarse salt on top before cooking and it came out a beautiful golden brown. I will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chan Bliss"
},
"reviewBody": "This was easy to make. I didn't have enough turkey left over so I chopped up some leftover pork loin and added that. It tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time making pot pies. I always just did more of a bake thing than a pie. Will definitely use this reciepe again. I was able to find large personal size pans at a local store so I made 2 of them..I must say absolutely amazing and we have leftovers for another dinner.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mayr"
},
"reviewBody": "Made (mostly) exactly as written. Used skim milk. Used frozen pie crusts. Delicious! I made sure the sauce was thickened before adding the vegetables and turkey, in hopes of avoiding the soggy crust that others mentioned. It was perfect. The only complaint my husband had was that he ate too much! Added additional salt and pepper to my plated serving, because that's what I do. Will DEFINITELY keep this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought it was delicious. I did add one small diced potatoes; threw it in the microwave with some water for 2 min just to soften it a bit. Then added the frozen peas and carrots and microwave for one min. I sauted the celery with the onions and I also added mushrooms because I love them in a pot pie and a couple broccoli pieces since I had no fresh green beans and canned beans are just gross. Everything else was the same. I went with individual pot pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUCHUNK"
},
"reviewBody": "I made it according to the recipe, except that I baked it all in one deep dish pan, and it was EXCELLENT! My entire family loved it. I will definitely put this on my meals rotation. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DArcy"
},
"reviewBody": "Made tonight and the 4 of us took a vote - 5 stars! The girls and hubs loved this recipe. We didn’t need more than one pie so freezing the second portion for another night. Bonus second dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "Very good. I cut recipe in half for one pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Hudzik Yarmesky"
},
"reviewBody": "Absolutely delicious! Huge hit tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarbaraG"
},
"reviewBody": "Absolutely perfect! Only changes I made was I had leftover green beans so I used them and I use fresh carrots and sautéed them with the celery. Also I had half-and-half left over from Thanksgiving so I used that instead of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "I omitted the green beans and subbed cubed potatoes (boiled with the celery) and added roasted garlic. So yummy@@"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "BEST POT PIE EVER!!!!. I have been making this recipe for about 7 years now. To the point I crave it! I will make turkey just so I can make the pot pie. I will make 2 at a time, the second pie I will cut up and freeze as individual pieces. VERY convenient to grab a piece and take to work for lunch. LOVE, LOVE, LOVE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred"
},
"reviewBody": "My first time trying to make homemade pot pie and it will not be my last. This was pretty easy and tasted really good. The pie didn't turn out pretty because it was hard to get the second pie crust to fit good on top but didn't affect the taste. The only change I did was to use a bag of frozen mixed vegetables instead of the frozen peas and carrots and green beans. Thank you for this wonderful easy recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celina Matabuena de Garcia"
},
"reviewBody": "Followed recipe to the T and made no substitutions. It was absolutely amazing. The trick is in the sauce. The sauce should not be runny or your pie will be runny. This would be amazing with rotisserie chicken as well. Updating because I reviewed this in 2014 and I still make this and it’s now 2022. Leftover turkey or rotisserie chicken. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Musso"
},
"reviewBody": "My family loves this so much that when I make it I usually freeze half of the filling for another week. Usually, make this with chicken and it's an absolute hit. Thank you so much for sharing this with us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol1818"
},
"reviewBody": "This was amazing! I added mushrooms which made it even better. It made more than I expected so I froze a portion for a later time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annie mac"
},
"reviewBody": "This recipe is legit: the flavors are on point and it's easy! I half the recipe, and put the turkey/veg mixture into two individual crocks. Then, I cut my pie crust into strips so it's easy to split one crust between the two crocks - I just use the crust for the top, weaving the strips for a cute design. It is perfect for cozy nights indoors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "This was so good! We made a Turkey a few days ago and used the leftovers. Super easy and the seasoning is on point. I wouldn’t change a thing. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bklynsu"
},
"reviewBody": "Made it 5 times. My 1 yr old granddaughter adores this. So healthy and comforting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HMC"
},
"reviewBody": "This is my \"go to\" recipe (with a few modifications of course) for leftover Costco rotisserie chicken. I make the filling and freeze in 1.5 cup increments. Whenever we feel like a pot pie I thaw out a couple and make a pie crust and viola - homemade pot pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Vanderlee Loader"
},
"reviewBody": "Perfect! Simple, Easy and Tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great filling, I prefer to make my own butter or lard crust. Found it best to run frozen lard/ butter through a grater. Very yummy, thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing recipe! I’ve tried others that didn’t go over so well. This one has been the best by far!! Thanks for sharing it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefB"
},
"reviewBody": "This is the best pot pie ever. I’ve made it many times for a yearly church fund raiser. I serve about 120 people. Everybody loves this pie, and I direct them to this site every year. I make no changes to the recipe. I entertain often, and am very disappointed the recipe Calculator no longer works."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Combine with all butter crust... absolute culinary perfection. There is nothing else to say. Thank you for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Rexrode"
},
"reviewBody": "Best Pot Pie Ever!!.. I did take the suggestion to add more milk, less flour for a creamier filling. I added mushrooms, and used a package of mixed vegetables that I steamed in microwave, instead of peas and carrots. I think next time I will saute the celery with the onions and mushrooms. Cooked one and froze the other, and can't wait to have leftovers. Best Recipe ever. seasoning is perfect as specified by the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "An absolute favorite in my home: quick to make &amp; bake. It does not last for very long in our household, a recipe to keep forever❣️ Because Rosemary is our favorite herb, I spray the bottom &amp; top pie crusts with Pam &amp; sprinkle crushed Rosemary on both shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy LeMaster"
},
"reviewBody": "Very flavorful and moist filling with crispy crust. Yum! My husband's favorite comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aida E"
},
"reviewBody": "I used my own homemade pie crust. Also used a package of frozen mixed veggies. I cooked the veggies in chicken broth (quantity in recipe) instead of water. Other than that I followed the recipe. A great recipe. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Spear"
},
"reviewBody": "We love this recipe exactly as written. I make it throughout the year with chicken. It is easily halved although so nice to have 2 pies with one to freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been using this recipe for years, it's always been my go to during the few times each year we have turkey. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rose"
},
"reviewBody": "Not very flavourful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hharrison8"
},
"reviewBody": "Wow, I can't believe I never left a review and i have made it since 2019. The first time i made it my daughter wasn't going to have any and brought drive-through food when she came over. Now I have to get a huge turkey so I can make her her very own to take home after she has ours. What a compliment that was to me. I followed the recipe exactly. Thank you for sharing it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Bell"
},
"reviewBody": "Fabulous. Made it a couple times and of course have modified it. Use canned green beans instead of frozen because I like the flavor better. Hot tip from another cook is using the broth to defrost the frozen stuff, don't really cook much it as it will cook in the pie. I also saute the fresh celery with the onion like I'm making soup. Take your time and thicken it properly, I've rushed and the pie comes out a bit runny, which should not have been a surprise. next I will try the poultry seasoning rather than Italian as recommended elsewhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimkellie15"
},
"reviewBody": "Super recipe. Easy to make and great taste.so glad I found this recipe and have made it many...many times. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovelondyn"
},
"reviewBody": "Turned out great! I left out onions and peas and just added a little extra onion powder and it was amazing! Whole family approved! Have also made with chicken and it was equally delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdyates"
},
"reviewBody": "This was a big hit with the lab. The recipe was modified with respect to those who do not like frozen green beans or peas of any kind, so potatoes were substituted for those; the recipe doubled well and we ended up with 3 double crust and 2 single crust pies. The seasonings and liquid to solid proportions were perfect and considering the two cooks were not experienced with pot pies, this recipe earns five stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mulderfam40"
},
"reviewBody": "This is amazing! The roux is perfectly spiced. BEST OF ALL - it was SO EASY! I made it after school and it was ready about 6:15. Another plus, everyone in my family ate it - from the selective girls to the \"will eat everything in sight\" boys. WIN!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "techstu63"
},
"reviewBody": "This turned out wonderful! I didn't want to resort to canned cream soup. Like a few other reviewers I made some changes, mainly swapping out some of the vegetables since I didn't have green beans. I added diced potato and some canned corn to up the starch a little since I didn't use a bottom crust. That would have made it very rich for our family. The main attraction is the sauce and the seasonings though. The only change I made was adding a half tsp of garlic powder. I will say there is a drawback in that it is a little time consuming, but worth it in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake Davis"
},
"reviewBody": "This was absolutely fantastic. Truly a classic pot pie recipe. It's hearty, thick, and full of flavor. I'd recommend using homemade crust. It would add another layer of flavor and quality. I'll be adding this to my recipe list for my kids when they're older."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bl_ehrler"
},
"reviewBody": "I absolutely love this recipe. I've made turkey for one on Thanksgiving so that I can make this delicious recipe. I've given it to many individuals because it is simply the best.\n\nRecently I tried it with cubed rotisserie chicken. I now make it regularly using chicken, to me it is as good and some might like it better. I like making my own pie crust. So I've been making mini Chicken Pot Pies, since I cook for one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie DeMore Anzalone"
},
"reviewBody": "This was the BEST pot pie ever. Didn’t change a thing, it was amazing! Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deb60bow"
},
"reviewBody": "Tasty with perfect amount and consistency of “gravy” holding chicken and veggies together in pie. Took about 45 mins to nicely brown the crust. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Boldt Bellamy"
},
"reviewBody": "AMAZING! Not typically a fan of pot pie, but was bound and determined to use up leftover turkey. Wow! The whole family loved it! This will be my go-to for leftover turkey from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "8568khp8d8"
},
"reviewBody": "Best recipe for Turkey Pot Pie hands down!! Family loved it!! Definitely will make more and freeze them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boomer1124"
},
"reviewBody": "This was amazingly good and flavorful. I may have put a little too much flour. Next time I will scale back about 1/4 cup. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellimay"
},
"reviewBody": "I LOVE this recipe and usually increase filling to make 5 pies and freeze them - prior to baking. Once thawed, bake as you would have initially. This brings back that wonderful aroma of turkey at a later date...effortless cooking at its finest!! I have on occasion roasted a small turkey just to get pot pies into the freezer. ?? My pie pastry recipe is enough for 5 pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Micamus"
},
"reviewBody": "Very good, but there was too much pepper for us. Next time I will only use 1/2 teaspoon of black pepper. I think I will change the Italian seasoning to poultry seasoning too. We will also freeze one pie before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hawaiianinbeaufort"
},
"reviewBody": "This Turkey Pot Pie.\n\nThis pie. OMG. So good!! I do not understand the not so good reviews, because this pie was so simple and absolutely ONOLICIOUS!!!!\n\nI am not a pie expert by any means, by this recipe definitely was easy to make and flavorful on the tastebuds!!!\n\nYay for Dad's Leftover turkey!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanyek75"
},
"reviewBody": "I made it for my husband and myself! It was great! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harlandkatrina"
},
"reviewBody": "Amazing! The best filling flavor I’ve made out of many recipes! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcjohnson13084"
},
"reviewBody": "Good recipe, I did make a few changes only because I worked with what I had. I did use some minced garlic in this recipe along with thyme and marjoram. I didn't have the Italian seasoning but it worked out wonderfully still! Also, I cooked the carrots, celery, onion, and garlic all in the butter until soft, then I threw in some white wine (about 1/2 cup) and let it evaporate. I then added the flour and let it cook for a minute or two. After putting the broth (I did 2 cups) and milk in, I added some finely grated parmesan (around 1/3 cup) for more flavor and to thicken the mixture more since I used extra broth, and it turned out amazing! I love that this recipe is versatile and can be made with just about anything you have on hand! Will definitely be used again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Recipe was great. Add 1/4 cup leftover gravy to make a juicier pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "a"
},
"reviewBody": "Great recipe. Easy, not labor intensive, I used the frozen veggie mix otherwise followed recipe to a t. For those who care, it's a thick consistency and the seasonings very flavorful. A yummy, hearty and substantial meal for a hungry crew. I also like the fact that you can freeze one of of the pies for future use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thaz"
},
"reviewBody": "Made it the weekend after Thanksgiving. It was awesome. I am making it tonight using left over chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbush1970"
},
"reviewBody": "Made this today for the first time and it was incredible. I added some diced potatoes to it and it was perfect. The flavours are delicious, it’s a hearty filling too and everyone loved it. It’s going to be my go-to from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Forrest Mauch"
},
"reviewBody": "I've been making this Dads recipe for years. Every time my husband gives it a 5 out of 5 stars! Sometimes I use puff pastry crust when I have it and it is amazing as well! Make it exact every time ....don't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "IU made a total of 4 turkey pot pis adjusting the recipe accordingly. All of them were quite delicious, tender on the inside with flaky, crunchy crust. My family loved everyone I cooked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snoopygal22"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Plaza"
},
"reviewBody": "I made this pie for the first time with Thanksgiving turkey leftovers. One for home and one my son took to share with his coworkers. It was a big hit! So delicious! I tried it again yesterday with rotisserie chicken... also delicious! I shared one with my neighbor. Easy, quick, and so yummy! Thanks for sharing this recipe! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farris brown"
},
"reviewBody": "I followed the recipe exactly. It turned out great. I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacymiller410"
},
"reviewBody": "Only thing I added was when cooking the onions until translucent afterwards I added one can of Campbell soup turkey gravy prior to adding the chicken broth milk and flour also I tend to take the flour in the milk and whisket together so no lumps it turned out phenomenal this way all the ingredients for the same except for adding the additional can of Campbell soup turkey gravy highly recommended"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pstewart138"
},
"reviewBody": "Excellent recipe, everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "n9g7bsdgxk"
},
"reviewBody": "This recipe results in the best pot pie I’ve ever had. It’s flexible, so toss in other vegetables you have on hand. At different times I’ve added cubed potatoes, mushrooms sautéed with thyme, corn, etc. I typically make one pie, and freeze the remaining filling for later use. That eliminates possible crust damage and it takes up less space in the freezer. Just thaw and make another pie when you want. I’ve made it with both turkey and chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clemmie King"
},
"reviewBody": "Wow, what a great way to use leftover Thanksgiving Turkey! Made 1/2 the recipe for one 9.5\" pie only. Used Krusteadt crust mix and did add three ingredients: bay leaf, 1/8 tsp cayenne, and susbituted 2/3 of the chicken broth with leftover homemade Chef Johns make-head Turkey gravy from this site. Delicious after cooling off 10 minutes, and as leftovers the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ttmccarthy"
},
"reviewBody": "Great recipe! I used 4 cups of potatoes, carrots and corn for the veggies. Other than that I followed the recipe exactly. By far the best pot pie I have ever made!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Yates"
},
"reviewBody": "Wow. I've never made a turkey pot pie, but I definitely will ever year now! I added 'no sodium added cream of chicken soup' to the mix rather than using broth. It actually still needed salt! Just make sure to taste as you go. I simmered all the veggies together in oil (with all the seasoning) - boiling and straining just seems like a hassle. Then I dumped the turkey, cream of chicken, some water, and flour into the mix, simmered a bit more, then baked it in the premade crusts. Wowza! Super simple, quick, and seriously delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "r454600"
},
"reviewBody": "The only change I made is I replaced the upper crust with canned biscuit dough. The teaspoon of salt may be a bit much depending on your leftover ingredients. The recipe was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hallieann"
},
"reviewBody": "Halved the recipe to make just one pot pie, and substituted corn for peas, but otherwise followed the recipe exactly - came out absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "v.c.r.dr.1055"
},
"reviewBody": "I'm a chef , and always looking for something new to make. I made this for my family early in the morning and they thought it was just marvelous, But my daughter did not like the crust, she said to me that she loved my home made better, then the store bought.I told her that some people like using the store bought. Now myself ,I'd prefer making it from scratch. I thought the Turkey Pot Pie was great . Thanks for sharing it with us. Jim C."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patrick2741"
},
"reviewBody": "This was a great recipe for the filling. Unfortunately I tried to make a homemade crust and that was great effort. I will use premade pie crusts next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scottysgurls"
},
"reviewBody": "This recipe is SO SO yummy! I followed the direction to a T, except I bought a bag of frozen mixed veggies, green beans, peas, and corn and I used less celery then the amount called for but it is a yummy delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hpnyjfgtq2"
},
"reviewBody": "This was amazing! My husband does 99% of the cooking. He doesn’t like turkey but I make the Thanksgiving turkey (which he didn’t eat). He found this recipe for the leftovers and let me cook. He had 2nds; he loved it that much! We will definitely do this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christituit"
},
"reviewBody": "This was truly leftover pot pie. I halved the recipe because I only had enough pie crust for 1. Used leftover green bean casserole, corn, and turkey from thanksgiving. I really like the \"gravy\". Family liked the pepper flavor, and are all eager to have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiffanymd18"
},
"reviewBody": "Cut ingredients in half because I only made one. But so far it smells good. Currently in the oven still."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeanne Hirsch"
},
"reviewBody": "A bit too dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth "
},
"reviewBody": "I made this as written and our family LOVED it! I’ve learned that adding Italian seasoning to recipes that I would normally not, adds such a surprising depth to the food. I would definitely make this again.. and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m2kbphkj59"
},
"reviewBody": "This is my third Thanksgiving coming back to this recipe for my leftover Turkey! My family LOVES it! It’s definitely a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarlaD"
},
"reviewBody": "OMG, this stuff is SO good. I think, with any pot pie recipe, that substitutions will occur because all of us don't have the \"exact\" ingredients, but instead, we make do with what we have. I made the filling using corn (I didn't have peas), butternut squash (I had no carrots) and small cubed potatoes (no green beans in the pantry). I also used THE BEST butter pie crust recipe and made my own crust. This recipe is definitely a keeper and I'm very picky. Make this y'all. It will NOT disappoint."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "virginia wedemeyer"
},
"reviewBody": "Easy and good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shuttlegal"
},
"reviewBody": "Made this as written, just did half a recipe though. Seasoning was spot on. Hubby is not a pot pie fan, but he had 3 servings of this! Served with a side of home-made cranberry sauce for a deconstructed turkey dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bradym.nmsu87"
},
"reviewBody": "Came out awesome!! I made it at half the recipe and added cayenne pepper to the turkey. The whole family ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Jerry J"
},
"reviewBody": "This was fantastic. I had son me leftover turkey breast that I over-cooked. It was awful when I first served it. After dicing and cooking with the rest of the filling ingredients it was very tasty. \n\nI left th celery seeds out (couldn't find em) but followed the rest. Yummy and easy. You can't miss with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stoneagemom001"
},
"reviewBody": "Made this for dinner today. Followed recipe as written; except I used some frozen smoked turkey meat we did last month. Very easy to put together. My husband and I loved it. Have enough leftovers for another meal. Thanks for sharing your recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/215447/dads-leftover-turkey-pot-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/2268/main-dish/savory-pies/pot-pie/",
"name": "Pot Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16182/main-dish/savory-pies/pot-pie/turkey-pot-pie/",
"name": "Turkey Pot Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/215447/dads-leftover-turkey-pot-pie/",
"name": "Dad&#39;s Leftover Turkey Pot Pie"
}
}
]
}
}
, "about": [
]
}
]