				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Dal Makhani (Indian Lentils)"
,"datePublished": "2019-06-17T18:11:10.000-04:00"
,"dateModified": "2022-08-16T15:37:51.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SOGOLONDJATA"
,"url": "https://www.allrecipes.com/cook/773264"
}
]
,"description": "These richly spiced lentils are simmered for two hours in a spicy tomato sauce and finished with splash of cream for a filling side dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gtwUVjEf37TO_1aobOc6Qh8cW0M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1257894-dal-makhani-indian-lentils-tox-4x3-1-0c7d3e0dc3ea4d96ba7ba733a38c5225.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Dal Makhani (Indian Lentils)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "81"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "390 kcal"
,"carbohydrateContent": "37 g"
,"cholesterolContent": "48 mg"
,"fiberContent": "16 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "420 mg"
,"sugarContent": "3 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup lentils",
"0.25 cup dry kidney beans",
"water to cover",
"5 cups water",
"salt to taste",
"2 tablespoons vegetable oil",
"1 tablespoon cumin seeds",
"4 cardamom pods",
"1 cinnamon stick, broken",
"4 bay leaves",
"6 whole cloves",
"1.5 tablespoons ginger paste",
"1.5 tablespoons garlic paste",
"0.5 teaspoon ground turmeric",
"1 pinch cayenne pepper, or more to taste",
"1 cup canned tomato puree, or more to taste",
"1 tablespoon chili powder",
"2 tablespoons ground coriander",
"0.25 cup butter",
"2 tablespoons dried fenugreek leaves",
"0.5 cup cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place lentils and kidney beans in a large bowl; cover with plenty of water. Soak for at least 2 hours or overnight. Drain."
} ,{
"@type": "HowToStep"
,"text": "Cook lentils, kidney beans, 5 cups water, and salt in a pot over medium heat until tender, stirring occasionally, about 1 hour. Remove from heat and set aside. Keep the lentils, kidney beans, and any excess cooking water in the pot."
} ,{
"@type": "HowToStep"
,"text": "Heat vegetable oil in a saucepan over medium-high heat. Cook cumin seeds in the hot oil until they begin to pop, 1 to 2 minutes. Add cardamom pods, cinnamon stick, bay leaves, and cloves; cook until bay leaves turn brown, about 1 minute. Reduce heat to medium-low; add ginger paste, garlic paste, turmeric, and cayenne pepper. Stir to coat."
} ,{
"@type": "HowToStep"
,"text": "Stir tomato puree into spice mixture; cook over medium heat until slightly reduced, about 5 minutes. Add chili powder, coriander, and butter; cook and stir until butter is melted."
} ,{
"@type": "HowToStep"
,"text": "Stir lentils, kidney beans and any leftover cooking water into tomato mixture; bring to a boil, reduce heat to low. Stir fenugreek into lentil mixture. Cover saucepan and simmer until heated through, stirring occasionally, about 45 minutes. Add cream and cook until heated through, 2 to 4 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT255M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Warning that \"chili powder\" should be the Indian red chili (hot or the mild kashmiri) not the average American chili powder which is a spice blend. I recommend substituting cayenne and/or paprika for the Indian chili powder. \"Bay leaves\" are different among different cultures. These should be tej patta (Indian Bay leaf) not the average American laurel leaves. Also saying \"Kasuri methi (fenugreek leaves) is almost impossible to find in the U.S., even in NYC\" is ignorant and lazy. If you can't get to an Indian grocery store, then order online. Tons of Indian restaurants and millions of Indian people need ingredients in the U.S. and don't have difficulty finding them, especially the NYC metro area."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aizausa13"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary H"
},
"reviewBody": "I really loved this recipe - eyeballed the amount of salt down to a few shakes, and doubled the amount of lentils. I also took the lazy way out and used jarred spices (horrors!) but it was still amazing. I used a curry blend and graham masala blend to get cloves, coriander, cinnamon etc. and fried up onions + garlic instead of the raw spices in the butter. Skipped all oil. 2 cups of lentils and 4 tbsp butter, half a package (4 oz) of cream cheese added at the very end was just enough to give a creamy consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darktangerines"
},
"reviewBody": "I served this over white rice. This tasted phenomenal! I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSWEIGL"
},
"reviewBody": "This was wonderful! I cooked half an onion with the cumin seed and 1/2 can of kidney beans. 2 tsp salt for 6 servings is perfect. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "This \"Dal Makhani (Indian Lentils)\" was good; however, it was very spicy for my taste. I used real Indian chili powder from the Indian market (something like cayenne pepper rather than Western-style chili powder) and reduced the amount to 1 teaspoon (not 1 tablespoon of chili powder as stated in the recipe). I used coconut milk instead of cream (so yummy). Thank you SOGOLONDJATA for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jody"
},
"reviewBody": "I would not.break up the cinnamon sticks. Probably add a little more cayenne. I added 1/4 cup of green lentils which keep their shape and give a bit more texture. Instead of the larger kidney beans I used smaller pinto beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mands"
},
"reviewBody": "i normally make Dal a few different ways. My family thoroughly enjoyed your methods. my apologies i have no photos now. Will send with my next batch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smallwifedi"
},
"reviewBody": "Very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrazyMary"
},
"reviewBody": "In first part I substituted organic gluten free beef broth for water and French olive oil for vegetable oil. To keep dairy free, I substituted 2 T. expeller cold pressed raw coconut oil for the butter. Yum. This freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kamala Gupta"
},
"reviewBody": "I can say that this recipe was amazing, I made it a vegan version. I used vegan butter and coconut cream in place of cow's butter and cream. The more recipes that I come out with, makes me not want to go out to eat! Thank you for sharing this recipe! Kamala Gupta"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elle Wilk"
},
"reviewBody": "the best lentil I've ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buck & Suzy's Kitchen"
},
"reviewBody": "I love all the flavors.... so awesome. I did skip the beans and salt. I used a full badge of dried lentils, added a ham shank and cooked in insta pot. Then added cubes sweet potatoes and cooked for another ten minutes with more water. Super yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Annese"
},
"reviewBody": "Love this recipe. The whole family loves it also and requests it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "regiebaba"
},
"reviewBody": "Delicious! Very big hit with husband."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Very satisfying &amp; comforting. I like it so much I've made it multiple times. I soak the lentils 2+ hours and add 1 can of drained and rinsed kidney beans once lentils are cooked. Coconut milk in place of cream; pure maple syrup in place of fenugreek, 2 tsps ground cardamom in place of pods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EB"
},
"reviewBody": "Lower salt to 2tsp. Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I used red lentils and while it was good, as others have said, it was far too salty! I’ll be cutting down from 2 Tbsp to 2 tsp. of salt next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WDB"
},
"reviewBody": "One of the very best and most authentic Indian recipes that I've ever found. A symphony of tastes and textures. I served the dish to Sri Lankan monks, who complimented it as well. I made no changes except to add dry red peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "james"
},
"reviewBody": "This is the 2nd time I made this and it is wonderful. I love lentils and I love Indian food and this does not disappoint. I served it with Namn bread and hummus and zucchini latkes. I did add a carrot and 2 red potatoes. I was thinking about how good a sweet potato would taste in this when my spouse said the same thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blog baster"
},
"reviewBody": "Nice Recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alli Shircliff"
},
"reviewBody": "Super good recipe. I used white beans instead of kidney beans. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tami Demayo"
},
"reviewBody": "This is a wonderful recipe! I love the complexity of the flavors and agree that the fenugreek leaves add a lot. If you have a Mediterranean market nearby, you ay find it there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aanata"
},
"reviewBody": "Love it! I would cut a bit of the salt next time and put the harder spices in a tea ball... biting into a cardamom pod is a bit unpleasant. That being said I've been looking for a recipe like this for a while now. It's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne Harrington"
},
"reviewBody": "Super yummy! I ground up the whole spices, I did not like the whole seeds getting stuck in my teeth. I also used different colored lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cameron Macfarlane"
},
"reviewBody": "My girlfriend made this for dinner after a long day and mistakenly followed the recipe which calls for 2 tablespoons of salt. This recipe should be corrected or taken down. Recipes like this are why I refer to this site as the craigslist list of cooking. I blame this site, and it's users (Yeah I am talkin' to you AL, who gave this recipe 5 stars). If this site functioned properly it would allow users to moderate recipes so this type of error wouldn't occur."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wannabeabhalla"
},
"reviewBody": "I think I’ll omit atleast half the salt next time. Otherwise appreciate the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Jones Holloway"
},
"reviewBody": "Although this was very tasty, it was a little too soupy. Next time we'll use less water from the lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "el_callejero"
},
"reviewBody": "Taste great. Easy to prepare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Sterkowitz"
},
"reviewBody": "My husband and I loved this recipe. I left out the kidney beans and the ground coriander because I didn't have either. I was able to find dried fenugreek leaves on Amazon. The flavor was amazing. This will be a standard recipe around my home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "minerva49"
},
"reviewBody": "Tremendous flavor. I made no substitutes; I hunted down each of the ingredients, including the fenugreek leaves and the Kashmiri chile powder, which I got from Amazon. The only thing I might change next time is to drain off some of the cooking water before adding all the other ingredients, because it came out a wee bit soupy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Whitney"
},
"reviewBody": "Super flavorful and a GREAT templet recipe to either follow exactly or to make changes. Like most everyone else, I made changes based on what I had in the house (substituted leftover salsa for tomato sauce, added carrots and browned onions, etc, etc) . Also cut back the salt. I thought it was delicious and I imagine that it will be even better tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "She Woody"
},
"reviewBody": "This was DELICIOUS!! I did take other reviewers' suggestions and reduced the salt to 2teaspoons. I'm also giving it 4 stars because the recipe doesn't tell you to remove the cinnamon stick, cardamom pods or other whole spices. This was problematic when I took a giant bit of cinnamon stick. ?? More seasoned cooks would have remembered/known to do this, but the written reminder would make this a 5 star recipe. The flavors were SO rich and full. I'd also strongly recommend adding cream, or even milk if you can handle being less-than-authentic. Served over boiled potatoes and was sucked down by the whole family--picky 2 and 4 year olds included."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicki Micheaux"
},
"reviewBody": "Turned out great! My daughter (12) loves it. I made a couple of changes. I didn't have whole cloves or cinnamon or coriander seeds - so I just threw in a few pinches of each - equal amounts. Also didn't have purée - so I added a can of paste that I watered down w 8 oz of water. Skipped the fenugreek leaves, the cream, and the cayenne. Loved this dish so much - better than I've gotten at the Indian restaurants in the neighborhood!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leanna"
},
"reviewBody": "Yummy! Toasting the spices was a little messy but fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vic"
},
"reviewBody": "Made this with the reduced salt and it was the best Indian recipe I've made so far, and I do a lot of Indian cooking. My guests were licking their plates. I have one little comment and that is the lentils were cooked until they completely broke down. It didn't seem to bother anyone else, but I like to bite into lentils. Next time I'll cook them for 15 minutes instead of the hour and see if that helps them keep their shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pywacket1952"
},
"reviewBody": "This is so delicious! I think it was a bit too salty, but other than that, perfect! I hope this contributor has more recipes. This is the first Indian food I have made that actually tasted authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BHoward"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Ellen"
},
"reviewBody": "This was great! I reduced the salt and oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sleepybot"
},
"reviewBody": "This was a great recipe! Like a lot of cooks here, I used less salt as well. Loved the flavor of this dish. I would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue E. Inderhees"
},
"reviewBody": "Delicious recipe and I can see myself making this regularly. I skipped the butter entirely and used coconut milk (because I had some in the fridge that I wanted to use up) instead of the cream and it was still quite good. Also I used 1/2 can of kidney beans stirred in when the lentils were almost done instead of dry beans. Drained most of the water from the cooked lentils, and skipped the fenugreek because I didn't have that, next time I'll pick up some from the Indian grocery on the other side of town. \n\nAnd like everyone else I reduced the salt to 2 tsp. I think that it's traditional to leave the whole spices in the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "margaritaconsal"
},
"reviewBody": "Just a couple of changes but still amazing flavor. Totally recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gluten Positive"
},
"reviewBody": "This is really really good! Be careful of the spices at the beginning. They burn easily! Otherwise really easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alhousto"
},
"reviewBody": "Following other reviewers' suggestions to reduce the salt to two tsp., I followed this recipe, and it was delicious. I've only ever had restaurant (probably americanized) Indian dishes, so I can't speak to the authenticity, but it was so tasty I don't care! Initially made without the cream and it was great, but since I had some in the fridge to use up I went ahead and tossed it in. Excellent both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wellgirl"
},
"reviewBody": "This dal makhani is awesome!!! Of course, the salt in the recipe was just an oversight. I used about 1 teaspoon and didn't miss it at all. I didn't have any kidney beans, so I just used a few more lentils. Also, I took note of another reviewer and added in one diced yellow onion that I browned and cooked with the cumin seeds. \nOverall, I have a feeling that this will be a weekly favorite in my household. It's very easy with tons of dynamic flavor. Thanks for the new family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Davis P"
},
"reviewBody": "This is delicious!\nI used a lot less salt, added an onion, and simmered all day. The flavors came together beautifully. Served over rice with a side of greens w/nutmeg and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mookie"
},
"reviewBody": "Amazing recipe but do not add as much salt as it calls for! 1 tsp is plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "daniella"
},
"reviewBody": "TOO SALTY!! This recipe has a lot of delicious flavors going on but I really wish I would have read the other comments about the salt. I would reduce the salt to maybe 1 or 2 teaspoons. I'm wondering if the person who wrote this recipe meant to only put 2 tsps and mistook tsps for tbsps. Also, I'm not sure where the picture thats shown is from, it doesn't look like that at all. Then again, I couldn't find fenugreek leaves and used ground fenugreek seeds instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggie-cita"
},
"reviewBody": "This was delicious! So flavorful! I tasted the beans before adding the spices to see if the dry kidney beans were soft yet and it was like taking a drink from the ocean! Had to pour the beans through a colander, put back in pot, and add water then continue. I should have read the comments haha, easy on that salt! Vegan butter worked like a charm. Throughly enjoyed this, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mahnaz"
},
"reviewBody": "Dried fenugreek is easily available in Indian grocery stores ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ed Trotter"
},
"reviewBody": "I made this yesterday and found the salt content to be way too high. I've hand written a comment to use two TEAspoons of salt, not two TABLEspoons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gay"
},
"reviewBody": "Dried methi leaves, even fresh bunches of leaves, are found in almost any Indian grocery of which there are many in the ny/ nj areas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "This was delicious. I used only 1 Tbsp. of salt, though, and that was plenty. I might even reduce it next time. I also couldn't find fenugreek leaves; it was still very flavourful without them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Ann McFadden-Bogantes"
},
"reviewBody": "While it isnt the best indian recipe its by far the worlds best lentil recipe but I didnt use much salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Shumway-Khan"
},
"reviewBody": "My husband and I have made many different types of dal over the years, that were all great, but we will be making this dal makhani for now on. It's absolutely delicious!!! In fact my husband loved it so much he had leftover dal and brown rice for breakfast this morning, lol!\nI did make some minor changes to the recipe. Instead of 2 Tbsp salt, I only added 1 tsp of salt and it was plenty enough, I may consider adding even less the next time I make it. Also, in place of the butter and heavy cream, I used 2 Tbsp trans-fat free margarine and fat-free half and half. And lastly, SOGOLONDJATA is right, fenugreek leaves are close to impossible to find state side. I added 1 Tbsp fenugreek seeds in place of the leaves; the flavor is much more intense in the seeds, but they are much easier to find in an Indian spice market. \nBe sure to remove the bay leaves, cloves, cinnamon (I left it whole; its easier to fetch out) and black cardamom before eating, especially if your serving to children. Another thought ~ after toasting the spices, it would be fairly easy to wrap them in cheese cloth.\nThank you so very much for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Baldridge"
},
"reviewBody": "I also cut the salt - 2tsp works great. I have most of these spices in my cupboard, but I was missing a few - didn't matter. I also used ghee instead of butter, which is the magic answer for me. Get it at Indian grocers, Trader Joe's, or make some clarified butter yourself. It's worth it. Very rich and warm - and delicious with basmati rice. Note: I removed the bay leaves before eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bhmnrhpsdy"
},
"reviewBody": "Warning to anyone who wants to try this recipe: use 2 TEASPOONS salt - or even less and add as needed. The dish smelled and looked amazing and was absolutely delicious except for the extreme saltiness. Unfortunately, I couldn't fix the doubled recipe and decided to dump the entire thing out. Will definitely try again some time soon, with MUCH less salt - and will probably use kosher instead or regular salt. I had read the previous reviews and reduced the amount of salt but didn't realize by how much I should have reduced it by. I'm sure my next attempt will turn out great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Davisfam08"
},
"reviewBody": "This recipe was tried by my family during Phase 1 of South Beach. We did not use any of the optional ingredients and omitted the butter. We did add some butter flavor. We salt our meals at the table, so I cannot remember how much salt we added. This is authentic Indian food with the raw form of spices. Chew carefully to keep from biting a clove etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "takelondon"
},
"reviewBody": "I have to agree with cengelberg, the recipe shown is far too salty. I made the recipe for 6 people and it called for 2 tablespoons of salt, but change that to 2 teaspoons and you'll be fine. I also used canned kidney beans instead of dry, so if you go my way be sure to drain the excess water after cooking the lentils and beans or you'll end up with dal makhani soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Caroline Gelber"
},
"reviewBody": "I think the recipe would have turned out great if much less salt was used. I adjusted the recipe for 16 people and it called for 1/3 cup salt. It was extremely salty. Tried to reduce salt by adding potatoes with minimal results. I would recommend at least halving the salt content and work up from there."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/222667/dal-makhani-indian-lentils/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/222667/dal-makhani-indian-lentils/",
"name": "Dal Makhani (Indian Lentils)"
}
}
]
}
}
, "about": [
]
}
]