				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Danish Almond Puff"
,"datePublished": "2019-04-03T23:31:55.000-04:00"
,"dateModified": "2022-09-16T18:37:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "WarringEagle"
,"url": "https://www.allrecipes.com/cook/595083"
}
]
,"description": "This elegant Danish is surprisingly easy to make. Slices freeze well, too."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4BimDpMCAc9DfDez24TX0SUBER4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6199819-danish-almond-puff-DIZ9829-4x3-1-ea822501c1cd4bb9a78fdb9e20a72163.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Danish Almond Puff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "50"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "424 kcal"
,"carbohydrateContent": "42 g"
,"cholesterolContent": "131 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "193 mg"
,"sugarContent": "18 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"0.5 cup butter, softened",
"2 tablespoons water",
"0.5 cup butter",
"1 cup water",
"1 teaspoon almond extract",
"3 eggs, beaten",
"1 cup all-purpose flour",
"1 cup confectioners' sugar",
"1 teaspoon almond extract",
"1 tablespoon milk, or as needed",
"2 tablespoons candy sprinkles" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place 1 cup of flour in a medium bowl. Mix in butter using a fork or a pastry blender. Sprinkle 2 tablespoons of water over, and stir with a fork until dough comes together. Divide into two balls. Pat dough into two long strips on an ungreased baking sheet, about 14 inches long and 3 inches wide. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a saucepan, combine 1/2 cup of butter and 1 cup of water. Bring to a rolling boil. Add 1 teaspoon of almond extract and remove from the heat. Immediately stir in 1 cup of flour until the mixture pulls away from the sides of the pan. Gradually stir in the eggs until well blended. Divide evenly, and spread over the two crusts on the baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden, about 1 hour. Allow to cool almost to room temperature before frosting."
} ,{
"@type": "HowToStep"
,"text": "To make the frosting, mix together the confectioners&#39; sugar, 1 teaspoon of almond extract and a splash of milk in a small bowl until smooth. Add more milk if necessary to make a pourable glaze. Drizzle over the Danish, and decorate with candy sprinkles if desired."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The top layer was a hot mess. I’ve made a similar recipe in the past, and the top layer is really more like a choux paste than anything else. In this version, 1 cup of water with 1/2 cup butter and 1 cup flour and 3 eggs makes a liquid mess that doesn’t hold together well enough to “spread” on anything. Either the proportions are off, or instructions aren’t clear."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva"
},
"reviewBody": "I have been making this for years and love it. This time I cut the recipe in half as we don't need all of this around to tempt us. As it is best warm. Love that I don't have to look in my recipe book to get this again. Thank you Allrecipes for having everything I am looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve been making these Danish puffs for 30 years and I LOVE them but suddenly they’re flopping and I don’t know why! This was my signature dessert that I brought everywhere. I still follow this recipe in exactly the same way but pastry doesn’t rise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Katlar"
},
"reviewBody": "Help! Enjoyed this at a church social and the baker had included this exact recipe. I made the water, eggs, flour and almond extract as written in the order described and it was pure liquid. There was no chance at “spreading” it onto the pastry strips. I poured the whole thing onto the strips, thinking maybe some of it would puff up enough on top of the pastry, and I would be able to get the glaze on it. What a disaster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Bollen Jamieson"
},
"reviewBody": "I also have been making this recipe for probably 35 years. I love it \"just the way it is\". Someone said \"skip the bottom\" and someone else said \"the top tastes too much like egg\". Ignore those comments and make it exactly as written. Both the bottom and top are great and they compliment each other masterfully. I do always put the slivered almonds on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIZ&#9829;"
},
"reviewBody": "Can't believe I made something like this! It looks intimidating, but is really very easy to make. Don't know why I waited so long to make it. I would recommend making 4 -- 6 x 3 inch pieces to ensure even baking. Mine looked over done after 45 min. so I took it out of the oven. The ends were baked perfect, but the middle was dense, doughy, and did not puff. Other than that, this is amazing! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Root Hill"
},
"reviewBody": "I LOVE THIS RECIPE AND SO EASY . REQUIRES NO SUGAR EXCEPT FOR THE GLAZE. I HAVE EXPERIMENTED WITH THE TOPPINGS BECAUSE I LOVE CINNAMON AND THIS IS EASIER TO MAKE THAN CINNAMON ROLLS. RIGHT BEFORE I PUT IT IN THE OVEN I SPRINKLE SUGAR AND LOTS OF CINNAMON ON TOP OF ONE AND THEN FINISH JUST LIKE THE RECIPE. I HAVE ALSO PUT A LITTLE JAM OR JELLY ON TOP OF ONE AFTER TAKING OUT OF THE OVEN AND THEN GLAZED. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "This is the same recipe my mom used for years except her's didn't have nuts and she would make 1 plain and 1 chocolate (just adding cocoa powder to the glaze). My brother had been requesting it but I had lost my mom's recipe. Thankfully I found this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fire Mountain Farm"
},
"reviewBody": "I've made this 100 times. I make a savory version putting thyme and garlic powder in the crust and add parmesan cheese to the puff. Never fails to please where ever I take it, so simple and elegant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Vipond"
},
"reviewBody": "Love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Eriksen"
},
"reviewBody": "No this recipe was in my husbands Danish family from way back. Listen I wanted to tell the gal who sent that we always sprinle slivered almonds on top of the frosting AND red or/and green cherries. Now that is a stunning Christmas dessert! I didn't have time to look up my recipe so I used this one. So fun to make.\nThank you Allrecipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CGESLER"
},
"reviewBody": "Oh my goodness! I think I could live on this! I made it just as written, except for sprinkling sliced almonds on top instead of candy sprinkles. When I patted out the dough and spread the filling on top, I wasn't sure if it was really going to come out very well, but it did. It seemed done after about 45 minutes, so I took it out. It is absolutely delicious, and quite easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Lindquist"
},
"reviewBody": "This is the best recipe. I add slivered almonds over the top to bring the almond all the way to the tip top! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ckelly4604"
},
"reviewBody": "My mom and I have made this recipe for years (with one exception), to rave reviews. Instead of an icing drizzle we use a cream cheese frosting. We mix a small softened cream cheese with 1cup confectioners sugar, 2 tablespoons softened butter, 1 teaspoon vanilla, and a dash of salt. Frost when puff is completely cooled. Yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "Mmm! My family loved this! Its really nice because its not too sweet. Its nice and buttery with a bit of sweetness in the glaze. Wonderful buttery puff pastry! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zinchick"
},
"reviewBody": "I ran out of Almond Extract, so I substituted with Almendrado Tequila. SO YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teagal50"
},
"reviewBody": "WOW...this is a GREAT recipe to have on hand but especially during the holidays. It will be easy now that I've made it for the first time. My husband loved it and said it was better than anything we've ever purchased out. I love that it doesn't have sugar in the pastry but is sweet enought with the frosting. I will definitely make this again and again. I will try variations like vanilla extract and pecans maybe adding some cinnamon &amp; brown sugar for the frosting. LOVE THIS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I found this recipe a few years back, and it's become a Christmas Eve tradition. It's simple to make and it's such a light and tasty pastry that it goes great after a heavy meal. In fact, we usually have leftovers with coffee for Christmas morning breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "This was very different! I am not even sure how to explain the taste? The two layers were both very crispy, greasy, and slightly flaky. It did not remind me of a danish either, which has a slightly sweet taste even in the crust to go along with the buttery flavor. I also thought it was going to rise and flake up more like a puff pastry to, but it only rose slightly. I used vanilla extract as I do not care for almond extract, which would not affect the results. When finished I topped with slivered almonds. A modified version would have to be a lot less greasy, puff up a little more, and have some type of sweet cheese or sweetened preserves between the layers so it is not just like eating two thin greasy crusts topped with almonds. I just don't understand this recipe? I think filling suggestions may have helped? I don't know?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shauna"
},
"reviewBody": "This is a simple yet decandent danish pastry dessert that has a legacy in my family. I got the recipe from my German grandmother and is a tasty . How I cook it to be perfect is: pre-heat the oven at 320 instead of 350 and let it cook about twenty minutes longer at lower heat. I have a batch in the oven for my brother who is visiting today. A delicious snack, goes perfectly with a nice warm cup of tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABC"
},
"reviewBody": "This was great! I wasn't sure because the recipe was pretty unique, but it was beautiful and so tasty! I recommend adding toasted sliced almonds on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wiser1"
},
"reviewBody": "My husband would cancel Christmas if we did not have this- His mom made it for him every year- I make it for all kinds of occasions now- I have since made and fed it to others and they serve it now- It looks so complicated but is not! Very impressive. I do not like the almond extract, I sub with vanilla- I use what nuts I have on hand- Walnuts or pecans are our favorite- or if your budget is tight, it tastes amazing without nuts coz chances are you would have all these ingredients in your pantry to make this elegant dessert! (also same as \"danish puff\" on AR)- My husband would give it 50 stars if he could!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Nunley"
},
"reviewBody": "I have made this since 1964. Our neighbor brought over a coffe cake so I could bake it and I burned it. This recipe was the only one I had the ingredients for. The only store in town was closed. They loved this and I have made it several time for them. All four of our children have won blue ribbons for danish puff. Both my sisters and sister in law make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam McBride Chosewood"
},
"reviewBody": "My mom made this every year for us. I have not been able to find this recipe for years. She never wrote anything down..she did it all by memory. She passed in 1998 so the recipe went with her. Now I can surprise my sister with this for Thanksgiving..Thank-You so much for submitting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MRicchiazzi"
},
"reviewBody": "Love this recipe - my variation is vanilla extract in the \"cream puff\" dough. I use a regular butter cream frosting and top with toasted sliced almonds. The almond flavor is there, but not as overwhelming as when you use almond extract in the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHANNON24"
},
"reviewBody": "It is the oddest most delicious thing I have made! Was not sure it would turn out but was excellent....disappeared in hours! When I rolled out the bottom it was not even so I rolled up the ends once the filling was on. Cooked evenly even though I did this! May add a brown sugar/butter/almond mix for in between the pastry and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laureli Ivanoff"
},
"reviewBody": "My Mom, Lena, also made these every Christmas. LOVE them. They are simple and delicious. Sometimes she colored the frosting, for a more festive look, but I like the simple white icing. Thanks for the recipe and thanks MOM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCOUTSAGIRL"
},
"reviewBody": "Just like the pastry my Danish grammie used to make when I was a kid! I had made this years ago, but I had forgotten how very very simple and tasty the recipe is. It literally takes about two minutes to put together, then another hour to cook. As another reviewer suggested, I don't bother with the first layer, I just make the top layer. It's a great \"throw together\" recipe if you need a quick, sweet fingerfood for a hostess or secret santa gift or holiday party. Try serving a piece with raspberry sorbet for an incredibly great-tasting, elegant finish to a meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DiGiovine"
},
"reviewBody": "I found this recipe to be much more time consuming than other reviewers noted. I would say it took closer to 45 mins to assemble. Also, while the end result was good, it wasn't great, and something better can easily be made with less work.\nIf I do decide to make this again, I will take the other reviews' advice and put a filling between the layers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debscookin"
},
"reviewBody": "This is the same basic recipe my Mom made for us when we were small except she always used maple flavoring instead of the almond. For the icing she would make a butter icing (approx. 2 cups powdered sugar, 1/4 c.butter, 2 tsp. maple flavoring and a dollup milk in the mixer) and add maple flavoring to that, too - spread it on while it is still just warm - then she'd sprinkle chopped english walnuts on top. So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Carrie Bo Beary"
},
"reviewBody": "This deflated when i took it out but i thought it was gross anyways. Take into consideration I am a novice, please."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BAILEYSLANDING"
},
"reviewBody": "Very easy to make with clear instructions! The pastry was delicious, light and not overly sweet. I'd recommend this for a quick breakfast treat or even a dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDAROYCE"
},
"reviewBody": "I have made this for years, but what I do is after its baked and cooled I slice the two pastries in half long ways and fill with instant vanilla pudding prepared as for a pie and add adrop or two of almond extract. Then put top on and frost. It always is a big hit and everyone wants the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like that the ingrediants came together without a special trip to the grocery store. I was a bit dissapponted in the final product. For begining bakers this comes out very well but the end product was not a show stopper here. I baked for only 50 minutes and probably could have pulled it out after 45. I garnished with chopped almonds instead of candy pieces. The flavor was more of a two for me with the second layer of dough tasting too much like egg but the ease of assemble and ingrediant list bumped this to a 3 star. Would i make it again? Perhaps in a pinch but I would probably jazz it up by rolling dough out as 8 seperate balls, flattening, topping with the second layer and then adding sweetened creamcheese or presevers for a filling and lightly striping with icing and sliced almonds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry J"
},
"reviewBody": "Wife has made this for years. One of the best,(wife and recipe). Only change is 2 cups confectioners' sugar in the glaze. Try this for sure!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAVIST"
},
"reviewBody": "Really 4 1/2 stars. Just made this and as mentioned it comes together really quickly and easily, with staples already in my cabinet. I added almond filling between the two layers and only baked it for 35 min instead of the specified 60. I should have cooked it an additional 10 minutes because the end product is slightly eggy...but no complaints. What a great recipe when you have house guests and want something sweet but not time consuming to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DManfredi"
},
"reviewBody": "Did I just make this???!!! Wow! This is delicious! So easy, so fast, and sooo extraordinary! This is like fine pastry shop quality. I can't wait to serve it to my guests this evening. I'm also amazed at the ingredient list...just regular, everyday items that I always have on hand. You must try this!\r\nQUICK UPDATE: EVERYONE RAVED OVER THIS! THEY COULDN'T BELIEVE I MADE THIS MYSELF!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MONTANADAISY"
},
"reviewBody": "I took the advice of an earlier reviewer and spread a thin layer of almond paste between layers and topped with sliced almonds instead of candy sprinkles. I also was so excited to try it, that I didn't wait for it to cool to room temp before frosting, and I am glad, as it was so much better warm than cold. I found it to be a bit bland, and my husband and I thought that maybe a thin layer of lemon filling or even fruit filling might make it a little bit more tasty. Leftovers didn't keep well at all, so I would half the recipe unless you have a crowd!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norma LeGeyt Meligonis"
},
"reviewBody": "Wow...did this recipe bring back very fond memories! Although my mom made it for me as a child, I have never made it myself. It was very easy and was quite a hit with my Progressive Dinner group. Make this one and you will have raves at your next brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula A. Tyson"
},
"reviewBody": "Very good! I was sick and was still able to make this recipe with ease. Everyone who ate it agreed that it is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'mama"
},
"reviewBody": "This was the hit of the Christmas morning brunch. I topped off the icing with almonds instead of candy sprinkles. I was afraid that this wouldn't be sweet enough, but it was perfect, and froze beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow, I remember this recipe from when I was a kid, too. Just like the other reviewers! It's fun to remake old memories and pass them on to our kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a very yummy dessert, I've been making it for many years. I did change one thing, to save half the fat...skip the bottom layer. It doesn't really add any flavor, and the top layer is what's really the best part. Here's a tip on spreading that top layer out...use a wet spoon, it really makes the job easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "from Ontario"
},
"reviewBody": "My mother used to make this and I have made it myself years ago. It is a great recipe and now that I have been reminded about it, I will make it again, or better yet, coax her into making it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOSLYN H."
},
"reviewBody": "Thank you, thank you, thank you, I had this recipe years ago. This is from an old cook book, which I lost while moving. I would often put a thin layer of Solo fruit filling, or almond paste, over the crust, between the two layers. Easy and elegant dessert, great for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BONNIEDAVID"
},
"reviewBody": "I have used this recipe since 1960 I have always used slivered almonds over the frosting, carrying the flavor of the Almond extract that is in the pastry."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/64780/danish-almond-puff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/64780/danish-almond-puff/",
"name": "Danish Almond Puff"
}
}
]
}
}
, "about": [
]
}
]