				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Dawn&#39;s Easy Red Velvet Sandwich Cookies"
,"datePublished": "2015-11-19T02:11:48.000-05:00"
,"dateModified": "2022-01-07T13:59:28.000-05:00"
,"author": [
{"@type": "Person"
,"name": "DAWNV4"
,"url": "https://www.allrecipes.com/cook/1139987"
}
]
,"description": "These tender and tasty cake mix cookies are sure to be a hit when sandwiched with the homemade coconut cream cheese icing and decorated with chopped pecans."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PMaOcnBkrzjESiLP_2Ot91qhvd0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1101844-3b5c55cf186b4e21a6f82021a7ace008.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Dawn&#39;s Easy Red Velvet Sandwich Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "170"
}
,"cookTime": "PT8M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "292 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "29 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "182 mg"
,"sugarContent": "21 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (18.25 ounce) box red velvet cake mix",
"2 eggs, lightly beaten",
"0.5 cup vegetable oil",
"1 tablespoon bourbon",
"1 (8 ounce) package cream cheese, softened",
"0.25 cup butter, softened",
"2 teaspoons evaporated milk",
"1 teaspoon vanilla",
"0.5 cup flaked coconut",
"4 cups confectioners' sugar",
"0.5 cup chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix together cake mix, eggs, oil, and bourbon in a large bowl. Roll the dough into balls the size of walnuts. Place 2 inches apart on ungreased baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the tops start to crack, about 8 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl combine cream cheese, butter, evaporated milk, vanilla, and coconut. Add the confectioners&#39; sugar 1 cup at a time, mixing well with each addition. If consistency is too stiff, add more milk."
} ,{
"@type": "HowToStep"
,"text": "Place the chopped pecans in a bowl. Spread a generous amount of icing on the bottom of a cookie, sandwich it with another cookie, pressing firmly so that the icing comes all the way out to the edge. Roll the edges of the sandwich cookies in the chopped pecans. Repeat with the remaining cookies."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT33M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank Kent"
},
"reviewBody": "The recipe instructions were easy for me to follow. Rolling the dough into walnut-size scoops was difficult! I started using a spoon but found a cookie dough gadget I had from Pamper Chef that worked better and balls were more consistently shaped. My batch made 12 good size cookies. With just my wife and I eating them, this will be plenty!! Thanks for the Valentine's Day delight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AHoags"
},
"reviewBody": "These cookies are both tasty and cute. I made them for my daughter's Valentine's Day party at school. Since cake mixes are only about 15 oz now, not about 18 oz, I added a little less than a 1/4 cup of flour to make the dough a consistency I could roll. I also chilled the dough for a few minutes to improve rolling and prevent spreading while cooking. I used a cookie scoop/melon baller for the walnut-sized balls. The batter only made 12 sandwiches, so I ended up making another batch. As the recipe author said, there will be plenty of icing, so no need to double that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Danielle Harshenin"
},
"reviewBody": "Made as written, these are gross!! They're not a \"cookie\" and they are not a \"cake\"... just a weird, tasteless hybrid. The icing was the best part. I should have just made cupcakes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tikibella"
},
"reviewBody": "Easy to make, followed reviewers and omitted evap. milk in icing, was still more runny than I favor. Super sweet. Nice presentation but icing squeezes out while eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lorimccar"
},
"reviewBody": "I followed this recipe exactly. The dough was sooo oily, it was kind of disgusting. Somehow, they came out just fine. Both my sons love red velvet desserts &amp; they really liked this one, so the oily cookie dough mess will be our little secret. I couldn't give it 5 stars because of the oil slick... Will definitely try again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Brusnighan"
},
"reviewBody": "Made these for a Christmas party. Huge hit. Substituted rum for the whiskey as I had none. The dough was too soft to roll into balls so used a small scoop an made even sized mounds. They baked nicely. For the filling, I omitted the coconut and pecans. I used a pastry bag to spread it then rolled the edge in red and white sprinkles. I put them out in the cold in a Tupperware container for a few hours until the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amysue"
},
"reviewBody": "These were fabulous. I used vanilla instead of the bourbon, and left out using the coconut and pecans, just due to personal preference. Will definitely make again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "This recipe was amazing! Cookies were so soft and the filling is so delicious. The cream cheese flavor is very light and subtle. These tasted like yodels to me. I skipped the bourbon and enjoyed the chocolatey goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SRJ"
},
"reviewBody": "I made the cookies and added vanilla in place of the bourbon. Excellent flavor and they turned out perfect. I then frosted the individual cookies and they were yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisyndora"
},
"reviewBody": "Great recipe!! Family loved them. Left out the bourbon and substituted with vanilla yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tia Strickler-Wood"
},
"reviewBody": "I made these twice for Christmas this year they turned out really good. I try to follow the recipe the first time exactly as it is written but didn't have bourbon and they turned out fine. i couldn't find the size boxes of red velvet mentioned for the recipe so the first time i made them the yield was way off and i had a ton of icing left over (which is delicious by the way and my new go to cream cheese icing) so I made them again Christmas eve doubled everything but the icing and finished up the icing. Easy to make taste fabulous and Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ASweeney"
},
"reviewBody": "Not a fan. Too sweet and the cookies themselves were too oily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Banks Montgomery"
},
"reviewBody": "Wow!! What can I say about these cookies except WOW! The recipe was so easy and fun. The cookies turned out perfect every single time. If you do not like baking, you will love baking these cookies. I didn't change the recipe much. The bourbon I used was honey bourbon and I left out the coconut and nuts but only because they were so yummy and so beautiful that they didn't need any help. I had coconut and nuts ready to use but tasted first and I could not add 1 thing to change perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CocoLoco"
},
"reviewBody": "Like others I left out the bourbon, otherwise the cookie recipe is the same. I am a bit lazy so I used store bought cream cheese icing and it was delicious. I added coconut to one batch and another without, more liked it without. I rolled in mini-chips and sprinkles around the edges to be festive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle Wright"
},
"reviewBody": "I did not get 24 servings. The taste is nothing special. They are pretty though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Casablancaise"
},
"reviewBody": "These cookies are pretty good. I had to pass on the coconut and pecans because the cookies were to take to my daughter's preschool and no nuts were allowed in the food. This recipe was easy to make but the amount of icing here is way too much, I had half of it left at the end. I would suggest to cut the icing ingredients in half.\nI can't believe I haven't made these for 6 years ! My daughter is now a 5th grader and I am making them again for her school's bake sale. \nI doubled the recipe but kept the icing ingredients the same and still had leftover icing. I am posting many pictures of these cookies being made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan Konya-Grabill"
},
"reviewBody": "I'm giving it four stars just because I'm insecure enough to think that I did something wrong in making these cookies. I followed the directions exactly, but the dough was beyond sticky an impossible to roll into balls. I double checked the ingredients several times to verify that I'd followed the recipe exactly, and I had. I added about 1/3 cup of flour to the dough, and it was still completely unrollable. I even pulled up another red velvet cookie recipe but it was almost identical in ingredients and procedures. I ended up dropping small spoonfuls onto the cookie sheets just to get them cooked. Consequently, my cookies are not round, are taller than they should probably be, are about bite sized, but taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "I thought these were pretty good. They were very quick to make and the filling was sweet but very good. I was able to make a double batch of cookies with only one batch of filling. I took these to a 4th of July BBQ and they were a big hit with the kids as well as the adults. Thanks for sharing your recipe, DAWNV4!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkrebbs"
},
"reviewBody": "These were a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staceyzimm"
},
"reviewBody": "Super yummy. I didn't use the coconut or pecans (personal preference) and loved how these turned out. I made the cookies the day before I needed them and they stayed soft in a container. The icing recipe, even without the coconut, made about triple the amount I needed to sandwich the cookies. Maybe next time I will do a double batch of the cookies. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "j"
},
"reviewBody": "left out the bourbon, coconut and nuts and there were MUCH MUCH better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Elizabeth Henry"
},
"reviewBody": "Your co-workers will fall in love with you. A wonderful recipe for a quick and easy treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon41"
},
"reviewBody": "I made these and they were gone by the next day! I left out the bourbon, pecans, and coconut because I didn't have those ingredients, but these were still so very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Keith"
},
"reviewBody": "Yum! Cut the frosting in half. 4 cups was too much. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carebear20023"
},
"reviewBody": "I made these cookies ,and they were awesome however the dough turned out a little gooey to handle so I had to place the dough in the fridge for almost 30 minutes . Other than that it is awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buking21"
},
"reviewBody": "My 2nd attempt at baking cookies, and everyone agreed these are amazing. Still fresh even after a week, too. Will be my go-to cookie recipe. Thanks to OP and other reviewers:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lollipop10"
},
"reviewBody": "Yummy!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LINDA LASHLEY"
},
"reviewBody": "Very sweet. These would be better with ice cream in the center."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "This recipe is fabulous. The cookies turn out perfectly round and very professional looking. My family doesn't like the texture of coconut, so I omitted it. However, I did use coconut rum instead of burbon. My friends always request that I bring this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "UPDATE!!! Forget my last review tried them today They were excellent! Loved the texture flavor was delicious. Defiantly tastes brtter the day after you make them!!!Im rating on the cookie alone I chose a different filling recipe.i thought they were average 5 star rating for being easy to make taste wise just ok for me wasnt blown away by them but they do turn out adorable so i will use this recipe again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jonijett8"
},
"reviewBody": "Easy and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "macmcneely"
},
"reviewBody": "I love red velvet cake...but VERY picky. There are few good recipes out there...and as a cookie - this one's a winner. It's hard to mess up, which I love. I did leave out the bourbon, coconut, pecans (because of nut allergies, and used a splash of milk instead of the evaporated. For 50 - michelan star restauraunt chefs...this was the first cookie to go. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHARON"
},
"reviewBody": "Instead of bourbon, I used 1 part vanilla 2 parts water, and for the evaporated milk, I used whipping cream or half &amp; half will work. Just by reading the recipe, 4 cups of powdered sugar is way too sweet. I used 2.5 cups and Left out the nuts. \nIt was an easy yet very tasty recipe. I would probably use this recipe when I'm limited on time. I prefer chocolate chips in my red velvet cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CMDOYLE"
},
"reviewBody": "ok but not amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jem707"
},
"reviewBody": "Very good but also very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Matthews"
},
"reviewBody": "Delicious! These are very soft and sugary (with the icing). I chose to leave out the coconut and pecans. They were not missed! The cookies make for a beautiful presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ProudMama"
},
"reviewBody": "The frosting was grainy and the cookies themselves had an unappealing flavor. I followed the instructions exactly as they were because i am very OCD like that. I will never make them again unless i use my own homemade recipes of frosting and red velvet cake cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kimmer"
},
"reviewBody": "Looks great but the cookies were dry and definitely more cake-like w/ not much flavor. I don't know if it's due to the cake mix or what, but I didn't get the chewy delicious cookies I read so many people did. The filling was too runny even after adding more powdered sugar and cream cheese and I ended up with a huge jar left over so I'd half the frosting recipe. Not sure what happened. I was going to give these out to clients but I don't think I'm going to. I was so excited to make these but they just weren't good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gary Mast"
},
"reviewBody": "I have a serious sweet tooth. Even so, these are WAY too sweet for my liking! The Icing recipe could easily be cut in half. I was very generous with the amount of icing in the sandwiches and still ended up with 2 cups left over. Probably won't make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GLITTERMISS"
},
"reviewBody": "Made these yesterday for a potluck with RAVED reviews. One friend who doesn't eat much literally scarfed 3 of these within 5 mins. I reduced the powered sugar for the icing to 2 cups b/c the red velvet cookies themselves were plenty sweet. I agree that walnut sized dough balls were probably a little bit large although no one seemed to complain! I put less of the filling in the cookies (they weren't fluffy or as pretty as the picture on the recipe). I wonder if anyone has actually mixed the nuts inside the icing so it makes the filling mixture look taller inbetween the cookies. Will definitely make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwenifaery"
},
"reviewBody": "I thought these were fantastic! The only thing I did a little different was the filling - I used sour cream instead of butter and left out the wet ingredients, and we use walnuts on our red velvet so we added some walnuts to the filling before topping with the other cookie- only because we like the flavor but they are prettier just red and white. They are moist - eat them fast before they go bad!{{like thats a problem}} I also used this as a \"base\", if you will, to make dark chocolate cake cookies with peanut butter filling... yum yum yum ... and now im trying key lime :D I have to say that I like this recipe the best because the batter is not runny and not stiff enough to roll and cut - I use the larger side of a melon baller to scoop a slightly rounded little scoop - it makes the perfect size cookie in my opinion- with such a caloric treat you really dont want these huge cookies so its much easier to watch the cookie intake of myself and my son!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimme63"
},
"reviewBody": "I love this recipe and so does everyone else I have made it for! \nI only made a couple of substitutes, I added melted coconut oil for the vegtable. I used carrot cake mix, and milk chocolate mix. I did in fact for the first trial of making this recipe use red velvet cake mix. Whatever changes you may make, or add to it this recipes is a winner. After I write this review, I am going to make a batch! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abanana920"
},
"reviewBody": "So yummy! I got rave reviews on these from family &amp; friends! I left out the pecans &amp; the coconut just because my family doesn't eat it, these cookies were still fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Super quick and easy! Be careful not to overbake...it is hard to tell with a cookie of this color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roma"
},
"reviewBody": "Cookie part too sweet. Icing is divine - used on cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan S."
},
"reviewBody": "These were pretty good &amp; fun for my daughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were super easy to make. I substituted whole milk for the condensed. The frosting is too sweet, so I would add more butter, cream cheese and less powdered sugar. My children liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "These were made for my husband on Valentine's Day! I was hesitant to make them because they use a cake mix. I've tried the many cake mix cookie recipes out there and have been disappointed by the taste. However, I made these exactly as written, except no pecans. Because of the holiday, I rolled them in red decorating sugar. Bake them as written, leaving them on the cookie sheet for 10 minutes when they are removed from the oven. This will help them set before trying to remove them. Also, don't be tempted to allow them to bake much longer than indicated. I did and burned a few due to the deep red color, it's hard to tell if they are \"browned\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daniellekarlin"
},
"reviewBody": "I made these for valentine's day - so so good! I made them plain..left out the burbon, coconut, and pecans..and they still got great. The cake mix makes it really easy. One tip is to take them out of the oven after they have just begun to crack (8 mins) just like the recipe says. I was a little hesitant with the first tray because they looked like they weren't nearly done so I left them in a few minutes longer and they ended up burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megancalderon"
},
"reviewBody": "I made these cookies for Valentine's Day for my hubby's work, they came out absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teetime"
},
"reviewBody": "I made these for my boyfriend for Valentine's day! Just finished making them. I made a few alterations though, couldn't find any red velvet cake mix so I used Devil's food cake mix instead. Used Vanilla instead of bourbon as I saw some people have done. The cookies are very soft and cake like! Quite tasty. The Icing is a little bit on the soft side but still pretty tasty and sweet. I like that they mimic oreos cuz my boyfriend loves oreos! I dropped some heart-shaped flakes on the cookies before putting them in the oven to make them more valentine's day ish. Anyways I am very happy with this recipe they are quite a delicious treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri Pinheiro"
},
"reviewBody": "Made these cookies yesterday, they were fabulous!! I substituted regular milk for the evaporated milk and still came out great. I really recommend this recipe even for pickiest of eaters!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinBug"
},
"reviewBody": "Wow... these are amazing! I bake a lot of stuff (and I mean a LOT), but these are serious stand-outs. Everyone raved about them. They're really pretty too, making them a great addition to any cookie tray. The only change I made was to omit the pecans, just because I forgot to buy them. I'll definitely make these again. Thanks! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wbendel"
},
"reviewBody": "These are great! I left out the bourbon and baked them in mini muffin pans for bite-size superbowl treats! Topped them with cream cheese icing (looked like mini cupcakes)! Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MaryAnn"
},
"reviewBody": "Agreed 1inch balls were too big, my cookies were flat and when finished way too sweet,don't think I'd make these again, I'll just have to keep looking for another recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Apron"
},
"reviewBody": "WOW!!!!!!!!! Thank you for this crazy easy keeper of a recipe. Threw together in about 5 minutes. Baked on parchment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Logan"
},
"reviewBody": "Absloutely yumm-o! One of my favorite cookies that I baked for the holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Hopkins"
},
"reviewBody": "All I can say is....WOW!! These are my new favorite cookie!!! So easy to make, and soooo delicious! Made them for a cookie exchange, and for every holiday gathering with family....they were a huge hit everywhere I took them. All I did different was leave out the bourbon &amp; the coconut. DELISH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "girlfromjersey"
},
"reviewBody": "I made these last night for my bf and he was a little hesitant to try them. Once he bit into them, he was in heaven. Def will make this again. Only one substitution made and that was replaced buttermilk for the bourbon. Oh...wait, no pecans just cause I'm not a huge fan of any nuts in cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hockeymom089"
},
"reviewBody": "Well, I did the 1 inch balls, and they turned out huge, so I will probably do a little smaller next time. This seemed to be a crowd pleaser at work, but I thought they were just too big. I used sprinkles intend of nuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "capegal"
},
"reviewBody": "Made for Christmas, look pretty, but very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yana"
},
"reviewBody": "Soooooo good and easy to make!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTWhite"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetcakes"
},
"reviewBody": "These were awesome! I did not use the bourban or the coconut or pecans (but will try those two next time) and they were fabulous! I made some bigger in size and some smaller because they are very rich. I kept them in the refrigerator and the cookies got nice and soft and I thought they tasted better the second day! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Somewhere in South Dakota"
},
"reviewBody": "Easy and good recipe. I used vanilla chips instead of the frosting, because I wanted a cookie that didn't need to be refridgerated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Mical"
},
"reviewBody": "Made this with my 4 yr old grandson and 2 yr old grandaughter....didn't they have fun...and they just had to lick their little fingers:) Oh, well, all in the family. Didn't have any bourbon, but these were great. My son-in-law said they were the best cookies he ever ate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jodee"
},
"reviewBody": "I am making these for a cookie swap this weekend instead of the filling listed i am making my own cream cheese frosting I may crush up some candy canes to toss in and a few drops of green food coloring if i am feeling crazy. I also left out the bourbon BUT I added about 2 teaspoons of peppermint extract instead...they smell amazing and are very festive cant wait to try one!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "something new"
},
"reviewBody": "These cookies are pretty but are too sweet and lose all the good flavor of the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjketark"
},
"reviewBody": "chewy and delicious. I made them exactly as described and had my daughter help with the balling and the sandwiching. pretty easy and scrumptious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "These were so easy to make, and so delicious to eat. My daughter took most of these to an early holiday party, and she reported that everyone loved them and that I should have made more. Because I was making these for kids, I omitted the coconut and pecans. These would work with just about any cake mix, and I think lemon with a lemon cream filling or spice cake with a cream cheese filling would be wonderful. But the red velvet is perfect for the holiday season! Great, easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Siobhandove"
},
"reviewBody": "Everything about this was easy! We didn't have bourbon so I also sub'd with vanilla. I also skipped the icing cuz i never liked those \"double doozie\" you got at the mall. Lol All the boys loved them and they are the chosen cookie of the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYSAFFRON93"
},
"reviewBody": "These are amazing! I made a variation using chocolate fudge cake mix and canned buttercream that I added some mini chocolate chips too. So incredibly easy and extremely tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Just made these cookies with my 5yo son... They were fantastic! We came up with tons of ideas to use these cookies for Christmas. On the first batch we did the plain sandwich with frosting in the middle, but thought during the holidays we could roll the frosting in green sprinkles to make them festive! We also put andes candies pieces in with the frosting for a mint-y cookie- those were my son's favorite! Then on the last batch we mixed in white chocolate chips and will leave them as cookies alone. The possibilities are endless! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookie*monster"
},
"reviewBody": "The amount of oil seemed too high so I cut it down to 1/4 cup and then slowly added some water until the batter was the right texture. If you want puffy cookies you have to spoon smaller batter drops; the bigger the cookie the flatter it gets. Taste great and everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Hostetter Sundberg"
},
"reviewBody": "I really enjoyed these. Very Simple. I made them for my neighbor whose father passed away last night. He loves red velvet. Very impressed. I kept the pecans out just because I wasn't sure if he ate nuts or not. I would love to try this with chocolate cookies and maybe some mini chocolate chips in the cream cheese mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crick"
},
"reviewBody": "Really liked these. Second time I used a devils food cake mix and made peanutbutter cream frosting...WOW!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SDEGRAW"
},
"reviewBody": "Very good cookies! I left out the coconut and they were just as delicious. Make sure you don't over cook the cookies a little softer is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "banslug"
},
"reviewBody": "Easy and delicious recipe! I used my own cream cheese frosting just because I had all the ingredients on hand (and I didn't have the coconut or evap milk for THIS recipe) and the kids gobbled them up...the adults liked them as well. I made NO changes to the cake/cookie recipe part at all. I'll be trying this recipe in other flavors, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Curly Sue"
},
"reviewBody": "Delicious! But next time I want to make them bigger, like a tablespoon size or bigger. Because they weren't big and puffy, just flat like a cookie. I used cream cheese frosting recipe from this website instead of the one on here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KtBuG1822:D"
},
"reviewBody": "PURE AWESOMENESS!!!\nGreat for any occasion or just for a little treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "irish_eveningstar"
},
"reviewBody": "This was an excellent recipe! I decided to make it with a box of carrot cake mix and cream cheese frosting. I had to beat people away with sticks! :P THANKS!! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erin3000"
},
"reviewBody": "Make sure you follow these directions for the cake mix and not the directions on the box, which would make the cookies too soft and cakey! The cream cheese frosting was deeelish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikkii D"
},
"reviewBody": "I made these as directed for Christmas- My familly loved them! Since then, I have made them using 4 different kinds of cake mix- they always come out great! Devils food has been the favorite so far, they take a little longer to bake, but come out like soft &amp; fudgey brownies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariah Ollberding Morgan"
},
"reviewBody": "I opted out of the bourbon, coconut and pecans (along with the evaprtated milk). They came out deliscious!! One box does make too many of them expecially when one sandwhich is more then enough for one person. Next time I think I'm going to make them smaller so they don't look too overwhelming and so I'll have more. Other then that, I wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deanna Diebler"
},
"reviewBody": "I can't believe I am the only one who thinks they were way too sweet.I even used 1/2 cup less sugar.I should have followed my instincts.They were pretty though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellie Ware"
},
"reviewBody": "Delicious. As much as I hate it when people change everything and review anyway, I'm going to do it. I used chocolate cake mix with a dash of vanilla and made the icing as is-with food coloring, but without the coconut. They were fantastic and team colored for the Superbowl, my team lost, but the cookies were a huge hit-I'm so excited to try them with different mixes-and I think I've got a new go-to cream cheese icing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "The cookies came out beautifully. However, the cream filling was tooooo soft. It needs to be stiffer. I haven't used Crisco hard shortening, that's what this filling needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari"
},
"reviewBody": "These are delicious and beautiful! I left out the bourbon in the mix. I measured my dough with a 1/2 tbsp to make each cookie uniform in size. The cooking time was perfect at 8 minutes for my oven. I did not add evaporated milk, coconut or nuts to the icing. These need to be refrigerated. They taste better if you let them get to room temperature before eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSICA MADISON"
},
"reviewBody": "giving 5 stars cuz so yummy! but just a recommendation...cook a min longer so middles not so mushy:) great recipe! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "focaccia9"
},
"reviewBody": "I'm a pretty easy sell on most things. With food, I'm certainly not picky. But there was something about the taste of these cookies that was kinda meh to me. I cut down the oil to 1/3 c. and made the frosting for this recipe and I definitely wasn't crazy about it. I then made the cream cheese frosting from McCormick's Red Velvet Cupcakes recipe on this site which incorporates sour cream and that DEFINITELY amped it up a notch -- really nice tang at the end and sooo much tastier. After I finish off this batch I probably won't make again. **UPDATE** I am upgrading to a 5 after bringing these to a get together last night -- the icing for the Red Velvet Cupcake recipe definitely was a hit, and instead of sandwiching the cookies to make whoopie pies, I just put a thick layer of icing on top of a single cookie and it was delicious! Perhaps there was too much cookie for the icing to balance out the taste. This was just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIANE BULANDA"
},
"reviewBody": "I made these for my Christmas cookie exchange and they were a big hit! I omitted the coconut because not everyone likes it. I drizzled them with white chocolate and they looked really cool. I did find that it was easier to roll in the pecans after I chopped them in the food processor. Thanks for sharing this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sharon K."
},
"reviewBody": "Easy was just what I needed and my son actually enjoyed assembeling these yummy sandwiches. They really added a lot of color to the cookie plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Delicious, simple, easy to make small adjustments (i.e., swap vanilla in place of bourbon). Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DLD"
},
"reviewBody": "Warning: these are so addicting! One of the easiest and quickest recipes. I omitted the bourbon and used store bought frosting. They were delicious as a stand alone cookie or a sandwich. Probably could have used a tiny bit less oil than what was called for. I do have to say that these were only enjoyable the first day of baking. They took on a different flavor after that which I didn't care for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmd5102"
},
"reviewBody": "This recipe was 1. easy and 2. incredible! One of my favorite cookies ever! I must say my version lacks a lot of the things in the original: bourban, coconut and pecans... but I used chocolate chips and they were a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweet_treats"
},
"reviewBody": "my friend made these for me and i loved them! my brother ate three at least"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ddiva"
},
"reviewBody": "This was good. I used store bought cream cheese frosting, thinned with some Carnation. I added some milk to the cookie batter, which was a mistake since they came out flat. My bad! But this was quick to make and I will try these with different cake mixes! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMeier627"
},
"reviewBody": "People were AMAZED at these cookies. I made them a little bigger and sandwhiched them and out green sprinkles on the icing. It was for a Christmas party so they were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CooknKel"
},
"reviewBody": "Easy &amp; tasty. I made a double batch of cookies &amp; did not double the filling. I had enough filling for all but four sandwiches &amp; those I filled with ice cream instead. A delicious alternative! As others have said, you could easily leave the bourbon out all together. I substituted Chambord &amp; that worked out well too."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/186936/dawns-easy-red-velvet-sandwich-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
"name": "Sandwich Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/186936/dawns-easy-red-velvet-sandwich-cookies/",
"name": "Dawn&#39;s Easy Red Velvet Sandwich Cookies"
}
}
]
}
}
, "about": [
]
}
]