				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Deep-Fried Turkey"
,"datePublished": "1999-11-09T21:43:35.000-05:00"
,"dateModified": "2022-11-01T09:04:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Meredith"
,"url": "https://www.allrecipes.com/cook/24326652"
}
]
,"description": "Try this deep-fried turkey recipe for outdoor holiday cooking that frees up your oven. It&#39;s juicy and tender on the inside and super crispy on the outside."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KzQhXczFj65kTMZvENwfCfbHN6Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/742704-7095e70a2e22427583c5bcdf3abef91b.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2730210732001",
"description": "See how to deep fry a crispy skinned turkey in 45 minutes or less!",
"duration": "PT2M31S",
"name": "Deep Fried Turkey",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/5e9e44d4-db04-4bec-a1f8-a10bc649214a/80c94ef2-00f7-455c-96e1-bccddfe0e87e/1280x720/match/image.jpg",
"uploadDate": "2021-06-25T18:01:09.093-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Deep-Fried Turkey"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "88"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "603 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "229 mg"
,"fiberContent": "0 g"
,"proteinContent": "69 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "571 mg"
,"sugarContent": "0 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"3 gallons peanut oil for frying, or as needed",
"1 (12 pound) whole turkey, neck and giblets removed",
"0.25 cup Creole seasoning",
"1 medium white onion" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a turkey fryer or large stockpot with enough oil to fry turkey; be sure to leave room for turkey so oil doesn&#39;t spill over. Heat oil to 400 degrees F (200 degrees C). Layer a large platter with food-safe paper bags."
} ,{
"@type": "HowToStep"
,"text": "Rinse turkey and thoroughly pat dry with paper towels. Rub seasoning inside the cavity and all over the outer surfaces. Make sure the hole at the neck is open at least 2 inches so oil can flow freely into the cavity."
} ,{
"@type": "HowToStep"
,"text": "Turn off the heat source. Place whole onion into the drain basket followed by turkey, neck-end first. Slowly lower the basket into the fryer until turkey is completely submerged in oil. Turn on the heat source and cook, maintaining oil temperature at 350 degrees F (175 degrees C) until no longer pink at the bone and the juices run clear, about 45 minutes, or 3 1/2 minutes per pound."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KzQhXczFj65kTMZvENwfCfbHN6Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/742704-7095e70a2e22427583c5bcdf3abef91b.jpg"
}
]
,"text": "Carefully remove the basket from the fryer and drain turkey. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read at least 165 degrees F (74 degrees C) but no more than 180 degrees F (80 degrees C). Transfer turkey to the prepared platter to finish draining, 10 to 15 minutes."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtnmike"
},
"reviewBody": "So moist! Easy to make but so dangerous to execute! I've Deep Fried many a turkey over the years and have only messed it up once. Don't Over Cook The Turkey or your eating shoe leather! Keep it safe, no short cuts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect turkey !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Mercer"
},
"reviewBody": "I've made this two years in a row, and it has come out great both times. I like the simplicity of the recipe, and the taste of the creole seasoning. \n\nJust make sure the turkey is defrosted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ladontresh Bushie Brown"
},
"reviewBody": "I used Creole rub and Creole injection I did not use the onion on the second round."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DonR"
},
"reviewBody": "Great way to cook Turkey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "As the submitter of this recipe, we have noticed a few alterations and editing made to the original recipe over the past 12 years or so. Over the past 35 years our family has deep fried our holiday turkeys. Why we use a fresh whole (uncut) peeled *yellow* onion in the drain basket with each bird? Especially when frying multiple birds as we do, the onion will turn black and somehow the oil lasts longer and does not scorch as quickly. But please, don't cut the onion in half and stuff it inside the cavity as shown in the video. Clogging the cavity will only block the flow of oil that is crucial to cooking the bird evenly and efficiently. Why we don't use injections? Some swear by them and there are so many flavors out there to choose from. We actaully tried the injection once (since everyone insisted it was the BOMB) and found it did not help in making a more moist bird. The results were a much saltier flavor and less juicy breast meat. Why poke holes all over the turkey only for all its good juices to run out during the cooking process, and to deal with dangerous grease popping and spattering as those running juices come in contact with hot grease? We are just way more generous on the creole seasoning dry rub. 1/4 cup is not enough y'all! Our original recipe was submitted using Tony Chachere's creole seasoning. If you cannot find Tony's in your area you can search many fabulous creole rub recipes found on the web. Have a safe and Happy Thanksgiving and Holidays everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Newmeyer"
},
"reviewBody": "Injected garlic and melted butter, also rubbed red pepper flakes all over inside and out, excellent recipe all in all and the directions were spot on, make sure to use peanut oil for sure, will always deep fry a turkey from now on"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy M"
},
"reviewBody": "This was VERY good. Everyone loved it, though they were a bit skeptical."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich Fabian"
},
"reviewBody": "I have made a Deep fried turkey before and used the Creole butter sauce and injected it into the turkey and the turkey was so moist on the inside and then made a concoction with seasonings on the outside and both inside and out of the meat I put the injector needle in various spots and really filled a lot of it and used two jars of the sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MoJo Rising"
},
"reviewBody": "Instead of injecting a marinade I soak the turkey in a beer brine 12 beers a whack of salt garlic and a coue lemons for at least 48 hours and pat dry and voila best trukey ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Medina"
},
"reviewBody": "Truly tasty!! Everyone in my family loved it. Mine came out darker around the skin, though. Most likely due to my having kept it 400 degrees by accident. It took me some time to get the temperature down from there. I think the oil and the turkey retained the heat for while, but the taste of the turkey itself was marvelous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaid"
},
"reviewBody": "Tried this recipe and loved it but I did somethig a little different. I melted butter and mixed creole with it and then injected it everywhere and then sprinkled creole after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CQQKEEE"
},
"reviewBody": "Did not have creole spice, so found a recipie for one and proceeded...this was right on and we all loved it ty for sharing! This was my 1st deepfried turkey as well =0)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovinghappyhome"
},
"reviewBody": "We made our first deep fried turkey for Thanksgiving this year and would of been lost without this recipe! Thank you so much for sharing. We made the turkey for my grandfather, since my husband and I aren't the world's biggest turkey fans. However, we both indulged it was just THAT good! It was the most delicious and perfect turkey ever! I would give it 100 stars if I could!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Wagner Leister"
},
"reviewBody": "DELICIOUS !!! First time frying a turkey so I read alot of reviews. And I will never roast a turkey again. Marinating is the key for a moist turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "purplestardust101"
},
"reviewBody": "This is the way to fry a turkey the best way!! But one reviewer stated...\"put it in a NON SCENTED trashbag in the refrigerator overnight\"... PLEASE...NEVER use ANY trash bags to put food into...they are ALL made with, NON-FOOD ingredients, and can contaminate ANY foods you put in them...there are food grade bags available...you can even use the cooking bags by Reynolds, you get 2 in a box for usually $2.59, and are pretty big--definetly big enough for turkeys!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Clarke"
},
"reviewBody": "3 safety tips: 1. Before taking the bird out of the bag, STAND the turkey in the cooking pot and fill with water until it just covers the bird . When the bird is removed from the water it will give the amount of oil you need to put in the pot. 2. make sure turkey is as dry as it can be, inject the seasonings at the last minute is th best 3. Turn the propane off before putting the turkey in, so that if the oil does bubble over there isn't a problem. Then relight"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Made this turkey for Christmas dinner and it was a huge hit. Great flavor and juicy... I had to cook a 11 1/2 bird for about 40 minutes at 375"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ewatson2"
},
"reviewBody": "Peanut Oil is THE key! I'm so glad this recipe recommends it. The flavor was just to die for not to mention it's pretty healthy with peanut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Hickson"
},
"reviewBody": "This was the best Thanksgiving turkey we ever had. It was uniformly moist and juicy inside with beautiful firm meat, crackly and brown outside, and not in the least greasy. We will do it again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEACHLOVER56"
},
"reviewBody": "This Recipe was Awesome..What a Juicy Tasting Turkey. I didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LucyF"
},
"reviewBody": "Yes!, once you try a fried turkey,you don't ever want to go back to baking one. Here are two important tips: First it is essential that you inject the turkey (use the Fried-turkey marinade from this site, adding a good amount of cajun seasoning -Zatarans or Chachere's- to make it spicy!), also rub the marinade on the outside and leave the trukey in fridge overnight. Second, yes the oil is expensive, but here in New Orleans we never go to all this trouble just to fry one turkey; we fry 5 o more at a time. Jusk ask your family and friends to chip in for the oil and then have a BYOT party (bring your own turkey). Once fried, the meat freezes well and you can eat fried turkey until X-mas. Third, use a pulley to lower the bird into the hot oil.....and don't let children or pets near it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sizzleq"
},
"reviewBody": "I tried this and liked it quite a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis"
},
"reviewBody": "Between family &amp; Church I fry between 12 to 15 each season. Here are some tips to help cut your costs. Peanut oil is expensive, so to use it as may times as possible watch your temp. I keep it below 375. Invest in a good ditital therm. Wash the bird before frying to remove the dry rub, it just sinks and will scorch the oil. After 2 cookings filter the oil. I also cut off the legs and wings and with a piece of wire hang them on the side of the pot, wings come out in 15min, legs in 20."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "munchies61"
},
"reviewBody": "I have learned from the Best, the good thing about deep frying is you can add or delete whatever you want. I have added honey of my receipe that I inject the bird with. To each their own, but it does sweeten it up a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis"
},
"reviewBody": "I made this for my building (military barracks). Not exactly the most picky group of eaters, but I still got rave reviews. When I saw Creole seasoning I new exactly what to use (Tony's Creole Seasoning).\n\nAlso, as a safety footnote: Fill your fryer with water &amp; put the turkey in (Before cooking of course). This will tell you roughly how much oil to use when you do start cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TREEMOM"
},
"reviewBody": "First time frying a turkey this year. I will admit that I like the ease and the amount of time it takes to cook. However, I will have to admit that this isn't my husband's or my favorite way to have turkey. If we still had a regular sized oven we would go back to brining then roasting, however for now frying will work. About frying, we brined the turkey instead of injecting which turned out well. The dry rub we used seemed to just float away from the bird and burn in the oil (so we can't reuse the oil). I don't think we will use a dry rub again next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miami Mommy"
},
"reviewBody": "I will never roast another bird again! By frying the turkey, it comes out succulent and so delish! One reviewer said that this is not a \"kid friendly\" recipe. I beg to differ! Yes, my children steer clear of the frying pot as the bird is frying, they are not even allowed outside. However, they are the first ones to line up for some samplings after the bird is cooked. This is the absolute best way to cook the Thanksgiving turkey. Not only is it delicious, but it also frees up your oven for cooking your side dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "Only four stars because kid friendly this is not. But, a good recipe. I've been frying turkeys for years, (and anything else that fits in the pot). Injecting is the only way to go and many stores sell the complete deep fry kit for a reasonable price.\n\nALWAYS deep fry in the yard or driveway on a sturdy flat surface. I have a metal drip pan, (for under auto work), on plywood firmly on blocks. A fire ext. handy, (NO WATER HOSE). And a broom handle w/bicycle grips on each end and a sturdy hook to set the bird in, two person job even with a small turkey. And yes, burner off when setting.\n\nHINTS: \nMake sure completely thawed and pat dried, NO ice crystals.\nCut off excess skin around the neck and wrap leg ends to limit scorching.\nBesides tossing in an onion, several whole gloves of garlic, slightly smashed.\nSince turkey needs to set anyway, experiment with potatoes or yams, dressing in a cheese cloth, you name it.\n\nHave fun and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HARLEY CRUISER"
},
"reviewBody": "I have been frying turkeys since I was a little boy back in the 70's and 80's. Frying is a southern heritage, it is as important as knowing how to field dress a deer. This is a great recipe for the first timer. I use a rub on the outside and inject the bird with a cayenne, garlic butter sauce I make. To the rookies, be careful with your hot oil, turn off the flame when lowering the bird, and do not get your oil too hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mikebunner"
},
"reviewBody": "i used this recipe as a model for frying whole chickens cajun style with a cast iron dutch oven and matching frying basket.works great for tailgate parties!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Schulte"
},
"reviewBody": "NEVER GOING TO ROAST TURKEY AGAIN !!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Owen Bridges"
},
"reviewBody": "To fry or smoke?? That's the question this year...did both last. I agree that injecting is a must. When I lived where the premade injection juice was not available as it is here in Louisiana, I used 1 stick melted butter,1 bottle garlic juice, 1 bottle onion juice and strained lite Italian Salad dressing and hot sauce to taste. Cajun seasoning rubbed outside is a must as well. If you have problems finding an injector, visit the Vet. The needles used on horses work wonderfuly. Peanut oil is not neccasary unless you are frying more than one in succession. Our family like to deep fry pisolette (rolls) while the turkey is resting...another thing you won't worry about at the last minute taking up oven space."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LemonLush"
},
"reviewBody": "Here's a safety tip. Trying to figure out exactly how much oil you need is always confusing. Before pouring the oil in, we put our raw turkey in the pot and cover it with water. Then, we pull our turkey out and mark the side of the pot with a marker of some sort to know exactly how much oil needs to go in. That way, you don't waste EXPENSIVE peanut oil and you always know you have enough. Try making Belgian Fries along with the turkey!! Go to www.belgianfries.com for directions. They require two cookings. Once before you cook your turkey and then after your turkey is done a few more minutes back in the hot oil. Crispy on the outside and oh, so fluffy on the inside!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Provence"
},
"reviewBody": "In South Carolina, where your turkey frying skills are as important as important as what church you attend, this one wins every time! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maritza Villa de Gutierrez"
},
"reviewBody": "We tried this for a family get together. I must say it smelled wonderful - I think our whole block knew we were cooking :) It was the first time anyone in our family had fried turkey - everyone thought it was delicious - I did do one little modification. I did inject the turkey with lemon juice the night before. I would do this again but maybe add a bit more salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gpd4"
},
"reviewBody": "Frying is the only way to go. I've been doing it for years - so much that I've worn out 2 \"standard\" turkey frying pots and had a 1/4\" aluminum bottom welded on my big pot (82 quarts - big enough to do 4 birds at a time!) for added strength. My only suggestion is that when you go to inject your bird (this is not an option in my mind) make sure you have the biggest guage needle you can find. Many of the readily available turkey injectors will clog with a speck of pepper. If you can't find a big enough one, just cut the tip off the one you have - make sure you cut it at an angle.\n\nHappy frying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VORCHA"
},
"reviewBody": "I made this as the centerpiece of our New Year Eve's buffet. Sugestion to complement the frying, brine the turkey in a clean 5-gallon bucket with 2 gallons water, 2 cups of kosher salt and 1 cup sugar for at least 8 hours, preferrably several days if you have the room to spare in a very cool place. Brining makes the turkey incredibly moist when combined with frying. Everyone loved the turkey and many didn't believe it was actually turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CALJAKE"
},
"reviewBody": "As a first timer turkey fryer, we decided to fry 3 turkeys for the neighborhood block party...our first turkey was a bit dry, since we allowed the heat to get to 375-400 degrees...definitely too hot at 3.5 minutes per pound. The remaining turkeys were cooked at 350 and were TO DIE FOR. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BUSINESSED"
},
"reviewBody": "FANTASTIC! This turkey is absolutely incredible and it really frees up the oven for big gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEEDEE"
},
"reviewBody": "WOW! who knew you could FRY a turkey? i took the advice of others and bought an injector! believe me, its the best investment you could make... melted down some butter and mixed it with carribean jerk, parsley, onion powder, garlic powder, and white pepper....This was the JUICIEST bird i have ever eaten. And it cooks so fast :-) Try chicken, and cornish hens, too. i may never roast my poultry again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALIEMLY"
},
"reviewBody": "Tasty! I injected a mixture of garlic powder and butter before frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATHY23"
},
"reviewBody": "Thanks for the recipe and advice. Our fried Thanksgiving turkey turned out great! It was delicious and received rave reviews from all our guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KELLYSCH"
},
"reviewBody": "Best turkey I ever had. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TKEPLING"
},
"reviewBody": "Very good. We fried our first turkey using this recipe. It was great. I will try injecting the next one that we make. This along with the frying tips made a great turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Howard"
},
"reviewBody": "Very good recipe. Our turkey turned out great. I will definately use this recipe over and over again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used this recipe as a reference for frying the turkey. The result was great. Instead of using the Creole seasoning I marinated the turkey overnight in a brine consisting of \r\n1 cup kosher salt\r\n1/2 cup light brown sugar\r\n16 cups (1 gallon) vegetable stock\r\n1 tablespoon black peppercorns\r\n1/2 tablespoon allspice berries\r\n1/2 tablespoon candied ginger\r\n16 cups (1 gallon) iced water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JADERN"
},
"reviewBody": "Great recipe! We used this recipe along with the turkey frying advice in the advice section. We did not let it sit to marinade overnight. Instead, we injected it with Cajun Garlic Butter (came with the fryer) and rubbed the outside with some Cajun Seasoning Salt (also came with it). If you are in a cold area, make sure to get the oil up to at least 450 degrees to compensate because it really cut down on your cooking time. For Christmas we didn't have enough Peanut Oil and didn't realize it till we were cooking that it wouldn't cover the turkey. So we cut the turkey up and fried it in the basket and it was great! This year I will inject it with the same butter seasoning and leave it overnight, but will lay off the salt rub because it almost made it too salty. 3 thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flaquita"
},
"reviewBody": "Finally coming around to writing a review for this recipe. Thought it was perfect timing with thanksgiving coming around the corner. Anyhow, I suggest you marinade the turkey overnight, just seasoning the outside won't help much. You need to inject it with flavor. I suggest you mix melted butter and cajun seasoning, then inject it everywhere in the bird, then let it sit overnight in a fridge (in a trashbag). This does create a moist bird. A must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raineysmom"
},
"reviewBody": "We fried our turkey outside on a cold day. Very important to have the oil temp 450°F before adding the turkey for the recovery time on a cool day will make the oil much to cold and add tremendous cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARK_AMY"
},
"reviewBody": "This is a great recipe! None of us has ever had a fried turkey before and thought it would be nice to try for Thanksgiving. But due to the turkey not being thawed out early enough we had no time to marinate. Instead, we did the recipe as listed except instead of filling the cavity with the Italian dressing, we strained the dressing (b/c the seasoning in the Italian was clogging the injector)and then injected it into the turkey. The rub was terrific. The meat turned out full of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great w/cajun seasoning rubbed under and over the skin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FOODWIZ"
},
"reviewBody": "We will never bake or grill a turkey for thanksgiving again!! Here's a TIP to add lots of flavor: invest in an injector, and mix your favorite seasonings (don't be stingy!) with a cup of melted butter - we like the creole seasonings like chili powder, cayenne, or emeril's essense. You can even add about a 1/2 cup of beer to the mixture. Or you can buy the pre-mixed injectable seasonings. Inject the turkey with all of the butter mixture, sprinkle some of the seasonings on the outside, and put in a NON SCENTED trashbag in the refrigerator overnight - at least 8 hours. Then fry in peanut oil. The meat will not only be tender, but extra flavorful! Your Thanksgiving guests will appreciate the wonderfully unique flavor of the meat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My Husband loves to cook, Thanks to this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cdarbonne"
},
"reviewBody": "Loved this! I also used my injector to inject butter. Can't beat that taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very, very tender and juicy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CYNTHIA"
},
"reviewBody": "It is not cheap. We used about 5 gallons of corn oil for a 12 pound bird. I injected a bottle of strained Bernstein's Italian dressing and rubbed the bird with a mixture of 3/4 Emeril's Rustic Rub and 1/4 powdered bay leaves. Use two people and a broomstick to lower the turkey. Boy, was it good though! My favorite turkey so far. And the dressing flavor was subtler than you'd think. No soggy skin from where the turkey rests on the roasting pan, the bird was beautifully golden all over. Also, we didn't miss gravy as much as I thought we would because the meat was so moist. Not greasy at all if you have the oil very hot and pat the turkey with paper towels before and after frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FELLNER593"
},
"reviewBody": "I have deep fried about a dozen turkeys so far for maybe 25 or 30 different people and have never had a bad review. Young and old alike enjoy this succulently prepared bird. This makes turkey a meal to prepare more than once or twice a year. Stick to peanut oil for deep frying needs. Higher smoke point and it also really seems to accent the birds taste. A+ Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "KID FRIENDLY I RATED LOW ONLY, BECAUSE NO KIDS SHOULD BE AROUND HOT GREASE. OTHER THAN THAT IT WAS GREAT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "the turkey was great. it was quite moist. i injected the cajun seasoning inside. the family and friends absolutely loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've used this recipe for 6 turkeys so far and it is great. Switched to vegetable oil due to the expense and didn't see much difference. A real crowd pleaser if you have the equipment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth Santana"
},
"reviewBody": "Very different. My oil pot was not large enough. My husband loved it, I found it dull. The kids thought it was \"cool\". By the time the inside was cooked, the outside was too dry for me."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13824/deep-fried-turkey/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/975/holidays-and-events/thanksgiving/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16030/holidays-and-events/thanksgiving/turkey/deep-fried/",
"name": "Deep-Fried"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13824/deep-fried-turkey/",
"name": "Deep-Fried Turkey"
}
}
]
}
}
, "about": [
]
}
]