				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Deep Dish Lasagna"
,"datePublished": "2019-04-03T23:27:44.000-04:00"
,"dateModified": "2022-11-02T07:59:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BSD"
,"url": "https://www.allrecipes.com/cook/218906"
}
]
,"description": "Layered in a deep casserole dish and baked at 350, this lasagna features sweet Italian sausage, spinach, a homemade sauce, and three types of cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lHMA3tgR5fK7F8zUWQk2p13osQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3939965-251793fb96cb449a8481af341ab4927f.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2928847488001",
"description": "A crowd-pleasing lasagna with layers of cheese, sausage, spinach, and sauce.",
"duration": "PT3M18S",
"name": "Deep Dish Lasagna",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/e3209766-a768-4987-b3b8-f82759acf3be/7632e1d2-01e9-45ae-8990-a9c50bd19f78/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T18:09:45.075-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Deep Dish Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "120"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "391 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "94 mg"
,"fiberContent": "4 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1467 mg"
,"sugarContent": "9 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"12 uncooked lasagna noodles",
"1 pound sweet Italian sausage",
"0.66666668653488 cup chopped onions",
"0.66666668653488 cup chopped fresh parsley, divided",
"0.5 tablespoon minced garlic",
"3 (6 ounce) cans tomato paste",
"2 cups water",
"1 (15 ounce) can tomato sauce",
"1.5 teaspoons Italian seasoning",
"1.5 teaspoons dried oregano",
"1.5 teaspoons dried basil leaves",
"1 pound part-skim ricotta cheese",
"1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
"0.5 cup grated Parmesan cheese",
"3 large eggs",
"2 teaspoons garlic salt",
"0.25 teaspoon ground black pepper",
"3 cups shredded mozzarella cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a deep 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Cook sausage, onions, 1/3 cup parsley, and garlic in a large skillet over medium heat until sausage is browned and crumbly, 5 to 7 minutes; drain fat. Stir in tomato paste, water, tomato sauce, Italian seasoning, oregano, and basil until well combined. Cover and simmer for 5 minutes, stirring occasionally."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, mix ricotta, spinach, Parmesan, remaining 1/3 cup parsley, eggs, garlic salt, and pepper together in a large bowl until well combined."
} ,{
"@type": "HowToStep"
,"text": "Spread 2 cups sauce in the bottom of the prepared baking dish. Layer with four noodles, 1/2 of the ricotta mixture, 1/3 of the remaining sauce, and 1 cup mozzarella. Repeat layers once more, then finish with remaining noodles, sauce, and mozzarella. Cover tightly with aluminum foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lHMA3tgR5fK7F8zUWQk2p13osQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3939965-251793fb96cb449a8481af341ab4927f.jpg"
}
]
,"text": "Bake in the preheated oven for 45 minutes. Remove the foil and continue to bake until cheese is bubbly and starting to brown, about 10 more minutes. Let cool for 10 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack LeRoy"
},
"reviewBody": "Easy recipe to follow. Made it to feed 36 people instead of 12. Came out really nice. I did boil the lasagna for 18 minutes, a little longer but to our taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This came out better than I expected.for my first time making lasagna. It was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Mandell"
},
"reviewBody": "My changes were: I used turkey sweet italian sausage, and ground beef. I added basil to the ricotta and spinach. I used one large can and one small can of tomato sauce, and one can of tomato paste. Use good pasta noodles, a name brand, so they cook better. The family and I loved it, and I am super picky about my cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cathy Wilhoite"
},
"reviewBody": "This is way too sweet. Good base, but next time I will use mild or hot Italian sausage and leave out the extra basil. Just okay as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Haas Arnold"
},
"reviewBody": "Very easy and delicious lasagne recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Schultz"
},
"reviewBody": "Was a huge hit we loved it!!! I’ve always used my family’s recipe and wanted a change wow it was amazing thank you!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lola240"
},
"reviewBody": "Made it with ground beef instead of sausage. Added mushrooms to the sauce. I made it the night before. Was excellent, everybody loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Fisher"
},
"reviewBody": "I made it for a potluck dinner party and everyone loved it. It is a chore to make, had to had chop the spinach and parsley, onions and garlic. But it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greemy2"
},
"reviewBody": "I used ground beef instead of sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Added more ground beef and sauce. I did not cook noodles first. It turned out perfect. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carl Schlaudt"
},
"reviewBody": "I substituted one cup of Pinot Noir for water, and used mozarella instead of parmesan. The interplay between the Italian sausage, basil, and Pinot Noir -- sublime. I will revisit and reuse this recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla E"
},
"reviewBody": "Yummy easy to make made it on gluten free shells. No sausage just turkey and meat. Lots of mozzarella and riccota cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BKcrash"
},
"reviewBody": "I used gluten free lasagna noodles. Worked perfectly and will make again. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sizzlin'incanada"
},
"reviewBody": "EVERYONE loved this lasagna. Even family who don't like lasagna and are very vocal about it, liked it. \n The sausage was the secret. I used half beef and half sausage and WOW! Flavor on top of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diedra Giddens"
},
"reviewBody": "This was a great recipe. I had to emphasize because I did not have a few of the spices, but overall it still turned out great. I saved the recipe, and the next time I make it I'll have all of the spices this recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catrina Burnett"
},
"reviewBody": "Hey thanks for this recipe I made it for a family gathering and they all loved it. And they are asking me to do personalized pans of this stuff for them. Like I am the originator. Awesome sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicky"
},
"reviewBody": "It was pretty good made it as is. A little dry so maybe next time add more sauce ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolca"
},
"reviewBody": "I followed the suggestion to kick it up and added spinach and zucchini. I doubled the recipe and made one for a friend. It was a big hit. I am planning to prepare again for guests visiting during Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "on the water"
},
"reviewBody": "This was very good ,I would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cammy429"
},
"reviewBody": "I don't know why I haven't reviewed this before. I am this about 3-4x a year, for the last 4-5 years or so. I don't eat pork, so the only substitution I make is mild Italian chicken sausage. My family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeZy"
},
"reviewBody": "Great guideline making lasagna... These recipe had been my guide making my lasagna for many yrs for our Xmas family dinner. Everybody loves it! As much as I made some/little changes for my convenience. ie: oven ready lasagna noodles.\nSorry it took me too long to give my comment. My husband &amp; my 3 boys that are now men w/ fiance and or girlfriends just love it! Thanks for the great recipe. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trieva McBeth"
},
"reviewBody": "I added a layer of dry pepperoni between the mozzarella and cheese mix layers, added some havarti to the cheeses mix, and added mushrooms to the meat mix. Substituted half the water with Chardonnay, and sub'd half the sausage with beef. \nOnly thing I will do differently next time is sub about half of the ricotta with cottage cheese. That will probably kick it up to 5 stars, for me. \nI used an extra deep 9x13\" pan, so didn't have to worry about a mess underneath. A regular baking pan would definitely been a huge mess"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drgarymartinez"
},
"reviewBody": "Everyone who shared this meal with me said that this was the best Lasagna they had ever eaten. The only changes I made was: made my own sweet Italian sausage, added a pound of ground meat, and doubled the spinach- instead of frozen used fresh and chopped. This is now my go to recipe for lasagna. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Johnston"
},
"reviewBody": "We followed the recipe as written, with the following exceptions: we used one cup chardonnay in place of one of the cups of water as suggested in the video and we used extra italian seasoning because we didn't have any oregano. \n\nI think I would use one less can of tomato paste as it was a bit overpowering, and I would include the oregano as suggested. Also, we didn't use the zucchini as suggested in the video and I would like to try that. \n\nOverall, the flavors were rich and yummy - definitely worth trying again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malinda Wittman"
},
"reviewBody": "Made it and everyone raved, it was delicious!! Followed the recipe in the video, adding Chardonnay and zucchini. Also added a little sautéed mushrooms and orange bell pepper. Doubled the recipe, making 2 large pans! It turned out filling and full of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Sandoval"
},
"reviewBody": "fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerettas"
},
"reviewBody": "I don't have much time to spend in the kitchen and this recipe was a winner! With the uncooked noodles there was lots of time saved. I used tomato sauce with basil in it to save additional time. My whole family loved this recipe and I will make it a regular in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SmicaleN"
},
"reviewBody": "I always make my own personal adjustments to recipes, so there are a few things I do differently then what this recipe suggest but this is by far the BEST lasanga I have ever tasted! My Husband and both of our families love love love when I make it and they will request it if I don't make it often enough! Everyone says it is better than any Italian restaurant, I definitely recommend making this to anyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vince Stapleton"
},
"reviewBody": "This a fabulous recipe! Just a few tips I might add... Make marinara first, then refrigerate overnight. Use Chianti red wine to thin out the marinara instead of water. Also added fresh basil, red, yellow and green bell peppers to the Marinara, (chopped medium to small). Most importantly, keep your layers thin and even so you will have room for that last layer! When done, refrigerate until cold. Slice into pie shaped wedges. ( If you try to cut this while it's hot, you will have a mess!) Reheat, garnish with fresh grated parmesan\n and sprigs of Italian parsley. Be sure to serve the same Chianti with the lasagna so the tastes don't clash, Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Liska Eklof"
},
"reviewBody": "use also provolone cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Domine"
},
"reviewBody": "Wonderful recipe. Invited some friends over because the dish is so large and even one who disliked spinach liked the lasagna enough for three helpings. I used no boil noodles to cut down on prep (although I forgot to soak them so they were a bit too al dente, I'll correct that next time). I added a diced zucchini to the skillet while browning the meat and used chopped green onions because I prefer them to yellow. The cans of Hunts tomato paste and sauce I had on hand already had Italian seasonings included so I didn't add that (but still added the extra basil and oregano). Turned out wonderfully but almost overflowed my 13x9x2 dish, so I'll have to find a deeper one for next time (2 1/2 to 3)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teacherlinda"
},
"reviewBody": "Made this last night, with some modifications. I used 1 lb. ground beef, and 1 lb. sweet Italian sausage. Doubled the amount of tomato sauce and used more water than recipe called for. Eyeballed the seasonings, so probably used more than recipe stated. Also let it simmer for about 2 hours before assembling the lasagna. Used more cheese, but did mix the ricotta, spinach and parmesan with eggs and seasonings as called for in the recipe. I make lasagna a few times per year, but have never mixed eggs with the cheese. I was hesitant to try this, but it was really good this way. I followed the instructions for layering the lasagna, just put the rest of the ricotta and parmesan on the top layer of the noodles; covered with the sauce and mozzarella and baked it according to directions. It was absolutely delicious! Also, even though I doubled the sauce ingredients, it still made only one pan of lasagna. I used a few more noodles than called for (trying to use the entire package). It was extremely heavy so we needed only a small slice. Served it with a green salad and Italian bread for a wonderful dinner. Thanks for the recipe. Sorry to have made so many changes, but it was only with quantity. I thought we would have extra sauce for freezing, but no such luck. Used it all in this lasagna. Not sure if we would have enjoyed it so much with less sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RayZlobo"
},
"reviewBody": "My family loved it!\n\nHowever I will say this, this was my first lasagna and I was exhausted!! But it was worth it. I added 1 pound of ground beef along with the Italian sausage, and boy did it make it worth it! While this pan size actually contained the beast, I might get a slightly bigger size next time and adjust the portions a little. Oh, I did add a little more of the seasonings except for the garlic salt and Italian seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Anderson"
},
"reviewBody": "This worked out great. I actually used jarred pathetic sauce to save time after work. I also completely forgot to put in the gigs and everything came together well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JABake"
},
"reviewBody": "This is a great recipe! My husband doesn't touch Italian food/pasta dishes, and he was all over this dish! I used ground beef instead of sausage and it came out really nicely. I think next time I will add a little more cheese. It wasn't as cheesy as I would have liked. Nonetheless, it was tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jean Otto"
},
"reviewBody": "Nothing special, sorry!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hevva"
},
"reviewBody": "This is a version of MY lasagne! I use cottage cheese instead of ricotta, sometimes use a bag of chopped fresh spinach, and often use the other half of the pot of meat sauce for bolognaise with added sausage, sauce and veggies as needed. This is also great as vegetable lasagne with layered zucchini &amp; eggplant slices in pasta sauce. Try a few sprinkles of ground nutmeg in the egg spinach mixture. It rocks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vic"
},
"reviewBody": "Great Recipe. Its just a little time consuming. However I usually end up with extra sauce which I save and use for Spaghetti"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gregory"
},
"reviewBody": "This is a wonderful recipe! That being said, I do have one recommendation... PLEASE cook a few extra lasagna noodles, and begin the layering process by covering the bottom of your baking dish with a layer of lasagna noodles, than alternate layers as you wish... TRUST ME!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkevin"
},
"reviewBody": "Very good quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "I did not include the spinach, but I did add a full zucchini to the sauce. I also added a 15 oz can of tomatoes and decreased the water a bit. Added a bit of sugar to the sauce and used turkey sausage. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JamesGood712"
},
"reviewBody": "I've been using this recipe, along with some modifications, for years. It is phenomenal. I left out the spinach, added some green and red peppers, and a tub of cottage cheese. Anyone who's tried it has loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Orlowski"
},
"reviewBody": "Made this dish for my meat-hungry family, and they weren't left wanting. Very good recipe. Loved the spinach addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefHeatherBoo"
},
"reviewBody": "The most amazing sauce I have ever tasted... My culinary class and I made this sauce for a vegetarian lasagna for a meal we were catering... They were stunned. It was just great... We are in the process of building our lasagna.... Hopefully it will be a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alihondro"
},
"reviewBody": "This was awesome, total hit, everyone loved it and kept eating until they couldnt lift thier forks anymore!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brazilianxsun"
},
"reviewBody": "delicious! I added mushrooms to the meat sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ProudMama234"
},
"reviewBody": "I started using this recipe a few years ago, and haven't found anything that compares! Sometimes I leave the spinach out if I'm making it for a picky crowd, as I do find that it is a strong flavor. While the recipe is a bit time consuming and uses a lot of ingredients, it's very easy and completely worth it! I've never had anyone dislike this lasagna. I always serve it with freshly baked french bread and a salad. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PandA1366"
},
"reviewBody": "Used hot and sweet sausage and extra sauce. We all loved it. Even better day 2"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libra18"
},
"reviewBody": "Made this for dinner and it was a hit! Minus the spinach which I will try next go round and this time I added ground turkey and turkey sausage instead of italian sausage. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LBOWDEN"
},
"reviewBody": "My family really liked this recipe. It takes some time but we were able to make two meals from this. Be sure you are a spinach lover if you decide to use it because I was able to taste it much more than I expected. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANJACKSON"
},
"reviewBody": "FANTASTIC!!! I love a good homemade lasagna, you can't beat them - so much better than store bought. Very time consuming to make, but always worth it! Anyway, made this over the weekend for my mom and dad's birthday dinner &amp; I loved that this one uses tomato paste and tomato sauce instead of jarred pasta sauce. I didn't have Italian sausage, so I used a combo of lean ground beef and some ground pork. I also added some fresh zucchini and grated carrots and my usual dash of nutmeg to the ricotta mixture. A great tip is to soak uncooked lasagna noodles in hot water for 20-30 mins while you are prepping everything else - no need to boil the water and cook the noodles as they finish cooking when the lasagna goes in the oven! I made this on the Friday, left it sitting uncooked until the Saturday and then cooked that afternoon. So yummy. Great with a nice salad and Italian Pinwheel Rolls from this site, mmmmm!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan G."
},
"reviewBody": "great and easy lasagna!! I only used 2 cans of tomato paste, omitted the spinach and added fresh sliced mushrooms. I also used the no boil noodles which was alot easier. Must be good because my husband ate a HUGE amount!! Will make again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "Was absolutely wonderful. I left out the spinach and instead of mozzarella chesse I used colby, montery and sharp cheddar shredded. Did not have these ingredients so made a different version. Glad I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANNMARSH"
},
"reviewBody": "This is a wonderful classic lasagna recipe. I have been making this for years and everyone always loves it. It is somewhat time consuming to prepare, but is totally worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carriehu"
},
"reviewBody": "This was a yummy lasagne, the Italian sausage was tasty. The only thing I did differently was to use less spinach. I'd add more veggies next time, but a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Sonia B"
},
"reviewBody": "Absolutely delicious!! Made this for my boyfriend who is very picky and he's ate it for lunch and dinner the last two days! I didn't have oregano so I added extra basil and also some salt to the meat mixture. As suggested by another review, have everything chopped and ready to go BEFORE you start otherwise it gets a little crazy. The only issue I had was that 1 pound of meat didn't seem like enough?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Really loved the recipe-especially the sausage rather than using ground beef. I added extra garlic and used fresh basil,but kept the rest the same. Lots of compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia"
},
"reviewBody": "This is absolutely the best lasagna I've ever had. I had to sub a coupla items because we don't have ricotta or Italian sausage where I live (China) so I subbed tofu and made my own sausage. I only had two eggs. Added some extra veggies (zucchini, mushrooms, grated carrots) but it would have been just fine without that. I would rate this higher if I could. I even had some for breakfast this morning and it was even better. I can't believe more people have not tried this recipe. After reading the reviews of other lasagna recipes, I found that most people made changes that were already included in this outstanding recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina Green"
},
"reviewBody": "MY SEARCH IS FINALLY OVER!!! This lasagna was awesome. Let me start by saying, I was going to make the American Lasagna also on this site since it was rated high but after reading reviews there were too many additions/substitutions that were used to get it to the 5 star rating. I read the reviews for this recipe and not many complained about dryness or blandness which has always been my issue with lasagnas in the past. This recipe has the perfect amount of seasonings and sauce consistency to make a tasty and moist lasagna. The only changes I made were based on personal taste. I added some cayenne (about 1/8 tsp), substituted one of the 15 oz containers of ricotta for 8 oz of cream cheese and I only used 1 egg. I also salted the meat mixture a lil to taste and added about 1 1/2 tbsp of sugar. Absolutely perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyler"
},
"reviewBody": "Absolutely delicious. Easily some of the best, if not the best lasagna I have ever had. I added a little bit of feta cheese to it as well though, I would recommend that to anyone making this. Otherwise, it is outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bddrmr"
},
"reviewBody": "Turned out excellent and I'm a non-cooker normally. It wasn't too hard to make. Rich and tasty, I was impressed with the recipe, and myself for managing to cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "This was amazing! We will definitley make it again! We made the sauce and I think that was the clencher."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sumchelle"
},
"reviewBody": "Wow - This is somethin' else! I did use nine noodles, less FRESH spinach (chopped very fine, and didn't measure it), and added some Mozzarella to \"Step Four\", as suggested by Shelzers. Although this dirtied a TON of dishes, it was forgiven and forgotten after the first bite. Adding to my \"paper\" recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaMac"
},
"reviewBody": "I have a staple lasagna recipe but decided to give this one a try since it has the addition of spinach... have made 2 pans of this so far... everyone loves it! Thanks for such an awesome recipe! (This also freezes well after baking!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missteree"
},
"reviewBody": "This is just the kind of lasagna recipe I was looking for! I love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lrichter6"
},
"reviewBody": "Great recipe. Since I live in the South, I carmelize some sweet onions and add to the sauce, and use a can of 28 oz. Cento Tomatoes, crushed by hand instead of the water and tomato sauce. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "My boyfriend called it \"restaurant quality\"! I did use 4 cups of mozzarella rather than just 3, and I added red pepper flakes to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nprice01"
},
"reviewBody": "This was the best lasagna.I used half ground beef and half sweet sausage. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria2007"
},
"reviewBody": "This recipe was out of this world good! I made it exactly as shown (I didn't measure anything - I just winged it) my 4 year old daughter devoured hers and one of my husbands friends thought that I had it catered in!! This is a must make. Very delicious!! Make it with \"Cheesy Garlic Bread\" - (recipe on this site) - Yumm Yumm Yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "Postively delicious! It takes some effort, but it is well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarandboo"
},
"reviewBody": "My friend made this recipe for me first and it was delicious. I HAD to find it and make it for my family. One of the most flavorful lasagnas I've ever eaten! SOOOO Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NADINEMC"
},
"reviewBody": "I loved it - family said too much spinach"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelzers"
},
"reviewBody": "Great recipe! Hubby doesn't like ricotta cheese, so I substituted with cottage cheese (2% milkfat - small curd). It turned out great. Also, I added one cup of mozzarella cheese in \"step 4\". This helped keep the cheese mixture from \"sliding\", which is often the case with lasagna. Instead of a whole pound of sausage, I used 1/2 lb. and 1/2 lb. of ground turkey...a healthier combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelica"
},
"reviewBody": "Excellent recipe, the best I've found. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "byrd"
},
"reviewBody": "I made this recipe for Christmas and my family loved it. It was so good that I am going to make it for New Year's Day. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ESHA115"
},
"reviewBody": "This is one of the best lasagnas I have ever tasted. All my friends luved it! I used ground turkey instead of sausage and it came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherylmarie"
},
"reviewBody": "mmm mmm mmmm!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This was fabulous! I followed it exactly and it came out great! Even my husband, who isn't big on green vegetables, loved it! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was somewhat dissapointed with this lasagna, I am so used to following the one on the back of the pasta boxes but this time I wanted to try something new. The results were not as good as my usual one and there wasn't enough meat in the final dish, also, the tomato paste took over the entire flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "Definitely a hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NKTAUBE"
},
"reviewBody": "My husband made this one night. It was good, but took a long time. Also, the sausage taste didn't really come out, so it seemed a bit of a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LUCKYKEL"
},
"reviewBody": "great lasagna! I love that it has sausage instead of ground beef...so much more interesting. For anyone who has not tried this, I did and it worked great - instead of boiling the noodles, I laid them on a sheet pan and poured boiling water over them while I was making the red sauce (btw, I like diced tomatoes, so I substitued those instead of tom. sauce and water as called for). Since the dish bakes for 45 minutes, the noodles came out perfect!! So much easier than boiling the noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "This is definately the best lasagna recipe I've found by far. The only change I made was using turkey italian sausage since I don't eat pork. Easy to make, and the perfect sauce to pasta ratio (some recipes I've tried have come out a little too dry). My honey said this was better than his Mom's, and that's saying a lot. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Valiante"
},
"reviewBody": "this recipe makes a mean lasagna! i added sliced zucchini, fresh mushrooms and used 4 cups shredded mozz. i didn't have fresh parsley so i substituted with 3 1/2 tablespoons dried. it turned out so yummy! it's time consuming but the end result is well worth the effort. i will be making this again, and again, and again!! thanks for sharing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKER476"
},
"reviewBody": "This is by far the easiest lasagna I have ever made, even though I took a lot of liberties and used a lot of leftovers. It was DELICIOUS. About doubled the meat and made L/O seasoned beef taco mix taste like Italian sausage by seasoning it unmercifully. (I think I overdid the crushed red pepper, though, since everyone drank an awfully lot of fluids…) About doubled the cheese mixture, since that is what I had in the freezer. (It was a mixture of 1/2 ricotta and 1/2 cottage cheese.) Went heavy on the spinach too, to finish up what was in that package. In addition to the garlic powder, I also added some fresh minced garlic to the ricotta mixture. Other than that I followed the recipe exactly--oh, did I mention that I used no-boil noodles, and added a small amount of Monterey Jack cheese on the very top, since the Mozzarella looked a bit anemic??? Even though a lot of this sounds silly, I would pretty much make it the same way next time, except that I would use the Italian sausage!!! It was absolutely YUMMY, and, as I can attest, hard to screw up. Do try this!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good, but a little complicated as this was my first lasagna"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WRF1973"
},
"reviewBody": "Excellent recipe - I made it for my girlfriend and it was a huge hit. I used hot Italian sausage instead of sweet. It was just a tad salty, so I'd recommend using a little less garlic salt or throwing a pinch of sugar into the sauce. Also be generous with the cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Outstanding! I prepared this recipe for my X-Mas eve dinner - and received great reviews. I substituted traditional lasagna noodles with the 'no-boil' noodles, and used mild Italian sausage - as opposed to 'sweet' Italian sausage - but overall - fantastic recipe. A great baseline lasagna - with lots of room for extras/alterations. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a phenomenal lasagna! I made this for my boyfriend and roommate last night and everyone loved it! I'm actually eating some leftover for breakfast right now. I did change the recipe a bit...I doubled the mozzerella, and made extra sauce, which I also added two fresh cloves of garlic to. Yumm!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CGERVAIS"
},
"reviewBody": "Wonderful, I double the sausage and use spicy instead of sweet, omit the spinach and twice the cheese and sauce. My boyfriend said it is better than his mom's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GOMOMMYGO"
},
"reviewBody": "made it for my sister who just had a baby it made the house smell so good I made it the next night for my own family. My little girl came into the house from playing and said Mommy what is that yummy smell. A cinch to make. I used bottled sauce. Will definately make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIYASPOT"
},
"reviewBody": "Great lasagne! I served this at a family reunion and it was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We made this lasagna last night and it was wonderful. Very hearty and filling and relatively easy. We are cheese lovers, so we doubled all the cheese, but it still wasn't cheesy enough. Also, we used hot italian sausage rather than sweet sausage. One suggestion... cut everything up and prepare before you start cooking. It got hectic there for a while. Will definitely make again!! Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MALETVETTE"
},
"reviewBody": "not a bad lasagna, i'd def make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was okay, I didn't care for the sausage so much,I would prefer hot sausage. My family also does not like riccotta cheese so we added more mozerella. The spiniach was good but my husband requested a little less next time. All in all this was good with a little fixing it worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had several friends over and served this lasagna. They all loved it. I could not find sweet italian sausage and made it with ground round and it still tasted very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Gavloski"
},
"reviewBody": "Absolutely delicious! My whole family loved it, and I even got my vegetable hating 2 year old to eat spinach and love it. Made a few changes, did not make the homemade sauce, just used 2 cans of spaghetti sauce. I also used oven ready lasagna noodles and used 4 cups of mozzarella because we like our cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya A"
},
"reviewBody": "This was my first attempt at making lasagna and I was a little worried at first but it was so easy. I think the hardest part was getting everything ready at the same time. The family loved it and said it tasted homemade.... I did make a few adjustments though to my taste like I added 2 cloves of garlic to the cheese mixture and used prego spaghettis sauce. It was awesome thanks for the recipe"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23710/deep-dish-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23710/deep-dish-lasagna/",
"name": "Deep Dish Lasagna"
}
}
]
}
}
, "about": [
]
}
]