				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Deer Poppers"
,"datePublished": "2019-04-02T02:46:53.000-04:00"
,"dateModified": "2022-08-17T02:38:27.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DJ8BUD"
,"url": "https://www.allrecipes.com/cook/921419"
}
]
,"description": "I recently took these to a Halloween party and they did not make it to the barn where the party was at! I bet 15 people asked me for the recipe. If you don&#39;t like the gamey taste of deer meat this recipe is for you!! These make great appetizers. Even people who don&#39;t like deer meat liked these!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DzDWb56oUztkhpzcllH6nznJsbw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1935926-deer-poppers-nicksierra-4x3-1-9275e4a1c50a43a1b2f921c5afe487f1.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Deer Poppers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "143"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "308 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "53 mg"
,"fiberContent": "0 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "1029 mg"
,"sugarContent": "4 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 pound venison steaks, cubed",
"0.5 teaspoon Greek seasoning, or to taste",
"0.25 teaspoon steak seasoning, or to taste",
"1 (16 ounce) bottle Italian salad dressing",
"0.5 cup jalapeno pepper slices",
"10 slices bacon, cut in half",
"toothpicks, soaked in water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Season the venison meat with Greek seasoning and steak seasoning. Place in a bowl, and pour in enough Italian dressing to cover. Refrigerate for at least 2 hours to marinate, but preferably overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the grill for medium heat. Drain the marinade from the meat, and discard the marinade. Place a slice of jalapeno on top of a piece of meat, then wrap with a slice of bacon. Secure with a soaked toothpick. Repeat with remaining meat."
} ,{
"@type": "HowToStep"
,"text": "Grill the deer poppers for 15 to 20 minutes, turning occasionally to brown the bacon. Serve and enjoy!"
} ]
,"recipeYield": ["10"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe DeMonte"
},
"reviewBody": "Let me preface this by stating that my family has enjoyed venison (white tail) for decades. This recipe was a departure from how we normally enjoy the venison that we are blessed to get each year. I had to try it based on all the amazing reviews. I just finished eating this meal and I am more than impressed! Delicious! No real venison flavor, but the texture of our venison made this unique and utterly delicious. It wouldn't nearly have been as good with beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMarie"
},
"reviewBody": "These are so so good ! little time consuming but worth it! makes a great appetizer and they don't last ! My husband did not want them made with the jalapeno peppers. Cut all the bacon in half , recommend not to use thick bacon. marinated only in the bottled dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busygal"
},
"reviewBody": "I'm always looking for recipes for the game my husband and son bring home. I had made some other venison recipe recently, and had a bit of meat left over. I trimmed and cubed it and tossed it in the freezer, intending to do something with it another time. This recipe was perfect! We served this as an appetizer as the extended family watched football on TV. Even those who don't typically eat venison seemed to enjoy.\n\nI played around a bit with the right amount of bacon to wrap around the popper. Even after soaking, the wooden skewers didn't hold up on the grill, so next time I'll use metal skewers. My hubby didn't grill them quite as long as I prefer, so I did finish them under the broiler to get the bacon nice and done. I served it with jalapeno mustard for dipping. Yum!\n\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe T"
},
"reviewBody": "We are a family of 6 and eat a lot of venison. Always looking for new ways to cook it to mix it up a bit, and this was great. I am the only one that likes jalapeño’s, so left them out. Definitely doing again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SummerSez"
},
"reviewBody": "I've made these SO MANY TIMES in my life. I've never used greek seasoning on them, but they are equally as awesome with just steak seasoning. Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Stockburger"
},
"reviewBody": "SO GOOOOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kairakid"
},
"reviewBody": "Amazing! I added cream cheese as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonofsimp"
},
"reviewBody": "These are fantastic! I added a smear of cream cheese inside the pepper slices and I recommend a whole slice of thick cut bacon per popper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Walker"
},
"reviewBody": "First time I've ever eaten or cooked deer meat and these were absolutely wonderful! I made them without the jalepenos and they were a huge hit. Thanks for posting the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donald Mitchell"
},
"reviewBody": "Made these tonight. Followed recipe except for one thing, grilled on low heat until bacon was done. Took a little longer, but well worth the wait! Wife and daughter have it 10/10 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcasa"
},
"reviewBody": "I made this to use up some venison for my husband and his friends on poker night. I barely made it downstairs with the tray. I actually did not even get to taste one but was told they were amazing and that I had to make them again. I marinated the venison over night after allowing it to soak in water for 10 minutes. I followed the recipe exactly using homemade Greek and steak seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary B"
},
"reviewBody": "I LOVE venison. I also love these for a party. I used the jarred wet hot peppers like you get at the deli. Super easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Good but next time I am putting them on a rack so less grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Paxton"
},
"reviewBody": "We loved this dish! I couldn't find the Greek seasoning I wanted so I just doubled up the steak seasoning. I used fresh jalepenos also. Definitely will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicksierra"
},
"reviewBody": "Easy recipe...absolutely no gameiness if you marinade over night...this will win over NON venison eaters..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "locook"
},
"reviewBody": "Holy smokes!!!! SOOOOOO AWESOMELY GOOD! They lasted only 5 minutes after they were done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Havenar"
},
"reviewBody": "I added slivers twice the size of the jalapenos of yellow onion and green bell peppers. I added Liquid Smoke to the marinade. I also substituted balsamic vinegar and olive oil for the Italian dressing in the marinade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smarsten"
},
"reviewBody": "Have made this several times now, get mad compliments every time. Even from people who say they don't like venison."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashrn06"
},
"reviewBody": "I did what Barkable did and it turned out great! I ran out of bacon so I put pepperjack cheese on the remaining bites and they were delicious too! Next time I might put a small piece of pepperjack with all of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StevenStew"
},
"reviewBody": "I have made this recipe a few times now. I followed the instructions the first time with one exception, I marinated the meat with the jalapenos as well. However, in the end the Italian dressing was a tad over powering so now I use the Lawry's Balsamic Herb marinade which is milder and doesn't eliminate the venison taste, but complements the flavors VERY well. I also add a chopped spanish onion to the marinade along with crushed jalapenos, pepper, Montreal steak seasoning. I try to marinade for at least a day or longer. (Each day I marinade for I will take the mix out and mix around and put it back.) I then take another reviewers instructions to cook them in the oven at 400 for 10 minutes then broil them to crisp them up. My friends and family prefer moist meat so it always presents a challenge with Venison since it dries out so easily. If you find your venison is dry try cooking it for a little less time next time or try making larger steak pieces. I am still experimenting with this recipe, but I have to say I am satisfied with what I have here. Best of Luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbergh0930"
},
"reviewBody": "This was a huge hit. I did make 1/2 with the recipe as stated and 1/2 with no steak seasoning. It seemed like a lot of spices and I was curious if it was all needed. We love greek flavorings so that's the only reason I kept that side of the spices. Both were awesome and there was little difference between flavors. Also tried a few with cream cheese...excellent as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittney Heimbigner"
},
"reviewBody": "It was so flavorful and juicy, it was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shauna Hubbard"
},
"reviewBody": "I have taken this to potlucks, made it at home, everyone has loved it! I added one slice of purple onion, and the cream cheese in the jalapeno, but everything else has been the same! I have done it on the BBQ and in the oven, it's a great recipe, especially for those of us OFTEN cooking venison, I know I like to kick it up a notch! This is great in the rotation!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Tenney"
},
"reviewBody": "Really good. Bacon really does go great with everything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin 'Bower' Zimmerman"
},
"reviewBody": "I followed the recipe except I baked for 20 minutes at 450 and broiled at 500 for 5 minutes to make sure the bacon was crisp since my husband likes his bacon crisp. The venison was dry (which is normal it seems from the recipes I've tried) but tender. I will use this one again for next years' kill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tisha L"
},
"reviewBody": "Excellent recipe. People in my family who do not like deer even enjoyed them. The second time I made them I used a slightly spicy seasoning in place of greek and omitted the dressing. It was still delicious! I have done them on the grill and in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Mendez"
},
"reviewBody": "I absolutely loved it!!! This is the perfect recipe for those who are new to deer meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Brown"
},
"reviewBody": "Amazing!!! I skipped the Greek &amp; Steak seasoning and did the rest as it says. they didn't last long. Will double up next time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmf"
},
"reviewBody": "I made this tonight for the first time, and we absolutely loved it. Used others suggestions and tried cream cheese in some and pepper jack in some. We don't normally like cream cheese, but we actually like those best. My husband and 11 year old could not stop raving about how good they are! I have to agree, the deer tasted like beef, no gamey taste! Overall... Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FCBowhunter"
},
"reviewBody": "Fantastic. I marinated the venison steaks in white wine and garlic for a few hours. Then sprinkled on some Creole or steak seasoning. Rolled them up and then poured a little italian dressing (fat-free) on as I put them on the grill. I also ran out of jalapenos so I used cherry peppers. I liked how the bacon kept the venison from drying out on the grill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Couch"
},
"reviewBody": "Next time I'll try making these with Allegro Marinade instead of Italian Dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefanie Beach Camfield"
},
"reviewBody": "Growing up eating deer meat I find it sad many people don't like the taste of venison. These are always a hit at every party I make them for. They rarely last 10-15 minutes after I set them out. Great way to use up cube steak which is generally tough on its own. I have also had success baking then broiling them in the oven when a grill isn't handy. Bake at 350 for 15-20 minutes then broil until the bacon is crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krischelle"
},
"reviewBody": "I made these for a end of year fantasy football game. I didn't use any seasoning, but I had Carribean Jerk marinade so I used that, marinated the venison chunks for about 5 hours, used bottled sliced jalapenos and high quality bacon. Gone in no time, everyone thought the heat was just right. Even people who didn't like hot stuff liked them, and people who didn't like venison had no idea it was venison"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "halfbaked"
},
"reviewBody": "Wow! I am new to cooking venison, and this recipe is fantastic! Only after I'd begun prep did I realize that I had balsamic vinaigrette, not Italian, salad dressing. I used it and it turned out great anyway. Also, for steak seasoning, I used a meat rub (closest I had). I also used a lot less salad dressing than the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "*Sherri*"
},
"reviewBody": "My brother is the hunter and gives me back-strap every year. I usually make a stew or just cut it up and stir fry it on the stove top for wraps. i Wanted to grill it and found this recipe and since my garden is overrun with jalapenos I gave it a try. I cut my meat into 2 by 3 inch chunks and marinated them for about ten hours. I used the exact marinade and spices except I also used a few dashes of Teriyaki sauce. I used a whole piece of bacon to wrap with and put a jalapeno slice on one side of the meat and on the other a slice of sweet onion, and wrapped tightly, pretty much covering the whole chunk of meat. We grilled on charcoal with a direct side and indirect heat side, that way we could move the pieces that were done first to the indirect side while working on the ones that still needed to cook more. Turn these constantly while cooking and be careful because bacon drippings will send up some flames once in awhile. Once the bacon was pretty crispy and even getting a bit blackened we removed them from the heat. It took about 20 - 30 minutes for each over medium high coals to cook, depending on their size. Oh wow... were these ever tender and tasty and even the bacon was cooked to perfection. The jalapeno gave just enough spice, not too much. I will be telling my bro about this one. We served this with Coleslaw with a kick here on AR, was a perfect match together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowflakey"
},
"reviewBody": "These are fabulous! Don't change a thing. I'll admit, I did cook the bacon just a little before wrapping around the tasty tid-bits of venison and pepper. (Hubby likes his bacon REALLY crispy.) And I cooked them on a rack in a 425 degree oven due to the wild weather we were having outside. Love 'em!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb O"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MichaeleM"
},
"reviewBody": "These are amazing! I've actually used duck breasts with this as well, and when I do, I never have any left over! So so so good!------------I also add a small chuck of cream cheese to the jalapeno, then wrap-makes it even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dsorenson"
},
"reviewBody": "One word: Awesome!! The only variation I did was I roasted fresh jalepenos to place on the poppers. I will make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hanna"
},
"reviewBody": "Great review from our family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marco_funk"
},
"reviewBody": "I have used this recipe several times at large group potlucks - it's always the first appetizer to be polished off. I love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flyin_brian95"
},
"reviewBody": "Made these for a football party and had to make it again the next weekend. I used the inner tenderloin from the deer. Sliced it into 3/4\"-1\" thick slices. I seasoned the slices with Montreal steak seasoning and let it sit for about 30 minutes to absorb that flavor before putting it in a bowl with the jalepenos and italian dressing. I did not have any Greek seasoning so I just omitted that part. I then let them marinate overnight in the fridge. I did use a slice of Jalepeno on each one, some on the inside of the bacon and some on the outside of the bacon. We had ten inches of snow on the ground at the time so I did as someone else suggested and baked them for 20 minutes. I then drained the juice out of the pan and placed them under the broiler to crisp them up just a bit. Absolutely delicious! Don't plan on any leftovers because there will not be any!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A.J.B"
},
"reviewBody": "I like deer meat, but it's not at the top of my list. This recipe, however, is SO good! My husband and I made this tonight, with a few alterations. Instead of \"poppers\", we made skewers. We replaced the jalapenos with sweet pickled banana peppers, and added onion. Talk about tasty- our whole family (including a 4 year old and 7 year old) loved it! We will definitely be making this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kpitts96"
},
"reviewBody": "These were great! My husband said these need to be made regularly from now on. I made them for a New Year's Day appetizer while watching NCAA Bowl games. I used a pack of Cubed Loin and marinated it in Dale's/Moore's sauce and a bottle of fat free italian dressing. I let it marinate for a couple of hours. I placed approx 2T of meat on a 1/2 slice of bacon and topped the meat with approx. 1/2T of cream cheese, then a slice of jalapeno (marinated jar kind). Wrapped the bacon around the meat mixture and secured it with a toothpick that I had soaked in water for 30 min. (Make sure to stretch the bacon as you wrap it to make it thin so it will crisp up well.) I placed them all on a baking sheet and I baked it in the oven at 400 for 20 min. I drained the liquid from my pan and then I put it back in the oven and broiled it for another 5 min to further crisp the bacon. After we sampled them we decided that the jalapeno makes it too spicy so we removed the jalapeno before eating the rest and the jalapeno left it a really good flavor but without the heat. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IBJammin"
},
"reviewBody": "perfect, these were eaten as fast as I could make them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krisi Symons"
},
"reviewBody": "These were wonderful! Barely made it off the grill before guest were eating them at our pig roast. Did not use the steak or greek seasoning, but added cream cheese like reviews suggested. Guest that don't even like deer at our party could not stop at just one! Great recipe will use this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindylou00"
},
"reviewBody": "made these this weekend and they were wonderful everyone loved them. These are a keeper for sure!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene"
},
"reviewBody": "These really are great. I made some without the jalapenos for those who don't like spicy food, and even they preferred the ones with the peppers. My husband has to go hunting again so I can make more for the upcoming Holiday parties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brett Easley"
},
"reviewBody": "This was our first Deer and our first recipe, it was great! We deleted the jalapeño on the ones for the kids and was great that way as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhonda"
},
"reviewBody": "This was wonderful. We marinated the venison in sesame ginger salad dressing for a couple of days and then grilled. We got rave reviews from our friends and family. We will fix this again for sure!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dug76"
},
"reviewBody": "very good made these saturday big hit will make these at deer camp this year"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gertancoec"
},
"reviewBody": "absolutely delicious! what a hit. This was my first time eating venison, so I wanted to try something like this. I made these for a party and people were RAVING about them. Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leona Morrison Carver"
},
"reviewBody": "My husband said these were great. I made them for a pig roast we went too. They were gone before I got to try them. The venison was marinated in Italian dressing and A1 sauce only (we didn not have the seasonings). and we added some pepperjack cheese to half the batch. It was liked both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissJill"
},
"reviewBody": "My family and I love these. My husband and 2 sons are bow deer hunters. Whenever we have a get together we are asked to make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IslandMama"
},
"reviewBody": "I couldn't find the rub so I just marinated it in the dressing, but this is amazing, I think the cream cheese really adds alot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LareinaK"
},
"reviewBody": "My husband was drooling before these even started cooking. He loved them and sang later about how delicious they were. I followed the recipe exactly only I used half jalapeno and hald chili pepper from our garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hilltop_bakery"
},
"reviewBody": "We all loved these! We eat a lot of deer meat throughout the year. Nice change from fried deer loin. Only thing is it takes a little time to put them all together. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alice_rose"
},
"reviewBody": "Difficult to handle. Will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Kulp"
},
"reviewBody": "Thank you so much for sharing this recipe, I am addicted to these now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "This is great, try it with taking a piece of back strap and slicing it then make a split in the middle and stuffing it with cream cheese then wrap it with a jalepeno and bacon, that is awesome as well!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PL"
},
"reviewBody": "EXCELLENT! Will definitely make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "These are great. I skewered them to make it easier to flip around, [practicing for munchies for the Super Bowl, this ones in the line up.] Served them with 'Devil's Steak Sauce' from this site, insanely good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "My husband has been eating venison for over 20 years and he said that this was the best he has ever had. I only used Italian dressing to marinade and I did a little piece of cream cheese between the jalepeno and deer meat. It was wonderful! You need to try this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ahandful"
},
"reviewBody": "I did not follow the recipe. I used deer sausage, didn’t use a grill and I did not allow the ingredients to marinate for the proper amount of time. I would make this dish again as an appetizer. The sausage added a spicy element that was complemented well by the jalapeños which were tangy from the vinegar...again I altered by not using fresh jalapenos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monk"
},
"reviewBody": "this was really good make it 2 times but the 2nd time i added finely chopped onion and garlic and a table spooon of franks hot sauce to the marinade it was great people loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Zysk"
},
"reviewBody": "I didn't use the jalepenos and used a store bought marinade, but loved this recipe. There was no gamey taste and the bacon was really tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erz2002"
},
"reviewBody": "We enjoyed this recipe, and it was a great way to use up some of the venison in our freezer. I made the recipe as directed, allowing the meat to marinate overnight. This recipe masked any of the gamey taste typically associated with venison, which I don't enjoy. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARladybug"
},
"reviewBody": "I have been making these for years! Our whole family loves them even the venison haters. The only thing that I do different is I put a little dab of cream cheese in with it and I use thinly sliced bacon and pull it thiner before wrapping. This keeps the bacon flavor and helps give the bacon a crispier texture. If your deer hunters also duck hunt this is a great recipe to substitute the venison with thinly sliced duck breast pounded out flat. (my personal favorite)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "M&M"
},
"reviewBody": "Add CREAM CHEESE! My family loves bacon wrapped deer! We do it a little differently in Louisiana. Marinate in Dales for about 20 minutes(Do NOT marinate too long or meat will be salty!!!) Salt Pepper Garlic. I added small squares of cream cheese with mild jalapenos and wrap with bacon. Great on grill using shishkabob rack (saves time and no more stabbing yourself). We also tried this recipe using steak meat and it was great too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Klgoretcki"
},
"reviewBody": "These were so good, a family favorite. Now when we go to outing they ask us to make them. I added some chopped up green onion to the cream cheese that I put inbetween the jalapeno and the venison steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VTQK"
},
"reviewBody": "Delicious. Surpassed my expectations... be sure to remove the toothpicks, since the ends can burn off and guests may not know they're in there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LissaKay"
},
"reviewBody": "We made these tonight and they are amazing! I have got one in my mouth right now! :) The only thing we changed was we used a roasted red pepper italian dressing, but I doubt it made much of a difference. We will certainly be making these again when hunting season comes around!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Lowe"
},
"reviewBody": "Should get a 6! I made these for a party and they were a hit. Everyone loved them including my wife who hates venison! Did everything except for the greek seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristian"
},
"reviewBody": "SO GOOD!!! Big Hit with my friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Jo"
},
"reviewBody": "I absolutely love this recipe!! I have to be quik when I make it, because my family FULL of HUNTERS love these. I maranade any kind of game meat.....pheasant, deer, elk, wild boar...etc. in parmesan, italian dressing over night and ommit the other seasonings. I think that's why I like this recipe so much, it has a lot of versatility! This has become a BBQ staple in our family! Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dkay"
},
"reviewBody": "These were good, but I would cook the bacon in the microwave for a few minutes first. The bacon was just too undercooked when I made them. I will try this again. The marinade and meat were very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lara Delamater"
},
"reviewBody": "Wow!!! Delicious!!!! Always looking for recipes for my freezer full of venison. I used the tenderloin cut. I didn't have steak sauce so I used Worchester. I sliced fresh jalapeno round slices, removed the seeds and filled them with softened cream cheese. Half my family could not take the heat, so next time I will make half with red pepper chunks. Broiled instead of grilled, can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo."
},
"reviewBody": "THIS WAS SOOOO GOOD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tshack1004"
},
"reviewBody": "These are wonderful! Made them for a party and they disappeared in a matter of minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRICIA5610"
},
"reviewBody": "These are wonderful! Made them for a party and they disappeared in a matter of minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Clark Czerwinski"
},
"reviewBody": "Not over the top! If you are the type of cook who likes to WOO those you feed, I wouldn't say this is it, yet it is definitely a recipe you can alter. My husband, whose venison I cooked with, was taken back with the peppers. He likes spice, but not to take away from the taste of the dish. Eliminate the peppers, maybe substitute with onion, mushroom?? something else, or a milder pepper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Yum. I had been meaning to try this for awhile and finally got around to it last night. I used beef (we had just gotten a home-raised one \"taken care of\" and, as usual, my husband and I wanted to try it ASAP), marinated in Wishbone House Italian dressing (absolutely amazing, by the way) and nixed the seasonings in favor of a sprinkle of Mrs. Dash. \n\nPer another reviewer, I put them in the (convection) oven at 400 for 10 minutes, then under the broiler. We will definitely be using this one again. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Gandy Langley Gee"
},
"reviewBody": "Very delicious but I took the advice of another and crisped the bacon in the oven on broil. Will definitly be making this over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelsea"
},
"reviewBody": "GREAT recipe! I didnt have deer meat, so I used Jimmy Dean sausage and it worked wonderfully. Other than that I didnt change anything. So tasty. Making this again real soon... my son requested it again for his upcoming \"back to school\" party. Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynard"
},
"reviewBody": "The only reason I didn't give 5 stars is because I follow the recipe exact. I swiped the hubby's \"saved\" backstrap. Marinated it in Creamy Italian dressing for about 3 hours, removed and cut into chunks, wrapped with bacon and held together with toothpicks. It was fabulous. Did this for a 4th of July party, everybody wanted more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big N Tasty"
},
"reviewBody": "100% loved them...my friends and i couldnt stop eating them till they were gone!! I also cut cup a block of pepperjack cheese and made little cubes to slide down the toothpicks for the last 5 minutes of cooking...that made this dish PHENOMINAL!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Excellent meal! We have this weekly at home - a twist I use is to cut a slice into the meat and put a pepper inside the cut then wrap in bacon. We also soak our's in Dale's overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "APIZZITOLA"
},
"reviewBody": "They were great. We marinated for 2 days and tenderized them. I added fresh mozzerella with the peppers and then wrapped them in the bacon with black pepper. Instead of cooking the deer meat before we wrapped them, and threw them on the grill just long enough to brown the bacon, then placed them in foil packets to keep in the juices. I have to say the meat was a little dry, but very tender. It could use a bit more seasoning. Just a bit bland. Good eats though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Guillory"
},
"reviewBody": "Absolutely delicious!!! Very nice flavor combinations. Everyone thought they were beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyTater"
},
"reviewBody": "Oh my! These are delicious! So glad to have found this recipe! Makes a great dish for parties or a family dinner. Very easy, too. I would think other types of meat would go well with this recipe. Many thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristalyn"
},
"reviewBody": "We loved this recipe. I served them at a party and all the people who hate venison loved them. I did add a small slice of pepperjack cheese between the venison and jalapeno, which I liked. It was also 3 degrees the night of our party, so I cooked them in the oven (400 degrees for about 20 min) and they were very good. I would think they'd be even better grilled, as the recipe suggests. I would recommend this recipe to anyone who has game in their freezer to use up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Essayons75"
},
"reviewBody": "Fantastic! If you don't have venison. try flank steak. Use a good hunk of jalapeno. It will not be too hot. If you use pepper jack cheese, melt over at end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CSG"
},
"reviewBody": "These were EXCELLENT, I used elk round steak and thery were absolutely delicious. Wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon"
},
"reviewBody": "Can't really say anything that hasn't been said. Easy enough, tastes great. Looking like a New Years hors d'oeuvres this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BUGGIE524"
},
"reviewBody": "I made these and they were great! I even had \"a few\" leftover and they were just as good the next day. I did half according to the recipe and then the remaining I added Pepper Jack cheese to and left off the Jalepeno pepper. Everyone loved it and wanted the recipe... even people that do not like wild game. They couldn't tell the difference and said they would make it anyways because they were so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "Yup, have to agree with the other reviews ~ wonderful recipe, I used Moose and it was a huge success!\nWill make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S Craig"
},
"reviewBody": "This is a great app. or main dish, We have been making these for years but we put a slice cream cheese in the middle with the jalepeno before wrappping and throwing on the BBQ. Delicious! Oh and be the way I am not a big fan of Deer meat but I could eat this everyday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bj"
},
"reviewBody": "These were the hit of the superbowl party. Only one problem I did not make enough. Oops! Even my hunter fiancee who does not eat venison ate them every time he went into the kitchen. I did heat some grape jelly to dip in. Was very good. Will be making these often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "texas wild hair"
},
"reviewBody": "I really enjoyed the process of making this dish. While you are preparing the meal you should put in a good CD ( I chose “The Gipsy Kings”) and have a beer or a glass of wine. I have a wife who does not like \"gamey\" tasting deer meat and I promised that I would find a way that she would eat the meat. This was it, without a doubt! The meat was tender and tasty. I modified the recipe a little because I added a slice of onion in the preparation and instead of tooth picks I just put the poppers on a kabob skewer. My wife doesn’t like Bacon much either (too much fat) so instead of wrapping her pieces in Bacon I just laid it on top of her skewer while I grilled them, then removed the bacon before serving. I complimented the poppers with a side dish comprised of heated Caned Corn, Black Beans, red onions and Avocado – as well as a baked potato. Everything was perfect along with a beer for me and a glass of Shiraz for my wife. Hope you enjoy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77625/deer-poppers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
"name": "Vegetable"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1241/appetizers-and-snacks/vegetable/jalapeno-poppers/",
"name": "Jalapeno Popper Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77625/deer-poppers/",
"name": "Deer Poppers"
}
}
]
}
}
, "about": [
]
}
]