				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Diabetic Dog Treats"
,"datePublished": "2019-04-02T02:47:47.000-04:00"
,"dateModified": "2023-01-27T08:58:25.000-05:00"
,"author": [
{"@type": "Person"
,"name": "BARB MAXWELL"
,"url": "https://www.allrecipes.com/cook/492841"
}
]
,"description": "These diabetic dog treats made with beef liver are easy to prep in a food processor. Even dogs without diabetes will enjoy these home-baked treats."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3m9oaG3ExazpENSXUbHBd8R9W-A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4580861-diabetic-dog-treats-warram-4x3-1-c39da95bff8246d1b62156baca191115.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Diabetic Dog Treats"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "134"
}
,"cookTime": "PT15M"
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.5 pounds beef liver, cut into pieces",
"0.5 cup whole wheat flour",
"2 eggs",
"parchment paper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Line a 10x15-inch jellyroll pan with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Place liver into a food processor; pulse until finely chopped. If you have room, add flour and eggs, and process until smooth. Otherwise, transfer to a bowl, and stir in flour and eggs using a wooden spoon. Spread evenly in the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until center is firm, about 15 minutes. Cool in the pan, then cut into squares using a pizza cutter. The treats will have a consistency similar to a sponge. Store in a sealed container in the refrigerator."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very simple to make, as my 10yr old Cocker has just been diagnosed with Diabetes needed advice and help. How many treats would you recommend for 20kg dog."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Houcek"
},
"reviewBody": "Super easy to make! All the dogs love them, even the non-diabetic ones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe but why did someone say that they add honey?!? That has natural sugar and would be terrible for a diabetic dog. Geeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Vodovosoff"
},
"reviewBody": "I made a few changes for my dogs who aren't diabetic but anyway they just loved it! I added one sweet potato, grated, and 1/2 tsp baking powder to make the treats softer. The result was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pcrawford419"
},
"reviewBody": "The dogs absolutely loved it. It is so easy to make and much cheaper than store bought treats that you don't know the contents of."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Awful Cook"
},
"reviewBody": "Woof! Those smelled bad the first time! I've made these many, many times but took the advice of other reviewers. Swapped something ELSE for that liver. So I use 96/4 ground beef, ground or canned chicken, tuna, salmon, baby food chicken, or turkey \"sausages,\" etc. Just like others said: Count your fingers after you offer these to your fur-babies. I started making these for our previous rescue who became very ill w/diabetes and Cushing's. I'm starting early making them again for our two brand-new rescues. (8 &amp; 10 month olds). I'm even using gluten-free/paleo flour. They see those treats &amp; start dancing! Thank you so much for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Godwin"
},
"reviewBody": "This was a hit with 2 of my 3 huskies. My girl Nanook was just diagnosed with diabetes and she loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Chase"
},
"reviewBody": "My dogs LOVE these!! I bake on 325°? for a few minutes longer to avoid the edges drying out before the center is fully cooked using a standard baking sheet. I used rolled oats instead of flour and chicken livers instead of beef liver &amp; it was perfect! Cool, cut into 1”x1” squares and placed in Tupperware (separating layers by waxed paper). Freeze or keep in refrigerator.? AWESOME &amp; EASY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Long"
},
"reviewBody": "She loves her treat, I give to her after her insulin injection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linzcarron"
},
"reviewBody": "My pup and the neighbor dogs love these! I throw everything in the blender, eggshells and all, and bake on a greased cookie sheet. They flip out just fine and are easy to cut up. They may not last long after baked, so my dad cut them up really small and dried them out to use as training treats with his pup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne Hudson-Partlow"
},
"reviewBody": "My dog is a diabetic and I made these with gluten free rice flour. It makes needle time less of a chore as he goes upto the fridge before he has his shot to get one of these. So cheap to make ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debcapi"
},
"reviewBody": "So glad I found this recipe! Not only is it chihuahua approved but vet approved as well. My chihuahua was recently diagnosed with diabetes and he wasn't at all happy about receiving injections twice daily. These treats make it a bit more pleasant for him. Thanks again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Knifty"
},
"reviewBody": "The dogs loved it! The recipe was easy to follow and simple to make. I have 3 older dachshunds and this is easy on their systems while still being apparently very tasty! Thanks for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doc A"
},
"reviewBody": "I made this for my diabetic dog and her brother. They loved this and couldn’t wait to get more. They followed me all over the place afterwards hoping to get more. They usually get a cookie after dinner for their dessert and when they saw me take it out of the refrigerator, they went crazy. I gave this easy recipe to my sister and my daughter for their dogs who are not diabetics but will love this also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lorena"
},
"reviewBody": "My dog loves these! I think they stink, though... easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Burns"
},
"reviewBody": "We recently found out our fur baby is diabetic. She is use to getting a treat at certain times of the day so I wanted something to fit her needs. Although I thought I was going to blow chunks handling the liver, because I absolutely despise liver, it was easy to make and she loves them. I went through one batch and about to make another."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melissa Kousagan"
},
"reviewBody": "These treats are not healthy for diabetic dogs. They have flour in them which can spike their BG."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "macclanmom"
},
"reviewBody": "There will not be any going to waste!! Thank you for an easy, healthy recipe!! Even though as written would certainly stand on its own, I read through the reviews and made the following changes: replaced the wheat flour with Sorghum flour, used the whole egg, including shells-so fun to drop the whole thing in-added 1/2 cup oatmeal, and a shake of garlic powder. Using a pizza cutter is pretty slick, but found a cookie cutter was fun, too! On behalf of my furry loves, we thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqui Galik"
},
"reviewBody": "Easy and any dog I give them to loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dookieduke"
},
"reviewBody": "I use four jars of beef baby food, four eggs and one cup organic brown rice flour to make two batches at a time. Both of my yorkies love these treats, and only one is diabetic. They freeze really well, too. Just make sure they've cooled completely prior to freezing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb W"
},
"reviewBody": "Dogs love them! Very easy to make. I cut these into cubes and put them in a freezer bag in the freezer so that they last longer. The dogs love them frozen as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cait"
},
"reviewBody": "or 10 stars!!!.My elderly dog was diagnosed with diabetes last fall. She is extremely brittle. So we gave up and make all her dog food. As for the worries over the Glycemic I. It's only 1/2 cup and that's not much/serving. Also, why mess with a really good recipe. I have to increase slightly as liver is only available in 1#pkgs. Also ---freeze! as it will spoil. I make the same recipe using canned Salmon to vary treats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zarwina"
},
"reviewBody": "Our extremely finicky newly diagnosed diabetic dog loves these. She will eat them even when she won't eat anything else. Something to keep in mind though, wheat does contain gluten, so it will effect glucose levels. But it's very easy to sub different flours that are more diabetic friendly than wheat, such as barley, or oat, or what ever your particular dog happens to like. Thanks so much for the recipe! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oceanbaram"
},
"reviewBody": "My dogs love love love it!! My baking was never this popular! I will regularly make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary M"
},
"reviewBody": "The first time I made this I made a huge error - I used TWO cups rye flour instead of the 1/2 cup the recipe calls for! I added 2 more eggs, some water and my last jar of beef baby food - and wouldn't you know it , all THREE of my doggies (only one is diabetic) LOVED the end result! When I made the treats again, correctly, only two doggies still loved them. My 'food diva' wasn't interested any longer. (go figure!) This is such a terrific recipe - so EASY and inexpensive to make. I'll be making this for as long as it's needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Warren"
},
"reviewBody": "I added 1/2 cup of oats, substituted with rice wheat and added 2 tbsp of chicken broth, took these from other posts. My dogs love it and so do all my families dogs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrvenka"
},
"reviewBody": "This is a great recipe but I would like to point out that flour has a high Glycemic Index. Even the brown rice flour that one reader suggested has a very high GI and GL. I will be using this recipe for my diabetic furry child but will use oat flower (ground from oatmeal)as it has a low Glycemic Load."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHOADIE"
},
"reviewBody": "Added some share cheddar. Brown Rice flour instead of ww flour. Next Time I'll double recipe. Doesn't make a lot. My baby loves them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "I used ground turkey instead of liver and rice flour instead of wheat flour. They turned out great, and my dog really likes them. I've been making Dog Treats I for several months, but my dog seemed to be getting tired of them. This is a great alternative and so quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustB"
},
"reviewBody": "Our black lab BEAR is a diabetic. (just diagnosed....and we're working on figuring out his diet and insulin amounts) No more store bought treats for him and as soon as we get his glucose regulated, I'm going to be making all of his food. Right now he's on diet WD from the VET. \nMade these treats this morning. Making another batch at this very moment. I used beef baby food, eggs, brown rice flour. He loved them. (but I've never found anything he hasn't liked :)) We have 3 labs and they think ice cubes are amazing. The batch I have in right now, I used chicken baby food, eggs, brown rice flour (a little less than the 1/2cp),approx. 3 tablespoons of old fashioned oats, 1tb. of flaxseed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "I made this with wheat flour but our vet was concerned about the gluten. So I read some reviews and settled on using brown rice flour. All my dogs love them! No more store bought treats for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kac2research"
},
"reviewBody": "The smell was not all that bad to us. Just smelled like cooked liver...but instead of the whole wheat flour which was terribly expensive, our vet said we could use oatmeal and flax seed, which was cheaper, so perhaps this is why the small wasn't as bad (I don't think it would matter, but who knows). The bottom line is our dog, the one with diabetes and the other one both loved them!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LucyL"
},
"reviewBody": "Made these Last night for my dog, and for Xmas pressies for my dogs friends. These were really easy to make. \n\nI couldn't source Whole wheat flour so i used plain flour instead. This worked just as well. Only thing is they do smell horrible! But gave my dog the bowl to clean which she loved then gave her a small bit this morning and she couldn't get enough of it! \n\nWould make these again, as very cheap and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Griffin"
},
"reviewBody": "The recipe was so easy to do and my finicky Lhasa loves it. We have just found out she is diabetic and I am in the learning stage of taking care of her. Treats have always been a special part of her day, and now I can give her something that is so healthy and (and according to her) delicious. The only change I made was use the chicken breast instead of liver."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pindy4176"
},
"reviewBody": "There is misinformation in some of the reviews that I'd like to clear up: gluten is not what raises blood sugar, starch is. Brown rice and the other flours you named are all starches, and all will affect blood sugar. Starch and sugar (naturally occurring or otherwise) both raise blood sugar; fiber, the third type of carbohydrate, does not. Just as for diabetic people, the whole-grain flour in this recipe is beneficial because the fiber in it helps keep blood sugar stable. // Made 9/9 for neighborhood event, using \"manager's special\" (i.e., on sale before it expired) ground lamb. My dogs gladly helped with \"quality assurance testing,\" and they LOVE these. It's amazing that such a simple and easy recipe yields something dogs like so much. Cool!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOCIDEAU"
},
"reviewBody": "My bichon was recently diagnosed with diabetes, and he loves his treats, so I was delighted to find this recipe. I initially tried it substituting baby food for the liver. To my horror, I discovered baby food has sugar in it, so no more baby food. I have made it with lean ground beef and with chicken livers. I almost gagged with the liver thing, but the dogs like it. Think I will try chicken or turkey next. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I use chicken liver and chicken hearts. My dog goes crazy for these and I love that they are healthy for him. I have made these now for over 2 years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LNelson"
},
"reviewBody": "Great recipe! I read through all the reviews, incorporated some of the suggestions and added my own. Here's what I used:\n• 1/2 cup of dessicated liver to one 15 ounce can of pumpkin (obviously, not pumpkin pie mix!)\n• 1 cup of brown rice flour\n• 1/2 cup of flax seeds\n• 4 eggs. \n\nI cooked it using the directions above and they came out perfectly. My dog knows now that the treats accompany the shots - he doesn't really like the shot but he REALLY likes the treats so makes giving the insulin very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "walker"
},
"reviewBody": "WOW!!!! I was just recentlly diagnosed with a severe case of diabeties. The next day my dad found this recipe. He did use the whole grain brown rice flour in the recipe because of the gluten in wheat flour. These things are grrreat. I even let him take my blood now and give me insulin shots because I know some of these yummy treats are comming. I'm feeling better now thanks to him and the best vet in the world(Dr. Hedges @ Brighten Vet in New Brighten, MN). Thank you so much for this wonderful recipe. WALKER P.S. How can I keep him from eating them?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Kinman"
},
"reviewBody": "OMG! I made these treats a few days ago for my toy poodle who was diagnosed with diabetes in June. RC is a very, very picky eater and he is now scratching on the fridge because he knows that is where I put the bag of these treats. Thank you so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystal5508"
},
"reviewBody": "So easy to make and all twelve of my dogs love it. Made from the original recipe. Used a mini muffin non stick pan and they are the perfect size for each treat and just fall out of the pan. Hope this helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Remember people,SORGHUM is not good for your dogs. It's worse than corn and has caused death in dogs who have never eaten it before so please be careful with your substitutes. Onion and garlic are also not on the approved list, with raisins, grapes and apple cores.\n\nHaving a diabetic dog, we give her a weiner with each shot now, am going to make these instead for her. Thanks for thinking of our sugar deprived dogs, they are just as sweet as the regular dogs. :)\n\nAlso, if you change the ingredients then it's not fair to give a low rating. Unless you tried it with the posters recipe first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judi Gawor"
},
"reviewBody": "Our miniature poodle was just diagnosed with diabetes. His glucose was up to 400 and he is now on insulin shots twice a day. I found these wonderful and easy to make treats while looking for diabetic dog treats. I'm on the second batch already. Our dog loves them. I saw in one review that the wheat flour is high in gluten and gluten turns to sugar. This person recommended brown rice flour. I had to go to three stores in my smallish town, but found it in health food store. So far I've used only the jarred baby beef - (2) 2.5 oz. jars, but I'm going to try some jarred baby vegetables (with no sugar) along with the beef when I make the next batch. I used a small size cookie sheet, lined with parchment and the treats come out very flat and I cut them in strips and these crosswise - like a flat Scrabble piece. I keep them refrigerated. So easy to make and they have solved the problem of trying to find Diabetic dog treats! Thanks for sharing this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitchen's Friend"
},
"reviewBody": "I have made this recipe about six times now and my puppy LOVES them, and he does not have diabetes. Like other reviewers suggested, I used two jars of baby food. Since my dog is small, I can freeze half the treats for later.They freeze pretty well. Cut into very small pieces, these treats are great for training.If you do not have parchment paper on hand, I just used wax paper and sprayed it with nonstick cooking spray. Because the cooking time is not long, the wax paper isn't harmful. The treats keep about a week to a week and a half in the refrigerator. Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesli Durham"
},
"reviewBody": "This was very easy to make, and all my dogs loved them, even my picky eater. It is nice to finally find a treat that is good for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisabird"
},
"reviewBody": "Me? I hate liver, and these treats come out a weird, spongy texture. But I can't argue with the results. Diabetic or not, I haven't met a dog that didn't love these. (Note: so many dog treats have such an abundance of flour in them, thank you for one that does not.) Oh, and use the parchment paper. I didn't have it once and it was a nightmare trying to get these out of the pan. I even run the parchment paper up the sides of the jelly roll pan now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nmcadam"
},
"reviewBody": "My dog was just diagnosed with diabetes last week and is now on insulin we looked over all over for treats and couldn't find any so I made these today and she loves them. My other two dogs that are not diabetic loves them too. It was very simple and inexpensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Lewis"
},
"reviewBody": "Recipe was extremely easy and came out well. I didn't even cut up the liver, just slid it from the pkg into the food processor. We did add the eggs whole so the dogs could benefit from the added calcium and also added a little garlic powder. Spread out thick and baked for 20 min. Dogs LOVE them. Put a piece in front of one of our foster puppies who was sleeping and it was amazing; he started biting before he even woke up. Smell was not nearly as bad as I had expected after reading some of the other reviews, and cleanup was a breeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krist117"
},
"reviewBody": "Love it! I use baby food instead of the liver and my dog loves it. Also works perfectly to hide his pills for cushings because I can put the pills into the treat because of the spongy texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JessicaP"
},
"reviewBody": "This was a great recipe to go off of. I didn't do it quiet like this. I used less ingredients. I used beef baby food two 2.5oz jars, 7oz of pure pumpkin, and i used 4oz of water to make up for the eggs. I would love to have used them but dogs prone to pankcretitis i've read its not good for their sensitive tummies, and 1/4 whole wheat flower for my 1st go around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Ann"
},
"reviewBody": "And I got cut off.... I just made them this morning and Misty has had a beef and turkey so far and loved them both! Thanks so much for this recipe! I already know I'll be using it ALOT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAZONE38"
},
"reviewBody": "This recipe is such an awesome one. I did go with Gluten Free Whole Wheat Flour because it has no sugar period in it at all. There is not a dog I have given this to, that will not eat it. I have 6 dogs and they all stand around me in the kitchen when I am baking them, and trust me I am on my 15th batch already. Even my friends have me make them for their dogs, because their dogs will not eat store bought treats. Even the pickiest of doggies will eat these...but watch out for your hand...My vet has even approved them for my dog that is a diabetic...she was totally impressed! So just to let you know these have been \"BUDDY\" aprroved(that is my doggie's name) Healthy for them to all eat and everyone is happy! Tys so much for an awesome recipe. I have not tried it with other meats, but am thinking of using Chicken next...Again LOVE IT! and so do my Doggies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally McCarroll"
},
"reviewBody": "I have made these now for my diabetic chihuahua and my Lab. They love them.I use the rye flour and the baby food. (watch the sugar and sodium content in baby food) So easy and quick. also have made extra for neighbors and friends, family dogs. THEY all love them. Thanks so much for this to be able to give my little guy treats that won't harm him and can still have with his diabetes, in moderation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susieq30"
},
"reviewBody": "Super easy to make and our dog loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mack"
},
"reviewBody": "Thought I would provide a 2012 review. My lab was recently diagnosed with diabetes and I was looking for some treats she could have. She LOVES treats! These are the BEST! She LOVES them. Easy to make. I make multiple batches. 1 recipes lasts me a week for 2 labs. I freeze the others and just pull them out when I need them. Best to make multiple batches since clean up can be a bit messy. Thanks to the original poster. My labs thank you many times each day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HealthRebootCoach"
},
"reviewBody": "You can even make this more diabetic friendly by using Rye flour instead of wheat flour. Rye flour has much less gluten and is much slower in converting into sugar in the body. Rye flour is also more flavorful and dogs love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traveling tilly"
},
"reviewBody": "I have two Shih Tzus. We just found out my little girl has diabetes. Have been very nervous giving her any treats. Made these today and she loves them. So does her brother, who is a fussy eater. \n\nThank you so much for this recipe. While she has always been good with getting her shots, I feel better now that I can give her something she enjoys so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rochelle"
},
"reviewBody": "Great Maxx and Emma loved them. I did not have any chicken hearts on hand so I used a packeage of chicken hot dogs. These were quick and easy to make. I used a bottle top as my cookie cutter and my picky eater started to break dance all over the floor after one taste. Can't wait to try other meats and see what they prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ Pickles"
},
"reviewBody": "I gave 5 stars ting but I was on the website dogtreatkitchen.com and they said liver gives anemia and is toxic. I have a diabetic dog and am looking for a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "traciem"
},
"reviewBody": "Once you try this recipe you won't ever make another. It's easy and no rolling out dough. I used turkey and chicken baby food instead of liver and then once baked I used a shot glass to do cut outs. Ended up with circles and stars and the dogs LOVE them!!! Whoever came up with this one...Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca G"
},
"reviewBody": "Dogs loved them! Used beef baby food and a little smaller pan so they were a little thicker. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Gold"
},
"reviewBody": "thanks, yes 1 of my 2 Chihuahuas have diabetes, and I appreciate you sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy &amp; gobbled down with great enthusiasm, thank you! \n\nThe wheat flour would be a bad idea for dogs prone to allergies, but it's easy enough to substitute. \n\nA note to those using baby food: it may contain onion powder, a no-no for dogs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl H."
},
"reviewBody": "I was blessed about 3 months ago with a oocker spaniel (who had been dumped, and overweight)... She woke up not walking one morning, off to the vet we went. She has pretty bad back problems!!! They had to put her o steroids, and said she needed to lose weight also!!! I found this recipe and decided it couldnt do her any harm!!! *Miley* loved them!!! I used a 6oz jar of chicken w/vegetables!! I just put some parchment paper on a cookie sheet and spread out the mix!!! Will make them a little thicker next time!!! Thank You for a *HEALTHY* recipe I can give my little blessing!!!! Miley thanks you too!!! Off to make another batch for my moms dog!!!! Revised... my moms dog that has no teeth and a very picky eater absolutly loves these treats... My dog and my mothers go absolutly nuts when they hear the bag coming from the fridge!!!! I reccomend this for any dog!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Deslauriers"
},
"reviewBody": "I boiled chicken necks,deboned and ground the meat in processor (2 cups ground chicken) then followed the recipe using the chicken instead of liver. Worked great! my DD loved them! I saved the broth and made homemade milkbone treats too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I love baking!"
},
"reviewBody": "I didn't use the liver, I used my roast drippings from the crock pot (about 1/2 Cup - 1Cup) . I choose this recipe because of the minimal ingredients. I just added corn flour (Maseca mix), until the dough came together. Rolled it out and used a melon baller to cut out little rounds that would fit into the dog treat jar. I baked them till they dried out and turned off the oven and let them sit in it. My dogs love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FryedRicesa"
},
"reviewBody": "These treats are a LIFE SAVER!!! Our dog, Chancey, is VERY sensitive to most foods and we haven't had the extra money to spend on the treats she can have. BUT she doesn't get sick from these treats at all!! I used gluten free baking mix instead of flour and used three small jars of baby food. The baby food was different meat flavors. I prepared them separtly and put food coloring in them so we could tell them aprat. Chaney likes beef the best! She now follows me around when I'm in the kitchen, waiting for a treat! ^_^ Thanks SOOO much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "morgan"
},
"reviewBody": "Easy to make and my dog loves them! I used chicken livers instead of beef liver and also threw the eggshells into the food processor (I was told they are safe and add calcium). I was a little worried because I didn't have parchment paper, but I just sprayed a little cooking spray on my pan and they didn't stick at all! Fantastic recipe, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Uppy"
},
"reviewBody": "Buddy, our 14 year old, diabetic, Dachshund loves them. I used chicken livers instead of beef liver. He's gone blind now, but his nose still works, he was waiting for an earthquake to knock the pan off the the counter while they were cooling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ginaiboo"
},
"reviewBody": "I just made this for my Diabetic pooch, and she LOVED It!\nI did substitute the liver with 2 jars of chicken baby food, and I increased the amount of wheat flour to 1 cup. and added 2 tablespoons of chicken broth to help moisten.\nTHANK YOU BARB for GREAT RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Our diabetic labrador absolutely loved these treats! I'm so glad that I was able to spoil him with a healthy snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "windog1"
},
"reviewBody": "This recipe is GREAT. One of our dogs was just diagnosed with diabeties. We took her home for the weekend after the vet had her for a week and her blood sugar was about 230. We tend to give our dogs a LOT of treats and I was worried that giving her so many of these that her sugar would be sky high. We took her in Monday and her blood sugar was 113 so these truely caused no hard. Also, all three of our dogs LOVE them. I substitue the 2 2.5 oz jars of baby food for the liver also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valleyviewfarmer"
},
"reviewBody": "With 2 female border collies &amp; an \"I will eat anything\" female lab you hit the mark. Our 11 year old border collie was bouncing around acting like she was a puppy again and the very picky baby (4 year old border collie) was surely in dog heaven (I had to watch my fingers). And...the lab...well, she eats anything. Thanks so much for sharing. I personally couldn't handle the liver thing so I used a 2.5 oz. beef baby food (I don't remember that smelling so bad when my kids were small) with about 3 oz. of beef &amp; vege baby food ( 1/2 of a 6oz. jar) to keep the cost down and many other reviewers suggested it. I also added 1/2 cup old fashioned oats and about 1 Tbsp. flax seed (I had it on hand and the oil is good for the dogs), spread it on parchment paper in a 9 x 13 metal pan and cooked for 15 minutes, cut it up with a pizza cutter (as suggested) and couldn't have asked for more. Our 4 legged girls think you're the best---loved, loved, loved it. Thanks again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcbaldwin3"
},
"reviewBody": "I just made these tonight using the eggs, 2 each 2.5 oz jars of beef baby food and whole grain brown rice flour (gluten free) instead of whole wheat and then used a pizza cutter to slice them in to bite size pieces (about the size of a scrabble piece), and my yorkie LOVED them! He was diagnosed as diabetic back in September and it has been a challenge finding him treats that he likes that don't cost a small fortune, and now I can make these for him. I also bought the jars of chicken baby food for a little variety. They are so easy to make and the consistency is perfect---kind of spongy.I also have a non-diabetic sheltie who also loves them. All of the ingredients are very healthy, so I would recommend these for anyone who has a dog."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie K"
},
"reviewBody": "My dogs love these treats! I ran the liver through my Ninja using the double blade. I had enough room to add the flour and egg to it and also added a small amount of garlic and blended it all together. I used a large Wilton sheet cake pan lined with parchment paper. It baked in 15 mins as stated and it turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria C."
},
"reviewBody": "this is very similar to the recipe i have used for years, though i think mine is tastier due to the garlic: i use 1 lb. beef liver, 1 cup corn meal, 1-1/2 cup wheat (or any kind) flour and 1 tsp. garlic powder. also note, i had tiny dogs - chihuahuas and italian greyhound - so i cut into strips, put in baggies, a couple baggies for the fridge and the rest went into the freezer. these freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gberdan"
},
"reviewBody": "Our dogs love these and Daisy needed the motivation to eat at her injection times. I am not a liver lover. I wish I had an outside oven to keep the liver stench out of the house. I am going to try a different protein next batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LORIROBBINS"
},
"reviewBody": "Both dogs and all 3 cats went nuts for these treats! I made the recipie as stated, but tossed in a little parsley and garlic to try and counteract the vile raw liver smell. These do smell REALLY bad while baking, but the dogs sure love them... I use them as \"pill pockets\" to fool our smart dog into taking her twice-daily pill, which she now gobbles right down. I am going to give this recipie to my vet's office so they can hand it out to people who have pets with health issues. Great recipie Barb! My dogs (and cats) thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke L"
},
"reviewBody": "Hi Barb! Thanks so much for this great and easy recipe. I loved it so much I added it to my dog blog."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenny_d"
},
"reviewBody": "I substituted liver with baby food - pumpkin, beef and potato. My dogs loved it! Easy enough to make, will definitely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "foodcanuck"
},
"reviewBody": "I added two small containers of beef baby food to this recipe and a dash of honey and my dog liked these treats, however, I only rated them a 3 because they didn't last very long (make sure you refridgerate them) and they were a bit slimy in texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doglover"
},
"reviewBody": "Great Recipe! However; whole wheat flour has gluten. Gluten can raise blood sugar. I used whole grain brown rice wheat flour. It's gluten free. My dog loves them just the same. Other gluten free flours: * Brown rice flour: whole grain, very nutritional, has more oil * Buckwheat flour: not wheat, whole grain, strong taste, has more oil * Sorghum flour: whole grain, very nutritional, good flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Falgout Hodges"
},
"reviewBody": "My dog LOVES these treats! I did \"par boil\" the liver for about a minute. Makes it much easier to work with. I still did have to gag a couple of times because of the smell, but it was worth it for my little doggie. I cut the treats in much smaller pieces for her as she is a small dog. These would make great treats to train puppies - just cut them into real small treats. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie Clonan"
},
"reviewBody": "My dog was just diagnosed with Diabetes. Food is her middle name-just saying the word outloud sends her into a frenzy. She absolutely LOVES Puperoni.......however, they have sugar; both regular as well as propylene glycol, so they have to go! I was hoping this recipe would solve the problem.......she liked them, but we shall see as time goes by. I followed others suggestion of baby food, using a 1-2.5oz jar of beef and I also used about 1 tsp of liquid smoke -----trying to mimic the smell of those Puperoni's. Like I said, she does like them, but unlike others, did not go crazy for them. Next time however, I will use a much smaller pan to spread the batter in......10x15 is way too large......they come out too thin. A ravioli/pastry cutter works well to cut them while still warm as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mstree"
},
"reviewBody": "Outstanding and easy! I have made dog treats before, but none have received the reaction that these do. Our dog literally begs for them. I threw everything into my food processor, including the eggshells. They stink, so keep in a tightly sealed container in the refrigerator."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margrt"
},
"reviewBody": "My dog thinks this treat is fantastic, I like it because it is easy to make and fast to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Troppens Robbins"
},
"reviewBody": "Oh my lord!!! It is as simple as the recipe looks and the animals loved it!!! Both the dog and cats loved it! they were licking the plate I brought it in to them on!! A must make for Christmas gift for our dog friends!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robynna.z"
},
"reviewBody": "Both my dogs are not diabetic but they absolutely love this treat recipe! My shih-tzu has a very sensitive stomach and he has not had a problem with these treats at all! I have been able to teach them new tricks using these treats and they sit by the oven just waiting for them to come out! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "traci82"
},
"reviewBody": "Very easy to make and the dogs loved them. I don't have a food processor and so i went and found babyfood that was just beef with beef broth that was already processed and mixed it all together with a spoon. Great and Quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "My dog, George M, formally owned by my mother-in-law, had many ailments, the worst being diabetis. I gave him 2 shots a day. He was a good, no great, dog and deserved his treats like any other but there are not many on the market for diabetic dogs. We found this recipe years ago and probably made a good 200 lbs. of liver for them until he passed a couple of years ago. He loved them so much and since they were good for him, we didn't mind giving him quite a few at a time. Why not? Anyway, kudos to whomever figured this recipe out. My dog had many good years partly because of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nupsmommy"
},
"reviewBody": "I was expecting something crunchy and instead they were very soft and spongy. They may be good for older dogs or young puppies but my Dobie is almost two and he likes crunchy treats. I ended up throwing my batch away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARFmom"
},
"reviewBody": "My diabetic dog loved these treats! I used the babyfood instead of liver (processed the liver once and that was enough for me!). I also used muffin tins instead and made pupcakes. We are having a hard time getting her to eat her diabetic food, but with a pupcake added, she does much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chopin4-2"
},
"reviewBody": "All dogs love this treat. I make it about every other month. Dealing with the liver is a little icky but a nice food processor helps. I've made these for my dogs and for friend's and family's dogs. Cats would probably love this too. I know my cat (RIP) would have went bonkers for these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke Elizabeth"
},
"reviewBody": "WOW, my dogs went crazy over these! My dogs do not have a diabetes, but I thought this sounded like a tasty and healthy treat. I used one LARGE container of baby food--one batch with chicken noodle and one with turkey vegetable--1/ cup flour, and 2 eggs. I spread it onto a baking sheet and baked for 12 minutes at 350 degrees. After cooling a few minutes, I used a heart cookie cutter to punch out shapes, then cut the scraps up. I stored everything in a few ziplock baggies in the fridge. The dogs went wild for these treats, they really loved them. I served them to my two dogs and also have them at a doggie DNA party for my dogs and their doggie guests. Six different dogs all tried these, ranging from Chihuahua, Collie, mixed breeds, Lab, and Akita and they ALL loved them. Not one dog turned them down, even the picky Chihuahua. They were VERY popular and I had a few requests for the recipe. I am positive I will be making these again and I highly recommend them. My dogs and I thank you for sharing the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Doutrich"
},
"reviewBody": "i made these for our choc. lab who is diabetic and has pancretious(sp?) (he can't have fat either or he gets sick). he really missed his treats, HE LOVES THESE! as well as our golden-doodle puppy! i have asked the vet about buying store made diabetic treats, which are hard to find anyway but he said that there are no laws that regulate what actually goes in them ;despite what they say on the package; they often are not what they say!?anyway i made these just as recipe states except sprinkling some fresh chopped parsley on top of alittle eggwhite wash. WARNING- DO NOT MAKE THESE RIGHT BEFORE COMPANY IS COMING OVER! IT STINKS BAD!! but the look on your dogs face is worth it!thanks for recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duncandog"
},
"reviewBody": "BLANCH -Blanch the Liver!! Much easier on the eyes and nose when preparing. I used beef liver and chicken liver. I blanched both in hot water for a minute prior to food processor. Much nicer, MUCH!! The beef liver recipe was a bit thicker as the beef cooked more in the blanching process. The Chicken liver batch was more similar to the original both in texture and finished product. I have three Jack Russels and the diabetic one actually takes her shot without shaking when I put these in front of her. All three dogs prefered the beef liver but the chicken liver was a close second. Also made with ground turkey and that is a secondary treat. Just wanted everyone to know BLANCH yukky blood GONE!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin C."
},
"reviewBody": "Mine did not turn out at all - I never said I was a bkaer, but was surprised at the outcome. I did use beef baby food - used 4 - 2.5 oz. jars, maybe that was too much? I had a hard time figuring that just 2 would possibly equate to 1.5 pounds of liver. I used wax paper and they were totally stuck and doughy on the bottom side. I ended up putting them under the broiler (doughy side up) for a few minutes and they seemed to be cooked enough, although very thin. My dog ate them right up anyway! I will try again with less baby food and will use a smaller pan (maybe a square pan with a little cooking spray?) so they are a bit thicker and I will bake longer. Just glad to have something to give my newly diagnosed diabetic dog becasue she was missin gher usual biscuits!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy mccormack"
},
"reviewBody": "LIVER?? good?? you betcha! my dogs have never had liver before because \"I\" don't like liver ~ Imagine my surprise to see my two pups go crazy for this treat! Honestly, my picky eater will do roll-overs for this stuff lol. I added just about a 1/4 cup of shredded mild cheddar cheese and a 1/4 cup of rolled oats. This is not a cookie-crisp like treat...Mine came out soft and pliable....kind of like a firm pancake texture. My older pup has had dental issues and this works Wonderful for him. It's a quick and easy recipe that you'll find you will make again and again for your babies. Thank you SO much for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SWEETLEAFJANE"
},
"reviewBody": "I take care of a lady who has alzhimers and she over fed her dog and he became diabetic.The vet said NO TREATS until we told her about these and now he is able to have a treat twice a day, and well, he LOVES them. I go by the recipe and it couldn't be easier.Thank You so much.If it wasn't for this recipe that poor little dog would still go without a treat. My little friend thanks you too."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/88806/diabetic-dog-treats/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1951/everyday-cooking/more-meal-ideas/pet-food/",
"name": "Pet Food Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/853/everyday-cooking/more-meal-ideas/pet-food/pet-treats/",
"name": "Pet Treat Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/88806/diabetic-dog-treats/",
"name": "Diabetic Dog Treats"
}
}
]
}
}
, "about": [
]
}
]