				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Different Chicken Cordon Bleu"
,"datePublished": "2000-02-24T12:14:51.000-05:00"
,"dateModified": "2022-07-14T16:36:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jennifer"
,"url": "https://www.allrecipes.com/cook/24324230"
}
]
,"description": "This casserole still features ham and Swiss cheese with chicken, but strays from the original with a sauce of cream soup, sour cream and wine. Stuffing mix tops the entire creation."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/2tqwAEIVkOYRvIbUjV6O4taGfB8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6420037-82e6676a6747454a9e089802511ef4cb.jpg",
"height": 2000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Different Chicken Cordon Bleu"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "307"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "430 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "110 mg"
,"fiberContent": "1 g"
,"proteinContent": "39 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1026 mg"
,"sugarContent": "3 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"8 skinless, boneless chicken breast halves",
"8 slices ham",
"8 slices Swiss cheese",
"1 (10.75 ounce) can condensed cream of chicken soup",
"1 cup sour cream",
"0.5 cup white wine",
"1 teaspoon garlic powder",
"1 teaspoon dried parsley",
"1 teaspoon salt",
"1 teaspoon ground black pepper",
"1 (6 ounce) package herb-seasoned dry bread stuffing mix" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place chicken breasts in a lightly greased 9x13 inch baking dish. Lay a ham slice, then a cheese slice on top of each breast."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl combine the soup, sour cream, wine, garlic powder, parsley, salt and pepper. Mix well and pour mixture over chicken/ham/cheese pieces. Top all with the dry stuffing mix to cover."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for about 30 minutes, or until chicken is cooked through and juices run clear."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Peggy's professional"
},
"reviewBody": "Not good. Cheese melted into the soup,sour cream and wine mixture. Which was bitter. Where is the flavor? I am not a fan of cooking with can soup, now I know why. And what is the purpose of the dressing cubes, not good. I will not be making again. I served risotto, homemade cranberry relish and homemade biscuits, thank goodness my sides were good.Don't waste your time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill Brailey"
},
"reviewBody": "This was delicious! The sauce really helps elevate the flavors of the ham and chicken.what would I change? Less salt or no added salt. The soup is very salty as well as the cheese and ham. I’d loosen up the sauce with maybe chicken broth, milk or water. I threw in a can of corn with the sauce which added a little snap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irish Colleen"
},
"reviewBody": "This was really good. My family enjoyed it a lot. I didn't have parsley but follow the recipe otherwise. I did double the sauce as we like sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danae"
},
"reviewBody": "This recipe is an easy, delicious take on cordon bleu. It has become one of my favorite allrecipe chicken dishes. The only change I made was adding a bit of stock and olive oil to the stuffing mixture (I used Pepridge Farm brand) just to soften it up a little. Other than that, I followed the recipe. It is rich, but I like rich dishes. This definitely falls into the comfort food category. Serve with a salad and you’ve got a meal the entire family will love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Heyden"
},
"reviewBody": "This is a family favorite, though we've found since I roll my chicken and secure it with a toothpick it takes a little longer to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crismo"
},
"reviewBody": "With all of the changes I made, I can't rate it more than a 2.5; however, it is a very good starting point for \"pinch of this, dash of that\" cooks. Here are my subs:\nCream of celery instead of Cream of chicken. \nLow sodium chicken stock instead of white wine. \nCubes of ham instead of slices. \nShredded Swiss cheese instead of slices. \nCubed chicken instead of whole (half) breasts - even tried pre-breaded/cooked chicken tenders in one pan but the breading got pretty soggy. \nSeasoned the meat, in the pan that I made with raw chicken, with very little salt, pepper and granulated garlic directly - will NOT add salt the next time. \nAdded about a quarter cup of Dijon mustard. \nOmitted any type of additional breading. \nI ended up making this in two 8x8 pans because I needed to take a meal to an elderly friend. I accidentally put too much sauce in his pan and not enough in mine but the next time, I'll leave about 1/2 cup of the sauce in the bowl because it didn't reduce as much as I thought it should even without the breading. The next time I'll also remove the foil a lot sooner in the cooking process and add some additional Swiss cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "*Angela*"
},
"reviewBody": "This recipe didn't work for us. The stuffing on top turned out like croutons, they didn't soften up at all during cooking. The wine gave it a sour flavor. And it was a little salty. No one in my house liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "melissa"
},
"reviewBody": "The only changes I made was to chopped chicken for faster cooking and cream of mushroom soup ( didn't have cream of chicken). Way too salty for me. Wouldn't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martine"
},
"reviewBody": "Made the recipe pretty much as stated except I only used 4 large breasts and used a coating of simply bread crumbs over it &amp; baked for about 40min........in my oven anyway. Times may vary depending on chicken size &amp; thickness as well as how well each person's oven is temperatured. I found it to be a good, simple recipe, great for weeknight cooking that the husband enjoyed as well. Adding to my work night recipes. Thanks bunches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martina"
},
"reviewBody": "My kids loved it, but it was kind of a heavy dish for me. I will make it again because it was a crowd pleaser but may try it without the stuffing to see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheverend"
},
"reviewBody": "One of our favorites now. Only change I made was to use crushed buttery crackers tossed with melted butter as the topping. Excellent dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatCz"
},
"reviewBody": "Firstly, I almost never follow a recipe exactly, I always read the reviews &amp; add or subtract depending on what the reviews say. I made quite a few changes to this recipe so don't feel correct giving it 5 stars even though my whole family loved it. \nFirst, I cut up all the chicken &amp; ham into smaller pieces so this was more of a casserole. Then I put garlic &amp; pepper directly on the chicken. I used mozzarella cheese as that was what I had on hand. I added Herbs De Providence &amp; dijon mustard to the soup mixture as some people said it was bland. \nWe added some frozen veggies and prepared the stuffing with water, butter &amp; onions before spreading it on top.\nI then cooked it 30 min covered &amp; 20 uncovered.\nIt was delicious. My husband and son ate it like it was going out of style! We will definitely make it again and again (with the changes). Thank you for such a great base &amp; thanks to the reviews to help make it excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jens_cookingmadness"
},
"reviewBody": "Very good recipe. I followed Valerie Brunmeiers suggestion to prepare the stuffing as directed on the package and then put it on top off the casserole, cover it with aluminum foil and bake for an additional 20 minutes. I also feel like this recipe is very rich even though I used light sour cream. I recommend to go easy on the serving. A little goes a long way. Also, this recipe is great on rice and with some steamed veggies like cauliflower or asparagus and some bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronna"
},
"reviewBody": "Very easy if you want Cordon Bleu and less work. I find the salt in the sauce can be reduced a bit. I season the breasts. I also add a wee bit of dijon into the sauce. I served with boiled potatoes (sauce is lovely on them) and a side salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Bryce"
},
"reviewBody": "It's was amazing. I added extra chicken broth to the sauce and covered it halfway through so the stuffing didn't get too crispy and dry. The whole family loved it-even the pickiest one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Delicious! I didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Cordingly Stout"
},
"reviewBody": "I'm sure if I'd made this as stated in the recipe, I would have loved it! As it is, I used what I had available (live in the woods) and it was awesome. I did fix the dressing according to the directions before putting it on the top as someone said the dressing was dry. It turned out fantastic. Keep them coming Jennifer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samael Pleasanton"
},
"reviewBody": "So much easier than classic chicken cordon bleu! Everyone loved it, but it was a little salty for my taste. Cooking time may need to be increased as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Made just as written, everyone loved it!, It definitely needs a FULL HOUR of cook time. Pair with a veggy, and you have a very tasty well rounded meal! No leftovers here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallory Yildirimer"
},
"reviewBody": "Delicious! I used from thyme instead of dried parsley. I served on a bed of egg noodles. My fiancé and I couldn't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MONICA DEREGT"
},
"reviewBody": "This was even more excellent than I knew it would be!! The whole family loved it. I didn't have swiss cheese, so I used monterey jack, and I sliced each breast in half lengthwise and then rolled a piece of ham around each piece, laid them in the 9x13, then followed the recipe as is. I used chicken broth instead of wine only because we didn't have wine. I crushed my stuffing mix in the bag before sprinkling it on, then I drizzed 1/4 cup of melted butter over it all before baking. It took about an hour to bake it, and I let it sit about 20 minutes before we ate to let it \"settle\" a bit. SO YUMMY!! All 3 of my normal picky-eaters asked for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessiethebestie"
},
"reviewBody": "I'm not a fan of stuffing, but had some boxes to use up. My children and I all loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "alk02g"
},
"reviewBody": "skipped the parsley and salt, used chipped ham instead of sliced, and cream sherry instead of white wine. listening to others' advice, I covered with foil for 30 minutes, then uncovered for another 15. It wasn't bad, but the sherry was too strong for this dish. I'd give it another try but change that to white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phoebe"
},
"reviewBody": "Really tweeked this one!!! Tons of shredded cheddar to use up so that is what I used for cheese. Added fresh minced garlic to the soup/wine/sour cream/parsley/pepper mixture and no salt needed as the soup is salty enough. Overpoured the stuffing mixture on top (bulk from Costco) so sprinkled with a few tsps. of water and dotted with butter. Very good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cray"
},
"reviewBody": "Very good recipe...just skipped the salt because of personal preference. I found the chicken was still raw after 30 minutes and had to add about another 20 minutes of cooking time. Other than those changes, it was a hit with the family and an easier way to make this classic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanna Dyals"
},
"reviewBody": "Delicious! I read the reviews first and decided to use healthy choice cream of chicken and reduced fat sour cream. I omitted the salt as well. I didn't have herb stuffing, so I just used the chicken stuffing I had. Amazing! I will definitely be adding this into our regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busybuddie1"
},
"reviewBody": "I tried this recipe to see how it would taste, but I used leftover turkey instead of chicken. My husband &amp; I liked it. So, after thanksgiving, I made another one for my mom &amp; dad. They thought it was really good. Thank you for the recipe it is a big hit in my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmelita"
},
"reviewBody": "Great recipe...the only thing I changed was chicken thighs instead of chicken breast. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Betsey Norland"
},
"reviewBody": "We were quite disappointed in this. Chicken Cordon Bleu is my husband's favorite. I was so pleased to find this easier recipe, and particularly intrigued by the suggestions of how to lower the calorie content. Unfortunately the flavors were overpowered by the sauce. Where's the cheese, he wanted to know. If I ever try it again, I will take others' suggestion and roll the chicken, ham and cheese together before putting it in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRGRAINGER"
},
"reviewBody": "Pretty good and easy to make for the weeknight. Hubby really liked it too. Only change I made was to toss the stuffing mix with some melted butter, then used that as the topping - extra yummy that way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessdunn27"
},
"reviewBody": "I added a splash of heavy cream and a pinch of thyme to the sauce. I also rolled mine up with ham and cheese like a traditional cordon bleu and then put cheese on top, as well. It was FANTASTIC. I had to adjust baking instructions to 60 minutes at 400 degrees. And I used muenster cheese rather than swiss (personal preference). This will be staying in my box of recipes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara 'Henning' Meyer"
},
"reviewBody": "My family loved this, and it was sooooooooo easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dchrist1"
},
"reviewBody": "This was a very tasty recipe. Even my boyfriend liked it and he's not a big cheese fan (little does the family know it was swiss which they all claim they dislike) I didn't have enough sour cream so used about 1/2 cup of light sour cream and 1/2 cup of milk. I covered it with alluminum foil and cooked it for about an hour. This helped keep the moisture in so the bread crumbs were not as dry as others spoke about in their reviews. Also, when it was done I was worried because it seemed runny. Just let it cool a little and the sauce starts to thicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "germanwife"
},
"reviewBody": "This was good and my hubby loved it. The only thing I would say is that it was a bit too salty, so next time I will decrease salt by half or leave it out completely, and I would mush the stuffing mix into the soup mix a bit. But very tasty and smells heavenly while baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "julietdavis"
},
"reviewBody": "After reading the reviews, I was excited to make this dish for Father's Day. The family thought it was good, but not as tasty as many other chicken meals we make. If we're going to involve this much fat in a recipe, the flavor needs to be worth the cholesterol. :). They need to come together more fully and be more distinct and savory. I think I will try an authentic cordon blue recipe next time, but this was fun to try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Nope, this one did not go over well with my family. Sauce just wasn't right, and there was too much of it. won't be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hillers"
},
"reviewBody": "Very good. I didn't have the wine, so used heavy cream and a little bit of chicken broth instead. Everyone loved it even my picky 2 year old - which says a great deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motulip"
},
"reviewBody": "Great mix of flavors. I omitted the wine and it still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Diva Contessa"
},
"reviewBody": "easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Missy Green"
},
"reviewBody": "We didn't like this, way too much focus on the soup, couldn't taste the other ingredients at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darcy Hafler"
},
"reviewBody": "Excellent recipe with only two minor changes. First I also spread dijon mustard on the chicken before adding the ham &amp; cheese. Second, instead of stuffing mix, I heat panko breads crumbs in butter in a small saute pan and season with dijon mustard, fresh parsley, shredded swiss cheese and garlic powder. Do not add mixture right away. After 20 minutes of cooking the chicken, I then add the crumb mixture on top and continue to bake until finished. This is a staple in my house and make this meal a couple of times a month. I always make extras as it is great on a kaiser roll as a sandwich the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June Sonsalla"
},
"reviewBody": "LOVED it! I agree with many of the other reviews - opt for the low sodium soup and then salt to taste. We used regular soup and it was definitely too salty on our first attempt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FunwithFood"
},
"reviewBody": "Okay, but very salty tasting. Followed exactly only forgot white wine. This may have helped cut the salty taste. Thought it tasted better reheated next day. did mix some melt unsalted butter in with the stuffing as well as a bit of water. It would have been to hard and dry had I not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "This was a popular dish in my house, and so much easier to make than traditional cordon bleu. I cut the recipe in half and used chicken broth instead of the wine. Other than that, I followed the recipe. My kids especially enjoyed the stuffing topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KClark8503"
},
"reviewBody": "Recipe was great and very easy to make. The only problem I had, was that it took much longer than 30 minutes for my chicken to be fully cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "woodbinemom"
},
"reviewBody": "Flavorful but the stuffing never absorbed the sauce so it turned out dry and crunchy. I would recommend making the stuffing ahead of time and adding it to the dish 10 minutes before the dish is ready to come out of the oven. Also, you will need much more than 30 minutes to cook, 50-60 minutes more likely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "This is definitely 4.5 stars and super easy! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "This has become a staple in my house. I prep it the night before, and my 12 yo pops it into the oven before I get home from work. Add a salad and dinner is so easy and yummy. Some changes, add brocolii and mushrooms in the dish with the chicken, add onion powder to the sauce, omit the salt, and instead of stuffing I mix bread crumbs with italian seasoning and parm. I always make extra and serve it over egg noodles for lunch the next day. Because there is only 2 of us I use 3 chicken breasts cut into thirds, otherwise my son eats 2 full breasts and nothing else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missy"
},
"reviewBody": "made this last night and everyone thought it turned out well. didn't add stuffing on top but used bread crumbs and a few ritz instead. also increased the cooking time to a little over an hour. i think the ham adds alot to this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kbtaylor68"
},
"reviewBody": "Great recipe! I changed it up a bit based on others reviews. Used fontina cheese, tavern ham, light sour cream &amp; healthy request cream of chicken soup, along with all the other ingredients. I also added some cayenne, boyfriend noticed some heat and liked it even more! He said he definitely wants me to make it again! Thank you for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittanne"
},
"reviewBody": "Delicious! And easy!! Made exactly as directed, except had to cook an extra half hour. Halfway through cooking I also added a tinfoil cover to avoid burning the stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celestie"
},
"reviewBody": "This was incredible!\nI made it tonight, however, made an error. I prepared the stuffing mix before reading the instructions! Ps. it came out great dispite my error. Saves on the added caloric count that would otherwise be there from egging, breading and frying. Thank you so much for this amazing recipe which was so easy to prepare!\nPs. I did add cayenne pepper to the sauce which kicked it up a notch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smart"
},
"reviewBody": "This was ABSOLUTELY delicious! Both my husband and I loved it!(though I had to make plain chicken breasts for the kids). I only made a couple changes but it would probably still be delicious just as is. My changes based on other reviewers: I added a couple Tbs. Of Dijon mustard to the sauce. Also I prepared the stuffing before putting on top. And I had to cook it for an hour instead of a half hour. Don't worry, the chicken doesn't dry out at all. And the whole dish really takes on the flavor of the ham. Great recipe! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "this was so good! i did use fontina instead of swiss because i figured as long as i was mixing it up i might as well play a little and i adore the melting aspect of fontina. also instead of a stuffing mix, i made my own croutons with a variety of fresh herbs (i grow them) i was heavy on the dill which i love and it was splendid with the mix of white wine and sour cream. thanks so much.. i probably wouldn't have had it occur to me to alter my standard cordon bleu if you hadn't posted this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mishnyc"
},
"reviewBody": "absolutely delicious! my entire family LOVED this dish from my 21 month old to my father. The only change i made was i rolled them, pinched them closed woth a toothpick, and dipped them in egg and then panko for a crust on the outside because I didnt have stuffing. Thank you for this recipe, the addition of sour cream was so yummy and made the sauce rich. so different from other recipes!!! will be making again soon, especially since it was requested for next week while still eatting it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shanana111"
},
"reviewBody": "Very good variation on a recipe I've used for years. Great for leftovers too. Next time I make this I will adjust it because it was very salty...and I love salt! I think I might just use Panko bread crumbs instead of the stuffing mix and serve over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex M"
},
"reviewBody": "I really like this recipe. Quick preparation. Tastes delicious. I used the sauce for pasta (penne)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Duncan"
},
"reviewBody": "This is so awesome!! I did add a can of cream of mushroom soup and some sliced baby bella mushrooms, but all in all, an EXCELLENT recipe. I will be fixing this again very soon!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy"
},
"reviewBody": "This is one of my favorite recipes from allrecipes.com. I highly recommend this dish. I use white cooking whine, 1/2 teaspoon of salt, pepper and garlic powder and low fat sour cream. You need to try this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Moore"
},
"reviewBody": "I changed this a little after reading the reviews but the sauce and the stuffing mix in this recipe really are good-- I soaked the stuffing in white wine before putting it over the casserole and i added herbs de providence on top of the cheese before rolling the chicken up and placing it in the baking dish but my family really loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jinzy"
},
"reviewBody": "i think the garlic can be deleted. my family was not crazy about this one.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iamblessedx7"
},
"reviewBody": "This was excellent! I actually made mine in a skillet with chicken tenders.1st I cooked the chicken in the butter.Then I de-glazed the pan with a 1/2 cp. of white wine. I wrapped each tender with a slice of ham and topped it with a 1/2 slice of swiss cheese. I poured the soup mixture over the chicken . I crushed 1 1/2 cps. of some stuffing mix and added some garlic powder, pepper, and parsley and a little salt. I mixed about 3 tbls. of melted butter into the bread crumbs and sprinkled it over the chicken and soup mix. I baked it for about 20 mins at 350. I served it with steamed broccoli. I will definitely have to double this recipe the next time I make it. I only got one chicken tender and a little broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rpingree001"
},
"reviewBody": "This is a delicious recipe! The sauce is just yummy. I had half of the bread cubes to the sauce mixture rather than putting all on top so they are softer - otherwise, all the bread cubes are too crunchy for me. Have made it twice and my husband loves it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Vachiratevanurak"
},
"reviewBody": "Made this last night because I had all the ingredients on hand. ABSOLUTELY AWESOME! Both 1-year-old and 3-year-old cleaned their plates! This was so easy, it will definitely be a staple in our house. Here are my changes: I didn't have white wine, so I used milk. I also did not have garlic powder (gasp!) so I used 1 tsp. garlic salt and did not add in the tsp. of salt stated in recipe. Thank you for sharing this awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janiss14"
},
"reviewBody": "awesome. good prep ahead meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeni Wolfe"
},
"reviewBody": "Even my pickiest eater really enjoyed this! Only change was chicken broth instead of the wine. GREAT recipe... thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chertee1"
},
"reviewBody": "Very easy and tasty. I used all low sodium ingredients (soup &amp; stuffing mix) the second time I made this and liked it way better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "McCrearyacres"
},
"reviewBody": "This was okay, but a bit too rich for me. The stuffing mix on top was too dry--should have used much less than the recipe called for. Even though I thoroughtly mixed the soup/sour cream etc. together, when I served it up there was clumpy coagulated hunks of goo in the corners--not appetizing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "suzess"
},
"reviewBody": "This was ok, but not a favorite. I did not have any sour cream on hand so I used cream cheese instead. I pounded out 1/2 the chicken to cover the bottom of the pan and pounded out the remainder to cover the ham and cheese. Covered all with the sauce and stuffing mix and baked it. I have to be honest, part of this rating is due to the fact that I'm tired of recipes with campbells soup in them. I'm finding that they are all starting to taste the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLIECOOK"
},
"reviewBody": "Really yummy. I made some substitutions b/c I didn't have all the ingredients on hand. Instead of wine I used chicken broth, I didn't have sour cream so I omitted that. I didn't add salt to the sauce because I thought the ham and the soup added enough salt. Also, I pounded the chicken and rolled the ham &amp; cheese up in traditional ckn cordon bleu style and dotted each piece with a dab of butter and then topped with the sauce. I didn't use bread crumbs b/c my son doesn't like them. Even with the omissions this was still wonderful. I'll definitely make again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HHTNDD"
},
"reviewBody": "Made this for super bowl party for 100 people. Used a half of breast for each portion sliced and put the ham and cheese inside. But followed the recipe exactly. This was the hit of all the food that was served that day!! I truely thank you for this. It was easy and just perfect! 10 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lucky Mom"
},
"reviewBody": "Way to rich!! And I didn't even add the ham or cheese. The flavour was nice but it wasn't even good enough to keep the leftovers. I would not reccomend it or try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lucky Mom"
},
"reviewBody": "Way to rich!! And I didn't even add the ham or cheese. The flavour was nice but it wasn't even good enough to keep the leftovers. I would not reccomend it or try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faircook03"
},
"reviewBody": "Loved it! Thought it was so easy and soooo yummy! The only problem we had was we ended up with thicker chicken breasts and they we still basically raw in the middle after 30 minutes. Nothing that can't be fixed by pounding the chicken or adding more baking time next time. Was GREAT for my company!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "utnati24"
},
"reviewBody": "I would definitely pound out the chicken so that it can all cook evenly, but it was so good. I also used chicken broth instead of white wine just because I didn't have any and it worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bluestar"
},
"reviewBody": "This recipe was really good. I didn't have any cream of chicken soup, so I used cream of mushroom soup instead, and also used bread crumbs instead of stuffing, and baked the chicken at 425 degrees, since the chicken wasn't cooking fast enough. This recipe is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Callie"
},
"reviewBody": "When this dish was done, I didn't taste either the ham or cheese. The outer stuffing was crispy, but the underside was gooey. The sauce tasted fine. I think that the problem was that the sauce overwhelmed the dish. Maybe there was too much. Next time I will make a casserole of cubed ham and chicken in sauce, with cheese melted on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Hope"
},
"reviewBody": "Bland. Removing from my recipe box. Just wasn't a hit compared to other things I've tried. I have no suggestions to improve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vintage Fare"
},
"reviewBody": "EXCELLENT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "This was really good. I did make a couple of changes though. Sent my husband to the store to get Swiss cheese and he came back with Provolone but it turned out well. I also subbed seasoned Panko bread crumbs for the stuffing. It did somewhat remind me of the coating you would get with the regular Cordon Bleu that you would roll up and fry. I would definately use the Provolone cheese and the Panko crumbs again. Sauce was really good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany H."
},
"reviewBody": "This recipe is amazing! I halved the recipe and made this last night. My husband and I LOVED it! I used only three chicken breasts (instead of four), but still used a whole package of chicken flavor stuffing. I baked them (rolled the chicken breasts) in a covered casserole dish for one hour. Everything came out perfectly! Oh, I also used turkey instead of ham. My husband told me to make sure I keep this recipe because he wants to make it for his family's Sunday supper sometime.. so that means it's REALLY good. This recipe will be kept close and made over and over in our home :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love to cook"
},
"reviewBody": "Tasted better the second day...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "N2WINIT"
},
"reviewBody": "This was ok as written. My husband and I didn't like the addition of stuffing. Will try it again without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ParkerLM6"
},
"reviewBody": "My family enjoyed this recipe. I didn't care for it as much as they did it seems, but I will probably still make it again as it was very simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Mumaugh"
},
"reviewBody": "YUM. Skipped the stuffing mix because I didn't have any, and paired it with egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wannabe chefette"
},
"reviewBody": "The only change I made was to not add the stuffing mix as I didn't have any. I read reviews were others used bread crumbs but I really didn't think I would care for that. And, this also took about 1 hour to bake. The cheese completely melted off so after I took it out of the oven I added another slice of swiss. The sauce was very tasty. The first night we had mashed potatoes and the second night I made rice. The sauce was wonderful on both. The chicken was also good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICHMEIG"
},
"reviewBody": "This is similar to a crock pot chicken cordon bleu receipe that I have made in the past. This turned out good, although I did make a few changes. I placed a piece of virginia ham and a slice of american cheese on each boneless/skinless chicken breast. I used cream of muchroom, rather than cream of chicken soup and I used italian bread crumbs, because I did not have any dry stuffing mix. It would have been better with rthe stuffing mix, but I was using what I had on hand. Either way it was very moist and had a great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackieluvsalex"
},
"reviewBody": "it was delicous!!! my husband and daughter loved it!!! easy alternative to the regular!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This was really good! My only suggestion would be to cut down on the salt - it was wayyy too salty. Overall a great dish though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This was really good, everyone LOVED it. I was short on time so I cut the chicken into small pieces. Then I mixed everything together and covered it with the stuffing mix and baked it in a large baking pan. The result was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "xoch83"
},
"reviewBody": "This was an extremely easy dish to make. Most of the stuff I already had in the kitchen. Only suggestion I would recommend is preparing the stuffing mix according to package or adding bits of butter to the top. It seems like the dry stuffing mix browned alot quicker and almost burned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KMolstad"
},
"reviewBody": "So fast,so easy, so yummy. I now make double the sauce because I like it so much!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanne linn"
},
"reviewBody": "I made this tonight and was a major two thumbs up. I did bake it longer and covered it for the first 35 min, but other than that followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bookwormans"
},
"reviewBody": "This was really good and an easy way to make Chicken Cordon Bleu. The only change I made was to use white grape juice in place of the wine. Simple and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NKTAUBE"
},
"reviewBody": "This was pretty good. I thought the sauce was a good addition b/c sometimes traditional Chicken Cordon Bleu turns out dry. Certainly I enjoyed not having to roll them all. I gave it 4 stars b/c it didn't have quite the wow factor I expected and I'm not sure I'll keep the recipe since I only keep ones I really, really like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I found this when I plugged in what I had on hand and was just pleased. We all love Cordon Bleu around here. I found some packaged, precooked chicken breast at Grocery Outlet a couple months back and stuck it in the freezer, for just in case. I used that here, with turkey ham I had leftover from another recipe. Instead of using whole breast and a ham piece layered on top, I spread the pieces on the bottom of my casserole dish, first the cooked chicken and then the cubed ham. Then I added the swiss, which I shredded, and then the soup layer. A little different than how the recipe dictates but the ingredients are all there! I did omit the salt, as cream-of soups do tend to be salty on their own. I'll update on how the family liked it after dinner. I will say that this came together quickly during the kids' Quiet Time. I threw the casserole together, covered it and put it in the fridge. UPDATE: My husband liked this, my kids did not. I tried a little taste and agreed with my husband that it was a little too salty. If I were to make this again, I'd make my own topping out of homemade croutons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "retrofloridagirl"
},
"reviewBody": "Really great!My husband loved it! I am making it again tonight. Definitely leave out the salt. You don't need it. I used Jennie-O turkey ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hurleygirly2002"
},
"reviewBody": "The only change I made was adding bread crumbs instead of stuffing as I didnt have any on hand... This is a family fave now! Thank you for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CHRISTINEHILL"
},
"reviewBody": "I made this recipe exactly as written and it wasn't my taste. It's a great base to start off with, but only after a few changes. It had a VERY strong flavor, I think it was the combo of wine, swiss cheese and dry seasoned (I used Stove Top)stuffing. I made it again with less wine, less salt &amp; garlic powder and no stuffing on top, instead serving with mashed potatoes on the side. Thanks for the recipe, I like the idea, I'll play with it until it's more to our taste."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17120/different-chicken-cordon-bleu/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
"name": "French"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17120/different-chicken-cordon-bleu/",
"name": "Different Chicken Cordon Bleu"
}
}
]
}
}
, "about": [
]
}
]