				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Disappearing Marshmallow Brownies"
,"datePublished": "1999-06-05T20:46:26.000-04:00"
,"dateModified": "2023-01-06T09:45:54.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Maryl"
}
]
,"description": "Try this marshmallow brownie recipe for decadent blondies made with chocolate chips, butterscotch chips, and mini marshmallows. They won&#39;t last long!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5AVSu7TeZjJmEfBNp5xOz07F3Cg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1120103-eca6d7f3c9b541b0831cef959e6a13f9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Disappearing Marshmallow Brownies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "337"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "180 kcal"
,"carbohydrateContent": "25 g"
,"cholesterolContent": "26 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "136 mg"
,"sugarContent": "17 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup butterscotch chips",
"0.5 cup unsalted butter",
"0.66666668653488 cup packed brown sugar",
"2 large eggs",
"1 teaspoon vanilla extract",
"1.5 cups all-purpose flour",
"2 teaspoons baking powder",
"0.5 teaspoon salt",
"2 cups miniature marshmallows",
"1 cup semisweet chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan."
} ,{
"@type": "HowToStep"
,"text": "Combine butterscotch chips and butter in a microwave-safe bowl; microwave on high for 1 1/2 minutes. Stir, then continue to cook in 15-second intervals, stirring after each interval, until melted and smooth, 1 to 3 more minutes. Set aside to cool slightly."
} ,{
"@type": "HowToStep"
,"text": "Stir brown sugar, eggs, and vanilla together in a large bowl. Mix in melted butterscotch chips, then mix in flour, baking powder, and salt until smooth. Stir in marshmallows and chocolate chips. Spread batter evenly into the prepared baking pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 15 to 20 minutes. Cool completely, then cut into 24 squares."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ell Worth"
},
"reviewBody": "I made these today and they turned out great. They were very sweet and tasty. I followed the recipe exactly, except I didn't quite have an entire cup of butterscotch chips, so I also added some white chips. In my electric oven, it took about 20 minutes to bake. I understand why these are called \"disappearing\" marshmallow brownies: because the marshmallows disappear into the brownies, and because the brownies themselves also quickly disappear!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kushman"
},
"reviewBody": "I was looking for a recipe to use up stale mini marshmallows. It was more of a marshmallow treat than a brownie, but that’s what I was going for and it was deliciously sweet. All I had were dark chocolate morsels, which balanced out the sweetness of butterscotch and marshmallows. I would probably add another 1/2 cup of chocolate, because I love chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very disappointed. There was too much filling and not enough cookie. Additives should enhance a cookie not take it over. They were way too sweet and didn't hold their shape. Too messy to eat. Maybe with ice cream they would be okay. I double checked to make sure I followed the recipe and I did. Will definitely not make these again. They \"disappeared\" into the trash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lyndave"
},
"reviewBody": "These are fabulous!! My friends loved them &amp; I have shared the recipe. I warmed one in the micro for about 6 sec. then added a scoop of vanilla ice cream. WOW!!! What a treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "marcia sherman"
},
"reviewBody": "I made this recipe as directed, and we did not like them. Despite them looking browned and pulling away from the sides of the pan, they tasted underbaked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhon"
},
"reviewBody": "I wasn’t sure how these would turn out because melting the butter and butterscotch chips was a little weird but once it all came together they are really good!! I did add a cup of walnuts because my husband likes them in his brownies. Will definitely make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cgm"
},
"reviewBody": "My eight year old made these today with very little help. They are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dessertFreak"
},
"reviewBody": "I have a SWEET tooth…. These are squishy &amp; sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farid jalilian"
},
"reviewBody": "It was great. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motherbear"
},
"reviewBody": "whoever said you can't eat just one was absolutely right! These are delicious! Made as written except cooked for 20 minutes. Cooled for 10 then refrigerated until set as someone suggested. I greased the dish and then added a parchment to the bottom, greased that and had no problems getting it out. I made 1/2 a recipe, and glad I did otherwise I would have eaten a whole 9x13 pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Burgess Bessey"
},
"reviewBody": "This guy gets a standing \"O\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs Chamb"
},
"reviewBody": "These are a favourite in my house, first made for our son by request for his 18th birthday, instead of cake. I've made them for various parties, events, and holidays ever since. These are ALWAYS requested, especially by children and young adults -- it's so sweet!\n\nYou need to add at least 5 min. to the bake time, watching carefully. If you bake too long, the marshmallows disintegrate entirely. I also use 1.5 times the marshmallows and 1.5 times the chocolate chips. \n\nLastly, don't worry too much if your melted butter and chocolate chips look a bit grainy or the oil separates. This is from melting on too high heat. Once everything is incorporated, the finished product will still turn out nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jane brand"
},
"reviewBody": "I made these years ago and finally found the recipe and it’s just as good as it was years ago!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clemson Gal"
},
"reviewBody": "I was out of butterscotch chips and I’m not a fan of chocolate, (I know, I know...how?!?) so I substituted white chocolate chips - it was sooooo delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Madi Cowlan"
},
"reviewBody": "fantastic!!! super easy recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bmore delicious"
},
"reviewBody": "I ate the whole pan by myself in 2 days. I’m making more now. These things are so rediculously delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Wolfmeyer"
},
"reviewBody": "These are SO rich but they are SO good!!! I’m not a big butterscotch fan but before I knew it, I had eaten an entire row. I forgot to set a timer but they baked somewhere between 18 and 23 minutes. I took them out when the marshmallows were making a bubbly crust on the edges. Those edges were my favorite, as well as my 8 year old daughter’s favorite, which is strange because she always wants inside pieces. I melted my butterscotch chips and butter (real butter, not margarine) in a double boiler and it took forever and looked incredibly unappetizing, until suddenly it came together. I made this recipe again today for a bake sale and used fresh butterscotch chips and melted the butter entirely first before adding the chips, and it went faster and melted more smoothly. I added an extra cup of chocolate chips the first time and just an extra half cup the second time. I like to add chips until it looks right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lanya"
},
"reviewBody": "This is so good, I had to stop myself from eating the whole thing...and told my family to pace themselves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna Barnett"
},
"reviewBody": "I make these pretty often and the entire pan is usually gone in less than 24 hours. I brought these to church once for a potluck and everyone was commenting about them, and I mean everyone. I had at least 4 people ask me for the recipe and one person asked if they could take the leftovers home (I made several batches). To say they were a big hit would be a huge understatement. Everyone LOVED these"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrea b"
},
"reviewBody": "Delicious and easy. I used vegan margarine and reduced amount by 2Tbsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dvmorano"
},
"reviewBody": "These are a huge hit. Delicious and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Didn't have butterscotch chips on hand, so use peanut butter chips. It turned out quite delicious! Will definitely be making this recipe again - so simple and quick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mare"
},
"reviewBody": "I bake every Friday for work and found chips and marshmallows in my pantry...I used to make these when I was younger and they look, smell and taste just how I remember! Big hit at work!! I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "This is an excellent brownie recipe. You've got to watch those chips in the microwave though. It's really easy to get them too hot and then they'll never mix into a \"smooth\" texture which will ruin the brownies in a hurry. I like these best with dark chocolate chips instead of semi sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "This is an excellent brownie recipe. You've got to watch those chips in the microwave though. It's really easy to get them too hot and then they'll never mix into a \"smooth\" texture which will ruin the brownies in a hurry. I like these best with dark chocolate chips instead of semi sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Greta Efferson"
},
"reviewBody": "I tried to bake these in mini cupcake tins and they were a total mess. My husband wouldn't let me toss them though. Next time I'll stick to the pan as instructed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DewKist Farm"
},
"reviewBody": "OMG. So perfect. I followed the recipe. Wouldn't want to change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "booboo"
},
"reviewBody": "Made it in the other pan that Bryanna uses for brownies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Reardon"
},
"reviewBody": "This is my favorite bar to make lately, I've made it many many times. The cook time listed, 15 to 20 minutes, is not enough in a glass pan. It's more like 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicolehh"
},
"reviewBody": "I made it once using the butterscotch chips, and it was a hit at a gathering, but my family doesn't like butterscotch, so I tried it again with white chocolate chips in place of the butterscotch, and we liked it a lot more. The marshmallows really have a great effect on the taste/texture, and they are super easy to make! I did cook them for about 25 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Mini Baker"
},
"reviewBody": "These are so amazing! I left out the butterscotch but they were still great. Everyone loved them! They fall apart when they're fresh out of the oven so be careful...and patient."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mbwick63"
},
"reviewBody": "Easy to make and so gooey and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lilorchid82"
},
"reviewBody": "I was tempted to leave out the butterscotch chip like some reviewers, but they are pretty important to this recipe, so I instead decreased the brown sugar to 1/3c. You'll get a good workout mixing the chocolate and marshmallow into the batter. I accidentally used the wrong size pan, but that didn't turn out to bad except for that the edge pieces ended up less chewy. All in all, it's a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zagalt"
},
"reviewBody": "Awesome recipe! I did not have chocolate chips on hand but leftover peanut butter cups from Halloween. Turned out great. Next time I tried with butterfingers cups. Still good, but not as tasty. First timers, when you add mixture to pan before baking it looks wrong. Don't stop. Even though it looks lumpy and strange it turns out beautifully. I have happily passed this recipe along to 4 people requesting it. This brownie will make an appearance at my Thanksgiving dessert table this year. Thank you for an easy and wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Paige"
},
"reviewBody": "The feature I love the most with Allrecipes, is the ingredient search...it freaking rocks! I put in butterscotch chips &amp; marshmallows and happened upon this recipe. They are so delicious! I had to make a few modifications as I only had regular size and jumbo size marshmallows (20 regular = 2 cups mini). I also used unsalted butter, dark brown sugar and mini chocolate chips; as it wasn't specified within the recipe and baked them for the full 20 minutes. They turned out so well, I made them twice in one week! Next time I may lessen the amount of sugar and leave out a 1/2 cup marshmallows to later sprinkle on top after removing them from the oven. Thank you Maryl for this great recipe, can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ThaPhantom"
},
"reviewBody": "Amazing. I Kept everything the same,except i used butterscotch chips instead of the semi-sweet chocolate chips. Very,very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Barcume Oskey"
},
"reviewBody": "WOW! These are awesome! Made them exactly as written. A very well butter-greased glass pan and cooling overnight (lightly covered) makes them not stick at all to the pan. I made them for a party last night but keep trying \"samples\" because they are so good. I hope there are enough for my guests now! ha! These have just become my favorite brownie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill Burke Bank"
},
"reviewBody": "Taste great but the time of cooking is off. On my third batch, hope they will work better this time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMTOAUSTIN"
},
"reviewBody": "Loved them! I baked mine for 18 minutes and would recommend baking them for longer (and I like my brownies a little under done). Marshmallows sort of melted into the brownies, but still provided a little gooey-ness to the top. Am going to try replacing the butterscotch chips with peanut butter chips next time--and there will be a next time!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lady Baker"
},
"reviewBody": "I just made these exactly as the recipe is written and they are WONDERFUL! This recipe is definitely a keeper for our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "Yum, yum, yum!!! These are faaaabuuulous!! It's hard to eat only one... :) :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista Vitale"
},
"reviewBody": "This recipe is quick and easy and very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cocktailqueen"
},
"reviewBody": "I have to agree with a lot of the negative reviews on this one. It didn't set for me and was an overly sweet mess. It was especially disappointing because I thought this was the recipe I used last time (guess not) and was meant for a friend of mine. Needless to say it was a waste of ingredients because it was so un-presentable I had to make another one with a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bella"
},
"reviewBody": "I just baked these yummy bites and they were delish! I followed the advice of baking it in a glass container and generously greased it for easy serving. I added 2 cups of milk chocolate chips instead of semi sweet as others suggested and baked it for 27 minutes to make sure it was cooked all the way through. I will definitely bring these treats again for family and friends to enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLJ6"
},
"reviewBody": "Delicious!!! Followed exactely. Made 2 pans of this is 2 days...one for a party and the other for friends. Loved how the marshmallows melt BUT still leave the appearance that they are still there right under the crack-ly top. Really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "These were good. Next time I want to try adding whole (non-melted) butterscotch chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GizmoDuck"
},
"reviewBody": "These are OK."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "These are delicious! I loved them and so did everyone else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomZilla (Evin)"
},
"reviewBody": "INSANE! These are amazing. Soft and chewy and buttery and awesome. I lined my pan with foil, and then sprayed the foil really well because they're very sticky. Once they were cool, I pulled the foil out and used a pizza cutter to slice them, way easier. Make small pieces, they are VERY rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shakeel Syed"
},
"reviewBody": "Only if I could find some Butterschotch chips without Hydrogenated Oil, I used white chocolate chips instead with remarkable results. These brownies do disappear quite fast..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candace Gallagher"
},
"reviewBody": "Very good, but VERY sweet (which you'd expect given the ingredients) - a bit too sweet for my taste. If you like things gooey-sweet, this is your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jubeesh"
},
"reviewBody": "At first I was a little leery of the combination of butterscotch, marshmallow and chocolate but but these were super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eshe"
},
"reviewBody": "Gosh these brownies are heavenly! The only thing I have qualms with is the amount of sugary ingredients. I added less of what was called for for the marshmallows and chocolate chips and it is still really sweet, but good nonetheless!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daymon"
},
"reviewBody": "Gooey &amp; delicious. Used 1/3 cup butter + 2 TBSP applesauce instead of 1/2 cup butter for fewer calories. Next time, try 1/4 cup butter + 1/4 applesauce. Cooked for 24 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "Just plain amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taxman1985"
},
"reviewBody": "Took these to work and they disappeared in two days. My co-workers had nothing but good comments about them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "IUMGRAD2"
},
"reviewBody": "I couldn't get this to set up-but it tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "They disappeared and were enjoyed by my son's Football team!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Indy92"
},
"reviewBody": "To be honest, it may have been my cooking but i followed this recipe exactly and it turned out sort of flavorless and more cake like then chewy, I feel like if I increased the vanilla or possibly the brown sugar i would be more impressed, also I would prefer it more moist and chewy does anybody know how I could get that texture. id would appreciate the input."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Beth"
},
"reviewBody": "LOVE! Followed the recipe exactly but added 3 minutes to the cook time for a total of 23 minutes. Gooey and delicious..everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janine"
},
"reviewBody": "These brownies were so so good. The best I have had in a very long time! I followed the recipe exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anechcka"
},
"reviewBody": "After baking these successfully last night, I have a few suggestions for everyone making these in order for them to turn out perfectly, as mine did:\n-follow the recipe exactly\n-use a glass 9x13\" pan and grease it with cooking spray, thoroughly\n-bake for 20-21 mins, 15 mins is NOT enough!\n-bake them at night before bed and let them cool in the glass pan, partially covered, until morning. Then cut and serve!\nThis is what I did for this recipe and it turned out great, chewy, sweet, and delicious. The trick is the glass pan, cooking spray, longer cooking time, and overnight cooling. Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yadikeith"
},
"reviewBody": "These were AMAZING! At first I wasn't sure while I was mixing it all together but the final result was delicious! The kids have raved about it since I've made it and it's almost gone already. I didn't make any changes to the recipe, definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAMaye"
},
"reviewBody": "Holy cow, these are gooooood! My husband LOVED them. I made them for church and left him a few samples. After taking one bite, he wanted his own pan... Hahaha!! One thing though, I've made these twice and I cannot get the butterscotch chips and butter to blend once melted. It becomes a separated, gooey mess. I guess this is normal? because it still turns out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BakingBabe"
},
"reviewBody": "These were ok. I didn't have miniature marshmallows, so I took big ones and cut them up into 8 pieces each. They didn't melt even though the top and edges were all golden brown. I usually like marshmallows, but not when I'm expecting a blondie. The blondie to marshmallow ratio was off for me. They look nice, and you certainly get your sugar fix here, but just not satisfying for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barncat"
},
"reviewBody": "Sticky. Sweet. Delicious. Put in too many marshmallows kind of by mistake, but they were fine. I put them in front of my family, and they...well.... disappeared. Half the pan gone in one sitting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "C_WHITES_"
},
"reviewBody": "Don't get me wrong, these taste great, but they don't keep there bar shape. Really must be eaten with a fork, not just grab and go. I may cook these longer next time, went with the minimum time as to not over cook them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara Alvarez"
},
"reviewBody": "Mine turned out fluffy and crumbly, not a good brownie texture at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paola"
},
"reviewBody": "This was super easy to make. They do look really pretty. I baked them for 15m but at 13m I really should have taken them out. Definately a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Arionlne"
},
"reviewBody": "I loved these brownies. I couldn't stop eating them! I gave them 4 stars because I think they need less sugar. There are so many sugary ingredients I decided to use less than the brown sugar called for, and will use even less next time. I did not measure, but did not fill the measuring cup fully. I would go down to a 1/2 cup definitely, and perhaps even a 1/3. I would also suggest that once you are incorporating the flour mixture into the egg mixture you add the chocolate chips and marshmallows when the flour is half way mixed. If you wait the mixture becomes candy thick it is so hard to stir! You have to spread this batter out in the pan, but you will be surprised how awesome it comes out of the oven. I cooked for 20 minutes and thought this was perfect.\n\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joseyrose55"
},
"reviewBody": "Definitely very delicious, but not even close to being done at 20 minutes. I baked an extra 5 or so and I think it could have used a little more then that. They are really sweet with the melted butterscotch chips but so so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danelle"
},
"reviewBody": "Would have given 3 stars but I used a mixture of peanut butter/chocolate chips instead of the butterscotch beacause that is what I had on hand- I wanted to be fair. They were just average. Maybe the butterscotch makes all the difference but with all the delicious brownie/bar recipes out there I will not make these again. Too bad- I love anyting with marshmallow but these really weren't very marshmallow-y anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittney Richmond Green"
},
"reviewBody": "Oh my goodness, these are SO good! Love them! Didn't change a thing, perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kenzie"
},
"reviewBody": "These were incredibly sweet, almost overly so. I could only take it in small doses, but such wonderful doses they were. :) Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "goodwin94"
},
"reviewBody": "Loved these..the marshmallows really tied it all together.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlimarn"
},
"reviewBody": "This is excellent! Not too rich. I made these for a New Year's Party and they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "N1KK1"
},
"reviewBody": "I wasn't happy with the end result of these brownies. Although they tasted good. They really didn't raise and were more like a cookie bar than a brownie. I made the recipe on two different occasions and got the same result following the recipe exactly as shown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bhoneycutt"
},
"reviewBody": "We made this and it may eventually would have turned out but the cook time must be WAY off. We took it out and it looked done and was even pulling apart from the sides of the pan and even after cooling it came out like raw cookie dough with a weird crust at the top. Only part I could eat was the very edges which is why I gave it two stars. If the whole thing turned out like the edges than it would have been a decent brownie in terms of taste. Should be called \"Disappointing Marshmallow Brownies\" because the smell had me pretty excited..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DairyQueen"
},
"reviewBody": "My husband loved these! He hoarded them and would not share them with anyone. I did have to bake them for 25 minutes. But other than that they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StacyJan"
},
"reviewBody": "These are the best brownies I've ever tasted in my life, hands down. My husband and kids said the same but I was in utter amazement at how delicious they are. Next time I'll bake for 25 minutes instead of 20, but they were still absolutely DELICIOUS. I am not usually a big fan of brownies, but I will be making these again and again. Easily 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Wilson Martin"
},
"reviewBody": "These are really sweet. Too sweet. This is because of the addition of the melted butterscotch chips. I prefer the disappearing marshmallow brownies without butterscotch chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "EISH1"
},
"reviewBody": "This rating is only based on my personal opinion, everyone else that ate these loved them. For me, they werent cooking properly , crispy on the outside but not enough on the inside and were very hard to get out of the pan even after cooling for a few hours. They are very sweet, I would try making again but with only butterscotch chips or choco or peanut butter. A plus about them, is that they taste really good even after being left out for a day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennifer macias"
},
"reviewBody": "Flavor considered these were very good. I used the new vanilla flavored marshmellows and made them in a very well greased muffin tin. To address the problem with them being gooy and stickig to the pan, a tip- Line whatever you are using w/ foil and then grease the foil. Also- let them cool a bit out of the oven then put them in the freezer for and hour or so. This firms the marsmallows that melted allowing you to cut them without it sticking to the knife. I will make again for sure- just with a few tricks to remove them more easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "alaska"
},
"reviewBody": "I was not impressed. I followed the recipe exactly. The texture is good, but the flavor is so subtle. Maybe if you spread chocolate icing on top or perhaps added some cocoa and extra sugar to the mix? I will not be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "genise"
},
"reviewBody": "The taste of these brownies were average - good. The amount of guess work it took to decide if they were baked enough was extremely frustrating. Finally got the bronwies cooked enough, cooled them off...and cutting them was a disaster. I ended up throwing most of them out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Discoe Mencke"
},
"reviewBody": "Sooooo good! We absolutely loved this recipe and will be making it again and again. Chewy, perfect golden brownies!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamiboriquena"
},
"reviewBody": "These are very good and I would remake them. I just was unsure if they were completely cooked. I left them in the oven longer than the recipe called for and the bottoms stayed doughy while the tops were completely done. I reserve five star ratings for recipes that are ones that I eat and eat and eat until I can't anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Gandee"
},
"reviewBody": "These set up kinda weird, not really like brownies. Great with a scoop of ice cream. The butterscotch/butter mixture made for a wonderful gooey inside while the marshmallows added a slight crunchiness which was very nice. I will definitely make these again. Thanks for a different dessert recipe!!! UPDATE: these brownies are DIVINE the second day!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "isisangeles"
},
"reviewBody": "Yummy recipe! I made these for my little sisters birthday today. These blond brownies are perfectly ooey &amp; gooey. I was scared that they were gonna be hard, but they stayed gooey &amp; soft. I baked the brownies by mistake at 325 degrees for about 25-30 minutes &amp; they came out soo good. the Marshmallows on the top didn't disappear all the way which made the brownies chewy &amp; sweet. Love the recipe &amp; my sister did too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KNChandler"
},
"reviewBody": "Taste great...look terrible. But the taste makes up for the lake in the looks department! I'm really curious to try these with peanut butter chips instead of butterscotch..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Wow...really great brownies! For me, the butterscotch chips and butter in the microwave didn't melt as smoothly as I thought they would. I was sure I had done something wrong, but nope, these are absolutely delicious following the recipe exactly as written. Next time, though, I will follow the suggestion of another reviewer and throw in a bit of quick cooking oats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "hjk458"
},
"reviewBody": "the taste was great but they were VERY hard. I was a little disappointed they were flat and more like a candy bar than brownies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Blue"
},
"reviewBody": "These were very popular at our last party. A little too sweet for my taste, but there weren't any leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookiemama"
},
"reviewBody": "These were super easy to make &amp; the batter tastes delicious! I baked mine 21 minutes &amp; they were perfect! I made everything as directed exactly on the recipe! These are amazingly addictive &amp; DELICIOUS!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Marsh"
},
"reviewBody": "Amazing! Leave out some of the butter and it's still really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "footballgrl16"
},
"reviewBody": "As far as blonde brownies go, these were pretty good. I was saddened that the marshmallows disappear when baking, thinking there would be chunks, and didn't really think they added anything to the recipe. I did like the butterscotch chip flavor in the batter itself, I'd be tempted to add another 1/2 c to see what that does. Grease your pan very thoroughly, as mine still stuck a little and I coated it. They cooked for about 22 minutes, and where no where near done at 15. My husband and I both preferred these cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busybakerb"
},
"reviewBody": "Delicious! They went fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "garfodie81"
},
"reviewBody": "Very good. I had to get my butterscotch blazing hot to completely melt, so unfortunately my chocolate chips melted when I stirred them in later. So I couldn't really taste the butterscotch, but oh well, they were nice and chewy and yummy! Had to bake for 25 minutes, at 20 the middle was still jiggly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "Everyone in the house loves these! Def don't use the perfect brownie pan like me. The marshmallows made the brownies stick to the cutting insert and took forever to get them off."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11574/disappearing-marshmallow-brownies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
"name": "Brownie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2754/desserts/cookies/brownies/blondies/",
"name": "Blondie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11574/disappearing-marshmallow-brownies/",
"name": "Disappearing Marshmallow Brownies"
}
}
]
}
}
, "about": [
]
}
]