				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Doberge Cake"
,"datePublished": "2020-06-18T23:53:12.000-04:00"
,"dateModified": "2020-06-18T23:53:12.000-04:00"
,"author": [
{"@type": "Person"
,"name": "metread"
,"url": "https://www.allrecipes.com/cook/metread"
}
]
,"description": "Six layers of homemade cake are filled with chocolate custard, frosted with chocolate buttercream, and glazed with chocolate ganache in this New Orleanian classic."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/H5oh7TaM5uI2v75ZCSnrTUoZMxs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/966000-183175335d7340969a4d53c71e9907cf.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Doberge Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "32"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "917 kcal"
,"carbohydrateContent": "125 g"
,"cholesterolContent": "185 mg"
,"fiberContent": "4 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "27 g"
,"sodiumContent": "434 mg"
,"sugarContent": "90 g"
,"fatContent": "45 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"4 eggs, separated",
"3.5 cups sifted cake flour",
"1 tablespoon baking powder",
"0.75 cup butter, room temperature",
"2 cups white sugar",
"0.5 teaspoon salt",
"1 cup milk, room temperature",
"1 teaspoon lemon juice",
"1 teaspoon vanilla extract",
"2 cups white sugar, divided",
"0.5 teaspoon salt",
"0.25 cup all-purpose flour",
"0.25 cup cornstarch",
"0.25 cup unsweetened cocoa powder",
"2 (1 ounce) squares bittersweet chocolate, chopped",
"4 large eggs, beaten",
"4 cups whole milk",
"1 tablespoon butter, room temperature",
"1 tablespoon vanilla extract",
"1 cup butter, softened",
"3 cups confectioners' sugar, sifted",
"1 cup unsweetened cocoa powder, sifted",
"1 teaspoon vanilla extract",
"1 tablespoon hot water",
"2 cups semisweet chocolate chips",
"2 cups heavy whipping cream",
"2 teaspoons vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C). Grease 3 9-inch cake pans."
} ,{
"@type": "HowToStep"
,"text": "Beat whites of 4 eggs in a glass or metal bowl until foamy. Continue to beat until stiff peaks form. Lift your beater or whisk straight up: the tip of the peak formed by the egg whites should curl over slightly. Set aside. Reserve egg yolks in a small bowl. Sift together cake flour and baking powder in a separate bowl."
} ,{
"@type": "HowToStep"
,"text": "Beat 3/4 cup butter, 2 cups sugar, and 1/2 teaspoon salt with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add reserved egg yolks one at a time, allowing each yolk to blend into the butter mixture before adding the next. Pour in cake flour mixture alternately with 1 cup milk, mixing until just incorporated. Stir lemon juice and 1 teaspoon vanilla extract into batter."
} ,{
"@type": "HowToStep"
,"text": "Whisk beaten egg whites a few times; use a whisk or rubber spatula to fold 1/3 of the egg white mixture into the batter to lighten it. Fold in remaining egg whites, mixing just until combined. Pour batter into prepared pans and spread evenly over bottom."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven until cake is light golden brown and just pulling from the sides of the pan, 15 to 20 minutes. Do not overbake. Cool in pans for 5 minutes, then invert onto cooling racks to cool completely."
} ,{
"@type": "HowToStep"
,"text": "To make custard: combine 1 1/2 cups sugar, 1/2 teaspoon salt, 1/4 cup flour, cornstarch, and 1/4 cup cocoa powder in a saucepan and mix well. In a separate bowl, whisk remaining 1/2 cup sugar into 4 beaten eggs. Pour 4 cups whole milk into saucepan and cook over medium heat, stirring constantly, until mixture begins to boil. Remove from heat and gradually pour hot milk mixture into egg mixture, whisking constantly. Add chopped chocolate and stir until chocolate melts."
} ,{
"@type": "HowToStep"
,"text": "Return custard to saucepan and cook, stirring constantly, over medium heat until mixture has thickened, about 5 minutes. Remove from heat; stir in 1 tablespoon butter and 1 tablespoon vanilla extract. Transfer custard to a bowl and allow to cool."
} ,{
"@type": "HowToStep"
,"text": "To make buttercream: place 1 cup softened butter in a mixing bowl. Gradually beat in 3 cups sifted confectioners&#39; sugar. Beat in 1 cup sifted cocoa powder. Mix in 1 teaspoon vanilla extract to make a smooth frosting. If the frosting is too stiff, add a tablespoon of hot water or as needed, drizzling it very slowly, and mix well until desired consistency is reached."
} ,{
"@type": "HowToStep"
,"text": "To make ganache: place chocolate chips in a large mixing bowl. Heat heavy cream in a saucepan until very hot but not boiling. Remove from heat and pour over the chocolate chips. Let stand for 3 minutes, then whisk, scraping sides and bottom of the bowl, until smooth. Stir in 2 teaspoons vanilla extract. Allow to cool to room temperature, cover, and set aside. Ganache should be spreadable and not firm."
} ,{
"@type": "HowToStep"
,"text": "To assemble cake: using a long serrated knife and a gentle sawing motion, slice each cake layer in half horizontally. Cover cake plate with strips of parchment paper or foil for easier clean up. Put a dab of buttercream in the center of the plate to keep cake from shifting. Set a cake half on the plate."
} ,{
"@type": "HowToStep"
,"text": "Spread custard filling onto cake layer, taking care not to spread it too close to the edge (weight of the cake layers will cause it to spread out). Gently lay another cake round on top of the first and repeat with another custard layer. Repeat with remaining layers and custard, topping custard with the last cake layer. Chill cake for 30 minutes to allow it to firm up."
} ,{
"@type": "HowToStep"
,"text": "Frost top and sides of cake with chocolate buttercream. Chill for 30 minutes, to firm and set."
} ,{
"@type": "HowToStep"
,"text": "Spread frosted cake with ganache. Remove parchment strips or aluminum foil from cake plate. Store cake in the refrigerator."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT205M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyn"
},
"reviewBody": "Holy Camoly! What a magnificent cake! I served it to my book club after reading about it in The Book of Lost Friends. A man who was smitten with a young lady had brought it to her as a sign of his affection. Making this cake is truly an act of love as it does require a tremendous amount of effort. The cake was delicious and does look very festive but I probably would not make it again. After reviewing other peoples comments, I did reduce the amount of cream in the ganache. Also, my butter cream was a little dry so I added cream to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "callensmom"
},
"reviewBody": "I’m a baker, not a professional baker but I love to bake. Yes this cake was a little time consuming but I have definitely spent more time decorating other cakes. It was very delicious. I had to modify the buttercream, mine came out way to thick and you can absolutely cut the custard portion in half. I could have made a whole other cake with it and my husband ate some. I did use cake strips to prevent doming which made it easier to cut and be careful of baking it to long. I always use the tooth puck method and that was almost to long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eponymous74"
},
"reviewBody": "Made this for the hubs birthday. It took time, but all layer cakes do. I was not happy with the ganache. It was a little runny. Hubs loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValCooks"
},
"reviewBody": "I made this cake for people from New Orleans and they loved it! They agreed that it was very much like Miss Eloises at Gambino’s Bakery. Great recipe, although I have to agree with some of the other reviews because the pudding was too much for the filling layers of the cake and the ganache was also too much. It didn't go to waste though. I used what I needed and we just ate the rest (ganache was delicious over ice cream!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda B"
},
"reviewBody": "MEH. I make lots of cakes and this one was pretty, time consuming, but not spectacular in taste. \n1. Amounts in this recipe are off. I read reviews and was generous in spreading the custard and still had WAY too much. You need to make less or waste ingredients. This is the same with the Ganache. I made 1/2 the called for ganache and still had too much. The cake itself could have used more batter IMO to make each layer a tough thicker.\n2. The custard was salty. Skip the salt in the custard if you use salted butter.\n3. Cake portion was dry, and tasteless. MEH in my opinion. Even sitting in the fridge soaking overnight it was still a boring cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tumor Man"
},
"reviewBody": "We are from New Orleans and recently moved to Texas. Doberge cake was a staple at most birthday parties or a large family gathering. The only place we would purchase this cake was at Gambino’s in Metairie. Point is, everyone who has had a slice so far comments how delicious it is and if I made a quick trip back to NOLA and purchased one. \nCouple things I may change next time....(1)I do not feel that the actual cake you make from scratch is necessary. To me, the “cake” part tastes just like out-of-the-box yellow cake. May be easier just to bake that instead of scratch. (2) I will be much less generous with the buttercream icing on the top. Between the custard and ganache, you really do not need to put lots of icing unless you have a real sweet tooth for chocolate. Great recipe though!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kayotrist Davis"
},
"reviewBody": "This cake does take time. I started it one day and finished the next. I baked my layers and froze them to make them easier to slice. Made my custard. The next day I assembled and made butter creme and .ganache. The butter creme is very stiff. One reviewer said she used extra custard to fix it. I wish I had remembered that. I used dark chocolate, it was very rich. I like the recipe and the cake, the butter creme cost it a star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I this cake is great! Took it to my office and it was gone by the end of the day. Make sure you have a long time to make it. I ended up making it over two days, but it was definitely worth it. It looked and tasted fantastic! Great for a party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brandon"
},
"reviewBody": "I had this cake in New Orleans and always wanted to make my own. I decided to use this recipe. The cake taste great! Here are my thoughts: make the custard then the ganache first. Both of these needs to cool down to room temperature. If you make them last you'll be stuck waiting around for them to cool. Once constructed I cut a piece and initially The cake consistency and texture turned me off. It was very spongy and dense. But after chilling overnight and absorbing some moisture from the custard the cake is now perfect! i had a lot of custard and ganache left over that I had to throw away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Lisa Molina"
},
"reviewBody": "I made this cake for a work get together. It was fantastic! Just watch the baking time. My oven must run hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iloveit"
},
"reviewBody": "WOW This is quite something. Can’t wait for the taste testing.\nHave never had this before. It is an event to make so be ready.\nCheck all ing. and remember room temp. Plan for the day\nfor the stages and the cooling.. not a problem if you are organized. Certainly taller than I expected, a little worried about the cutting. I had custard left also. Watch the cake baking ,check with a knife for doneness. One of mine was very\nclose , but still managed. Ganache not nearly as thick as pictures. I used a bit , but not as pretty without the smooth\nchocolate..taste testing went very well. So good, very chocolatey , cuts well but cut very small pieces. This will go a long way. Takes time, but I would make again. Maybe just skip the ganache."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cook for 5"
},
"reviewBody": "It took a lot of time, my husband had to help me half way through. It was super yummy and my kids loved it, but I probably wouldn't make it again unless I needed something to do. Since we are a family of 5 We couldn't eat that much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lem"
},
"reviewBody": "I loved the icing , instead of the milk, I added Irish cream instead....it was fabulous...the pudding is good...I only used half of the recipe....the cake, I think I over baked it...it was a bit dry....I baked the batter on 2 cookie sheets and divided each cake into thirds making 6 layers.....I think the cake needs to be more dry to hold the pudding...I also used pudding and buttercream icing for each layer....delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jin"
},
"reviewBody": "I won't make it again it was too much effort but i can't wait to try it i just made it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gretchen McArthur"
},
"reviewBody": "I didn't care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Titan"
},
"reviewBody": "We were invited to a cookout by our new neighbors and I wanted to make a really special dessert to take. I decided on this one. I read in the comments that it was a lot of work so I knew that going in. It was a very time consuming process so leave yourself a few hours or make it the day before. It was so delicious and worth all the work it took to make it. At the cookout each person had at least 2 pieces because it was so good. The ganache, buttercream and custard were amazing! My buttercream did end up being a little too stiff so I used some of the excess custard to thin it out a bit and it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keilon Joseph Forest"
},
"reviewBody": "Aside from working and going to school (both full-time) for two years, and taking the LSAT, this may very well be the hardest thing I've ever done! It took FIVE HOURS to make this cake! I had to make three things from scratch I've never made before (custard filling, buttercream icing, and ganache) in addition to making and assembling the actual cake. Intense.\n\nThat said...the cake is amazing. As with all other recipes of New Orleanian cuisine that originate elsewhere...it doesn't taste quite like doberge cake...but the flavor is amazing none-the-less. The custard was the hardest part to make. Also...the amount of butter this recipe called for would make Paula Deen blush.\n\nLessons for next time:\n\n1. Use a fondant instead of a ganache for both aesthetics (doberge is usually smooth in appearance and as you can see ganache just isn't viscous enough as you're pouring and spreading it in liquid form to accomplish that) and for more authentic flavor.\n\n2. Make more batter so the layers come out better. As you can see the layers are uneven... some much thinner than others...because there wasn't enough batter to fill all the pans to adequate levels.\n\n3. Find a way to make the cake retain moisture. You have to keep it refrigerated...and chill it several times in the assembly process. It makes the cake less moist. Not terribly so...but enough to notice and annoy me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christie220"
},
"reviewBody": "As several other reviewers said, this is definitely a labor of love! I lost a layer in the process, so my cake ended up with 5 layers instead of 6. The recipe was explained well and easy to follow all of the steps. I used 1.5 cups of heavy cream with 12 oz. of the chocolate chips for the ganache as another review recommended and it turned out great. I've never made such a mess in the kitchen, and there was a point where I thought I had ruined the cake, but thank goodness it turned out really tasty. It wasn't the prettiest cake in the world, but it tasted good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diane"
},
"reviewBody": "Delicious cake! A bit labor intensive but not complicated. Custard was yummy but recipe yielded about 1/3 more than I needed to generously fill the cake. Ganache ratio's off-- had to add about 1 extra cup melted chocolate chips to make it workable. 1.5 cups heavy cream to 12 ounce bag of chips is better. Buttercream needed a bit more vanilla and some cream to loosen it up. Since the cake recipe yielded 3 pounds of batter, I used a food scale to measure out 8 ounces each for 6 pans. This was easier for me than splitting cake layers. A showstopper of a cake! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nekare"
},
"reviewBody": "It was wonderful. I made changes to order of creation. I made my ganache first, followed by the custard. Both of these needed to cool down to room temperature before going on the cake. Then I prepped my cake and popped it in the oven. While the recipe says after 5 minutes cooling in pans to invert onto a cooling sheet, I found that tore up the bottom of my first cake. So with my next two cake pans I waited closer to 20 minutes before pulling out of the cake pan. They came out beautifully. While the cakes were cooking, I prepped the butter cream frosting. Once that was finished, I assembled the cake. I not only cut the cakes in half. I carefully cut off the rounded tops of two cakes in order to make my end result more aesthetically pleasing. DO NOT be afraid to use plenty of custard. I didn't use enough and way too much left over. When I applied the butter cream frosting, I had a hard time getting it smooth. I sprinkled a SMALL amount of hot water on the top and very carefully started to smooth out my frosting. It was excellent and amazing. Small slices go a long, long way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ZAbrahm"
},
"reviewBody": "This cake was great. My great-grandmother was friends with the inventor, Beulah Ledner, and she would've enjoyed this version. Yum. But prepare to spend a LOT of time on this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "anna"
},
"reviewBody": "As someone else said, it is a labor of love. I thought there was too much cream in the ganache. Also, I ended up with extra custard, so that part should be cut down. The finished cake was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bakinglove"
},
"reviewBody": "Definitely took several hrs prep but the result was worth it! There's a lot of sifting that took a while with my squeeze sifter. \nWhite cake layers were super light but yet held together well and didn't crumble when slicing in half and frosting. Would use just the cake layer for other dessert ideas.\nExpected the chocolate pudding to taste more chocolately based on other reviews. However, it seemed a bit bland and not very intense - I may have made an error there. I typically use all Green/Black's dark cocoa powder but this time used a mix of 1/2 Dutch process and 1/2 Green/Black's. \nThe in-depth directions were helpful but do note for the cake batter step to beat butter sugar together, you should beat the butter to creamy first and then gradually beat in the sugar. I forgot to do that standard method and had to throw out the first attempt at beating the butter/sugar because it wouldn't break down into creamy.\nWould make again for a special occasion and try the rasberry add on from other reviewer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Juliana Cloud"
},
"reviewBody": "I grew up eating bakery made doberge cakes and never, ever thought to attempt to make one myself, but wanted a chocolate raspberry variation for my daughter's birthday last September, which local bakeries didn't have. I couldn't believe it when I found doberge on allrecipes!! So, made it myself using this recipe, and added a homemade raspberry sauce between the layers with the custard filling. Phenomenal! Well, I plan on making it a third time and remembered to review it and give a warning...don't use this ganache recipe. It did not work for me either time I made it...equal amounts chocolate and cream is way too runny...that's why I only gave it 4 stars. I found a recipe that uses 1 part cream to 2 parts chocolate. Also, give all your attention to the custard when making it...careful not to burn it or you will have to throw it out and start again(been there, done that). All and all well worth all the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katze"
},
"reviewBody": "I actually only used the icing recipe for a cake I made, I think I ate more frosting than what was put on the cake, you won't be disapointed, very rich and creamy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Golightly"
},
"reviewBody": "Of the more complex layer cakes I've tried, this was the most simple, both in terms of ingredients and prep. The most challenging elements were: a) not burning the custard (it takes a looong time to thicken, so be patient) and b) not making a huge mess with the ganache when pouring it over the frosted cake. \nTaste-wise, it's great (and intensely sweet!), though a bit chocolate-heavy. Next time, I will try vanilla buttercream frosting instead of chocolate. It might be a nice contrast with the ganache."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SAMJJ"
},
"reviewBody": "I made this for my mom's birthday, which fell during the week after Mardi Gras this year. The only warning I would give is DO NOT follow the recipe's means of checking the cake's doneness. Bake it until a toothpick inserted near the middle comes out clean. I lost one of my pans because of this, so the cake ended up with only 4 layers instead of 6. Also, I put strips of waxed paper under the cake as recommended, but they ended up being buried by the ganache, which was much too runny to spread, even after chilling for a few hours. I actually had to put the cake plate onto a pizza pan to catch the overflow. Other than that, it was delicious. I had (still have!) a ton of custard left over (partly because I had fewer layers, but even so, it seems like way too much), but it's being put to good use making parfaits with the salvageable bits of the unsuccessful cake pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mauigirl"
},
"reviewBody": "Wow! This was a labor of love. I had a piece of this traditional cake years ago at Commanders Palace in Las Vegas. I had forgotten it until this recipe popped up here and I had to try it. I have to admit that I have gotten into the habit of using cake mixes to whip up a birthday cake or a batch of cupcakes but making this made me remember how superior a good \"from scratch\" cake can be.I decided to combine my birthday and the upcoming Mardis Gras and this was perfect. Every step and ingredient was spot on and the person who submitted this did a great job on their instructions. The only off thing was the 25 minute cook time. There are many steps to this beauty and it took far longer than 25 minutes listed in the recipe. I did make one small change to the method. Instead of baking three layers and splitting the layers, I baked 6 layers (for about 11 minutes) I poured about 1 cup+ into 9 inch pans that had been lined with parchment and baked the six layers separately. That is so much easier than splitting cakes for me. That being said, this cake is fabulous and I am sure that my friends and neighbors will request this for their birthdays. Thank you Metread for posting this beautiful &amp; perfect recipe. This will go into my \"very special\" file :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Goff"
},
"reviewBody": "I have to say, end result was great! Best butter cake I've ever eaten! The frosting and ganache simple and easy...if you notice my photo...and see bits in them I totally and accidently tossed in Toffee Bits into the wrong bowl LOL...that's what I get for making 2 different sweet treats at the same time...Note to self not to do that. My only delimma was the custard. I had to make it a few times because I couldn't get it set up right. And when I did, the tbsp of vanilla was overpowering to me. SO a 3rd time, I made the custard and it set up, I only used a tsp of vanilla and followed through with completing the cake, really feel the custard issue was me and not the recipe but I was tickled when I got it to work. It was totally awesome. You only need to slice very thin slices for your kids and family. This cake goes a long way. It's rich, creamy and very delightful. I will soo make it again! TY metread!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231087/doberge-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/398/desserts/cakes/tortes/",
"name": "Torte Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231087/doberge-cake/",
"name": "Doberge Cake"
}
}
]
}
}
, "about": [
]
}
]