				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Donair"
,"datePublished": "2020-06-18T23:09:36.000-04:00"
,"dateModified": "2022-11-08T15:17:21.000-05:00"
,"author": [
{"@type": "Person"
,"name": "SABMAN"
,"url": "https://www.allrecipes.com/cook/24322587"
}
]
,"description": "Donairs are made with fried meat slices sandwiched in a pita round with tomato, onion, and sweet, tangy sauce for a Canadian Halifax foodie treasure."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bUeQAJpO35-eP-cDDixyVCGM820=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1118819-c354db5085514f2282022d891ec97f27.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Donair"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "35"
}
,"cookTime": "PT145M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "517 kcal"
,"carbohydrateContent": "67 g"
,"cholesterolContent": "70 mg"
,"fiberContent": "3 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "659 mg"
,"sugarContent": "28 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 pounds ground beef",
"0.33333334326744 cup bread crumbs",
"1.5 teaspoons paprika",
"1 teaspoon cayenne pepper",
"1 teaspoon onion powder",
"1 teaspoon garlic powder",
"1 teaspoon ground black pepper",
"0.5 teaspoon salt",
"0.66666668653488 cup nonfat evaporated milk",
"0.66666668653488 cup sugar",
"0.33333334326744 cup vinegar",
"6 pita bread rounds",
"3 tomatoes, chopped",
"1 large onion, chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Prepare meatloaf: Mix together beef, bread crumbs, paprika, cayenne pepper, onion powder, garlic powder, black pepper, and salt in a large bowl until well combined. Press into an 8x8-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until cooked through, about 2 hours. An instant-read thermometer inserted into the center of meatloaf should read at least 160 degrees F ( 72 degrees C.) Set aside until cool enough to slice, at least 30 minutes; the longer it cools, the easier it will be to slice."
} ,{
"@type": "HowToStep"
,"text": "Make sauce: Combine evaporated milk, sugar, and vinegar in a jar with a lid; shake well to blend. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat. Cut meatloaf into thin slices and fry in the hot skillet until browned on each side. Remove from the skillet and keep warm. Flick a little water onto the hot skillet and brown pita rounds on each side to soften."
} ,{
"@type": "HowToStep"
,"text": "Layer meatloaf slices, tomatoes, and onion down the center of each pita round. Drizzle with sauce. Fold pitas in half towards the center."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT195M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookin'SLP"
},
"reviewBody": "I had a Donair for the first time while in St. John, NB recently. I made this recipe as written and it came out beautifully. A winner with my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carmen Cavanaugh"
},
"reviewBody": "This is a great recipe! The sauce had too much vinegar for my preference. Add a little vinegar at a time, to taste. I used 80/20 ground beef and it only took 1 hour to bake. I cooled the meatloaf 1 hour, then chilled it in the freezer for an hour or so. It was easy to get thin slices with a large sharp chef's knife. I sauteed the sliced meat on a large pancake griddle. The fat content of the beef made it cook up like bacon. I normally would not buy 80/20 beef but it worked great in this recipe since you can drain most of the fat when it comes out of the oven. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ReneeP"
},
"reviewBody": "My husband lived near Hallifax for 10 years and introduced me to Donair when we were visiting friends. This recipe is GREAT, but does need oregano, as noted by other reviewers. One note on the preparation of the meat: in order to get the firm consistency needed, I mix everything together, then pick up the whole ball of meat and kind of throw it down into the bowl repeatedly until it becomes very dense and all the fibers of the meat are sort of squished together. Otherwise, the finished loaf will be crumbly and won't really resemble donair meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Wow - something totally new, but yet similar to a gyro. We loved this recipe. I made the meat portion of this recipe using 3/4 a pound of ground beef - and added 1/2 t. oregano &amp; 1/2 t. Italian seasoning. I also opted to use the cayenne pepper. I mix the meat by hand for about 5 minutes to really have the spices mixed in and to have the meat form without falling apart. Since I used a lot less meat, I formed into a rectangle and baked at 300° for 45 minutes in a toaster oven. Once the meat cooled I refrigerated it all day. I then proceeded with the recipe in the evening. I purchased homemade pitas from our favorite Greek restaurant to serve this on. I made 'Maritime Donair Sauce' from AR for the topping. My family loved the taste of this meat and this meal. It was so simple to make and I like that you need to make it ahead of time so that the meat will slice in thin pieces. We topped with fresh tomatoes, fresh onion slices and grilled onions. DS also topped his with some feta cheese and thin slices of lettuce. 'Cranberry Coleslaw' from AR was our side dish tonight. Thanks, SABMAN for sharing your recipe. I cannot wait to make this again for my entire family. I know they are all going to love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TERRI"
},
"reviewBody": "im from back east and was expecting something a little closer to what i get at home. wasnt a fav"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chikp"
},
"reviewBody": "a family favorite...might add a touch more spices, but this recipe is just fine as is!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mitzi Watters"
},
"reviewBody": "The taste of the meat was good. I used lean ground beef and I won't do that again. It was dry. I also will not add cayenne pepper next time. I used about 1 tsp and it was too \"hot\". I will make this again with the adjustments as noted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gavin"
},
"reviewBody": "good but it just needs an hour in oven, not 2"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chanelle"
},
"reviewBody": "This recipe is great!! I used red wine vinegar in the sauce and added 3 crushed garlic cloves. I made mini patties with the meat and fried them in the pan (rather than cook it for 2 hours in the oven). My husband loved it and I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dennis B"
},
"reviewBody": "Alternate sauce recipe: Use a can of sweetened condensed milk, grate 1-2 cloves of garlic into a fine paste and wisk it in. Add 1/4 C of white vinegar and wisk it quickly, but not too much (10-12 strokes is perfect). let it set in the fridge for 10-15 minutes, and voila... Donair sauce that you can literally stand a spoon in. This sauce keeps longer than the standard, and will not separate like the regular sauce. Enjoy!! A very important step in the meat prep is to run it through a food processor or grinder three times. This makes a more homogeneous loaf, that's easier to slice. More pepper is a good idea as well (up to twice as much.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nadine"
},
"reviewBody": "Is the ground beef supposed to be cooked already? I thought you're not supposed to bake raw ground beef...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lamilu"
},
"reviewBody": "I added a bit more vinegar, and I added more Cayenne to the meat for more spice. Great recipe. Thanks!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ABBRA888"
},
"reviewBody": "Waaay too much vinegar in the sauce, but meat tastes great - not Spring Garden Road at 2 am great - but good none the less. Will try again with less vinegar and more spice. The non-Haligonian who had these with me thought they were wicket so 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "This donair recipe was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TEEFOR"
},
"reviewBody": "i will post my own donair recipe very soon, but i did want to add, that i never use a mixer or food processor for my meat. I knead my meat by hand. I find it has a better consistency. To most, a donair is a gyro, but with a sweet sauce instead of the salty sauce used for gyros."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mr moose to you"
},
"reviewBody": "This was perfect, Me and my friends loved it, Nice and easy and taste sooooo good. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Helen"
},
"reviewBody": "Good Recipe. As someone who has grown up in Halifax, enjoying this amazing treat, I agree that it needs a little oregano. It is a strong herb, but gives you that authentic taste. The only suggestion I want to make is about the sauce. If you are like me, you don't want to wait for the sauce, or when I order out, they never give you enough. Instead of the evap. milk and sugar, use a can of sweetened condensed milk. Add the 1/3 cup of vinegar, and a pinch of garlic powder. Whisk it all together and put in the fridge until ready to eat. DO NOT skip the step of browning the meat in a skillet, it adds so much to the overal taste. If you've never had this before, try it, it will become a family favourite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tastycakes"
},
"reviewBody": "This was a nice recipe. I followed other posters suggestions and the sauce was sweet, tangy and thick. Plus the addition of the oregano was spectacular :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SWEETNOTHINGS"
},
"reviewBody": "kudos for idea!! I was so excited to try this but it really didn't do justice to the donairs out here in BC (IMO). There are some adjustments to be made as other reviewers have noted. The sauce seems particularly odd to me, the taste just didn't sit well with me and I tried everything to make it taste better! I think plain yogurt or taziki would be better. The meat needs alot more spice and herbs. However, this recipe gave me the new idea to make my own 'lunch meat' with homemade meatloaf that I can freeze in individual slices, Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andreav"
},
"reviewBody": "Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I love donairs, so I was quite excited for this recipe! Unfortunately, it did not live up to my expectations. The meat was on the dry side and had not a whole lot of flavor, despite adding oregano as other reviewers suggested. It did slice quite thin and nicely after letting it cool overnight, which was good. The sauce was too thin and seemed to be a bit off in flavor..a bit too sour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J"
},
"reviewBody": "We loved this recipe. The meat part was very easy to make, quick and tasty! The sauce was tasty but a little too runny and needed some garlic. Overall it’s a winner, I’ll just look for ways to tweak the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dschori"
},
"reviewBody": "This is so addictive. You will want it everyday!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph 2007"
},
"reviewBody": "I have lived in Nova Scotia and have not been back in years. I craved donairs and found this recipe. The recipe was great especially the second day since I could slice the meat thinner after it was chilled. The time also allowed the sauce to thicken - still need it a tad thicker to be perfect but still good and I did not use nonfat milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara K"
},
"reviewBody": "I have never been to Halifax, just stumbled upon this recipe. It was excellent! We ate it 2 nights in a row. I did add a teaspoon oregano. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the closest recipe that I've found to match my own. Very nice!! The only thing I would have added was oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JACKIE83"
},
"reviewBody": "Im from the U.K. and had never heard of \"Donair\". Anyway I made the recipe and was knocked back by all the gorgeous flavours which were so new to me. The following day I had some of the meat and sauce left over, but no Pita Rounds. I decided to put all the mixture with salad into a Soft Wholemeal Bap with a little spread added, and it was just as delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "firstly u should never use low fat canned milk, always use whole can milk. never mix the sauce in a plastic bowl, it wont set up. the ingredients listed are good but it is missing the most important one (ground oregano).per pound of ground beef u should use 1 tsp. also when making this recipe italian seasoning is needed, .5 tsp. per 1 lb. as far as the sauce goes try 1 can milk\r\n3/4 cup sugar,2tsp. garlic powder mix this well,then add between 4-6tsp. white vinegar.\r\nmix the vinegar in slowly it will make 4 thicker sauce.i find that u need a bit of fat in the meat 4 the spices 2 fully spread out therefore medium works better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I too have not lived in Halifax for 6 years now, but managed to find a donair recipe a couple years back. This recipe is good, but try this for improvement; for the meat add a teaspoon of oregano, for the sauce use 2 tablespoons of vinegar and also add 1/2 teaspoon of garlic powder. Don't use a jar...add the vinegar last and quickly and don't stir too much, this will make it thicker.\r\nNo this is not pizza corner, but my is it a good fix :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TAYTAR"
},
"reviewBody": "I went to university in Halifax and have been jonesing for a donair for sooooooooo long-for that I'm giving this recipe 4 stars, however...it's not quite the same as pizza corner. I think the meat is missing something, more garlic and more cayenne. Also the sauce is a little thin, maybe because I used fat free milk, should there be garlic in the sauce? I'll keep trying though because you can't beat a great donair!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/55855/donair/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16770/main-dish/sandwiches/gyros/",
"name": "Gyro Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/55855/donair/",
"name": "Donair"
}
}
]
}
}
, "about": [
]
}
]