				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Double Chocolate Biscotti"
,"datePublished": "1998-01-31T12:35:18.000-05:00"
,"dateModified": "2022-07-14T18:04:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Janet Allen"
,"url": "https://www.allrecipes.com/cook/24323998"
}
]
,"description": "A crisp, not too sweet chocolate cookie. Wonderful with coffee. Stores very well."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/u8lnSAh52d6CA9hlY77SVxZhsRQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/582756-ddf5f21424ab4080b6668d60978ffe37.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Double Chocolate Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "338"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "99 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "18 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "53 mg"
,"sugarContent": "7 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.5 cup butter, softened",
"0.66666698455811 cup white sugar",
"0.25 cup unsweetened cocoa powder",
"2 teaspoons baking powder",
"2 eggs",
"1.75 cups all-purpose flour",
"4 (1 ounce) squares white chocolate, chopped",
"0.75 cup semisweet chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large mixing bowl, cream butter and sugar with an electric mixer until light and fluffy. Gradually beat in cocoa and baking powder. Beat for 2 minutes. Beat in the eggs one at a time. Stir in flour by hand. Mix in white chocolate and chocolate chips. Cover dough, and chill for about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C). Divide dough into two parts, and roll each part into a 9 inch long log. Place logs on lightly greased cookie sheet, about 4 inches apart. Flatten slightly."
} ,{
"@type": "HowToStep"
,"text": "Bake for 20 to 25 minutes, or until toothpick inserted in center comes out clean. Cool on cookie sheet for 5 minutes, then carefully transfer to a wire rack to cool for one hour."
} ,{
"@type": "HowToStep"
,"text": "Cut each loaf into 1/2 inch wide diagonal slices. Place slices on an ungreased cookie sheet, and bake at 325 degrees F ( 165 degrees C) for 9 minutes. Turn cookies over, and bake for 7 to 9 minutes. Cool completely, then store in an airtight container."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrBaker2013"
},
"reviewBody": "This address to all, who basically don't want to be a Scientist in baking. For this recipe to work without having the Biscotti becomes crumbs. Follow the recipe as it is given. But, Double the recipe and add more other ingredients to this one. To allow the cookie (Biscotti) to stay together you add more Chocolate chips, Coffee Grounds (very fine) After baking is completed and let it cool. Actually to have loaf to be Luke warm. But not too hot or cool. Cutting into the loaf. It has to be thick cut with a sharp knife 1 inch thick. Then bake it Again! as it is written 9 minutes on one side, Cool, Then flip it over gentle for additional 9 minutes more. Them cool in cool spot in kitchen away from stove on metal or plastic cookie rack. You`ll have a solid firm biscotti. One more tip: If, you love baking as I have for years. start out one recipe then change it add something to it or take out something as ingredient. Make something that makes your mouth fall in love in cooking and baking. I should write a blog. My Double Chocolate Biscotti. Came out Fantastic of several flavors in biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryviola817"
},
"reviewBody": "I made these and used 3/4 cup of crushed walnuts and 3/4 cup of mini chocolate chips. I left out the white chocolate. I left some plain and others I dipped one side lengthwise into melted chocolate and then into the finely chopped walnuts. They are delicious. They taste like a brownie but have the consistency of biscotti. I used a very sharp knife to cut them into slices by carefully pressing straight down with the blade instead of a sawing motion. I didn't have the crumbling problem that some people mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Pruff"
},
"reviewBody": "crispy and delicious! made for coffee"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BearFloof_09"
},
"reviewBody": "Hello there! My family loves this biscotti. They eat it within a few days. I’d really suggest you make it if you have a sweet tooth. I made some changes to them that I would recommend trying: 1. I use 1/2 tsp on almond extract when I’m putting in the eggs. It adds delicious flavor. 2. I don’t let it cool for an hour. Only about 10 minutes. The first time I did this it was a mistake, and I keep on forgetting to do it and it still comes out DELICIOUS. 3. I make mini biscottis with this recipe. I roll them out in 2 thin logs and flatten them just a little bit. I then bake them with those thin, pipe-like shape, and cut them horizontally. I’d definitely recommend this for Mother’s Day, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "First time making and tasting chocolate biscotti, it was very good. I substituted the white chocolate with pistachios, therefore I added 2 T. extra of sugar. Added a dash of salt and 1 t. vanilla. The reviews made me afraid of crumbly cookies, but I have found that it's best to cut them as soon as they come out of the oven. I use a metal dough/pastry scraper to cut the cookies. I use a rocking motion and cut right through them with minimal breakage. Waiting for the dough to cool seems to make it more brittle, in my opinion. I've noticed that they tend to break more using a sawing motion and a serrated knife. Try the dough/pastry scraper...it works best for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shar22"
},
"reviewBody": "I make these every year for my sister’s Christmas gift &amp; it’s her favorite one! Sometimes, instead of putting chocolate chips in the batter, I put them on one side of the baked biscotti &amp; put them back in oven till the chocolate chips melt.....&amp; then, when they’re melted, I spread the chocolate over the biscotti w/a knife &amp; let them cool. Deelish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Hack"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rain68"
},
"reviewBody": "This recipe was excellent. It was my second time making Biscottis and they came out perfect. I didn't change a thing. Dipped them in Ghirardelli dark chocolate and crushed Ghirardelli dk cocoa-covered almonds. I don't know how to put a photo here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Ann"
},
"reviewBody": "My first try at chocolate biscotti! Using the 2 chocolates makes it a very pleasant chocolate flavor. Gave this as a gift and it was a definite hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alpha1"
},
"reviewBody": "I did add 1 tsp. Vanilla extract and 1/4 cup unsalted Pistachios. I also put the baking powder in the the flour and not the butter mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KateP"
},
"reviewBody": "I made them last night with cocoa nibs instead of powder. They turbed out great! My first time baking biscotti's :) \nI am baking a double doze again today :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn Zielke"
},
"reviewBody": "This biscotti is easy to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "miabeckman"
},
"reviewBody": "This recipe needs a teaspoon of salt. Just made it and it tastes very flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anna"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brad Hall"
},
"reviewBody": "I have no idea if I did it wrong or not. I followed the recipe pretty much exactly, except for the white chocolate. I replaced that with peanuts. It seems okay, but it isn’t crisping up for the second bake and it seemed very crumbly. Should’ve stuck with what this called for lol. I bumped up the heat a bit too see if it would crisp up. But, I have a feeling these will be more crumbly than I would’ve liked..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tipitongi"
},
"reviewBody": "I made for a progressive dinner party- I was in charge of dessert. Everyone loved the biscotti. I used a dark metal cookie sheet and reduced the cook time as it started to burn. I also dipped an end in white and milk chocolate for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arohi Mahajan"
},
"reviewBody": "I always had a passion for baking, even though I am only 12.\nI loved the recipe so much. Now, my dad wants me to make it every week, so that he can have it with tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug B"
},
"reviewBody": "Great but a bit on the cookie side and not as hard as traditional Biccotti"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Polasekfarm"
},
"reviewBody": "After reading reviews that stated there wasn't enough chocolate, I doubled it using a half cup. If you want chocolate, you usually want lots of it ! Instead of using the powdered Hersheys, I used bars of gourmet Chocolate and ground them up in my Ninja. I did not add the white chocolate. To me that stuff is just just fake vanilla chips haha. I threw in the chocolate chips and chopped walnuts. Oh my gosh it tasted like fudge brownies . I forgot to mention that I upped the sugar to one whole cup. I did have to leave mine in the oven for a longer period of time.....and additional 9 minutes. Mind you each oven will be different. Just watch them. After they cooled I dipped the bottom half of mine in melted gourmet chocolate thinned with cream and sprinkled chopped walnuts on top. Supper yummy recipe with the changes I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SOLINARI"
},
"reviewBody": "Great taste but I thought it was too crumbly. I've made other recipes before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Lester"
},
"reviewBody": "Took longer to bake than 25 minutes prior to cutting and baking again... closer to 35 - 40... but that could be because when the dough was rolled out it was a bit thick. However, the finished product was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keri Belisario"
},
"reviewBody": "Great recipe, have made this a bunch of times, and it is a favourite. My asks for this every year for her birthday and my husband asks for it all the time. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie OConnor"
},
"reviewBody": "This is an amazing recipe. Simple ingredients, we sometimes skip the white chocolate, twice the double chocolate chips. Other times, the loaf doesn't make it to the second bake. :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christine"
},
"reviewBody": "Excellent and delicious. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRBakerLOVE"
},
"reviewBody": "I made this recipe for a group of 13 kids, and they absolutely loved it! I wasn't able to find the white chocolate squares at the store, so I bought 4 oz. white chocolate chips and chopped them up a bit. This was so fun and easy to make; I will definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Savidge"
},
"reviewBody": "Eliminated the white chocolate and used Ghirardelli's Bittersweet Chocolate chips rather than milk chocolate. It gave it more of a rich, truffle taste, which I love. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brett Kerley"
},
"reviewBody": "I did make these and they turned out great. I gave it three stars only because I thought it was a little too sweet, too much chocolate. I know it really depends on the person. Give it try you may like it that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A A"
},
"reviewBody": "I loved this chocolate biscotti recipe. I switched the semi sweets for Milk chocolate only. Skipped out on the white. Cut them while still warm which made it very easy to cut! I've made Biscotti many times over the years. I always cut while warm because it is easier to cut that way. This recipe was easy and very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Chocolate"
},
"reviewBody": "Amazing!!! Easy to make and turned out like the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anni Rose"
},
"reviewBody": "Being a little pressed for time, I put all the ingredients in the bread machine set to the dough cycle. After it was mixed, about 5 to 6 minutes, it was ready to shape and bake!!! Came out perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaloni"
},
"reviewBody": "love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Manero Durben"
},
"reviewBody": "Delicious and easy recipe. I added a bit more cocoa powder, some salt and I used Andes baking bits instead of chocolate morsels and they taste great. I melted some of the Andes bits and drizzled over the cookie and they are amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Millikin Crane"
},
"reviewBody": "Followed directions and they turned out really good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Weaver"
},
"reviewBody": "Good stuff"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alan Smithee"
},
"reviewBody": "I've made this recipe dozens of times. Some tips from my experiences: 1) I use baker's sugar; I always found regular sugar to make the cookies too hard. 2) I add toasted almonds and/or toasted coconut to gild the lily. 3) I use a Henkels serrated bread knife to cut the cookies. This is especially critical if you have hard ingredients such as almonds in the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayme Edon"
},
"reviewBody": "So yummy! I will try Amy's suggestion of 1/2 the baking powder to make them less crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NegansLucille"
},
"reviewBody": "These were very tasty. I've made two batches for home and now I'm making this along with gingerbread biscotti for gifts. This biscotti is definitely softer than traditional hard and crunchy biscotti, but still has great flavor. I haven't changed the recipe at all, other than switch the order that some things were added. Definitely worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Reneervh"
},
"reviewBody": "I started making this recipe because it looked and sounded good. But then I realized it didn't call for salt. So I went ahead and added about 3/4 tsp. salt. Then after adding the dry ingredients to the creamed, I thought the dough was too stiff/dry. So I added 1 tsp. almond extract and about 1/4 c. scotch whiskey. (It's the only liquor I had on hand but I'm sure rum or brandy would be great too) that made the dough more pliable and what I'm more used to for biscotti. Oh and sorry I didn't care for white chocolate so I used mini semi-sweet morsel instead. It came out great. Granted I don't know what the recipe would have been like in its original form. But I appreciate the basics of it very much. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefddl"
},
"reviewBody": "I used Hershey's Special Dark cocoa powder and the dark chocolate bits....I didn't have white chocolate but I had a bag of Dove dark chocolate squares with peppermint bark. I cut the squares up and used them in place of the white chocolate. They are delicious!! Only thing, they did spread out quite a bit and the slices are much longer than I would have liked. I think next time I will make the logs longer...I did 9 inches as the recipe stated. But it still gets 5 stars for taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef V"
},
"reviewBody": "very tasty. I made some changes because i wanted to use oil inplace of butter. Used 1/2 cup of oil , upped the cocoa by double and used 1 tablespoon of baking powder. Also decided to use my white chocolate for a drizzled garnish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rmcgill"
},
"reviewBody": "These are amazing! I didn't have white choc so, I subbed in 1.5 oz slivered almonds. The batter makes for a tender crisp biscotti. Very very good. Making another batch tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cody"
},
"reviewBody": "This recipe is fantastic! everyone loves it, even those who don't love biscotti. The only change I made was at the end. I removed them from the oven, covered them with a towel to slow down the cooling to reduce cracking. let them cool for only 10 minutes, cut them and cooked them for 9min each side. I got this from another recipe and it worked great. I don't know that the original way would not work, but I knew this did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Oliver"
},
"reviewBody": "I have made this three times now and love it. I did add 1 tbsp of vanilla and a little almond extract the second time. Great with nuts too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olena"
},
"reviewBody": "Following the advice of one of the reviewers, I only added 1 tsp baking powder; following another suggestion, I cut the biscotti 15 minutes after the first baking. \nThey came out absolutely delicious!! I'm adding this recipe to my permanent collection of great desserts to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabe"
},
"reviewBody": "These are perfect! I don't drink coffee so I tried dipping them in chi tea with a little pumpkin spice. The chocolate chips melted in my mounts making a great sensation. If you haven't made it, I'd recommend that you do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johanne"
},
"reviewBody": "Will definitely make these again! My husband loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chocomike"
},
"reviewBody": "Small changes, 1 tsp baking powder, 1/2 cup each white and chocolate chips. Crisp but not rock hard, edible without dipping.\nTip: If you cool longer before the second bake, they will harden and break as you try to slice them. If you cool shorter before the second bake, they won't be firm and will fall apart. I slice them after 15 minutes, but do not move them! Leave them in place for another 45 minutes to let them firm up. Then separate slices and do the second baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Kate"
},
"reviewBody": "So good! I do not consider myself a baker one bit, and was scared to try something so 'advanced' like biscotti. This recipe is so easy to follow, they turned out amazing!! I used milk chocolate squares instead of white because that's what we had lying around, added almonds, and halved the baking power like someone suggested in the comments. They are too die for. When shaping the dough, it helps to cool it for a bit longer, I think (15 minutes instead of 10) and shape it by putting it in plastic wrap for easy clean up. I would recommend this recipe to anyone, regardless of skill level! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyler'sGotASweetTooth"
},
"reviewBody": "I have made it four times this month, so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bradlyp75"
},
"reviewBody": "I used white chocolate chips and milk chocolate chips. Otherwise I made no changes to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I made these over Christmas, with other biscotti, and forgot to rate them. Anyways, these were good. I thought they were more like a biscotti brownie in flavor. For the semi-sweet chocolate I had used a mix of semi-sweet and milk chocolate. I had liked that these were not excessively sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "This recipe is the BOMB! This biscotti is Delicious!an baked up nicely!Love Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nireh87"
},
"reviewBody": "I really like these! They're easy to make and they look so nice. I am bringing them for a cookie exchange this morning. No problems whatsoever with the recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Button"
},
"reviewBody": "This is a great biscotti recipe. My wife loves them. I rarely make them, but when I do, they don't last long in the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jJongKey"
},
"reviewBody": "Baked this for a bake sale at our school, and it was a easy recipe to follow. I got confused when the recipe said to roll it into a lot but I watched the video for another biscotti recipe and just rolled it out like that. I baked it a little shorter for the first bake since my"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gene"
},
"reviewBody": "We did it with dark chocolate instead of white, but it's a very nice recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Morales"
},
"reviewBody": "I love this recipe!\nI've made it a dozen times and give them away as gifts to friends and family. They're that good!\nI use 2 king size Hershey bars of chocolate with almonds, chop them up and throw in the batter instead of the chocolate chips and white chocolate; The recipe is very forgiving for the extra chocolate I put in. If I'm feeling fancy I'll melt chocolate and dip the cookies in it too, but these are awesome as is.\nI also had some issues with it being crumbly until I started using a sharper knife and waited the whole hour to cut. \nAs far as rolling it out I wait the ten minutes for it to get cold in the fridge and flour a giant wooden chopping block, then roll it out into a log as fast as I can.\nReally simple, delicious cookies that I can make for a fraction of what coffee shops sell them for. (&amp;put in way more chocolate too!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "msas"
},
"reviewBody": "difficult recipe - more complex than others"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IDYDELL"
},
"reviewBody": "This was excellent! I used chocolate chips only as I did not have the white chocolate. I also let it sit for 15 min between baking/cutting with no problems. Thank you for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Daigle"
},
"reviewBody": "We made these and they had lots of flavour and were very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "archer2691"
},
"reviewBody": "Disappointing, they crumbled and fell apart. More like a broken sour brownie bite. Not a good idea to add the chocolate chips or white chocolate because it burnt quicker. Should have read the reviews and taken the advise to use only half the amt of baking powder so it wouldn't have tasted so chalky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Yiannaki Varveris"
},
"reviewBody": "Great tasting biscotti. I used hazelnuts only because I did not have white chocolate. I also only waited 10 minutes after the first baking to cut them. I thought they might be too cool to cut well after an hour. I have to admit that 2 or 3 crumbled. Other than that they were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenNOVA"
},
"reviewBody": "This is a great biscotti. The dough is easy to work with you can change the white chocolate to all dark or vice versa. Or add nuts instead. I did not find it at all soft or crumbly. Bakes up very well. Rather than used greased sheets, I mix and bake it on parchment - easy peasy clean up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RichelleB"
},
"reviewBody": "This was my first time making biscotti and it turned out great! I only added 1 tsp baking powder based on previous reviews. They weren't too hard or too soft. So yummy dipped in coffee or tea! I read online that to ensure they are crispy enough, let them cool overnight in the oven then put them in an airtight container. This is what I did and they were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riri2"
},
"reviewBody": "I loved this recipe! This was my first go at making biscotti and I found it brilliantly simple and easy to follow and it was absolutely delish! I made a little modification in terms of sweetness - I used 1/4 cup of brown sugar instead of 2/3 cups of white sugar. And followed the advise of another user and reduced the baking powder to 1-1.5 tsp. Thank you for sharing this recipe Janet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamu"
},
"reviewBody": "My husband can't get enough chocolate so these were well received by him. Add a cup of coffee (his other favorite thing) and he was one happy camper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "slknop13"
},
"reviewBody": "i used semi sweet and milk choc chips and did a few easier steps after initial bake...cool only 10 min and use electric knife to slice them. they still crumble a lil but not as bad as the first batch which i did exactly as written. baked 10 min turned and 10 min more. turned out just perfectly crispy and 'biscotti-ie'!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SAMJJ"
},
"reviewBody": "These were frustrating, but kinda worth it. I halved the baking powder as others suggested, but they were still a bit of a pain to work with--the dough was much stickier than the other biscotti I made, and they didn't firm up too much after the first baking (the logs were like giant chocolate chip cookies). I had planned on letting them cool for 10 minutes or so before cutting (based on the other recipe I'd made), but they were so soft, I had to wait about 40 and still had some breakage issues. So, I don't know if I'd go through that to make them as biscotti again, though the final product was delicious. However, I might use the recipe (baking only once) to make awesome triple chocolate chip cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Murphy"
},
"reviewBody": "I have been making these years for Christmas. Very good and easy to make. Not too sweet, perfect with coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Finally I have to give this a review. This is the 4th time I went to this recipe. First time I used dried cherries in the recipe. Today, choc chips AND a second batch with chips &amp; almond slivers. Everything I've done comes out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Junebug"
},
"reviewBody": "This is a good Biscotti. I used unsalted butter, omitted the baking powder altogether (you don't want 'fluffy'), used a good quality Dutch processed cocoa and Ghiradrlli white and mini chocolate chips. To compliment the chocolate flavor, I added 2 tablespoons of orange zest. Before baking, I rolled each part in a mixture of granulated sugar and finely ground almonds. Totally excellent flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurellyn Ciavardone"
},
"reviewBody": "Fantastic recipe! Everyone loved these - even a non-biscotti person! I make biscotti, and found that the dough wasn't stiff enough so added 1/4 c. more flour. If you oil your work surface and hands nothing will stick. I also have better luck cutting when the logs are still warm - less crumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rrocket"
},
"reviewBody": "I like the addition of the chocolate morsels! Great texture and taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Cadle"
},
"reviewBody": "So good! Really glad I read the tip about the wax paper. Made shaping and rolling pretty easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane C."
},
"reviewBody": "Delicious! I didn't have any white chocolate so I left that out and added chopped almonds instead. Loved the combination of the chocolate and almonds. This is definitely the best biscotti recipe I've ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HaikuLady"
},
"reviewBody": "Seriously delicious! Mine cracked and crumbled when I cut them. No, I didn't let the logs cool for a full hour before cutting...I need someone to give me some tips. Mine might not have turned out very pretty, but they sure taste good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Canadian Cooker"
},
"reviewBody": "Love, love, love the taste - but like other reviewers, my biscotti ended up being very crumbly (I did follow other reviewers' suggestions and only used half the baking powder). And watch your fingers when handling the warm biscotti - hot chocolate bits stick to fingers (a tasty problem though!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "westcoastgirl"
},
"reviewBody": "These are Awsome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hankdog7"
},
"reviewBody": "yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tanyaburrows"
},
"reviewBody": "First, the taste of these is really delicious. Perfect for a biscotti. However, after following others suggestions and warnings as to how crumbly this is nothing helped. It crumbled and fell apart every chance possible. I was very disappointed in this recipe. I won't make it again. I followed the recipe properly, I have extremely sharp and very nice knives and I took suggestions from others as to when the best time to cut is. Nothing worked. Good luck to others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoreCoffeePlease"
},
"reviewBody": "Delicious - made it with dark chocolate cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FACILQUESO"
},
"reviewBody": "Made this to give as gifts and doubled the recipe. Several people asked me for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GWILSONMD"
},
"reviewBody": "I've been making biscotti for years, but wanted chocolate biscotti this year and thought I'd try these. These are flavorless - I was so disappointed. Definitely needs more cocoa or something! Dipping them in chocolate didn't help either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheCrookedCook"
},
"reviewBody": "So DELISH!! I have just started baking and this recipe was so easy to make and turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Roberts"
},
"reviewBody": "I've never made biscotti in my life and shied away from it because I thought it was going to be difficult. I took the bull by the horns and decided to make this for our cookie plate for Christmas dinner. It was SO EASY! It cut like a dream using a serrated bread knife and though crunchy, it's not so crunchy as to crack a tooth like some biscotti I've eaten. Not over sweet, would be wonderful dipped in coffee or hot chocolate. So much for Christmas...I made them two days ago and they're gone. Guess I'm making more. Thanks for an easy and pretty fool-proof recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GabbysMom08"
},
"reviewBody": "This was my first attempt at making Biscotti. I love the recipe and found it easy to make. I also substituted the white chocolate chips. This recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danielle0707"
},
"reviewBody": "Love this recipe. I will keep making this over and over. I substituted 1 1/4 cups mini semi-sweet chocolate chips since I do not like white chocolate, and they came out perfect. Just really watch them in the oven in the last few minutes of the second cooking. They go from done to overdone very quickly, especially if your baking sheet isn't really high quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christin Yuppa"
},
"reviewBody": "I made this tonight and was very happy with it. I did struggle with it crumbling a little when I cut it and after I did the 2nd baking on one side, it was even more crumbly, so I didn't flip it. The taste was delicious and I used both white chocolate and semi-sweet, along with some blanched slivered almonds. I'm getting ready to dip it in some decaf...YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "I am not the biscotti eater in the family, so I can only rate this on how well the recipe went for me as far as preparation, which was very smoothly. Biscotti is a bit time consuming to make with the double baking and slicing, but I wouldn't say it was difficult. This dough came together nicely and baked perfectly. I gave this away in gift baskets and everyone said they enjoyed it. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tapa"
},
"reviewBody": "Everyone loved these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Oxford"
},
"reviewBody": "Great recipe to start with- I added in some nuts and chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mommypie"
},
"reviewBody": "They tasted soooo good, but I ran into trouble making them. I cut the baking powder in half as suggested. When I put the loaves in the oven, they burned within 10 min. I don't know why :( I quickly flipped the loaves over, and lowered the oven to 350 F, and continued with the rest of 10 min. After I took them out of the oven, I sliced them into half inch slices, and sliced off the burned side. Then baked them right away at 325 for 9 min. No crumbling. So no need to wait. Just need to watch the initial first bake oven temp. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvu61"
},
"reviewBody": "very good biscotti. once you get past what they look like sitting on the bakeing sheet they bake up great lol.\nco-workers loved they as did family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "denisse1225"
},
"reviewBody": "This was the first time I ever baked biscotti &amp; although it's not perfect, I am pleased enough to try this recipe again. I was trying to make this recipe just a little healthier by changing 1/2 cup of butter to 2 tbsp &amp; adding 1/2 cup of mashed ripe bananas. It gave it a banana-y flavor but I personally liked it. Not bad at all if you're looking for something different than the typical cookie or brownie! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer DeFosse"
},
"reviewBody": "I had never made biscotti before, but had read enough to know that I should be very worried about creating a crumbly mess. My worries were for nothing- these turned out perfectly! I did allow them to cool for about 15 minutes before slicing and I used an electric knife to slice- which probably helped with the crumble factor. This recipe is excellent and I will definitely use it again. They're actually better a few days out than they are fresh. Thanks, Janet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristens"
},
"reviewBody": "It was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S and J"
},
"reviewBody": "These are delicious! First time I've made biscotti and now that I conquered them, I will definitly make these again and other biscotti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This makes a fantastic chocolate biscotti. It’s not as crunchy as other biscotti but has excellent chocolate flavor. I followed the recipe with the exception of not adding white chocolate morsels but added some chopped walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurenM"
},
"reviewBody": "I have made these a few times and they always turn out perfectly. They taste as good on the fourth day as they did on the first. Usually I add pecans and a tsp of vanilla, and I cut them about 10 minutes after I take them out of the oven. I have never had any problems with crumbling. Great recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10432/double-chocolate-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10432/double-chocolate-biscotti/",
"name": "Double Chocolate Biscotti"
}
}
]
}
}
, "about": [
]
}
]