				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Down Home Chitterlings"
,"datePublished": "2020-06-06T02:37:23.000-04:00"
,"dateModified": "2022-08-15T06:48:51.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KERYNE"
,"url": "https://www.allrecipes.com/cook/69255"
}
]
,"description": "Chitterlings, made from pigs&#39; intestines, are a favorite among Southern families. They are typically served with greens, vinegar, and hot sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/E4mMojmpWdMIR0uPPMpEYw-yrHw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/924533-635550d411734fa9acb6f06400231b79.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Down Home Chitterlings"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "57"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "312 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "365 mg"
,"fiberContent": "0 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "412 mg"
,"sugarContent": "0 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"10 pounds frozen chitterlings, thawed and cleaned",
"1 onion, roughly chopped",
"2 teaspoons salt",
"1 teaspoon minced garlic",
"1 teaspoon crushed red pepper flakes" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place cleaned chitterlings in a 6-quart pot and cover with cold water. Bring to a rolling boil; add onion and season with salt, garlic, and red pepper flakes. Simmer until chitterlings are clear to white in color and reach desired tenderness, 3 to 4 hours."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT240M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy enough 👌"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherman Connelly"
},
"reviewBody": "The biggest part is the cleaning. I normally buy the Aunt Bessie, Uncle Lou's, or Smithfield Queenella brands. They are usually super cleaned already right out of the package. However, I do clean again for myself. Remember it is not who cooked them, but rather who cleaned them. Recipe is good, I do add a large potato which cuts down on the smell considerably. Cooking in a quick pot also cut down on the smell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eaegencheva"
},
"reviewBody": "My 2nd time using this recipe. It was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica Blake"
},
"reviewBody": "Great recipe!!! Exactly how I would recommend seasoning them. I do boil Twice and dump the water before adding the seasoning. I skip all that cleaning by just buying Aunt Bessie's hand cleaned chitlins. Takes out all of the really hard work when it comes to cleaning them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R. Smith"
},
"reviewBody": "Loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Bradford"
},
"reviewBody": "They were delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kia"
},
"reviewBody": "Follow the ingredients you can't go wrong so tender in full of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frankie Makeithappen Davis"
},
"reviewBody": "Very tastey I will be using this recipe every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tastey I will be using this recipe every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blee0414"
},
"reviewBody": "I was looking for good basic recipe for chitterlings and discovered this. The only change I made was to just smash garlic cloves and quarter the onion so that I had the flavor but didn't have those small bits to contend with. I also made sure to THOROUGHLY clean, rinse and repeat until the water was clear. The smell (and you know that smell) was significantly lessened. While I don't eat chitterlings more that a few times a year, this recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzbabe 247"
},
"reviewBody": "This ius a great recipe for cooking chitterlings. it doesn't include potatoes, as I can see, but one poster said she uses them.\n\nPotatoes cooked in chitterlings are not meant to eat, although they certainly can be eaten if you wish. \n\nThe purpose of adding potatoes is for them to soak up the excess fat/grease that is in the broth when they are cooked.\n\nI plan on making 10 pounds for Thanksgiving, since it is only my sister and me.\n\nHaven't had them in quite a while, so this will truly be a treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arie"
},
"reviewBody": "Perfect!! Thanks. Yes the trick for the smell is to clean them well even the pre cleaned ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Williams Lewis"
},
"reviewBody": "She DID THAT!!!! Yeeeeesssssssss!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MzStelznelz Prater"
},
"reviewBody": "Excellent recipe. I love Chitterlings. But I don't trust just anyone cooking them for me. I was rise by my great grandmother ( a southerner ) and at an early age she taught my sisters and I how to properly clean and cook them. If cleaned properly there is no need for multiple rinses. Yes it is a very long process. But well worth the time if you know what you're doing. I use all ingredients listed plus I add Sazo'n Goya seasoning (must try) puts a spin on em and gives a little more flavor. Seeing how I'm the only one in my household that eats them I only use a 10 pound bucket (more than enough for me). I'm in hog heaven right now. Thanks for the share. And Happy Holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Grigsby"
},
"reviewBody": "This is an awesome recipe!! in addition to the basic receipt, I added lemon pepper, green pepper, a packet of soy sauce. \nI also cooked them in an iron Dutch oven. They came out super tender. I will definitely use this recipe from now on - for sure!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANTOINETTE_ROYAL"
},
"reviewBody": "Great tips! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DONALD"
},
"reviewBody": "LOVE CHITTLINS ONCE A YEAR THANKSGIVING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Lawrence"
},
"reviewBody": "I haven't made this as I live in France, and have never seem them to buy. However, as a child in North Devon, UK, my mother used to fry them in the pan with some bacon. They became very crisp and crunchy and absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqui"
},
"reviewBody": "Good with cole slaw, greens, and cornbread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dj"
},
"reviewBody": "my grandparents always taught me to soak chittlins in cold salt water for an hour or 2 before the cleaning process. after cleaning the water must be changed several times adding salt to the water. the salt really draws out the blood in the intestines. you'd be surprised how clear the water will be by the last washing. we also chop up an onion, garlic, crushed red pepper flakes, a whole potato, salt to taste, and white pepper instead of black pepper, also you can put a little apple cidar vinegar in too. we also have a family friend who cooks hers with a can of beer added for tenderness. when ready to eat put hot sauce on(franks), and throw down!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri S"
},
"reviewBody": "To save on time, I put the chitlins in my preesure cooker to cut the cooking time in half. My family has been eating chitlins before I was born. We absolutely love them. I forgot to mention I also add hog maws to \nthe chilins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelleyb"
},
"reviewBody": "Great recipe. My suggestion is to also try cooking them in a slow cooker! I cook them on LOW overnight. Wake up to check them maybe once or twice. The entire process usually takes about 10 hours in the slow cooker, but it is soooo worth the wait. Very tender and juicy. So good that my family says that there nevee enough. Hope this helps :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Pegues"
},
"reviewBody": "After cleaning 40 lbs of chitlins, I was looking for something quick and easy to get my chitlins cooking. This was easy and my chitlins were delicious; just like my mom and grandma used to make. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Bailey"
},
"reviewBody": "This is an excellent recipe for chitterlings. They came out perfect. I first brought them to a boil for about 10 minutes and then drained them. With fresh water, just enough to cover, I used one large onion quartered,1 stalk celery coarsely chopped, 1/2 jalapeno chopped and seeded, 2 chicken bouillon cubes(I didn't have any stock)1/2 teaspoon seasoned salt , crushed pepper flakes. I forgot to add the garlic. Simmered for 6 hours. My husband and daughter said the were very good. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keene"
},
"reviewBody": "I love cooking chitterlings for my family.My 110 year old grandmother taught me and i cook them only on special occasions.I use the same indgredients you use but near the end of the final hour cooking,i drop a potatoe in whole and it make a nice thickener and gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duke Elliott Jr"
},
"reviewBody": "this recipe sounds good but i clean in hot water then two baths and i also use a potatoes instead of garlic and sometimes add hog maw too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C.J."
},
"reviewBody": "Fellow southerner here, and this recipe hit the spot. I've had my share of chitlins, but never have i done them myself. The one thing that i did was during the final boil to toughin the chitlins added the white vinegar. And still they came out great. But this was a successful trial run with 20lbs of chitlins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diedre Strickland"
},
"reviewBody": "OMG! This is a great recipe my chitlins turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BigLoddi"
},
"reviewBody": "This recipe is fine however in Louisiana we cook ours with lots of apple cider vinegar. 50/50 vinegar water. Sage, black pepper, and a jalapeno also add a nice touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Cotton"
},
"reviewBody": "THIS IS BY FAR THE BEST AND EASIEST RECIPE I'VE SEEN!. JUST TRIED IT......LOVED IT, AND WILL DEFINITELY SAVE IT! HAPPY NEW YEAR, EVERYONE!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dee dee"
},
"reviewBody": "I follow this recipe, but add about 3 whole cloves to 10 lbs. It does not taste like cloves, it just enhances the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AudreyD"
},
"reviewBody": "This is an excellent recipe, but what I do is after cleaning them thoroughly, I pre-cook the chitterlings for 1 1/2 hours, rinse them until the water is clear and then proceed to season them and let them simmer for at least 5hrs in a slow cooker or a huge roaster(I cook no less than 60lbs each time). Chitterlings should NOT smell while they are cooking. If they do, they are not clean and if grease settles in them, they still are not clean. The juice from the chittlerlings should GEL up, not GREASE up. Grab the hotsauce and enjoy1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANNA"
},
"reviewBody": "I love them mmmmmmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phyllis Lee"
},
"reviewBody": "Great recipe! My only variation is adding sliced jalapeno peppers and about a tablespoon of vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AvocadoLady"
},
"reviewBody": "This was my favorite chitts recipe from reading the narrative. I tried this recipe for Thanksgiving and would like to suggest what tastes best for my family. They prefer only a small amount of onion, not a whole onion; cleaning well is the first step, but it is not necessary to pour off the water several times once the chitts begin to cook; once is enough.\nFinally, for seasonings the tried and true salt, a little red pepper and maybe white pepper, and a small amount (very small) amount of vinegar...1 teaspoon will do.\nIn terms of the smell; the true chittlin lover absolutely loves the smell of chitts cooking. That is part and parcel of the enjoyment.\nSo, try them; experiment with flavors, but just give me salt, red pepper and a touch of vinegar...that will do. And, please cook them for more than 4 hours. It is not a matter of tenderness; it is a matter of doneness. Cook them from 8 to 12 hours and they will be tender...and done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "goldee"
},
"reviewBody": "i'm soo glad to see a recipe like this&amp;yes i'm a southerner. and we looove chitterlings&amp;hog maws(we add this to the chitterlings...mmm mmm delicious) just like the other comments, i boil the chitterlings 2x(removing fat, grease, etc) instead of using water, i use homemade chicken broth. bouillon cubes, onions, jalapenos&amp;banana peppers(cutting out the inside for less spici(ness) garlic&amp;onion powder, just a little of msg let it boil down on low @least 5-7hrs(yes a whole days work but its worth it) once its done cut it up into small pieces&amp;serve with coleslaw...you all will thank me for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Enyaw"
},
"reviewBody": "Almost the same as I remember my mother making, but she added a potato to cut the smell while cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trish"
},
"reviewBody": "i made this for thanksgiving and my family just could not stop talking about how good it was and how it was the best they have ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MS ROCK"
},
"reviewBody": "This is the perfect recipe. Don't forget the hot sauce. I clean and cook at least 30 lbs. Just make sure you cook them until they are tender. If you clean them correctly, there's no need to par boil, you take away the flavor. Another tip, you can purchase cleaned chitterlins, 5 lb. bags each. They may need to be split open. I still check to make sure they are fully cleaned. Saves a lot of time, but oh so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "junebug"
},
"reviewBody": "chitlins themselves are wonderful i cleaned some last night and am cooking them NOW!but 10 pounds of chitlins is not enough for 10 people because the shrink really bad when you cook them,so to feed 10 people you will need 20 lbs cleaned chitlins.and in GA after we boil them we put them in spider(skillet)with a little grease and fry them and that believe it our not draws some of the grease out of them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alimac0327"
},
"reviewBody": "This was a very easy recipe to follow and my fiance' really enjoyed his meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nubiangrits"
},
"reviewBody": "I like this recipe. I do similiar but for 20 lbs, I parboil twice, draining after each boil. Then in a large pot, cover chitlins with water, add 2 chicken bouillion cubes, 1/2 cup white vinegar, crushed red pepper flakes to taste, and Adobo All-Purpose Seasoning With Pepper to taste. I've never added onions but will try it next time. Mother added a potato to her chitlins to cut grease. Also, the Sylvia Robinson recipe says to soak overnight in salt water to cut grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KitchenDiva"
},
"reviewBody": "To feed 12 people, you need closer to 20 pound of chitterlings! You may want to add salt AFTER your chitterlings have cooked down a bit. They may become too salty otherwise. I use Creole seasoning instead of salt and pepper along with extra garlic and red pepper flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAMELA"
},
"reviewBody": "Now you're talking! Finally a recipe that a lot of people in the South truly love. This recipe is great! When I cook mine, I cleaned them multiple times and then I cut them in small pieces before I boil them. Then, for a more robust flavor, after about an hour of cooking, I add beer, potatoes, onions and hot sauce or red pepper sauce to it. After they cook down, they will be very tasty and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is fine, but I would bring to a boil, drain, add water again, and then add your onions, red pepper, and garlic. If you don't do this, you will have fat on top to deal with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HNMIMARTIN"
},
"reviewBody": "No way this will feed 12 people. This recipe is tried and true. I have been using the same recipe for years. For the naysayers, just try them before you knock them. You may be surprised with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hernando Brownie"
},
"reviewBody": "Great recipe...just like mom use to make...The recipe is great the way it is written..no need to add potatoes, they take away from the taste of the chitterlings. I prepared it over the holidays and had meatless spaghetti, cole slaw, and cornbread..Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MRSPRINGLE2U"
},
"reviewBody": "I am very surprised to see a recipe for chitterlings..it is true this is like a southern delicacy..lol..this recipe is good, however, I also add bellpeppers, seasoned salt, preferable Lawry's, and chopped jalapenos..and if you ever cook chitterlings you'll know they're not the most pleasant thing to smell..My remedy for that is to also add potatoes as it cuts down on the smell..Very good you must have it with hot sauce or you're just not eating it right..Thanks for submitting this recipe..it's good to know that someone else appreciates a good southern cuisine."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/71111/down-home-chitterlings/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/71111/down-home-chitterlings/",
"name": "Down Home Chitterlings"
}
}
]
}
}
, "about": [
]
}
]