				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easiest Falafel"
,"datePublished": "2019-07-10T03:03:08.000-04:00"
,"dateModified": "2019-07-10T03:03:08.000-04:00"
,"author": [
{"@type": "Person"
,"name": "jaclyncady"
,"url": "https://www.allrecipes.com/cook/4091650"
}
]
,"description": "This quick and easy falafel is packed with flavor and uses ingredients probably in your pantry."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/16YokHx5TsWz4GkAgsNQQY9Pd-U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4562329-40fc6314704447ea9a9f1b7aea28339b.jpg",
"height": 1499,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2081695237001",
"description": "See how to make quick-and-easy falafel with ingredients from your pantry.",
"duration": "PT2M9S",
"name": "Easiest Falafel",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4641ad9f-2af8-419a-99f9-90c697d4a8bf/cd95d16c-5f75-40f6-ac0c-9d5b545a0b2b/1280x720/match/image.jpg",
"uploadDate": "2020-12-03T12:35:50.511-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easiest Falafel"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "53"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "301 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "37 mg"
,"fiberContent": "5 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "343 mg"
,"sugarContent": "1 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (16 ounce) can garbanzo beans, drained",
"0.25 cup panko bread crumbs, or as needed",
"0.25 cup chopped onion",
"0.25 cup olive oil",
"1 egg",
"2 tablespoons dried parsley",
"1 tablespoon curry powder",
"1 tablespoon garlic powder",
"1 tablespoon lemon juice",
"0.5 tablespoon ground black pepper",
"0.25 cup panko bread crumbs, or as needed",
"1 cup olive oil for frying, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place garbanzo beans, 1/4 cup panko bread crumbs, onion, 1/4 cup olive oil, egg, parsley, curry powder, garlic powder, lemon juice, and black pepper in a food processor or blender. Puree until coarse crumbles form. Blend more panko crumbs into mixture if it is too moist."
} ,{
"@type": "HowToStep"
,"text": "Roll mixture into balls about the size of a golf ball; place on a plate."
} ,{
"@type": "HowToStep"
,"text": "Press into patties and coat in panko bread crumbs."
} ,{
"@type": "HowToStep"
,"text": "Heat about 1-inch olive oil in a skillet over medium heat."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/16YokHx5TsWz4GkAgsNQQY9Pd-U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4562329-40fc6314704447ea9a9f1b7aea28339b.jpg"
}
]
,"text": "Pan-fry patties until crispy, about 3 minutes on each side."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda McGowan"
},
"reviewBody": "Its good...but I wIll add more spices!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elle"
},
"reviewBody": "Who would have thought that falafel were so easy to make? These are tender and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha Brooks"
},
"reviewBody": "We loved these! First time ever. I put them inside of pita pockets and used Chipotle aioli sauce for a topping along with tomato and lettuce and sliced avocado."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Bailor"
},
"reviewBody": "used triscuits roasted red pepper instead of panko YUMMY .might try other crackers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Haas"
},
"reviewBody": "I used fresh dill and garlic instead of dried, added a smidge less pepper than the recipe called for, and an extra splash of lemon juice. It tasted good. But it took me forever. Like an hour. I think frying it took the most time and I'll find a recipe for baked falafel next time. And I actually doubled the recipe and there was only a little leftover! We aren't big huge eaters either, pretty average. At least it did taste good though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "attycasner"
},
"reviewBody": "Too much oil, fell apart in the pan. Tasted like spicy bread crumbs. Will not waste my time on these again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "D Chekal"
},
"reviewBody": "I made these falafels they were ok but the curry seemed a little stronger then I was used to using. Also, the initail paste after blending seemed a little wet but bread crumbs help and they baked up ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "skidtaylor"
},
"reviewBody": "Really tasty! I only added maybe a tablespoon of oil to the mixture which came out with a good consistency. I tried frying the first few but found they fell apart. For the rest I baked them at 450 degrees on a greased pan until golden on both sides of the parties. Baked the \"falafel's\" stayed together nicely and had a great consistency. I made a tahini sauce for on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "What a lovely meal. I used gluten free panko and chose fresh parsley over dried. I allowed the mixture to sit about an hour before making into patties. I had no issues with them falling apart. Loved the flavor and they were so easy to make! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debora Dechtiar"
},
"reviewBody": "Delicious! I made several changes inspired by the reviews and it worked out very well! The consistency and flavor were awesome. I left out the oil from the mixture, used oats instead of breadcrumbs (I didn't have breadcrumbs), used 1 teaspoon each of ground cumin and coriander instead of curry (so that it would taste more authentically middle eastern), added a dash of salt, and used fresh garlic instead of garlic powder. I did have to add a bit of flour (probably about 1/4 of cup) to the mixture after blending to make it firm enough to form into patties before frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Galston1954"
},
"reviewBody": "For my taste.. too much curry... and mine was too moist... will dry beans before use next time.. and will trade out some of the curry for some cumin and garlic I think"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mj47tigger"
},
"reviewBody": "This was the first time I've ever made falafels as this was a request by my 11 yr old son. He claims that he's had them before; this was my first! With that being said, I had no idea whether they were supposed to taste the way they did. He loved them so I guess that's all that matters LOL. As others have said, I omitted the oil but ran out of panko bc; only had the initial 1/4 cup. Used Italian bc to make it drier as well as to coat before frying. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JohnnyMacK"
},
"reviewBody": "Fell apart in the oil, the mixture was not dry enough I guess, even with draining the chick peas well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jdcarr"
},
"reviewBody": "We are not adventurous eaters, but we do like humus and curry. The two picky children couldn't get one bite down. The two non-picky children couldn't get more than two bites down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chaya kolodny"
},
"reviewBody": "It came out really good but cracked open when I fried them... Probably needed more Panko crumbs.. I'm definitely going to make them again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue A"
},
"reviewBody": "SIMPLY DELICIOUS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "NMCookie"
},
"reviewBody": "The patties disentigrated in the pan making a big pan full of mush. Out of all the patties, I was only able to salvage about 5."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CAsweetie"
},
"reviewBody": "I was trying to be more calories conscious on this one, so I omitted the oil, baked them at 375 for 15 minutes and didn't roll them in panko. They were okay, a little dry, would probably be more tasty fried. If you bake, I'd definitely recommend using a tsatzki sauce. Combined with lettuce, tomates, on a naan or pita, would definitely be a hearty but healthier meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michelle Bungay"
},
"reviewBody": "I followed this recipe exactly and ended up with mush balls that caused the oil to get all bubbly and overflow all over my stove. I think this might have been better with more bread crumbs and cooked in much less oil. I have made more complicated falafel recipes with much better results and will stick with those."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tarek Essam"
},
"reviewBody": "I was curious to try this as it seemed very different than what we make back home in the Middle East (we don't use eggs, bread crumbs, and we use different spices). I tried it after making a number of modifications based on other reviews. First, Don't use canned garbanzo by all means! use dried ones after soaking them in water overnight. Second, there is no need for olive oil in the dough at all, it will make it very runny and you already have enough oil during frying ! Third, use fresh garlic and parsley if available. I used curry as specified but I didn't like it that much and I will be sticking to the traditional spices next time(cumin and dried coriander). Overall it wasn't that bad but not that wow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BB"
},
"reviewBody": "Loved the flavor profile after adding a little salt, but it required quite a bit of tweaking to get to the finished product. Fortunately this was not my first falafel rodeo. I doubled the panko before dropping my test dummy. It was still too loose, so I added some flour. The consistency should be closer to a bread dough than a cookie dough, but you don't want to add so much flour that it becomes dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AustinTX"
},
"reviewBody": "It was pretty good but there was not a lot of flavor. After reading reviews, I added less oil to the mixture and made sure the oil in the pan was hot (bread crumb dancing on top of oil when added to test for heat) and I was careful to let them cook for a while before flipping them. The one I didn't wait long enough for kind of got smooshy and almost fell apart. Ate them with pita bread and spicy mayo (srirachi, garlic, mayo combo) and it was good but not outstanding. I probably won't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Inskip"
},
"reviewBody": "Alright, I have made this before and from the start I listened to people: skip the oil altogether, and use that for frying instead. For those like me who know that falafel does not take curry at all, the two ingredients you actually need to use to replace that are ground cumin and ground coriander seeds, start with 1/4 tsp. each and work up from your own taste. Finally, a key to making this healthier if you wish: replace the bread crumbs with oats (yep)and work in the egg until you know you have the right consistency. You can add a little bit of water if it is too dry, as the oats will soak it up and you will have no splatter at the fry stage. Just keep in mind that if you make these with oats it fries differently and some of the crispiness may be lacking. Why I gave it 4 stars? I love falafel and this is a good general idea of where to start!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "These are really good. I skip the egg to make it vegan. QUICK NOTE: I've been seeing alot of reviews where people are stating theirs fell apart or turned to mush. You may be using too much oil, or your oil is not hot enough. When a bread crumb \"dances\" ON the oil, it should be a good temp. Don't crowd pan. Don't move or turn food until ready. Fry in small batches, even if your pan will hold more. And allow the oil temp to come back up in between batches. When done, set balls on cooling rack, not paper towels. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "Pretty much everybody complains about the patties falling apart, even those who liked the taste and gave it a good rating otherwise. The reason is very obvious: you NEVER use canned garbanzos to make falafel. That should really be common knowledge by now. Canned garbanzos are pre-cooked, which denaturizes the starch, which will make it very difficult to make them hold together. You'll have to add a ton of extra ingredients like bread crumbs, egg etc.\nThe authentic way to make falafel, and the only way to make them so they actually hold together without adding all the extra stuff, is to use dried uncooked garbanzos and soak them over night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "murph2che"
},
"reviewBody": "This was very delicious! I followed the directions pretty close, except I substituted fresh italian parsley in for the called for dried parsley. I thought the consistency was perfect, not too dry, but enough to stick together and hold shape through cooking. We made it with cucumber sauce on the side... the combination was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Bradford"
},
"reviewBody": "This was my first try at Falafel. They did fall apart but the next time I will add more panko and chill as others said. I did like the flavors. I will try this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kentk421"
},
"reviewBody": "This recipe turned out great. The curry sure added some zest to the flavor. I also made a great yogurt dill sauce I found on here too. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kali Reagan"
},
"reviewBody": "I used whole wheat cracker bread crumbs, but like everyone else I had to keep adding more. I used hardly any oil at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BevKat"
},
"reviewBody": "I tried the mixture and it was so bitter, no sense continuing on. I threw out the curry powder , then looked up online if it can go bad/bitter....nope, that's curry's natural taste. But? I love curry. Oh well, better luck next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Jordan"
},
"reviewBody": "This was my first time making falafal and oh man, where have you been all my life!! Super easy, super filling. This one is a keeper. \nAs one reviewer stated though, the olive oil was a bit much. I had to keep adding panko. I didn't have time to chill it either, so they were pretty crumbly. Next time I will decrease the olive oil and chill. Because there definitely will be a next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Manda"
},
"reviewBody": "Wonderful flavor. Terrible cooking instructions. I make patties from canned salmon all the time and so I was confident going into this recipe, but if I try this again, Im going to add only egg whites and perhaps no olive oil in the mix, just to fry. They didn't hold together and created breadcrumb slush in my pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpascare"
},
"reviewBody": "This was a really easy and simple recipe. I did not have panko, so I used Italian style breadcrumbs instead. My only recommendation would be to add a teaspoon of salt for a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KITTYBRAT"
},
"reviewBody": "Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JenWhitMo"
},
"reviewBody": "Sketchy! Good flavor but way too wet. They totally fell apart in the pan and made a big 'ol mess. We even halved the olive oil and doubled the bread crumbs. This recipe needs a re-work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Irlapati"
},
"reviewBody": "The curry gave it great taste but 1/4 cup olive oil made it really runny. I had to keep adding more and more bread crumbs so that my patties would stay together. The recipe also did not call for any salt. I added one teaspoon to mine.I will make this again but with those changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tara Edwards Kilroy"
},
"reviewBody": "I made this as i did have all ingredients on hand. I was not happy with it ,,not enough spice for me and mine fell apart. I added more breadcrumbs as I had a 19 ounce can, maybe that is what made them fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HuskerGirl"
},
"reviewBody": "These little patties are amazing! I did need to blend in more panko to help them hold their shape, but otherwise made exactly as written. Hubby was very pleasantly surprised by this one, as was I. I didn't even serve it with a sauce- the curry lends such a lovely flavor! I simply served it with some roasted vegetables, and it was a wonderful vegetarian meal. Thank you for sharing- it's a keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "These were different from any falafel that I have ever had, and I LOVED them! The curry powder gave these wonderful flavor. The insides were a beautiful bright yellow...so pretty. Almost too pretty to eat. Almost. Loved the crunch of the panko. These could've used a bit more salt, IMO, but that would be my only change next time. Served w/ 'Roasted Garlic Tzatziki', also from this site~YUM! Will be making these again! Thanks for sharing. :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220730/easiest-falafel/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/111/appetizers-and-snacks/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220730/easiest-falafel/",
"name": "Easiest Falafel"
}
}
]
}
}
, "about": [
]
}
]