				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Spaghetti with Tomato Sauce"
,"datePublished": "1999-02-20T22:10:02.000-05:00"
,"dateModified": "2022-08-23T07:29:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sammye"
,"url": "https://www.allrecipes.com/cook/258750"
}
]
,"description": "This meaty tomato sauce for spaghetti is easy to prepare with ground beef, tomatoes, mushrooms, and herbs for a rich and pleasing taste."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QFG50B-NKSOEhlFassqkORq6IwA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/999096-3458e9f33928457e8d48a776a29ee57e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Spaghetti with Tomato Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "115"
}
,"cookTime": "PT135M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "557 kcal"
,"carbohydrateContent": "66 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "6 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1002 mg"
,"sugarContent": "11 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound lean ground beef",
"2.5 cups chopped tomatoes",
"1.3329999446869 (6 ounce) cans tomato paste",
"1 (4.5 ounce) can sliced mushrooms",
"2 tablespoons dried minced onion",
"1 teaspoon salt",
"1 teaspoon dried oregano",
"0.75 teaspoon white sugar",
"0.25 teaspoon ground black pepper",
"0.125 teaspoon garlic powder",
"12 ounces spaghetti" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease."
} ,{
"@type": "HowToStep"
,"text": "Transfer beef into a large pot over low heat; stir in tomatoes, tomato paste, mushrooms, onion, salt, oregano, sugar, pepper, and garlic powder. Cover and simmer, stirring occasionally, for 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes; drain. Serve meat sauce over spaghetti."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT145M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WhatamIgonnaeatnext?"
},
"reviewBody": "This was easy and great. I used it as a pantry meal or I would have followed the directions exactly. I subbed the oregano with fresh thyme and I only had one can of paste. I used a can of fire roasted tomatoes in place of fresh and used fresh mushrooms. I added a little water to make it not so thick. It gave us an extra meal for the week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe but added a little water after adding all the ingredients because I thought it was a little bit too dry but in the end, it turned out GREAT!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamalena"
},
"reviewBody": "I decided to give this a go. Turned out very thick, but delicious. We usually have leftovers when I do spaghetti. There were no leftovers! I used peeled chopped tomatoes, left seeds and juice. I had no tomato paste. So I used 2 cans tomato sauce. I browned my finely chopped fresh onion and minced garlic in a bit of olive oil, then added the browned goodies to the ground beef n chopped it in well. I used all the other ingredients as per the recipe except the mushroom. I still had to season to less bitter with a bit more sugar and garlic powder. I added sweet basil, done! Will double the recipe next time, due the thickness it takes more per plate. This recipe is a great base, but tweak it to your liking as any cook would! Try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "My son in law made this and we enjoyed it so much that I made a double batch and froze the sauce in small containers to have later. I used good canned chopped tomatoes instead of fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scottsgrub"
},
"reviewBody": "I added water to thin it and I also add Ms. Dash Roasted Garlic Italian Seasoning. So good and easy to make. I also added some basil. Such an easy good base that you can add to it to make it your own. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "swan bronz"
},
"reviewBody": "It is nice recipe but I think if you reduce the amount of the red sauce so the tast be better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "I used fresh chopped onions and I substituted green bell pepper for the mushrooms because that's what I had. I did brown my meat, onions and bell pepper prior to simmering in the tomato mixture. Very easy to make and quite tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "texasbigbird"
},
"reviewBody": "I substituted fresh finely chopped onion for the dry minced onion, fresh garlic for the powder, and canned diced tomatoes for the fresh tomatoes, as this was what I had on hand. I thought this recipe was just okay, and it is unlikely I would make it again. It was definitely not too dry. I thought it had just a bit too much of tomato tartness. Perhaps using fresh tomatoes as the recipe called for would have toned that tang down a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Emilie Everhart"
},
"reviewBody": "I will so make this again!! My brother loves it and almost at all of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefMeemaw53"
},
"reviewBody": "Delicious, quick and easy!!! I will make this again and again! I doubled the recipe and added a bit more garlic powder. Very tasty recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DonnaK"
},
"reviewBody": "I made this sauce without the meat and onions as I wanted something quick and easy for my gnocchi and didn't have any onions or meat. I simmered for 1 hour and 30 minutes. It turned out great!! I would definitely make again! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beccalynnc"
},
"reviewBody": "I've made this, absolutely delicious! I did not add the sugar and used ground turkey (about 1lb) and turkey spicy sausage, used sea salt and black pepper along with McCormick Italian spice....I love adding extra herbs to give it a strong taste since I do not use much fat or sugar in my recipes! It was enough for leftovers for a whole meal (due to the meat) and I didn't have to do more than one can of each tomatoes, diced and paste. Perfect! My kids loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I give it a 5 for the reason is really delicious and so easy. Sure we could all make a more complex authentic Italian sauce, but why? :) I did use fresh onion and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lily"
},
"reviewBody": "Very easy recipe, and honestly had everything on hand which was a real plus. But I had to add two small cans of tomato sauce with a little water. Eyeballed the water amount. We don't like a very \"saucy\" sauce, but it had no other liquid to simmer in. Used fresh minced garlic also. Simmered real low almost two hours. Tastes great. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Highsmith"
},
"reviewBody": "Very very good and so easy to make. Brown your meat...add everything else and simmer. woolah its finished!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Nguyen"
},
"reviewBody": "VERY good &amp; healthy too. Buy the Barilla veggie spaghetti for the kids and it's a really good dinner. I added a bit of water to give more sauce. Kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "Ok as written this recipe just didnt work for us unfortunately. Iv made this twice first time as written the end result was very thick and as other reviewers said dry! I loved the fact that the recipe did only call for tomato paste and tomatoes especially on those weeks when my pantry is getting low. I really felt this recipe had potential so my changes were I used fresh onions and Garlic (only because I had them on hand) added about a cup of water with two cans of tomato paste and doubled the sugar we prefer a sweeter sauce!Also I did decide to cook it in my slow cooker makes my life even easier! I didnt rate this recipe based on the seasonings I based it on texture of the sauce! I feel like with any recipe you can tweak seasonings to your own personal taste! All in all It is a basic sauce for me the major problem is that it is wayyyy to thick! I will continue to use this recipe with my tweaks! I thank you for sharing this recipe it has now become the perfect base for me to make my own!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STC5"
},
"reviewBody": "Delish!! Used fresh onions, garlic and mushrooms. Also used Rotel diced tomatoes, so it had a kick to it!! Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Delicious, quick sauce when you want some pasta and are short on time! Didn't simmer for the entire time, but still came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marianela"
},
"reviewBody": "Love, love, love, this recipe!!! I was trying to make a good, quick, and easy dinner for my family. Found this recipe, ran to the grocery store and got the ingredients I didn't have at home. It is a thick sauce but if you cook it on low it comes out delightful. I used 3/4 pounds of ground beef only. I also added dried basil and cooked it for an hour and 15 minutes because of a time constraint. It still came out amazing!! Thank you! Thank you for this amazing website!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "izzyrain123"
},
"reviewBody": "this was so yummy! it was funny because I used so many different things than the recipe calls for, but it shows how flexible this meal is. I really recommend it for a quick dinner, everyone loved it! And if you have a family full of fish lovers try adding tune! soo yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jewlee"
},
"reviewBody": "Perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chel the Chef"
},
"reviewBody": "By far my all time favorite recipe I've found!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "France C"
},
"reviewBody": "I love the ease of this recipe...you pretty much dump everything into the pot and let it cook! I used Johnsonville Hot Italian Sausage in place of the ground beef and it gave the sauce such a nice flavor. I also took some reviewers' suggestions and used a large 28oz can of diced tomatoes in place of the fresh tomatoes. I found the sauce to be quite thick, so I then added a 14oz can of tomato sauce. Such a versatile recipe and super tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Huma K. Piracha"
},
"reviewBody": "It was good. Although I added more of garlic powder, n some olive oil ( like one of the other members suggested) and loads of water since simmering for 2 hours without would burn the sauce completely! For my South East-Asian taste i sprinkled some crushed red pepper after dishing it out. It tasted really good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clover"
},
"reviewBody": "My family wanted pasta, and I didn't want to go to the store to buy sauce, so I gave this a try. It's a darn good sauce and fast too. A nice thing about this recipe is it can be adapted to whatever similar ingredients you have in your pantry.\r\nUpdate: My son made this tonight for his Culinary Arts class. It was a hit again.\r\nMade sauce again: I promise you can make the sauce for this recipe with ANY canned tomato product you have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cormama"
},
"reviewBody": "Tried this today. It was really good, however, I did not include the mushrooms(yuck). I did find it to be a little too tangy so I may add more sugar next time I make this(and there will be a next time). :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carol"
},
"reviewBody": "Really easy and a nice flavor. Our family consensus was that it needed the addition of a bit of tomato sauce (even my husband, who likes his spaghetti sauce to be meaty \"like chili\"). I could double or triple this and have freezer meals at hand. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soupisgoodfood33"
},
"reviewBody": "I tripled this to make a giant batch of spaghetti. I didnt use the mushrooms I didnt have them and I added a splash of balsamic after I added the sugar because it was a little too sweet for me. solid recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahT"
},
"reviewBody": "This recipe was very good but needed more garlic and just overall seasoning! Super easy and my husband who is very picky loved it. I used crushed tomatoes instead of chopped and no mushrooms. Once I added more seasoning, especially garlic, it was much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Penajr"
},
"reviewBody": "best/easiest/yummiest spaghetti ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lucylove"
},
"reviewBody": "I give this 2 stars because it is easy, but that's the best thing about it. This sauce took a lot of tweaking to come anywhere near something my family would eat. I'll stick with sauces that use fresh onions and garlic, and more spices. The slight amount of additional time is worth it. Thank you for taking the time to post the recipe, it just wasn't to our taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsBookNerd32"
},
"reviewBody": "Yum. I tweaked this a little bit based on what I had. I used two 6 oz cans of paste, one 8 oz can of sauce, one 14 oz can of pet diced tomatoes, and powdered everything. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IndyRob"
},
"reviewBody": "I make quadruple batches of this sans meat, and can it using quart jars and the hot water method, makes 4 quarts plus enough for dinner that night.\n\nVery good sauce, thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carole"
},
"reviewBody": "Good dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suz"
},
"reviewBody": "Be sure to peel the tomatoes by dropping them in boiling water then in an ice bath. I also added a bit more sugar than called for, I used a fresh chopping onion and more garlic powder. This is a good basic recipe! Great to use up all of those tomatoes from the end of summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "onebzemom"
},
"reviewBody": "This recipe and the following alterations are ALL good, but the secret to a wonderful sauce is making it the day before and letting it \"sit\" in the refrigerator overnight...next day, yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Very thick and tomatoey. Nice overall flavor and a great standard sauce. I added water to it as it simmered because it was just too thick for our tastes otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Jo Shepard"
},
"reviewBody": "I changed a bit with this recipe. I don't like chunks of tomato in my spaghetti so I just added about 12 oz of tomato sauce and eliminated the tomatos, paste and mushrooms. I really like the seasoning though. I will probably not buy spaghetti sauce in a can again. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy N"
},
"reviewBody": "Just like Momma's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gnjade"
},
"reviewBody": "I actually made some changes to the recipe. Instead of ground beef, I used ground turkey. Instead of tomato paste, I use tomato sauce and diced Italian herb tomatoes. Instead of garlic powder &amp; dried minced onions, I used fresh minced garlic and onions. I didn't have any mushrooms so I skipped that ingredient. Instead of spaghetti noodles I used fettuccine. It turned out so delicious. It was so easy to make a homemade spaghetti sauce. I will definitely make this version I created in the next family dinner. But this time, I will include the fresh mushrooms and perhaps some fresh green bell peppers as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I found myself scrounging around in my pantry looking for something to make for dinner this evening. I had spaghetti noodles, a pound of ground beef, and a bunch of cans of tomato in its various forms. So, I figured spaghetti sounded good . . . but I'd never made my own sauce before, and wasn't about to attempt figuring out the spices on my own. Thank goodness for allrecipes! I found this recipe for spaghetti sauce, and decided to give it a try. We were NOT disappointed! Yum! Thick, unlike the runny sauces you get in jars at the store, and probably healthier too! Very flavorful . . . tasted exactly like I thought spaghetti sauce should, only better! The only thing I did different was to add a teaspoon of basil and used a teaspoon of fresh minced garlic instead of the garlic powder. We just like garlic a lot, and like basil in our spaghetti sauce as well, so I thought why not? I am adding this to my recipe box, and will be making my spaghetti sauce like this from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heartnut"
},
"reviewBody": "Great basic recipe, my husband and I changed it a bit by sautee'ing real onions and 2 cloves garlic with the mince, then added more black pepper and dried basil to the sauce. Go easy on the basil, a little bit goes a long way. I would never have thought to add sugar to the sauce, but it makes a difference. \n\nWe also only simmered for about 25 minutes, but I forgot to uncover it (splatter concern), so it was a bit runny. If you want to cover the sauce to cook, try draining the can of chopped tomatoes first to reserve, you can always add it in later if you need more liquid.\n\nBueno!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MsNimako"
},
"reviewBody": "I liked the foundation of the recipe..but like so many others I added Italian seasoning and a bay leaf since it needs to cook over an hour..also added water..could serve over rice also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "silenceinwinter"
},
"reviewBody": "Yummers! A very good recipe. Four stars because I enjoyed it thoroughly and it had good flavor, but I was hoping for something with more of a robust flavor. Still, it's nice because almost everyone has these ingredients just lying around in their pantry! I will certainly be using this again when I am in a pinch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda W."
},
"reviewBody": "Decent flavor but way to thick. This should be labled a meat sauce as opposed to tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Zizka"
},
"reviewBody": "I thought this was a good base for a sauce. I felt it needed to be doubled, since I added home made meatballs to it. I also added more seasoning, such as italian seasoning, and some sugar to reduce the acidity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodforthought"
},
"reviewBody": "Yummy! Similar to mine, however, no mushrooms for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Sykes-Carpenter"
},
"reviewBody": "Very good..family loved it!! Son usually hates spag. but he even LOVED it!!\nI added another can of tomato sauce and 2 small cans of water. Then for the tomato paste, sauce and chopped tomatoes I used the Oregano, Basil and Garlic flavoring from DelMonte...and it was very, very YUMMY and made it more juicier instead of like meat sauce!\nBTW...ONLY let it simmer maybe an HOUR to HOUR and 15 mins TOPS!! and was just an tastey!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CB"
},
"reviewBody": "Very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya Dieterlen"
},
"reviewBody": "Yummy, quick sauce from scratch. You could add more or less of any ingredients to make it your own. Saved our dinner on a snowy night!! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wilene Parris Messex"
},
"reviewBody": "made this spaghetti sauce but left out the meat b/c i was making a chicken lasagna and this sauce is WONDERFUL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kent Cannon"
},
"reviewBody": "Very good. Doubled it &amp; added 3 cloves garlic and a dash of ground clove. I also added 2 medium onions [chopped]."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sams girl"
},
"reviewBody": "This is an awesome recipe! I only changed a few things to cater to what i had on hand..I used real diced onion &amp; cooked it in with the beef. fresh mushrooms and tomato sauce, diced tomatoes, and 1 small can of tomato paste for the \"base\". My Mom was a \"Prego only' type of girl and she said that this is her new favorite! NO MORE PREGO FOR US!! Thank you LORD for the ability to make things from scratch! Proverbs 3:5-6 look it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BuddyMolly"
},
"reviewBody": "This was a huge hit with my family. I'm glad I doubled the recipe and froze half. I used canned diced tomoatoes in sauce and I as suggested by another review, I left it simmering in the crockpot for the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEEMEEBULUGA"
},
"reviewBody": "Delicious. I followed another reviewers suggestion and used 1 can of sauce, 1 can of diced tomatoes and 1.5 cans of paste. It seemed soupy at first, but thickened up nicely after about an hour on the stove top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "snack cake"
},
"reviewBody": "I'm sorry! I didn't think this recipe was anything to get excited about. I think any kind of canned spaghetti sauce is better. It was very plain and distasteful. No, I won't be making this agaon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauriessmith"
},
"reviewBody": "I had to use what I had, and needed to make 10 servings, used 2lbs of beef, had no oregano so I used thyme and basil, I only had two cups of chopped tomatoes, but 3 cans of tomato paste, and I added water because of all the \"thick\" and \"dry\" ratings...it was GREAT. The whole family loved it. It is clearly a recipe you can work w/ to your individual taste and what you have in the cupboard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carmi"
},
"reviewBody": "This was easy and tasted OK. Like others said it was very thick. I think it would be better with less meat and some tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paradise1481"
},
"reviewBody": "i used ground elk for less fat and used italian seasoning instead of the spices. great recipe, thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busybee"
},
"reviewBody": "My daughter that hates spaghetti ate this and told me she loved it. She was the first one done. This is an easy and yummy recipe, we are definately making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scotdog"
},
"reviewBody": "Hard to rate this one. It was so dry, but it might depend on your fresh tomatoes. I have an overabundance of early romas in my garden. After chopping them all, this sauce seemed so dry. I cooked the meat with an onion. I added red wine and a can of tomato sauce. Along with the oregano (from my garden that I dried) I added basil &amp; thyme. Lots of fresh garlic. I've never used canned mushrooms so maybe that would add a lot of water too, I used fresh, chopped them &amp; threw them in. We eat low salt so I just added a tiny bit of sea salt. Ate it over whole wheat thin spaghetti with a bit of romano. End result was delish, but I realize it's a bit different from the original recipe. I do appreciate finding a recipe that uses fresh garden tomatoes though, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CEMETH6"
},
"reviewBody": "Wonderful thick delicious sauce. I added a cup of red wine after an hour since it was so thick. Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fastuart"
},
"reviewBody": "Great sauce since I was brought up on sauce made from tomato soup! My son loved it, though my hubby thought it too meaty ...I did change it up a little, added two cans of diced tomatoes, didn't have dried oregano so changed it to italian seasoning and also 1 t. fresh basil, added 2 T worchestershire sauce and 1/4 t. red pepper flakes.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wshigemura"
},
"reviewBody": "It was easy. Taste was good but not the best I've had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sarapot"
},
"reviewBody": "This is an easy recipe if you don't have spaghetti sauce on hand or the long list of ingredients to make homemade sauce. It actually tastes better as leftovers! It did fulfill its name---Easy Spaghetti with Tomato Sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I loved loved loved this recipe!!!! I did not have to go out to get any special items. I used fresh garlic and onion because I had it on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura O'Rullian Stewart"
},
"reviewBody": "Easy, go-to spaghetti recipe. Good when you haven't planned dinner because it contains common ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mcqueenbee"
},
"reviewBody": "A nice basic meat sauce. Unfortunately, I realized out half way through that I was out of tomato paste and had to use tomato sauce and it still came out tasty. I added 3 cloves of fresh garlic, fresh onions, and used whole wheat pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "This is a quick, easy, tasty sauce, will use this recipe once every 1-2 weeks. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Nagel Roberts"
},
"reviewBody": "Love this recipe! I doubled it and used 1 pound of venison (all I had in the house) and 1 pound of mild Italian sausage. The whole family raved! Will definitely use this one again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANDJGOLDEN"
},
"reviewBody": "This was a great and easy recipe that my picky family loved. I added 2 cans of tomato paste and a little more garlic, but overall I was VERY satisfied . Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEACHESFROMGEORGIA"
},
"reviewBody": "This is a GREAT spaghetti sauce recipe! The title should say meat sauce, however. I almost didn't look at it thinking it was a plain tomato sauce. I made it for dinner at a large family gathering for 16- from ages 1 to 6- and everyone loved it. They all wanted the leftovers for lunch the next day, but there wasn't any. I used canned diced tomatoes, a little more tomato paste than it called for and also a large can of crushed tomatoes. Simmered it on low in a crock pot and it was fabulous. It will be made for Italian dinners in my house all the time, even for just the two of us. Sooo easy and absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FMSFLORA"
},
"reviewBody": "Very easy and great flavor..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NicoleH"
},
"reviewBody": "Super easy. Very tasty and very easy to adapt to your likes...I cooked sausage in the sauce as it simmered. A time saver and it added moisture to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana S."
},
"reviewBody": "Thanks for this great recipe... the family loved it. I left out the ground beef and served it with chicken instead. I also added a little olive oil (about 2 T.) to the sauce just to enrich it and also cut the acidity. I simmered this for just one hour and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEASTMAN"
},
"reviewBody": "This is such a fantastic recipe! I make this often as it is my boyfriend's favorite. He says it's the best spaghetti he has ever had. I use fresh tomatoes and don't bother seeding or peeling them. I also use more tomato paste than called for and add fresh sauteed mushrooms. (Pat's sauteed mushrooms from this site) I make lots of sauce and double the meat and freeze it for other recipes (lasagnas, etc) that call for canned spaghetti sauce because it is ten times better! Thanks for this fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angie Beliveau"
},
"reviewBody": "my family did not like this the way written I had to tweak it alot for my kids to even think about eating it. Thanks for the posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RachelK"
},
"reviewBody": "Not my favorite....dry and lacked flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle fortenberry"
},
"reviewBody": "it was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIKATANGEL"
},
"reviewBody": "This is my first rating ever on this website and I think this cause deserves it. I loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABYBOPPS"
},
"reviewBody": "Wonderful recipe!! My family loves it!! I used 2 cans of tomato paste (6oz) and 1 can of tomato sauce along with one can of diced tomatos instead of fresh. I also used fresh mushrooms and sauteed them in olive oil for a couple of minutes before adding them. Thank you for the recipe- I will stop searching for the perfect easy spaghetti!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHARITYMEADS"
},
"reviewBody": "Very easy and great recipe! My hard to please husband and daughter loved it! I would recommend not putting sauce in with noodles just letting your family top there own because sauce can be a little thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCQUEEN"
},
"reviewBody": "This recipe is on the level with some of the finest spaghetti bolognese sauces I've ever had. \r\nAfter reading the comment about it being dry, I made the following modifications: 1 3/4 (6oz cans) tomato paste, in addition to the regular chopped tomatoes, I added 1/4 cup extra and used those that come seasoned with garlic, oregano and basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ASHLYNNS MOMMY"
},
"reviewBody": "Delicioso! I was a little leary of using onion flakes and garlic powder but it tasted just as good as fresh, with a lot less hassle. The sauce freezes well, too. I usually make up a double batch of the sauce and throw half in the freezer for an easy, quick meal another night. Thanks for posting this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A little dry"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11715/easy-spaghetti-with-tomato-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/505/main-dish/pasta/spaghetti/",
"name": "Spaghetti"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11715/easy-spaghetti-with-tomato-sauce/",
"name": "Easy Spaghetti with Tomato Sauce"
}
}
]
}
}
, "about": [
]
}
]