				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Arroz con Gandules"
,"datePublished": "1999-07-02T13:05:09.000-04:00"
,"dateModified": "2022-07-14T17:13:51.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Valerie Serao"
,"url": "https://www.allrecipes.com/cook/24329114"
}
]
,"description": "Cilantro and other ingredients are whirred in the blender to create a seasoning base called soffrito used in this Latin rice and pigeon pea - gandulas - dish. Tomato sauce and soffrito impart a lovely flavor to the rice that is then cooked with the peas."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v-hsZANBfDdTXWtr1KzHHR0DTfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1169444-754d270d49e244e8b2864693e8584e18.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Arroz con Gandules"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "68"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "237 kcal"
,"carbohydrateContent": "42 g"
,"fiberContent": "6 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "400 mg"
,"sugarContent": "2 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 green bell peppers, diced",
"1 onion, chopped",
"6 cloves garlic, minced",
"1 bunch cilantro, finely chopped",
"3 tablespoons olive oil",
"1 (15 ounce) can tomato sauce",
"1 (.25 ounce) package Spanish seasoning",
"3 cups uncooked brown rice",
"2 (15 ounce) cans pigeon peas, drained",
"6 cups boiling water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place green peppers, onion, garlic and cilantro in a blender or food processor, puree. This mixture is called soffrito, it is your seasoning base. It can be stored in an airtight container and refrigerated for up to 2 weeks or frozen for up to 6 months."
} ,{
"@type": "HowToStep"
,"text": "Place 3 tablespoons olive oil and 6 tablespoons soffrito in an 8 quart saucepan. Cook for 3 or 4 minutes to release oils."
} ,{
"@type": "HowToStep"
,"text": "Pour one can of tomato sauce and the Spanish seasoning packet into the saucepan, mix well. Add 3 cups rice to the mixture and stir until the rice is coated."
} ,{
"@type": "HowToStep"
,"text": "Stir pigeon peas into the mixture and add boiling water. Cover the pot with aluminum foil and a pot lid. Reduce heat to simmer and cook 45 minutes or until rice is tender."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nyoka Walker"
},
"reviewBody": "This was an awesome recipe. It was easy and taste great! Thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Benni Lozano"
},
"reviewBody": "Two main ingredients missing, salt and the olives/capers um that’s just strange not having either in this dish lol it’s an ok recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MNMMICHELLE"
},
"reviewBody": "I too found this bland. I used 2 packets of seasoning, extra garlic, salt and pepper. I also added olives. I cooked the rice separately so maybe that's why."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara A Harrison"
},
"reviewBody": "Fantastic flavor couldn’t find pigeon beans , so I used pinto beans , everyone loved it. My daughter said make this one a week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lily Nunez"
},
"reviewBody": "I couldn’t get ahold of my mother to get her recipe, but I’d seen her make it enough to know that this is the closest I’ve come. Unfortunately, I don’t have culantro where I live and so I substituted some ingredients with the sofrito and it still came out fantastic. I also used white rice. I cut the portions, used 3 cups of rice and just followed the directions on the bag for the water portion, used 1/2 a lb of dry gandules soaked overnight, and threw in olives. It came out slightly mushy but I’ll adjust the water next time. I didn’t want it to burn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Marie Torres"
},
"reviewBody": "This recipe was perfect to get me started, I made some minor tweaks to the recipe and it came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NitaPooh"
},
"reviewBody": "These were Great instructions!!!! My rice came out Spectacular. Thank you! I added 1 tablespoon of salt and alittle Adobo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grace PM"
},
"reviewBody": "Tonight was my first time making this dish for my Puerto RIcan husband. He said it was \"delicious\", which is quite a compliment coming from him.\n\nThere are some modifications I would make. The 6 cups plus the tomato sauce was too watery and made the rice mushy since I used white rice and not brown. Since brown rice needs more water, the 6 cup is appropriate but not for white rice. So next time I will reduce to 5 cups. Also, I didn't make the homemade sofrito but used the store bought Goya sofrito. Worked just as well. Plus, I added green pitted olives and capers (also Goya brand) and added 2 teaspoons of salt as another person recommended. \n\nThis is definitely a keeper with the changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elvenya S McAdory"
},
"reviewBody": "I actually used yellow rice from goya, add about 2 cups of water just enough to cover the rice, 1 packet of sazon and cilantro together, fried some ham cubes and added the ham and gandules with some olives I used 1 tablespoon of sofrito. Combine or fold all the ingredients. But make sure the rice is not sticky. And yes I would do my recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Silva"
},
"reviewBody": "Delicious! !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Antone"
},
"reviewBody": "My Puerto Rican neighbor taught me how to prepare Arroz con Gandules from scratch, and I don't see one of the key ingredients, like the Achiote oil to give it a nice color to the rice. Also, one to remember too much liquid is not good, and the most important seasoning to add, is \"SALT\". Long grain white rice is best for this recipe. Not sure of using Brown Rice for this recipe, but I guess if it floats your boat, why not! Using a blender is a lazy-man way according to my neighbor, he advised me to really enjoy a true home cook meal is starting from scratch. He cooks on a open fire using dry Mesquite wood, all of his cooking equipment is made of cast-iron. I can attest to his Puerto Rican style of cooking is one of the best tasting prepared food! Also, his Pastele stew and banana wrapped Pastele is to die for! Oh! forgot to mention his Codfish salad is another one to add to his many Puerto Rican recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra Gonzalez"
},
"reviewBody": "I'm a Puerto Rican living in the Midwest and loved this brown rice arroz con gandules. I didn't have tomato sauce so I substitute with 2 tbs of tomato paste. I also substitute the sofrito with home made sofrito with culantro and the olive oil for 6oz of salt cured pork. After cooking for 45 min I added Spanish olives with pimiento and olive oil. I stirred the rice, cover the pot and let it simmer for another 10 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noemi"
},
"reviewBody": "This is a good recipe. Needs more Sazon Goya"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nlalvarez"
},
"reviewBody": "I really liked the way this recipe turned out. The only suggestion I have is maybe adjusting the amount of water used to cook. Luckily I held back some water judging by the looks of it. In doing so rice came out moist but not mushy as another reviewer had commented. I copped out and used an electric rice cooker. Still turned out tasty even without the pegado."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "simplycollazo"
},
"reviewBody": "Mine came out mushy too, but I put it in the oven on low heat for an hour and that helped a lot. Also, it definitely needed salt. I thought about it as I was putting it in the oven. It would have been a whole lot better if I had put the salt in while it was cooking on the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy Mercedes"
},
"reviewBody": "This was very tasty but its still not like mom\r\n's :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian Sagginario"
},
"reviewBody": "Incredible!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LYNNFROMNY"
},
"reviewBody": "First of all Arroz con gandules is made with white rice. You can make it with brown rice but it will then not be considered by anyone to be authenthic in taste. Salt is a must. Spanish olives are usually expected. Sofrito is always made with culantro (recao) and ajies dulces. Without the culantro you will not get that authentic taste you are looking for. If you like you can add a combination of any of the following: spanish ham, salted pork fat (tozino), chorizo. Aluminum foil is not needed if you have a decent pot ( I don't know anyone who uses it). How much water depends on your pot and the type of rice you use (long grain, medium grain, etc). I use long grain and one cup of water per one cup of rice. This is what works well for my pot. The rice should not be mushy or over-cooked. I always rinse my rice to remove the extra starch before I cook it. You will be surprise what a difference that makes. Hope this helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Neena"
},
"reviewBody": "way too mushy! it did have a good flavor though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Tacoronte"
},
"reviewBody": "Loved it. I added some smoked cooking ham to the seasoning mix while cooking the sofrito. I also used Goya's Green Pigeon Peas with Coconut Milk (don't worry, it only changes the consistency of the dish)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindi Bond"
},
"reviewBody": "This was okay if you don't know what arroz con gandules is supposed to taste like. You must add spanish olives-3/4 Cup and capers-2 TBS, more garlic, and fry your sofrito in achiote oil!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gerry Lewallen"
},
"reviewBody": "The rice was okay for me. I also agree with other reviews that there is to much liquid as the rice was to sticky. Next time I will try reducing the amount of water and adding more seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brodeyamos"
},
"reviewBody": "awesome recipe. so much flavor. I added 2 packets of the spanish seasoning. also cooked rice separetely and left on the side. pour beans over rice when serving. thats how my husbands family always does it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANDRADIFF"
},
"reviewBody": "This is absolutely delicious. The only change I made was to drain the pigeon peas. Oh yes and only cooked it for 30 min. Now that the soffrito is made and frozen it will be a simple recipe for the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ai Ries Collazo"
},
"reviewBody": "Addictive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mightymiri"
},
"reviewBody": "This recipe is missing one very important ingredient.. salt! Being Puerto-Rican myself, arroz con gandules without salt is unheard of. Which is probably why some of you said it came out bland. I would add a teaspoon. Also, two cans of peas is a lot, I would do just one. Extra garlic, and an extra packet of Goya's Sazon seasoning is my secret. I also use the fluid from the drained peas as part of the water (reduce water accordingly). Que rico!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BarbiePRUSA"
},
"reviewBody": "I'm Puerto Rican and the traditional arroz con gandules is with white rice not brown!also arroz con gandules you can add 1 can of coconut milk and you going to love it! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "inounvme"
},
"reviewBody": "I used home made soffrito and Goya Culantro y achote (spanish season packet), then the last 5 items. Use white rice and drain the liquid off of the peas. That's for those who had too much water/liquid. You made need to cut down the cooking time by 5-10 minutes. Be sure to watch your pot. Fairly good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ana"
},
"reviewBody": "Good,I modify this recipe adding one pound of pork chunks or pork chops. Just cook the meat and once ready in the same pot add the rest of the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C. Hooper"
},
"reviewBody": "We make the soffrita all the time and I use and ice cube tray to freeze it. I just drop approximately 2 tablespoons into each \"cube\". After its frozen solid I take them out and put into a freezer bag. This has worked awesome. I put this stuff in everything!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Wife/Cook/Maid/Mom"
},
"reviewBody": "Too Mushy.\n6 Cups of water plus the juice of the tomato sauce and canned peas is too much fluid for this recipe. Change brown rice to white rice...Add 4 cups of white rice instead, no tomato sauce, the two cans of the pigeon peas WITH the liquid...add just enough liquid to cover the rice....cook until it starts creating craters. I add whole spanish olives to this recipe and spice it up a little more with the Goya seasonings and cumin....it always turns out delicious and perfect on the fork! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CARMEN464"
},
"reviewBody": "My rice came out so mushy that it was inedible. I'm a good cook, I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SANDYCALON"
},
"reviewBody": "OKay, I tried this recipe and it came out mushy. I did exactly what the recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brandy"
},
"reviewBody": "There is too much water on this recipe. For 3 cups of rice. I would use 4.5 cups of water. To make the crispy rice or \"pegao\" do the following, at the point were you stir to mix the rice and water etc, cook on medium without covering and without stirring until almost all the water is absorbed, then \"turn\" the rice so the rice on the bottom is on top and the top is on the bottom, be careful not to scrape the bottom layer of rice. Cover with a tight fitting lid on low for about 20-30 minutes or until tender. Also you need to use a \"caldero\", if you use a non-stick pan, you won't get it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RAMIVEO"
},
"reviewBody": "Very good... but it makes a difference what type of rice you use... long or medium grain.. brown or white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "renzandjo"
},
"reviewBody": "I loved this! But how do you get that \"sticky\" crispy well done rice that is suppose to be stuck to the bottom of the pan?? I remember it growing up and that was the best part! Does anyone know? Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LILSWEETFORMOSA"
},
"reviewBody": "I work at a school with a predominantly hispanic population and during a class party a student brought this in. This recipe tastes exactly like it! Although I cheated and added cooked rice at the end, stir frying it instead of letting it simmer. Saves so much time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "exandra23"
},
"reviewBody": "Omg Soooo good. I've tasted traditional Arroz con gandules, and this taste just like it. Will deffinitly make again. everyone in my fam loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My neighbor makes this and it is great!! Now I don't have to beg her to make it for me...the best thing about it- to make it soo good is the pigeon peas and spiceier peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cyn Acre"
},
"reviewBody": "This recipe is far from our \"Traditional Arroz Con Gandules\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MCLANEK"
},
"reviewBody": "Good but not great. Not sure if I will make it again; my family did not care for it. I was not bothered like others by the \"blandness\"...it was very tasty, just felt like something was missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe.. I added 7 large green olives, diced, and 2 tbsp. capers. Really, really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Danica Milotzky-Lovings"
},
"reviewBody": "This was fairly easy to make. I didn't realize that the soffrito part of the recipe made enough for about three batches, so now after freezing it, the next two times I make it will be very easy. I will however, add more spices next time. I thought the flavor was rather bland. Next time I will add two seasoning packets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ErinInVegas"
},
"reviewBody": "This was not as good as I hoped it would be. Mine was mushy and a little bland. I won't be using this recipe again. I guess I will just have to bite the bullet and ask my boyfriends mom for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CreativeCook"
},
"reviewBody": "I cheated on this recipe and used jarred Goya Soffrito - good stuff and cuts some of the work out. I sauteed an onion with a little oil to start and substituted 8 oz. of the tomato sauce with the soffrito and used Goya Culantro y Achiote seasoning. It was excellent! It took far less than 45 minutes to cook since I have a gas stove top, though. Good thing I checked on it because it would have burned. Perfect recipe and will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth M."
},
"reviewBody": "This was an awesome recipe! Very authentic. Ive already made it twice. The family loves it. I served it with homemade enchiladas and refried beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah W"
},
"reviewBody": "I would give it an A+++ for flavor! But I think I added to much tomato sauce and it was very mushy--I was really disappointed because the flavor is so good. I would definitely try it again and add less tomato sauce and water too. The leftover sofrito made awesome beans to serve over rice by adding some tomato sauce to the sofrito and letting simmer with black beans. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "I was looking for a truly authentic Latin rice and beans recipe that a friend used to make for potlucks years ago…and I found it here! I followed the recipe pretty closely, except I added a few crumbled strips of bacon, because I remembered my friend’s recipe had bacon in it, and I used a yellow Spanish rice instead of the brown, and chicken broth instead of water for more flavor. Even my picky eater son enjoyed this and actually had seconds! It was a perfect side dish to chicken fajitas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a GREAT recipe!! I have attempted to make similar dishes in the past that did not turn out well - but this recipe is Exact, and my husband (who is Spanish and very picky) loved it!!! This was the first time I ever made Spanish rice that he actually liked. Thanks for this great recipe - I will use it often from now on : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "njmom"
},
"reviewBody": "This was a very easy dish to make. Came together very quickly using leftovers; I added cooked chicken to make a more filling dish. Could use some heat, but that's a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ENSHALACOOK"
},
"reviewBody": "As a Puerto Rican, I'm clearly impressed! The recipe turned out wonderful and I added a few more garlic cloves than the recipe calls for. As for the spanish seasoning package, I highly recommend using\r\nSa-son's Culantro y Achiote seasoning packets (in english- coriander and annatto seasoning), it's authentic, tasty, and easy to find."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "This is a great recipe for Arroz con Gandules - and I have had plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shak"
},
"reviewBody": "Its good and very tasty.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LitleLisa1"
},
"reviewBody": "I made this using ingredients I had on hand, substituting 1 can of pinto beans and 1 can of black beans for the gandules, and attempting my own spanish seasoning with paprika, cumin, oregano, red pepper flakes, &amp; garlic powder. Mine came out needing quite a bit of salt. Also, the cook time was over an hour. Great side for tacos -- I used the leftover sofrito as a salsa for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Nice flavor! I had to guestimate the tomato sauce (I only had a 28 oz can) and overdid it so my rice was mushy, but it still tasted great! This is a great recipe because using homemade sofrito you don't get all the additives and msg found in Goya sofrito. I added some adobo as well. Also, cutting the sofrito recipe in half still gave me more than enough to make this dish. Tastes like the arroz con gandules I've had in Puerto Rican restaurants without all the msg! Fried plantains (platanos) were an excellent accompaniment for this dish!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14040/easy-arroz-con-gandules/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
"name": "Rice Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17482/side-dish/rice/spanish-rice/",
"name": "Spanish Rice Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14040/easy-arroz-con-gandules/",
"name": "Easy Arroz con Gandules"
}
}
]
}
}
, "about": [
]
}
]