				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Flat Iron Steak in Wine Sauce"
,"datePublished": "2020-05-27T02:41:28.000-04:00"
,"dateModified": "2020-05-27T02:41:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jackie B."
,"url": "https://www.allrecipes.com/cook/2904173"
}
]
,"description": "Beef flat iron steaks get a spicy rub and a quick sear, and are served with a hearty red-wine and mushroom sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/sam3nxu1hTJYmFHzd9fxDYHmcMU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3480275-a4c7ebbe56734d068ea41836622e89cb.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Flat Iron Steak in Wine Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "94"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "711 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "116 mg"
,"fiberContent": "3 g"
,"proteinContent": "38 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "1280 mg"
,"sugarContent": "2 g"
,"fatContent": "55 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 (6 ounce) flat iron steaks",
"2 tablespoons olive oil",
"0.125 teaspoon cayenne pepper, or to taste",
"1 teaspoon ground black pepper",
"1 tablespoon ground paprika",
"1 teaspoon salt",
"1.5 teaspoons dry mustard powder",
"1.5 teaspoons garlic powder",
"3 tablespoons olive oil",
"0.5 cup dry red wine",
"1 cup sliced portobello mushrooms" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Allow the steaks to come to room temperature."
} ,{
"@type": "HowToStep"
,"text": "Stir together 2 tablespoons of olive oil, cayenne pepper, black pepper, ground paprika, salt, mustard powder, and garlic powder in a small bowl to make a paste."
} ,{
"@type": "HowToStep"
,"text": "Prick steaks all over with a fork and rub them well with the spice rub paste, working the rub into the meat."
} ,{
"@type": "HowToStep"
,"text": "Heat a large, heavy skillet over high heat and add the remaining 3 tablespoons of olive oil. Heat oil until it just begins to smoke and quickly sear the steaks until the outside has browned but the center is still blood red and just warmed, 2-3 minutes per side. An instant-read thermometer inserted into the center should read 115 degrees F (46 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Remove steaks from skillet with tongs. Pour the dry red wine into the skillet, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Stir in the sliced portobello mushrooms, and cook and stir until mushrooms are cooked and have released their liquid, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Return steaks to the skillet on top of the mushroom-wine sauce. Reduce heat to LOW and cook until sauce reduces and thickens, about 5 minutes. Remove steaks to serving platter and pour mushroom sauce over steaks to serve."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ellen"
},
"reviewBody": "I had Marsala wine on hand, so I used that. Superb!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Grant"
},
"reviewBody": "I started this on the fly, not realizing till the steaks were basically done that the recipe called for two 6 oz steaks. I had grabbed two 1.25 NY strips from the store instead and put them in the skillet and pretty much followed the directions to the letter. I cooked them about 2.5 minutes on each side at the tail end of the recipe once I realized the mess up and hoped for the best. Hands down, the most perfectly cooked, most flavorful, juiciest steaks I have ever had. My wife is somewhat picky and she absolutely agreed. It was probably just the high of putting a lot of work into something and having it turn out good. There’s your grain of salt. My wife raved for two weeks about the mushrooms, too. She will not eat mushrooms under any circumstances. I think this recipe has her looking to add them to a lot of hot dishes now, which is pretty neat to see since I’m all about ‘em. It definitely worked out since I really have never cooked much of anything other than grilled hamburgers and hot dogs. My wife threw some cut up garlic cloves about half way through because she loves it, so other folks might like that too. Next time I make them, we’ll probably have more tweaks but for now, it stays a 5 star meal in my book."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chana Pepose Wax"
},
"reviewBody": "I added onions with the mushrooms and it came out delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent with rave reviews from my non-eating spouse. He even asked for a repeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phamrick"
},
"reviewBody": "Good...got great reviews from family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul"
},
"reviewBody": "Wow - Great Recipe- Will do again and again. \nLeftovers were spicy and dark - almost better that original."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucas crouch"
},
"reviewBody": "Amazing flavor. I added onions to the sauce, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buzz"
},
"reviewBody": "This turned out to be really easy and quick and totally delicious. I will probably put more mushrooms in it for my personal taste next time but fine just like it says. My steaks were slightly larger than 6 oz so I made about 25% more of the paste and it was just enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefani"
},
"reviewBody": "Delicious! Took an inexpensive piece of meat to new levels! Made as is the first time and second time doubled the mushrooms and tossed in 1/4 cup of sliced onion that needed used. Left all other ingredients as is. This is a keeper - thank you for submitting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LULU"
},
"reviewBody": "I loved the flavor of the rub with the wine and mushrooms. I didn't change a thing! The meat I had to cook longer but that's not a fault of the recipe. WONDERFUL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Roberts"
},
"reviewBody": "This Is a fantastic recipe I made change so because my hubby don't like mushrooms so I grated onion and use instead of the mushrooms then I added some beef broth as there wasn't enough sauce for us. I made egg noodles el dente and then put butter on them w some salt and pepper I sliced the steak very thin and place it on top of the noodles and pour over the sauce oh and put some parm on noodles before adding steak it's delightful and would be expensive in a restaurants"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lucilulu"
},
"reviewBody": "This dish would have been VERY GOOD if not for the salt. It burnt our mouth it was so salty. The mushrooms and wonderful wine sauce was loaded with salt. It ruined an absolutely good dish. We will make it again but cut the salt way back. It was very difficult to evaluate giving the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeganP"
},
"reviewBody": "My husband loved it! The spice rub was awesome. It gave the steak a bite and the mushroom sauce was full of flavor too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becky9729"
},
"reviewBody": "Total hit! I did not have chipotle spice, so did not use that. Not too spicy at all! I increased the mushrooms and wine about double. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alanddonna"
},
"reviewBody": "I used a sirloin tip roast that I cut into 4 steaks, doubled the rub to cover the four steaks also used full cup of red wine,followed rest of the cooking directions served with a side of garlic mashed potatoes and carrots and it turned out amazing! Will def make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Hogg"
},
"reviewBody": "Possibly the best steak sauce I had had, top restaurants included. I switched out the cayenne for Chipotle Chile pepper and used smoked Hungarian paprika. Had made bacon for breakfast so the cast iron skillet had some bacon bits and drippings that I used instead of olive oil to coat the skillet. I accidentally added too much olive oil to the rub paste and it was more slurry like which turned out fabulous. Made with grilled hearts of romaine and garlic bread. Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Easy easy! I would say one thing the salt was bordering on too much so be careful there. The only thing I added was shallots to the pan with the mushrooms just because I love shallots in sauces. I also didn't have dried mustard so I used Grey Poupon. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "The sauce was pretty good - I did add a bunch of garlic to it, and I think it would have been bland otherwise. I was also pleasantly surprised by the flatiron steak, which is a cut I hadn't tried before. However, the rub burned on the pan which resulted in really unpleasant gritty burned bits in the sauce. I think high heat is a bit much - if I cook this again I'll try medium high and see if I can avoid the burned bits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Coulson"
},
"reviewBody": "This turned out really well both times I have made this recipe. I added a little balsamic vinegar to the wine sauce before cooking and it was amazing. The second time my guests really enjoyed this too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judie Holtz"
},
"reviewBody": "I do not have a lot of experience making steak and so I was nervous. But oh, goodness! I made it exactly according to the recipe and it came out perfect. The marinade was tasty and the steak was very tender. Not dry or chewy at all. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Benitez"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shellyworks"
},
"reviewBody": "The marinade for this steak was delicious, but the meat could have been a bit more tender. I think I will follow another reviewer's advice next time and leave the steaks in a marinade for a few hours before cooking. Not enough sauce for my taste either so maybe some broth added to the mix next time too. Still, very tasty and worth adding to the line-up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B Paul Jackson"
},
"reviewBody": "This was very good. The steak was very tender and flavorful. I made it the first time without the mushrooms but tonight I'm making it with..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gepq's mom"
},
"reviewBody": "everyone liked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Beck Sain"
},
"reviewBody": "Took advice from Aja and omitted the garlic powder and added minced garlic, onions and 1/4 cup of beef broth. Would suggested adding more portobello mushrooms as they do shrink during the cooking process. Excellent dish and will definitely make again. BTW, I used a Malbec for the red wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Clark Gombar"
},
"reviewBody": "It is awesome!! never cooked skirt steak before but after I tried this recipe i couldn't believe how tender it came out!!!Added onions with the mushrooms for the flavor and it was great!!better than sirloin and so much more tender!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom McCullough Sr."
},
"reviewBody": "I used a top round London broil cut abut an inch thick. The steak was flavorful and very tender. My only criticism is that it was very salty and the black pepper was a little too much. I think the saltiness came from the wine reduction so next time I would withhold adding salt and black pepper and taste at the end and adjust at that point. We will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "This was delicious. My whole family enjoyed this. I made sure that my mushrooms were sliced very thin since none us really like mushrooms and we all loved it. This one is a keeper for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrscallietea"
},
"reviewBody": "Good, quick recipe. I didnt add mushrooms since I didnt have them on hand, but added a little broth for additional liquid. Added onions and garlic to red wine. Served with a green salad. thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcobb35"
},
"reviewBody": "This was one of the best flat iron steaks I have made. Was out of cayenne and used chipoyle chilie pepper instead. I have to admit I was worried some about the black char it created while cooking but it turned out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I give this a 4, but my family gives it a 2. I used a 1.5 lb. flat iron steak and left out the mushrooms. I used a good pinot noir and the sauce was good. My only issue was the seasoning practically blackened and became somewhat gritty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Destiny279"
},
"reviewBody": "Wow! This steak recipe is amazing!! I've made it thrice and even messed up the ingredients once and it still came out great! The last time I subbed the same amount of mustard for marjoram and since I didn't have ea pan big enough for the slab I bought I broiled it 5 mins on one side then 3 on the other. Then I combined the drippings with the wine and shrooms boiled then simmered for 4-5 mins. Threw it under my 1.64 lb slab of meat and baked at 350 for 7 mins then 400 for 5. It came out about medium and juicy! Superb! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terersa s."
},
"reviewBody": "Yummy! I let the paste sit on the steak for about an hour so it really absorbed all the flavors and added shallot and fresh garlic and more mushroom (because we love them). Came out tender and juicy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "augrads"
},
"reviewBody": "Too spicy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for the first time a few months ago and a few times since (and am about to make it again for tonight's dinner!) I have both made it exactly as the recipe dictates and changed things up a bit; it's come our fabulous either way. I've used white wine when I didn't have red, and that was great, too. This is a great recipe that I recommend for those that haven't made flat iron steak before; it's certainly won over my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LovelyDove"
},
"reviewBody": "Pretty good. I didnt use ground mustard (didnt have). The sauce never thickened to my liking but it was still savory. My bf very much enjoyed the sauce with the potabellos. Overall 3.5 star. I still think flat iron steak is alittle bit on the chewy side for me. But would make again, but with different cut of steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Mccraw"
},
"reviewBody": "Used a rub I had from this website, but followed cooking steak with cabernet mushrooms and added onion slices. Hubby loved it! While the steak was in rest mode I covered with aluminum foil to continue the cooking stage. Came out pink in middle, very tender and great taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsCabes"
},
"reviewBody": "A great recipe - my kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom Long"
},
"reviewBody": "Very good. Didn't have red wine so used 1/2 blush and 1/2 beef broth. Reduced by 1/2 amount of black pepper and mustard for spouse's tastes. Added onion cut fajita-style and cooked with mushrooms. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "southernhopsing"
},
"reviewBody": "I rated this 5 stars because of the excellent flavor and easy to follow directions. I was looking for a quick but flavorful way to cook deer steaks (I was kinda worried about the gamey flavor). Because of what i had in the pantry, I subbed prepared mustard for the dry, and regular white mushrooms for the portabellas, but the method was the same with tasty results. My steak was not as tender as I would have liked, but I'm sure was because I was in a hurry and didn't cook them properly. Nevertheless, it was thumbs-up from everyone, and next time, I'll try them in the slow cooker to try to improve the tenderness. Yumm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Rust"
},
"reviewBody": "This dish was amazing. Next time I will cut the oil for cooking the steak and the sauce. I did add onion, shallots and garlic to the mushrooms for the sauce and the result was fantastic. I did reduce the garlic powder slightly since I added fresh garlic to the sauce as well. Will most definately be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rilla Wolf"
},
"reviewBody": "The flavor on the meat was GREAT - we made the sauce and cooked the meat in it, but we didn't use it at the end at all, since it didn't look very good... but the meat was so flavorful and juicy, we didn't even miss the sauce! Will definitely make this again... and it's SO easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mkecupcakequeen"
},
"reviewBody": "Yum. Yum. Yum. that about sums it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cherry"
},
"reviewBody": "Really good mix... the steak came out juicy. I cooked everything (according to about directions) in wok. Only thing I changed was adding onion slices instead of mushrooms... Quick, Easy, Tasty *smiles*"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "slfortson"
},
"reviewBody": "This wasn't the worst dish I've ever had, but it wasn't to die for either. Like many of the other reviewers, it was too salty. I would personally cut back 1/4 or even 1/2 cup of salt. My mom, who hates anything spicy, even liked it, so it isn't too hot. My boyfriend and my mom liked it much more than I did. One tip is that I went sparingly with the rub. I rubbed it on, and then scraped the majority off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily Butler"
},
"reviewBody": "Wonderful flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cchellez"
},
"reviewBody": "I liked the recipe, the only problem that I found was that there was so much rub on my steaks that it really took away from the taste of the sauce (mainly because the spices seared before the meat). I think the next time I try this I'll use a little less than recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Envision"
},
"reviewBody": "Everyone love it. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motorcyclekitty"
},
"reviewBody": "This was great. I was looking for a new steak recipie for Valentine's day and this hit the spot. The rub was great and very spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misswhit"
},
"reviewBody": "Wow. This was a HUGE hit in my house- my husband freaked out over it! We usually prepare flat iron steak with a yummy marinade and grill it. I've always been pleased, but my husband proclaimed this was THE best flat iron he's ever had! So easy, too. I also added some onion to the oil after removing the steaks and let them get a little tender before adding some marsala wine. I can't wait to try it with red wine! Oh, it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Sullivan"
},
"reviewBody": "This was the first steak I ever cooked myself and MAN, I'm hooked! I used a sirloin instead, added side of asparagus, and had the wine to drink. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bikerchickie"
},
"reviewBody": "REALLY liked this just as the recipe said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "Excellent! Used 1/3 cup strong beef boullion added to the wine. (only had white wine). Added onion with the mushrooms. Would reduce Paprika by quite a bit next time. Omit the salt. People can salt it if they prefer. Reduced the olive oil by 1/2 when browning steaks. Warning to newbys at browning at high heat. High dosen't mean # 10. medium high is better. Watch closely unless you like blackened steak, wich will ruin the taste of the veggies. But.. You must brown quickly, unless you like well done steak. Hope this helped!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ebporter"
},
"reviewBody": "Great recipe. I had to tweek it a bit as I'm not a big fan of mushrooms. I added chopped onions and garlic and served with fettuccine in sun-dried tomato alfredo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Moneek Graves"
},
"reviewBody": "It's great, best of all I had all the ingredients in my cabinet and it tastes wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aja"
},
"reviewBody": "This is a good recipe but it does need a bit of help. Definately add a cup of chopped onion and a couple cloves of minced garlic to the drippings before you add the wine. I felt the need to add some worstechire and beef broth to the sauce as well to give it a more rich flavor. Let the sauce reduce adequately before you add the meat back, so that the meat doesn't over cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayko "
},
"reviewBody": "I was really craving steak and I found this recipe. If you find cooking steak at home a little daunting like I do, this recipe is so easy and practically fool proof. The flat iron cut is tender and much less expensive than the ribeye and New York cuts. I bought a 16 oz steak that ranged in thickness from 0.50\" to just under 1.0\" which I cut it into 4 pcs. I followed the rub recipe exactly and didn't change the quantities for my larger cut &amp; there was still plenty of rub. I only swapped out fresh garlic for the powder. I cooked the steak 2 min on each side. This left the thinnest piece medium-rare in the middle and the thickest piece with a cool center. When I returned the steaks to the wine sauce, I cooked them for 2:30 on each side. I used an oil splatter shield too. While this was happening, I steamed a bag of frozen green beans in the microwave so that everything was done at the same time. I give the flavour of the steak 4 stars, the 5th star is for being quick 'n' easy. It smells wonderful while cooking and I'd serve it to guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really great recipe. The rub was fantastic. Mine didn't have any sauce at the end, but I only had crimini mushrooms on hand, so maybe they didn't release as much moisture. Anyway, it didn't seem to need the sauce as the whole thing was very flavorful. I also threw in a few slices of onion with the mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Courtney"
},
"reviewBody": "I used all the ingredients in this recipe except the mushrooms. My husband is allergic. I never cool steak because I am always afraid of messing it up. However, the steaks came out really nice. I didn't use flat-iron steaks either. I don't know what they are. I used whatever type of steak I had. I also cooked the steaks longer than required because we like ours well-done. This is a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vin"
},
"reviewBody": "Not as flavorful as I expected, but everyone loved it. Was fun to sear it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenna_rose"
},
"reviewBody": "Simple to make and absolutely delicious! I used a cheaper cut chuck roast, so I marinated it in the wine (a pinot noir) for a few hours to help make it tender. I made some small substitutions (reg spicy mustard instead of dry, and curry seasoning instead of paprika) since I was out of some spices, doubled the cayenne pepper for some extra bite and used regular button mushroom. Although I'm sure the flavor would be even more spectacular with portabellas and a better cut of steak, even with cheap ingredients this was superb. I served it with vegetable stir-fry (potato, broccoli, squash, zucchini, diced red pepper and onion with ginger and peanut oil) and garlic bread with mozzarella. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "irisheyes_14"
},
"reviewBody": "It was okay. I don't know if I cooked it wrong, but the steak wasn't very flavorful. Usually I love wine and mushroom sauces, but this one didn't do anything for me, too bland. I'll try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne C"
},
"reviewBody": "This was an excellent steak recipe. The only thing I did differently was after rubbing the spice mixture all over the steak, I put it in a plastic bag and added about 1/4 - 1/2 cup balsamic vinegar since I thought it needed some acidity for the marinade. I marinated for 3 hours. It was delicious and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I cut my steaks off a large chuck roast (as these were on sale this week). The marinade for this recipe was fabulous! I didn't have any fresh or dried thyme, so I used 2 teaspoons fresh flat parsley, and 1/2 teaspoon dried oregano. I couldn't find my dried mustard (who knows?) so I used about 1 teaspoon yellow mustard instead. Because I was serving children, and a husband who aren't fond of too much garlic, I omitted the minced garlic at the end. Since the grill is covered with snow, I used a grill pan on the stove, and lightly coated the pan with olive oil. I can't wait to use this recipe for marinade on a better cut of steak, as it is, it turned inexpensive meat into delicious meat! I served atop fresh spinach leaves, tossed lightly with olive oil, garlic salt, freshly ground pepper, sliced tomatoes, and a squirt of fresh lemon juice. I served oven roasted russet potatoes (in onion soup mix, olive oil, garlic salt, parsley and pepper). Husband and children loved it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leah"
},
"reviewBody": "Excellent! Steak was so moist, and cooked just right (between medium-rare and medium) when I followed the reciped timing exactly. Yayyy! I added garlic and shallots when I added the wine. The flavour was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony W"
},
"reviewBody": "This is a great way to make a steak that is more than just throwing it on the grill with garlic and pepper. I'd recommend leaving the salt out of the dish and putting a dash of Worchestershire in the rub. Also, the steak can be cooked in less olive oil. I cooked fresh chopped garlic and shallots in the meat drippings before adding the wine to make the reduction. Excellent recipe and the mushrooms really grab the flavor of the meat and wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anatani0ne"
},
"reviewBody": "Such an amazingly successful and forgiving recipe. If you'd like to adjust this recipe for someone who doesn't like alcohol, just substitute the wine with half that amount of water. I served the steaks with a pasta that had fresh spinach, sundried tomato and a simple white sauce barely sprinkled with fresh parmesean. Check out White Sauce SUBMITTED BY: CJO on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Parks"
},
"reviewBody": "This was soooo great! Tasted like a dinner we'd order in a nice restaurant and pay a pretty penny for. We were just saying that we needed to use mushrooms in the fridge prior to them spoiling in the next couple of days, then found this recipe. My husband cooked it in no time and we had it with a great salad. Really hit the spot, thanks so much for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lala"
},
"reviewBody": "It helps to know that a 'flat iron' steak is cut from a top blade roast, and can be prepared by your butcher if you don't see it in the meat case.\nFlat Iron Steak"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/180325/easy-flat-iron-steak-in-wine-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17641/meat-and-poultry/beef/steaks/flat-iron-steak/",
"name": "Flat Iron Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/180325/easy-flat-iron-steak-in-wine-sauce/",
"name": "Easy Flat Iron Steak in Wine Sauce"
}
}
]
}
}
, "about": [
]
}
]