				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Tiramisu"
,"datePublished": "2000-10-25T05:02:52.000-04:00"
,"dateModified": "2022-07-14T16:41:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kallista"
,"url": "https://www.allrecipes.com/cook/258650"
}
]
,"description": "For this easy tiramisu, mascarpone is sweetened with sugar and vanilla and made richer with egg yolks, then layered with coffee soaked ladyfingers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/viWOoxfDHfeteGCo_Xw2f--IFaU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/476708-203ac0494dfe4171b95e167206a6057b.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Tiramisu"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "112"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "406 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "252 mg"
,"fiberContent": "1 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "93 mg"
,"sugarContent": "9 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 egg yolks",
"0.25 cup white sugar",
"2 teaspoons vanilla extract",
"1.125 cups mascarpone cheese",
"24 ladyfingers",
"1.5 cups brewed coffee",
"1 tablespoon unsweetened cocoa powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, beat yolks, sugar, and vanilla until smooth and light yellow. Fold mascarpone into yolk mixture. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Dip ladyfingers briefly in coffee and arrange 12 of them in the bottom of an 8x8-inch dish. Spread half the mascarpone mixture over ladyfingers. Repeat with remaining ladyfingers and mascarpone. Cover and chill 1 hour. Sprinkle with cocoa just before serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mona Mitchell"
},
"reviewBody": "It is Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances"
},
"reviewBody": "I used Lotus Biscoff cookies instead of Ladyfingers...delicious....a product of Belgium...and I like whip cream...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apikulinski"
},
"reviewBody": "Super easy! Don't soak the lady fingers, dip them quickly! I didn't have enough mascarpone to i added equal portion of cream cheese and it was fabulous. I would double the recipe next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "datura_jade"
},
"reviewBody": "I am so disappointed. The mascarpone mixture was so runny. I was going to present this to a friend but am going to have to go to the store and get a replacement. This cannot be fixed. Waste of money and time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AliceDavis"
},
"reviewBody": "My family raved about it...I subbed frozen pound cake (thawed) and made the tiramisu with layers of cubed cake, sweetened marsapone cheese, whipped cream, and powdered cocoa in a trifle dish. Made a nice presentation for Christmas Day dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cindylouwho"
},
"reviewBody": "I added some whipped cream as suggested by another user, but I think 1/2 cup of whipping cream would have been enough. I also added 2T of kalua and thought that was delicious. Next time I'll brush the ladyfingers with espresso. Dunking them in coffee almost dissolved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jucely Salgueiro"
},
"reviewBody": "As the title suggests, it was definitely easy to make! This is my boyfriend 's favorite dessert and when he ate it, he said it was even better than the ones he's had at restaurants. Making it again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Sussmeier"
},
"reviewBody": "I left out the eggs because I do not eat them and it still came out fabulous!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginie C."
},
"reviewBody": "Very easy and delicious... I will double the recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beebee"
},
"reviewBody": "I tripled the recipe, used a trifle bowl , placed ladyfingers standing around the sides and bottom, poured in my filling and layered to the top. Whipped a heavy cream for the top, flavored with vanilla and coffee liquor. I placed a wreath stencil in the middle and dusted the cocoa powder. I let that set for a couple og moments before lifting the stincil and it seems to adhere without smearing. I had a pack of marzipan so I tinted a small amount green and a small amount red and cut out small holly leaves and berries to lay on the wreath for a little pop of color for Christmas. You could use fondant or gumpaste but the almond of the marzipan just seemed a natural. This was certainly a last minute \"why not\" and any stincil or none at all works fine.\nThe only other change I made was adding 1 Tbsp of coffee liquor to the brewed coffee that I dipped the ladyfingers in. I also soaked the bottom layer a bit more. I planned to take a photo but forgot to do it when I first made it and when I went in the dining room later to take one, it was almost gone. I put a little \"score card\" by the new dishes particularly as to whether it should be a regular Christmas Guest. That way I can determine things I may need to eliminate or add. This one had all checks plus a couple \"regular all the time guest\" remarks. Hadn't made this in years and years and this recipe was so much easier than others I have made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Kurgan"
},
"reviewBody": "I sprinkled coco between the layers also"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Admyraa"
},
"reviewBody": "\"It's the best dessert you have ever made!\" Claims the husband! Really easy and quick dessert.. Tastes much better if left overnight! Thanks for this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Musette Caing"
},
"reviewBody": "I made this \"mostly\" as directed, however, after having first read MOST of the comments:\n1) I used the 8x8 pan\n2) My husband added 2 capfuls of rum\n3) I did as suggested and BARELY DIPPED the lady fingers into the coffee. I mean I QUICKLY dipped only one side to prevent sogginess\n4) I was worried about the egg/cheese/sugar mixture so I made sure I had cool whip on hand just in case. I ended up adding about 1/4 cup, just so that it wasn't so runny.\nBut that's all I did. It was so absolutely perfect, my kids didn't believe I made it! Will DEFINITELY make this again! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Merna2000"
},
"reviewBody": "This recipe would be much improved by beating the egg whites to a nice stiff peak and folding them into the cheese mixture. It lightens it and reduces the sweetness to a delicious richness without sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Morabito"
},
"reviewBody": "I come from a big Italian family and they never compliment anyone's dessert because Grandmas was always better. I made it for Christmas and everyone loved it. I too added whipping cream to the cheese mixture and it was delicious. I will be making this again maybe using expresso instead of coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookielady106"
},
"reviewBody": "This was amazing. I bought the soft ladyfingers by mistake so I gave just the tops a quick dip in the coffee. As other cooks suggested I also whipped a pint of heavy whipping cream and added a couple shots of Bailey's to it--that was the secret ingredient. We combined the egg yolk sugar vanilla mix to the whipped cream and layered the fingers and cream until we ran out. I used an 8x8 pan and got 3 layers. Topped it off by shaving a dark chocolate bar on top with a sprinkling of Trader Joes hot cocoa mix. Chilled it overnight and had it for dessert after dinner. Best part was the amazing taste and it was not soggy at all. Perfect texture and taste. And way easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaliyah"
},
"reviewBody": "I loved this recipe it was super easy for me it served about 7-8 people make sure you do thin layers of the marscapone mixture also the lady fingers peel easy when you are spreading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Willow14"
},
"reviewBody": "An absolutely insulting \"version\" of traditional \"Tiramisu\"...a sloppy mess to look at and a health hazard to consume! This tastes like raw eggs and has the texture of slime!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Boyer"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "haley"
},
"reviewBody": "It wasn't as fluffy as I expected, but it still tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookworm"
},
"reviewBody": "Delicious! one thing though, I tried dipping my ladyfingers into the coffee, but they got too soggy, so i just brushed the coffee onto the cookies. Worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bessy988"
},
"reviewBody": "kudos to Juliecc, her revisions helped make my tiramisu come out amazing!! i'm giving it four because of the revisions but it came out great!! super easy to do and i think the longer you keep it in the fridge the better, the flavors combine more and more and it tastes awesome!!. thanks for the recipe will have to do it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wisery"
},
"reviewBody": "The overall flavor of the tiramisu was really delicious, though the first layer of ladyfingers absorbed nearly all the coffee, which made the bottom very soggy. If I make this again, I would definitely just brush the ladyfingers with a little coffee; they're way too absorbent for dipping! Other than that, I just wish it made more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "shir"
},
"reviewBody": "I found I needed to use more cheese than the recipe said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sparky97056"
},
"reviewBody": "Very easy to put together after tracking down ingredients! I dipped the ladyfingers in Kahlua, which took care of both the coffee flavor and liquor aspect. I did have trouble folding in mascarpone, so used paddle on my kitchen aid at low speed (maybe next time I will beat mascarpone fluffy first?). Also, I added layers of whipped cream on top of the mascarpone mixture layers. My husband and guests loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "markymarc12"
},
"reviewBody": "a refreshing desert! easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veronica Reis"
},
"reviewBody": "I just made this and by far this has been the easiest recipe ever for Tiramisu. I have made many in the past and this has been a great experience. It's sitting in the fridge let's see what the taste is like. Can't wait! I'll post sa review and rate the recipe. I forgot to mention I did leave out the liquor that others suggested.\n\nJust tried it and I really love it. I didn't soak the biscuits for long so it turned out great! Saving this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen D."
},
"reviewBody": "Brava, Kallista! My 2 best friends and I just spent 2 weeks in Italy, and this is EXACTLY how one of our Italian friends showed us how to make tiramisu. I prefer tiramisu this way, without the heavy cream-- the purpose of adding the whipped heavy cream is to give the mascarpone mixture a fluffier texture, but personally I prefer my desserts denser and richer, and I like to keep as much of the amazing mascarpone flavor as possible. STUPENDO questo tiramisu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t_kaiser"
},
"reviewBody": "It is easier and cheaper to make the cheese your self. There is a recipe on here for easy Mascarpone. I suggest using that instead. Also there is a recipe on here to make the ladyfingers in which I did as well....also easy and cheap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karimloo"
},
"reviewBody": "this recepie was really easy and perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msimps14"
},
"reviewBody": "I've eaten a lot of tiramisu, but this is definitely the best tiramisu I've had. I chose this recipe because I forgot to get half and half and this was the only recipe that didn't use any. I was so skeptical while making this-I didn't know if I beat the eggs long enough and I was worried the filling was too bland. But once it all came together it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "taramssip"
},
"reviewBody": "Super easy, but doesn't make very much! You'll definitely want to double up. I had a hard time \"folding\" the mascarpone, so I used a hand-held blender. Did the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bluebiker"
},
"reviewBody": "After reading other reviews, I modified this recipe by substantially reducing the amount of coffee and increasing the filling. I used about 1/3 cup strong coffee and brushed it on rather than dipping. I used an 8 oz container of mascarpone cheese and an 8 oz package of neufchatel cheese. I decided to make my own base for the tiramisu and used a ladyfinger recipe on this site as my starting point. Rather than making the batter into fingers, I made two 8\" x 8\" sponge cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bhuns79"
},
"reviewBody": "To prevent the ladyfingers from becoming too soggy, I just spooned some coffee over top and that was plenty! I also used more mascarpone cheese than the recipe indicated to help make it thicker. Overall this was a very quick and easy recipe that I will use again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mtarrowgirl"
},
"reviewBody": "The title says it all: Easy tiramisu. I recommend doubling the filling, using the proportions listed isn't enough, it would make the ladyfingers overwhelming. I also had to make my own mascarpone substitute, the taste was slightly different but just as delicious. I would also suggest sweetening the coffee with sugar or sugar substitute before dipping the cookies, especially if you plan on serving the same day. The bitterness of the coffee can be overwhelming to some. The longer you keep it in the fridge, the better. If possible, make it the day before. It is MUCH better the next day. The flavors meld so much more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dorothy"
},
"reviewBody": "This looked so bad when I got done I was afraid to eat it. I felt really bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tira Misu"
},
"reviewBody": "made this tonight for my boyfriend and he loved it! doubled the recipe like others suggested and was able to get 3 layers of ladyfingers covered (used an 8x8 pan)! i couldn't find any mascarpone cheese so i followed someone's advice and used cream cheese, heavy whipping cream and sugar. also, instead of dipping the lady fingers i spooned 2 tablespoons of a coffee/rum mix over them as someone suggested and totally avoided the whole soggy problem. will definitely use this recipe again. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "naina"
},
"reviewBody": "My cheese mixture was SO runny. I dunno how this can work without a thickening agent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "noha"
},
"reviewBody": "quite a good and easy recipe indeed. Coffee is what makes it best but make sure not to soak in your lady fingers for too long. a quick dip is more than enough. Also make sure that your coffee is cold and sweetned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jny0108@yahoocom"
},
"reviewBody": "SOOOOOO GOOD! I did add a little whip cream (heavy cream, confectioners sugar and vanilla) on top because it didn't make enough filling and I only soaked the lady fingers in the coffee for a second on each side. It's one of my favorite desserts and so easy. I do reccomend to let it sit in fridge for 2 hours before you dig in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "SOOOOOO GOOD! I did add a little whip cream (heavy cream, confectioners sugar and vanilla) on top because it didn't make enough filling and I only soaked the lady fingers in the coffee for a second on each side. It's one of my favorite desserts and so easy. I do reccomend to let it sit in fridge for 2 hours before you dig in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cdelemos"
},
"reviewBody": "A seemingly complicated dessert made easy! I couldn't believe how simple and delicious this turned out. I added some sliced strawberries to the top as suggested by one of the photos and it was a great touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I would give it 5 stars. I have made it twice now. Some hints I have learned may be helpful for anyone who is finding the wet bottom. Take a look at your sponge cakes before you dump all the coffee in. When i used delicate lady fingers from my bakery the first time, i didnt need all the coffee. This time I used a white angel food cake block I picked up by the strawberries in the grocery store. It was much more dense and actually needed all the moisture. I layered it in with the sponge on the bottom, kept it a little drier so it could come out nice on plates. The middle layer of the dish i soaked really well with coffee and Kaluah, then the top layer I soaked pretty good with only kaluah... with the base layer being a little bit less wet, i didnt have the extra laquid. Also I found that if I use the pound cake, I definately need it to set overnight so the cake absorbs all of the flavors from the marscapone cream mix. With the lady fingers, it was perfect in an hour or two. Either way, its amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dizemini"
},
"reviewBody": "I would give it 5 stars. I have made it twice now. Some hints I have learned may be helpful for anyone who is finding the wet bottom. Take a look at your sponge cakes before you dump all the coffee in. When i used delicate lady fingers from my bakery the first time, i didnt need all the coffee. This time I used a white angel food cake block I picked up by the strawberries in the grocery store. It was much more dense and actually needed all the moisture. I layered it in with the sponge on the bottom, kept it a little drier so it could come out nice on plates. The middle layer of the dish i soaked really well with coffee and Kaluah, then the top layer I soaked pretty good with only kaluah... with the base layer being a little bit less wet, i didnt have the extra laquid. Also I found that if I use the pound cake, I definately need it to set overnight so the cake absorbs all of the flavors from the marscapone cream mix. With the lady fingers, it was perfect in an hour or two. Either way, its amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "depewcd"
},
"reviewBody": "Very good recipe. My boyfriend and I made it for my stepmom's birthday since she's a tiramisu fanatic. We were a little concerned about how it would turn out and if she'd like it since she's basically the tiramisu expert. But it all turned out excellent. We did make a few changes to thicken the sauce. We ended up adding a small amount of agar agar, but corn starch or making a roux would work as well. We also wanted to make it more chocolaty, so we added about 1/4 cup of Kahlua and 1/2 cup of unsweetened cocoa powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brownvneyes"
},
"reviewBody": "amazing! i've made tiramisu before but didn't save the recipe so i needed something quick to make but yummy to eat! and this was IT! thank you for sharing. i will definitely keep this recipe =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This was an excellent recipe, I took others advice from reviews and doubled the mascarpone cheese filling. However, I couldn't find mascarpone cheese nor ladyfingers, where I live. For the mascarpone cheese, I used 8oz. cream cheese 1/4 C. heavy whipping cream and 1/4 Sugar, I thought it was great, but I've never had mascarpone cheese, so I will attempt to find and and try. I also made my lady fingers from scratch from a recipe I found here on All Recipes. It turned out fantastic, the girls at work LOVED it. I'm making this Sunday for Mother's Day for my family...yum...yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cubbyhouse"
},
"reviewBody": "I tried the recipe as is first - it was great. A friend suggested lightly folding in the egg whites. It was sensational."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ella y El"
},
"reviewBody": "Very easy to make (my first tiramisu making experience). My Girlfriend really liked it. Followed the recipe. Will make it again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimejorg"
},
"reviewBody": "This is a FABULOUS recipe, and so easy! It turned out perfect for me, but I took the advice of others so it wouldn't turn out runny. Only dip the lady fingers in the coffee for 1 second per side. That is plenty, any longer and it will turn to complete mush. I know some people suggested using a pastry brush, but that doesn't add enough coffee. I also let it sit overnight as so many said it tasted better the next day. It was a complete hit and everyone is asking for the recipe. Very Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Braxton Howard"
},
"reviewBody": "Made this for my mother's birthday. Turned out well even though I am a complete novice. Thank You"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "very good , the longer you leave it in the fridge the better it is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "simon"
},
"reviewBody": "I have two suggestions to prevent the cheese mixture becomes too runny. Make sure you mix the egg yolk with sugar until you can see some ribbon shape forming. If the Mascarpone cheese is too fresh, it will make the mixture very runny. Try to dehydrate it, by leaving it in an open container inside the fridge for 2 days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I took Elenara's advice for using heavy whipping cream to thicken the mascarpone batter. The taste is fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "makeupgirl"
},
"reviewBody": "For never making Tiramisu before, this recipe helped me look like a pro. A co-worker born in Italy (and a Tiramisu fanatic) raved on and on about it, what more can I say but thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Mommy"
},
"reviewBody": "I used this recipe yesterday but substituted the lady fingers for twinkies and sprinkled cocoa powder on top. It was excellent!!! I think you could use cream cheese instead of marscapone to save money and it would still taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joc"
},
"reviewBody": "So easy to make, it's actually kind of ridiculous how good it turns out! The only change I made was to add some alcohol to the coffe I dipped the lady fingers in. I had rum, so that's what I used,and it turned out quite well. Thanks for the easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jen Sumpter"
},
"reviewBody": "This was the weirdest runny pudding type thing I've ever seen. I've made it twice, and both times, it was just runny and disgusting. I tried more sugar, and more cheese, and it also seemed to have too much vanilla. I just brushed the lady fingers with coffee as the recipe called for waaaaaay to much .. but still, runny, gross mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieCC"
},
"reviewBody": "This recipe is great! Like other reviewers, I made changes based on the unavailablity of lady fingers in my area, and with the filling amount and process.\n\nI used one, store bought angel food cake in place of the lady fingers. I also used a 9X13 pan. Here are the amounts of other ingredients I used:\n\n5 egg yolks\n1/3 cup white sugar\n3 Tbsp vanilla extract\n16 oz Marscarpone cheese\n1 angel food cake\n1 cup strongly brewed instant coffee\n1.5 Tbsp cocoa powder\n\nI placed slices of angel food cake in the pan, then spooned 2 teaspoons of coffee per piece over the bottom layer rather than dipping. Then I put a layer of filling, and then a layer of cake, this time with 3 teaspoons per piece. It worked out wonderfully and was not soggy at all.\n\nAs a former health inspector, I was concerned about using raw eggs, but there's enough sugar in the mix to not allow bacterial growth. I also made sure to promptly refrigerate any remaining cake.\n\nI especially love this recipe because I wanted tiramisu without the alcohol. I will definetly make this again. I may substitute the marscarpone with neufchatel cheese, as I wouldn't mind it tasting a bit like cheesecake, and it would make it less expensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gus"
},
"reviewBody": "my very first time elaborating tiramisu. it´s really easy although i've followed some of the reviews suggestions, such as double the filling amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elenara"
},
"reviewBody": "first i changed the servings to yeild 11 servings. this made enough cream for my 8x11 baking dish. I used enough lady fingers to fill the dish. (appx 30?). i followed the recipe exactly with all the ingredients, but i also added a secret ingredient to the mascarpone mixture. i used a pint of heavy whipping cream, beat it seperately to make my own whipped cream and folded it into the mascarpone mix together with allt he other ingredients. this will make the consistency of the cream JUST RIGHT (so its never runny) without changing the taste. \nthen, to solve your problems of the lady fingers breaking.... use VERY COLD coffee. i buy a large cup of black coffee\n WITH 2 SUGARS IN IT and refrigerate it for a few hours. then i dunk the lady fingers very quick on both sides but give them no time to soak. \ni serve the next day. IN-FREAKING-CREDIBLE!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Philline"
},
"reviewBody": "At first I soaked the ladyfingers in the coffee and it broke on me. So I decided to just use a pastry brush instead. I was so afraid of getting it too mushy so I ended up not putting enough coffee. Next time I will probably use stronger coffee. Otherwise, very easy to make and really yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kelcampbell"
},
"reviewBody": "This was so yummy - and SO easy to make! I followed the directions exactly, but I did add about 1/4 cup of Kahlua to the coffee for a little added flavour. It was really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NMG"
},
"reviewBody": "I made this for my girlfriend, its her favorite dessert, and she just loved it! Its better to brush the ladyfingers with a pastry brush so it doesn’t become runny! Easy, fast and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really enjoyed this. I found that when i dipped the ladyfingers into the coffee they would break though. I added some shredded dark chocoltae ontop of the pudding at the end aswell as the cocoa powder and that tasted really fab!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "This was really good, not restaurant quality, but close enough. It's much better the next day after the flavors have settled into the ladyfingers. I added a little coffee liquor to the coffee before soaking the lady fingers and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vlui"
},
"reviewBody": "I made this recipe before and it turned out excellent. However, when I did it this time, it turned out to be very soggy to the point that I have liquid sipping out in the pan soaking the leftovers. It happened twice this past 2 weeks and I could not understand what happened.\nAlso, the recipe did not mentioned anything about the eggwhite, but I went ahead and beat eggwhites to stiff peak with 1 teaspoon of sugar and then fold into the cheese mixture. That should not have affected the result....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I liked this recipe because it was easy, and easy to follow the recipe. It went together like a dream. But to make it work for my taste I changed the following:\r\n\r\nI used 36 cookies in an 8 x 12 pyrex pan. They fit perfectly...except I had to trim three cookies on each layer. (Save to dip in the leftover coffee after your hard work!)\r\n\r\nI doubled the filling recipe, because I am a filling girl!\r\n\r\nI beat the egg white to a stiff peak with a pinch of sugar and gently folded into the mascarpone mixture.\r\n\r\nAdded 1/4 cup of Filliers coffee liquour.\r\n\r\nIt was PERFECT. Just dip your cookies quickly. Also, I think it is good to beat your mascarpone just to make it smooth before folding into the yolk. \r\nYIPPEE. It was goood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very similar to my own recipe which is always a hit. Would suggest 1 desert spoon of sugar to 1 egg yolk and 2 egg yolks to 250gms mascapone. With regard to recipe being runny, on a few occasions I have had the same problem. On one of these times I made this for a dinner party and was really runny. I threw it out and rushed to the store to buy more ingredients. Next one was fine! Think it might have something to do with the mascapone?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ADACHIC"
},
"reviewBody": "This was a great recipe! I couldn't find any lady fingers, so I substituted sugar free pepridge farm milano cookies (since my stepdad is diabetic). I also replaced the white sugar with a sugar substitute. And then, I couldn't find mascarpone cheese, so I used the recipe using cream cheese (it's called 'mascarpone substitute' here, I believe).\r\n\r\nanyways, although mine was a little cheesecake like, it was still delicious even as a diabetic recipe... except I did use regular whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SUZIE HAYES"
},
"reviewBody": "excellent!!! No left overs on this one! thing is.. the lady fingers got a bit soggy, but the recipe mixed like a dream! Being american living in the UK w/ my british family, it's like pulling TEETH to get them to try a true, well rounded Italian meal, but i recieved.. 10 marks out of 10 on that nite..Cheers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good, really delicious!! Really awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ALLY601"
},
"reviewBody": "Very horrible recipe, I thought with all the good reviews it would be good. The ladyfingers were soaked with coffee making the dessert very juicy. I would suggest just brushing the ladyfingers with a coffee-soaked pastry brush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CATHGREAT"
},
"reviewBody": "I gave this to someone as a gift. They loved it. It was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DORITAC"
},
"reviewBody": "So easy and so good! I used super strong coffee and added some Bailey's too. The trick is to be sure not to get the ladyfinger's soggy, and TRY to wait till the next day to have it, it's much better then. Oh, and warn your guests that this contains uncooked egg!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Bergeron Soto"
},
"reviewBody": "I have made tiramisu several times, it is my husband's favorite dessert. I must admit it seemed runny, but everyone at a party I made it for said it was the best that they had every had. My husband requests it often and it was SO Easy!! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DOGLOVER22"
},
"reviewBody": "I had a few issues with this recipe. First of all, I did follow others suggestions and made twice the cheese filling. The filling was very thin even after adding an additional 1/4 cup of cheese. After sitting in the fridge for 24 hours, it did finally firm up enough to where you could cut into it and have a formed piece instead of the filling running everywhere. Second, if you are going to use an 8x8 pan as the recipe calls for, you should not need all 24 lady fingers or to double the filling. My 8x8 pan would hold 12 lady fingers and the orginal quantity of filling. Thinking in advance, I did a dry run with the cookies by placing them in the 8x8 pan before I even started the rest of the recipe. I ended up using an 11x7 pan and I thought it was the perfect size. Because the filling was so thin, the cheese mixture didn't do a very goo job of actualy forming a seperate layer. Overall, the taste was fine, but if I make another tiramisu, I will try another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is sooo easy to make! it was my first cake i ever attempted n everyone was impressed. Doubling the filling was not necessary for me as a thin layer over the ladysfingers was enough. One can dip the first layer of ladysfingers into the coffee lightning to make your 'sponge' layer drier and more cake-like. Added liberal amounts of Baileys Irish Cream into the coffee, tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was very easy. I liked that you didn't have to cook it. I beat and fold the egg whites into mine to give it a lighter texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I recently made this for my boyfreind, he loves tiramisu. It was very easy and fast to make. I could not find lady fingers so I used Twinkies instead! They turned out great. He ate half the pan that night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BitchPuddin"
},
"reviewBody": "My husband and I just came back from a cruise where they served the most wonderful tiramisu. I made this recipe for his birthday, and it tastes even BETTER than the cruise ship's recipe. I was so pleased with this! You MUST double the filling amount, as others have said. I used Milano cookies instead of ladyfingers, too. Mascarpone is hard to find... it's usually in the \"fancy cheese\" section of the grocery store, by the deli. Thanks, Kallista, for this GREAT dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAWNCHURA"
},
"reviewBody": "The hardest part was finding the mascarpone cheese. It's expensive, but worth it. I found it at an Italian bakery priced much less than my regular grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was the worst I've ever tried and tasted. I wasted the mascarpone on it, it wasn't enough to fill the platter, plus it was a very heavy tasting desert, it went down like a ton of bricks. It as very upsetting that it was so awful considering that I had guests over and had nothing else to serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NOELLETHEDIVA"
},
"reviewBody": "This is one of the most delicious no bake, easy recipes there are. The only reason I had to give it 4 stars is because I had to make a few changes to make it even better-1st change is double the filling amount. 2nd change is to dip the ladyfingers (make sure they are not soft but hard cookie ones) in a mixture that is 2 parts coffee, 1 part frangelico hazelnut liquor. Then i added some whipped cream on top. This is excellent and everyone that tries it loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy alright, but not cheap! I had to go to a specialty store to buy the cheese, and while I was there I went ahead and bought the lady fingers,cocoa,and coffee. Well, the sales guy \"pressured\" me into buying \"their\" tiramisu, so I could \"compare\", and I did not knowing the price. Well, time to check out and I spent $45. So now I have a $45 batch of tiramisu in the fridge that is not half bad but If I look at one more piece, I'll spit ladyfingers! LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OANTLE"
},
"reviewBody": "Excellent. I used a layer of chocolate cookies on the bottom and vanilla cookies for the second layer. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it! Only regret was not following the other reviewers advice on making double the portion, the mixture only cover 3/4 of way, so I had the top layer of cookies sticking out. I also think that 1 hour is not long enough, as great as they were on the first night, they were even better the next!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I always get compliments EVERYTIME I make it. The ingredients are simple, easy to make, &amp; still tastes like cafe's tiramisu. Only MUCH cheaper. ^_^"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was fabulous! I'll be making this one again for sure. Thanks =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Futuregirlzone"
},
"reviewBody": "This tiramisu was very authentic to be so quick. I used an 8x8 pan as the recipe stated but the recipe did not even fill the pan to the top (only about half way). I would double the recipe in the future and be careful when dipping the cookies in the coffee, mine turned out soggy. I also grated a Hershey's chocolate bar to go on top instead of cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was great, quick easy and full of flavour. I personally did not use 24 biscuits and I added 4-5 tablespoons coffee liquoir to the liquid, that was good. If the dish you use is a bit bigger then go easy on the mascapone mixture I nearly ran out. With the biscuits I was not sure how long to dip them in, 1 second each side was good enough. I think unsweetened chocolate was better than cocoa as well. I also found that it tasted better the next day. Good Luck with this superb recipe, an instant classic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "surfinpure"
},
"reviewBody": "The taste is good, but watch out that you don't add too much coffee -- mine turned out soggy. Mascarpone is pretty hard to find, so I used some ricotta and sour cream to substitute. The family liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband is an tiramisu lover- very picky- and he loved this. When I brought it over to a friends house, no one had heard of it but loved it when they tried it. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy and lovely when accompanied with a dollap of fresh whipped cream, some shaved chocolate curls and fresh mint on the side !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow! This was not only easy, but it tasted amazing! It's a keeper!!! Thanks Kallista"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's so easy to make and taste really good! Good for beginners!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TMoore"
},
"reviewBody": "This was surprisingly wonderful! We couldn't find ladyfingers at our grocery store, so used Milan cookies - so delicious! A little chocolate goes a long way in my book! So easy and great for after a big meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I found this recipie easy to prepare in a dessert pinch. I added whipped cream to the top and shaved some unsweetened chocolate shavings. It was also good because one of my guests was a nursing mother in which case any alcohol was not appropriate. ( I figured that the coffee was so minimal, it would be ok.) I was unsure how long to leave the ladyfingers in the coffee. Just a swipe through the bowl was good enough. Also good for inexperienced cooks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RACHEL V."
},
"reviewBody": "very quick and easy but needs either a little more chocolate or some liquour.\r\nMy family was very impressed."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23143/easy-tiramisu/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
"name": "Specialty Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/375/desserts/specialty-desserts/tiramisu/",
"name": "Tiramisu Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23143/easy-tiramisu/",
"name": "Easy Tiramisu"
}
}
]
}
}
, "about": [
]
}
]