				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Chicken Cacciatore"
,"datePublished": "2000-02-21T19:59:18.000-05:00"
,"dateModified": "2022-10-23T12:52:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sara"
,"url": "https://www.allrecipes.com/cook/1744"
}
]
,"description": "A classic chicken cacciatore recipe that is easy and comforting. Chicken simmered with vegetables and tomatoes in a fragrant sauce with oregano."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/A6uVIaqoGvdvKhs6Ko34rNmxYww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9000241-c980a11390c944c9b4143cab6c9d53b5.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Chicken Cacciatore"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "87"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "240 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "119 mg"
,"fiberContent": "3 g"
,"proteinContent": "38 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "221 mg"
,"sugarContent": "4 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.33329999446869 cup chopped onion",
"0.33329999446869 cup chopped green bell pepper",
"1 clove garlic, chopped",
"0.75 pound chicken meat, cooked and cubed",
"0.5 cup whole peeled tomatoes",
"0.5 cup green beans",
"0.25 teaspoon dried oregano" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sauté onion, bell pepper, and garlic in a large skillet until soft. Add chicken, then stir in tomatoes, beans, and oregano."
} ,{
"@type": "HowToStep"
,"text": "Reduce heat to medium-low and simmer, stirring constantly, for 8 to 10 minutes. Remove from heat and serve hot."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeleazer"
},
"reviewBody": "I added two zucchini and a couple cups of fresh spinach - idea from another post to add spinach- since I didn’t have beans. Also added some red pepper flakes since I love spicy marinara. Added a full can of tomato sauce and a can of stewed tomatoes too, which made it go a lot farther! I only had a yellow pepper so used that and liked the color addition! Served it on brown rice and it was delicious! Would make a great slow cooker recipe. This was even better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "This recipe was so delicious! I served it with Angel Hair Pasta, and I added in some mushrooms! It was even better re-heated the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Quick and easy. I used stewed tomatoes and a 6oz can of tomato sauce. I also cut up some zucchini I had that needed used. My husband ate it on a baked potato and cleaned to place. When I said it was low carb and low calories he said, I’ll just pretend you didn’t say that and have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dan Kelshaw"
},
"reviewBody": "followed the recipe to a t. Very bland and not worth making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Happy Liver"
},
"reviewBody": "Great recipe, really quick and easy. I doubled all ingredients except the chicken. I added about 1/3 cup of dry sherry during cooking; also before serving, I added about 1/3 cup of chopped fresh parsley. It came out really good, everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Rivera"
},
"reviewBody": "this was my first attempt in making dinner and these instruction were simple and easy to understand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Craig Merchant"
},
"reviewBody": "It was a nice diet dish. It wasn't too specific on the cooking methodology so I poached the chicken, parboiled the fresh green beans, and cooked the rice in stock. Need to kick up the tomato flavor quite a bit and definitely add some salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "This recipe is EXTREMELY easy to make.Served this to my guests for dinner tonight after converting it for 6 servings. We all liked it and even the 3 year old agreed eventually that it was pretty tasty. I didn't have pre-cooked chicken but that's easily worked around by sauteing the chicken pieces first in a little bit of oil. Then add the garlic, onion, green peppers. Fry this a bit more and then add the tomatoes and oregano. Follow recipe after that. Added to my regular rotation already so thank you for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dizzylizzy43"
},
"reviewBody": "This was bland and dry. I will not be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanon K &hearts;"
},
"reviewBody": "I really liked this. I added garlic and italian seasonings. I used asparagus instead of green beans! Quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AcaCandy"
},
"reviewBody": "I couldn't get past the green beans, so I had to omit those. Just didn't seem right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mbouldin"
},
"reviewBody": "Omit the beans and use whole dark meat thighs. Serve with pasta, not rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jesse Camilla"
},
"reviewBody": "Great! One of my favorite thins about this easy chicken cacciatore is the recipe is so easy you can do anything to it and it is still delicious! Swap veggies (we used cut up asparagus instead of green beans, forgot and used the green pepper, so we threw in a zucchini instead! Worked awesome!) Also takes just about any other spices you want to throw in (we put in some fresh basil leave, a little rosemary, mmm) and it REALLY doesn't matter how you cube/cut the chicken since it's already cooked! So good, I will use this recipe over and over! Although at this point, its so easy to wing it that it almost doesn't matter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soccermom"
},
"reviewBody": "I did not change anything and it was a hit in the family. I will definitely make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "Delightful! My only change was removing green beans and adding mushrooms. LOADS of flavor - whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenjen41683"
},
"reviewBody": "super easy and delicious! we ate it over brown rice and it was even better leftover the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kristina"
},
"reviewBody": "My husband really likes this recipe. It is best with rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tspear"
},
"reviewBody": "We made this and used whole frozen green beans and peas and also extra garlic and served it over bow tie noodles and it was delicious, we will definately make this again for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PINKXG1RL"
},
"reviewBody": "I really liked the simplicity of this recipe. All the ingredients are fresh and healthy which makes it even better. I made just a few adjustments: I used 3 cloves of garlic. Replaced the oregano with dried basil. I did not peel my tomatoes, but I used extra ones all chopped up so I can make the dish saucier -- It still was not as saucy as I would have liked so next time, I might add some wine for extra liquid/flavor. The recipe is kind of bland the way it is so I added some salt, pepper and cayenne. Served over white rice. Still not spectacular but good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ryokachibi"
},
"reviewBody": "needed more spices but good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eddie"
},
"reviewBody": "This was good, healthy and very easy to make. I used white wine as suggested and then added some light feta cheese I had left over which added some great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina"
},
"reviewBody": "I add a bit of tomato sauce and cook 4 whole vine ripe tomatoes in it. And time to time I subsitute the green beans for green peppers. It is amazing none the less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Damon Williams"
},
"reviewBody": "Pretty good, and easy. Served it with rice and was satisfied."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dem"
},
"reviewBody": "Fresh green beans did not cook in amount of time suggested, and flavor was not exciting. I'd try it again with mushrooms instead of beans and add a bit more seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jctnact"
},
"reviewBody": "This recipe is very good for being so quick and easy and healthy. One recommendation I have is to not use canned green beans. The texture and taste just does not go well w/ this dish so definitely make this with fresh green beans. Also, I made sure to salt and pepper the dish as well as add some chicken stock to flavor it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherman3825"
},
"reviewBody": "This was very good! It really is easy to make and my picky husband liked it very much. Thanks for the contribution, I've added it to my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alisa Hellman Lansdale"
},
"reviewBody": "This was really pretty good. I added the small can of spaghetti sauce and that added to the thckness of it. I think next time I might add mushrooms to the entire dish with the green beans and maybe some corn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adrina"
},
"reviewBody": "My husband &amp; I loved this. I did make some changes using some previously reviewed suggestions. I used 14.5 oz. can diced tomatoes flavored with garlic, in place of the green beans I halved 4 oz. box small button mushrooms, and I added a small amount of spaghetti sauce. This recipe is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "This was very easy and quick to make, perfect after a busy day. I threw in some yellow pepper along with the green and seasoned meat with some garlic powder and black pepper. I left out the green beens and added can of tomato sauce to make it \"saucier\". Served over noodles with garlic bread...yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MLYIN"
},
"reviewBody": "I'm surprised by how \"straight forward\" the ingredients and cooking steps are. The result of this dish is the true flavor of the combined ingredients - no cream no marinade to hide anything. I'm very pleased with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bexy"
},
"reviewBody": "For a quick after-work meal that doesn't take a lot of time or preparation, this recipe was very good. The only thing I'd change for next time would be to chop up the whole peeled tomatoes before adding them (the whole tomatoes looked big and globby). Maybe this was supposed to be done in the first place (?) because the photo that accompanies this recipe shows the tomatoes chopped-up and not whole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amanda"
},
"reviewBody": "I am always looking for recipes that i can load up the veggies so this was prefect. really yummy the left overs were even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Winnie"
},
"reviewBody": "Simple and delicious! I used 1 Cup of green pepper, 2 cloves of garlic, added a bit of basil and freshly ground black pepper and skipped the onion. Great with rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "Was inspired by a recent episode of Bobby Flay's Throwdown show where he challenged a firehouse cook to make chicken cacciatore. I had never made this before, and this particular recipe is extremly easy and tasy. Served it with dry wide egg noodles. We had absolutely no leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "klp"
},
"reviewBody": "This dish was pretty good though it took me longer than 20min to make. I used packaged chicken and would use home cooked next time as the packaged stuff was rather salty. I also cooked the beans with the onion and green pepper since I like them really soft. I'd probably use chopped stewed tomatoes next time. It was a good healthy meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STEVENJESSX5"
},
"reviewBody": "This was excellent...Than I tried it with sausage (yes I know, then you can't call it \"chicken cacciatore\", but I just wanted to experiment, and it was awesome. I agree with adding mushrooms instead of greenbeans! It was a real crowd pleaser (especially for some super picky children)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bad_Cook"
},
"reviewBody": "I'm a terrible cook, and even I didn't mess this one up! Tasty, healthy, and a great way to sneak a lot of veggies into my meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparks55"
},
"reviewBody": "My family loved this recipe. I am trying to cook healthier meals to help my husband loose weight. This one is a keeper. I didn't have cooked chicken, so I saved time by using frozen chicken tenderlions nuked in the microwave. I broke them up into bit size pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ZeldaSayre"
},
"reviewBody": "My husband made this for me because I had a cold. It came out pretty well, but he noted that the recipe works better as a sauce if you double the listed amount of tomatoes. (I also thought it would be tasty with diced tomatoes, but that's probably just a personal preference.) Yummy stuff, though, and quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaylen"
},
"reviewBody": "I made this in a rush before I had work and my fiance had class, it was so fast and I had nearly everything for the recipe already in my house! I loved it and he loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alondra Dallaly"
},
"reviewBody": "This is so easy and so good. If you don't have cooked chicken on hand just cook it with the onion and green peppers. was very pleased with how quickly this came together. I served this on whole wheat spaghetti. It would be great on rice, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Herrod"
},
"reviewBody": "good quick meat, added a little lemon juice and replace the green beans with mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rons recipes"
},
"reviewBody": "I made this using 1/2 can of Italian diced tomatoes and spinach. It was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noel Robinson"
},
"reviewBody": "I thought the recipe needed a little help. To bring out some more flavor I added a little bit of white wine to the sauce and a touch of sugar. I opted not to use green beans and used red pepper instead. I also let it simmer together for quite sometime. My husband and mother-in-law loved it and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jwelch"
},
"reviewBody": "Very good. I ommitted the green beans but added zuccini, carrots, mushrooms and tomato paste as well as a half can of water. I served it over rice and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyJ"
},
"reviewBody": "my husband loved it and my kids (3 toddlers) scraped their plates clean and had seconds. i did as others suggested and added extra garlic. i didn't have whole tomatoes so i used a couple roma tomatoeos and a can of Italian stewed tomatoes with garlic, basil, and oregano. delicious! will have to cook again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Very simple, very tasty. We really enjoyed this! I used about twice as much chicken, a can of diced tomatoes since I was out of fresh, and at least a tablespoon or more of oregano. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RACHELLE"
},
"reviewBody": "This is a great recipe to sneak in vegetables. My somewhat picky eaters devoured this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe!! OK, so green beans are my worst enemy therefore, I just left them out. But the rest was fabulous! I put it over some rice and-so yummy! I added some chicken broth and lots of extra garlic as other reviewers had suggested and it was delicous! Makes great leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BIGOHANA"
},
"reviewBody": "We loved this. I took the advice of others and omitted the green beans but added mushrooms, more garlic, and white wine. We put the dish over linguine and topped it with shredded parmesan. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CatharineMB"
},
"reviewBody": "Fabulous and easy.. I made a few changes. I diced fresh roma tomatoes instead of using canned, used 1 c of chopped onion and 1/2 c chopped pepper. Recipe didn't specify what to sautee so I used Extra Virgin Olive Oil. The fresh veggies made it taste like something straight from the garden. Excellent recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana LaFalcia Cook"
},
"reviewBody": "I really liked this chicken, I added a little white wine to it, and it really helped the flavor. My husband thought it was a bit bland, so I would suggest using more seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mortymort"
},
"reviewBody": "I was a little leary of the green beans in this, but I decided to try it. The dish was a huge hit. I almost triple the amount of garlic, because we are huge garlic fans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "This is an excellent summer dish! Very light and tasty on a hot day! The dish was so easy after a very busy day at work. I will be making this again for sure! My husband is eating it again for lunch! YUM-O!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Run2Eat"
},
"reviewBody": "I loved this recipe. I added a tiny bit of chicken broth for more sauce, used diced tomatoes instead of whole but it was great. My husband even loved it and he is not a big vegetable or whole wheat pasta fan. I served it with whole wheat pasta and the sauce was so good he had seconds! Great recipe,quick and easy. I will use it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Big Daddy"
},
"reviewBody": "OK, I took some of the tips from others, including adding some chicken stock and it wasn't that dry. I don't think I'd make it again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Layne"
},
"reviewBody": "I would give this a 4 however I cooked it for my boyfriend and it was not his thing. He found it blan. I liked it. I added more oregano and threw in some basil. I also added a little white wine which I thought put a nice finish on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a hit with my family. My husband, who dislikes mushrooms and green peppers, really liked it. He cleaned his plate, mushrooms and peppers included. My kids enjoyed it as well. I, like most moms, look for ways to include as many vegetables as I can in every meal. I also omitted the green beans. I used olive oil to saute the onions and garlic and added a can of tomato sauce for added liquid. For added color and veggies I included yellow and red peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CYNDI9"
},
"reviewBody": "This was good, but didn't use green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reeca Pastor"
},
"reviewBody": "This was a very good dish, but I made several changes because it didn't have any liquid ingredients! I sauted the onion and garlic in 2 tbs. olive oil. I used homemade chicken stock a few tbs. at a time throughout to keep it from sticking to the pan (probably 1/2 cup in all). I didn't have green pepper so I used small diced carrot instead (big hit with my youngest!), and used fresh tomato instead of canned. I've never had cacciatore so wasn't sure how it was supposed to taste, but this recipe was a big hit with my girls. I served it over wild rice with a salad on the side. This will definitely be a family favorite! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lschepisi"
},
"reviewBody": "This is perfect if you are searching for low-fat or low-carb recipes. My husband is doing low- carbs and I am doing low-fat/calories. I made these changes: 1 C. each peppers and onions, 14 oz. can of diced tomatoes with juice, 1C. spinach instead of green beans, (the green beans seemed out of place to me). Served mine over rice, his over low-carb pasta. We topped it with Parmesan cheese. We both really enjoyed this but thought it could have been a little \"saucier\". Next time will try adding 1/2 C. chicken broth and 1/2 C. tomato sauce and see if that does the trick, but there definitely will be a next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SEVEN_STOKES"
},
"reviewBody": "This recipe was very good and allowed me the chance to use my tomatoes out of the garden! My kids and husband also liked it, but I will double the tomatoes when I make it again (and add a little salt!) Was great with some parmesan cheese sprinkled on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was the featured chicken dish for last saturday. Thank you for suggesting this recipe, it was excellent and the whole family enjoyed it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17645/easy-chicken-cacciatore/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17553/main-dish/chicken/chicken-cacciatore/",
"name": "Chicken Cacciatore Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17645/easy-chicken-cacciatore/",
"name": "Easy Chicken Cacciatore"
}
}
]
}
}
, "about": [
]
}
]