				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Never Forgotten Guacamole"
,"datePublished": "2000-10-18T11:37:20.000-04:00"
,"dateModified": "2022-07-14T15:45:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JULESKI"
,"url": "https://www.allrecipes.com/cook/187345"
}
]
,"description": "This guacamole has been a hit at our house for years. Great for the Superbowl or any occasion. Sour cream and cream cheese make the guac extra creamy. Spice it up with crushed red pepper."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Szzxj_-mORDmSh32qxfKARlwaPI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1384517-1190445214b74eb3a4e9e86b2e7b2f2e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Never Forgotten Guacamole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "180"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "100 kcal"
,"carbohydrateContent": "4 g"
,"cholesterolContent": "12 mg"
,"fiberContent": "3 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "67 mg"
,"sugarContent": "0 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 avocados - peeled, pitted and diced",
"1 tablespoon sour cream",
"2 (3 ounce) packages cream cheese, softened",
"2 tablespoons salsa",
"1 pinch salt",
"1 dash ground black pepper",
"1 dash garlic salt",
"1 dash onion powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a small bowl, mix together the avocados, sour cream, cream cheese and salsa. Blend to desired consistency."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl mix the salt, pepper, garlic salt and onion powder. Stir into the avocado mixture. Cover and chill in the refrigerator 1/2 hour before serving."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frk040"
},
"reviewBody": "Great recipe - a crowd pleaser at a summer BBQ. As per comments here, I added some minced onion, garlic, and cilantro. More of an avocado dip than a genuine guacamole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I made no changes! Just great guacamole just like it is written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "williamsal22"
},
"reviewBody": "This is the best homemade guacamole I have ever had. Instead of a dash or pinch of seasonings, I used 3/4 teaspoon (tsp) onion powder, 3/4 tsp garlic powder, 3/4 tsp cumin, 3/4 tsp cilantro, chopped onions, salt to taste, and lime juice. I made homemade salsa that is on this website, \"The Best Fresh Tomato salsa\", but added minced garlic. Put the salsa in the fridge for a few hours so the flavors can meld. Then add salsa to the guacamole. Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Adams"
},
"reviewBody": "Great recipe. I took to a gathering last night and everyone thought I’d brought too much. By the end of the night the bowl was scraped clean and everyone wanted the recipe. I did kick it up a bit with Sarrono peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Designerdish"
},
"reviewBody": "Truly exceptional guacamole recipe which I have repeatedly made to rave reviews and repeated requests to make again and again! Thanks ever so for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Lynn"
},
"reviewBody": "I wasn't sure what I would think about the cream cheese in this, but I liked it. It's not for when you want traditional guacamole, but it is a good dip. If you make the full amount of dip, it needs more than a dash of most of the seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harold Ducre"
},
"reviewBody": "absolutely a wonderful recipe for a dip when hosting a party. I substituted fresh french onion dip instead of the sour cream. Delish! Me born and raised from Louisiana , I added drops of Tabasco hot sauce to spice it up a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoyMina7"
},
"reviewBody": "Made as written with the addition of the juice of one lime. YUM! I used all light dairy products too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie Mayer"
},
"reviewBody": "IT wasn’t alittle bland but still very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Fegley"
},
"reviewBody": "I LOVE this guacamole. I've been making this for years and my husband, who doesn't ever try new food or eat any veggies besides lettuce, finally tried it last year and loved it. I always use whipped cream cheese. I've also added 2 oz of diced green chiles, lime juice, 1/2 cup red onion, 3 tbs cilantro, 1 tsp minced garlic and a pinch of cayenne pepper. I might try chipotle peppers or pico de gallo instead of salsa next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natasha Cline"
},
"reviewBody": "As a base, this was a good start. Now to really perk it up, here's what I did-- I know this is meant as a simple recipe but if you have time--- \n\nIncrease avocados to 4. \nAdd 1 tablespoon of olive oil and whip. Will make it smoother from the start.\nSqueeze in 1/2 of a lime juice and bits and pieces if you want. \nthrow in a little cilantro. Perhaps 3 stalks worth of tips/tops. \nDice up 2 Roma tomatoes and stir in last. \nDice up 1/2 of a white vidalia onion and stir in whenever you like. \nPut in 1 tablespoon of crushed, wet jarred garlic. I use an organic brand that is found at Kroger and costs $1.59 \nIncrease the sour cream to 1/4 of a cup.\n\nAdditional options-- dice up some black pitted olives, banana peppers, and even some hot peppers for a little spice. I've even been guilty of adding black beans!!!! sounds crazy but so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "samanthaplacek"
},
"reviewBody": "This is a great base recipe. I added a little extra garlic, because I love garlic. Added a splash of lemon, and some chili flakes. This was a hit with my children and my husband. Love it, thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveToEat"
},
"reviewBody": "This is the first time I ever made guacamole because I'm not a fan of plain avocados but WOW this was so delicious! I added a bit of cumin, half a jalapeno pepper and left out the cilantro (personal preference). The tang of the lime juice with the avocado just was a delicious combo. Thanks for this recipe I will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CadavraScientist"
},
"reviewBody": "This just tasted bland with a lot of unnecessary cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TJS"
},
"reviewBody": "What's usually so great about guacamole is how wholesome it is. I made this recipe because I didn't have any tomatoes. I thought it looked a little strange, but because it had gotten such a rave reviews, I made it anyway. I'm not kidding, I could barely taste the avocado. I even added extra salsa so that I might have some sort of vegetable flavor, but all I got was a heavy dairy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daizy7155"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sugarmagic"
},
"reviewBody": "Yum! This was pretty good. I subbed Greek yogurt for the sour cream, since it makes no difference in taste. Be sure you like the salsa you're throwing in there, as it gives the recipe most of its spice. My only complaint for this recipe is that it lacks texture. Next time, I'll add onions or tomatoes to give it a bit more consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "This was definitely creamy. The kidlets liked it. Used my mom's canned salsa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clp0020"
},
"reviewBody": "I've never made guacamole before, but this first recipe will be the one I stick to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim K."
},
"reviewBody": "This is my \"go-to\" recipe for guacamole. I never come home with any and the bowl is always scraped clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "myoldasskitchen"
},
"reviewBody": "added lime juice cilantro and fresh tomatoes - never put cream cheese in it b4- now I won't make without it!! YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chefess"
},
"reviewBody": "While this was a little on the bland side, the food processor whips the ingredients into a super-light dip. My picky 13-yr-old, who I thought would never try this went wild over it when I served it with warm tortilla chips. I threw in some fresh minced garlic, fresh cilantro. Next time I'll add an extra avocado or two, because there WILL be a next time! Thanks, Juleski!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathy Chace"
},
"reviewBody": "Very easy to make for my first time!! I was shocked. I used the Kitchen Aid rather than mixing it by hand which made it go super fast. Love the taste although I added some cayenne to kick it up just a touch!! Awesome recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shonna Caponegro"
},
"reviewBody": "A little bland for our taste so we added some chili powder and Cajun seasoning ... it was very creamy and tasteful with those additions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brianna Johnson"
},
"reviewBody": "My friends begs me to bring this every time she has a party. it's so creamy and easy to manipulate to fit your mood for the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuzieQ"
},
"reviewBody": "I love the creaminess of this recipe. I added a couple of tbsp. of onions. Very easy and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hahnba"
},
"reviewBody": "This is the only guacamole recipe that I've tried, so I'm not the best judge. I think that its pretty good. I put in extra salsa and some green chiles. Yum yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda L Dawson"
},
"reviewBody": "This is very similar to what I do but only use 1 pack cream cheese and after mixed add a diced avocado for more texture. Also add 3 tablespoons of salsa to food processor along with, 2 teaspoons lemon juice or lime, 2 tablespoon chopped onion, 2 teaspoons minced garlic, 1/2 teaspoon garlic salt, 1 teaspoon cumin, and 1/2 teaspoon chili powder and sometimes cilantro. The cream cheese seems to also help it from turning brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "violetwsmommy"
},
"reviewBody": "Wow! I just made this wonderful dip. I took some of the suggestions to heart, chopped onion and cilantro and added a bit more salsa to our taste. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COBBY1"
},
"reviewBody": "Made this for my husband's football draft party and it was gone in 5 minutes! The only additions were about 1/4 cup chopped onion and one more avacado roughly chopped at the end to cut down on the cream cheese taste (only because husband doesn't like cream cheese). It was the best guac I have ever made! Thanks for an awesome recipe! This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Radtechnc"
},
"reviewBody": "I've been making a similar recipe for years. It's so easy and delicious. I like to use pico de gallo instead of salsa. Either way you go, you can't mess this one up. Its a must try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancywelsh"
},
"reviewBody": "This is by far the best guac I have ever tasted. And, it is a very quick recipe to put together. Definately give this a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "Have never been impressed with Guacamole recipes until this one. The cream cheese does make a difference. Now I might start making it more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaVMonFos"
},
"reviewBody": "I love, love, love guacamole and love, love, love this recipe!! I added a little more salsa, but was AWESOME!! My mom loved it just as much and she is not a fan of guacamole, but she is now!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "GREAT! I really loved the creaminess in this and thought the cream cheese gave this a wonderful flavor. Made this exactly as written and wouldn't change a thing. I will be using this recipe again! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RLiljenquist"
},
"reviewBody": "Very tasty and creamy. I also only used one package of cream cheese and I couldn't imagine it with another, it would've been over the top. I also blended the salsa with all of the other spices because I don't like chunks and it mixed better. Good Luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennytron"
},
"reviewBody": "I loved this recipe! I've made it three nights this week! Haha, the only thing I dont like about it is the chunks of cream cheese in it. No matter how much I mix, i still get the chunks of it. Tonight, I'm making it again for guests, I'm putting 5 alv, and 5 ounces of cream cheese, chopping up some lettuce, adding more salsa and also some onions. Such a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dgibbons71"
},
"reviewBody": "This was great. Super easy, only took a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Made this for a dinner party. EVERYONE loved it. Even people who didn't like Guacamole liked it. To be honest my self included. Guess I never really tried the right kind till now. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne : )"
},
"reviewBody": "My brother-in-law -- whose favorite ethnic food is Mexican -- says this is the best guacamole he's ever tasted. I have to agree with him!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gg_godd"
},
"reviewBody": "I tried it and like it a lot, i added fresh lemon juice and used fresh garlic. i didnt add the salsa or the onion because i wanted it for fajitas that have those things in them anyway. this will likely be the guacamole i use for fajitas from now on but not tortilla chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kadieroo83"
},
"reviewBody": "I thought this recipe was okay. Its a 4 star for me, because I thought it needed something extra like tomatoes or more spices. I couldnt put my finger on it but something was missing. I loved the creaminess though. This is not for people looking for authentic guacamole. One of the top reviews stated this is the only way its made in texas. I am from San Antonio born and raised and never have come across guacamole with cream cheese. So I am not sure what the previous reviwer was talking about. But it was different and still tasted really good. Great for football!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "added 1 jalapeno to spice it up a bit and salted to taste. i love guacamole and this was by far the best recipe i've tried yet!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "COOKIN4MYFAMILY"
},
"reviewBody": "I like the idea of some cream cheese and sour cream in guacamole, but this is just too bland. If I were to make this again, I'd try 2 T of cream cheese and add more than just a dash of the seasonings plus a good dose of cayenne and/or diced jalapeno. Also, this recipe does not look very appealing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "This was good stuff. I did add some lime juice and omitted all the spices but garli salt. My homeade salsa had plenty of flavor to not need the additional spices. A nice change of pace from the regular dip. Will make this one when I am craving something different!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wickie"
},
"reviewBody": "This is wonderful with Cream cheese and the salsa. I was out of sour cream and frankly bored with my usual recipe. I served this with Chicken fahitas and it was fantastic. This is now my favorite recipe. Oh.. if you make up before hand, press plastic wrap directly onto the guacamole and cover. Your guacamole won't brown this way - and this recipe held up the next day for leftovers.. I've never had that in other guacamole dips.. Usually I would toss whatever was left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pushbuttonkitty"
},
"reviewBody": "not big on the cream cheese in the guacamole. didn't like the texture or the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KidsAreReadingUsborneBooks"
},
"reviewBody": "Wonderful guacamole dip recipe! My twin seven year olds and my husband loved it. I used two avocados, plain yogurt in place of the sour cream, neufchatel cheese (light cream cheese), 1/2 c of petite diced tomatoes with lime and cilantro in place of the salsa, sea salt, apx 1 tsp of chopped garlic (from a jar) and key lime juice. I just mixed everything in the same bowl using two forks to mash the avocados. We will definitely be using this recipe lots!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cyd_Delve"
},
"reviewBody": "nope, this wasn't it...i made this and it went bad sitting in the fridge because nobody liked it...i think it's because it's \"authentic\" guacamole---our unsophisticated NorthEastern palates want the stuff you find in Mexican chain restaurants, and this isn't it...i tried more salsa, some onion, some lime but nothing helped...sadly, the search for guacamole goes on"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "Excellent! Made it for a family get toghether and it went like hot cakes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephGruss"
},
"reviewBody": "This is an amazing Guacamole I have made it serveral times as is!! Great for parties and also I like to use it as a topping on my burgers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Omgirl"
},
"reviewBody": "This was good guacamole. It was creamy and light. But I felt that the cream cheese drowned out the yummy flavor of the avacados, so if I did it again, I'd half the cream cheese. I also added lime at several people's suggestion and it definitely added to the flavor (and I coated the top with lime when storing and it didn't turn dark green). I think I'll make this again with those changes because I liked how smooth and simple it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clay"
},
"reviewBody": "This was delicious! loved it! I didn't have any onion powder, so I used some taco seasoning instead, just as an experiment. Anyway, it was VERY good! thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CooperCook"
},
"reviewBody": "Great guacamole - I like the red pepper idea because I like it spicy. I've never used cream cheese in guac before, and now I will never leave it out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Legs"
},
"reviewBody": "I love cream cheese, but it's in no way an ingrediant of authentic guacamole. I did try this though...in a smaller amount, and it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BAKININBUDAPEST"
},
"reviewBody": "This is nearly exactly like our family recipe we have been using for decades. We call the cream cheese \"Guac Extender\" as it really helps bulk up the guacamole, even with few or less than perfect consistency avocados. I grate a bit of onion into mine and also crush a clove of garlic, rather than use garlic salt. Put a dash of chili powder in and voila! It is fabulous! We have people come visit sometimes just so that they can get some of this guac. Am glad someone shared it here on this site. It is definitely a keeper and highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMY GENTEKIS"
},
"reviewBody": "The name says it all... Always a huge hit! Never lasts, lol..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jilly"
},
"reviewBody": "This guacamole is FABULOUS and I don't usually even eat the stuff! I had lots of this. I made it for a Mexican dinner I was hosting and everyone loved it. I think the cream cheese really makes it wonderful. I used fresh garlic in mine and added extra lime and cilantro. This recipe really stands out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "I was a little uncertain about using cream cheese in a guacamole recipe, but it was wonderful! The cream cheese didn't overpower the avacado flavor instead it just made the texture a little more creamy. Like other reviewers I also decided to add a touch of cumin and some chopped tomatoes. Everyone loved it! This recipe will go into our family favorites file!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sambo"
},
"reviewBody": "i wasn't into guacamole until i tried this recipe. it's so good with corn chips, i have to check myself so i wont finish an entire bag!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1000 julys"
},
"reviewBody": "Delicious! The sour cream and cream cheese made it extra creamy. I did add in some extra things--some diced onion, a bit of minced garlic, some diced tomato, cilantro. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fancyfree"
},
"reviewBody": "We love this recipe. I subbed mild green chili's as we can't eat very \"hot\" food &amp; jalapeno's are too hot for us. So glad I found this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Bell Mejias"
},
"reviewBody": "I really enjoyed making and eating this dip. My guests always say that it's tasty and creamy. I like to add a little chopped onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina S."
},
"reviewBody": "This was a very easy recipe to make. I followed the recipe exactly except I added a bit more salsa. Everyone was skeptical because it did not have the any fresh tomatoes and onions in it...however, even my biggest skeptics said it was the best guacamole they had eaten. The fresh taste of the avacadoes was more evident in this recipe than in other recipes that had all the \"extra\" stuff. I WILL be making this recipe over and over. LOVED IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Tracy Bohman"
},
"reviewBody": "A really good taste nice and creamy good texture makes a good dip too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stepheni"
},
"reviewBody": "Great recipe when you want a creamier guacamole. I added a little lemon juice, tomato and some green onion. This would probably go over well with kids as it is not too spicy. We definitely will have this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsCasement"
},
"reviewBody": "We love this recipe!\n\nI double the salsa &amp; use 2 large avocados."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katy"
},
"reviewBody": "I have never made this style guacamole before, and I really liked it. I served it on chicken burritos and the taste was excellent. Next time, I would probably add some tomatoes. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney Bowyer McCollum"
},
"reviewBody": "I substitued season salt for garlic powder because I was out of the garlic powder. This didn't make it past the 3 hour mark...it was devoured with begging for more and the recipe. Make this dip!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharpfour"
},
"reviewBody": "I usually don't like guacamole that much but this recipe is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sgemft"
},
"reviewBody": "Super easy, and super tasty. I added lime juice as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Johnson"
},
"reviewBody": "Yum Yum Yum!! I made this last night for a party and it was a hit! I do have to admit I used this recipe as a base and added things to it. I added fresh diced onions, fresh chopped tomatoes, diced green chilis, splash of lemon juice, and a dash of cayenne pepper. PLUS if you keep a couple of the seeds/pits them just throw them in with the guacamole and it helps (in conjunction with the lemon juice) keep the guacamole from turning that nasty brown color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "REDIRG"
},
"reviewBody": "A local seafood restaurant serves a similar guacamole. The newspaper printed their receipe and it included lime juice and curry powder. I'm not sure if I would like curry powder in it, and wonder if anyone else has tried adding it?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrice Cyril"
},
"reviewBody": "This is the best guacamole we've ever had. Made it almost to the recipe except used minced red onions and minced garlic - it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie R."
},
"reviewBody": "It's easy and so creamy and good. I 'sample' more than I should every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "This is very good and easy. I used a food processor and added extra salsa, lime juice, and cumin to the original recipes. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie A"
},
"reviewBody": "Great guacamole! I added lime juice and cilantro for some added flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheoah"
},
"reviewBody": "I made this a long time ago and I guess that I forgot to rate it. I have never had guacamole before so I did not know that it was kind of bland tasting. Well I added more onion powder as well as more garlic salt and some garlic powder. My husband and his friends told me this was the best guacamole that they have ever had because it had flavor! Thanks for sharing your recipe! I will be making this one again:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ashleynicole"
},
"reviewBody": "I used 4 avacados instead of 3 and then I added more salt and some taco seasoning until it had enough flavor. Then I used a mixer to mix all the ingredients till really smooth. My family loved this and said They will never use any other recipe for guacamole again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This is fantastic! It was very easy to make, not too spicy and not too runny. I did add a little bit of Cumin into the mix for taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WeirdAuntMartha"
},
"reviewBody": "Very easy and good. Quite a few friends and relatives who have never tried guacamole before said that they really liked this recipe. The nice thing about this recipe is you can really fudge on the amounts of any of the ingredients. If you dont have enough of something, dont worry about it. My only tip (that I learned the hard way) is to select ripe to over-ripe avocados. If you get a bright green (fresh) avocado, it is not soft enough to blend. Save those for your salads and other recipes that call for sliced avocados. You can squeeze the avocados in the grocery store, the softer, the better. They're usually a little black on the outside too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HAAV6"
},
"reviewBody": "This recipe is creamy and easy to make. We serve it at every party we have, the color stays nice without getting brown. We add a little crushed red pepper for zip, but it is a new family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrianna"
},
"reviewBody": "I added a wee bit of lime juice to help the avocado keep its color but overall the BEST guacamole EVER!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra S."
},
"reviewBody": "I added a little bit of diced onion and tomato. This recipe is delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raider"
},
"reviewBody": "DELICIOUS, THATS ALL I HAVE TO SAY ABOUT THAT!!!!!!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaybee"
},
"reviewBody": "Yumm!!! This was delicious! I didn't have that much cream cheese so I used 1/2 cream cheese and 1/2 mayonnaise, I added a little bit of fresh garlic, serano pepper, some chopped onions and tomatoes. This was amazing! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bethany Dasko"
},
"reviewBody": "This was a good base recipe and is a nice way to stretch avocados when they are out of season (*and expensive!) \n\nI used half of the cream cheese the recipe called for, thinking I could add the rest if I wanted to but I didn't think I'd want to. This recipe was pretty good, all things considered except I'd probably want to use a food processor for most of it to make the cream cheese blend in better (or soften it well beforehand). I also added lime juice but I always do that for guacamole. All in all, a good recipe to start from and I'll probably make it again someday after I get a food processor. Chunky mashed avocados can be added later if you like chunks of avocado like we do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OLYBROWNS"
},
"reviewBody": "AWESOME AWESOME AWESOME! I didnt measure the ingredients out exactly and it still came out tasty. I added lemon juice and crazy salt and it was a total hit. I will never make plain guacamole again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsMAC"
},
"reviewBody": "I love guacamole, so I used this recipe as a way to experiment with a different mix of ingredients, but ended up subsituting a couple of things from my own recipe. I used Miracle Whip instead of sour cream, and Red Hot instead of salsa (just two dashes). I chopped some red peppers for colour instead of tomatoes and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Tasty, easy, and oh so popular with the family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juicyfruit007"
},
"reviewBody": "Very good. Will make again. Didn't follow proportions exactly, just estimated all the ingredients together. Used fresh onion and added some lime juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda F."
},
"reviewBody": "YUMMY!! This recipe was great! The only thing I changed was that I added some diced tomato. It was a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t_fillion"
},
"reviewBody": "Absolutly DELICIOUS! I was looking for a recipe to try as this is one thing that I have craved like crazy this pregnancy and my previous one as well. I added the juice of one lime, some minced garlic and onion. Easy to make and a nice tasty treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Massalski Ferrazza"
},
"reviewBody": "I wanted a different kind of recipe that used avacdos. This peeked my interest, i did add cilantro and hot pepper but other then that made it like the recipe. both my son (4 and 5) loved it and my hubby tried it even tho he states he hates guacamole, he even ate it all up, putting it together with tacos tonight anc can't wait thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "W Hamlett"
},
"reviewBody": "Just the recipe I was looking for. Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom of Two"
},
"reviewBody": "Excellent recipe! this is my new favorite app. for all occasions! The only modifications I made were adding shredding cheese and diced tomatos on top of the dip. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Krystal"
},
"reviewBody": "I didn't like this recipe. It didn't taste like real guacamole because the cream cheese wasn't subtle enough. Won't do this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is one of the best recipies ive ever made for guacamole!!! i like mine hotter so i added hot sauce and jalepenos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amaruzi"
},
"reviewBody": "I was really not impressed with this recipe. I made some modifications such as substituting the powders with chopped 1/3 C chopped red onion, 3 small cloves of minced garlic, 3 tbs of chopped cilantro, 2 chopped roma tomatoes and 1/2 tsp of cayanne pepper. But it still didn't taste right so I added some more salt and some dashes of hot sauce. I won't make this again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22972/easy-never-forgotten-guacamole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
"name": "Dips and Spreads Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/434/appetizers-and-snacks/dips-and-spreads/guacamole/",
"name": "Guacamole Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22972/easy-never-forgotten-guacamole/",
"name": "Easy Never Forgotten Guacamole"
}
}
]
}
}
, "about": [
]
}
]