				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Cream Cheese Danish"
,"datePublished": "2020-06-18T23:05:21.000-04:00"
,"dateModified": "2022-08-17T02:09:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Natalie"
,"url": "https://www.allrecipes.com/cook/24327021"
}
]
,"description": "This recipe makes the best cream cheese Danish I have ever tasted. It is very simple to make."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iPCfFVTpJqSThIhZSfHHVnt6GS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9133257-easy-cream-cheese-danish-Mindyl-4x3-1-4729446fefd54b7890d58c87a60da801.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Cream Cheese Danish"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "607"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "498 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "53 mg"
,"proteinContent": "8 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "582 mg"
,"sugarContent": "32 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 (10 ounce) cans refrigerated crescent roll dough",
"2 (8 ounce) packages cream cheese, diced",
"0.75 cup white sugar",
"1.5 teaspoons lemon juice",
"1 teaspoon vanilla extract",
"2 teaspoons sour cream",
"1 cup confectioners' sugar",
"1 tablespoon milk",
"1 tablespoon butter, softened" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Line bottom of baking pan with 1 can of crescent rolls. Pinch all seams together to seal."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, mix together cream cheese, white sugar, lemon juice, vanilla extract and sour cream. Spread filling on top of rolls. Place second can of rolls on top of filling."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 20 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl, stir together confectioners&#39; sugar, milk and butter. After Danish has cooled, drizzle with icing."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deedee Deleon"
},
"reviewBody": "they were so easy to make and the family loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added frozen strawberries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raschel Charles"
},
"reviewBody": "Butter flavor crescent dough cut into rounds. Half the cream cheese mixture. Add 1/2 tsp lemon extract. Splash of almond. 350 for 15 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary G"
},
"reviewBody": "Quick, easy and impressive! they would be great for a brunch selection. I used the slicing method, and knowing how quickly canned crescent rolls burn, I set my oven rack to high middle instead of my customary low middle--and it's a good thing I did!! at 20 minutes they were definitely done, even a little too done on the bottom. I had used a large non- insulated baking sheet instead of my smaller air-bake type. next time I will use the insulated sheets. I only made half of the recipe , which came out to 15 pieces, and my husband cleaned them up in no time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelique_redhead"
},
"reviewBody": "I liked the cream cheese filling very much though I put a tablespoon of lime juice and doubled the vanilla. I didn’t think that there was too much filling but I was putting it on top of a recipe for poolish bread that if I had known how sweet the filling was I would have added a touch of sugar to the poolish as it does not have sugar normally. I did not add the frosting because we don’t eat a lot of sugar and the filling was plenty sweet for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooper"
},
"reviewBody": "My family loved it. Neighbor commented it was too cheesy. I followed directions, and will make it again. May add some fruit next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Dee Dyer"
},
"reviewBody": "Awesome! I used 1 can and made 1/2 of the recipe. So yes I have a lot of filling. I pre baked base for 5 minutes. I washed the top with beaten egg and added a little bit of sugar to top layer. Drizzle with glaze. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dsales"
},
"reviewBody": "This recipe is so easy and delicious it is dangerous. I used the ingredients as written, with two additions. I added 1/2 tsp. of butter extract to the icing and I brushed the top crust with beaten egg before baking. I baked the bottom crust for 5 minutes before continuing with the instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget brown"
},
"reviewBody": "Excellent and easy. Looks like they came from a bakery. Taking other reviewers suggestions, I too sliced them to make individual danish. Brushed tops with beaten egg and sprinkled with sugar made half filling with lemon extract and also filled some with raspberry filling purchased in a frosting bag on Amazon then drizzled with the glaze i added almond extract too. Will make annually for family Christmas breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robert Ringenberg"
},
"reviewBody": "I SO wanted to love this recipe but only found it to be okay. The dough just didn't feel right, and the cheese didn't taste right. I will try again and adjust it but as is it was only okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Fantastic! Will be adding this to our rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdinh"
},
"reviewBody": "Cut the recipe in half and turned out great! Didn’t make the icing since I made a blueberry compote for topping. Simple and easy recipe for my picky eaters. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gramcat"
},
"reviewBody": "This recipe is delicious. I cut the recipe in half because it was for 2 people. Even though I cut the filling amount in half I had more than enough which is fine because I will be making these again. I followed another reviewers advice and did not unroll the dough but put it on a cutting board and used a very sharp knife to cut 8 piece starting on one end to the other so I had 8 rounds. Baking them this way keeps them from being soggy as some reported. Since my husband is diabetic I substituted Swerve for the sugar and cut it in half again because Swerve is sweeter than sugar to me. I Swerve confectioner sugar for the icing also. Most grocery stores carry Swerve now. I also added no sugar added cherry pie filling on top of the filling. They turned out amazing. My husband ate 3 without slowing down. Next time I may use a different fruit flavor. You can use a spoonful of no sugar added preserves any flavor you like. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth P"
},
"reviewBody": "Delicious! I agree with another reviewer, one block of cream cheese is plenty. I baked for 25 minutes. This is a family favorite and got rave reviews at a work pitch-in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mexy"
},
"reviewBody": "Don't add a whole teaspoon to the powdered sugar because it really is too much and overpowering. Next time I will only add 1/2 tsp and a touch more milk instead. Otherwise great and so easy. I didn't go through the hassle of keeping the triangles together I just used each individual triangle and it was easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kolbeiii"
},
"reviewBody": "This was Betsy easy and yummy! However, per the instructions, it comes out looking nothing like the pic. I’ll explore with the next batch on making individual danishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCCOMBSS"
},
"reviewBody": "I subbed chocolate chips for the raisins. This is SO good and simple. First time making scones. Followed this to a tee and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Hopkins Fitzherbert"
},
"reviewBody": "Loved these! I did the mini danish as others stated by cutting the rolls into slices. I got 18 from a can. filling is a bit much I actually had some left over and made another 1/2 batch from it . topped some with jam after taking from oven. albready bought ingredients to make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis Trinke Funk"
},
"reviewBody": "Totally delicious. Made them in the small rounds as recommended by another user. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "warren shepherd"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merna"
},
"reviewBody": "So easy to make!!! I made this exactly as written but since my husband picked up the crescent rolls for me and I didn’t know there were different kinds of rolls available, I made these with buttery crescent rolls and they were excellent and made a lot! I only had to bake them for 30 minutes, the center is like cheesecake and they didn’t have a dinner roll taste! This is going to be my “go to” recipe for gatherings from now on! Too, as per others, variations can be made to easily change them up with a different icing or adding fruit pie filing to the top. I wouldn’t cut back on the amount of cream cheese as some have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael "
},
"reviewBody": "I halfed the cream cheese mixture and added 1 can of Strawberry pie filling on top of the cream cheese. It was AWESOME"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "Truth be told, I made a few changes to this recipe that would make it a 5+ rating in my books! Used 2 tubes of crescent rolls as per the original recipe but only one pkge of cream cheese, less sugar (about 1/4 cup), and added a generous handful of golden raisins and 1/2 teaspoon almond essence instead of vanilla. Also, made individual danishes by slicing the rolled dough into 8 discs per crescent roll tube and added raspberry jam, along with the cream cheese mixture, to half of the batch of 16. Yummy delicious, fresh out of the oven, room temperature or lightly toasted. They disappeared way faster than expected, and I was the main culprit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Roberts"
},
"reviewBody": "I used 1 pkg cream cheese instead of 2, topped with 1 cup raspberry pie filling, then second layer of pastry. Easy! Raspberry/cream cheese Danish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TimT"
},
"reviewBody": "This is so easy it is very easy to modify to add other ingredients on top of the cheese layer. I have made it a few times, today I made as the recipe describes. \nThank you Natalie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "elliann"
},
"reviewBody": "It turned out pretty well. I used someone else’s suggestion to reduce cream cheese and sugar. BUT, it is not good the next day! The dough falls apart and is like glue. I threw away 1/2 of it. So.... if you are preparing for a crowd the recipe is probably good. For 2 people, find another recipe. I won’t be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Wonderful. Added an egg to the recipe. Feels like it holds up the cheese mixture better. Tons of mixture leftover so I Made one batch with guava and cheese. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Pennypacker"
},
"reviewBody": "This is my first attempt at making some kind of pastry and they were amazing. I will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiggertiffin87"
},
"reviewBody": "I bought crescent dough sheets rather than the rolls and just one container. I didn't want the top. My BF oopsed and got almond extract instead of vanilla and we had no lemon juice or sour cream, so I subbed lemon Australian yogurt (just the amount for the sour cream). I cut the sheet into four squares, folded the corners in to the middle and put the filling in the center. Baked for 15 min. I may have licked the bowl clean from the cream cheese mixture, it was so good. Oh, I only made half the filling recipe and only used 1/4c sugar instead of the full 1/4c + 2TBPS. The yogurt had sugar in it and I didn't want too much. Just ate one. The almond extract was too overpowering, there was too much sugar overall and too much filling. Next time I'll make it properly and get 2 cans of sheets instead of one (and still halve the filling). I can tell this'll be good when it's properly done so I won't omit any stars for my screw ups. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "We love this Danish pastry. Easy and delicious. I made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "richmond_hoo"
},
"reviewBody": "I used the crescent sheets and made it into a basket weave on the top. Looks great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "Made exactly as written and it is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GiGi's Kitchen"
},
"reviewBody": "This is a very easy danish recipe that hit the spot. I modified and used 1.5 packages of cream cheese because I wanted to add fruit. I blended about a cup of canned peaches (did not use any of the syrup just peaches) and put it on top of the cream cheese mixture before adding the second layer of crescent roll. It turned out very nicely, but I would use more fruit next time. The bottom was not soggy. Hubby liked it too! (Major Win!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Justina Schneeweis"
},
"reviewBody": "It's good, but the flavor of the crescent roll dough is all wrong. I'll probably try puff pastry next time. I made half the cream cheese filling and it was still plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mommyakamom"
},
"reviewBody": "I made it with exact measurements, but cut the dough as one review suggested (20 single rounds per can) and I used 3 cans of croissants! After making 20 I remembered I had strawberry pie filling from a cheesecake I made so I started to fill with half cream cheese filling and half strawberry filling. I had to fight off kids just to ice them because they looked so good. Once they were cooled and iced they lasted about 4 mins!!! This is cheap for 60 of them. I have already promised to make some for coffee time at grandmas house!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. U"
},
"reviewBody": "I’ve made this recipe at least 20 times. It’s always perfect. I make it just as written. HOWEVER, I just today made it with one slight change. I assembled the whole recipe the night before and it sat in the fridge overnight. This morning, I baked it like the recipe says. GAME CHANGER!!!! Surely made our Christmas morning meal faster to get together. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Cook"
},
"reviewBody": "This is a very easy and delish pastry. I also spread a can of cherry pie filling on top of the filling. Excellent finish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Hodgman"
},
"reviewBody": "Very easy and yummy! I needed to use some cream cheese that I had left over in my fridge, so when I saw this I went for it. Everyone wanted more. \nI did have to cook it longer by about 10 minutes, but I think my oven doesn't cook properly. The bottom crust was perfect probably because I used a pizza stone and that always makes for a less soggy crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally Sizemore"
},
"reviewBody": "My family loves it when I make these! They are normally gone within the day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mollysmom8100"
},
"reviewBody": "I make this on Christmas morning every year for my family and it is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney Gitlitz"
},
"reviewBody": "Delicious!! I cut the recipe in half and still had about 8 slices!! I used honey bun crescent rolls and this worked out perfectly! This was easy and I highly recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "We make this quite often when a breakfast pot luck dish is called for. We always get compliments on it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "misscleo1105"
},
"reviewBody": "Great recipe for a first time making Danishes. While I had some thoughts and made some personal preference changes, these could be made exactly as the recipe dictates and the results would be delicious. These flew off the plate!\n\nSome notes:\n\n-The crescent rolls were fine, but I will probably just buy the Pillsbury dough sheets next time for ease.\n-The bottom layer didn't get soggy on me, but it was thin. If I made these again I'd cook just the bottom layer for ten minutes before putting the filling and top layer on.\n-Other reviewers are right, this does make a LOT of filling. I was happy with the amount and used it all, but just as a caution.\n-I did make some personal adjustments on the filling. I didn't quite use the full amount of sugar--I put in a half cup and then added to taste. I also doubled the sour cream and lemon just to have the tartness come through.\n-The top layer browns quickly. Luckily I watched it and put foil over it for the last five minutes or so of baking and they came out perfectly golden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CA"
},
"reviewBody": "Holy cow, did these fly out the door! These are cream-cheesy deliciousness to the extreme! The filling is very sweet, so perhaps as others suggested, you may want to cut down the sugar in the filling a little. The people I made it for love their sugar, so it was perfect for them the way it was. I only added a 1/2 teaspoon of vanilla to the icing and it gave it that \"wow\" to the already \"wow\" product. Love this recipe and it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clara Cerna-Wons"
},
"reviewBody": "This was a great recipe and using one package of cream cheese was much better than using two for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "So easy and so good! I'm consider putting a thin layer of jam on top of the cream cheese next time, but that might be a bit much. SO good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "So easy and so good! I'm consider putting a thin layer of jam on top of the cream cheese next time, but that might be a bit much. SO good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelakatrice"
},
"reviewBody": "This is perfect just the way it is. Now you can buy seemless cresent rolls"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carolgs84"
},
"reviewBody": "Easy and delicious. I halved the filling and added almond flavoring to it, and made a simple powdered sugar/milk glaze instead of the one here. As other reviewers have mentioned, it's better the next day. It *does* have a canned-crescent-roll taste, so if you're expecting it to be exactly like a bakery Danish, you'll be disappointed. (I don't understand why people make a recipe with a convenience item like canned rolls, and then complain that the recipe tastes like the convenience item. Duh.) That said, for a recipe using canned rolls, it's pretty darn good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny "
},
"reviewBody": "Very good! On one half I added some strawberry jam I needed to get rid of. Just tucked it between the crescent roll gaps. It was good either way. Hubby liked it warm, I preferred it cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Enlow"
},
"reviewBody": "Family LOVES it!! The recipe is right on...except the extra 1/2 tsp of lemon is really per your taste. 1tsp covers it...but we're a house divided there lol. A perfect, easy, tasty dish that makes a great snack or breakfast on the go!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ambrose Hill"
},
"reviewBody": "Buy the crescent sheets.. Very easy and a time saver. I made the filling exactly to recipe. I did have a little left over but I would rather have extra than not enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lina"
},
"reviewBody": "I've made this many times and it's always a hit at brunch. I cut the amount of sugar to 1/2c -it's still very sweet and I use almond extract instead of vanilla. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Vogler"
},
"reviewBody": "Very good. Only change I did was half the filling recipe like other users had recommended and it was plenty. I also baked the bottom crescent roll layer for about 5 minutes before adding the filling on top. It didn't come out soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Cloud"
},
"reviewBody": "I have done this one many times. My boy loves it! I only do half of the recipe and cut the sugar a bit less. Instead of putting the 2nd sheet on top to cover it, I just leave it open. So it looks like the coffee cake / danish sold in the grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marie"
},
"reviewBody": "Made this for the first time and following some suggestions, I used puff pastry and added almond extract to the icing. Absolutely delicious! Haven't tried it cold yet, bus it was pretty awesome warm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "scrooks"
},
"reviewBody": "Very disappointed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "profmom"
},
"reviewBody": "I made this today for nine guys staying with us for a church retreat. It was easy and they loved it! The sour cream and lemon juice keep it from being too sweet. I took Wayne's advice and cooked the bottom crust first before adding filling. It would be especially good with the puff pastry as several suggested. I used the reduced fat crescent roll dough. I doubled the crust and glaze, but only used 1 1/2 times on the filling to keep it from being as heavy (3 blocks of cream cheese, not 4). I made the glaze and filling the night before so this morning I just had to partially bake crust, spread the filling, add the top crust, pop in the oven and glaze it. A good recipe for kids leaning to cook--ingredients could be broken down for each child to make an individual danish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya Fulmer Wiseman"
},
"reviewBody": "I cut the entire recipe in half. It was perfect. I will definitely be making these little bars of deliciousness again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Wright"
},
"reviewBody": "One of the best recipes for danish I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calleen"
},
"reviewBody": "I love cheese Danish, and this is the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iloveit"
},
"reviewBody": "GOOD FAST EASY but family said GREAT. Gave recipe out.\nI used one package cream cheese and feel it was plenty.\nKeeps well and travels well. Definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy n fast. I only added frozen strawberry for preference. I love this recipe and I would recommend n make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janallblanco"
},
"reviewBody": "Very easy n fast. I only added frozen strawberry for preference. I love this recipe and I would recommend n make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haleylynn"
},
"reviewBody": "Sooo good! My whole family loved it! I added raspberries on top which made it even better! This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baoying Guan"
},
"reviewBody": "like it....love it..... because it's delicious...!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lacy Paige"
},
"reviewBody": "Ohhh yum! Dangerous recipe to know about ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hgmonty"
},
"reviewBody": "I make cheese Danish by placing the filling in the center of a sheet of Pepperidge Farm Puff Pastry and then crisscross the sides. My problem with the filling was...no binder or egg yolk. My filling completely melted out of the middle of the braid. I had cream cheese soup and my pastry did not puff up. What a MESS!!!\n \nThere is a simple solution and that is to add an egg yolk to the filling recipe ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "I took the advice of another reviewer and sliced the dough,then brushed with egg. Then sprinkled with sugar.I made only half the filling and had more than enough! They were great just what I was looking for,Thanks for the recipe and the helpful hints"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LukasJones"
},
"reviewBody": "Amazing! So easy to make and delicious! Keeping this recipe close for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie Lane"
},
"reviewBody": "I liked this a lot! I used 8 oz cans of cresent roll and only 3\\4 of the filling. I also added cherry pie filling on top if the cream cheese. It was a hit at our church breakfast. I will be doing this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norrie"
},
"reviewBody": "I made it using the exact instructions with the sugar and cinnamon on top. They were delicious. Then I read the reviews and decided to use some of the other suggestions, like making them in rounds. They came out tasting like a roll with cream cheese on them. I only tried four that way and I should have only tried one. I still had the rest of the ingredients to make it the original way and just used a smaller pan. It came out delicious again. I just used less cinnamon in the sugar topping to make them less dark looking after baking. I would never make them using the rounds again. (I brushed the top with melted butter before sprinkling on the cinnamon/sugar topping.)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dawn"
},
"reviewBody": "Great recipe! Made it for the first time this morning for a church breakfast. Will be making it again soon! THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Martin Krolik"
},
"reviewBody": "This was super easy and tastes great. I omitted the lemon juice because I didn't have it. This was flaky and had a ton of filling. I would highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elise"
},
"reviewBody": "It came out terrific!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULIETTEMB"
},
"reviewBody": "definitely use one block of cream cheese, and a half cup of sugar, as well as 1 tsp each of lemon juice and vanilla. I make two separate rectangles with one package of the crescent rolls, after spreading the cream cheese mixture, top with two rectangles from the second package. we don't do the glaze, we top with raspberry jam- yum! easy and delish, a Christmas morning tradition!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sylvia"
},
"reviewBody": "Easy to make. Absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LACEY5"
},
"reviewBody": "Yum...Very good and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love to Cook"
},
"reviewBody": "I make this quite often, and it makes the perfect danish with the perfect amount of filling. I would never consider reducing the filling! The only changes that I make are: for the filling, use two teaspoons Madagascar bourbon vanilla extract -- for the icing, add one teaspoon Madagascar bourbon vanilla extract and one tablespoon almond extract. Before baking, I beat one whole egg and brush it over the top of the pastry. For a change of pace, I may spread a can of cherry pie filling over top of the cream cheese layer before topping with the last layer of dough. This danish is absolutely outstanding. No one ever would know that it didn't come from a fancy pastry shop!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoOkInGnUt"
},
"reviewBody": "Fabulous! These was easy to make and looked great when I took out of the oven to serve. I sliced them straight from the can in log form (I used butter flakey crescent). Then dipped the top of each roll (makes about 10 rolls) into sugar. Then I pressed down the center and filled with cream cheese mixture and baked as directed. I halved the recipe and did not go skimpy on the filling. Half the filling is enough for I can of crescents. I did not use the icing on top due to the fact I filled them a little extra. They sure did not last long here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen McIntyre"
},
"reviewBody": "first of all let me say they are to die for I made the easy cream cheese danish they were very good a little on the sugary side but next time I think I'm going to use less sugar on top and put strawberry preserves in the middle with the cream cheese or maybe cherries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T.L. Stone"
},
"reviewBody": "I love this recipe. I add fruit or raspberry jam to make it more special. I spread one tube of dough on bottom of pan and make sure it goes up the sides and ends a little. Then add filling. Next I unroll the 2nd tube crescent rolls , pinch the slices together to make a sheet and lay this over the filling. I make sure the top sheet reaches all sides and ends and press them together to seal. I might try the sliced dough and make the Danish like at Costco. Sounds yummy too !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Jackson"
},
"reviewBody": "Made as is. This is a freakin AWESOME recipe. Made as is, would NOT change a thing! This is almost just as good cold, out of the refrigerator, as it is hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yummy and easy! One time I was talking to someone while making these and not paying attention, and I dumped the icing ingredients in with the rest of the filling mixture. Turns out...still yummy! How can I not like a foolproof recipe like that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carianna Farrell"
},
"reviewBody": "Amazing Danish! Just the right amount of cream cheese filling. I made a lemon-tasting drizzle icing just for fun instead of the regular one suggested. This gave it a surprising but pleasant lemon taste. Great recipe! It will definitely be my favorite, which is good, because danish is my favorite food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Memphis Chic"
},
"reviewBody": "SOGGY BOTTOM SOLUTION! I always made this in a glass pan. I wanted to make a smaller portion so I used a non-stick metal pan. My bottom was soggy that time. So I guess the solution is to bake it in a glass dish. It comes out perfect every time. I hope Kari sees this because I would hate for her to miss out on this wonderful dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IDYDELL"
},
"reviewBody": "Very easy. Had all ingredients on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Copeland"
},
"reviewBody": "Works great, halved it for two of us and we had two breakfasts out of it. Used one can of pilsbury rolls, split in half, and halved all of the other ingredients. Lemon is key to bring out flavor. Good on day two, not so much on day 3, so eat them right away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yah Yah"
},
"reviewBody": "It is indeed an easy recipe. The first time I made it I was at my daughter's house and used a glass baking dish. When I made it at home I didn't have that dish so I used a cookie sheet. It was a bit messy, but delicious nevertheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inga"
},
"reviewBody": "This is so simple and delicious I am making it again and I just made it the other day. I am definitely addicted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMLIZARD"
},
"reviewBody": "I made this recipe in two 8 inch pans and gave one to my neighbor for clearing snow from my sidewalk this morning. Her family loved them and my roommate ate most of ours! For ease of preparation and excellent taste, these deserve 5 stars. ***Also got me thinking what other fillings I might experiment with....\n~UPDATE~ I've made these many times now, both with and without fruit pastry filling added (not pie filling!) Great both ways! I have also sliced the tubes of dough into 1/4 inch slices and placed them on a cookie sheet, them pressed an indent into the middle and filledwith the filling before baking. They were good both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian Sakal"
},
"reviewBody": "Made this last night and every one loved it. Some reviews said it was too much filling so I bought an extra roll of the crescent rolls and made a 8x8 pan along with the 9x13. It was all gone!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiki"
},
"reviewBody": "Delish! I made these as small individual Danish and baked for 15 min on 350 and they came out perfect. Used the recipe just as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrissie816"
},
"reviewBody": "These are amazing made just as the recipe is. Just want to add that this time making them I decided to spread some cherry pie filling over the cream cheese mixture, and they were very tasty too! Always a hit when I take them anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KellsBells"
},
"reviewBody": "This is a FANTASTIC recipe! I followed it exactly as it called for, and it turned out perfectly. The cream cheese is a BIT much, but if this is all you're eating, then it's great. It tastes amazing, and the only recommendation I have would be to cook it closer to 30 minutes to let the crescent rolls harden. That seems to help with the richness of the cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom"
},
"reviewBody": "I made 8 of these with a thawed box of puff pastry (Pepperidge Farm). I made pockets by folding in corners of puff pastry after placing filling in the centers. The filling was delicious and I have enough filling left over for another batch. Easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wave"
},
"reviewBody": "Super easy and yummy!! Great for kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Hollifield Strahan"
},
"reviewBody": "This is really easy to make, and a nice change to take to Sunday morning services for coffee time. A big improvement over doughnuts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLS"
},
"reviewBody": "I made half the recipe and shaped it into a braid. Also, I used low fat crescent rolls and low fat cream cheese, just added a 2 Tb of flour to the cheese so it would firm up. Worked great."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24145/easy-cream-cheese-danish/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24145/easy-cream-cheese-danish/",
"name": "Easy Cream Cheese Danish"
}
}
]
}
}
, "about": [
]
}
]