				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Cheesy Tuna Casserole"
,"datePublished": "2000-08-29T20:46:10.000-04:00"
,"dateModified": "2022-07-14T17:27:37.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Wendi"
,"url": "https://www.allrecipes.com/cook/24329245"
}
]
,"description": "A combination of pasta, tuna, mixed vegetables, mushroom soup and cheese cooked in a casserole."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BA0uJ77gnHyRjIghno6K6oJ-mVU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9411441-60c8397230c3491589c854508394fb72.jpg",
"height": 1323,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Cheesy Tuna Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "105"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "1697 kcal"
,"carbohydrateContent": "190 g"
,"cholesterolContent": "164 mg"
,"fiberContent": "16 g"
,"proteinContent": "86 g"
,"saturatedFatContent": "34 g"
,"sodiumContent": "2354 mg"
,"sugarContent": "10 g"
,"fatContent": "68 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (16 ounce) package medium seashell pasta",
"1 tablespoon vegetable oil",
"1 (10.75 ounce) can condensed cream of mushroom soup",
"1 (15 ounce) can mixed vegetables, drained",
"1 (5 ounce) can tuna, drained",
"2 cups shredded Cheddar cheese",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add 1 tablespoon oil to the water to prevent sticking. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a 2 quart saucepan over medium heat, combine the cream of mushroom soup, mixed vegetables, canned tuna, and 1 cup of the cheddar cheese. Gently fold pasta into the soup mixture and mix thoroughly. Pour pasta and soup mixture into a 11x7 inch baking dish. Sprinkle remaining cup of cheese on top."
} ,{
"@type": "HowToStep"
,"text": "Bake in a preheated oven until cheese is melted and bubbly."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne Bush Fike"
},
"reviewBody": "Great! I cooked fresh mushrooms,onion topped off with canned corn. Some pasta was left out. Used cream of chicken soup. Very versatile! I made it the original way too and it was very good. It's a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "Easy and quick to make and most of all, very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miyako"
},
"reviewBody": "It was good and simple. It is a good starter to when making tuna casserole, and can be very customizing to your taste! I added mayo at the cause it needed at bit more flavour but I like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cosmic_krissy"
},
"reviewBody": "I used cream of chicken instead of cream of mushroom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kitsune"
},
"reviewBody": "A little dry, so I mixed in an extra cup of cheese, an extra can of cream of mushroom soup, an extra can of veggies, and hooked it up with lemon pepper, garlic powder, paprika, dill, and smoky spice mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yazz"
},
"reviewBody": "This is really good. As the other reviews suggested i agree 2 cans of tuna are needed. I only used 1 can of soup, then added some milk and butter. At the end I sprinkled some breadcrumbs in top and after baking for about 20 minutes. I broiled for a little crunch top. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Shadle"
},
"reviewBody": "Super easy, taste was exactly what I was looking for. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yaya"
},
"reviewBody": "This recipe tasted pretty good and when following the recipe almost exactly, it wasn't a lot of cooking, mostly just mixing together. Even the baking part only took five minutes for my toaster oven. My brother and mom really liked it. However, I plan to add more tuna next time, probably double the original amount since the tuna was almost nonexistent. I'll also probably add salt because it was a little bland. Overall, the recipe as is was really good, it can be even better though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Pirozzoli"
},
"reviewBody": "Delicious! Thanks so much for posting your recipe! I had to make due with what I had in the house, so I used 2 cans of tuna, elbows, 4-cheese Mexican shredded, a Cauliflower medley instead of the mixed veggies, and added French fried onions. Still came out terrific."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Starshine"
},
"reviewBody": "So I gave this 3 stars because tuna casserole is great but in following this recipe, I wonder why you can't simply mix all ingredients in a bowl and bake as usual. The extra stove-top pan seems like a waste of dishes to me. Thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andrea B. Williams"
},
"reviewBody": "I do a lot of different adjustments to my tuna casserole. I make mine very similar to if I am making homemade mac and cheese pie. I start with making a roux (butter and flour paste) then I add milk to the paste. I let that simmer for a bit, then I add a few cups of cheddar cheese to the liquid mixture to make a cheese sauce, then I put it aside. In the meanwhile, I'd be boiling my noodles; I usually use Farfalle noodles (bow-tie). In terms of the tuna, I always fry my tuna before putting the casserole together. While frying, I add onions, garlic, paprika, a bit of cayenne and black pepper to the tuna. Then, I get my casserole dish, pour in the noodles, then the cheese sauce, and finally fold in my fried tuna. I sometimes add green peas for a fresh taste. I add grated cheddar cheese on top, and baking for 40 minutes. I wouldn't ever do it in any other way. So delicious. This recipe was at best a nice effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tjallan"
},
"reviewBody": "I made this and it was delicious, the only thing I did different was use bow tie pasta, and just peas instead of mixed veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion Ann Berry"
},
"reviewBody": "So easy to prepare and make. We love this tuna casserole - it has been put in our dinner menu rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Brantley"
},
"reviewBody": "l made it with what I had on hand and we loved it! Used a 13 oz box of penne wheat pasta, 1 can cream of mushroom and 1 can cream of mushroom with roasted garlic because that's all I had. I mixed in 1 mini block of Velveeta with 1/2 cup shredded cheddar and used a 12 oz bag of frozen mixed veggies (corn, carrots, peas and green beans). Spread more shredded cheddar on top before baking. Start to finish in one pan and in an hour. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ponytail Chef"
},
"reviewBody": "I tweeked it a bit but a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ken Barnes"
},
"reviewBody": "I added fresh mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "I make this often however, not with oil. You can add salt to the water, just a little, to prevent sticking. If you must use oil, use coconut. Far better for health. I add celery, corn, peas, and sometimes chopped up carrots. Load it with cheese on top. Kids love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misslissy"
},
"reviewBody": "Yummmmm! Right amount of tuna. Threw some French fried onions on top. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Easy Cheesy Tuna Casserole Haiku: \"Way too much pasta. Tuna gets lost in all that. Flavor's a yawn too.\" I love a good comforting tuna casserole, but this one was so heavy on the pasta-to-tuna ratio that it felt like all pasta. I used frozen mixed veggies instead of canned, but that was my only change. I'd do that (along w/ reducing pasta, increasing tuna and adding sauteed onion, garlic, and more spices) if I made this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "berncandy"
},
"reviewBody": "This was easy to follow and really good. I substituted the mushroom soup for French Onion soup just because my family is not a mushroom fan. Over all this recipe gave me inspiration"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScottyC"
},
"reviewBody": "I added another can of mushroom soup, tuna and also through in a can of french style green beans. It looked like a lot of noodles and no veggies or soup. Of course, i had to plus up the amount of cheddar as well. It is awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Whiting Ahlhorn"
},
"reviewBody": "I've made this recipe several times. We love it! My only changes are two cans of mushroom (makes it creamier), half a bag of noodles, and a whole bag of cheese. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "De Bree"
},
"reviewBody": "I made dinner for my boyfriends Family and I was praying that I would find the perfect recipe! This one made me look like I really knew my way around the kitchen, and they told me that I passed the test lol \nIt was delicious. The only things I did differently was change the pasta, and I mixed two different kinds of Cheese together (Mozerella and Gouda!) it was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karenm"
},
"reviewBody": "So i followed a few of the other suggestions from reviewers and this turned out pretty good.\n\nI used 2 x condensed mushroom soup and added 1 can water\n2 tins of tuna\n1 cup of peas (not tinned as we don't like the taste of tinned veg)\n\nI added crushed premium plus crackers on top covered in teh rest of the cheese.\n\nEveryone really liked this but next time i think i'll try adding a little seasoning (salt pepper etc...) my kids generally won't eat anything that has been seasoned so i tend to cook new recipies without then add in as needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leslie Murin"
},
"reviewBody": "Fine as is. The oil didn't seem to hurt it. I added another can of tuna and milk since it was too thick without it. Also dried onions as I like that in my casseroles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Hand"
},
"reviewBody": "Although I didn't make this recipe to a \"t\", it was a great base. I used leftover wheel pasta - probably half a bag. I used cream of celery soup, a can of peas, shredded swiss in the mix and then a 4 cheese blend on top. Also used a garlic salt and pepper mix to taste. We had no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DGREENWOOD"
},
"reviewBody": "I made this pretty much as is and while I liked the texture and creaminess of it, I did not like the mushroom soup taste that I got from it. We would prefer a milder taste in our house so Ill try again but will use cream of chicken soup next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "oszbbk"
},
"reviewBody": "This was a nice quick dish! I was looking for something to make with some leftover pasta I had in the fridge. I added 1 can cream of celery, garlic salt, parmesan cheese, and substituted the mixed veggies with green beans. Saved it as I am sure this will become a staple for busy nights."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alestelle"
},
"reviewBody": "This recipe is absolutely amazing with a few changes:\n1)I used 2 1/2 cups of pasta and I used 2 cans of tuna instead of just 1.\n\nAlso, I highly recommend using the regular cream of mushroom soup. It's not as tasty if you use reduced fat or fat free :) \n\nEnjoy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I reduced the recipe by 1/2, and even though the yield says 2 servings, I got about 5. I used 12 ounces of pasta instead of 16, and substituted the can of veggies for 1 cup of frozen veggies. I also added a few crushed croutons on top. My picky teenager asked for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RevivedLife"
},
"reviewBody": "was scrounging around for something to make for dinner and came across this recipe after I input what I had in stock, can't say anything bad about it! The hubby was glad to see a casserole on the table for supper, and it had so much flavor! A++ for this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilydonovan"
},
"reviewBody": "quite tasty and a very simple recipe. Great alternative to the traditional tuna noodle casserole. Loved the cheese and the veggies (used frozen also)---great way to \"trick\" the kids into eating their vegetables when its camoflaged in a great casserole. I'm always looking for new ways to prepare tuna...added garlic powder and onion powder for a little extra seasoning...will keep this in the repetoire when I need a simple family pleasing reciple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Horton"
},
"reviewBody": "I would have given 5 stars but like others i did modify, I used Velvetta, linguine noodles,garlic powder, pepper and a little seasoning salt, and to the top crushed saltine crackers and finished with a little melted butter on the cracker top. It was excellent this way to my family. Oh I omitted the oil as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marthajones"
},
"reviewBody": "This is the Tuna Casserole everyone loves and is the one which I love to bring to our potlucks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie C"
},
"reviewBody": "This was good, I did add an extra can of tuna because one can is just not enough for all that pasta and I also added a can of mushrooms since hubby and I love mushrooms. Everything else I followed exactly and was not too crazy about the can of mixed vegetables, it wasn't bad but next time I will use some frozen mixed peas and carrots thawing them out when the soup and cheese mixture is heated and they will finish warming in the oven. Will make again with my suggested changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Thomas"
},
"reviewBody": "My husband really liked. Super fast meal! Didn't use cheese to make it healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis"
},
"reviewBody": "BEWARE OF THE OODLES OF NOODLES!!! You do NOT need that much! This was great! I added a few chunks of Velveeta, an extra can of cream of mushroom soup, and an extra can of tuna. I also added a few spices and some garlic. I used Rigatoni noodles and I topped it with some parmesan cheese and shredded cheddar. Almost forgot- I used only 12 ounces of noodles, which may have been a bit much (even with the extra can of soup), next time I may only use 10."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "srrh"
},
"reviewBody": "This turned out delicious, but the recipe was quite vague on cooking times. I heated the soup mixture just until the cheese melted into it, and I baked the whole concoction for 15 minutes. I made a few adjustments. 1) I only used 8 ounces of noodles, 2) I used 2 cans of tuna, 3) I substituted asparagus for mixed vegetables, and only used half as much, 4) I added just a pinch of mustard powder, 5) I added 1/3 cup of parmesan cheese to the topping. Haha, on paper, it looks like a lot of adjustments! Anyway, we really loved this, and the whole tray was gone in 15 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AKI101"
},
"reviewBody": "This turned out pretty good. Few notes: we added two 5oz cans of tuna and it still didn't really taste too much like tuna so we'd add at least 12oz next time. Also, it turned out a bit dry so we'd try to bake it for less time next time or add to add some milk to keep it more moist. Overall, pretty good and we'd try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran Thibodeau"
},
"reviewBody": "Wonderful, delicious, inexpensive meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Davies"
},
"reviewBody": "Could not stop eating this. As a new cook, I took advice from others. Half the pasta, added can of cream of chicken, used carn of corn and can of green beans. Added salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KitKar"
},
"reviewBody": "dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The best thing about this recipe was how easy it was. However, to make it tasty, and to make it serve two people a normal portion, I had to make a lot of changes. \n\nI used less than half the pasta (200g total) and less than half the cheese (100g total). I used about a cup of frozen mixed veg., which I heated in the microwave while the pasta was cooking. I omitted the oil from the pasta cooking process as it is unecessary and would have added more fat to a recipe already bursting with fat.\n\nI added about a quarter cup of milk because the mixture in the saucepan was too pasty. I seasoned with a herb-and- spice salt mix, and added pepper, but it still didn't have enough zip so I added a bit of parmesan cheese.\n\nEven after reducing the amounts, I still ended up with about 2.5 servings, enough for me and my husband and our toddler. The end result after the changes was delicious comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georgieandbaileysmommy"
},
"reviewBody": "So easy and hubby loved it!!! He is picky about tuna casseroles and this was simple and delicious. I used 2 cans drained tuna, 2 cans cream of mushroom chicken, 1 can peas and carrots drained, wide egg noodles, 1 stick butter and 2 cups shredded monterey jack and cheddar cheese. Followed directions for preparing and baking. I did add pepper to mixture and garlic salt. Delicious, thanks for the great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara B."
},
"reviewBody": "Very Yummy! I made this for my husband and son, and they LOVED it! (and they aren't big tuna fans!) This will definately become a regular in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "fattyb"
},
"reviewBody": "this was my first bad pick of recipes. in fact, i even made an account so i could write this review. i had all the ingredients on hand in my home already so it was a quick pick. before i started cooking i read the reviews and took many of the added suggestions (double the tuna, cream of mushroom, pinch of garlic salt) and still this casserole was really bad. my boyfriend said it wasnt that bad but he only had one bowl..even with the popular add-ins this was a very bland, unattractive and not so appetizing dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kare"
},
"reviewBody": "Not so great. Nobody in the family liked this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer"
},
"reviewBody": "I added 1/2 stick of butter to the mix and this was delicious! The whole family raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom"
},
"reviewBody": "Just what I was looking for. One that I could make my own. Another good recipe from the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookinBug"
},
"reviewBody": "Call me crazy, but I love tuna casseroles. This is one of the better ones I've tried (I still think my mom's is the best). I did omit the can of mixed veggies, using chopped celery, a can of green beans, and a can of mushrooms instead. I also added garlic powder and did sprinkle the top with french fried onions about 5 minutes before it was due to come out of the oven. Yummy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Spencer"
},
"reviewBody": "it was ok. gonna doctor it up a lot more next time. kids ate the heck out of it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABIDOLL02"
},
"reviewBody": "Very forgiving recipe, can use any kind of pasta, soup or vegetable. Make it your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roxy B"
},
"reviewBody": "I'd hate to just reiterate what everyone else is saying, but it's all true. I also made the following adjustments and I think it will just keep getting better and better as I suit it to my taste. 8oz instead of 16oz whole wheat pasta, 2 cans healthy request cream of mushroom instead of 1, 2 cans of drained tuna instead of 1, added some garlic pepper, parmesan cheese, and bread crumbs on top. Comfort food at its best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "yet another one that my family enjoys. My son has a hard time with pasta in general, but he loves tuna!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "I have always loved tuna casserole and this one is great. I've tried it several times but I use three or four cans of tuna, Cream of celery soup and add a can of drained, rinsed canned corn. Yummmoooo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cassidy Jones"
},
"reviewBody": "I didn't love this. I didn't have Cream of Mushroom so I used Cream of Broccoli, but I don't think the change will make it any better. It was very bland and kind of mushy. I won't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VALERIE"
},
"reviewBody": "Too much pasta and I had to double the rest of the ingredients. Very bland. I ended up eating mine with picante sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "Mmmmm so good! I used broad egg noodles, tripled the tuna and soups, garlic and onion powders and over the cheese I added a nice crunchy topping of buttered panko bread crumbs. My gang had three helpings! Comfort food at it's best. Thanks so much Wendi!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "I used many of the suggestions below...4 oz of velveeta, plus 2 cans of soup and 2 cans of tuna. I didn't have mushroom soup, so I used Cream of Celery instead. In addition, I added a bit of milk to the tuna mixture (1/4 to 1/2 a cup) to make it a bit creamier. I also added salt and pepper on top before baking. After the cheese melted I sprinkled the top with some Italian breadcrumbs I had in the pantry and baked for about 5 more minutes.\n\nMy 2 year old asked for seconds, even thirds and she rarely eats a casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelsey"
},
"reviewBody": "This was not the greatest casserole... but I think it's a good recipe if you're trying to get rid of things in your pantry or don't have the typical ingredients for a tuna noodle casserole on hand. Ex. egg noodles, peas, red pepper..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "Tasty, quick, and easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tom L"
},
"reviewBody": "Very dry, but tasted decent. Too much pasta in recipe. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "We really like this casserole. It's definitely a basic, simple recipe, but it's easy to play with the ingredients. This definitely serves about 4-6 people. I always use 2 cans of tuna and 2 cans of cream of mushroom soup, otherwise it's too noodle-y and a bit dry. You can also play with the spices- salt and pepper are a must! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "This is a good simple recipe. If you want a more striking taste, you can add more spice, different veggies, a topping, etc. to make it more exciting. Both my son and husband had seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DM"
},
"reviewBody": "For how easy this dish is to make, it's great! Prep takes literally minutes, which is important for new moms like me who don't have much time to cook! The only thing is that it tasted a little dry the first time around, so next time I added butter before putting it in the oven, and it turned out yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TARAHALL"
},
"reviewBody": "My family loves this recipe! It's easy, and delicious. It's an excellent \"base\" recipe, so we have tinkered with the recipe (more cheese, different toppings, etc.) and have come up with some great combos! Also, a good recipe for beginners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catie Miller Cooper"
},
"reviewBody": "Not a bad recipe - pretty much your basic tuna casserole. I used less noodles (recipe calls for waaaay to many!) and added and extra can of soup and an extra can of tuna. I also used frozen veggies instead of canned. Hubby liked it ok, and my picky 4yo son actually didn't complain (a miracle @ dinner time). Will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvalcaide"
},
"reviewBody": "I like it because its very quick and simple. Perfect when you don't have a lot of time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "GOOD STUFF"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "singlemomcooking"
},
"reviewBody": "I'll stick to my mother's recipe and although I used extra sharp cheddar cheese is was just bland and a bit drier then I am used to. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SUMBODEESMAMA"
},
"reviewBody": "This recipe was very simple and seemed bland on paper. My family are cheese freaks, so I added 4oz of Velveeta to the soup mixture, as well as half a package Lipton's Recipe Secrets Savory Herb and Garlic. My children asked for seconds!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BUNNYBEAR81"
},
"reviewBody": "Incredibly easy to prepare and very delicious. Add a little zing with some chopped hot peppers and sliced olives ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was a really good recipe but you have to put more soup and less noodles than it calls for or it will not come out ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added twice the amount of tuna and some extra cheese, and it still turned out blah. Flavourless at best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOSYDAISY"
},
"reviewBody": "It was yummy, the serving size is pretty big for 2. I substituted frozen green peas and carrots with celery and that was very good too. Took short time to prepare and tastes very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "George Thogersen"
},
"reviewBody": "This was pretty good for what it is, a fairly fast and easy meal. Did use two cans of tuna, I think one would be not nearly enough. Also, added bread crumbs sprinkled with butter (toasted under broiler for a few minutes) instead of cheese spread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IVERYGIRL"
},
"reviewBody": "This was pretty good stuff for a cold day. I added a couple of herbs to it and left out the cheese, and it was very satisfying. My two boys, 2 and 3, ate it up! It only took a minute to make, and the leftovers were just as good. Another keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liss"
},
"reviewBody": "I used fresh veggies and it turned out great. It was really easy and I had everything in the cuboard or fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used half the pasta (and used egg noodles)\r\nDoubled the tuna and soup cans, used frozen veggies (brocolli florets &amp; peas) and 3 cups cheddar.\r\nHint - add brandy or cognac to soup for wonderful flavor. WOW!\r\nAdded buttered breadcrumbs on top.\r\nAnd the best cooks say NEVER oil your pasta. If you are adding it directly to the mixture after draining - there shouldn't be any sticking. This is a favorite for me, hubby and friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynn Anne Cutler"
},
"reviewBody": "Nice taste, mild, even using sharp cheddar. Recipe worked perfectly.\r\n\r\nI added pepper but no salt; used defrosted frozen veggies instead of a can. Next time, I'll try doubling the fish for more of a tuna taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lin Snow"
},
"reviewBody": "Good flavor and amazingly easy! We used extra cheese and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought this was great. I only used peas, and added crumbled crackers to the top. Everyone in my family loved it. There weren't any leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Bland, boring and just not very good at all. Using cream of chicken instead of cream of cream of mushroom helped a little, but not much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THIS RECIPE HAS MADE ME LOOK LIKE A HERO. WE HAVE HAD A GREAT DEAL OF COMPANY LATELY. I WHIP THIS DISH UP FOR LUNCH WITH A SIE OF SALAD &amp; GARLIC BREAD. I USE CANNED CHICKEN (1 CAN) &amp; IT WAS WONDERFUL. THANKS FOR A REAL WIFE-SAVER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "i thought this recipe was great! It was so yummy and i made a double batch and it was so nice for leftovers! Great recipe! A keeper!!:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My kids claim not to like tuna but they came back for second now didn't they! I think the cheese really makes this recipe special."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LCOLLEENW"
},
"reviewBody": "an excellent family meal, I suggest you make a double recipe and freeze leftovers, great to reheat in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Leanne"
},
"reviewBody": "not the greatest casserole."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21284/easy-cheesy-tuna-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
"name": "Fish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/415/seafood/fish/tuna/",
"name": "Tuna"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21284/easy-cheesy-tuna-casserole/",
"name": "Easy Cheesy Tuna Casserole"
}
}
]
}
}
, "about": [
]
}
]