				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Chocolate Creme Brulee"
,"datePublished": "2020-06-18T23:27:02.000-04:00"
,"dateModified": "2020-06-18T23:27:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LSNEED62"
,"url": "https://www.allrecipes.com/cook/1455540"
}
]
,"description": "What can be better than silky smooth creme brulee with rich chocolate? You don&#39;t even need to water-bath this version! Use heart-shaped ramekins for a Valentines Day treat. This so easy and delicious, you&#39;ll look like a professional chef! For an elegant presentation, top with a few raspberries and a mint sprig."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FgnaDQ7HM5LYIA3h70bkIqRFhgc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9064964-7dc687f34c0a406fb49224ed3935e73f.jpg",
"height": 960,
"width": 1280
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Chocolate Creme Brulee"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "24"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "778 kcal"
,"carbohydrateContent": "35 g"
,"cholesterolContent": "525 mg"
,"fiberContent": "1 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "41 g"
,"sodiumContent": "74 mg"
,"sugarContent": "29 g"
,"fatContent": "70 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 quart heavy cream",
"0.5 cup white sugar",
"2 teaspoons vanilla extract",
"9 egg yolks",
"0.5 cup chocolate chips",
"2 tablespoons white sugar, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Set 6 (6 ounce) ramekins on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Pour cream, sugar, and vanilla into a saucepan, and place over medium heat. Stir to dissolve the sugar, and heat until it begins to simmer, then remove from heat. Place egg yolks in a large bowl, and slowly whisk in the hot cream mixture, about 2 tablespoons at a time, until you have added approximately a cup of cream to the yolks. At this point, pour in the remaining cream, and whisk until smooth. Stir in the chocolate chips, and set aside for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir the mixture until the chocolate is smooth and evenly distributed. Pour into ramekins, and bake in preheated oven until the center is just set, 15 to 20 minutes. Remove from oven, and allow to cool for 45 minutes, then place into the refrigerator, and chill until cold, about 6 hours."
} ,{
"@type": "HowToStep"
,"text": "Place oven rack in topmost position. Turn oven to Broil."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle the tops of each creme brulee with sugar until evenly coated, gently pour off excess sugar. Place ramekins onto a baking sheet, and place under the broiler until the sugar bubbles and turns a light caramel brown. Serve immediately."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT440M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Dalton 'Lizzie'"
},
"reviewBody": "Nice recipe! My creme brulee got a little lumpy but it still tasted good. I would add more chocolate chips next time! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "Next time I'll halve the recipe, but increase the amount of chocolate chips and mix them in with just a small amount of the cream to better blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "belle4397"
},
"reviewBody": "I haven't actually eaten these yet, but I'm pretty disappointed with the recipe. I'm sure they'll taste fine, so I still gave 3 stars, but there was a lot off with this recipe. I almost always read reviews before making something, but this time I was too lazy and regretted it. I had to improvise using some pyrex dishes to make some extra \"ramekins\" for the extreme excess of brulee mixture. WAY more than would fit in the ones I had. Also, just go ahead and use the water bath that every other brulee recipe uses. It's really not that much trouble. I couldn't even tell when these were done because they were all boiling! As in, literally, boiling inside the ramekins. Also, I could tell after mixing it together that this is going to be very light on chocolate. I would at least double it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilana Brown"
},
"reviewBody": "So good and so easy! I upped the chocolate to 1 cup for 4 servings, and there was really more like 5 servings after I changed the recipe - which is fine! Who is really going to argue about MORE chocolate creme brulee?!\nI also used my blowtorch because that is way more fun than a broiler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Love2CookMommy"
},
"reviewBody": "I loved how the Giradelli chocolate tasted in this recipe. I cut the serving size to 4 ramekins and it made 6. To my liking, I like my creme brulee to not taste like flavored cream but to be more custard like with vanilla or in this case chocolate. Instead it tasted more like chocolate cream instead of a custard. In my eyes, the best creme brulee is the one that keeps the ingredients secret because you can't decifer the individual ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glfbbc"
},
"reviewBody": "My first attempt at Creme Brulee with this recipe and it came out perfectly! I did as the Chef recommended by using more chocolate chips and pouring the hot cream/egg mixture OVER the chips for a few minutes to allow it to melt. The recipe says to MIX the hot cream/egg mixture with the chips, but I actually used the whisk for a few seconds which nicely blended the chocolate evenly into the cream mixture. Since my family is evenly split in their preference for either vanilla or chocolate creme brulee, I simply poured half of the hot cream/egg mixture into ramekins before adding the rest into the chocolate chips. Both vanilla and chocolate brulees turned out fabulous! Garnished with a few blackberries on top. I'll definitely make again for a dinner party or special occasion!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kam"
},
"reviewBody": "I am a pastry chef so this is a good basic recipe that needed some help. One I added 1 1/2 cups chocolate chips. Second ladel only enough custard over the chocolate just to cover it and allow to melt. Whisk it till smooth. Then add the remaining custard. This will give you a smooth and uniformed chocolate cusrtard with out chocolate chunks. Then followed the recipe as stated. It was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica Farkas"
},
"reviewBody": "I love that I didnt have to water-bath this recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "casey"
},
"reviewBody": "I couldn't give this recipe a better review for the same reasons of the person before me. \nI made revisions as I went along, however, and it came out amazing.\n\nFirst thing, I cut the recipe back to 4 servings, which resulted in 5 4oz servings.\nI used a pint of heavy whipping cream, mixed in the vanilla extract and added some fresh grated nutmeg. I warmed the cream until scalding and removed it from the heat, and carefully whipped in an 11 oz bag of 60% cacao Ghirardelli chocolate chips. \n\nIn another bowl I mixed 4 egg yolks with 1/3 cup powdered sugar and then mixed that into the chocolate cream. Then into the ramekins, which I did stand in a bain-marie. (Which for me was a casserole dish with some water, with the ramekins sitting about 1/2 submerged) it is easy and cooks the creme brulee's to perfection.\n\n30 minutes later at 350, they were perfect. I love breaking through the hardened sugar with my spoon. \n\ndelish with these modifications!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "robin"
},
"reviewBody": "My 10-year-old daughter wanted to make chocolate creme brulee, and when I found this recipe I thought it just might be easy enough for her to make (with assistance, of course!). It turned out great! Creamy, perfect consistency and yummy! We only changed a couple of things: I changed the recipe to 4 servings on this site. It ended up making 6 very full 4oz ramekins. Check the size of your ramekins if you are unsure! This matters, and please note that this recipe states 6 oz size. All you have to do is adjust accordingly. Instead of using chocolate chips, my daughter selected a really nice chunk of milk chocolate (from the specialty grocer) we chopped off about 3/4 cup for the recipe to make sure it was chocolaty enough. Also, I used part heavy cream and part half-and-half, just to cut the richness a bit. It ended up taking a little longer to cook than stated; just keep watching them until they are \"set\" in the middle (not jiggly). Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lala2mix4u"
},
"reviewBody": "Delicious. I first made this recipe about 2 years ago. This has been a hit for parties... I sometimes make 2 or 3 different flavors of creme brulee but this is alway the show stopper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haneen:)"
},
"reviewBody": "i loooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooove it iiiit's like heven in your mouth i love it then anything ihave ever tasted"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SunnyByrd"
},
"reviewBody": "I feel like there is a lot wrong with this recipe and that I can't give it a good review even though it turned out in the end - and I really hate giving poor reviews. I was suspicious of a couple of things when I started, but my brulee experience is limited - so I wasn't sure I knew enough to start questioning the recipe. I should have anyway. I think there is an error in the amount of cream. Even scaling this recipe down to 4 servings, I ended up with 6 - and my ramekins are larger than 6oz (I also think if the cream amount was corrected that there may be a better chocolate ratio to this). The cooking time is either too long, or the oven temp is too high. I pulled mine out of the oven after 15 minutes because it started to bubble(!). There isn't quite enough chocolate in this, which was okay when I garnished it with more - but not really okay on its own. I think adding a block or two of chocolate to the Creme Brulee recipe on this site is the route I'll go next time if I want a chocolate brulee. Thanks for the recipe anyway! We ended up enjoying it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OLGA"
},
"reviewBody": "The best! This is what you would expect to eat at a fine french restaurant. I made if tor New Years! My whole family loved it. Great to impress :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pfox"
},
"reviewBody": "This dessert was delicious!! My husband lost a bet and picked this to make for dessert, and I couldn't believe how good it was. It was easy enough for a very inexperienced cook!! We will definitly make this again and again, or should I say he will:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Turner"
},
"reviewBody": "We loved this creme brulee! I had a little trouble blending the chocolate into the egg and cream but it didn't affect anything. I've done it twice, still had trouble with the chocolate but it was wonderful anyways!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Kelly"
},
"reviewBody": "I thought this was fantastic! However, I think it is an acquired taste. I probably won't make it again as my son and my husband didn't much care for it. But, a lot of others really liked it. And I thought it was just awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jweaver"
},
"reviewBody": "This recipe turned out awesome. A previous reviewer was correct when she mentioned the quantity was off...after filling my ramekins I had plenty left over. Fortunately I was prepared with extra ramekins. I would also advise you to continuously stir the mixture while ladeling it out since the chocolate will settle to the bottom. I took this dessert to a dinner party and it got rave reviews. This one is a keeper in my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kurt K."
},
"reviewBody": "6 - 4oz ramekins (24 0z) used with 1 quart (32 oz)cream, plus eggs, sugar???? Help I need more ramekins !!! Too little chocolate for so much cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pirate Captain"
},
"reviewBody": "Absolutely delicious! I made it for a friend and she couldn't stop talking about it. AMAZINGLY GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a very easy recipe and delicious!! Rich and creamy."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/132951/easy-chocolate-creme-brulee/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
"name": "Custards and Puddings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14444/desserts/custards-and-puddings/creme-brulee/",
"name": "Creme Brulee Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/132951/easy-chocolate-creme-brulee/",
"name": "Easy Chocolate Creme Brulee"
}
}
]
}
}
, "about": [
]
}
]