				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Garlic Escargots"
,"datePublished": "2016-06-04T09:43:52.000-04:00"
,"dateModified": "2023-02-20T12:47:50.000-05:00"
,"author": [
{"@type": "Person"
,"name": "CraZee A"
,"url": "https://www.allrecipes.com/cook/1780843"
}
]
,"description": "This escargot recipe is made with canned escargots cooked in butter and garlic, stuffed into mushroom caps, then baked with wine sauce and cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AwHSsKkZhCQjggBLKIduGnzJYjU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/159391-easy-garlic-escargot-ddmfs-3X4-13181334-d76f4bc9ef564183a13d5a2d66f960c2.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Garlic Escargots"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "52"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "405 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "142 mg"
,"fiberContent": "0 g"
,"proteinContent": "27 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "382 mg"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (7 ounce) can escargots, drained",
"6 tablespoons butter",
"1 clove garlic, minced",
"20 mushrooms, stems removed",
"0.33333334326744 cup white wine",
"0.33333334326744 cup cream",
"1 tablespoon all-purpose flour",
"0.25 teaspoon dried tarragon",
"1 pinch freshly ground black pepper, or to taste",
"0.25 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place escargots in a small bowl and cover with cold water. Let sit for 5 minutes to remove any canned flavor they may have."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x8-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Drain escargots and pat dry with a paper towel."
} ,{
"@type": "HowToStep"
,"text": "Melt butter with garlic in a large skillet over medium-high heat. Add escargots and mushroom caps; cook and stir until mushroom caps begin to soften, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Whisk together wine, cream, flour, tarragon, and pepper in a small bowl until well combined. Pour into the skillet and bring to a boil. Cook, stirring occasionally, until sauce thickens, about 10 minutes. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Place mushroom caps into the prepared baking dish, with the tops facing down. Spoon an escargot into each mushroom cap. Pour sauce from the skillet over mushroom caps, then sprinkle grated Parmesan cheese over top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until cheese has turned golden brown, 10 to 15 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crystltpt"
},
"reviewBody": "It was good, but will not make again due to the fact that it seemed bland to me. The mushrooms seemed over whelming. Ilove mushrooms, but I did miss the butter/ garlic sauce that I love ! I had to add a touch of seasalt also..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMAC41"
},
"reviewBody": "I have made this twice. Once with mushroom caps, stuffed as instructed, and once just with sliced mushrooms all free in the Pyrex dish. Didn’t make any real changes. Love this easy and delicious way to prepare escargot! You’ll want some crusty perfect bread chunks handy to help sop up all that wonderful juice! So evil in the mist delicious way!! The best way to fall off the keto wagon for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy McDonald"
},
"reviewBody": "Better than any fine dining restaurant that serves this! Everyone I've made this for raved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Rider"
},
"reviewBody": "I absolutely loved this recipe. First time trying or preparing escargots. Walking through the International Isle at the supermarket I saw the Roland can of Escargots, and figured, eh, I can't afford it in a restaurant so I will try it for the first time at home.\n\nI read through the review comments before attempting the recipe and took a few tips from there. I removed the mushroom caps and escargots from the skillet BEFORE adding the flour/cream/wine mixture to the skillet to form the sauce that would afterwards be poured on top of the mushroom caps stuffed with escargots.\nI used baby bella mushroom caps and found those to be the perfect size, some could hold 2 snails. I used Chardonnay for the wine. One reviewer said they couldn't taste the wine so I added about a 1/3 cup more than the recipe...it would've been better if I kept to the original amount called for. I also added fresh minced shallots and much more fresh minced garlic than it called for, but I can never get too much garlic, and used Irish grass fed Butter (the difference in taste is palpable!) The 8x8 baking pan I lightly coated with bacon grease. \nFor a finale towards the end I topped with crispy garlic-peppered onions.\n\nI will definitely be making this again! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwendolyn"
},
"reviewBody": "I enjoyed most of how I made this.\n\nI used rum instead of wine; I will use wine next time,\n\nI used 7 mushrooms and rice flour.\n\nI plan to use the sauce on some noodles.\n\nThank you for this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonard Jaworski"
},
"reviewBody": "This is Awesome Thankyou. What a great appetizer for my seafood Dinner. Excellant fir a Football game\nCanadian Championship- THE GREY CUP"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "It has a beautiful sauce that goes over the escargot but I just wish I had added more garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Ruff"
},
"reviewBody": "Was very tasty, I'd thicken my sauce a little more next time as mushrooms put iff water as they cook down . Over all yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shel's Kitchen"
},
"reviewBody": "The only thing missing from this recipe is fresh squeezed lemon! Otherwise perfect. I of course added lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdyer"
},
"reviewBody": "Thank you for this fantastic recipe. I did double the garlic but made it exactly as written. Fantastic! I will try it with crab instead of escargot the next time because of the cost of the escargot. This sauce could be put on anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Moser"
},
"reviewBody": "Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisalight"
},
"reviewBody": "We made this using frozen snails from the Asian supermarket. They tasted fine but were quite rubbery. I would advise against using frozen. I'd like to try again using canned or fresh to see if the results are the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim C"
},
"reviewBody": "This came out perfect! Followed the directions almost exactly (I did add more cheese!) I would cut back on the butter just a bit, but is was soooo good! Super for New Years eve!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason Sparling"
},
"reviewBody": "These were amazing. My daughter ate several, cried when she found out they were snails, then ate some more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlene Harrison"
},
"reviewBody": "Excellent. My daughter in law said \" Grandma this recipe is a keeper\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanna Lösche"
},
"reviewBody": "I have been looking for a escargo recipe for a while now. Totally trying this one and plan on serving it on top of a perfect medium rare steak. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keeli"
},
"reviewBody": "This is a perfect recipe if you like escargot and are trying to work up the courage to buy canned snails and make it at home. Very simple and tasty recipe, but we found it too heavy with butter and cream and the sauce too thick for our tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoCosmom "
},
"reviewBody": "I didn't have enough mushrooms on hand so I chopped them. Followed the recipe religiously. We ate it with Turkish herb bread. My picky eater husband raved that it was really really good. He asked me to pack the left overs for his lunch tomorrow. Will certainly make it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LJW"
},
"reviewBody": "Nice recipe. I added more garlic but really needs about 3-4 cloves. I sliced the mushrooms and added shallots and served in pastry cups. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "good recipe!! chopped the mushroom stems and added to the sauce.had really huge escargot so I upped the cream and wine quantities,more tarragon and used 4 cloves of garlic-glad I did..served mine toasted slices of french bread. very happy with the result..Thanks for the direction!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Fowler"
},
"reviewBody": "Omg was delicious. I did prep it all in the afternoon before my guests arrived. When it came time for dinner, then I put the cheese on it and baked it. Turned out fabulous! Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hmmmmmmm"
},
"reviewBody": "So easy and delicious !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "Excellent! The wine/cream sauce takes this over the top. No need to change a thing. I served it with toasted french bread - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelleborth"
},
"reviewBody": "I didn't have white wine and had no desire to buy any; hate it. So I subbed Welch's White Grape juice. OMG WHO WOULD KNOW THE DIFFERENCE?! THESE ESCARGOT ARE AMAZING! Best ones I've ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teege"
},
"reviewBody": "Perfect! Restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "Easy and delicious. I made these twice. Both times turned out great but the first time I used large mushrooms and they turned out better). Both times I had some extra mushrooms so I poured the sauce over those and it worked well for the people who didn't want to eat snails. It made a convert of my husband who claimed to hate escargot. They are difficult to make look really nice but I guess that's the trade off you make for their saucy goodness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyle Priddle"
},
"reviewBody": "GREAT ,,Nothing more to say , and easy as well . Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaz"
},
"reviewBody": "A really nice alternative to traditional escargot.\r\nI prepare escargot at least once a month and typically as part of our entrée. Adding the mushrooms really adds volume and it was just a bit too much, for us. The flavor and presentation is really good. I think if I prepare it again I will serve it as an appetizer planning 3 per person. My only \"adds\" were a light dusting of bread crumbs before baking ...... and I broiled the last 3 minutes of the bake time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zven"
},
"reviewBody": "They're delicious in this recipe but I would use less butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krysta Marie"
},
"reviewBody": "AMAZING!!!! Great for dinner party, doing the sauce and mushrooms early in the day pop them in the oven we guests arrive makes a wonderful appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ajijic"
},
"reviewBody": "I served it at a New Year party and it was a hit. Many asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicmic921"
},
"reviewBody": "Delicious. I didn't have any mushrooms, so I made the recipe without. Next time I will buy the mushrooms to stuff the escargot in. I upped the garlic to 3-4 cloves instead of just 1. I also decreased the butter. Next time I think i will add some olive oil during baking. I love to dunk the bread in the sauce.. but it was quite thick. So if I can just get a little more runny consistancy (maybe decrease the flour &amp; add a little evoo) it will be perfect for bread dipping at the end. Yummo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AdrienneWJ"
},
"reviewBody": "Mixed snails with some salad shrimp. Since no one allergic to seafood in my family, I didn't tell them what the mushrooms were stuffed with and they still loved them when they found out. Very filling. Used larger mushrooms than buttons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberley"
},
"reviewBody": "I made these once before and they were absolutely delicious. My boyfriends Mother loves escargot and when she first put one in her mouth she went MMMMMMM. Thanks for the recipe. Will be making once again tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Auntie Mame"
},
"reviewBody": "While these were good, there just wasn't a \"wow\" factor. I will try them again and tweak the recipe a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CraZee A"
},
"reviewBody": "Glad everyone has enjoyed these! Made a twist on them today for a potluck (as many folk do not like/won't even try Escargots LOL). Basically the same recipe, but a filling of precooked and diced crab and shrimp instead of the escargot, with some diced celery and roasted red pepper. And add it near the end of step 4 to avoid over cooking, not at step 3. everything else remains the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcapocelli"
},
"reviewBody": "Very, very good! I would recommend using fresh snails over canned, less of that canned taste. Make sure you have big mushrooms also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YOGI"
},
"reviewBody": "these were very good, just sprinkled some breadcrumbs on top of parmesan. loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMCLRH2O"
},
"reviewBody": "We had escargot in the house, but no mushrooms, so we made this recipe without the mushrooms. It was fantastic! The mushrooms would only have been an added bonus. The sauce was to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gswoody"
},
"reviewBody": "These were really good, kind of sloppy looking, but really good. My husband really liked them. I was hoping for more of a wine taste, but that could have been because I had no cream and had to use evaporated milk instead. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "My husband loved it! I didn't have any tarragon, so I added some parsley to the sauce. It was really good and I'm not a big fan of escargot. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Zimmerman"
},
"reviewBody": "Best escargots I've ever tasted! Made some changes. I prepared this as an entree for my husband and me. The can said 12 escargots but there were actually 15. I used 10 \"stuffing mushrooms\" (large) and put 2 escargots in the largest ones. Had to use a larger baking dish. Increased the garlic to about 4 cloves (we LOVE garlic!) and the white wine and heavy cream to 1/2 cup each. Also increased the tarragon to 1/2 teaspoon. Removed the mushroom caps to the baking dish before adding the cream mixture to the escargots in the pan and sprinkled a little kosher salt over it. Didn't measure the Parmesan, just sprinkled over the entire dish before baking. Baked for 15 minutes and browned lightly under the broiler. The wine was chardonnay. This is heaven in a dish! Don't know how it would have been as leftovers as we had none!! You won't regret trying this one!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/159391/easy-garlic-escargots/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
"name": "Mushrooms"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
"name": "Stuffed Mushroom Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/159391/easy-garlic-escargots/",
"name": "Easy Garlic Escargots"
}
}
]
}
}
, "about": [
]
}
]