				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Cashew Sea Salt Toffee"
,"datePublished": "2014-09-15T15:15:44.000-04:00"
,"dateModified": "2020-06-19T00:00:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Diamond Crystal Salt"
,"url": "https://www.allrecipes.com/cook/diamondcrystalsalt"
}
]
,"description": "Cashews and milk chocolate toffee are easy using this quick microwave method."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_n8aYqoPn97rGQfkxc12R-pyT34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4458211-bfeed9bf560d4856afab6764623beb2d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Cashew Sea Salt Toffee"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "45"
}
,"cookTime": "PT8M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "356 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "36 mg"
,"fiberContent": "0 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "576 mg"
,"sugarContent": "34 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.5 cup butter or margarine",
"1.25 teaspoons Diamond Crystal® Sea Salt, divided",
"1 cup sugar",
"0.25 cup water",
"0.75 cup coarsely chopped cashews, divided",
"0.75 cup milk chocolate chips or chopped milk chocolate" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Butter the top edges of a 2-quart microwave-safe casserole. Add butter, 1 teaspoon of the Diamond Crystal® Sea Salt, sugar, and water to the casserole. DO NOT STIR. Microwave on high for 6 to 8 minutes. Check contents for color change. Continue microwaving on high a minute at a time until the mixture just begins to turn a tan color. You need to watch it carefully, and remember: DON&#39;T STIR."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle 1/2 cup of the chopped cashews into a 9-into circle on a Silpat mat, parchment paper, or on a buttered baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Carefully pour the liquid mixture evenly over the top of the cashews. Immediately sprinkle on the chocolate chips. Allow to sit for 1 minute to melt the chocolate."
} ,{
"@type": "HowToStep"
,"text": "Use spatula to smooth out chocolate over the entire sheet of candy."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle the remaining cashews and 1/4 teaspoon Diamond Crystal® Sea Salt over the top. Refrigerate to cool completely. When cool, break into bite-sized pieces. Store tightly covered in refrigerator."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I sub pecans for cashews and omit the salt. everything else is perfect. 8 min in the microwave. also, I add the chocolate chips to the toffee after I poured it, and let it sit, the warm toffee melts the chocolate and then I spread it. Sometime top with crushed nuts or candy canes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E96"
},
"reviewBody": "Very easy recipe! Follow instructions ***exactly*** as stated. Important to take the casserole dish out of the microwave when the “sauce” changes to a tan color (this will be a very noticeable change in color). It’s delicious! And I’ll be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mehitabel"
},
"reviewBody": "This turned out very well for me. I used unsalted butter- straight from the freezer, since I had none defrosted. It took a minute or two longer in the microwave than the recipe said, probably because of that. \nI used regular iodized table salt, half the amount called for, since Diamond Crystal has large airy crystals and table salt is much more compact. I toasted the cashews for the top and pulsed them in the food processor before sprinkling them on, for an Almond Roca-like pebbly texture. \nIn the proportions given, I found that the chocolate is a very obvious, dominant flavor, which is something to take into account when choosing your chocolate. My chocolate chips were generic-brand semisweet chips, and I'm fairly satisfied with the result. I thought the semisweet chocolate was a little too strong-flavored for the toffee, and would have liked to taste the caramelized sugar a bit more. The \"cheapness\" of my chocolate was also pretty obvious in the taste of the final product- but all chocolate is fairly delicious; NO REGERTS! Next time I think I may use a mixture of dark and milk chocolate, chopped from bars that would be worth eating plain.\nNext time I might also try a tiny bit or baking soda stirred into the toffee right before spreading- candy-making heats trigger thermal decomposition in baking soda and it bubbles and makes an airier, more \"tender\" crunch. I use it in microwaved peanut brittle to good effect. I really like tender toffee. \nThank you for such a great, easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Sweeney"
},
"reviewBody": "Phenomenal toffee and super simple to make. I start it off at 7 minutes 30 seconds then increase 1 more minute watching carefully. It turns a light tan in under 9 minutes. I made my first batch with some maple toasted coconut sprinkled on the pan before pouring the toffee over. Truly perfection. Thanks for sharing this recile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vestamc"
},
"reviewBody": "I made it as written except used chopped pecans as I did not have cashews. I had previously made toffee on the stove. After 15-20 minutes of stirring a hot pot I wasn't sure it was worth it. This was so easy! I did let it cool a bit longer before topping with semisweet chocolate chips as on the first batch the chips sunk in rather than staying on top to spread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TODDIEANNIE"
},
"reviewBody": "I made 3 batches tonight for an early Christmas party, but only needed 2 - need sugestions on how to keepthe other batch fresh for two weeks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina Mom"
},
"reviewBody": "This is incredibly simple and equally delicious! I made these for a neighborhood cookie exchange and will add it to my personal Christmas Cookie journal. Thank you, magically delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "I've made this several times this year and cannot believe I've never rated it. This is the easiest, best tasting toffee ever! I'm giving this one for Christmas gifts this year and I know everyone will love it. I find it addictive, one piece leads to another and another. The crunch is just right, brittle and melty in your mouth. Don't you hate toffee that is so hard that it feels like your teeth might break? Not the case with this toffee...it's the best. Make it as written, you will be in love with this toffee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kariepalmer"
},
"reviewBody": "I hated this recipe. The butter separated. I made it twice, the first time I cooked it too long. Not stirring prevents it from separating, however, it does not cook evenly. The second time I made it, I did not over cook. It still separated and just made a mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I came across this recipe and knew my husband would love it. So I made it for him for his birthday. And I was right! \"Eating this makes me feel like what I would imagine being on meth feels like\" was his verdict. Thanks for the recipe! Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Bruce Potter"
},
"reviewBody": "A favorite of my husband and father in laws and soo easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Laughton"
},
"reviewBody": "After burning the first batch at only seven minutes, I tried it again. It turned out wonderfully at six minutes! Just use caution towards the last minute in case you have a powerful microwave... This is super easy and super good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crissy"
},
"reviewBody": "So easy!! Used almonds and dark chocolate because that's what I had on hand and it turned out great! Cooked for 8 minutes and was just right. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prettyfood"
},
"reviewBody": "These are soooooo easy and awesome. An added bonus is it was ready was quickly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debbiedesigns"
},
"reviewBody": "When I think of the hours that I have spent stirring constantly and checking temperature on a foggy little candy thermometer, I am still shocked that this was so simple and turned out, well, pretty much the same as all of the toffee that I had to work hard to make! Thanks for sharing! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jammininAZ"
},
"reviewBody": "This is soo good! I used dark chocolate because that was what I had, and for nuts I used the Trader Joe's candied pecans. Yummy! I considered adding vanilla to the toffee, but it's great as is. Love the sweet and salty combo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SER"
},
"reviewBody": "These were very good, however, be careful of how much salt you add to the top. I definitely went over board and they became inedible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GEChocolate"
},
"reviewBody": "delicious and so quick and easy to make. I've made it several times with no changes. Also have made it using different nuts and/or adding broken pretzels. Give this recipe a try. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "designer24"
},
"reviewBody": "Unbelievable! Super simple to make and delicious. I used a glass mixing bowl with a handle and pour spout in the microwave to make the butter/sugar base. The handle and spout made it much easier to pour the liquid on to the cashews. I made several batches and they vairied between 8 and 10 minutes before the mixture turned a tan color. The cashews really make it special and everyone raved about it at Christmas. If only everything could be this simple and fool-proof!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cricket6382"
},
"reviewBody": "Make sure not to use salted cashews!! This came out great-easy to follow instructions, everything came out just right-but WAYY too salty! I added some extra chocolate on top to cut the salt a bit, which made it edible, but wow was it salty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAMJMine"
},
"reviewBody": "I've never made toffee in the microwave, so I was a little skeptical that this could be that good. It is THAT good! And it just doesn't get much easier. I also made a variation with hazelnuts (which I needed to use up) and dark chocolate sprinkled with sea salt which was incredibly good. I'd be sure to use a good quality chocolate in this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "This was really good!! I've made 5 batches so far for this Christmas; it keeps getting eaten up as fast as I can make it. So easy too!! I really did it all in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mplsbaker"
},
"reviewBody": "While I bake a lot, this was my first time making toffee - the \"easy\" part caught my attention! I made as directed other than increasing the cashews to a full cup (3/4 cup on the bottom). I used my 4 cup glass measuring bowl for the toffee mixture. After about 4-5 minutes, I noticed that the mixture looked like it was going to boil over but just when it got to the top of the bowl, it went back down. Made me wonder if that was the reason for buttering the top of the container. Never did boil over even though it looked close several times. It took about 10 - 12 minutes to cook in my microwave. Timing is a bit uncertain because at about 6 minutes, my microwave blew a fuse and it took a minute or so to trip it back and start the heating process again. Did not affect the end product, which turned out so tasty! I like the addition of the nuts in the toffee base and the flavor is wonderful. Can't wait to share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2kids4me"
},
"reviewBody": "Super easy and delicious! It will be a regular candy added to our Christmas collection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryjane"
},
"reviewBody": "This recipe is the BOMB! (I know.. I'm dating myself..)My first batch did not turn out right- but in my defense my microwave went kapoop 3/4 of the way into the cooking time. After acquiring a new microwave and starting over, I made 3 more batches of this and I have to say that for someone who burns boiled water,(most everything I make is 'Cajun Blackened') this turned out fabulous! Now if you are like me- always trying to get as much done in as little time possible (you know who you are... you only make one trip in the house with 20 bags of groceries because going back out isn't an option..) making a double batch of this recipe may require a little extra time. I found that the cooking time takes up to 28 minutes before you notice the color of the mixture turn tan. That's the key-- the mixture looks like the color of a paper bag- that's how you know it's done. This recipe is so easy and effortless...and DELICIOUS! I gave it away as Christmas foodie gifts. Everyone LOVED it!! 5 stars from me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Sueko Lau"
},
"reviewBody": "This was my first time making toffee and it came out SO GOOD! My butter turned color in the 7-8 minute area. I used cashews (delicious!) and instead of topping the chocolate off with more cashews, I used salt and broken candy canes - came out beautifully! Everyone loved it!\n\nI almost thought that the quantity was too small when I was pouring the toffee part, but it ended up being a nice amount for a potluck. But you may want to double the recipe if you are making this as a Christmas food gift for friends. You may be happy to have extra if you end up making too much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pstro5221"
},
"reviewBody": "Easy and delicious. So good I had to hide it from myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spice of life"
},
"reviewBody": "Afraid this would be a flop, but turned out perfect. Very tasty and very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISTIG5"
},
"reviewBody": "I sub pecans for cashews and omit the salt. everything else is perfect. \n8 min in the microwave. also, I add the chocolate chips to the toffee after I poured it, and let it sit, the warm toffee melts the chocolate and then I spread it. Sometime top with crushed nuts or candy canes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandma ikki"
},
"reviewBody": "Checking all sorts of toffee recipes I got out my candy thermometer, my heavy saucepan and figured I would be in the kitchen all night. \nAbout 8 minutes in the microwave and a few minutes scattering nuts on a Silpat I have a really good batch of toffee. \nWho'da thunk!\nThis will go to friends at a lunch tomorrow so I will have to make another batch...or two...or three. Cashews...Almonds...Macadamia Nuts not to mention playing with a mix of dark and white chocolate. \nNow to figure out what to do with my candy thermometer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naan"
},
"reviewBody": "I just made 3 batches of this wonderful stuff to take to a holiday cookie exchange tonight. It's so foolproof and delicious, I almost regret that I came across it... I want to make it all the time! I tried it the first time about a week ago and I used my square 8x8 Pyrex baking dish and it cooked unevenly; I had one corner that burnt a little. It was still awesome, but lesson learned. Today I am using my big 4-cup Pyrex measuring bowl and it cooks perfectly and evenly. I used cashews the first time I made it but today I am using sliced almonds. I also cut down a little on the salt. Thank you for a fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MmmDelicious"
},
"reviewBody": "This toffee has a really fantastic flavor, and is fun and easy to make! I had no idea this level of flavor could be found in such an easy recipe. I have never made toffee, and was nervous about watching the butter mixture and knowing when exactly it was ready. It took about 10 minutes in my microwave, and I realized I had nothing to worry about - it truly starts to look like a carmel color in several places on top, then it's time! One thing I did want to mention is how long it takes to set in the fridge. I was curious about this because I wanted to dig in right when it was done, and the wait was killing me! It took about 2 hours to set for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristyJ"
},
"reviewBody": "This was my first try making toffee as well, and wow, I am hooked! I think it is better than any I have had! I did not have cashews so used chopped pecans and it was wonderful. I also sprinkled pecans on the parchment paper for half of this, then put pecans on top of the whole thing. Having them on the bottom as well makes it a little easier to chew, still nice and brittle/crunchy, but it breaks easier when you bite it due to the nuts keeping some separation in the toffee. But both halves of the recipe were delicious and I will probably never make toffee on the stove top now that I have done this! The addition of sea salt is really wonderful and adds that little something..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmtus"
},
"reviewBody": "So good...so easy...it took me more like 8-10 minutes in the microwave. Already had numerous people begging for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynda P."
},
"reviewBody": "This was super easy and good. The only mistake I made was chopping the nuts in the food processor - made them too mushy - will chop by hand next time. I am going to make this next with white chocolate and crushed candy canes on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisacottn1"
},
"reviewBody": "I am not a good cook but love to cook! Do exactly what this recipe says. I brought friends over to test before i serve for Christmas. THEY ALL LOVED IT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Berglund"
},
"reviewBody": "Soooo delicious and very easy to make - I will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurel Banas"
},
"reviewBody": "OMG!! Absolutely love this recipe. I did use Ghiradelli Dark Chocolate melting wafers instead of the milk and what a great combination."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Harness"
},
"reviewBody": "Fabulous and so easy! Definite Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lissa Wicked"
},
"reviewBody": "oh man, oh man, oh man! I love toffee, and this is sooooo easy that it might turn out to be dangerous, lol! I wasn't sure that I'd like all the nuts (usually I only like them on the top, not in the toffee itself), but the cashews were so buttery they were the perfect compliment. Will be making this again and again for sure! Oh BTW, I only had Diamond Crystal's Kosher salt and it was still terrific, obviously!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noah Weisberg"
},
"reviewBody": "This turned out amazing and was done completely in the microwave ... you heard me right! This is a recipe ANYONE can do. It is delicious. I must admit while reading this I was quite skeptical. How could candy made in the microwave be any good. THIS ONE IS!!! One thing to watch out for. When they say to keep an eye on it they are not kidding. Mine took 12 minutes to turn colors but once it does it turns very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Simple and delicious! I did use more cashews than called for b/c the amount didn't seem like enough to me once I put it out on the cookie sheet, but that was my only change. LOVED the addition of the sea salt, both inside and on top. Keep a close eye on the butter/sugar mixture as it cooks (I burned mt first batch, lol). Definitely use butter for this, no margarine, b/c you will get a rich, buttery flavor! I can't wait to make this for the holidays...a definite keeper~YUM! Thanks for sharing. :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/239405/easy-cashew-sea-salt-toffee/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
"name": "Everyday Cooking"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/239405/easy-cashew-sea-salt-toffee/",
"name": "Easy Cashew Sea Salt Toffee"
}
}
]
}
}
, "about": [
]
}
]