				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Strata and Variations"
,"datePublished": "2019-04-02T02:46:47.000-04:00"
,"dateModified": "2022-10-07T14:06:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "USA WEEKEND columnist Pam Anderson"
}
]
,"description": "When I plan brunch for a crowd, strata is one of the first dishes on my list. And I&#39;m not alone in loving this easy breakfast casserole. So enjoy creating your own combinations using ingredients that are in season or on hand, and be prepared for compliments."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/E3FNJ0e_A4_fijSmCXdv6_Y8SWQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4496673-06b00ebcac3249298d2a6d8dfefb6fc2.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Strata and Variations"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "101"
}
,"recipeIngredient": [
"1 pound sliced fresh mushrooms",
"1 tablespoon vegetable oil",
"1 quart half-and-half",
"12 eggs",
"1 teaspoon salt and several grinds of pepper",
"12 slices fluffy white bread",
"1 pound cubed fully cooked ham",
"12 ounces extra-sharp cheddar cheese, grated",
"0.5 cup thinly sliced scallions" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Saute mushrooms in 1 tablespoon of oil. Season with salt and set aside."
} ,{
"@type": "HowToStep"
,"text": "Whisk half-and-half, eggs, salt and pepper until smooth. Spray a 9-by-13-inch Pyrex or ceramic baking dish with vegetable cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Line bottom with 6 slices of bread. Scatter half of the ham, and half of the mushrooms over the bread, then sprinkle with half of the scallions and cheese. Pour 1 cup of egg mixture over the top. Repeat layers with remaining bread, ham, mushrooms, cheese and scallions. Slowly pour remaining egg mixture evenly over top. Cover with plastic wrap, then weight down casserole with 3 16-ounce cans for at least 15 minutes to submerge ingredients. (Can be refrigerated overnight, but return to room temperature before baking.)"
} ,{
"@type": "HowToStep"
,"text": "Adjust oven rack to middle position. Bake in preheated 325-degree oven until custard is just set, about 50 minutes. Turn on broiler and broil until strata is spotty brown and puffy (watch carefully), about 5 minutes longer. Let stand for 8 to 10 minutes, then serve immediately."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "I used smoked sausage instead of ham because that is what I had on hand. This strata recipe can be tweaked with different veggies, I mixed in some hashbrown potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnParada"
},
"reviewBody": "Delicious! We altered the recipe for two (five eggs and a smaller casserole dish). Also, no half-n-half in house, so I added butter to fatten the milk instead. Sautéed bell peppers, chives and spinach and layered some shredded cheddar, Gouda and whole Buffalo mozzarella and homemade bread. Not heavy at all and perfect for Christmas morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnnpppnk"
},
"reviewBody": "Used mushrooms, multi-colored peppers, shallots and onions and added 2 tsp of dried mustard and 1/8 tsp of cayenne pepper. It’s a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Incredibly delicious! *Followed the base recipe, without making crazy changes. \nI used thick slices of day old bakery Italian bread, as well as Jalapeño Jack cheese, with some Chipotle seasoning. Followed overall measurements and used other ingredients as written. Bread soaked up the egg mixture just right. (Teenagers picked it up and ate it like a sandwich - whatever works, right?) \nThis seems to be be a very versatile recipe, but it was so good that I'm not sure I'd want to make any changes!! Five stars for a new favorite recipe. Only had 2 small squares leftover after feeding 3 teenagers, my husband and myself. Definitely making this again soon, but will bake 2 trays to have leftovers... Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Swan"
},
"reviewBody": "I have been making a similar strata for years. I love it for Christmas and Easter mornings, while we’re opening gifts and looking for eggs, breakfast is cooking. I serve it with a fruit salad and my family tops it with either hollandaise sauce or syrup. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti McCormack Corley"
},
"reviewBody": "I like quiche better but it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SolarLaurie"
},
"reviewBody": "This is really good. I reduced it by a third and baked it in a 9 X 9 in pan. I used sautéed mushrooms, onions, red &amp; green bell pepper, bacon &amp; extra sharp cheddar cheese. I added 1/2 tsp. Dry mustard &amp; a couple shakes cayenne pepper. I added no salt, the cheese &amp; bacon had plenty. I used mostly milk with about 1/4th half and half and also not as much as suggested to make it a bit more custard like and less runny. I still had to bake it about 50 minutes to get it cooked. Yum! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Woods"
},
"reviewBody": "I adore this strata. I have made this for Christmas breakfast the past 5+ years. I always do ham as the meat, but have done onion, bell pepper, mushrooms, broccoli (and a combination therein) for the vegetables. I have started using whole milk instead of half and half to make it healthier, but I have made it both ways over the years. It is always super fluffy and delicious...the family looks forward to it every year! I always prep it on Christmas Eve and refrigerate overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherryC."
},
"reviewBody": "Defininately make again. Outstares my previous recipe I've made every year for the last twenty. \nFollowed suggestion of first layer being full bread slices and torn up cubes for other layers. Superb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Rothfuss"
},
"reviewBody": "I used this as a base and modified. Used 1lb of sausage, broccoli, asparagus and bell pepper. Lined the bottom of the pan with bread and then added 2 1/2 slices chopped up in the pan for filler.\n\n Cooked at 325 for 50 minutes then 400 for 10 minutes and it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "I like to use Hawaiian bread (brioche would be good too). I add vanilla, cinnamon, a little nutmeg &amp; some maple syrup to the egg mixture. For cheese, havarti, and turkey sausage for meat. Popular in my family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Edie Schneickert"
},
"reviewBody": "This is a nice, easy, basic strata recipe. I'd like to experiment with different cheeses and ingredients. Mine required an additional 10 minutes of baking (as someone else noted.) If you prepare it the night before as I did, remember to allow plenty of time in the morning to bring to room temperature before baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aimeelynn"
},
"reviewBody": "This is good, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay H"
},
"reviewBody": "Delicious! I used some roasted garlic French-style bread from Costco that was absolutely dynamite. It gave a bit of a bite, both in flavor and texture. Plain white bread would just be mush, I'd think. We did cooked sweet sausage and a grated and pressed zucchini, plus some mustard powder and chopped garlic scapes in the egg mix. The french bread necessitated more egg on top, and it took about 1 hour at 350, after having come to room temp for about 10 mins. The middle was a bit underdone, but the broiler took care of that in a minute or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAMYOUNG11"
},
"reviewBody": "I found this on Allrecipes years ago and have made it ever since with different variations. Everytime I make it someone comments that it is even better than before and I have sent links to this recipe dozens of times. This time I sauted mushrooms, fresh spinach, cherry tomatoes cut in half and scallions along with bacon and sharp cheddar. I used fresh Italian bread that I sliced myself and I always use my lasagna pan to assure that everything fits. I weigh it down overnight - cook it first thing in the morning. I usually serve with a homemade quick bread such as almond, strawberry-lemon, or banana and fresh fruit especially berries. I don't think there is a way to mess this up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JillKristen"
},
"reviewBody": "I made this for a ladies brunch and it was a huge hit. Easy and delicious. Can't wait to try other variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danriser"
},
"reviewBody": "This was made for a post-Christmas brunch today, and scored a home run. My grand-nephew told me three times that he loved it. The adults weren't shy with praise either. I used day-old french bread with most of the crust removed. yellow and red peppers, ham, scallions and the mushrooms, but a little less ham than called for. I'm glad I checked before adding mustard because of allergies. I might have added a tablespoon of Dijon (although not called for), but would have had to eat the whole thing myself. I would have died happy, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't have all the ingredients but it tasted great. My husband even liked it. He had seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "walker449"
},
"reviewBody": "I didn't have all the ingredients but it tasted great. My husband even liked it. He had seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rascalette"
},
"reviewBody": "I had to alter the recipe a little. I used thinly sliced Italian bread and 10 eggs instead of a dozen. It was delicious. Everybody (even the picky wee ones) went back for more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boorandy"
},
"reviewBody": "Super easy and fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shauna McNabb"
},
"reviewBody": "I used sausage, mushrooms, 8 eggs, a crusty Italian bread cut into cubes and mixed everything together rather than layered. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Awesome! I used sausage, steamed broccoli,...yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarad"
},
"reviewBody": "Mushroom and bacon is a tasty combination! This is even delicious cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Bautista"
},
"reviewBody": "Excellent! This was the first time I've ever made a strata, and I'll definitely be making it again. I cut the recipe in half, used an 8x8 dish, and made with sauteed peppers and onions and steamed broccoli. Very good! I covered it in foil and cooked it in my toaster over on 350 for 50 minutes, then uncovered it and broiled for another 5 minutes- so good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alanna Reeves"
},
"reviewBody": "This turned out well except that the edges got a little chewy. I think in the future, I may cut off the crusts of the bread to make the texture a little more consistent throughout. Overall, it was a hit at our company breakfast, though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Brunin"
},
"reviewBody": "This was a big hit at brunch. Even people who I would consider \"picky\" ate seconds and took some home. Because I wasn't sure what would be considered too adventurous, I simply used (turkey) Canadian bacon and sharp cheddar cheese with the eggs and bread. No onions. I was skeptical of using an entire quart of half-and-half, but was amazed at how much the bread absorbed so if you have reservations, I am here to say that it actually does work. The cook time took considerably longer than 50 minutes, but I also refrigerated overnight and I don't think it was quite up to room temperature so keep that in mind. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jam47"
},
"reviewBody": "I made this for Christmas brunch the night before using mushrooms, asparagus and red onions with reduced fat four-cheese Italiano cheese. It was delicious! I had 8 people for brunch and we barely ate half of the full recipe. Next time I would cut the recipe in half. I look forward to trying it again with different ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Provost"
},
"reviewBody": "this is a great base recipe for strata. My variation included: ground turkey and creamcheese with peppers and onions! turned out so good for a brunch party i was throwing. Im making it for christmas morning now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimmy"
},
"reviewBody": "I had never made a strata, but it was FANTASTIC!! Although it is a bit heavy, I'm sure changes can be made for the more calorie conscientious person. p.s. it's great cold too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Von Appetit"
},
"reviewBody": "Great recipe with unlimited versatility. Only change I have made is substituting 8 bakery croissants for the 12 slices of bread. The butteryness of the croissants adds a whole new level to this recipe. I have found the key to the meat/veggie combo simply being a 2lb total, regardless of how many meats of veggies you use. I prefer Sausage, Bacon, Mushroom and Onion, so I use a 1/2 lb of each for 2lbs total. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "Moist, tasty and very easy! I made 2 with no meat or veggies and wow everyone loved it! This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne"
},
"reviewBody": "I brought this strata to a work breakfast brunch and everyone loved it. Those that like to cook asked for the recipe. This is pretty good, since I'm not much of a cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "powder1000"
},
"reviewBody": "Nice Idea never tried it before will do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim S."
},
"reviewBody": "As easy as it gets. I made a quiche at the same time; this was so much easier! Great Easter brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntie KK"
},
"reviewBody": "OMG was this ever fabulous. I used turkey sausage, mushrooms, minced onions (all I had) used all the cheese in the house (cheddar, swiss, romano &amp; parmesan) didn't have half &amp; half used 1 pint heavy cream &amp; 2 cups 2% milk. This was fabulous I will make over and over again. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrielc"
},
"reviewBody": "I made this using bulk sausage and mushrooms. Put it together the night before and baked the next morning. It was a big hit at my brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bells67"
},
"reviewBody": "This turned out great! First time I used hame and cheese, second time cooked bacon and cheese. I did substitute evaporated milk for the half and half and it was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Faith"
},
"reviewBody": "This was easy and pleasing for Christmas morning. I made a vegetarian/non milk product version to suit my family's dietary restrictions. I used veggie sausage, rice cheese and soy half and half. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Johnson"
},
"reviewBody": "So good and easy. I split the recipe in half and baked it in a 9x9 pyrex. I used turkey sausage and leftover veggies (onions, peppers, broccoli) I had floating around in the fridge. It was so good! I've never made strata before and was happy to see this one was meant to be made with variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justine Garrett"
},
"reviewBody": "Excellent base recipe. I can imagine lots of possibilities with this simple-to-follow plan. For a family brunch, I used 12 oz. of Trader Joe's Garlic and Herb Chicken Sausage (sliced and lightly browned) for the meat; a mix of cooked broccoli, about a pound of lightly cooked spinach, and lightly browned onions for the vegetables; and 6 oz. of crumbled feta and 6 oz. of shredded havarti cheese. I omitted the scallions. I used as much potato bread was needed for the two layers. The whole thing was as easy as could be, pleased my guests, and looked beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gdr"
},
"reviewBody": "Made this for the first time for Christmas brunch; it was easy &amp; a hit! It came out well with hunks of an unsliced loaf of Italian bread, I used mostly the inside leaving out the crust, so it was heartier than had I used a typical white bread. Filling was a saute of shallots and frozen spinach, with Gruyere cheese (found this idea on the cookbook critic website). I made two batches, the one in a deeper round dish took longer to cook, but came out moister, with less bread and more custard. The oblong pan was dryer but just as tasty. I served 2 types of sausages (sweet breakfast and savory) on the side so guests had a no-meat option. A fabulous brunch choice, everyone wanted the recipe, we had the leftovers for breakfast today!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingy"
},
"reviewBody": "I made this, my first strata, for Christmas brunch and it was a huge hit. Love how versatile it is. I didn't have dry mustard so added some dijon mustard and also the cayenne pepper as some else suggested. I used pepperjack cheese along with the sharp cheddar. It was a bit salty to me so would cut it in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Rose"
},
"reviewBody": "This recipe was outstanding. I had never eaten strata before, so I wasn't sure what to expect. It was golden, fluffy, and delicious. We couldn't even tell it used to be white bread! I didn't have any mushrooms, so I just added leftover ham steak and scallions. It tasted perfect--I don't think I'll use mushrooms next time either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L. Mooney"
},
"reviewBody": "Really good and easy too. I will try more veggies next time just to mix it up. I forgot to pick up the half &amp; half and had to use milk. It worked out beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann Webb"
},
"reviewBody": "I made this for a brunch catering and everyone loved it. It was the biggest hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ctcountrygal"
},
"reviewBody": "Wonderful strata! I used 8 oz of oven roasted turkey deli meat and 1 1/2 lb. of sauteed vegs (red, yellow, and orange peppers, and a small container of sliced mushrooms. My only suggestion is to add like 2t. of dry mustard powder to the egg mixture. I do this very often when adding cheese to a dish. My brunch guests went crazy for it. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Cass"
},
"reviewBody": "Well, I found out the hard way that my \"9x13\" pan is actually a little short - I am now cleaning my oven because of the boiled over milk and egg mixture. I did like the versatility of this dish and the fact that it did not need to refrigerate overnight. I used a combination of bulk breakfast sausage, onions, peppers, and zucchini. The flavor was good, but I think dry mustard would add a nice little zing to it. I actually tried this recipe as a way to use up some sour milk, and that substitution was successful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "My very first strata and it will be a favorite recipe in the future. I made mine vegetarian. I used mushrooms, spinach, bell pepper,and green onions. It was a hit at my brunch. Even my meat eating husband loved it..I had bacon on the side for him. It cooked fine according to the recipe and set up beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer F"
},
"reviewBody": "Great recipe for brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "auntejones"
},
"reviewBody": "I especially like the adjustability of this recipe. I cook for large church groups, and this basic recipe works every time, no matter what ingredients I choose to add. I like to cut off the bread crusts first when I have the time. I gives it a slightly smoother texture and neater apprearance when done. Sometimes I add a little ground nutmeg, just because I like it in egg recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freyda"
},
"reviewBody": "I needed to do something with all those eggs and found this recipe. Just like it says easy and be prepared for compliments... even from people that aren't too free with them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin4four"
},
"reviewBody": "I loved the basics of this recipe I scaled it down a bit according to what I had on had. I didn't have any meat so I made it with just onion and mushrooms. I had a hunk of extra sharp cheddar that came out to two cups. I cooked the onion and mushrooms and let them cool before assembly. I like that this recipe let me know it was ok not to wait overnight to bake. I'm not sure how much soaking over night would change things. I was looking to make this now and it turned out wonderful. I've never had this before but I can't wait to try it again with different stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Good, I used left over bread end, fluffy white bread would be better still."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCOOPS44"
},
"reviewBody": "So easy and everyone loved this- made for a group of 16 people. Made one with bacon, mushrooms and scallions and the other wiht just the veggies. I did not broil at the end and it was still great. I made them in 2 disposable tins which I buttered so that they wouldnt stick. EASY CLEANUP!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fatparadox"
},
"reviewBody": "I made this for my husband's birthday brunch and it was absolutely delicious. Everyone loved it. It was easy to make and great that it could be prepared the night before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super delish! No matter what you decide to throw in, it's always good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Parks"
},
"reviewBody": "It was good texture but needed way more flavoring as it was quite bland. (I made it with veggies)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "basscass"
},
"reviewBody": "Easy and delicious. Great way to feed a crowd for brunch. Mushrooms especially yummy. You need a DEEP dish to contain it all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "panther49"
},
"reviewBody": "I made this for a family of wheat intolerant and those that aren't wheat sensative by using a store bought loaf of wheat free bread adding broccoli, turkey sausage and goat cheese. We all were really impressed with the ease of putting it together and the variations offered. Thank you, I will definately make this again. Irene"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skepticgirl"
},
"reviewBody": "They turned out great.Perfect cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Dickenz"
},
"reviewBody": "Very good recipe. I used sausage, mushrooms, onions and green and red peppers. I cooked it covered for an hour, and uncovered for another thirty minutes. Came out moist and fluffy. Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teegi"
},
"reviewBody": "I served it this morning and it was excellent. It was the first time my daughter-in-law of eight years asked me for a recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherInGR"
},
"reviewBody": "I doubled this recipe recently for a wedding brunch I catered. I should have doubled that amount because it was a huge success! I used a pound of sausage and a pound of bacon and the scallions as the only veggies. It does take a while to set up completely in the middle but this is much better than other strata recipes I have used that have never set up correctly. I will definitely make this again and can't wait to try some different variations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANDI2"
},
"reviewBody": "I made this for an appreciation breakfast and it was the first dish to be eaten! I didn't even get to sample it myself so I think it must have been a hit with the crowd!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DerAvi"
},
"reviewBody": "It was pretty good. However, After 50 minutes of baking and 10 minutes of setting it cool- it's still a little bit liquidy in the middle area. So I baked it for another 15 minutes and let it set for 10 more minutes to let it cool, the middle area became firm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Maria2007"
},
"reviewBody": "I don't know what I did wrong, but I certainly wasn't a fan of this dish. Half of the pan went straight to the trash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I got rave reviews when I served this at a church function. I used a little less cheese &amp; I added cooked spinach &amp; mushrooms. I also added tomatoes, &amp; I used precooked crumbled bacon. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Emery"
},
"reviewBody": "What a great, easy brunch recipe! I made two - one was asparagus &amp; mushroom, the other was kielbasa &amp; red pepper. Both were excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lonav"
},
"reviewBody": "i made this recipe using four vegetarian sausage patties(crumbled), one pkg. frozen spinach (thawed and drained), and havarti cheese; i omitted the scallions. it was fantastic on christmas morning-- everyone loved it. i love strata and recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie Hanford"
},
"reviewBody": "I had never made strata before and I made three variations for a brunch shower. I thought they were really very tasty. I made one variation with sausage and grated apple, one with diced ham and red and yellow bell peppers and a Brie and Veggie one from Southern Cooking. \n\nThe things I learned (and I am sure that many of you seasoned Strata makers know this) are that you must add extra cook time for extra ingredients. I added about 12 oz of ham and them about two whole bell peppers and this is the only one that did not set. \n\nAlso, yes, you do need to let these set. I didn't really plan on that extra time when I put these in the oven so there as a lull in the shower while we waited for them to be ready.\n\nThe other thing I did a little differently was cut the first layer of bread in half and lay it against the bottom of pan and the second layer I cubed so there was a little texture on the top.\n\nRest of the menu was the \"Restaurant Style Cheesy Hash browns\", lettuce salad with apples and red onions, fresh fruit, and apple strudel and lemon blueberry mini muffins. I had many people ask for the recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaegersmom"
},
"reviewBody": "Very good recipe! I used mushrooms, red peppers, ham and scallions!! Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "This is a great basic strata recipe. Start with the basic bread, egg, milk mixture and add whatever you want! I love to try new ingredients - whatever fresh veggies are in season. I do partially cook raw vegetables, by stir frying them, to release some of the moisture before baking the strata."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristinaW"
},
"reviewBody": "I made this for a big group on a weekend get away and it was a hit!\n\nI added asparagus, plum tomatoes (seeded) and field roast vegetarian Applewood 'sausage' and used sharp chedder cheese. Nobody even new the 'sausage' was vegetarian!\n\nServed with a fresh fruit salad and sweet bread and it was gobbled up by all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMCLRH2O"
},
"reviewBody": "This recipe was a hit! I made a double batch one with ham only and one with bacon and mushroom. I will definitely make this again, this time a little more creatively (broccoli, spinach, tomato.....)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libby Wright"
},
"reviewBody": "This made the best breakfast casserole I ever tasted!My guests wouldn't stop raving about it! I used another recipe for another one and that one was a flop. This strata has the perfect consistency! I sauteed 2 onions and one green pepper in a little olive oil...then added a pound of turkey sausage. Thanks for a perfect recipe Callie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thebigpitcher"
},
"reviewBody": "I used this recipe for an Easter breakfast. I prepared it the evening before and then baked it that morning. It was wonderful. I used ham, bacon, spinach, and mushrooms. It was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIANAMB"
},
"reviewBody": "This worked out great. I made sausage/gr. onion and ham/spinach. I cut back on salt, added a bit of dry mustard &amp; cayenne and did not put the cans on top after assembly. I also cooked them 20 minutes longer than called for. I would definately make this again - you can count on it to turn out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wendyMN"
},
"reviewBody": "Great recipe!! I made this today for a pre-Easter egg hunt party, and it was a huge hit. I used 12 oz of pre-cooked chicken sausage, chopped finely. I also used 3 sweet peppers, which I chopped and then microwaved for 90 seconds to soften a bit. I used whole wheat bread, since I don't ever buy white bread. It came together really easily, and cooked in about 70 minutes. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShiraSF"
},
"reviewBody": "I made this for brunch on Saturday with mushrooms, chopped ham and broccoli. It hadn't fully come to room temp in 45 min's so the baking time was longer - a little more than an hour. It could have used a tad bit more flavor (a little more salt or sharper cheese perhaps) but overall it was a big hit and I will definitely make it again, with other variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "I made 5 of these for a family brunch last Sunday. They turned out fantastic and were a definite crowd pleaser. \n\nI made 3 with just meats (one each of bacon, sausage, and ham), the other 2 were bacon and sausage with onion and peppers. My personal opinion is that the \"kicked up\" versions with the veggies were tastier. If you aren't a fan of veggies and want just plain meat, I'd recommend the sausage. It tasted a bit zestier than the bacon or ham. \n\nI made these the night before, refrigerated them and just popped them in the oven right from the fridge. They took 1 hour to cook and were beautiful, puffy and done all the way through.\n\nThis is a new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "I liked this recipe because it gave the basic recipe and also gave suggested variations. I use multi-colored peppers and onions. It turned out good. I added 2 tsp of dried mustard and an 1/8 tsp of cayenne pepper. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "This was okay.. the middle of mine did not turn out-was mushy =( The sides were great... Guess I'll try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "Good versatile recipe. I think the cook time is way off though; mine was done in about 30mins, and there was no need for broiling. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DJudkins"
},
"reviewBody": "Great recipe - I made it for friends and everyone wanted the recipe. I used green peppers (sauted) and bacon (chopped and fried). I also used the scallions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina C."
},
"reviewBody": "This is a versatile and reliable crowd pleaser. I've used many different combinations and Pam's right about the fresh scallions, they add a real bright note. I've found that the strata needs to sit a bit longer than the 8-10 minutes in order to really set up for easy cutting. Enjoy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76956/easy-strata-and-variations/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1307/breakfast-and-brunch/eggs/breakfast-strata/",
"name": "Breakfast Strata Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76956/easy-strata-and-variations/",
"name": "Easy Strata and Variations"
}
}
]
}
}
, "about": [
]
}
]