				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Tater Tot Casserole"
,"datePublished": "2019-04-02T03:04:29.000-04:00"
,"dateModified": "2022-10-17T17:24:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Carol White Howden"
,"url": "https://www.allrecipes.com/cook/6507773"
}
]
,"description": "Frozen Tater Tots, Cheddar cheese, ground beef, and cream of mushroom soup combine for a comfort food classic in this recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_RO-lh8St4xA2wTm7BjIcLO4nec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7646490-73577423ad9b4d54ad04a24c684028d5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Tater Tot Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "110"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "469 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "82 mg"
,"fiberContent": "2 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "1077 mg"
,"sugarContent": "3 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1.5 pounds ground beef",
"1 cup diced onion",
"1 pinch garlic powder, or to taste",
"1 pinch salt and ground black pepper to taste",
"1 (26.5 ounce) can condensed cream of mushroom soup",
"1 (16 ounce) package frozen bite-size potato nuggets (such as Tater Tots®)",
"2 cups shredded Cheddar cheese",
"1 pinch paprika, or to taste",
"1 pinch dried parsley flakes, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Cook and stir ground beef, onion, garlic powder, salt, and black pepper in a skillet over medium heat until beef is browned and crumbly, 7 to 10 minutes. Spread beef into the bottom of the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Stir cream of mushroom soup, potato nuggets, and Cheddar cheese together in a large bowl until potato nuggets are evenly coated in soup and cheese. Spread potato nugget mixture over beef mixture."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until browned, about 45 minutes. Sprinkle paprika and parsley flakes over the top."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hubby, mom and kiddos loved it! I used garlic powder, webers burger seasoning, onion powder, paprika and Better Than Bouillon Roasted Garlic Base in the beef while browning with onion. Added salt n pepper to frozen tots before mixing and mmmm mmmm!! Kids wanted mixed vegetables on the side so dinner was easy, fast and awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love it. The last time I made it though, I didn’t have any Cream of Mushroom soup. I used Classico Alfredo sauce instead. It was amazing. Creamier &amp; just plain yummy. I like it better w/ french fries than tater tots too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This casserole is delicious! It's so easy to make and takes very little time to put it together. My family requests this all the time. Thank you for sharing this recipe! God bless you and Merry Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda P"
},
"reviewBody": "Tasty, inexpensive and simply dinner entree. I added frozen mixed peppers &amp; onions to the hamburger. On top with paprika &amp; parsley I put dried onion rings for a sweeter taste was delicious. Option real bacon bits into mixture or on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Snow"
},
"reviewBody": "you can top it off with broccoli and shreded cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It looks delicious I did use my own seasonings but other I would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "ITSSS SOOOOOOO GOOOODDDDDD!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard D'Haene"
},
"reviewBody": "It was delicious. I used roast garlic mushroom soup instead of regular. I didn't use paprika or parsley. I will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swtie101"
},
"reviewBody": "The only things I changed was adding Cajun Seasoning, diced bell pepper &amp; I added 1/4 cup of cheese before adding the total mix, then another 1/4 cup of cheese on the top with the mentioned Parsley. (Total Cheese used = 2 1/2 cups)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artingal"
},
"reviewBody": "Easy, easy! I used a large can of low-fat cream of mushroom soup. I ended up adding a little milk to the mixture to make it a little less lumpy. The final result was a quick Saturday night meal that disappeared before it had a chance to cool off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodie"
},
"reviewBody": "Easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annie Douglass Lima"
},
"reviewBody": "Pretty good, but I made some changes, and I'll make more next time. I left out the salt (it was plenty salty already) and skipped the onion, since some in my family don't like it. Next time I think I'll mix everything together instead of layering it in the pan, and I might use two thirds or even half the amount of cheese. Everyone enjoyed it, and I'll definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allison Atencio"
},
"reviewBody": "Made this for dinner, turned out great but I didn’t mix the tatters in with the soup, instead I mixed it in with the meat and onions and added cheese, the used that at the bottom then a small layer of cheese and topped it with pre browned tater tots then because I love cheese I added a little more cheese and it was amazing, my husband and 2 yr old daughter loved it so I’ll be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael Eugene Boclair"
},
"reviewBody": "This is my review based on my love for spices, which is not what everyone likes. I added mushrooms and green beans. The casserole was bland until I added, to my portion, the unholy addition of catsup. I know this was an addition any chef would have a heart attack over. I go by what taste my brain searches for, not what anyone else recommends. The recipe was easy to make and the recipe is easy to change to be what each individual likes. My wife told me NOT to use taco seasoning, HAHA. That should explain my love for cooking with spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter L. Wilson"
},
"reviewBody": "Our picky 88 year old friend loves it as we all do! Will try cooking the tots for little next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holli Boyers"
},
"reviewBody": "I made two casseroles so I mixed 3 cans equally for each of fiesta cheese, cream of potato, and cream of chicken.. I then mixed half with meat mixture (adding corn) and other half with tots mixture... put a layer of tots on bottom.. then meat mixture.. then tot mixture on top.. of course extra cheese.. mmmmmmm so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "zahn Angela"
},
"reviewBody": "I used ground turkey instead of beef .I think also next time I made this recipe I will brown the tater tots first"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Payseno"
},
"reviewBody": "Great recipe and comfort food!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corie Phillips"
},
"reviewBody": "This one is so good and easy. On a second day, I put in a can of cream of celery soup and some green beans. We ate the whole thing ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg Richie"
},
"reviewBody": "I put tots on the bottom and precooked as another suggested. Made a nice support layer on the bottom. Great flavor, family loved it, than you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brittanyc40"
},
"reviewBody": "This turned out nicely. I strained the grease after cooking the beef but it still ended up a bit greasy (my own fault for buying fattier meat than I’m used to), and the tots were a bit soggy. Next time I’ll cook them for a few minutes before adding all the tasty goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karen Jackson"
},
"reviewBody": "It was very dry and did not taste good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flowerpowermom"
},
"reviewBody": "This is a great recipe! I tweak it a little, but it’s now one of my kids favorite meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Occasional Cook"
},
"reviewBody": "Thanks to many reviews I used the cream of chicken soup instead of cream of celery, added green beans, added onions to the ground beef, and put the tots on top still frozen. I loved this dish, so easy and tasty. In fact I wanted to eat 2 or 3 platefuls but limited myself to one. It was a little soupy, But I think it’s supposed to be that way. I don’t have kids but I can’t imagine this not being a hit for an entire family. Especially great on a cold evening - just serve it piping hot right out of the oven. I will make this year round. Mmmmmm....yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "Easy to make &amp; tasted good. Definitely better as a leftover though. My 16 year old son, who’s picky, said “it’s eatable” the night I made it. Two nights later said “this is good - much better than the other night”. This will be a “make it, then put it in the fridge for a day” recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan O'Hashi"
},
"reviewBody": "I make this often. This time, I added green beans as other recipes call out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slaubhan"
},
"reviewBody": "Easy prep and a nice weeknight dinner that the whole family enjoyed. I only used 1lb of beef, and I let the tater rounds bake in the preheated oven for about 15 minutes while I prepared the rest. It turned out very good and I will make again. Changes I will make next time, add some Worcestershire sauce to the beef when frying, add sour cream to the soup mixture, and layer beef then tore then soup mixture rather than mix tots into soup mixture. It's a keeper for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "I made the following changes: \n\n1) I used Campbell's Golden Mushroom soup (a Heart Healthy substitution) instead of cream of mushroom soup.\n\n2) I added a 16 ounce bag of mixed vegetables (as shown in the recipe photo).\n\n3) I mixed the cooked/drained ground beef and the frozen vegetables with one 12 oz jar of Beef Gravy (store brand).\n\nThe first time I made it, I spread the beef/veggie/gravy mixture out in the pan, and topped it with the cheese, tots and soup mixture. Baked it at 350° for 55 minutes. The tots were browned but still a bit mushy.\n\nThe second time I made it, I mixed the soup in with the beef/veggie/gravy mixture, spread it all in the casserole dish, then topped it with cheese, then tots (...then a smidge more cheese because...well...it's cheese). 350° for 50 minutes. The tots came out PERFECT and in 5 minutes less time. WIN!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Dowling"
},
"reviewBody": "Followed the receipe exactley. It was simply and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Green"
},
"reviewBody": "It was awesome, and my kids actually liked it too. This will became a regular dish in my house, so easy to make ran out of tater tots and had to use hash browns, which also turned out yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmandaJoVS"
},
"reviewBody": "WOW... This was amazing! I doubled the recipe because we have a big family. As other suggested, I cooked the tots (I used crispy crowns) for 10 minutes while cooking hamburger mixture to make sure the tots were extra crispy. Make sure you pay attention to the soup can sizes because I only had the smaller 10.5oz ones, but luckily I noticed so I still made it work. I put the meat mixture on bottom, soup/shredded cheese mixture in the middle, and crispy crowns on top! When finished, I sprinkled a little more cheese on top of tots until melted. I have to say the dried parsley flakes really made a big difference! Everything about this was so delicious. We hardly ever have leftovers, but we did with this. Not because it wasn’t great, but because it is super filling! Definitely adding this to our weeknight menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Coulter Smith"
},
"reviewBody": "I made a few changes because of my family's aversion to mushrooms, but it turned out really great using cream of celery soup instead. My family loved it and nearly cleared the entire pan by going back for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wisconsin Mom"
},
"reviewBody": "This a a great base recipe! I use Campbell cream of mushroom with garlic (omit garlic powder), add a bag of frozen mixed veggies, toss a whole regular size bag of cheese in &amp; most importantly DO NOT saute the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abbey"
},
"reviewBody": "Easy to make and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sommer Pyne"
},
"reviewBody": "I grew up eating tater tot hotdish (in MN it's hotdish, not casserole)!! Here's how I've always made it:\nDice one small onion and cook with hamburger. Add salt, pepper, garlic to hamburger, while cooking, to taste. Drain. Mix together one can of cream of(your choice) soup with same amount of milk. Mix with hamburger and a bag of frozen veggies. Mix in 1 cup of cheese, if desired. Pour mixture into baking dish (9x13) and cover with tater tots. Bake at 350f for 30-45 minute, adding more cheese on top of tots during the last 10 minutes of baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rahrah"
},
"reviewBody": "Very easy and very good . I used one can of cream of mushroom soup and one can of cream of chicken soup and added a small bag of mixed vegetables. Rather than put the tots in the mixture I put them on top of the mixture and sprinkled cheeses on top then baked for 45 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sgt. Prepper"
},
"reviewBody": "Kid doesn't like mushrooms, so I used a can of beef stew and decided to also add a can of no beans chili. Cooked up the tater tots nice and crispy while I was browning 2 pounds of ground beef. Added the ground beef to the chili and beef stew and then added a couple of handfuls of egg noodles and simmered it until the noodles were al dente. \n\nleveled out the mixture in a casserole dish and covered the top with the tater tots, pressing them down slightly. Sprinkled about 2 cups or so of grated medium cheddar over it all and put it in the oven at 400 for 15 minutes to melt the cheese. We all loved it and now they call it 'Cowboy Casserole\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Satterfield"
},
"reviewBody": "Super easy delicious classic! Paired it with corn or peas for a decent meal. Went back for fourths!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Casey M"
},
"reviewBody": "I know some people don't like recipe tweakers...but I can't help it. I combined half pound grd pork and a pound of grd chicken (I don't eat beef). I used the seasonings from A/R recipe Chicken Tater Tot and the thawed mixed vegetables. Using a layer of sharp cheddar under the tots...then put some Muenster on top of that. I also used two 10oz cans of 'healthy choice' Mushroom soup and a container of plain Greek yogurt made up the sauce/moisture. It's actually in the oven now...but I think it will be as good as I hope to achieve a comfort food meal for me and 99 yo Dad. I provide lunches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Muzingo"
},
"reviewBody": "Family loved this!! I added frozen vegetables and put tater tots on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S. D."
},
"reviewBody": "My recipe differs slightly from this version but both are very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Davis Lee"
},
"reviewBody": "Very easy to make, ended up making homemade cream of mushroom soup, but it was fast still. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkdiamndz"
},
"reviewBody": "I only slightly modified this. I try to sneak in veggies whenever I can so I used a bag of cauliflower tots and a bag of mini tater tots. I baked half the mini tots and the whole bag of cauliflower tots for about 10 min before mixing it with the soup/cheese mix. I also used one small can of cream of mushroom and one small can of cheddar soup to give it a tad more cheesy taste. My picky son didn’t even notice the veggies hidden. This will definitely go into the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Anderson"
},
"reviewBody": "This was perfect. I did others suggested and cooked the tots while I got the meat part going. sure made a difference in the tots staying crunchy. I'll be making this again, my family gave it their approval."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Ziga"
},
"reviewBody": "I added 2 cans of green beans to the hamburger mixture. So yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scout Grove"
},
"reviewBody": "A favorite from my childhood, my mom used to make tater tot casserole all the time! My boyfriend had never tried it so I had to make it. Tastes delicious, and is so cheap and easy! The hardest part is shopping for the ingredients. Brings back so many memories of cold winter nights in the PNW!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Doerr"
},
"reviewBody": "I have made this casserole before. It is delicious. I changed it up a little this time. I added one bag of mixed vegetables cooked to instructions on the bag then added it 2 the hamburger after it is cooked and before placing it in casserole dish. I used 2 cans of mushroom soup, and a 30 oz bag of tater tots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Dickerson"
},
"reviewBody": "Major modification!! I put the beef, soup mixture on the bottom and added a can of peas. Topped it with the tater tots (all 32 oz of the bag) and cooked until crispy. Topped with cheddar and let it melt! Super yummy and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WayneSch"
},
"reviewBody": "This turned out great. Super easy. The package of ground beef I had available was more than 1 1/2 lbs. and I had to guess about the Tater Tots because I had a very large package. I think I could have added more. Used dried chopped onion that I had on and. \nAfter mixing the cheddar cheese in I added a little Mozzarella to the mix. When it finished baking I sprinkled more Mozzarella on top along wit the paprika. Left it in the warm oven until the cheese melted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie Massey Joseph"
},
"reviewBody": "This was a hit! It was delicious and my 22 month old continued to ask for more after 2 helpings. We did use minced garlic instead of garlic powder because it’s what we had but otherwise followed the recipe. Thanks for sharing yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Olmi"
},
"reviewBody": "Turned out very well and tasted even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thacobell"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "labell57"
},
"reviewBody": "Excellent! I never used to like tater tot casserole because when my mom made it, it would turn out very watery. I have to say, this recipe is perfect! I had to mix cream of mushroom and cream of celery soup together as I only had one can of mushroom soup, but no one could tell. I also added some can green beans. My husband was thrilled because he loves tater tot casserole. The whole family gobbled it down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbalmer"
},
"reviewBody": "Tasted great, kids gobbled it up!! I used taco seasoning on the meat and I added crushed Doritos to the top at the very end and browned them for some crunchiness! Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RedGinger"
},
"reviewBody": "Delish!!! Did what some other reviewers suggested, baked tots for 15 min. While they were in oven getting crispy browned meat &amp; onion. Added 1 can cream mushroom soup &amp; 1 can cheddar cheese soup to cooked meat (didn't have any shredded cheese), mix to combine. Put meat mixture in baking dish, topped w/tater tots. Baked at 350 as directed in recipe. Hubby &amp; son (11 yrs) loved it. **Made a second time &amp; added diced sweet potatoes to top w/tots, YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rarelycooks"
},
"reviewBody": "My child , who has become very picky lately, even enjoyed this recipe. It was very simple &amp; tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Jones"
},
"reviewBody": "I added a can of cream style corn and it was a huge hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Ronat"
},
"reviewBody": "This was very easy to make, it's cost-effective, and it tasted quite good. Served with a salad it's a complete dinner. I also added a bag of frozen peas/corn/green beans into the pan on top of the ground beef to make it more filling and get in an extra serving of vegetables. I also substituted a clove of minced garlic for the garlic powder, since we love garlic and I always have it on hand. I have added this to my saved list and will definitely make it again, since it's perfect for a weeknight after work when I don't want to spend a ton of time in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gma"
},
"reviewBody": "Made it just like it was written and it came out great. First time making it. Will be part of the regular menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Farmer-Poppy"
},
"reviewBody": "This was a total hit with hubby and grandson. So easy to make, but taste like you spent hours on it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine Burnett"
},
"reviewBody": "I made a few changes I used cream of chicken instead of mushroom also I used sourcream just to make sure it wouldn’t be dry. I used parsley flakes and paprika as garnishments. My family loved it big hit in my house easy and simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Challis1"
},
"reviewBody": "I added frozen mixed vegetables. It was wonderful. The leftovers were even better the next day. This is a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "I made this for the first time today for dinner. My family and I really liked this. I made 1 change though, I used 1 can of cream of mushroom soup and 1 can of cream of celery ( that was what I had on hand). But I left everything else the same. This is perfect for an easy weeknight dinner. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catbird"
},
"reviewBody": "It was good and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whitewave"
},
"reviewBody": "The only change I made was to leave the Tater Tots on top of the beef/soup/cheese mixture to keep them crispy when baked in the oven. We enjoyed this recipe, thank you. I'll make it again, but another change I'll make next time will be to place a layer of green beans on the bottom, and add a third small can of campbells mushroom soup, it seemed a bit dry with only two small cans added. Served it with green salad &amp; garlic cheese toasts which complemented it well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances Terri"
},
"reviewBody": "I always add some green beans, just to get the kids to eat them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMS "
},
"reviewBody": "Yummy! Like others cooked tots 10 min first. Next time putting green beans in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marian Carter"
},
"reviewBody": "Good recipe. I made mine slightly different the second time around. Here's what I did: Cook tots first for extra crispiness. Sauté onion, add to cooked ground beef. Mix meat with soup and cheese (save some cheese), add cayenne. Put meat mixture on bottom of dish followed by tots. Sprinkle remaining cheese in top with paprika and parsley flakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catrine"
},
"reviewBody": "Excellent recipe, I followed the directions as written. I may have used a bit more shredded cheese:) My husband absolutely loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Drake"
},
"reviewBody": "I doubled the amount of tater tots and used two cans of mushroom soup. It is a quick and easy meal and my family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bl0ndie"
},
"reviewBody": "Wow this is good..I added a cup of beef gravy to the cooked beef and took the advice of others and cooked the tots in the oven first til they were crispy. I added some hot smoked paprika and some Italian seasonings, in addition to garlic salt, pepper and about a half of a sautéed white onion. This was waaaaaay better than I was thinking it would be, really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkm"
},
"reviewBody": "Anything that gets my picky 6 year old to say \"yum!\" and clean her plate is a win in my book, but I really enjoyed this as well. Great comfort food! Based on other reviews, I baked the tots for about 15 minutes, then mixed everything else together and put the toys on top of the hamburger and soup mixture so the tots stayed crispy. Really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Breeanna B"
},
"reviewBody": "Pretty great recipe!! I would suggest using cream of chicken if the mushroom flavor isn't your thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ozsam"
},
"reviewBody": "Loved this recipe after I substituted a roux in place of can soup.\nAdded garlic to the roux &amp; very pleased with results. Rarely use can soup due to all additives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy LovesAnthony Clark"
},
"reviewBody": "This is by far one of my family's favorite casserole dish! I have turned quite a few people on to it as well! Easy enough ingredients, easy instructions and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Christian"
},
"reviewBody": "No changes, every bite was delicious!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alaina&coltsmama"
},
"reviewBody": "Quick and easy to make. My 6 yr old and 1 yr old both ate their entire servings - so in my book that makes it a winner. I made it exactly as written. It definitely has a kid friendly taste and appeal to it. I would maybe add a little more spice to make it more appealing for adults. My husband and I added a dash of hot sauce to ours and we both enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ga La"
},
"reviewBody": "My picky 7 year old ate two servings. It was yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "qbert8008"
},
"reviewBody": "This was a crowd pleaser! My stepson says it's now his favorite dish and my son said it was \"awesome man\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STC5"
},
"reviewBody": "This is as easy and good as it gets. Big cans of soup aren't 26 oz anymore, so I used two cans cream of mushroom and one Cheddar cheese. Also used \"Crispy Crowns\" instead of traditional tater tots. Everyone loves this one!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MyShell"
},
"reviewBody": "Use 32 oz of tots! Delicious guilty pleasure food. Probably not for those on a diet, and definitely tempting enough to go for seconds and thirds. Four stars was due to the recipe asking for only 16 oz of tots. The store only sells 32 oz and I honestly think 16 is a typo. There was no way I was going to use only half of a bag of tots. Serves 5 with no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baylene421"
},
"reviewBody": "I absolutely love this recipe, I use a small can of Campbell cheese soup with a can of cream of mushroom instead of the big can called for. This never lasts long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "This was a tasty comfort food, but my tater tots were a little mushy. The next time I make this I would crisp them up first, but the kids ate this meal up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dianae Weeks"
},
"reviewBody": "A great comfort food recipe when you want something quick but homemade and gooey. I used sweet potato tots and added some red pepper flakes and turmeric for color and flavor. Also used fresh chopped garlic and garlic granules. Precooked frozen burgers broke into the onion mix made it quicker still. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kguinn40"
},
"reviewBody": "We did the same as Liz. Layered tots on bottom but I made it two layers. Easy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Dalton 'Lizzie'"
},
"reviewBody": "So easy to make and turned out great! I changed the procedure around a little. I put the tater tots on the bottom and baked for 10-15 minutes to get some crunch to them. Then put the ground beef with the soup and cheese mixture on top."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/241939/easy-tater-tot-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
"name": "Vegetable"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17661/main-dish/casseroles/vegetable/tater-tots/",
"name": "Tater Tots&uml;"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/241939/easy-tater-tot-casserole/",
"name": "Easy Tater Tot Casserole"
}
}
]
}
}
, "about": [
]
}
]