				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Sweet Potato Pie"
,"datePublished": "1998-05-28T23:31:36.000-04:00"
,"dateModified": "2022-08-08T11:37:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "irenedee"
,"url": "https://www.allrecipes.com/cook/13073"
}
]
,"description": "This sweet potato pie is made very creamy with evaporated milk and gets a bit of a kick with rum. Along with sugar, salt, cinnamon, nutmeg, eggs and butter, all the ingredients are put into a food processor and blended until very smooth. Then the filling goes into a pie crust and bakes for less than an hour."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/X9Q7ocG3OKhfqE7iw7T4qqV_B1I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/156751-737f2bc65fd14938a5bef95e2043e9d7.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Sweet Potato Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "76"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "326 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "73 mg"
,"fiberContent": "3 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "380 mg"
,"sugarContent": "17 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups cooked and mashed sweet potatoes",
"2 eggs",
"1.25 cups evaporated milk",
"0.375 cup white sugar",
"0.5 teaspoon salt",
"0.5 teaspoon ground cinnamon",
"0.5 teaspoon ground nutmeg",
"2 tablespoons rum",
"4 tablespoons melted butter",
"1 (9 inch) unbaked pie crust" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Into food processor, put sweet potatoes, evaporated milk, sugar, salt, cinnamon, nutmeg, rum, eggs and butter or margarine. Blend until smooth. Pour into pie shell."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 minutes in preheated oven. Reduce heat to 300 degrees F (150 degrees C). Bake for about 50 minutes more, or until the filling is firm."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shernaleria E Eccles"
},
"reviewBody": "Very good lots of sales and compliments I also used McCormick rum extract instead of actual rum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MReich"
},
"reviewBody": "This is my favorite sweet potato pie...and SO EASY.\nSometimes I substitute Grand Marnier for the rum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle M. Anderson"
},
"reviewBody": "I thought the recipe was perfect. It's not too sweet and easy to make. Great recipe in my opinion!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoisW"
},
"reviewBody": "Soooo much tastier than pumpkin pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne Allen Smith"
},
"reviewBody": "Taste delicious and the rum was a perfect ingredient to add"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EROCK101"
},
"reviewBody": "This was way too sweet. I think a heartier sweet potato pie is more desirable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I added i teaspoon of vanilla extract. It was yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Swaffar"
},
"reviewBody": "Made the pie per the recipe. \nIt turned out delicious.\nI baked 4 sweet potatoes skins pierced.\nThen cut in half lengthwise and squeezed the baked sweet potato into a bowl to mash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommanelli"
},
"reviewBody": "I have made this pie every year since I found it on here for one of my family's favorite holiday pies! I think the amounts of everything is just right! I don't like my pies too sweet, and the butter and rum kick it up a notch! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Riley"
},
"reviewBody": "Instead of rum, I added Tennessee honey whiskey. Gonna see how it taste with that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarleenC"
},
"reviewBody": "Love this recipe! However I tweaked it just a bit. I use 1/4 cup of Captain Morgan spiced rum. For some reason I always end up with enough filling for two pies. My family and friends love this pie. It's a requested pie every Thanksgiving and Christmas get together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alwina"
},
"reviewBody": "I made this pie after reading the reviews and made the following changes: instead of 2 tablespoons of rum I used 1 tablespoon of rum and one teaspoon of rum extract. I was not satisfied with the taste or the consistency of the filling so I decreased the milk to 1 cup, increased the sugar to 1 cup, added 1/4 cup of brown sugar and eliminated the rum altogether. I really didn't care for the alcohol taste. I substituted 1 teaspoon of vanilla extract and 1/2 teaspoon of rum extract. Turned out good this time. This is going to be my new sweet potato recipe from now on. Thanks to the person who let us know that 2 cups of cooked sweet potato is about 1 1/2 pounds of sweet potatoes. Filled out the pie plate just right. Almost 5 stars with these adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AlyssaKLewi"
},
"reviewBody": "I use brown sugar and add how much I want by taste, if I feel like it isn't sweet enough than I will add a little white sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon AndBarrett Satterlee"
},
"reviewBody": "Yum. Yum yum yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ayshira"
},
"reviewBody": "The pie was great, but the rum can be substituted for Vanilla and/or Lemon extract"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MercBenz"
},
"reviewBody": "This was easy and fun to make! My family loved it. The pie was gone in two days. Will efinitely need to make this frequently!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food Adventurer"
},
"reviewBody": "Great Outline. I tweaked the recipe to fit what I wanted. I used a butter substitute called Earth Balance, whole wheat pie shells, a cup more of organic sugar, 6 white sweet potatoes (I wanted to make two pies) and just a can of evaporated milk along with the spices. I forgot the rum though. Next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jam11es"
},
"reviewBody": "Hands down the best sweet potato pie I have ever made! I was sceptical about using only using 3/8 a cup of sugar, but it was the perfect amount. I only used 1 tbsp of rum but I think 2 would've been fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "GREAT. I think the 3/8 cup sugar is an error. It's very odd to see 3/8 cup in a recipe. Anyway, I used 1/4 c light brown sugar and 1/4 cup Splenda and grated fresh nutmeg. Mixed all in blender. Very easy. Everybody LOVED this pie. Even the picky folks. I made it again without the nutmeg and they loved it too. Everyone raved about the perfect consistency and the actual TASTE of sweet potato. OH, I used beautiful, ORGANIC sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Awesome Awesome!! I had been using the recipe off the pumpkin can and substituting sweet potatoes for years and was scared to try a new recipe, this was better then I ever expected. I used Vanilla instead of rum and was very wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "This recipe doesn't need the rum. It's wonderful with out it. I needed 2 pies so by doubling the recipe I had to double the amount of evaporated milk. For that reason I added 1 extra egg to keep everything creamy. This amount of milk calls for extra spices and extra sugar. I used 1 full teaspoon of cinnamon( 2 would be ok if you love cinnamon) Instead of nutmeg(don't care for) I added 1/2 teaspoon of ginger and 1/4 teaspoon cloves. I added 2 teaspoons of vanilla extract. I used 1 1/4 cup of white sugar and 1 cup of light brown sugar. Sounds like lots of sugar but my family &amp; friends who don't like things too sweet said this is my best sweet potato pie yet! So thank you for this original recipe! ( I always use Marie Calendar's pie crust/frozen food isle)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redheadbh"
},
"reviewBody": "This was my first sweet potato pie attempt and I think it turned out yummy! I had enough filling to fill 2 deep dish pre-made crusts. The only thing extra I added was a dash of ginger and a little extra cinnamon because I love cinnamon :) Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ollied"
},
"reviewBody": "This was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JULIAGULIA3"
},
"reviewBody": "I mixed this in my blender, which yeilded a very professional even texture. With that said, this recipe needs something more, it's a tad bland. Next time, I'll add vanilla, more of the spices, and brown sugar since it could have been a bit sweeter, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ymthrash"
},
"reviewBody": "This is one of the best recipes I have ever tasted. It does need more sugar though. My in-laws were fighting over my pies and said they haven't had a sweet potato pie this good since my mother-in-law passed away in 2001. Great!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dandv"
},
"reviewBody": "I used 3 sweet potatos, and that made enough for 2 pies. My kids loved this! Even my husband, who doesn't usually like this type of pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "my family loves this pie. It is very simple to make too. I've even made a few up and froze them for a while then thawed and baked when we wanted a nice treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Visa"
},
"reviewBody": "This was my first sweet potato pie and my family loved it! It was perfect! This recipe is definitely a keeper. My husband is a great cook and like this recipe exceptionally because it did not include flour. Great texture. This recipe can easily be adjusted to yield more than one pie at a time. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodFan"
},
"reviewBody": "The best Sweet Potatoe Pie I've ever had! I haven't had many but still, it's really good! If we have rum in the house it's usually spiced rum so that is what I use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JDiva"
},
"reviewBody": "I have to agree with 1 other reviewer. This pie is not even close to my mom’s and honestly that’s not even the point. I knew no one would come close to her recipe, but man this is not even on the same planet. I haven’t put my finger on it yet, but there is something seriously missing in this pie. It doesn’t have enough flavor or spice. Something is missing! I won’t make this again, sorry.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAMPPJPATTY"
},
"reviewBody": "Absolutely delicious! I have never made a sweet potato pie before but I wanted to make one for a special occasion. I expected to try several recipes to determine which one was best, but after the way this one turned out, there's no need to try anymore. I made it according to the recipe with two exceptions. (1) I agree with another reviewer that 3/8 cup of sugar must have been a misprint--never heard of 3/8 cup of anything. Eighth marks aren't even on my measuring cups. I decided to go with 3/4 cup of sugar. (2) I went to the beverage store for rum and they were closed, so I used 2 tsp. rum extract. Didn't know what in the world I would do with a bottle-minus-2-tablespoons of rum anyway. If you're not sure about the rum flavor, just leave it out because I know it would still be great. I may skip it next time. FYI, 2 cups of mashed sweet potatoes equals about 1 1/2 lbs. of raw sweet potatoes. If you have time, bake them rather than boiling or microwaving because the taste will be far superior. I too had slightly too much filling for the regular 9-inch pie crust, but not enough for a deep-dish. If you like sweet potato pie you will love this one. UPDATE: Made again with minor changes. Reduced rum extract to 1 tsp. and increased cinnamon and nutmeg to 1 1/2 tsp. This time I would have given it more than 5 stars if possible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEANNA T"
},
"reviewBody": "Very yummy! I added about an 1/8 cup of brown sugar to the 3/8 cup of white and used some pumpkin pie spice with a little added cinnamon. I think the rum really makes this recipe..gives depth to the flavor. I think adding a tablespoon or two to the mix may make for a firmer pie which I would have preferred. Best sweet potato pie I've made so far. Don't forget the reddi-whip!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jean9865"
},
"reviewBody": "I absolutely love this recipe. My family always asks for it during holidays and get-to-gethers. I no longer make pumpkin pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JC"
},
"reviewBody": "Great recipe! I made this with egg substitute and added 1/4 tsp of ground clove and 1/4 tsp of allspice with a pinch of ginger, and it's delicious, light, and not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Yarborough"
},
"reviewBody": "I used this recipe on my husband's family who are very particular about their pie. It came away with rave reviews. I did not have a food processor so I used my blender and added the evsapoarated milk to let it blend. I also added vanilla extract and poured it into crusts. It looked like store bought!! Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "This was the first time that I made a pie EVER and this was soooo good!!! My mom even said that it was the best pie she had tasted. I did alter the recipe just a bit... I put about 2 cups of sugar per 4 cups of sweet potato. Also, just for a little extra flavor, I used coconut rum instead of regular rum and I added a little bit of vanilla extract. Talk about DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "PERFECT pie. Didn't change a thing except that I didn't have any rum. It was perfect and silky and just the right amount of sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CYAKINS"
},
"reviewBody": "This is simply the best sweet potato pie I've ever had. Even my friend who swore nothing could be better than her mother's is now converted to this recipe. I followed it almost exactly, just a touch more spices, including a dash of ginger. This pie comes out at just the right balance of sweet and spiced. The rum gives it a nice little kick, and this comes from someone who doesn't like to drink alcohol at all!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keilypie"
},
"reviewBody": "Super yummy! I used fat free half &amp; half instead of the evaporated milk. I also reduced the amount of sugar to suit my taste. Coupled with the Canola Oil Pie Crust from this site this felt like a healthful treat for the whole family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnie"
},
"reviewBody": "I feel sort of bad giving this review to this recipe because clearly I'm in the minority of those who've submitted a review, but I didn't like this recipe at all!\r\n\r\nThis was the first sweet potato pie that I 've made. I've read that oftentimes sweet potato pie is so much better than regular pumpkin pie, so I was anxious to try a sweet potato pie. I followed the recipe exactly, but my husband and I both didn't like it. Of course, I'm comparing it to pumpkin, and maybe that's wrong (like comparing apples to oranges). I therefore didn't rate this recipe.\r\n\r\nUnfortunately I ended up throwing the pie out and the recipe. I'll stick to pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Z"
},
"reviewBody": "This recipe is great! I made it this evening and couldn't let it cool before trying it. This was so quick to assemble with the processor, my three year old helped. I cut back on the sugar since I have gestational diabetes and it was still delicious. Other than that I followed the directions pretty closely, though I added a little more spices to compensate for the reduced sugar. I think I put in about a 1/4 off a cup of brown sugar. I did add a little vanilla, but that just makes sense... This came out really great, it satisfied my craving without making me ill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FWANNEE"
},
"reviewBody": "My family LOVES, LOVES this recipe. I get rave reviews each and every time I make it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WEI2GO77"
},
"reviewBody": "Great pie!! Didn't think it looked right going in the oven, but turned out fantastic! Top it off with a pecan and brown sugar mixture during the last 15 minutes of baking and it's good to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RENEE6645"
},
"reviewBody": "Although this pie was texturally excellent, no one in my family enjoyed the rum taste. I am going to try it again omitting the rum and adding a bit more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ms. Kim"
},
"reviewBody": "I tried this recipe and I loved it. I'm just now getting into the world of baking and now I'm glued to the kitchen all day. Thank you guys for this site and the recipes. Oh, my fiance wanted me to thank you also.Smile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PRETTYCATEYEZ"
},
"reviewBody": "very good..had to add a little more rum..but this recipe is great..i highly recommend it..my entire family loved it when i made it for thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely fantastic and it didn't take long to make either. Just the right amount of spices and all the ingredients blended togeter very well. \r\n\r\nI made this for a \"Holiday Pot luck\" at work and before the day was over I had a request for the recipe. \r\n\r\nThanks for submitting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TALLMISTO"
},
"reviewBody": "This recipe is great. I have tried 3 other sweet potato pie recipes and this recipe is perfect. I always take a pie to work over the holidays and everyone agreed this was the best ever. I added a little orange zest because I love sweet potatoes and oranges. Even those who dislike pumpkin pie loved this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I concur that the amount of sugar listed in the recipe seems too small. I upped the quantity to 2/3 cup of white sugar. Having said that, this is a remarkably easy recipe to fit in to even the time constraints of a full menu, resulting in a pie so delicious that battles ensued as to who will get third helpings. Strongly recommend to cooks of all skill levels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CSKBRM5"
},
"reviewBody": "this was a very easy tasty pie. i also used rum extract. but nevertheless it was realy good I will be making it again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMB146"
},
"reviewBody": "Outstanding! My husband does not care for Pumpkin Pie. I made this just to see what he would think. He really liked it; he said that is was not as sweet as pumpkin and he was sorry that he only got one piece!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SheBelievedSheCould"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELLO 57"
},
"reviewBody": "So Good!!! I had 2 leftover yams &amp; happened to have a little rum. I didn't know if I should use a deep dish pie shell or regular. I used regular &amp; had a little filling left over, but I doubt if it would have been enough for a deep dish. By the way, I tested the pie after 25 min. at 300, &amp; it was done! This pie is perfect. Thank you so much for submitting! Oh- be sure to microwave your yams- about 10 minutes total. Much easier than baking or boiling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an excellent version. I'll never go back to Pumpkin Pie after this...can't keep it on the table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2Busy2Cook"
},
"reviewBody": "This was the best Sweet Potato Pie I've ever had. I substituted the 2 tbsp. rum with 3 tsp \"imitation rum extract.\" DELICIOUS! Also, the recipe calls for 3/8 cup of sugar. I think they meant 3/4 cup. Great recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RDZELLMER"
},
"reviewBody": "This was an excellent tasting pie. My sister, who is sensitive to alcohol in food, noticed the rum right away but I felt it was the perfect amount. It was easy to make and tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "All I can say is: YUM, YUM, YUM!! This is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolly68"
},
"reviewBody": "This was very, very good. I put on a topping from another recipe, (Sweet Potato Pie). I will make this for Thanksgiving.\r\ndggilmore"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time ever making a sweet potatoe pie and it was a hit. Quick and easy. Friends and family loved it. I made enough for 2 pies (I cooked 3 large size sweet potatoes.) Thanks for a wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was dubious - I thought it might be like pumpkin pie which I hate. No way - it's easy to make, creamy and delicious - not too much nutmeg flavor. I'll do this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My guests loved this receipe! I was not sure if the ingredient rum meant extract or pure so I used pure Puerto Rican spiced rum and it gave the pie a wonderful flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "this-is-a-deleted-account"
},
"reviewBody": "I love this pie. It's the best sweet potatoe pie recipe that I've found. My family, friends, and co-workers make it disappear really fast. You have got to try it :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12190/easy-sweet-potato-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/822/desserts/pies/sweet-potato-pie/",
"name": "Sweet Potato Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12190/easy-sweet-potato-pie/",
"name": "Easy Sweet Potato Pie"
}
}
]
}
}
, "about": [
]
}
]