				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Cabbage Rolls"
,"datePublished": "2000-03-09T11:25:31.000-05:00"
,"dateModified": "2023-01-31T14:57:39.000-05:00"
,"author": [
{"@type": "Person"
,"name": "BJ"
,"url": "https://www.allrecipes.com/cook/BJ"
}
]
,"description": "This easy recipe for cabbage rolls combines ground beef and rice with cabbage leaves in a tomato sauce for a tasty and wholesome slow cooker meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xoEEI0xQsAdA9DmOLHNfdc4R6TU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20045-cabbage-rolls-ii-ddmfs-4X3-0117-ab42229579aa48acb9aef2d6f4451813.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1795844149001",
"description": "See how to make beefy, saucy cabbage rolls in the slow cooker.",
"duration": "PT3M56S",
"name": "Cabbage Rolls II",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2023/01/31/20045-cabbage-rolls-ii-ddmfs-4X3-0117.jpg",
"uploadDate": "2021-07-03T10:07:24.656-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Cabbage Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "1673"
}
,"cookTime": "PT480M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "246 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "84 mg"
,"fiberContent": "2 g"
,"proteinContent": "19 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "748 mg"
,"sugarContent": "7 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"12 leaves cabbage",
"1 pound extra-lean ground beef",
"1 cup cooked white rice",
"1 egg, beaten",
"0.25 cup milk",
"0.25 cup minced onion",
"1.25 teaspoons salt",
"1.25 teaspoons ground black pepper",
"1 (8 ounce) can tomato sauce",
"1 tablespoon brown sugar",
"1 tablespoon lemon juice",
"1 teaspoon Worcestershire sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of water to a boil. Boil cabbage leaves for 2 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "Combine ground beef, cooked rice, egg, milk, onion, salt, and pepper in a large bowl. Spoon about 2 tablespoons of mixture onto each cabbage leaf. Bring one end of the cabbage leaf over the mixture, rolling and tucking in the ends to prevent filling from falling out; arrange rolls in a single layer in the slow cooker."
} ,{
"@type": "HowToStep"
,"text": "Mix tomato sauce, brown sugar, lemon juice, and Worcestershire sauce together in a small bowl until combined. Pour over cabbage rolls."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xoEEI0xQsAdA9DmOLHNfdc4R6TU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20045-cabbage-rolls-ii-ddmfs-4X3-0117-ab42229579aa48acb9aef2d6f4451813.jpg"
}
]
,"text": "Cover and cook on Low for 8 to 9 hours."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT510M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it is very good and very, very easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheesecake Dave"
},
"reviewBody": "I have made this recipe at least a dozen times. I also use a hamburger and spicy sausage combo for that extra little kick. Freezing the cabbage makes the leaves so tender and easy to roll up when they defrost. I quadruple the sauce to have enough for the mashed potatoes to go with the rolls. My Polish husband says these are better than his Polish mom's recipe. I can't think of a better compliment than that! Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeaPa"
},
"reviewBody": "I hate it when someone starts their rating with ' I changed some ingredients.... ' but I had to out of necessity and it really wasn't much of a change anyway. I used less brown sugar, diced, canned tomatoes instead of sauce and I probably didn't use enough salt ( I am sensitive to salty foods)---that being said they turned out great! This recipe took some of the trepidation out of making cabbage rolls, so 'Thanks for that BJ!'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "langeloro"
},
"reviewBody": "Since you just want the cabbage leaves to wilt, just freeze the whole head overnight and thaw it in the morning. The leaves are all wilted, no cooking needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Granny Lin"
},
"reviewBody": "Not much of a cabbage fan, but this was delicious. I used a can of Ro-tel tomatoes instead of sauce (we like more spicey), and omitted the sugar. I also baked covered at 350 for 1 hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kenzie"
},
"reviewBody": "Flavor is good. Needed more sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's a good tasting recipe, but I prefer to make it the way my mother made it. It was a bit sweet for my taste, using the Worcestershire sauce and brown sugar. I think it should be more savory with the a bit of the sugars developing from the onions being sweated. The cabbage is also sweet if a bit of the blanching water is added to the tomato sauce. Then salt, PAPRIKA, and some lite sprinkling of fresh herbs...even a little Italian seasoning works, or terragon and oregano. I'm not used to the lemon, but the acid does help to develop sugars when there is not sugar added. This recipe is good in a pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Looked more like Rotel diced tomatoes instead of tomatoe sauce in photo of cabbage rolls. I used the Rotella and it was delicious. Better than any cabbage rolls I have made or eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ardis"
},
"reviewBody": "This was pretty good. I'm always up for trying food made differently. Still end up going back to our own. Try putting some sour krout,in your sauce it cooks I!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Kelly"
},
"reviewBody": "I followed the recipe for the most part, but added 1teaspoon of lemon juice and 1 tablespoon of brown sugar to the sauce. Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scuata2"
},
"reviewBody": "All I did differently was to add 1t. Of oregano to stuffing mix. Have tried several cabbage roll recipes that I did not like but this one is a winner...finally!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Weisz"
},
"reviewBody": "I see why this recipe is so well-reviewed. We used ground turkey instead of ground beef and were worried it would be dry, but it was EXCELLENT. Like other reviewers, we opted for baking covered at 350 for an hour instead of the slow cooker. We also cored the cabbage head and boiled it, pulling each leaf off at a time. I thought this would be a drag but it was quite easy! Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RyanC Miami"
},
"reviewBody": "It’s very good. Only reason I gave it 4 stars was you should double the sauce, the lack of sauce caused the edges to stick and got kinda burnt, plus I like extra sauce. Other than than excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Anderson"
},
"reviewBody": "Will make again. Just the right level of sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Troy Morgan"
},
"reviewBody": "I make dinner for friends once a week and they all loved this one. I think I will be making it again when I need a great slow cooker meal in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IAM4GIVEN"
},
"reviewBody": "I always lived my mom's cabbage rolls but she didn't make them often so when my hubby said he too loved them, I went looking for a recipe. This one is really, really good. I followed the recipe with the only exception being that I used Swerve brown sugar replacement since we are both diabetic. He loved them, said they were just how he remembered when he was a kid. I am making them again in a few days but doubling the amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rockporters"
},
"reviewBody": "The recipe called for 1 1/4tsp of pepper, I used 3/4 teaspoon. Wow. It was still way too much. Pepper is all you can taste. Ironically, the tomato sauce was bland. I will stick to other recipes, this one is a bit of a disaster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne H"
},
"reviewBody": "Delicious. I doubled and used 1 lb pork with the 1 lb beef. Double the sauce. Baked 350 1 -1/2 hour. I also steamed the cabbage to soften and loosen the leaved prior to stuffing. Could have used two heads since I double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Awaski"
},
"reviewBody": "This is a really good recipe. I like the flexibility of making this dish using the crockpot. I did make a few minor changes just based on my family's preferences. To the meat mixture, I added 1/2 lb of ground pork to the ground beef, 2 cloves of minced garlic, and reduced the black pepper to 1/2 teaspoon. The sauce is great as is, but I did double the recipe which was the perfect amount for us. Like others, I cored the cabbage head then dropped the whole thing in boiling water. The leaves cook a couple minutes, then fall off the head. Take them out as they cook and seperate from the head. I cut some of the thickness off the center spine of the leaf to make it easier to roll. Use about 1/4 cup of the meat mixture per leaf and roll them up. (To roll up, place the 1/4 cup of meat near the bottom of the leaf by the large spine. Roll the bottom of the leave over the meat, fold in the leaf on each side, then roll the whole thing over to the end of the leaf) By the time you're done with the first few leaves, the next couple will be ready. Keep rolling a few at a time and you're done before you know it. This time I even stuffed the small leaves which are the perfect size for our little ones to try. Use the rest of the small pieces to sprinkle over the top of the dish. Pour over all the sauce and let it cook in the crockpot for 9 hours. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer04"
},
"reviewBody": "I’ve been using this recipe for years now and everyone always compliments me on it. Somehow I always forget it’s a crockpot recipe and tonight I cooked it in the oven at 350 for 1 hour covered. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roger"
},
"reviewBody": "Easy to make. To get cabbage leaves off the cabbage, cut out the core and throw the whole cabbage in the boiling water for the 2 minutes to soften the leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Wang"
},
"reviewBody": "double the sauce (but not the sugar!) and add 2 cloves of minced garlic to the meat mixture. also, boil the cabbage for just over a minute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hit the spot! I added a small can of tomato paste and used uncooked minute rice in the filling. Also I doubled the sauce just as a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sand5869"
},
"reviewBody": "We aren't fans of the sweet and tangy sauce. Just a personal preference. Easy to make. Will use an Italian style sauce next time. Kind of like stuffed green peppers but with cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nadya L"
},
"reviewBody": "Great recipe! And here, I'll make your life so much easier: microwave whole head of cabbage on high for 10 min instead of boiling it, cut leaves from stem on bottom and on deconstruct your cabbage - one leaf at the time (starting on top of a head)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vivi"
},
"reviewBody": "Great easy recipe. Except it lacked one important ingredient: garlic! Also, no need to double the recipe, as 12 rolls fit into the bottom of the crockpot perfectly. 8 hours and they were beautifully done. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Jane Teagarden"
},
"reviewBody": "This was delicious - made it as per recipe with exception of following the suggestion of one reviewer about placing the head of cabbage in the freezer. So easy! I put it in before I went to bed and got it out and put it into a strainer this morning. Once defrosted the leaves were wilted and pliable just as if they had been booked without the hassle. Great recipe - the meat is the right firmness and the sauce is just right. Delicious meal with mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat-Perry"
},
"reviewBody": "Yes, we really enjoyed these. I did half the recipe (since we are only two) but kept the sauce as the recipe was written but ended up doubling that! The sauce is really what gives it flavor. Next time I make them I will double the sauce and am actually thinking of mixing some sauce in with the meat mixture. Thank you BJ!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Norman Lapierre"
},
"reviewBody": "Very tasty. Needs a bit more auger to surpress the acidity"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big T"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "arizzo09"
},
"reviewBody": "Whatever you do, don’t freeze the cabbage. I did this thinking I could save some time. Granted the leaves cane right off and were easy to roll, they didn’t cool well. They were tough!!! You shouldn’t need to saw through cabbage with a knife. I’ll know better for next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wade"
},
"reviewBody": "Just needed to make an extra 25 percent sauce otherwise it would have been too dry. Make sure to add seasonings to the meat mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Brown"
},
"reviewBody": "This was a simple to make. I changed it up a little by changing the ground beef to ground chicken (more healthier). I also made a Mexican Verizon by using ground turkey with black beans, sweet peppers and using a package taco seasoning as the filling and replacing the tomato sauce mixture for green enchilada sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tccallie"
},
"reviewBody": "Perfect....Just like my momma used to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "I sort of made this my own but we really enjoyed this dish! Trying to keep with the recipe, I used 1/2 lb Beyond Meat for the ground meat, cooked wild rice for the white rice and kept the sauce amounts as originally called for....adding garlic powder to the meat mixture per reviews. I also used a suggestion of adding a layer of drained sauerkraut to the top which was fantastic! Baked in the oven covered at 350* for an hour then uncovered for another thirty minutes. Made 7 cabbage rolls, served with garlic-horseradish mashed potatoes and steamed broccoli. WOW! thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran"
},
"reviewBody": "Really juicy making this in the slow cooker. Not dry at all. I added cabbage leaves to the bottom of the batch, in-between the cabbage rolls and on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "Followed suggestions. Doubled sauce by adding a can of diced tomatoes , added garlic and cut black pepper in half. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roni Schmidt"
},
"reviewBody": "I made per instructions but added a little garlic powder and paprika to the meat. I think next time I would use 16oz of tomato sauce. We like sauce! Very god. I think my husband ate 4 of them. Also was easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "Please be sure to DOUBLE the sauce. It’s has a great taste but, can be DRY if you don’t DOUBLE sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Inselman"
},
"reviewBody": "I might have gone a little heavier on the onions, and instead of using a crock pot, I used my Pressure Cooker, cooking for 60 minutes. This recipe is an absolute winner in our home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sstewart2012"
},
"reviewBody": "Cabbage rolls can be on the tame side of taste, and this recipe carries on the tradition. Could use more salt and more tomato sauce. Oh, and more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twinkie"
},
"reviewBody": "I made this like the recipe stated just added some garlic and I baked it @325 for around 45 minutes until a least 165 degrees. I put some of the extra leafs on top so it wouldn’t dry out. It turned out great. I’ll be making this again Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gormenghastly"
},
"reviewBody": "The recipe is fine, other than your suggestion to use extra lean ground beef. Cabbage rolls is not a diet food, and the fat [and flavor] is an essential component of the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Van Hoff"
},
"reviewBody": "Great flavor. Easy to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lesliecornely"
},
"reviewBody": "Excellent . Tastes like my mom used to make. And I loved it,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "It was really delicious. The only change I made was to add a small can of tomato paste with the sauce for a little more tomato flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ripley"
},
"reviewBody": "Loved this recipe. But, adding garlic and a third cup of tomato juice to the sauce mixture is what made it really pop for me. The sauce itself and that much brown sugar is a little too sweet and acidic for my tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronnie J"
},
"reviewBody": "Yummy and easy. Perfect with no change. Second time I did add half pound hamburger; half pound pork sausage instead of one pound of hamburger, red pepper flakes along with garlic powder. Double the sauce is great advice. Keeper recipe for sure:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bo Braddick"
},
"reviewBody": "Followed the recipe and it came out really well. Cabbage leaves got a little dark as they were not covered totally by the sauce which I will increase next time.\nIt's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmer"
},
"reviewBody": "I loved the taste and the ease of this recipe. However, I did not have time to use the slow cooker, so I simply cooked it in the oven. I had a small cabbage from our garden that had very tight leaves, so I cut out the core and boiled it whole until I could peel the leaves apart. Then I boiled all the leaves a little longer. The small inside leaves I used too, by cutting them up and placing them in the bottom of the pan to help prevent any sticking or burning (as suggested in another review). I will use this recipe again as it turned out so well, even the rice worked out! This recipe \"uncomplicated\" making Cabbage rolls and would recommend it to anyone who has had difficulty before or making them for the first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Winn"
},
"reviewBody": "I add grated parmesan cheese for the filling for thickness. Recipe very helpful.\n\n R. Winn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarcate"
},
"reviewBody": "boiled the whole cabbage and peeled off the leaves. Also, used brown rice and didn't even notice the difference. Double the sauce and baked for 1.5hrs at 350. Turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lam"
},
"reviewBody": "I found the meat mixture did not have enough seasoning for me. i will use this as my base and add my own seasonings next time. i also found the sauce more on the sweet instead of savory side, so i will change that as well. recipe not bad but for me tweeks are necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamspig"
},
"reviewBody": "Everyone loved it. Used purple cabbage for color and milder taste Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Shore"
},
"reviewBody": "Thank goodness I doubled this recipe I knew my husband and family would love it! Not exactly like Oma’s but very close."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KMax3050"
},
"reviewBody": "This recipe is good, easy-to-make and healthy. If you have never made stuffed cabbage before, I recommend starting with this recipe for your first time. Then modify it to your taste each time thereafter.\n\nFor myself, I found the meat to be drier than I prefer. So I switched to 80/20 ground beef and used uncooked rice which absorbed the juice. You can also use a ground beef/ground pork combination for even more flavor. I reduced the pepper to 1/2 tsp instead of 1 1/4 tsp. There wasn't enough sauce to cover all the cabbage rolls in the CrockPot. So I doubled all the ingredients for the sauce. It was the perfect amt the second time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KarenJean"
},
"reviewBody": "I used uncooked quinoa but otherwise kept the recipe the same. I had never used hamburger this way in a slow cooker and it turned out great - nice flavor and texture. Will do this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Madalinski"
},
"reviewBody": "I loved it. I used a crock pot and it was DELISH! But I will try baking this time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Dillard"
},
"reviewBody": "Added a half pound of sausage and some garlic powder along with a little Italian seasoning and extra tomato sauce. Think even more tomato sauce would be better. Added four ounces more this time. \nGenerally yummy and will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kylie"
},
"reviewBody": "I would definitely make this again. I will use more cabbage next time - it adds to the juiciness. I will also add more sauce. My family loves this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "For myself and my family this recipe fell short. No flavor at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bluehawaiimp"
},
"reviewBody": "For myself and my family this recipe fell short. No flavor at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Risika56"
},
"reviewBody": "I thought this recipe was delish! Even my husband, who is a Southern Chinese and usually finds my western food disgusting, ate it up and asked for more. \n\nI would say you def need to double the sauce and topped with bacon in the crock pot. I believe the bacon added a delightful smoky flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Childress"
},
"reviewBody": "My husband favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry McKeon"
},
"reviewBody": "Husband loved it. Best I have tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roxanne Baker"
},
"reviewBody": "I added a few more spices to the sauce with wine and also added bacon to the filling. Very good though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "I cut the cabbage at the stem and peeled off and boiled only the leaves I was going to use, there was enough meat mixture to make a little more than 12, I also tripled the sauce, it turned out great and seemed to taste even better as left overs ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mscooljo"
},
"reviewBody": "Awesome! !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Momsspaghetti"
},
"reviewBody": "I actually did not like these at all. I did them in the slowcooker but it almost tasted as if the tomato sauce that was on top had burnt. I did add extra per other reviews but I also see that alot of those people cooked them in the oven and not slowcooker. will try oven next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeremy Krantz"
},
"reviewBody": "Decent recipe but it won't make enough sauce. I tripled it and it was barely enough... I would search for better cabbage rolls recipes out there, this one is very average."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RangerWife"
},
"reviewBody": "Almost as good as the stuffed cabbage my Lithuanian grandmother used to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carismomuk"
},
"reviewBody": "I have always loved cabbage rolls, but never made them. I did what others said to do in their reviews, doubled the sauce and also added petite diced tomatoes. Other than that I followed the recipe. I was sure that my husband was going to say that he did not care for it, but he actually loved it. Now, he normally does not eat left overs, but ate more cabbage rolls for lunch the next day. This is a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy D."
},
"reviewBody": "I made the healthy version, with ground turkey and brown rice. I added extra veggies to the meat (shredded carrot and diced celery), followed other reviews' suggestions to double the tomato sauce, and baked at 350F for 1.5 hours. They came out so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberto"
},
"reviewBody": "I've long wanted to recreate this family favorite that my Polish Grandmother used to prepare, but unfortunately never wrote down. After considering all of the suggestions and testing more than a few, I settled on the following, which produced a dish that closely mirrored that which I remembered and received a unanimous thumbs-up from the family! (My apologies to those from whom I borrowed ideas without proper credit.) \n\n#1 Instead of boiling peeled leaves, I recommend that you, “Get a very large pot of water and bring up to a small boil; as you're waiting for the water to boil core the cabbage head with a fairly wide margin at the top and take off the outer leaves that are dirty. Once the water is hot, place the cabbage head into the boiling water. Once the outside leaves start to separate from the head, remove to a dish or bowl and check that the stem area is soft and pliable. Depending on the cabbage, you may need to help the peeling process along. “\n\n#2 I cooked the rice in water with 2 beef bouillon cubes added to it. (don't add extra salt to the meat mixture though.) To the meat, I added 1/2 tsp. garlic powder and increased the onion to a whole medium. (My family are big onion fans.) This increase turned out well and didn't overwhelm.\n\n#3 I replaced the 8 ounces of tomato sauce with two 29-ounce cans of No Salt Added, Crushed Tomatoes and doubled the remainder of the sauce ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elliot Dubin"
},
"reviewBody": "Good but I think if i make it again I would double the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "These were delicious! I listened to another reviewer and did half sausage/half lean ground beef and would do this again! We were able to double the batch using a full head of cabbage, so that was perfect. Honestly, I doubled the sauce, like a lot of people were suggesting, and this seemed like a waste. There was way too much sauce this way and we ended up throwing most of it away after dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Hardy"
},
"reviewBody": "I will make it again but with a lot more seasonings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fluffy"
},
"reviewBody": "I added a can of tomato soup to the sauce, it needed a little more liquid. It turned out perfect, delicious and i will make it this way again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathleen W"
},
"reviewBody": "I made this but used many of the helpful tips from subscribers; made more sauce, used a combination of tomato soup and tomato sauce, added some of the tomato soup to the meat mixture. Also sauteed onions before putting into the dish and also used some ground pork. I appreciate the guidance from this recipe and other subscribers. The dish was pretty good and hubby appreciated the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Good and easy. I think next time I’m going to add some Cajun spice. Needed something"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "It was pretty good, but we thought it was very bland for us. Next time I might try to add some more spices and maybe some garlic to the meat mix"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheiswan"
},
"reviewBody": "Delish...double the sauce and boil the whole cabbage head and remove leaves as they soften. The freezer method makes tough cabbage...not pleasant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CrazyCatlady"
},
"reviewBody": "I followed to recipe but I add seasoning and minced onion and a dash of garlic while I cooked the ground beef to add more flavor to the beef I will make this again. I made enough for two meals and froze it and the sauces I will be cooking this in the oven at 350 like one review said instead of the crock pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Scott Rowe"
},
"reviewBody": "Not one of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Donovan"
},
"reviewBody": "Very very yummy! Will be making this again sometime soon. I made just a small adjustment and doubled the amount of sauce/brown sugar/lemon juice. Had enough sauce to pour over some boiled potatoes to go with the cabbage rolls. Delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eileen"
},
"reviewBody": "I did not use lemon. I doubled the sauce. By using one can of tomato sauce and 8oz of marinara because I did not have any more tomato sauce. I sprayed my Crock-Pot with cooking spray. Then ladled one scoop of sauce on the bottom it did not stick. Everyone loved it my neighbors , my boyfriend and my son and I. I'll definitely make it again. \nThe sauce did not taste good when trying it before it was cooked, I was worried. But after cooking it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda w"
},
"reviewBody": "The recipe is really good-my personal favorite has beef and pork and sauerkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Vargo-Chapman"
},
"reviewBody": "I added 1/2 t garlic powder &amp; only put in 1/4 t pepper. I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Coburn"
},
"reviewBody": "This is such a simple and tasty dish. I added a little bit of vinegar to the sauce to give it a tangy taste. My family loves this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanciemartin"
},
"reviewBody": "Been making these for years and the only change is the topping I use is with sauerkraut and diced carrots/celery and then tomato sauce on top. very good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lloyd"
},
"reviewBody": "Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kristy"
},
"reviewBody": "Followed recipe even though I thought there wasn't enough liquid, and I was right. Tasted like it was missing something and it was dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harmony758"
},
"reviewBody": "This was fantastic! The only change I made was to QUADRUPLE the sauce (as other commenters recommended). My husband always complains stuffed cabbage is too bland, but this one isn't. He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Featherstone"
},
"reviewBody": "didn't leave enough time for the 8 hour cook so I did it in 5 on high in the slow cooker and it turned out fine. Oh! added some chili flakes for some kick. turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Koekkoek"
},
"reviewBody": "Added a pinch of brown sugar to meat mixture.Sometimes tomato recipes can be a bit acidic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Malia"
},
"reviewBody": "My husband really liked these cabbage rolls. I quadrupled the sauce as the other reviews noted. I revised the sauce slightly by adding 1 tablespoon barbecue sauce &amp; a little onion powder. I also added some granulated garlic to the hamburger &amp; rice mixture. Next time, I'll add some chopped parsley to the meat mixture for some color. I made an extra pan of rolls for my freezer. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina "
},
"reviewBody": "Very delicious. The only changes I made was doubling the sauce recipe and adding a half teaspoon of garlic powder to the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rose williams"
},
"reviewBody": "I didn't think change nothing and a I most definitely make again no"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Roberts"
},
"reviewBody": "I added garlic and fresh parsley to the meat mixture. I doubled the sauce too. Really delicious. I will be making again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20045/cabbage-rolls-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20045/cabbage-rolls-ii/",
"name": "Easy Cabbage Rolls"
}
}
]
}
}
, "about": [
]
}
]