				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Hamantaschen"
,"datePublished": "2020-06-18T23:07:07.000-04:00"
,"dateModified": "2022-12-08T11:09:28.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Sharon D"
,"url": "https://www.allrecipes.com/cook/24328167"
}
]
,"description": "Hamantaschen are triangular-shaped cookies filled with your favorite jam or preserve. A traditional, popular treat for the Jewish holiday of Purim!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eSIcuTwb4sqrdO5-XBw1esYa3dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2169022-935585417d6f41a0b33d722e5ead1ae5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Hamantaschen"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "72"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "246 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "56 mg"
,"sugarContent": "15 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 large eggs",
"1 cup granulated sugar",
"0.75 cup vegetable oil",
"0.5 cup orange juice",
"2.5 teaspoons vanilla extract",
"5.5 cups all-purpose flour",
"1 tablespoon baking powder",
"1 cup fruit preserves, any flavor" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Combine eggs and sugar in a large bowl; beat with an electric mixer until smooth and creamy. Stir in oil, orange juice, and vanilla. Combine flour and baking powder; stir into batter to form a stiff dough, adding more flour if needed."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out onto a lightly floured surface and roll out into a 1/2-inch thickness. Cut into circles using a cookie cutter or the rim of a drinking glass; place 2 inches apart onto the prepared cookie sheets. Spoon about 1 to 2 teaspoons of preserves into center of each cookie. Pinch edges to form three corners."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until lightly browned, 12 to 15 minutes. Cool on the cookie sheets for 1 minute; transfer to a wire rack to cool completely."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe exactly. (Only thing different was that I did chill in a covered bowl out in the garage until I was ready to bake.) Since many people commented on the corners falling apart, I was extra diligent about pinching as tight as I could, but they did flatten and puff up a little. I didn't lose any of the filling. They had a great taste! Still moist and delicious 3 days later. I did freeze 6 for another time, so will see how they do. I brought them to a supper where many people had not even heard of them, but everyone enjoyed them. Would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made the recipe many times. However, it is in desperate need of salt, so I add 1tsp to the dry ingredients and likely it could take more. I also substitute 1/2 a tsp of vanilla for almond extract. Also, it's important to chill the dough as per the note at the top. Otherwise, this recipe works great for me. Of course, you can use any spread in these cookies -- chocolate, apricot, raspberry, plum, whatever... Regarding comments of those substituting the oil for butter. That is ok if you are NOT Kosher. However, this turns the recipe into a DAIRY recipe meaning some Jewish families could not eat them after a meat meal. Just something to keep in mind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Cookies came out great I didn’t have orange juice 😅 so I substituted with pinnapple/mango/lemon juice mix! Will definitely use again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have never made such good hamantaschen. I adapted the recipe to make it gluten-free. My cup measures were a bit smaller than standard, but my eggs also weren’t big. I substituted fermented apple juice (diluted fifty percent, fermented with kefir grains adapted for the purpose: I always have some in the fridge) for orange juice and didn’t add any baking-powder. I doubled the amount of apple-juice. I substituted gluten-free bread flour for the regular flour in the recipe. The result was a very soft sticky dough. For each hamantasch, I took a spoonful of soft dough, rolled it in gluten-free flour and shaped it into a three-inch disk. After putting in the teaspoonful of sweet filling on each disk, I created the triangular pockets using a technique I read about elsewhere: getting the “pinwheel effect” by ensuring that each side was folded over at the left-hand corner and under at the right-hand corner. That stopped the pastry cases from falling open in the oven. I baked them in a fan-heated electric oven on baking-paper, greased with rapeseed oil, at 170 degrees Centigrade for about twenty minutes. I didn’t bother with the wire rack but made sure they weren’t stuck and left them covered but with room to breathe while they cooled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super easy. I added wet poppy and made about 10. I substituted milk for OJ and butter for oil. I pinched it first then put in the poppy seed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ardis1929gmailcom"
},
"reviewBody": "The recipe called for more flour than was needed. I only used 4+ cups of flour. The dough was easy to work with. My problem was the three corners opened up in baking and most of them came out flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Annette LA Torre"
},
"reviewBody": "They taste great; but look terrible while they are backing, they flatten out to a cookie! Can anyone tell me what to do?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda Sable"
},
"reviewBody": "This is the 2nd time I've made these and I can't seem to get the three points to stay closed. During cooking they open up and look like a mess. Any thoughts on how to correct this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sharmuse"
},
"reviewBody": "I made this recipe following the instructions, but I used whole wheat flour and the dough was way too dry. I added some extra oil, but if I make this recipe again with whole wheat flour, I would use at least 1 cup LESS flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very dry; we had to add oil in order to make the dough even a little workable, and even then it was crumbly and hard to work. No salt in the recipe, which made it bland. The dough did not crisp very well in the oven using the started bake time, or hold it shape. Overall a fail. Will not use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fallphenx"
},
"reviewBody": "These came out great! The only issue I had is they didn't stay crimped together while baking and ended up flat. I think you do need to chill the dough.. I didn't and I think that was a big part of why they flattened. Reduced sugar by a 1/4 cup and only used a tsp of filing. Will try with butter, milk and lemon in the dough next time. I tried a different recipe today and it didn't come out at all like this one. I will stick with this one next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lyle A. Winokur"
},
"reviewBody": "Reduce the amount of flour. 5 and a half cups is too much and the dough became crumbly. Even adding water, egg, and more oil the consistency still is not right. I've made hamantashen for 30 years and this is by far the worst recipe ever. I used it because I have kids and they wanted to be included in making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Cohen"
},
"reviewBody": "I thought this recipe was great. I always remember my hamantaschen falling apart in the past, but these stuck together for the most part...and I didn't even use water or egg as a binder. I do tend to over-fill though, so a few of the jelly filled ones fell apart upon baking, but that's totally my fault. I made a delicious brownie-like chocolate filling for the others, and those all baked up perfectly. The only change I made to this recipe was adding a tiny bit of orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rhiannon Draws"
},
"reviewBody": "I set it up to make 36 cookies instead and used 5 eggs so maybe that was my problem but used almost an entire bbagof flour and only now has it gotten to the right consistency. There is an issue with how much liquid ingredients is used. A simple recipe should have been so liquidy and hard to multiply"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "RaquelL"
},
"reviewBody": "I followed the suggestions about subbing butter for the oil and cutting down on the flour, but this recipe still came out bad. The taste was bland, overly floury, and they did not hold their shape at all. There are other recipes out there that call for nearly the same amount of all other ingredients but half the amount of flour. I tried one earlier in the week and it was significantly better. If you choose to follow this recipe cut the flour down to 2 1/2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "right maker"
},
"reviewBody": "i loved the recipe so easy to bake and even easier to enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Creative plates"
},
"reviewBody": "I loved this!! I was super easy!! I would recommend halving the recipe because it makes a ton! I also made some in squares. Note that the filling expands!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This was a great recipe. The only change I made was to only add 4 1/2 cups flour because I was adding flour as I was rolling out the dough. We put chocolate chips in some and I made some apple pie filling to put in the others. They were like little personal apple pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca from LA"
},
"reviewBody": "Yum! These are tasty cookies! I substituted butter for oil, milk for orange juice, and added 2T of sugar. Brushed with egg white which made them pretty and glossy. Cooked for 16 minutes. It's important that you use a good quality jam -my favorite is St Dalfour Red Raspberry. When I used a cheaper jam from the dollar store, it leaked out despite the cookies being made the same way. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "This was a great recipe! I used oil as the recipe called for rather than substituting butter as others have done. I didn't need to refrigerate the dough... I was able to work with it just fine. I used poppy seed filling, almond filling, and a delicious fig orange spread. When i was done i lightly dusted them with powdered sugar fresh out of the oven. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eric"
},
"reviewBody": "Decided to make a half batch late in the evening and recipe lived up to its name. The main thing with oil based dough is to ensure wet ingredients mix well as oil sinks to the bottom and sugar does not incorporate as well. The stand mixer dough hook made for quick work and i didn’t have to use much extra flour. The"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Winaker Greenberg"
},
"reviewBody": "I would've given it 5 stars, but I had to make one adjustment. I used only 3 cups of flour, as I only had a hand mixer and the motor was starting to burn up because the dough was just too thick (so best with a Kitchenaid mixer). I also refrigerated it for several hours. These came out beautifully, just like my mom used to make. This recipe (with adjustments on the flour) is a keeper!! Please note that I live in CO at an altitude of 7,500 ft above sea level. Not sure if this makes a difference, but baking at this altitude is always a challenge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "I have been using this recipe for years. The key to them not unfolding is to refrigerate dough. Take out small balls at a time and us a silicone mat with a vert small to no additional floor. Dough stays tacky and vet easy to squash together into triangle shape. These are delicious! These are cookie Hamentashen....not the cake kind. These are preferred by my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Ivey"
},
"reviewBody": "I noticed the dough starting to get dry so I stopped adding flour. In the end I probadly used about 75% of what they recommend and it was still a little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeb"
},
"reviewBody": "I found the recipe incredibly easy to make. I followed it exactly and used apricot and raspberry jam. Unlike some others, I didn't have any issues with the dough being too sticky. My mat is silicon and adding a little flour to it and the rolling pin worked well. Tip - if the dough is too thick when it's rolled out, the corners won't stay pinched together well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maytal"
},
"reviewBody": "These turned out beautifully, though like many others I would substitute butter for the oil, unless you want to make your hamentaschen pareve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caitlin Dunlay"
},
"reviewBody": "I made these with strawberry jam and they were SO good but they did look a little weird. I'm not a pro baker or anything so I could have messed it up or something but besides the way they looked, they tasted like heaven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zahavas"
},
"reviewBody": "I just made them Today whit me toddler very fun , tasty and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "datwins"
},
"reviewBody": "I love this recipe it's a tasty dish, and fun to make for school projects for foreign food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jennifer"
},
"reviewBody": "Reduce oil to 1/2 cup. Add a little almond extract. Refrigerate for a few hours or overnight before rolling out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindi Barth Maline"
},
"reviewBody": "This was a nice recipe. Dough really easy to work with. I did what others suggested and put the dough in the fridge for a little while first. We did make way more than 24 cookies. I filled them with homemade apricot and prune filling and also Nutella and chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erica1618"
},
"reviewBody": "I'm a fairly decent baker. I found this recipe to be easy but the directions were not that great. The cookie tastes yummy (got my 3 year's old approval!) but was a mess. I substituted the oil for butter, used milk instead of OJ and used 4.5 cups flour. After doing a little research, I found the key to making this: oven has to be 400 degrees to get it a little toasty, roll dough to 1/8 in and roll again to stretch it after you \"cut into circles\", only 1 tsp of preserves, and instead of pinching corners, fold and tuck. Unfortunately, I figured this out on my very last cookie which came out beautiful and perfect. I will be starting over and making a new batch..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARIREA"
},
"reviewBody": "I have never made hamentashen before. This turned out great. I made 2/3 the recipe (used the function to adjust the portions, for 16 cookies) and it was just right amount for us. I wanted a tiny bit of nutrition in there so I substituted in about 1/2 cup of golden ground flax, can hardly tell at all. I think mine were a bit on the bigger side, and I had to add a few minutes to the cooking time. They kept their shape, easy to do, tasted good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mfg"
},
"reviewBody": "Good dough, especially when still warm. I made the recipe vegan by substituting the three eggs for three tablespoons milled flax gelled in 9 tablespoons water. This reduced the needed flour by about a half cup. Yield was more like 3 doz 1.5\" rounds. Had to compensate for dryness by the third batch by rubbing surface of flattened dough with vegetable oil, and moistening pinching corners with water on inside seam of pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LYNNINMA"
},
"reviewBody": "As do others here, I have problems with oil-based dough. Thusly, I used 1 stick of butter (chilled &amp; cubed) and 4 oz. light cream cheese (chilled &amp; cubed) and made in my food processor. I let the dough rest for 2 hrs. in the fridge before filling (I used seedless black raspberry preserves and orange marmalad). I baked them at 360 degrees for exactly 14 minutes. The resulting cookies tasted great, if not perfectly formed (this shiksa's first attempt at making hamantaschen)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "msol"
},
"reviewBody": "My friends and I decided to make these for purim. I didn't have a chance to read reviewer comments, so we made it exactly as directed in the recipe. \nThe dough we ended up with was way too sticky to roll out. We had to add a lot more flour to deal with that. This effected the flavor of the dough... it was bland. They also took forever to bake in the oven- I'm not sure if that was because of the extra flour or what.\n\nThey weren't horrible- they were OK. Which is why I still gave the recipe 3 stars. But instead of making changes to the recipe, I think I'll just find another, better one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bugpaste"
},
"reviewBody": "Tried this recipe twice. The first time I used 2-1/2 cups of flour and let the dough sit overnight. The result was a sticky unusable mess.\n\nThe second time I used 3-1/2 cups of flour and did not let the dough sit. The result was a sticky unusable mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "How to make this perfect: as another reviewer suggested, replace 1/2 c of oil with a stick of butter and whip with sugar before adding eggs. I also added a tsp of orange zest, used 4 1/2 c flour mixed with the baking powder, and held aside the 5th cup of flour to add as needed. I ended up using about 5 c total. Mix one egg with a Tbsp of milk, and using finger, moisten the outer edges of each circle before filling and pinching. I had no leaking casualties at all. I used to make these with my mother when I was little, and she was smiling from Heaven when I made this recipe. It is absolutely perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Sanchez"
},
"reviewBody": "Great!\r\n\r\nFor those having issues with dough texture due to the oil, substitute butter for the oil and milk for the OJ. The oil and OJ are used to make the cookies pareve (meaning they contain no meat or dairy and can therefore be consumed with other meat and/or dairy foods according to Jewish law.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "principessa"
},
"reviewBody": "These were great, but I have a couple of recommendations that I plan to use next time I make them. They puff up quite a bit, so I suggest either making them a bit thinner or putting in about 1 tsp (instead of two) of fruit preserves, to prevent any running. It also was a bit bland, so I would add a bit of orange or lemon zest next time to bring out a different flavor. I also substituted margarine for 1/4 cup of the oil to give it a bit more body, and my dough rolled out beautifully after refrigerating overnight. I also had to bake about 20 minutes, but that just may be my oven. I want to use this recipe as another cookie base and can't wait to experiment!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lowcal-cook"
},
"reviewBody": "I have made them since 2011 iand I give them out as Mishloach Manot and people always love them!!\nThe secret is to add the zest is a lemon!!! That’s changes the game!!! If you are a novice baker, try this recipe. You won't be disappointed. I used 4.5 cups of flour and when rolling out the dough used the other 1/2 a cup. And refrigerate the dough for an hour bf baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alfia"
},
"reviewBody": "I also found the dough bland and hard to work with, but the latter may be my relative lack of experience with baking in general. Putting more than a teaspoon of jam is definitely a mistake and as another reviewer noted, jam is preferable to jelly as jelly will run. I would even go so far as to say that you want confiture or very thick jam for this. As evidenced by the photos, it isn't easy to make these cookies look good either. I know it's possible though, so I'm guessing experience counts. I will try a different recipe next time though as the dough really is bland. Had fun making and eating them with the kids nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandibula"
},
"reviewBody": "they came out great! everybody loved them! they taste like the real thing. I freezed half of the dough wrapped very well in saran wrap and the hamantaschen also came out great. I thawed the dough overnight in the fridge, but when I started to roll it it cracked a little bit. I let it sit in the counter for 15 minutes to get closer to room temperature and then it rolled out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed R"
},
"reviewBody": "They came out tasting great. I did add the zest of one orange although I do not know how much that affected the final result. The biggest problem I had was that the sides of the cookie opened up while in the oven. Make sure that you pinch the corners well, and do not overload with preserves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Winters"
},
"reviewBody": "Fantastic! I've never had Hamantaschen before, but I found these delightful. I replaced the oil with melted butter. I'm not sure how large these are supposed to be, but I made about 3x as many as the recipe was supposed to yield by using a 3 inch diameter cookie cutter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "basickitchen2"
},
"reviewBody": "This was one of the easiest, tastiest cookie recipes I have used. I followed the recipe nearly to the letter, though I used only 5 cups of flour (plus more for rolling) and I chilled the dough for 2 hours, I think the chilling is a must, considering it needs to be rolled so thin. I also had to cook them about 15 minutes, but it all depends on your oven. What a great recipe though, I'll be making these for years to come! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Chizik"
},
"reviewBody": "Excellent and easy recipe. I didn't chill the dough because my 2 year old was helping, and well...her patience level isn't very high. :) Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacob Rogers"
},
"reviewBody": "Great recipe. Tips: use wax paper to roll it out, it can be a little sticky, but that's ok. I made my cookies too big and even though I keep adjusting after each batch I would of liked smaller cookies, so I suggest smaller cookies as they will swell a lot in the oven. Don't worry about putting them too close together on the cookie sheet because after you pinch them into eyes they have plenty of room next to each other. Make the most of your first rolling out because each subsequent rolling out will produce more inferior cookies than the last."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TFRach"
},
"reviewBody": "No mixer needed for this recipe!!! I substituted white whole wheat flour for the all-purpose flour, added flour gradually. First I used a whisk, then a rubber scraper, and finally just my hand to get the last bit of flour mixed in. I rolled out the dough between two sheets of waxed paper without chilling it, and used an inverted drinking glass to cut the dough into circles. One tsp. of preserves was plenty. Make sure to pinch the sides closed very well so they don't flop open. I baked on parchment paper, for about 15 minutes. Got about 50 hamantaschen. they turned out great. Now I would like an easy recipe for the poppy seed filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Schwartzman Lyon"
},
"reviewBody": "These turned out wonderful. I did not refrigerate the dough first and it all held together well. My children are picky and these went well. I'm going to try using brownie mix as the filling in my next batch (like in another recipe, Hamentashen w/ brownie filling, from this site). We liked the texture and taste of this batter, so I'm going to play with fillings. I used blueberry for some and raspberry for some so far. Thank you this is an easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Davis"
},
"reviewBody": "This is an excellent recipe. I didn't have organge juice and added 1 1/2 tsp. orange extract, but the orange juice would have been better as I needed a little more liquid. Also, 4 cups of flour was perfect, 5 1/2 would have been too much. I used both rasberry jam and plum/prune butter and baked for 15 minutes which was perfect. I will definately make this recipe again and next time I may take some of the dough and shape them into walnut size balls, put an indentation in this middle and fill with jam. Thank you for this versatile recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "A bit crumbly and it seperated at the pinches when I baked. Next time I will chill before working with it. Tasted yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "Refrigerating the dough made ALL the difference. I've often had trouble with roll out dough, but this was very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "very easy and tasty. I chilled for about 4 hours before use and that was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MileyRules57"
},
"reviewBody": "Very very good! I made them today and they are amazing! Make sure not to bake them too long though because then they get a little too hard. Thanks for posting they are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tanuki Tan Tan Tanuki"
},
"reviewBody": "My first attempt at these cookies and everything went great except I think I overfilled the cookies thus making them fall open and not look very triangular. They still tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelynn"
},
"reviewBody": "As an incredibly inexperienced baker, I found this recipe reasonably simple and very tasty. \n\nWith the first batch I made the mistake of not rolling the dough thin enough. The taste wasn't impacted, but they didn't hold their shape. The second batch turned out with a better triangle shape.\n\nWhen I make these again I won't add the flour all at once, seeing as I probably added another cup while I was rolling the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie H"
},
"reviewBody": "Loved this recipe. I made it twice it was so yummy. I suggest holding back a little on the flour because by the time you flour the surface you use to roll the dough...you will have added quite a bit more flour to the recipe and it makes it more difficult for the edges to stay pinched together. I also wouldn't refigerate the dough...I don't think the piched corners would stay together as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALASKABABA"
},
"reviewBody": "An excellent recipe; dough is so easy to work and perfect in consistency and flavor. I like to vary the fillings for a colorful and varied presentation.\n alaskababa"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIRSTIN243"
},
"reviewBody": "Excellent cookie. Good texture, good shape hold, and without a bitter after taste that many hamantaschen recipes have.I would not recommend refridgerating the dough though. Dough should be used immediately after making. If one delays, some extra egg &amp; water solution should be used to seal seams before baking, as the seams will rupture and spill goo everywhere if they aren't sealed. Use good quality jam and avoid using jellies as they tend to leak more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a very good recipe, the dough was perfect. I recommend brushing them with egg just before putting them in the oven and baking them at 400 instead, then they look nice and shiny and browned. I also got more like 35 cookies from the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YSBRYD"
},
"reviewBody": "Not hard to make and very good. I had to make a cookie with orange marmalade for a class project and so I thought of the cookies Grandma always has. These were perfect and my classmates Loved them. Note: Pinch those corners tight if you're using a thin filling! But I got to eat all the ugly ones, so it worked out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sondra Glucksman"
},
"reviewBody": "I FOLLOWED THE RECIPE TO THE LETTER AND FOUND IT TO BE A SIMPLE ONE BUT A BIT MESSY TO WORK WITH MY MIXER. THE STIFF BATTER WAS HARD TO BEAT AND KEPT CLOGGING UP THE BEATERS, BUT IT WAS WORTH THE TROUBLE. THEY TURNED OUT BEAUTIFULLY AND WERE DELICIOUS! NEXT TIME I WILL ADD SOME LEMON ZEST TO THE BATTER."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STACEY."
},
"reviewBody": "we used this recipe to make hamantaschen with a group of older adults...it was wonderful! easy to make, rolled out well, and tasted good. the favorite fillings were apricot jam and chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOMDGP"
},
"reviewBody": "I've always had trouble with an all-oil based dough, so I substituted a stick of butter for 1/2 cup of the oil, and beat it with the sugar before adding the eggs. Then I refrigerated the dough for a couple of hours. Two tablespoons of preserves ran out of the hamantaschen; 1 tablespoon is more than enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very good ecipe but I substituted prepared poppyseed mix for the apricot filling....yummy"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/27201/easy-hamantaschen/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/79/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/27201/easy-hamantaschen/",
"name": "Easy Hamantaschen"
}
}
]
}
}
, "about": [
]
}
]