				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Mint Chocolate Chip Ice Cream"
,"datePublished": "2020-06-18T23:09:13.000-04:00"
,"dateModified": "2022-08-19T10:19:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Darryn M Briggs"
,"url": "https://www.allrecipes.com/cook/848854"
}
]
,"description": "A delicious mint chocolate chip ice cream that tastes decadent and creamy while still being refreshing. Homemade ice cream has never been easier."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7hVx4egrKIAYWUQb3HPgBaKcSw0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1213701-cebbf9f7a162433baec4916bab011123.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Mint Chocolate Chip Ice Cream"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "668"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "439 kcal"
,"carbohydrateContent": "43 g"
,"cholesterolContent": "86 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "18 g"
,"sodiumContent": "195 mg"
,"sugarContent": "40 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups 2% milk",
"2 cups heavy cream",
"1 cup sugar",
"1 teaspoon vanilla extract",
"1 teaspoon peppermint extract",
"0.5 teaspoon salt",
"3 drops green food coloring",
"1 cup miniature semisweet chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir milk, cream, sugar, vanilla, peppermint extract, and salt together in a large bowl until the sugar has dissolved. Mix in green food coloring."
} ,{
"@type": "HowToStep"
,"text": "Pour mixture into an ice cream maker and freeze according to manufacturer&#39;s instructions."
} ,{
"@type": "HowToStep"
,"text": "Add chocolate chips about 10 minutes into the freezing. Continue churning until ice cream has thickened, about 20 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Transfer to an airtight container and freeze until firm, about 2 hours."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ecarrabine"
},
"reviewBody": "Fun recipe to make in an old-fashion ice cream maker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Frozen salty Mouthwash This recipe was not good. We made it exactly as written with the exception of using shaved and finely chopped chocolate (that was what we had). This recipe tasted like frozen salty mouthwash. Nothing like a mint chocolate ice cream. I believe there too much peppermint extract, too much salt and I'm not sure that I would include the vanilla or at the very least reduce it. It is as if the flavors of the extracts competed with each other. Just find a different recipe. What a waste of lovely ingredients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Patricia Schneider"
},
"reviewBody": "I made this recipe twice and both times it never firmed up despite all of my ingredients being cold. I would guess that the amount of milk is too much. Disappointed as I have wasted two batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diana Eichhorn"
},
"reviewBody": "Since this uses granulated sugar it was very grainy. The texture was like sand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrie h"
},
"reviewBody": "Awesome recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Margeaux Batt"
},
"reviewBody": "This is definitely not a smooth ice cream, and baring the taste that I enjoyed, this ice cream was not enjoyable. \n\nThe taste of the mint in the ice cream was great, and the right combination of flavour for my taste. Unfortunately, this is the only thing I enjoyed. \n\n1. Once frozen, the ice cream was gritty and crumbled. It wasn't smooth. I suspect it was too watery. When I saw the recipe called for 2% milk, I was skeptical. I instead changed it to whole milk, but it was still too watery and subsequently resulted in a gritty ice cream. \n2. I used chopped dark chocolate. I would not recommend this, as the chocolate became very hard and even the smallest pieces ended up tasting like dehydrated chocolate, the type that got warm at some point, then set again, but now has that horrible powdery look and taste to it. Rather try to use milk chocolate. \n\nI'll reuse the flavour combination with the mint and vanilla extract / essence (UK, South Africa, and possibly other current or former British territories calls it essence instead of extract), but I'll make use of a different sweet cream base and look for milk chocolate chips when I make my next batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andrea Walker"
},
"reviewBody": "I like to make a recipe exactly as written first. This wasn’t great. The mint flavor was not very strong, I think due to the vanilla.\nI worried about the sugar content. That’s a LOT of sugar. I should have gone with my gut to halve it, but again wanted to give the recipe a fair shake. I think that contributed to losing the mint flavor as well. I use a very strong mint extract and I’m really surprised how little I could taste it. \n\nNext time, I’ll halve the sugar, nix the vanilla, and do two full teaspoons of mint. We’ll see then if the new version stays. But this is nothing like you’ll find in the stores. Work in progress."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Correia"
},
"reviewBody": "Great I added more peppermint and I skipped the food coloring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lee Martin"
},
"reviewBody": "I used the chips. had a small package of D-H frosting creations left, hum so I took a chance! it was the right flavor and color (mint chocolate) since these packages are not around any more, unless you deal with the internet trade, I guess i'll use them before they turn to rock!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendi Garland"
},
"reviewBody": "love it. I added 10 drops of green food coloring and added 1/2 c big chocolate chips chopped with 1/2 c fudge mint cookies chopped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oongawaa"
},
"reviewBody": "My loves this ice cream. Mint Chip is her favorite. I have made this twice now. The first time per the recipe except using whole milk. That was really good. But then I took some cues from Naples and used 1 cup whole milk and I cup half and half instead of the 2%. When we eat ice cream mouth feel and texture are outweigh any reduction of calories. I also beat 2 eggs and added those. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly G"
},
"reviewBody": "This was a great recipe. Larger chocolate chips get quite hard to eat when frozen. Definitely use the smaller chocolate chips, chop some chocolate chips, or shave a chocolate bar instead. \nThe flavoring was perfect, the ice cream was creamy, and the recipe was easy! Can't ask for more than that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spudnut"
},
"reviewBody": "You should put it in the your freezer for a while so that it gets a little harder it was kind of soupy for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Breedlove"
},
"reviewBody": "Loved it!! For our family we added a bit more peppermint extract and sugar. Based on other reviewers suggestion, I shaved a bar of bakers chocolate(we liked the German Sweet, not quite as sweet as semisweet). This is a definite favorite!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megs"
},
"reviewBody": "This turned out great... we never make ice cream and with all the reviews, I was really nervous. I DID adjust because of my nervousness - we bought Hershey’s milk chocolate bars and processed them so they’d melt better, I used 3/4 tsp peppermint, I used about an 1/8 tsp salt. Mint flavor was perfect, chocolate was just enough and didn’t have use chewing our ice cream, and the consistency was fantastic!!! Great, simply, quick recipe. We’ll be doing this a lot! (We may try whole milk instead of 2% next time to give it a richer feel, and we’ll definitely use it as a base with other flavors)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kecks4"
},
"reviewBody": "Not sure why there were complaints about this recipe. It turned out great! I mixed everything beforehand so the sugar would be nice and blended. I only used half the peppermint as that was the level of mint I prefer. I didn’t have mini chips so added some regular semisweet chips I had. It tastes delicious. I suppose if you don’t want to use the 2% milk you could substitute whole milk or half and half, but I found the consistency was perfect for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "charlie"
},
"reviewBody": "It was so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "claire18"
},
"reviewBody": "One of the only times I couldn’t eat ice cream. The Peppermint extract made the whole batch of ice cream inedible. Waste of ingredients, just use mint extract and much less if you want to be able to eat this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Legs"
},
"reviewBody": "The flavor is there, but the ice cream turned out to be more like ice chips. Not creamy at all. I used whole milk instead of 2% and folded in the chips once it was a little thicker. I'll be making boozy shakes with the rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I was doubtful after reading many reviews, but this turned out great for me! I followed the base as written, but left out the dye. I did start with 1/2 tsp peppermint (McCormick Peppermint), tasted, and then added the full amount. I could see where some would prefer less, but my kids told me we should start selling ice cream after tasting this!\nMy husband loves mint cookie dough, so I made tiny balls of eggless cookie dough and dropped in those instead of just the chips.\nAlso, my \"manufacturer's instructions\" call for chilling before freezing, so I refrigerated the mix for a couple hours. It took about 30 min in the maker to get to the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Peyton"
},
"reviewBody": "Fun easy and great tasting treat. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momto4under5"
},
"reviewBody": "This is a great base for many types of ice cream. My husband loves this recipe especially, with mint extract and shaved dark chocolate is to die for. My kids love it as vanilla bean with crushed Oreos. So quick and easy. I always use whole milk because that’s what we keep in the house and it’s great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Mccarty"
},
"reviewBody": "I ordered peppermint extract from Amazon. We took regular chocolate chips and smashed them to bits. This was absolutely delicious. Followed the recipe exactly. We were eating it out of the container as it was mixing LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandie Lamberth"
},
"reviewBody": "I used one cup of whipping cream and 3 cups of milk, 1/2 cup of sugar and chocolate syrup (approx 1/8 cup) instead of chips. I also used mint extract, not peppermint which for some reason gives ice cream a funky taste. And no food coloring, why add something potentially unhealthy when it doesn't add anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandie Lamberth"
},
"reviewBody": "I used one cup of whipping cream and 3 cups of milk, 1/2 cup of sugar and chocolate syrup (approx 1/8 cup) instead of chips. I also used mint extract, not peppermint which for some reason gives ice cream a funky taste. And no food coloring, why add something potentially unhealthy when it doesn't add anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki Quintavalle"
},
"reviewBody": "I cut the sugar in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "colleenb"
},
"reviewBody": "Good and easy recipe, tastes pretty good. Next time I would maybe chop the chocolate chips up a bit so the pieces are smaller. I used minis but they were still kind of big and I'm all about more, but there were too many chips, so I'd probably cut that back a little (I may have used slightly more than a cup, though. The consistency is good, I have really excellent vanilla but my peppermint maybe wasn't the best quality. I also used whole milk as that's all I have. I thought it would be creamier, but the consistency is a little more \"ice milk\" than \"ice cream\". Still, a really good no-cook recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel and Dave"
},
"reviewBody": "Perfect recipe; I could not find spearmint extract at the supermarket, so I used mint extract instead which contained spearmint and peppermint. It was still delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krazykailynkooking"
},
"reviewBody": "So so amazing. Creamy, smooth ice cream. Placed in ice cream maker for about 30 minutes then in freezer for 20. Was too inpatient to wait for it to completely freeze so I had it at a soft sevre consistency. Added a fourth less of mint extract and was absolutely amazing. Would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krburnett"
},
"reviewBody": "I don’t agree with any of the comments around it being too minty. It was perfect! Also not that a few drops of green food coloring looks green before churning but loses a lot of color when it’s done. Just an FYI in case someone really wants it green!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JR"
},
"reviewBody": "I loved it wonderful but I would pour in melted chocolate instead of chocolate chips but wonderful ice cream! It brakes up into little chunks when you mix it after the ice creams already been frozen for a couple minutes and it tasted way better that the mini choc. chips"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erech Myers"
},
"reviewBody": "I wish I would have ready the reviews first because the peppermint extract (McCormick) was definitely too strong. I was hoping for a taste similar to Breyers Mint Chocolate Chip, but I'll have to try a different extract. Hopefully the McCormick Mint extract will do the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy Venz"
},
"reviewBody": "Everyone loved this!!! Better than store bought"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joey LeAnn Carlyle"
},
"reviewBody": "DELICIOUS!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Will Hoffmann"
},
"reviewBody": "I used crushed oreos rather than chocolate chips. Other than that followed the recipe, and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Addy Normann"
},
"reviewBody": "I've made this countless times, and won a dessert competition with it! Awesome ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Demeo"
},
"reviewBody": "I will definitely make this again. It was awesome.\nnow I am going to try doing mint oreo.\nalso, we liked it better with 1 1/2 teaspoons instead of 1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken Casolari"
},
"reviewBody": "The chips gathered at the bottom otherwise it was absolutely fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marina5678"
},
"reviewBody": "I added more peppermint extract which made it perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lali S"
},
"reviewBody": "This recipe is great and when I made the ice cream, it came out perfectly! Instead of peppermint extract, I took real mint from our garden, and put it in the blender with a little bit of water, and it came out better! You could taste the REAL mint. Also, I don't understand why you need green food coloring, just because mint is green, doesn't mean the ice cream should be green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Margarita"
},
"reviewBody": "I made this as a custard, as @naples34102 had suggested and it is amazing!!!!! if I give this recipe a 5 it wouldn't be honest as I actually made it based on a review and not the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Equestrian Baker"
},
"reviewBody": "Delicious, delicious, delicious. So refreshing and pepperminty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobby Lathan Jr"
},
"reviewBody": "Simply perfect. Next time I need to chop up the chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dal Luces Lucy Park"
},
"reviewBody": "It’s great! If you want to sub in peppermint extract for crushed peppermint candy it works as well just crush the candy and wait until it’s dissolved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calanger"
},
"reviewBody": "Really easy and turned out great. My husband thought it could be more minty but I thought perfect as not overpowering. Think I might reduce number of chocolate chips next time as actual ice cream so yummy, but more personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marian"
},
"reviewBody": "Uh, we're talking super soft, light ice cream. That is mint flavored. With chocolate chips. And 2% milk to make it super light. Did I mention it's mint? YUUUUUUUUUUUUUUUM (obviously) :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemary"
},
"reviewBody": "Delicious! I made this as the directions instructed but instead of chocolate chips I used a chocolate bar and shaved peices off so it was smoother in the ice cream. It is very creamy and light. The perfect amount of mint not to overwhelming but still strong. I really recommend making this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Singstock"
},
"reviewBody": "Very easy and everyone LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jhildreth99"
},
"reviewBody": "Family said it was the best mint chocolate chip ice cream ever. High praise from these ice cream connoisseurs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrisceb6"
},
"reviewBody": "I didn't have any peppermint so I used crème de mint, it was really good. Notice I used past tense, next we are trying peppermint. Thank you for a really good mint chip Ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jaime's Mom"
},
"reviewBody": "This ice cream was absolutely delicious! I did make two changes - I used whole milk instead of 2%. It's ice cream it's supposed to be creamy.\nAfter reading the reviews, I changed the peppermint extract to mint extract. I think the peppermint extract would have been too \"minty\"\nI used Ghiradelli mini chocolate chips and they were perfect.\nI gave this 4 stars because of the changes I made and also because it overflowed in my ice cream maker because it made too much. I wish someone had warned me about it.\nIf you love mint chocolate chip ice cream, give this a try. You'll never go back to store bought, except in an ice cream emergency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vincent_Lupo"
},
"reviewBody": "very good but i would use less milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlys"
},
"reviewBody": "I made this recipe in a Cuisinart ice cream maker and it turned out to be absolutely fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidi A."
},
"reviewBody": "I like this recipe, it is generally very good and would use it again with small tweaks. I used only 3/4 tsp of salt, but would reduce it to 1/2 tsp next time. Also, I find it just a touch too sweet, would reduce sugar by a few tbsp. I skipped the food colouring and used shaved dark chocolate instead of chocolate chips and that was a nice change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammie"
},
"reviewBody": "This ice cream was a hit! I had a lot of half and half and whole milk, so I used those instead of whipping cream and 2%. It's not as creamy as I expected (could be because of the substitutions), but it's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spirit"
},
"reviewBody": "Made it as the recipe above stated, but used mint instead of peppermint for the minty taste. Was real good. Did not add the coloring though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betsy"
},
"reviewBody": "I make this almost monthly all year long. Simple and real ingredients unlike almost all store bought versions.\nI have tried doubling the mint extract for more mint flavor but doesn't change it too much. I also use about half the sugar and just love it. Benefit of homemade!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jumping242000"
},
"reviewBody": "I followed the recipe exactly. I debated on peppermint vs. mint extract but trusted the recipe and got peppermint. This is NOT mint ice cream. It is peppermint ice cream. The title is misleading. Regret not going with my initial thought of buying the mint extract. Besides NOT being what it says it is, the consistency and flavor was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geli"
},
"reviewBody": "I made it a few times now. When I didn't have 2% milk I used whole milk. Either way it's really good. I added a little more peppermint flavor and color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gimpdk"
},
"reviewBody": "sooo good! kids loved it. perfect, soft, and creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lulu"
},
"reviewBody": "Delicious! This was such a huge hit with with my picky fiancé and relatives who came to visit. Even my uncle who doesn't like ice cream loved it. The recipe was easy. Just be sure to add the chocolate chips when the recipe calls for. The only problem I had was waiting too long before adding the chocolate chips. It was a bit too frozen before I added them, so it was hard to mix them in thoroughly and there were less chips at the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustAnItalianFam"
},
"reviewBody": "GREAT Mint Ice-cream recipe!\n\nI simmered the mixture with 5 mint tea bags, and also added 1 tsp of peppermint extract. Also instead of sugar we used about 1/2-2/3 cup of honey. This is a DELICIOUS Recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linz03"
},
"reviewBody": "I made this and it was great! The only thing was I did use only half of the peppermint exact, however I still gave it a 5 cause although I thought this was the perfect amount my husband wishes it had more mint flavor, so maybe the original is right on! I used mini semi sweet chocolate chips and chopped them by hand to make them more fine. I have a cusinart ice cream maker, which suggests cooling the mixture for 2 hours before churning, and not adding chocolate chips until 10 before complete. I followed these recommendations along with the recipe and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarv"
},
"reviewBody": "I used a food processor to make the chocolate chips smaller. Will definitely make this over and over again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I followed this recipe exactly, but it never thickened"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Bose Caron"
},
"reviewBody": "Easy and creamy. I did use whole milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassie Rhodes"
},
"reviewBody": "I really loved this recipe. I made this for Father's day and we all agreed the flavor was amazing! I used mint extract as others have stated and shaved a chocolate bar instead of using chips. My only complaint about this recipe is that while the flavor was wonderful we were left with a weird texture after each bite. Almost like a coating of something. Has anyone else had this problem?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ice-cream typhoon"
},
"reviewBody": "We always make ice cream once a year, right before summer. I went onto Food.com, because it is a very reliable website. I just made some of the ice cream and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Rackley"
},
"reviewBody": "This is a very easy recipe! I used mint extract instead of peppermint...it's good. I used whole milk instead of 2%.... It's very good but too rich for me. Next time I'll stick with the recipe. I added Thin Mint cookies at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Smith"
},
"reviewBody": "Loved it! I used shavings from a chocolate bar instead of chocolate chips - but followed the recipe for everything else. Sooooo good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Troger"
},
"reviewBody": "Really great flavor! Based on the comments I changed mine to a six serving batch for my 1.5 qt ice cream maker. I didn't have any 2% milk so I ended up using 2 c heavy whipping cream and 1 c whole milk. I was making this for Mother's Day and we don't like our ice cream too sweet so I only used 1/2 c sugar. Then I melted an entire 6oz bag of semi sweet morsals in the microwave and drizzled them into the ice cream maker at the very end. The chocolate hardened when it hit the ice cream and made tons of perfect little bits of chocolate throughout the ice cream. Perfect perfect perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "damageinc815"
},
"reviewBody": "I followed this recipe as written for the base and it came out great. I made sure the sugar was completely dissolved and rested the mix in the refrigerator for 8 hours. I will say though that the recipe does not state whether the salt is iodized table salt(maybe why some thought it was salty) or kosher. I used kosher and the salt content was fine for me. I would suggest if you are using iodized salt use 1/4 teaspoon. I also used chopped up Andes Mints instead of mini choc chips. I used McCormick peppermint extract and it was the perfect taste in the quantity of the recipe but again you might try putting half the amount , taste and adjust to your liking from there. It came out light and airy at the recommended churning time(using a KitchenAid Ice Cream Maker) . The best part is no cooking and blending eggs. So in my opinion it is an excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Benge"
},
"reviewBody": "I only made changes due to dietary restrictions (had to be dairy free), but I have to say, this recipe was perfect otherwise. I will definitely be using my modified version again, and can not recommend this one highly enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina A."
},
"reviewBody": "I added about twice as much peppermint extract for more flavor, and it is AWESOME. (It's possible that the extracts available in Europe aren't as strong as those in the US.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Not enough peppermint flavour or green colour. Used mint choc chips which helped. Will use more extract and food colouring next time and it'll be perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SRS6693"
},
"reviewBody": "Reduced to 6 servings to fit my 1.5-qt freezer. Not enough mint flavor. Kept taste testing and adding more. Probably added close to 2 teaspoons. Next time might try 3. Definitely too much salt. Used a scant 1/8th teaspoon, and it was plenty. Added chopped up Andes mints in place of chocolate chips. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha Young"
},
"reviewBody": "This was hands down the best ice cream recipe I've ever made! I first picked it because I wanted a fast mix that I could whip up without having to cook and chill it for hours! I threw everything in my blender to really mix and dissolve the sugar well, then poured right into my ice cream compressor. The best part was after storing this ice cream in the freezer it never got hard! It was always soft like store bought and super delicious! I did use whole milk in place of the 2% but that was the only change I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Great ice cream! I think the mini chocolate chips were a little large and should have been chopped up, but my family liked it. I've also made a slightly modified version of this recipe with crushed candy canes and red food coloring. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brody H"
},
"reviewBody": "It was good, I would maybe substitute the heavy cream for something lighter, use the peppermint extract, don't substitute it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COWEN1"
},
"reviewBody": "Substitute Creme de Menthe for all the other flavorings and color and you're good to go. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kirstin Pesola McEachern"
},
"reviewBody": "Every other recipe I have done has had a 2:1 ratio of heavy cream to milk, so I am not sure if the 1:1 here is what threw things off, but after 30 minutes in the ice cream maker, I still had only soup. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "This recipe as it is, is very icy and gritty. If you're looking for ice milk for low fat purposes this might be for you. I made it exactly the way it's printed. It's Not creamy or smooth at all. I give it one star because it is edible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kt808"
},
"reviewBody": "Well the recipe said Mint Chocolate Chip and I have always personally preferred spearmint to peppermint. So I subbed spearmint extract for the peppermint and it was SO good! My guests raved about it being refreshingly different and it all disappeared rather quickly. Depending on the quality of the extract, I recommend starting with 3/4 tsp. and tasting the mix and take it from there. I used a TAD over 1 tsp. but I really love mint!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "graciegirl"
},
"reviewBody": "I took other reviewers advice and chopped the chocolate chips, used only a pinch of salt and 1/2 tsp peppermint extract. Everyone loved it and it couldn't be easier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iblafin"
},
"reviewBody": "Love this stuff!!! I halved the recipe. I made my own half and half with heavy cream and 1% milk. I used 7 drops of peppermint essential oil. Just keep tasting until you like the mint flavor. And I used shaved chocolate. Next time I will use crushed up Oreos. That will be amazing. I adore this stuff. Stayed soft in freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A & A's Kitchen"
},
"reviewBody": "We used chocolate mint Oreos instead of chocolate chips. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denita Bannister"
},
"reviewBody": "Perfect..however, I wanted to lighten it up a tad, used Almond Milk instead of 2% Milk, creamy, yet frozen to perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "I made the serving size to 1 and made it in my Zoku shake maker and it turnned out amazing. Also, i shaved chocolate off of a chocolate bar for the \"chips\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "da1962"
},
"reviewBody": "Wow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike T."
},
"reviewBody": "This recipe was amazing! Better than anything you can buy in the store. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zeta724"
},
"reviewBody": "Great basic ice cream recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ji"
},
"reviewBody": "Ummm... Yum! Not your traditional style custard ice cream, which we are used to as far as homemade ice cream, but when you make this, it tastes more like \"store bought\", which everyone loved of course. Will definitely make again. FYI - I think it only needs closer to 1/8 of a cup of chocolate chips for this amount of ice cream. Can't wait to eat more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicay"
},
"reviewBody": "Holy wow. This came out phenomenally. I will never bother with the long version again or the egg version. This was easier, is healthier, and the result is very impressive! I made two changes: (1) I used mint extract instead of peppermint, (2) I chopped the mini chocolate chips and then added half a bag of chopped mint oreos. SO GOOD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Really liked the recipe. It had a very nice mint color and a good texture. The only thing I did differently was that I didn't use chocolate chips. Instead, I used a knife to shave off small pieces of chocolate from a chocolate bar; it gave the ice cream a much nicer consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindi Zimmerman"
},
"reviewBody": "Holy ice cream Batman! This is exactly why we bought an ice cream maker! I did change 2 ingredients based on what I had on hand. I used coconut milk instead of 2% milk and 4 drops peppermint oil instead of peppermint extract. And of course I omitted the food coloring because who wants that junk in their food anyway! It is a fantastic recipe that I hope you try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bonchef"
},
"reviewBody": "Great recipe. Used regular milk and was still good. Also threw in Andes mints."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "belissa00"
},
"reviewBody": "Omg this is the first time I've ever made homemade ice cream and this was super easy and so so creamy. The mint is just right. You have to make sure you but peppermint extract not just \"mint\" that way it's not overpowering. I had some left over girl scout thin mint cookies so I did a half of cup of those and half a cup of chocolate chips all cut up. Besides that I made the recipe as stated and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tim Scarbrough"
},
"reviewBody": "I modified it a little bit. I put in a packet of instant vanilla pudding, used peppermint schnapps instead of peppermint extract, and I've had a habit lately of adding cornstarch to make the ice cream easier to scoop after you refreeze it. And my son says it's not green enough. They like it so it's a success for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohman11"
},
"reviewBody": "I just made this...I have a cheap ice cream maker so I use it to mix it then I transfer it to another container and let it freeze for a few hours. I did taste it before I put it in the freezer. All I can say is amazing. I did use \"Mint\" extract and not peppermint. I did buy some peppermint extract so I could compare the two."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/51869/easy-mint-chocolate-chip-ice-cream/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1556/desserts/frozen-desserts/ice-cream/",
"name": "Ice Cream"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16189/desserts/frozen-desserts/ice-cream/chocolate-ice-cream/",
"name": "Chocolate Ice Cream Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/51869/easy-mint-chocolate-chip-ice-cream/",
"name": "Easy Mint Chocolate Chip Ice Cream"
}
}
]
}
}
, "about": [
]
}
]