				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Curry Sauce"
,"datePublished": "2019-04-03T23:28:40.000-04:00"
,"dateModified": "2022-10-27T06:48:46.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lom"
,"url": "https://www.allrecipes.com/cook/126747"
}
]
,"description": "This curry sauce is fragrant and rich, made with coriander, cumin, turmeric, garlic, and ginger, mixed with puréed tomatoes, chile pepper, and yogurt."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/nKzl7EizgexU6dHNXOSbBNhLHXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7942955-80702cdea27d489a85cfb0aa82142d7f.jpg",
"height": 2000,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6319930838112",
"description": "",
"duration": "PT1M5S",
"name": "How to Make Basic Curry Sauce",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/dac9e9e9-9849-49da-b5fa-af32076cdddd/85f50838-693e-4582-8627-832b264f4a37/1280x720/match/image.jpg",
"uploadDate": "2023-02-08T18:46:39.149-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Curry Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "54"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "75 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "35 mg"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons peanut oil",
"1 tablespoon margarine",
"1 large onion, chopped",
"2 tablespoons minced garlic",
"1 tablespoon minced fresh ginger root",
"2 tablespoons ground coriander",
"2 tablespoons ground cumin",
"1 teaspoon ground cinnamon",
"1 teaspoon ground black pepper",
"1 teaspoon cayenne pepper",
"0.25 teaspoon ground turmeric",
"2 tomatoes",
"2 serrano chile peppers, seeded",
"0.5 cup fresh cilantro",
"0.5 cup yogurt, whisked until smooth",
"3 cups water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil and margarine in a small skillet or wok over medium-high heat. Add onion and sauté until very brown, 10 to 15 minutes; do not undercook or sauce will taste funny."
} ,{
"@type": "HowToStep"
,"text": "Add garlic and ginger to onions; sauté for an additional 2 minutes. Transfer mixture to a food processor and blend until smooth. Do not rinse the food processor."
} ,{
"@type": "HowToStep"
,"text": "Place blended onion mixture in a large saucepan. Stir in coriander, cumin, cinnamon, black pepper, cayenne pepper, and turmeric; cook over low heat until mixture is thick and has a paste-like consistency."
} ,{
"@type": "HowToStep"
,"text": "Purée tomatoes, chile peppers, and cilantro in the food processor until smooth. Add to onion mixture and stir over low heat, cooking off moisture from tomatoes and peppers. Add yogurt a little bit at a time, stirring constantly to avoid curdling."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/nKzl7EizgexU6dHNXOSbBNhLHXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7942955-80702cdea27d489a85cfb0aa82142d7f.jpg"
}
]
,"text": "Blend mixture in the food processor until smooth. Return to saucepan, add water, and increase heat to high; bring sauce to a rolling boil. Cover saucepan and boil for 3 to 5 minutes. Reduce heat and simmer until desired consistency is reached."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wayne10850"
},
"reviewBody": "I love this recipe. However, I do a few things differently. I use a homemade tomato stew instead of the fresh tomatoes that already have garlic, green pepper and other secret seasonings. Instead of cayenne pepper I use Aji Jalapeño Molido (it is extremely hot and spicy). For me, very fresh cilantro makes a big difference-we grow our own. Lastly, the browning of the onions is a really big deal and you need to be careful to understand the heat from your particular burner. I would err on the lower heat and watch the time carefully. I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hagemannjenny"
},
"reviewBody": "I love this recipe and have had no issue with the cooking time. I whip this up on meal prep days to keep in the fridge for easy rice bowls and it tastes so elevated and fresh straight from the fridge. Anyone who’s looking for curry powder on a curry recipe needs to do some reading first before leaving a review IMO. This is a short list of ingredients for the flavor this recipe delivers. Yummmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Theresa Bajo"
},
"reviewBody": "Not sure how it got four stars with 3 cups water!\nWay too watery. I simmered off the moisture for about two hours and added 1 can coconut milk. \nWould not recommend. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rustybones"
},
"reviewBody": "Used avocado oil instead... \nCrushed red pepper (instead of chilli peppers)\n12oz tomato sauce instead of tomates and water\n\nI would make it again. Just enough heat. Yoghurt helps moderate the heat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Nicol"
},
"reviewBody": "I made this and multiplied by 4. too much for a blender.\nbrown the onions in a large pot. sliced the garlic and ginger instead of dicing to save time added spices Roughcut tomatoes and then added water, boil to soften tomatoes, then blend with a hand blender, pass though a sieve into a crock pot, add cilantro and then use hand blender again. put crock pot on high for 6 hurst's to allow spices to dissolve then add sour cream. ( some type of stock works to add a little more flavor, I used chicken stock....... not too much. use food saver to portion and freeze, re- heat w a little cream and pour over your favorite protein"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cwong"
},
"reviewBody": "Great recipe for Indian curry. It is very spicy. Need to add more yogurt cool down the spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Sargent"
},
"reviewBody": "Excellent easy &amp; delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess N"
},
"reviewBody": "Made some changes, but an awesome base for \nany curry sauce ??:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mike Wallach"
},
"reviewBody": "Fantastic sauce but I made two changes: It lacks character a bit so I use stock instead of water and although we like spicy two serranos is a lot. I use half of one.\nI've used it with tofu, with turkey meatballs, and with sliced chicken breasts. Works great with all of them. \nMake extra and freeze it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barb"
},
"reviewBody": "Left out the chillis as I love the flavour but I don't like too much heat, but will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "This is tasty and straightforward to prepare. I added salt and a bit of sour cream with the yoghurt. Toward the end I added large chunks of Tilapia for a fish curry. As described in the recipe it's pretty bland without much oil, zin, or any salt at all. But, it's a 'basic' sauce that can be built out, and it did the trick in that respect. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Clutterbuck"
},
"reviewBody": "Good basic curry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EmmaleeCharlotte"
},
"reviewBody": "Too intense w the spices, not a smooth flavor. Was edible, but will not make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Grandpa in the kitchen"
},
"reviewBody": "It is a basic sauce good for meats , etc but not usually served separately , from past experience eating various curry recipes over the past 50 years, I would not add any yogurt or sour cream to the sauce, but replace it with apple sauce ,coconut milk and curry powder and add salt to taste to bring out the flavor, and it is best served the next day as flavor develops overnight in the refrigerator, also make sure you use FRESH curry powder or spices"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Lockwood"
},
"reviewBody": "This a good way to make curry. I added a bit of salt for finishing the taste, but the spice was perfect. I did not puree the final step it called for. I doubled the recipe and simmered the 6 cups of water down and by that time the sauce was very smooth. I served over chick peas and rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellonwheels"
},
"reviewBody": "I've used this recipe many times, for various combinations of veg or chicken and veg and we've come to love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mayarose"
},
"reviewBody": "i love this recepie it is a kipper, turn out delicies with rice.\ni use almond milk instead of yugort.\nand put loots of curry, my husbend LOVE IT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teachermama"
},
"reviewBody": "This recipe is way more complicated than it has to be. Here's how I did it, same ingredients: I sauteed the onion until very brown, then added the ginger, garlic, and minced serrano for about two minutes. Then I added the tomatoes (diced), and cooked for about another two minutes. I stirred in all of the spices and cooked for another minute. I stirred in about 2 1/2 c water, used an immersion blender to blend it smooth, then whisked in the yogurt. Flavors were awesome! Very spicy (and we love spice)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "leslierey411"
},
"reviewBody": "I only used one pepper as it was a very spicy one, and as the recipe was (with chicken added) was too much spice and not enough enjoyment of thai flavors. I wasnt happy with it so I ended up adding 1/2 can coconut milk, bamboo shoots, chopped bell peppers, chicken and about a teaspoon of salt and served over a bed of jasmine rice with fresh chopped cilantro on top. I saw one comment that said this recipe was missing \"curry\" but I dont think they realized that what you are making is, in fact, curry! lol. I would just say be CAREFUL with peppers because it ended up being so spicy, other than that, a pretty good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnny Parsons"
},
"reviewBody": "I just finished making this blend. It tastes delicious. I wanted a curry for my pork,rice, and broccoli. This will work. I might add that I used Badia's curry powder in stead of making the spice mix from scratch. I compared the ingredients with the spice list. It was almost identical. It seems that many folks think curry is a spice and not a blend of spices. If you want to make adjustments to the spices you can do it from scratch but I am a lazy cook so I use the curry powder. If you like curry you'll love this blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CooksAreSexy"
},
"reviewBody": "This recipe was great. Took much longer than anticipated... but was really fun to make. it was an interesting project. We also made a special rice to complement this recipe, a almond, raisin and basmati mix. It turned out really, really great! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Avon- status quo PRO"
},
"reviewBody": "Four stars overall.....5 for taste, 3 for preparation steps and amount of water. I streamlined the prep by cooking the onions, peppers and tomatoes along with the garlic and ginger first. Blended it, added back to the pan, simmered and added the rest of the spices and 1 1/2 cups of chicken broth. Also, I did add 1/4 tsp of baking soda to this to keep the tomatoes from curdling the yogurt. Add the yogurt last, stir til smooth and poured it over some chicken. Baked it in the oven and served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKELHOSS"
},
"reviewBody": "This was excellent! Tasted just like my Indian friend's home cooking. A little too hot for me, and I like spicy food. Next time I will reduce the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilia Dianne Portales Mueller"
},
"reviewBody": "Exceptional flavor! We love Indian food and this curry will be a staple. I don't agree with the remarks that it is labor intensive: saute, 3 trips to the food processor (no cleaning in between) and boil. Voila! a very good, basic curry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tay"
},
"reviewBody": "This was very, very tasty. I was very impressed with the depth of flavour of this recipe. I have to admit to making a small alteration--I left out the cayenne and the Serrano peppers. I would have loved this with the peppers, but I was making this for a group of nineteen 5-7 year olds, so I didn't want it to be spicy. I used this sauce on chicken and zucchini. All but two of the children, only one of whom had ever had curry before, came back for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lyrelle"
},
"reviewBody": "Loved it! I must say the blending process was very crucial. You need a good blender for this, otherwise you won't get a creamy smooth paste, so don't try to cheapen out on it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FutureMrsThomann"
},
"reviewBody": "I've made this recipe twice, the first following the instructions exactly and the second completely skipping the food processor. It was fabulous either way. To answer the previous reviewer, these are the spices traditionally used in curry powder, so in a sense you are making your own in this recipe - Which, considering that, if you have curry powder on hand a lot of these spices could be omitted completely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WSBLEND"
},
"reviewBody": "not my favorite...I like my curry sweeter and more creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mandy Blizzard"
},
"reviewBody": "I did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Spicy Mama"
},
"reviewBody": "We used this sauce to go over boneless chicken breast pieces and green peas -- no complaints at all from my household. I wish I had used fresh spices (versus the ones sitting in my pantry for who knows how long) to boost the flavor, and I also noticed a lack of salt (it balances the heat and brings out the flavors), which we corrected at the table. In terms of ease, coming from someone who knows the labor intensity of preparing an authentic curry, this recipe was a relative breeze. Yet, overall, for me this curry was missing the \"wow\" factor that I'm used to achieving with Indian cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2operate"
},
"reviewBody": "I make this recipe to serve as a dipping sauce for beef samosas. It is worth making for the fragrance alone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emily C."
},
"reviewBody": "This tasted like watery cumin broth :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PerkyStone"
},
"reviewBody": "This was ok but not spectacular. I prefer a more specific and authentic curry. i probably wouldnt make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Food Junkie"
},
"reviewBody": "Very time consuming, but the end result was great! We used pork with the curry sauce and served with basmati rice and naan. Great meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TGFROST"
},
"reviewBody": "This was very good. It was really my first experience with curry, so I didn't have anything to comapare it too. I really liked the cilantro flavor. I added more yogurt to make it a little creamier. I also used a premixed curry seasoning instead of the individual ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUNRENAY"
},
"reviewBody": "Very good recipe. Having read the reviews, I also opted to add some sugar to mine because I prefer a sweeter curry. This recipe is taking me a lot longer than the time suggested; however, I can tell that it is worth every minute. Call me a wimp but, unless the peppers lose more heat as the sauce thickens, I will never leave the seeds in. LOL. Can not wait to share this recipe with my friends. Additionally, I did not know that curry was a combination of spices. I never read the label. Thanks for sharing this recipe Amy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NEANDERLOID"
},
"reviewBody": "I love the texture. I thought that the sauce was a little bit too tangy (I used nonfat yougurt) so I added a few tablespoons of white sugar to tone it down. Also, If you don't reduce the sauce down too much, you can add some meat, potoatos, broccolli, carrots and some noodles and make a really nice curry-flavored stew. I's just a twist on the same old curry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "nice and spicy, a little long to make, but in the end is the reward. also if you have a blender and not a food processor, then that works just as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought this was a great recipe. It wasn't easy, but as long as you have your food processor handy it's really not bad. I added pork and it was great, but it could go with anything. I was impressed by the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe, but the name is misleading. The ingredient list is anything but \"basic\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "A good simple recipe for me to get creative with. I used to on tofu and it worked out nicely. I have to respond to the other reviews: curry is NOT a seasoning, its a combination of seasonings. Indian dishes are extremely time-consuming and difficult; this is the easiest one I have encountered. And lastly, to compare it to restaurant Indian food is absurd. No one makes burgers like McDonald’s at home. You shouldn't tell an Italian that their spaghetti taste nothing like chef Boyardee, should you? Home made food is always different, if you want cheap restaurant food, go for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lom"
},
"reviewBody": "Tasty sauce. Definitely an undertaking, both in terms of time and mess, but worth it. I finished in about 90 minutes, but the majority of that was simmering time, including 30 minutes at the end. I used canned tomatoes and prepared ginger and garlic to save chopping time. The tip about cooking the onions for a LONG time is right on target; the first time I made this recipe I didn't brown them enough, and the sauce tasted like raw onions. The second time I browned the onions VERY well and was rewarded with a very mellow flavor. \r\n\r\nAs for additional seasoning, while there IS a curry plant with leaves that are used in Asian cooking, \"curry powder\" is simply a mixture of many of the spices already used in this recipe (cumin, coriander, turmeric, etc.) I didn't add any salt to the sauce, but I served the meal with the salt shaker so everyone could salt to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was extremely time-consuming. The recipe states that it will only take 45 minutes to prepare, yet it took us almost 3 hours!(I don't think there is anyone on this planet capable of making this in 45 minutes). After all our hard work, we were really looking forward to our meal. Unfortunately, it was just \"OK\". We had to add quite a bit of salt. Next time we want curry, we'll order from our favorite Indian restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacie"
},
"reviewBody": "Shouldn't a curry recipe contain curry? It's not on the list of ingredients; maybe this is what others sense is 'missing'. I have toyed around with this recipe several times &amp; I have always added about 1T of curry powder (as well as salt) with a very good result, it's even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nacmacfeagle"
},
"reviewBody": "I've been looking for a good curry sauce. This one was okay, but it was labour intensive and it seemed to be missing something. Not quite the authentic Indian taste I was hoping for. We enjoyed the meal, though, and I will probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CRYSTALKO"
},
"reviewBody": "Wonderful! Labor intensive, but the best warming curry I've tasted. Made this for a dinner party and it was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hot and spicy. At the end of following the recipe closely, i felt it needed a bit of salt, or conversely, used as a sauce with something salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JGERA"
},
"reviewBody": "This sauce is excellent! It is the same recipe my boyfriend, who is Pakistani, uses. I'd recommend adding a teaspoon of salt. I left in the seeds from the chiles, and it is really spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "One of the better homemade curry sauces that I have tasted. The cinnamon adds a very nice touch, and leaving the seeds in the serranos will give this sauce a nice punch. I really enjoyed it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25881/basic-curry-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
"name": "Sauces and Condiments"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25881/basic-curry-sauce/",
"name": "Easy Curry Sauce"
}
}
]
}
}
, "about": [
]
}
]