				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Decadent Truffles"
,"datePublished": "2018-03-21T12:25:57.000-04:00"
,"dateModified": "2023-01-06T12:42:50.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jenny Saunders"
,"url": "https://www.allrecipes.com/cook/jmackinnell"
}
]
,"description": "Follow this easy five-ingredient truffle recipe to make decadent chocolate truffles that are ready to serve to guests in about an hour and a half."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NdlUuTgcAH7qBm8h0bTac2z5Crg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/30737-96ba6b4015ba424fb0aa6271417b620e.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1826311062001",
"description": "Shockingly easy to make, these truffles are rich and deliciously decadent.",
"duration": "PT3M4S",
"name": "Easy Decadent Truffles",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/8bb11b83-3e4d-4a46-99eb-a71e27296ec3/1e153d25-4116-43aa-b071-4cb7276fd262/1280x720/match/image.jpg",
"uploadDate": "2021-07-14T13:07:46.796-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Decadent Truffles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "1050"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "78 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "12 mg"
,"sugarContent": "11 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"3 cups semisweet chocolate chips",
"1 (8 ounce) package cream cheese, softened",
"3 cups confectioners' sugar, sifted",
"1.5 teaspoons vanilla",
"0.25 cup multicolored candy sprinkles, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place chocolate chips in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Beat cream cheese in a large bowl until smooth. Gradually beat in confectioners&#39; sugar until well blended. Stir in melted chocolate and vanilla until no streaks remain. Refrigerate for about 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NdlUuTgcAH7qBm8h0bTac2z5Crg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/30737-96ba6b4015ba424fb0aa6271417b620e.jpg"
}
]
,"text": "Shape chilled mixture into 1-inch balls and roll in candy sprinkles."
} ]
,"recipeYield": ["60"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marsha"
},
"reviewBody": "Nice but MUCH TO SWEET, will use less sugar the next time!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Grotts"
},
"reviewBody": "the only thing i changed was the time in the fridge..I kept adjusting the time out on the table due to our southern climate..But this is an awesome, yummy recipe that was a huge hit with family and friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Easy and Delish. Turned out so pretty!! Was a nice addition to my holiday baked gifts...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Illona Santillan"
},
"reviewBody": "YUM! My fav was dark choc with lemon extract, rolled in lemon curd and then powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "I really thought truffles HAD to be dipped to be good. Not as written. Just rolled them in unsweetened cocoa, and unsweetened cocoa with fine ground coffee. Now, if you add liquid flavoring (rum, Grand Manier, Kahlua, etc), the truffle doesn't get as firm, and just soaks up powder coating. I used 2 tbls per 1/3 recipe and can barely taste (omit vanilla if other flavoring). On those, I did melt bittersweet chocolate with a dab of shortening, and dipped. The \"shell\" protects the soft middle. Word of advice, unless you like coma sweet, cut the sugar in half. I cut it down a third, and it's still a bit sweet. Will probably use 1/3 bittersweet chocolate next time. People talk about the time, but it's just easy. Having to wait an hour or so for them to harden enough to roll was the most time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Abel"
},
"reviewBody": "My first bite was amazing. I couldn't believe I made this wonderful chocolate recipe. It tasted like something I would have bought in a expensive chocolate shop. Very easy to make. It will become a must for all special holidays and for my days of craving chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audra Kerkow"
},
"reviewBody": "Super easy. My family thought they were store bought!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Teodora Sasaran"
},
"reviewBody": "Very very very sweet I lowered the sugar to 1 cup and it was still really sweet. If you eat them straight out of the fridge they wont be that bad but if you eat them from room temperature be careful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vic16"
},
"reviewBody": "These are AMAZING! I love them so much! I added a tablespoon of Almond Extract and it was so good! Definite love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "Very simple and delicious! I rolled some in crushed candy canes, Nuts, Sprinkles, etc. My son had a blast rolling them in all the different toppings! Saving this recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lov4life5"
},
"reviewBody": "Time consuming but easy and delicious! Looking fir are to experimenting with different flavors. Did espresso truffle dusted with cocoa, also espresso rolled in roasted almonds with sea salt! ! Definitely make sure truffle is well chilled before rolling. Work /roll quickly and you’ll be fine!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakin Gurl"
},
"reviewBody": "I loved this recipe and the chocolate just melted in my mouth. I rolled them in cocoa powder, icing sugar, and coconut flakes. I followed other people’s instructions and cut the recipe in half. Definitely making these for Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Chapman"
},
"reviewBody": "I coated them in chocolate. They are almost too sweet to eat.\nI'll make them again, minus the chocolate coating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Rich"
},
"reviewBody": "I have made this several times and always find it so easy and delicious. I add peppermint oil to get a mint truffle and I prefer dipping them in a good quality milk chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Nowell"
},
"reviewBody": "I do agree that they are very sweet, but it balances out nicely if you just coat them in a decent layer of cocoa powder :) delicious recipe!!! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwendolyn Stewart"
},
"reviewBody": "These were really tasty and and impressive for guests! I made one batch with Kahlua and preferred that taste over the ones without. I had one caution however: this recipe has uncooked cream cheese it, and so I stored my truffles in the refrigerator and only removed them for a bit before serving to soften. I would NOT store these at room temperature. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samee (sameechaos1)"
},
"reviewBody": "A wonderful and simple recipe. Everyone loved them. I used Bailey's, vanilla, and Cupcake's red velvet wine for my three flavors. Definitely recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelle"
},
"reviewBody": "I would make these again. Easy enough for my first truffles. I included some of the recommended modifications in other reviews. I only used 2 cups of sugar and dipped in candy coating to have the two textures. The mixture was very hard to work with after refrigerating, but I muscled through. They were a huge hit. I dipped them in a variety of toppings put them in mini cupcake liners and gave them away in boxes for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Raimondi"
},
"reviewBody": "Read a review about dipping them in almond bark chocolate, I'll have to try that! I did a trial batch, cutting the recipe in a quarter, and cut the sugar to 1/3 of a cup, and oh yes this is a winner!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle White"
},
"reviewBody": "Worked Great!! Very pleased, made the balls on the smaller side so the wouldn't be as rich. all at once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nancy Melsheimer Rudolph"
},
"reviewBody": "Worst AllRecipes recipe I've ever made. The consistency was awful! Don't even think about using a melon baller or ice cream scoop! Even after refrigerating, the batter was dry and didn't hold together without really REALLY rolling the balls around in my palms. None of the toppings (finely ground walnuts, turbinado sugar/kosher salt, cocoa) would stick easily. Toppings had to forcefully be pressed into the balls. When I dipped a few into melted white candy coating, the balls just crumbled. VERY FRUSTRATING recipe. The last straw was when my husband ate one and made no comment. His look of confused disgust said it all. I'm considering just dumping these in the trash. Waste of time and money!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Jackson"
},
"reviewBody": "I made 5 batches pod these for Christmas gifts and they were amazing, didn't try the recipe as it's written- I took the advice of other reviewers and used 8 oz cream cheese 2 cups confections sugar and 2 tblsp heavy cream. I also didn't measure my chocolate- I just used a whole bag. \nI used orange extract on on everything batch and stuffed them with marmalade. The second batch I stuffed with raspberry jam, the 3rd I stuffed a Hershey's candy cane Kiss I need the middle and the rest were chocolate. \nI let my cheat cheeseburger come to room temp and mixed everything in my food processor, then freezing. Once rolled and stuffed, I froze them again while melting chocolate for the coating. \nThey were all excellent but the orange and Hershey's candy cane ones were everyone's favorite'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Conley"
},
"reviewBody": "I followed the recipe exactly. However, I still had to remake this recipe for 3 reasons. First when the chocolate was fully melted in my double boiler I added the vanilla, WRONG!! The chocolate seized immediately, I had to add 1/4 stick of melted butter to get it unseized. Second, my hand mixer broke halfway thru mixing the chocolate in so I finished by hand. My arm paid the price! Third I refrigerated it overnight, making it impossible to mold into anything but chocolate shavings. \n\nSo, first of all have a stand mixer. I finally broke down and got a kitchen aid. Make sure to sift your powdered sugar. Next, DO NOT ADD YOUR VANILLA TO YOUR MELTED CHOCOLATE, add it to your cream cheese/sugar mixture before you add the chocolate. Last of all, do not refrigerate more than 1 hour.\n\nI decided to put each ball in a mini cupcake holder and instead of completely coating with dark or semi sweet or milk chocolate then decorating, I simply spooned some over the top of the truffle and decorated in the cups.\n\nThey turned out perfectly melt away truffles!\n\nHappy candy making!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dee Dee"
},
"reviewBody": "Very thick- hard to stir the chocolate in. Better add flavoring to the cream cheese and powdered sugar mix or it won’t blend well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Brown"
},
"reviewBody": "I used white chips.Then melted more to dip them in. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stellalaluna"
},
"reviewBody": "So easy and delicious!! Thanks for the recipe. They were the hit for our Christmas cookie tins!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Txgrandma"
},
"reviewBody": "This is a revision to my first review. First ones I made were by the recipe exactly, no changes, my husband gave them a 5 but to me they were a little on the bitter side even with rolling them in coconut and sprinkles. I decided to make more with milk chocolate chips. I was going to do exactly half milk chocolate chips and half semi sweet but I was a little short, I had enough to use 1-1/3 cup semi sweet and 1-2/3 cup milk chocolate. I dipped some in chocolate candiquick and some in vanilla almond bark, these are really good and have a better melt in your mouth quality, they are sweeter but not too sweet. My husband tried one and wanted more and said he likes the second ones much better than the first. I am very glad I found this recipe it is a good base for me to start with for experimenting and personalizing for my families taste. I have made fudge and other candies for years but had never tried Truffles and really had no idea where to begin. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melon"
},
"reviewBody": "I Love these. EVERYONE Loves these!! I make them for Christmas &amp; there’s always someone who asks for them again. Making them can be a bit daunting only because there’s so many of them to shape up but it’s definitely worth it.. they are absolutely delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happygirl"
},
"reviewBody": "Very nice! Made it as written. No problems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Hairston"
},
"reviewBody": "No changes, will definitely make again, trying with different flavorings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae Sterrett"
},
"reviewBody": "I made the change of splitting the main part of the recipe in half before adding in the vanilla. I put only one teaspoon of vanilla in one half, and one teaspoon of orange extract in the other half before I refrigerated both halves. The truffles did indeed come out tasting decadent still, and even after coating both in dark chocolate shells, they still had the flavor of the extracts. I'll definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nise099"
},
"reviewBody": "Made these and tried the different varieties, bery very rich but definitely worth it! I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpiston1"
},
"reviewBody": "FANTASTIC!! I dipped these in Bakers dipping chocolate, decorated with nuts, icing, powdered sugar, cocoa powder, and icing writing, and they made a nice gift. I also made them at Christmas and included in my cookie tins to family members. My husband and teenage daughter can’t get enough of them! They are so easy, nice for a display, and really, really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it exactly as written. But after mixing it, I divided the mixture between two bowls. I left one bowl as is and the second bowl I added 1/4 cup of instant coffee granules. Both were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShaDonna Shaffer"
},
"reviewBody": "easy and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meg"
},
"reviewBody": "A batch made me 40 nice size truffles, I used a cookie dough scoop to make an even size. I also cut the sugar down to 1 1/2 C and used half milk chocolate and half semi sweet. I added 2 tbsp cream to help even out the mixture. Make sure mixture is well chilled before rolling and freeze truffles before you dip them in anything. Easier than I thought it would be! I made 2 batches for Mother's Day gifts and every one gave fantastic reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney Gitlitz"
},
"reviewBody": "so good!! melts in your mouth!! i rolled it in coconut for a delicious result! highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trutz"
},
"reviewBody": "I used 8 oz cream cheese, 2 cups powdered sugar, 3 cups of baking chips, and 1 1/2 tsp flavoring. We liked them! I dipped them in Candi-quik dipping chocolate after freezing them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ312B"
},
"reviewBody": "VERY GOOD AND VERY EASY TO MAKE \nA CANDY LOVERS DREAM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "The truffles are amazing and I think they will be a hit at my Christmas Eve party. I recommend sea salt as a topping. The sea salt balances the sweetness of the chocolate. Another good idea is to tuck a couple of pieces of sea salt in the centre of the truffle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuneauBrat"
},
"reviewBody": "SOOOoooo easy to make and SOOOOoooo wonderfully delicious. Better than fudge...easier too...;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ramsey_luver"
},
"reviewBody": "made as directed, taste is pretty impressive for what it is. DEFINITELY a day waster as another review said. highly recommend using mellon baller or teaspoon since it gets sticky fast and gets difficult to shape. refrigerate &amp; work with small batches at a time. these do need a top hard coat to help give a true truffle experience of textures &amp; flavor. next time i will plan flavors ahead and add to MELTED chocolate chips before mixing with the sugar &amp; cheese-trying to add flavor after mixed is nearly impossible. TIP - i added about 1/3 part Nutella to 2/3 truffle which hugely improved ability to hand shape and added wonderful flavor, but needs to be somewhat room temp to then roll in coarse coating like nuts etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Gray"
},
"reviewBody": "Beautiful, easy, and makes a great gift!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linnie"
},
"reviewBody": "My family loved these!!!! They were quite sweet though. I stuck with the recipe for the most part. I separated the batter and added some peppermint to some and rolled each one in crushed candy canes. These tasted good, but didn’t hold up so well because the crushed candy cane got gooey. I also added rum flavor to some and rolled in coconut. Yum!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "These truffles are absolutely a must try recipe! Alone without any decoration they taste DELICIOUS! In my case I decided to dip them in Chocolate Ganache recipe from this site. There are no words to describe how delicious they are with ganache. Will definitely make them again and for sure it will become a staple of your repertoire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mumto5"
},
"reviewBody": "After I divided and flavored, stored in fridge till I could decorate, etc. Flavor was terrific. Easy to work with, dipped some, so would recommend shaping, then put back into refrigerator, to stiffen BEFORE dipping into warm chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Gessner Dixon"
},
"reviewBody": "I used 1 1/2 cup of dark chocolate and 1 1/2 milk chocolate and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "These were amazing and so easy! I used an electric blender to help make everything combined. I also put in lemon juice instead of vanilla and topped it with lemon zest. Note- make the truffles a lot smaller than you think they should be, because they are VERY rich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya"
},
"reviewBody": "Yo made these and my family loved them and so did the neighbors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisabfoil"
},
"reviewBody": "Extremely easy and the family LOVES them! Very rich so unless you are making them for gifts or a crowd, I would cut the recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "Made some with almond butter added. Also added a little orange zest as coating for some.\nWill make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "UMMADAM"
},
"reviewBody": "I made these exactly as stated. They were too sweet and tasted a lot like soft chocolate chips. Despite being so easy, which regular truffles are anyway, I was hugely disappointed. A ganache-like truffle is easy and delicious. I'll stick to the tried-and-true next time. A brigadeiro is excellent, too, for a more fudgy ball."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "wonderful~~ easy to make candy and looks beautiful too everyone loves them so many ways to decorate I sometimes use white chocolate chips then sprinkle chocolate sprinkles over... fun to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veronicavz"
},
"reviewBody": "Made these twice. Hubby has named them \"dope balls\", because he says they are as addicting as dope. (No, he does not do dope .....lol). \n\nThey are easy to make, keep fresh for a long time and taste delicious. A big, big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This really was a simple recipe and it was a big hit at the Christmas party! Personally I dislike the way truffles are normally so overly sweet so I altered the recipe slightly and the end result was simply divine! I used 1 3/4 cup confectioners sugar and 1/2 cup granulated sugar and 1/2 cup brown sugar. Then, I rolled them into 4 different toppings. I used a 1 to 1 ratio of baking cocoa and confectioners sugar, red sugar sprinkles, green sugar sprinkles, and for the seasonal hit I went with a combo of red, green, and white sprinkles. Everyone who ate one raved that they were the perfect amount of sweet and came back for seconds and even thirds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelJ"
},
"reviewBody": "I followed the suggestions by the others to reduce the amount of confectioners sugar and chocolate chips to 2 cups each. The only issue I had was coating them with items other than powder - nothing else really seemed to want to stick. I also found I had to let the batch sit a bit before being able to roll into balls as it was too hard. But other than that very happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yeti & Trinket's Mom"
},
"reviewBody": "AMAZING recipe! The only change I made was to add both vanilla &amp; almond extracts. What a great flavor! I used dark chocolate for the coating, rolled them in ground peanuts and yum! The next batch is going to be with semi-sweet chocolate, and the batch after that will be with white chocolate coating rolled in coconut. I am excited to try those out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie Bee"
},
"reviewBody": "I make these every year for co workers. I change flavors to go with the occasion and they love them. Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Vic"
},
"reviewBody": "The only good thing about this recipe was that it was easy. I bought high quality ingredients, followed the recipe exactly and ended up with overly sweet, crumbly balls that looked unappetizing and were way too sweet to eat. I threw them all away and ended up buying truffles at Whole Foods. Waste of time and money. If you make this recipe, read all the reviews and DEFINITELY do not use all the sugar that they call for. I would recommend finding another recipe, even if it is a bit more work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Luv2cook"
},
"reviewBody": "I rarely write a negative review, but these are inedible as written. I love truffles and rich decadent desserts. These things, however, are so sugary that it's like biting into a ball of powdered sugar. Even my kids wouldn't eat more than one, and that's saying a lot. The texture isn't like a truffle at all either. I ended up just throwing them away. I kept looking for a good recipe, and found one by Ina Garten that is a ganache - primarily chocolate and heavy cream with some added flavors. SO MUCH BETTER, and more of a melt in your mouth truffle like Lindt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandie Thomas"
},
"reviewBody": "Really easy and yummy! Changed by reducing the sugar to 2 cups, adding 1/2 cup whipping cream, eliminating the vanilla, and then dividing it in 3 parts for flavorings. I used 2 Tbsp of each liqueur in each: \n- Gran Marnier (rolled in Mochaccino mix)\n- Raspberry Rum (rolled in desicated coconut)\n- Chocolate Almond (rolled in crushed almonds)\nWill definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Puls Holmes"
},
"reviewBody": "Super easy and versatile-and sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GoodCookin'"
},
"reviewBody": "I made just a half recipe, and added cashew butter. I crushed up some crackers, added a dab of cinnamon and cayenne pepper to them, and rolled the truffles in that mixture. I thought they tasted great! I did store them in the fridge (because of the cream cheese) and took them out 15 minutes before eating to let them warm up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma CJS"
},
"reviewBody": "I had no problem with the candy being too soft to roll into balls. Very easy to make and fun to try different flavors. Coconut and rolled in the coconut surprised me with how good they were. Mint, dipped in chocolate and coffee with a surprise chocolate covered coffee bean and rolled in mocha drink mix were my choices. So pretty and so good! This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzannie"
},
"reviewBody": "Heavenly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry LaRochelle"
},
"reviewBody": "Very easy, and it hardens perfectly for rolling into truffles. I thought the semi sweet chocolate chips made it a touch too sweet (kinda came out Hershey chocolate bar sweet). Next batch I will use half bittersweet chocolate and see if it comes out better. Very easy truffles though, love them and going to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Barbp"
},
"reviewBody": "I made the recipe for the first time exactly as it was written. We found the balls to be dry and not easy to handle when making the balls. Will look for a different recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amy ashby"
},
"reviewBody": "I read several reviews and debated changing the recipe like others to 2 cups of powdered sugar. But, I decided to stick with the recipe. These are rich, yummy little morsels! I refrigerated the batter for a few hours. Melted milk and semisweet chocolate, used a toothpick, twirled these little gems in the melted chocolate, then sprinkle with multiple colored sugars and sprinkles. So many options, it's endless"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina Gabriel"
},
"reviewBody": "I love these! They're a huge hit at my house. My family just raves about them! I add 1-2 Tbsp. cream (towards the end of mixing the cream cheese) per half batch. It gives them a wonderful taste and melt-in-your-mouth kind of texture, but it does seem to make them less firm and harder to work with. I've also tried them with semi-sweet chocolate chips (as the recipes states), with the 2 C milk chocolate chips &amp; 2 C sugar that other reviewers' have suggested, and with 2 C milk chocolate chips and the same amount of sugar that the recipe calls for. Even though I usually don't like semisweet chocolate, I preferred the recipe as stated because it tastes more like a \"true\", rich truffle and it firmed up better. My dad preferred the milk chocolate/same sugar mix, and my sister the milk chocolate/less sugar mix. Go figure! I roll them in almond bark like another reviewer suggested, and this way they keep their shape. It makes them taste a little more like a candy and less like a truffle, but it is still so good that I don't care. I'm going to try it with regular melted chocolate topping next. Overall, definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MgH"
},
"reviewBody": "This is definitely a 5 for ease and would be a fantastic project for kids to make edible gifts. But I find the end result too sweet. The recipe makes an immense quantity of basic truffle material. This is what I did with mine:\n(1) Flavor with Grand Marnier and roll in demarara sugar moistened with more Grand Marnier\n(2) Flavor with rum and mix in coconut, roll in coconut moistened with more rum\n(3) Flavor with whiskey, roll in a mixture of crisp crumbled bacon and sea salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Presmom1"
},
"reviewBody": "Love this recipe as is. Always my to go for the holidays!!\n\nalways a hit :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rupal Dhingani"
},
"reviewBody": "its hard to dip in chocolate and not easy to prepare after cream cheese is mixed. Constant back and forth into fridge and cooling the mixture, very hard to keep up when you are trying to make a batch and be done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjmurphy"
},
"reviewBody": "Great and simple recipe. I will use again. Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "Made as directed. Easy to make and freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I made it with premium chips and it turned out wonderful. My teenagers loved this special treat on Valentine's Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Walery"
},
"reviewBody": "I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russian Jesus Chick"
},
"reviewBody": "They are great! They are so rich though so I can only have one at a time. I've seen at my local store truffles and they've had another coating which was cocoa powder. So to compensate for the sweetness I roll each truffle/ball in unsweetened cocoa powder. And it looks fancy too! So easy to make, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loreta"
},
"reviewBody": "Super easy and really good! Made them for a christmas cookie exchange so I omited the vanilla and added peppermint extract then rolled in crushed candy cane. Every one loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "llokken"
},
"reviewBody": "We've made these quite a few times over the years. We have added liquors to the mix . I.e. Kahlua, Chambord, etc. We enjoyed rolling the Kahlua ones with a filbert nut in the center. We've also changed out the chocolate -shout out to my then 9 year old-for Ande's mints and made scrumptious mint ones. These have become a favorite of many family and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkm"
},
"reviewBody": "This was my first time making truffles, and I was happy with how they turned out. I did the recipe in thirds - one third I used vanilla extract, one with peppermint, and one with orange. The orange was my personal favorite, but all were delicious. This recipe is very versatile, I can think of almost endless possibilities for flavors and coatings. I will definitely be experimenting with this in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "btoto"
},
"reviewBody": "This recipe is great! My sister made truffles one year and I decided to kick off my winter baking by making a batch of them myself this year. I was so happy with how this recipe turned out. It was super easy to make and the truffles are delicious! I don't like semi-sweet truffles all that much, so I did use milk chocolate chips instead, and then coated them in cocoa and confectioners sugar. They are delicious! I will definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Zartman"
},
"reviewBody": "Time consuming"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea "
},
"reviewBody": "Followed the recipe, but had to lessen the confectioner's sugar, only placed 2 cups.Very good. My hubby loved it and brought in a get together and I got good reviews. Loved that it was so easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie T"
},
"reviewBody": "They were very easy and tasted delicious. I would definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elenamay"
},
"reviewBody": "Wow these are so good! Ingredients are easy to come by, the only annoying part is having to roll them all out. I only make about a quarter of a batch at a time so the rolling and decorating part doesn't take so long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kay bort"
},
"reviewBody": "First, this is super easy to make. All together it took me slightly under 2 hours. I tweaked the recipe after I read a bunch of reviews and they turned out great. I used vegan cream cheese (from a container not a block so it was really easy to beat) I used 2 cups of Ghirardelli semi sweet chips, 2 cups of the sugar. After I mixed everything I chilled it in the fridge for an hour. While I was waiting I finely chopped some nuts. I made three kinds of truffles. Pecans on one, almonds and pink salt on one, and the third were hazelnut and espresso powder. I also got Ghirardelli melting wafers to dip the truffles in before I sprinkled them generously with the nuts. For the espresso ones I finely ground espresso beans to a powder and rolled the truffles in them before I covered them with the chocolate shell and then added the hazelnuts. The only negative I had was after you take the mixture out of the fridge and start rolling them in balls it starts to stick to your hands and then you can't get them to look smooth. So after every 4 or 5 balls I washed and dried my hands with just water and kept going. It was kind of a pain but it worked. I made them the size of a Lindt truffle and I got about 40 out of it. All in all I liked this recipe because it's easy and so customizable. Totally worth two hours of work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catie"
},
"reviewBody": "I did make some adjustments to taste, but this is such a fantastic base recipe for truffles! It helps if you keep most of the batch in the fridge and make a few at a time as it began to melt in my hands after a few minutes. Rolled them in sprinkles, they were a huge hit and gone within an hour!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tippy"
},
"reviewBody": "I used two cups of sugar, one bag of white chocolate chips, pumpkin flavored cream cheese, and a shot of Bailey's. I'm having trouble shaping them, but this is my first truffle attempt. The mixture is very pretty and tastes just like a truffle should."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Pilsbury"
},
"reviewBody": "I love this recipe. It's so easy and yummy. For anyone who has a problem rolling them, if you had watched their video you would see that they tell you to use a small ice cream scoop or melon baller so that you are not rolling them by hand. Makes them simple and quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookie_cooker"
},
"reviewBody": "Ridiculously easy! But very time consuming!! I made one batch and split into different variations. My favorite was white chocolate chips with orange extract dipped in dark chocolate. I tried to make as written, but was too messy and time consuming. So after a few, I stuck the bowl back in the fridge and refrigerated for 20 minutes then I dropped spoonfuls onto waxed paper and froze for an hour. Then rolled into balls. So much easier!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary K Kuzma"
},
"reviewBody": "This is a lovely recipe, but the finished truffle does not melt in the mouth especially. Still it tastes good, though very sweet. My son (chocoholic) loved them and my friends liked them as well. Sprinkles on the outside worked the best for the round balls. I used cookie stamps to turn them into medallions and coated them with cocoa which looked elegant for gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra C"
},
"reviewBody": "Very smooth and decadent. I ran out of semisweet and had to use half white morsels. Still a nice brown color. Firmed it up in the freezer. Rolled mine in cappuccino Carmel powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sone"
},
"reviewBody": "I can't get over how easy this is and how impressed people are with it! Great gifts for folks too. It so much fun to get creative with different flavors and toppings too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missye73"
},
"reviewBody": "My family and I always make the same Christmas candy every year. This year I found a few new ones to try out. This one is a KEEPER! So yummy. I even rolled a few in tiny heath pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolinaB"
},
"reviewBody": "So easy! I used 2 cups each of the confectioners sugar and melted chocolate, per other reviews. Turned out awesome! I dipped mine in chocolate, white chocolate, coconut, powdered sugar, and cocoa powder. My yield was less than 60, so I must have made mine too big. Totally recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Baggett"
},
"reviewBody": "This recipe was super simple and very easy to modify to whatever flavors you are in the mood for. I have subbed the vanilla extract for orange, raspberry, and coconut all to good effect. I have also used different kinds of chocolate chips (dark chocolate, white chocolate, etc). My favorite so far has been dark chocolate chips with coconut extract, dipped in chocolate almond bark (the leftmost truffles in this picture). I would definitely recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Trammell"
},
"reviewBody": "these are so good! for people who can't stand a bunch of sugar these are not for you unless you make them small and roll them in cocoa powder. they are even better if you leave them in the fridge all day but still good even melted, which unfortunately is very easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrjcbk"
},
"reviewBody": "Thank-you so much for sharing this delicious, simple and quick truffle recipe. I promised my 7yr old we would make truffles today and I was dreading it all morning, I was delighted to find an all recipes video based on this recipe. We decided to take the advice from numerous others and re-dipped the truffles in the extra melted chocolate which was left over after we measured three cups. I do have some advice, my truffles were very large and way too rich for what I enjoy but, my daughter made small ones formed with her tiny hands and they were the perfect portion size for the extreme sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa M."
},
"reviewBody": "My daughter loves making these, so simple and good. We dip them in all sorts of candy and chocolate. Really fun and delicious."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/41236/easy-decadent-truffles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
"name": "Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/751/desserts/candy/truffles/",
"name": "Truffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/41236/easy-decadent-truffles/",
"name": "Easy Decadent Truffles"
}
}
]
}
}
, "about": [
]
}
]