				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy Broccoli and Ham Quiche"
,"datePublished": "2011-01-11T08:41:50.000-05:00"
,"dateModified": "2022-10-27T14:42:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JenCanCook"
,"url": "https://www.allrecipes.com/cook/mamajenny"
}
]
,"description": "This ham and broccoli quiche with Cheddar and onion features a milk and egg custard baked in a tender crust for a delicious meal any time of day."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Q1SfgtWG--fEBXxTmQ-z7eJ6W2w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3559322-031a32a9a7a2444abb7a8590fa30b3c5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy Broccoli and Ham Quiche"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "132"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "480 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "186 mg"
,"fiberContent": "3 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "868 mg"
,"sugarContent": "5 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (10 ounce) package frozen broccoli florets",
"2 tablespoons butter",
"1 onion, minced",
"1 teaspoon garlic, minced",
"1.5 cups diced cooked ham",
"1 (9 inch) unbaked pie crust",
"1.5 cups shredded Cheddar cheese",
"1 cup milk",
"4 large eggs, beaten",
"0.5 teaspoon ground black pepper",
"1 teaspoon smoked paprika" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place broccoli into a glass bowl. Cover the bowl with plastic wrap. Cook in the microwave in 1-minute intervals until evenly heated through, about 5 minutes; drain and set aside."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a large saucepan over medium heat. Sauté onion and garlic in melted butter until onion is slightly translucent, about 5 minutes. Stir ham and broccoli into onion mixture, then transfer to pie crust."
} ,{
"@type": "HowToStep"
,"text": "Beat together cheese, milk, eggs, and black pepper in a medium bowl; pour over ham mixture in crust. Sprinkle with paprika."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a knife inserted into the center comes out clean, 30 to 45 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C Horton"
},
"reviewBody": "We love this recipe! Always sooo goood"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great base recipe! Was searching for a way to use up leftover Christmas ham. Used fresh broc and put them in the microwave for about 2 minutes in a glass bowl covered with plastic wrap to steam a bit. Made the quiche crust and used a quiche pan, which caused a bit more filling. Thankfully had a small dish handy for excess. Substituted a shredded mexican cheese blend, cause that's what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smrnite68"
},
"reviewBody": "Made this exactly as written. Flavor is wonderful, but I agree with other reviews. I couldn't fit all of the custard mix into the pie so there was too much of the other filling. Next time I will put only one cup of cheese and one cup of ham and one cup of broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "If people are having trouble with soggy crusts, I would shred up some cheese, put it in the empty crust and bake just that until the cheese melts, creating a barrier for the liquid. I just cooked a ham, and I have plenty of cheese, pie crusts, etc. on hand. I do love quiche; can't wait. I'm not a fan of straight ham, but I do love it in things. I pressure cooked the bones and will make some pea soup, as well. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbberry"
},
"reviewBody": "I made this for the first time today. I wish I had read the reviews, because I agree that 1 1/2 cups of ham and and 1 1/2 c. shredded cheese and 10 oz of broccoli is way too much. There was not enough custard because of there was too much of the main ingredients. Next time I will do was handyman says: 1 cup cheese, 1 cup ham, and I cup of broccoli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DynamoGirl"
},
"reviewBody": "Lovely recipe! Homemade buttery crust. For milk 1/2 heavy cream and 1/2 buttermilk. Added red sweet peppers and mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The recipe was great, but more importantly, it was so refreshing to be able to easily see and follow the recipe and the ingredients without having to wade through tons of advertising. Thank you so much for that. Because of this reason, I will always go to Allrecipes before anyone else when I'm looking something up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IndyMama"
},
"reviewBody": "I thought this was a great recipe. I made it as is except that I used fresh broccoli, blanched, and a combination of Gruyère and cheddar. Because that’s what I had. It was delicious! I had it for lunch the next day… and the day after… . Still tasted wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The absolute best. I use a Cajun Turkey instead of ham. I also let the onion broccoli mixture cool a little and the mix in cheese. I don’t add it to eggs. I’ve made this recipe for years and it’s always a hot no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wintersunshine"
},
"reviewBody": "I didn't have white onion so I chopped a couple green onions. Also substituted asparagus for half of the broccoli, and par-baked the crust as suggested by another reviewer. Delicious! I will def. make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Hickman"
},
"reviewBody": "8/27/21 - I used more eggs because I have a deep dish, otherwise followed directions and this was excellent fresh from the oven and reheated"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssahls"
},
"reviewBody": "Definitely use fresh broccoli! Great easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "I replaced ham for chicken Italian sausages, and used 1/2 onion as well as sprinkled some cheese on the bottom of the pie crust and on the veggies before adding the egg mixture. I also cooked all the ingredients ( broccoli, onion, garlic, sausages). in one pan before adding to pie crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "We enjoyed it. I made it because I had all of the ingredients in the 'fridge that I needed to use up. Recently I learned how to make a nice pie crust (about time)--better than the store bought. Leftovers for lunch tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuMa"
},
"reviewBody": "We really enjoyed this quiche. It was easy! Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MealPrepper"
},
"reviewBody": "Way too much filling for 9' pie crust. Made according to directions where ham/broccoli mixture is put in crust and eggs/milk cheese mixture poured over top. All the cheese stayed on the top and would have over browned so I poured it all back into a larger bowl and mixed and transferred back to the crust. Needless to say, very messy process. I will combine all ingredients in large bowl if made again. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "acidcowgirl"
},
"reviewBody": "Excellent! I added Swiss Cheese to the bottom crust and then poured ingredients. I also added more herbs and spices, and love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "Delicious and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Patterson"
},
"reviewBody": "I used Swiss cheese instead of cheddar and it was perfect. So yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky Lutz"
},
"reviewBody": "I weighed 7oz fresh broccoli, as opposed to 10oz frozen. Used frozen pre-made pie crusts. The broccoli and 1.5c of ham, ended up being a large pile. So, I split it between 2 crusts and added 1 more egg and 1/4c more milk. It filled 2 crusts perfectly (doubled the cheese, of course -- all other ingredients measured as recipe states). It's in the oven now. Smelling delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laylth"
},
"reviewBody": "This couldn’t have turned out any worse. I used a 10 inch pie plate which should’ve been big enough. There’s way too much broccoli, ham and onion to fit in the pie pan. The egg, milk, cheese mixture doesn’t allow the cheese to mix into the quiche so it sat on top to burn. I cooked it for 55 minutes, cooled it, cut into it and zero egg had cooked. 100% runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Seals"
},
"reviewBody": "Awesome quiche. Like others I blind baked my pie shell for about 8 minutes. The rest was pretty much per recipe. Sauted onion and garlic, used 8 oz of broccolli, 1/2 chopped red pepper sauted all together and poured into pie shell. Mixed eggs and milk together with hot pepper flakes, nutmeg, S&amp;P, added 1 1/2 c. of diced ham and 1 1/4 c of freshy shredded sharp cheddar . Poured all of it over the vegies. Sliced a tomato and it layered it over the top. Hmmm, Hmmm. Will make again. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura Ross"
},
"reviewBody": "A couple of notes... first, way too many ingredients for a regular 9” pie crust, maybe a deep dish would have worked better. I ended up with too much broccoli and cheese; too little egg/ milk mixture. Also, the crust should be precooked a bit. The crust was mushy the first time I tried it. The second time I cooked the empty crust for 10 minutes at 350 degrees on the bottom rack. Then, I put in the fillings and cooked as directed on the bottom rack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teeveemom"
},
"reviewBody": "AWESOME! I used fresh broccoli and mixed the cheeses - half cheddar and half Italian blend. I would recommend adding a little salt. It will become a regular in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Anthony Burleigh"
},
"reviewBody": "I used a quiche dish so it was probably a 10” plate. I used a half cup of milk and half cup of half and half. The quantities asked for was just about what I used and they all fit well into the dish and did not overflow. I steamed broccoli florets and cut them up some, and chunks of a nice tavern ham which added great flavor. All in all an easy, very tasty meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Cool"
},
"reviewBody": "Very good, and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "A C"
},
"reviewBody": "45 minutes bake, only half onion, less broccoli and ham"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy McClellan"
},
"reviewBody": "I have made this recipe several times. Comes out perfectly, evety time, easy to make with yummy rewards!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "This turned out perfect. I can't stand wet quiche, so I didn't fill the milk to one cup, maybe about 7/8. I used fresh broccoli and a blend of extra old cheddar and Monterey Jack. I cut back the onion to half for a picky eater. I also used only 1 c EA ham and cheese because of the suggestions in the reviews, and then used a deep dish pie shell. Medium size eggs. I would have had room for the full amounts in the deep dish shell though. It needed 40 min in my oven. It turned out delicious, set well, was quick to throw together and I'll be serving it regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goodfoot"
},
"reviewBody": "This recipe continues to be a winner in my house. I often do not use a crust to save on calories and it has turned out fabulously every time. Seems to work with a variety of ingredients including cooked carrot/broccoli/cauliflower mix, have added canned mushrooms, or sun-dried tomato pieces, etc. Also vary the type of cheese used; seems to always work as long as you stick to 1 cup of milk and the 4 eggs. IMO, the glory of the recipe is the smoked paprika on top! Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "I am a relatively beginning cook and this recipe made me feel like I truly had a handle on what I was making. It brings together a lot of basics into a great dish. After making it a couple of times I feel confident in adjusting the vegetables, cheese, and meat ratios in it to fit exactly what my family and I like best. I highly recommend it as is as well. \n\nWe used chunky instead of diced ham but it still worked fine in the quantities stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mombeck"
},
"reviewBody": "Mine was good, but a little watery. I will decrease ham and cheese since I don’t have a deep dish 9” pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aj'snana"
},
"reviewBody": "My husband is not a quiche fan, but he loves this recipe. I made it with no changes and it is simple to make and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "I made this exactly the way the recipe said to make it. I doubled the recipe and I used two 9 inch deep dish pie shell‘s. Was able to fill both pie shells. The cooking time is exact 40 minutes. Couldn’t have been more perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Taravella"
},
"reviewBody": "TOO MANY INGREDIANTS! The pie crust couldn’t hold all of it and spilled over creating a mess. I had to dump it all into a bowl and leave half of mixture out. Next time I will half ingredients like another reviewer said. I always read reviews. I don’t know why I didn’t this time. As for the taste, it’s still in the oven and looks a mess. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Midnightpisces"
},
"reviewBody": "This was a very simple recipe to follow. I used it as a guide. However, for me the cooking time was off. Mine took 50 minutes. Also, as someone else suggested PRECOOK YOUR CRUST. What a disappointment to have a delish quiche with raw pie dough on the bottom. I had to scrape out the quiche and cook my crust again! As for flavor, it is a great quiche. I would suggest adding a pinch of salt as there are no seasonings added to this recipe. I did substitute heavy cream for the milk and added one more egg. I wanted to add cottage cheese, but forgot. Still, it came out delicious. I will make again, but remember to PRECOOK that pie crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Weber"
},
"reviewBody": "Will definitely make this again. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Cloos"
},
"reviewBody": "I made this in a metal pan, no crust- baked for 30 minutes. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plumeria"
},
"reviewBody": "The only change I made to this recipe was to substitute sliced deli meat (chicken) since I needed to use it up. The same thing happened with this quiche recipe as with another recipe. The broccoli and onions really filled up the frozen 9' deep dish pie shell. Didn't leave enough room for all of the egg mixture. I think I'm going to fill the shell with the egg mixture FIRST next time, and then add the broccoli and onion mixture a little at a time, just until the egg mixture is almost to the zigzag pattern on the edge of the crust. I hate losing all that egg to the foil covering my sheet pan. Depending on how much broccoli/onion mixture is left, I'll use it in a second quiche later or just an omelet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RichieK"
},
"reviewBody": "Used Spinach instead of Broccoli. Came out superb. Also added mushroom. The whole thing was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snowboarder27118"
},
"reviewBody": "I doubled the recipe and made two while I was at it. I didn’t have an onion which I don’t think would have fit anyways. I had a half pint of heavy cream but no milk. So, I threw in a bit of almond milk and water to make up for the missing milk. I will definitely refer to this recipe in the future for more quiche making needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "energi"
},
"reviewBody": "Very easy and good. Followed exactly as written but I omitted the ham. Not sure why the crust pulled away from the dish tho?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chunkmrmom"
},
"reviewBody": "Delicious and very easy to make. However, I’ve made this recipe twice and it took about double the time for mine to cook all the way"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Countrygirl"
},
"reviewBody": "Excellent. Easy to follow recipe. Had it before but had lost it. Glad to find it. I added chopped onions to this one I recently made week ago, and in the past. I’ve also added turkey strips or chopped. Plan to do one with turkey and bacon soon. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gwenie"
},
"reviewBody": "I wanted to use asparagus I had on hand, so I substituted that and also switched out Swiss cheese instead of the cheddar. We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Fournier"
},
"reviewBody": "Easy and delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "golfmom"
},
"reviewBody": "I have made this recipe exactly as written and it is very good. Excellent for a lunch with salad and fruit. The only issue I have with this is it is too much for a deep dish crust. Be sure you put a cookie sheet with sides under the quiche when cooking or you will have a major mess in your oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Monaco"
},
"reviewBody": "I was looking for a way to use an abundant broccoli harvest. I made this as written, but used some Swiss cheese , in the mix, because it needed to be used. Made my own pie crust as well. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funnykidd2"
},
"reviewBody": "Turned out great! I used bacon because I had and fresh broccoli. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy Alaniz-Sessions"
},
"reviewBody": "My mom and I loved this ! I used a ready made pie crust but in my deep dish pie plate and everything fit perfectly! The crust came up to the rim of the plate so I didn't have to crimp the edge. The only thing I was disappointed in was that it came out wet even after 45 minutes but I feel it's because I didn't drain the broccoli before adding it to the onion garlic mixture, my bad. I left the florets whole (I love broccoli). Also, I might use cream next time and only 1/2 to 3/4 cup. Otherwise it was very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rhouse86"
},
"reviewBody": "Tasty but it definitely took way longer than 45 minutes to be cooked through. Just a heads up in case you have hangry kids waiting for dinner as waiting didn’t go over so well in our house. Might take less time if you cut back on some of the ingredients, it is kind of overfilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Colquhoun Peamkah"
},
"reviewBody": "Turned out very good. Cooked evenly, was not wet in the center like some"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jayjay Wilson"
},
"reviewBody": "It tastes amazing but was frustrated because it was way too many ingredients for a single 9” pie crust!!! So after dumping over half of it in the shell I had to dump it back into the bowl and try and divide it up into two!! Will definitely use this recipe again but just keeping in mind about it being 2 shells needed not just one!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ldavido"
},
"reviewBody": "kids liked this too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jinglebells"
},
"reviewBody": "This was excellent! Made it exactly as written and couldn't be happier. I did use all the ham and it wasn't too much for us. When I poured in the egg mixture it nearly overflowed so I spooned a bit of and put it in the oven on a cookie sheet, then I added back what I'd spooned off and it did not bubble over while baking. Amazing taste and an amazingly beautiful quiche."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MariaV"
},
"reviewBody": "Made this for Christmas morning, and everyone loved it! I think for next time I’ll add some mushrooms and bell peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHERRYBERRY1"
},
"reviewBody": "I made this recipe without the ham. I used one bag if Steamfresh broccoli (6 minutes in the microwave), chopped the broccoli and tossed it with the sauteed onions and garlic in a bowl to cool. In a separate bowl, I whisked together the milk, eggs, black pepper, paprika, and one cup of shredded cheddar cheese (the extra 1/2 cup of cheese that the recipe calls for is too much to fit in the 9 inch crust). I combined all the ingredients into one bowl, gave it a final whisk and poured it into the pie crust (a defrosted 9\" crust from the freezer section of the grocery store). I baked it for 1 hour at 350° until the center looked like it was cooked all the way through. I gave this recipe 5 stars for easy prep, and it's just plain delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terryg"
},
"reviewBody": "It doesn't get much easier than this! I was impressed at how creamy it turned out, using whole milk vs. half and half. I used fresh broccoli and cooked it in the frying pan with the ham, onion, and garlic while I made a basic crust (flour, salt, olive oil, and water). Add your favorite spices and cheeses. I used cheddar, Swiss, and tossed a little goat cheese in. My quiche took 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Potter"
},
"reviewBody": "The kids love this!! But I have to double egg ingredients and add milk to fill my two large quiche dishes that it takes to make a family dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emersonreturn"
},
"reviewBody": "will make again. used an organic pie shell to make life easier. made it for lunch for the mom in law, to use up some of the ham from good friday. i subbed asparagus for the broccoli, added lots of garlic &amp; 2 different kinds of mushrooms, red pepper, red onion, blue cheese, fresh mozzarella, whipping cream &amp; sour cream, everything else pretty much the same. it was great. i think next time i'll add another egg . it was a hit, mom in law had more than 2 nibbles, DH loved it. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "Loved It! Easy to make and tasted great. Nice and creamy. Made two at once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Meserve"
},
"reviewBody": "Delish! I used fresh broccoli florets, steamed them just a bit, added them to onion and garlic and sautéed them\nChanged the ham (didn't have any) to 4 strips of thick cut smoked bacon\nAdded bits of Brie, turmeric, Mrs.Dash and paprika to cheddar and egg mixture\nPut sliced red peppers on the top...\nAfter it cooked, I added thinly sliced Brie slices in between the peppers\nMmmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Redstreake"
},
"reviewBody": "This was amazing, although I used fresh broccoli and sausage. I also used American and cheddar cheese! Will most definitely make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hanna Elizabeth"
},
"reviewBody": "This was very good but I made a lot of changes because it just didn't need some of the steps. \n\nSo, first things first. I baked the 9\" pie crust for 10 minutes before I filled it because a frozen pie crust would just take forever to bake through with liquid stuff in it. Been there, done that, don't want to do it again. \n\nI diced my ham and ran some warm water over the frozen broccoli. I did not use onions so didn't need the butter and I didn't pre-cook the broccoli. I don't like mushy broccoli and cooking ahead of time would turn it to mush. \n\nThen I mixed up the liquids. I used five eggs instead of four and I cut the milk so the total liquid would be two cups - not a full cup of milk. Probably more like three-quarters cup. \n\nI was skeptical about adding the cheese to it (I used shredded Mexican mix cheese), and although I had to encourage it come out in the end, it did well. \n\nI added the ham and broccoli first and then filled the pie crust with the liquid. After filling the pie crust (make sure it's on a cookie sheet to bake!) I covered the edges in foil so the crust wouldn't burn. Just cut the foil into strips and fold/work it around the edges - takes about 3-4 medium strips. \n\nBaked it at 350 for 60 minutes. Taking the foil off for the last 10 minutes so the edges can brown up.\n\nAgain, it was really, really good and there's nothing left. So definitely one we'll have again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AnnieM"
},
"reviewBody": "My husband loved this but I thought it was lacking something, although I'm not sure what. I made one major change - I skipped the pie shell to save calories, love the crust flavor but . . . I did add some raw mushrooms, but next time will sauté them along with some chopped red bell pepper in with the onions to perk up the flavor. Overall it was an easy, relatively quick, and nutritious dish and I will be adding it to my meal rotation regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tami Flores"
},
"reviewBody": "Let me start with the fact that I doubled the recipe. I'm not quite sure what went wrong but it was runny. The only thing I did different was I used a squeezable minced garlic which does add some water. However, it was so runny, I couldn't get the eggs to solidify. After all was said and done, I ended up scooping out of the pie crust into a strainer, and eating mixture on tortillas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Anne Grammond"
},
"reviewBody": "Used a slightly larger pie plate so everything fit. This was SO good. Will be a new staple in our house. My son had three slices!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lj"
},
"reviewBody": "An amazing way to start a day! Very easy to make and taste is excellent (even with pre made dough!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela L. Fandrich"
},
"reviewBody": "I followed recipe except used 10 ounce box of frozen spinach instead of broccoli. Spinach was squeezed dry. I used 1 1/2 cups of cheese and of ham, and my deep dish 9 inch pie crust held it all. Easy and very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terridean"
},
"reviewBody": "This recipe was delicious. I added fresh sauted mushroom and used fresh broccoli. Perfect recipe for our left over ham from a Christmas Party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jay"
},
"reviewBody": "This was a great recipe, the only thing I changed was adding red peppers and mushrooms. This was Ann excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Friesen"
},
"reviewBody": "Very easy to make and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie K."
},
"reviewBody": "This is really a great recipe. I bought a thick (1/2 inch) slice of ham from the deli for this recipe. I omitted the onion but added the broccoli and a bit of diced red pepper. So delicious. I can't wait to have leftovers tomorrow.\nThanks for sharing this recipe; it's definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mookey"
},
"reviewBody": "We loved this and would be happy to make it again. I followed the advice of the reviews and cut back a bit on the broccoli and ham. My store bought, frozen pie crust was full."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mookey"
},
"reviewBody": "We loved this and would be happy to make it again. I followed the advice of the reviews and cut back a bit on the broccoli and ham. My store bought, frozen pie crust was full."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen"
},
"reviewBody": "I made 2 of these and gave one to my neighbor. I used a cup of ham and a cup of broccoli as reviewers suggested and layered the cheese. There was a perfect amount for the 9 inch pie plate. I made it for dinner and it was a hit. The leftovers were finished the next day for breakfast still yummy and a great way to start your day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grannyww13"
},
"reviewBody": "I added bell pepper diced and no onion. It was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D Martinez"
},
"reviewBody": "I made this quiche i did alternate a few things as i didnt have some iteams on hand i originally was going to do two seperate quiche's ham and cheese and broccoli and chesse i came accross this recipe and gave it a try except i used\n2c of fresh broccoli\n1.5 cup of milk \n8 large eggs\n1 cup of ham\n1.5 cup of cheedar \n1 prepackaged pie crust\nSquare glass pan coverd with aluminum\nI cooked the pie crust 5 min before putting in ingredients i layered cheese, broccoli, ham \nI then added the remaining cheese to the eggs and milk batter after beating them cooked at 350 for 45 minutes i do reccommend cover the top of crust it helped keep it from burning. My momma loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Eleanor Haas"
},
"reviewBody": "Made this for a bachelorette getaway weekend brunch and everyone raved about it. Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phoffman"
},
"reviewBody": "Excellent, especially with my homemade piecrust. I used a combination of Swiss and sharp cheddar cheese and did not beat the cheese with the eggs &amp; milk. Instead, I put some cheese on the (PRECOOKED for 10 minutes @425 degrees) crust; mixed the rest in the broccoli/onions/garlic along with 1/2 tsp of paprika and then poured the mixture in the crust. I added a little more Swiss cheese on the top and sprinkled the remaining paprika over it. I baked in a 9\" deep pie plate. Cooked about an hour and let stand about 10 minutes. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "also added mushrooms, very good recipe, be sure to cook for full time to get the nice browned crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brenda e"
},
"reviewBody": "I didn't have broccoli so I fried up some asparagus instead with the onions. Tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindeeloo"
},
"reviewBody": "Awesome! My 3 yo loved it and asked for more! Was looking to use up leftover Easter ham for dinner, but did substitute chopped baby kale and broccoli (lightly steamed in microwave) for the veggies. Also used mix of shredded cheddar and Monterey Jack . definitely in the rotation, thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "monic"
},
"reviewBody": "It has been in the oven for the past 1.5 hours and is still not finished cooking. I will never again make this quiche."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "Even my husband who doesn't care for quiche said it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Gross"
},
"reviewBody": "I read the other reviews and decided to make a few of my own changes. I like my pies deep and used a 10\" pie pan. I increased to 7 eggs and added a 1/2 cup of half &amp; half. I also used a fresh broccoli crown, steamed it and chopped up about a cup. I cut the paprika to 1/2 tsp and added a pinch of ginger. I used 1/2 of a medium onion sautéed it with the minced garlic. I replaced some of the shredded mild cheddar cheese with sharp cheddar and mixed it in to the egg mixture, reserving a small amount to sprinkle on the top before baking. It took a little longer to bake, I added about 5 minutes. The pie was delicious, my family loved it! Also it was nice and thick. This recipe was simple to make with wonderful results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E. J. Collins"
},
"reviewBody": "I use what ever I have available in my fridge. This Quiche recipe is so versatile, I toped it with fresh spinach. It turned out fantastic!\nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JayneD"
},
"reviewBody": "This dish was awesome, I will cook this again but I would decrease the ham and cheese by a half cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Culinary1"
},
"reviewBody": "Slightly too many ingredients. Tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momof3"
},
"reviewBody": "Update - two years later and still making this exact recipe, with a dash of nutmeg added. My family loves it! Original review from 4/16 - This was the best quiche I've ever made - and I made it multiple times. I couldn't give it five stars because there were just too many onions for our taste. Otherwise a fantastic recipe. I'd love to try the leftovers but there aren't any! Changes I made: My family doesn't like broccoli so we substituted 2 cups of tightly packed chopped spinach. I put it into the pan with onion and garlic. I also added a small amount of diced red pepper. I added an additional egg and 1/4 cup more milk as some have suggested. It filled my 9\" deep dish pan perfectly, allowing a little room for puff. I had to cook it for the entire 45 minutes. I have made this for dinner and for breakfast. Its always a hit. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "claudine"
},
"reviewBody": "great filling - i don't know people are zoo confused about when to add the cheese (its with the milk mixture at the end - not hard to mix at all)\nmy problem was with the pie crust (it said unbaked - big problem) i hand made my pie crust (maybe it was much thicker than a normal store bought one) but after 45 minutes the inside was cooked perfectly and tasted great. but the pie crust at the bottom was not cooked. so i suggest cooking pie crust before putting in filling (especially if your making your own pie crust)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandi Quinn"
},
"reviewBody": "The recipe is very good. With that being said, the amount of ingredients is too much. I put in less ham, because I read it on another review. I really should have used a 10\" pie plate instead. I also added dill, and it gave it a very special taste! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SaraJane"
},
"reviewBody": "I just used a regular 9\" pie plate and fresh broccoli, chopped fairly small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer87"
},
"reviewBody": "Easy to make and very tasty! As other reviewers suggested, I reduced the cheese and ham to one cup each. I baked it for 35 minutes and it was perfect. My husband requested that I put this one in the regular rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Stinson"
},
"reviewBody": "Have made this 5 times came out great. I use Jumbo eggs and it is a perfect fit for 9\" pie crust/pan. Yum Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Herm"
},
"reviewBody": "I made this exactly as the recipe was written. Perfect in every way. Bake time perfect. Flavor great. Fit perfect in the 9\" pie shell. The smoked paprika gives so much flavor. Hint: Fill pie pan on a bake sheet for easy in and out of the oven and for the just in case \"drip\". Mine didn't drip or overflow but it was easier to transfer. I'll be trying this recipe with a few different additions like mushrooms, cooked crumbled sausage, peppers or asparagus. (I ate my piece with a little hot sauce, yum)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "My family loved this recipe as written. I used fresh broccoli florets, chopped very small. This recipe does fit a 9\" pie plate, just be sure to use a taller one. Mine required additional cooking time to set. I will definatly save this recipe and make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rufus"
},
"reviewBody": "IST TIME MAKING QUICHE. COULD FIT ONLY ABOUT HALF CUP LIQUID MIXTURE, AND EVEN THAT SPILLED OVER EDGE."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grannie"
},
"reviewBody": "ok. we had the quiche for dinner. OMG!!!!! incredibly delicious! i have never tasted anything so delicious! i loved it, my husband loved it and even my mother in law loved it! will definitely keep this recipe. guess i added the cheese in the right place! lol."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/236274/easy-broccoli-and-ham-quiche/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
"name": "Quiche"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/236274/easy-broccoli-and-ham-quiche/",
"name": "Easy Broccoli and Ham Quiche"
}
}
]
}
}
, "about": [
]
}
]