				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Easy and Quick Swiss Steak"
,"datePublished": "2020-06-18T23:11:03.000-04:00"
,"dateModified": "2021-12-01T18:16:59.000-05:00"
,"author": [
{"@type": "Person"
,"name": "azdadof5"
,"url": "https://www.allrecipes.com/cook/759819"
}
]
,"description": "This was my favorite growing up. I was amazed when I was older and asked my mom for the recipe how EASY it is! A small amount of prep. time, a day in the slow cooker, and you&#39;ll be amazed! It sounds too simple to be good... TRUST me! This gets RAVE reviews when we make it! The amount of vegetables is only an estimate. Use as many or as few as you choose. When it&#39;s done, you will have a yummy gravy, and will have to carefully dig for the steak pieces."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Xs5if1HKIWxW_4QoFuMcHh115AQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/101305-d961c72854874c8d9238b954b6683435.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Easy and Quick Swiss Steak"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "117"
}
,"cookTime": "PT490M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "349 kcal"
,"carbohydrateContent": "49 g"
,"cholesterolContent": "27 mg"
,"fiberContent": "7 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "305 mg"
,"sugarContent": "5 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"2 cups all-purpose flour",
"salt and pepper to taste",
"paprika to taste",
"2 pounds beef cube steaks",
"3 green bell pepper, sliced into rings",
"3 red bell pepper, sliced into rings",
"4 onions, sliced into rings",
"4 (14.5 ounce) cans crushed tomatoes" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the oil in a skillet over medium heat. In a bowl, mix the flour, salt and pepper, and paprika. Dredge the steaks in the flour mixture, and place in the skillet. Brown steaks on both sides, and remove from heat."
} ,{
"@type": "HowToStep"
,"text": "In a slow cooker, alternate layers of steak, green bell pepper, red bell pepper, onion, and tomatoes."
} ,{
"@type": "HowToStep"
,"text": "Cover, and cook 6 to 8 hours on Low, until steaks are very tender."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT505M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momof7"
},
"reviewBody": "I made these mods for a non-crock pot version: Combine the tomatoes and 4 sliced bell peppers in a sauce Pan on low heat with a lid. Season the steaks with salt and pepper before dredging in flour. Then brown the meat as directed. Lightly Brush a 13x9 casserole dish with olive oil. When the steaks are browned, move them to the casserole dish. Once all the steaks are browned and in the casserole dish, cover with tomato/pepper mixture. (2.5 lbs yielded 8 steaks) Bake for 25 minutes in 350° oven. Perfectly tender and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles"
},
"reviewBody": "Pretty dog gone good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Seals"
},
"reviewBody": "I cut the flour down to just under a cup. Made sure the beef was well seasoned with salt and pepper. Otherwise followed the recipe. Except for adding a couple of diced potatoes and carrots. Always looking for ways to add vegies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Virginia Leggett"
},
"reviewBody": "It was good but I would suggest you cut back on all the veggies unless your using a lot of meat for the amount of veggies it calls for. I have 2 gallon bags of sauce left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisyl376"
},
"reviewBody": "It was delicious. I'll make it again. I think I'll add mushrooms to the mix next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "My husband &amp; I had to go on a healthier diet about 3 months ago. Low calorie, low fat, low carb, low sodium....low taste. Its been an adjustment. I am always looking for good recipes, and this one has been my favorite. It was simple and delicious. If I could have added salt, I would have done cartwheels. Cube steak can be tough, so I was worried about that. It was fall apart tender. I made it as is. I get confused on the ratings system, which I use. People rate the recipes but totally change them. It makes it a guessing game."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Princess Pookie"
},
"reviewBody": "Followed the recipe. It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Agatha Marie Nagel"
},
"reviewBody": "This came out really sweet. Not what I was expecting, but good for meal prep."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Denise Orndorff"
},
"reviewBody": "I made this in our Ninja Foodi in a little more than an hour. The meat was tender and the seasoning was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Daniel Dutton"
},
"reviewBody": "This was not very good at all. The meat fell apart in the slow cooker and turned this into Swiss stew. No thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Grindberg"
},
"reviewBody": "I made it in a dutch oven and used chicken broth and homemade tomato sauce. came out sooo tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frogkisserxox"
},
"reviewBody": "Sooo easy, sooo delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eric Empire"
},
"reviewBody": "It was alright. Not great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra S Martin"
},
"reviewBody": "This was very much like the Swiss steak my Mom used to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pamela Arnold"
},
"reviewBody": "At 8 hours this is not quick, easy yes. I made it quick on top of the stove. I always use seasoned flour for dredging meat solving the bland issue, I also added about 1/3 cup pinot noir. This was done in 30 min or less, my peppers, onion, &amp; tomatoes kept their texture &amp; color since they weren't cooked as long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leesann"
},
"reviewBody": "As written I'd give this 3 stars. My changes were first to half it for my smaller family. I used one pound cube steak, floured and browned lightly with a few sprays of Pam in the skillet. I didn't have crushed tomatoes so I slightly pulsed diced tomatoes in my blender. I used one can, and an equivalent amount of fresh chopped tomatoes pulsed into a large minced chop. I added 1/4 package of Trader Joes Fire-roasted peppers and onions. I added one package of beefy onion dry soup mix, and 2 cups water. I baked in my oven 3 hours at 350. The cube steak was soft and tender, falling apart. I thickened the tomato mixture with some corn starch mixed with water stirred into a bubbling/hot mixture. Served over egg noodles. Family raved over it. The dry soup mix added great depth of flavor along with the fire-roasted veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Marie Cox"
},
"reviewBody": "I made this with my pressure cooker to save time. I adjusted spices in the flour mixture (garlic and onion powder, salt pepper), I also added a can of tomato sauce. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Kay Clinkenbeard"
},
"reviewBody": "I have made this, as the first time &amp; it was pretty good but I have a habit of tweeking every recipe I try. For this the only thing I did differently was I replaced one of the cans of tomatoes with a 12 oz. can of V-8, absolutely awesome!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cami1972"
},
"reviewBody": "This was pretty good, I cut down on the bell peppers &amp; onion a little. Next time I make it I am doubling the meat. You really need to add seasonings to the sauce, but my son that hates veggies loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JNan M"
},
"reviewBody": "I've made this, but instead of using slow cooker, I put it in the oven for about an hour on 350°. I too have made this with either Mexican or Italian stewed tomatoes it gives more flavor, omit green pepper and use red only. The meat always turns out very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "momofwillnwesntj"
},
"reviewBody": "I have made swiss steak many times for my family, but thought this recipe would be tastier. Unfortunately, my family was quick to tell me not to use this recipe again. It didn't have any taste. Too bland for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "roxmj"
},
"reviewBody": "I did not care for this recipe. I thought it was bland, with an unappealing texture. Sorry, didn't work at all for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Morin"
},
"reviewBody": "Loved this recipe! I cut it in half since it's just me at home. I used 1 can italien style diced tomatoes and about half a can of crushed. Also used a whole green and red pepper, half each of yellow and orange peppers, and a medium sized sweet onion. I cooked it for 7 hours. The meat was tender and it was a dish full of flavor. It was great with mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave1125"
},
"reviewBody": "It was a great slowcooker meal that I will definitely be making again. We didn't have cubed steaks so I used 2 large round steaks that I cut into serving sized pieces. I served it with mashed potatoes. In the last 30 min of cooking time to thicken the sauce I added 1T cornstarch mixed with 1/2c water to make a gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonja Grothe"
},
"reviewBody": "I only gave it four stars because I felt like the sliced peppers and onions were too much and I only used one of each. I would have liked it a lot better if I had chopped the veggies into much smaller pieces or even put the sauce in a blender to make it smooth. The flavor was great. I always serve Swiss Steak with mashed potatoes and use the sauce as a gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I have made this many times and it is delish! I like to add some beef broth with a tablespoon or 2 of flour mixed in for extra flavor and thickness. It's great on rice or mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nancy7000"
},
"reviewBody": "This is the first time I have ever felt like I needed to give a review!!! I followed recipe exactly. Way too much flour to dredge steak in!! I just couldn't wait until dish was ready. 8 hrs. I waited with excitement of anticipation of this wonderul sounding meal. After all, I love peppers, onions, cubed steak, and tomatoes. And then the first taste---(:( Blaa-no taste, then the second bite--Blaa-no taste at all, except maybe bland tomatoe sauce taste. What a let down and alot of wasted money. Sorry. Will never try again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Avid Gardener"
},
"reviewBody": "Sorry - I was really looking forward to this, but it just wasn't very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra Fox"
},
"reviewBody": "Pretty good but needs more spice. sauce was great, meat was tender but it wasn't notable spice wise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Craig Smith"
},
"reviewBody": "This was ok but not fabulous. It's easy so I would probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Harris"
},
"reviewBody": "this was very good, i love it but hubby ate it but wasn't crazy about it...he said it pretty good to have every 6 mo's or so..lol..so i will make it again, i made it as written, no changes...thanks for the recipe.... Judy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Norton Morley"
},
"reviewBody": "This was so good, my family loved it. Quick and easy, just like it says. It was also an economical recipe to feed my growing boys, who eat a ton!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ski-mom"
},
"reviewBody": "mmmmmm this was really good. I used flank steak, red peppers (didn't have green), added fresh mushrooms and put it on top of garlic mashed. I used the celery/onion/green pepper diced tomatoes and a little beef broth. Add some crescent rolls and you have an incredible meal for a cold and rainy day! Will definitely make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JAL"
},
"reviewBody": "This was surprisingly good for being so easy to put together. I made 1/2 a recipe so used 1 onion, 1 red pepper and 1 green pepper along with 2 cans of diced tomatoes w/olive oil, garlic and seasonings. At the end of the cooking time, I used some of the seasoned dredging flour mixed with water to make a slurry to thicken the juices that cooked out of the veggies for a gravy. The whole family liked it so I'll be making this again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lordharumph"
},
"reviewBody": "Very good. We even used the left overs as the base to some really good spaghetti sause.\n Only suggestion would be a better cut of meat than the cube steaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrasmommy"
},
"reviewBody": "This was a comfort food dish. Pretty healthy, which I liked and it was tasty. It seemed to lack something but just couldn't figure it out. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KaraSmith"
},
"reviewBody": "I thought this was amazing... I did add 1 can of rotel (i drained all of the liquid) and also used the smoked paprika. I think that if you added broccoli it would be good also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bobby Gessner"
},
"reviewBody": "it was ok. I was a little surprised by the lack of taste. I made the recipe to the exact amount. I think it needs a little kick to it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BrandyLogan"
},
"reviewBody": "Blah. My family really didn't care for this recipe. It was pretty boring. Maybe if there were more seasonings or vegetables it would be better?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Hinrichs"
},
"reviewBody": "AWESOME!!!!! so easy and all my family &amp; guests LOVED it! I used canned &amp; crushed tomatoes and even tomatoe paste. I added whole garlic cloves, and a diced fresh jalapeno. Served it with butter &amp; chive egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FRANNYFARKLE"
},
"reviewBody": "This is a fabulous recipe. It was not my intent to change anything, but I needed to use up some top sirloin that had been frozen too long. I came across this recipe and thought it would work. I only had 1 huge fresh red pepper &amp; some frozen green peppers. I had a huge sweet onion. And I had Italian tomato sauce. But those amounts filled up my crock pot. My only addition was Kitchen Bouquet Browning &amp; Seasoning Sauce which I always had to tomato/meat recipes for added flavor. I started late so I cooked on high for 3 hours and then reduced to low for 3 hours. It was PERFECT! The meat fell apart. I served it over egg noodles. Added a salad and sourdough bread. Totally Yummy! Thanks AZDADOF5. This will be a regular in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shonna"
},
"reviewBody": "This was bland and the meat was dry with a rough texture. I have made cube steak in my dutch oven many times and I was looking for something that can cook overnight and while I at work. I only cooked it for 7 hours. Maybe I will add way more spices and shorten the cooking time and try it again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "quandrie"
},
"reviewBody": "This wasn't my favorite flavor combination. I found that the steak was a little bland. It was definitely nice and tender though. I would try it again with a few modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tara S."
},
"reviewBody": "This was pretty good. I loved how easy it was to assemble and throw in the crockpot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AllieBean915"
},
"reviewBody": "This was awesome! I had limited space in the crock pot, so I didnt add all of the bell peppers, but it was just sooo delicious! I served it over pasta at a dinner party and everyone was raving about it. I will definetely be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPEARL20"
},
"reviewBody": "I had a 2 lb round steak that I was needing to cook, so I scaled this back a bit, eliminated the green pepper (hubby hates it) and baked it in the oven for 2.5 hours. We sliced it thin and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aimee"
},
"reviewBody": "Quick and easy recipe. Good but felt like it was missing something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "This turned out quite well. I used the italian stewed tomatoes as suggested by others and it turned out with a lot of flavor. The only thing that disappointed me was that the gravy was not very thick. Next time I will try boiling it and adding corn starch when the meat is done cooking. Was great with mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovin'Louie"
},
"reviewBody": "I've tried one other recipe for cubed steak and it came out kinda tough, so I was worried. The only thing I did differently was I added a sprinkle of meat tenderizer to the steaks before I dredged them in the flour. My hubby and kids all loved it- extremely tender and a good flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BETHANNE770"
},
"reviewBody": "Very good! I used much less peppers and onions than called for, and added some seasonings that I use in my usual swiss steak (dijon mustard, red wine vinegar, bay leaf), but the base recipe is great. Very tender and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PAMELAMCKEAN"
},
"reviewBody": "This was very good and loved by all the guys in my house! I only used ONE can of tomatoes - four would be way too much! I cooked it in the crock pot on high for 5 hours and it was VERY tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jade"
},
"reviewBody": "I was not very impressed with this recipe. I found it tasted purely like canned tomatoes. Would not suggest trying this recipe. Sorry, definitely will not make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bakerbecky"
},
"reviewBody": "This was not good. I did everything suggested by other readers--Italian stewed tomatoes, extra sauces and seasonings, etc.--it still tasted like nothing and had the MOST unappealing consistency. \"Goulash\" is the only word I can use to describe it. I saved the leftovers in a corningware dish and though I'd try to turn them into a pot pie for dinner tonight, but I don't think I want to make the effort. The only reason I gave it two stars was because we were able to eatit, didn't have to throw it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoJo"
},
"reviewBody": "Hubby liked it. A miracle! He told me it was a \"keeper\". Lord only knows when he said that last! LOL! Thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sara saturday"
},
"reviewBody": "i like this recipe a lot. it is a good \"basic\" swiss steak that doesn't take much work (i love the slow cooker aspect!) it allows for adding/playing with seasonings (like the submitter suggested) to your tastes.\n\nit is truly an \"easy and quick\" recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Easy to make and I also added a stick of celery and 3 cloves of garlic....made the whole house smell good all day. The end result, though tender and 'stewy' was a little bland so I had to try and salvage it by adding soy sauce and extra seasonings. Next time I will add some beef stock instead of plain water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanine Farrar Bubick"
},
"reviewBody": "This dish was very good. I followed other reviewers and tweaked it a bit. I used 2 cans of stewed tomatoes and added 2 beef cubes. In addition, I added a Tbsp. of worchestire sauce. It really helped to kick it up a bit. Also, I only used 1 green pepper, 1 onion, 1 red pepper. The veges were just enought for the amt. of tomatoes I used. I will keep this in my recipe box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darkravyn"
},
"reviewBody": "My husband loved this. I only made a couple changes...I didn't have the veggies in the recipe so I used mushrooms instead. It was fantastic. Every bit was eaten up, even by my 19 month old daughter, who is very picky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "This was excellent! I had my in-laws over when I prepared this for the first time and it was a hit with everyone. I was really worried about making a good impression and I didn't have to worry about that with this one. We will enjoy this one again and again. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motherof3"
},
"reviewBody": "This recipe was awesome!!! I dont like beef and this came out perfecto!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqueline"
},
"reviewBody": "This was a good recipe, I think that I over cooked it a little so the peppers and onions were kind of mushy. I suppose I need a crock pot with automatic shut off. It made a tone of gravy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "REBEKAHMO"
},
"reviewBody": "My family really liked this, but since I feel the proportions are off a little as written, I'm giving it only 4 stars. I only used 1 cup of flour (seasoned with seasoned salt, garlic powder, fresh ground pepper, and paprika) and had lots left over. I used 2 green peppers, 2 onions, no red peppers (too darn expensive) and 3 14 oz cans of Italian stewed tomatoes....and while everything was delicious, I had way too many veggies and broth in proportion to the meat. I'm actually going to make some lentil soup with it after we finish the meat! Altogether, very tasty and healthy....just modify it to your own desires. Thanks for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NIECOLE"
},
"reviewBody": "Absolutly LOVE this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Sapier"
},
"reviewBody": "This was a soupy mess. The meat was a little dry but so long in the slow cooker it tasted like a roast. I dont think that I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joey"
},
"reviewBody": "I've grown up with this meal and make it for my family. I add fresh sliced carrots for more color and texture; the carrots can be used as a veggie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "way325"
},
"reviewBody": "This was a tasty dish, but not one of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brandysue"
},
"reviewBody": "Yummy! I served this over white rice and it tasted just like stuffed peppers in a bowl!\nI changed a couple of things...I used diced tomatoes with chili peppers in it, the Rotel kind. I didn't have the right spices either...but it tasted great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Navy_Mommy"
},
"reviewBody": "This was okay, but I didn't find it spectacular. I had way more gravy than I needed for the amount of meat I used. I found the sauce to be somewhat bland, even after adding garlic and a bay leaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was good-ish, not nearly as good as my mom used to make. next time i think i'd add some stewed tomatoes and a good bit more salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally Capotosto"
},
"reviewBody": "This was pretty good. I used the Italian seasoned stewed tomatoes as well and I'm glad I did. I felt it needed more seasoning. The meat was very tender and the sauce was good over rice. I just felt there was no \"depth\" of flavor to the meat. Thanks for submitting RNSPLUS4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "connie smith"
},
"reviewBody": "This was a great recipe. Mine came out kind of soupy but that was ok . I put it in a bowl with rice and it was like eating stuffed pepper soup. Next time I think I will use fresh tomatoes and tomato soup. This recipe just needs to be made to your specific tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DadWhoLoves2Cook"
},
"reviewBody": "very good easy to prepare made the house smell great when i came in from work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Gray"
},
"reviewBody": "We enjoyed this one, I used Italian tomatoes instread of crushed and added some extra seasoning to suit us...but overall very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "scoobygirl"
},
"reviewBody": "This recipe was a disappointment. Way too soupy and flavorless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy L"
},
"reviewBody": "Outstanding! I was very surprised on how much liquid \"sweated\" out of the veggies. 2 cups of flour for 2 lbs. of steak? - way too much. Will try 3/4 cup next time. I used 2 large green and 2 large red peppers and 3 medium-sized onions. Also took part of another reviewers suggestion and used Italian Style Stewed Tomatoes instead of crushed. The other suggestion about adding 2 beef broth cubes was a winner too. This FILLED my 4.5 quart slow cooker to the brim! When all was tender . . . served over egg noodles. WOW! Will be trying again with sliced roast. Thanks for the recipe :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUDITHK1"
},
"reviewBody": "Exellent!\r\nMy family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monsterTrucklady"
},
"reviewBody": "Oh WOW! This is going to be a favorite in this house! It tasted so good and hearty...a perfect winter dish! I served with roasted garlic mashed potatoes (also from this site). I used stew meat and it came out so tender it was falling off my fork! I also added 2 beef broth cubes and I obmitted the red pepper. Another reviewer commented it was a sloppy mess, it is kinda sloppy as the meat is so tender that it breaks up and it is kinda like a stew. But it tasted so good I didn't mind, for leftovers the next day I piled it on top of a slice of bread, YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KATHY"
},
"reviewBody": ".too many canned tomatoes....use pounded round steak.....dredge in flour....brown well and set aside, add a small amt of oil to pan,saute onions and mix in enough flour to make a nice roux..cook for a couple of mins.add 2 cans of diced tomatoes at most and thin with water or beef broth...season to taste, return beef to pan and simmer until tender...sauce is killer on baked potatoes!Try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "HEY HEY MAMA"
},
"reviewBody": "This is a waste of time. In the end, it is just a sloppy mess of peppers, cube steaks, and a bland tomato sauce. And i added garlic and other seasonings (2 packets of Emeril's Essence) to spice it up as recommended by the writer in the review section. It was still bland! It is horrible. I can think of many better ways to use fresh peppers and cube steaks. The sauce ends up tasting a little like the peppers, but if I wanted that, I'd make it! And why bother with the flour and browning? So disappointing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARKJOAN"
},
"reviewBody": "Great! I made it with larger pieces of round steak and only needed about 1 cup of flour. Added seasoned salt, garlic powder, and paprika to the flour, plus 2 beef boul. cubes and a few dashes of worcestershire sauce to the tomatoes. Very flavorful and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helene Rose-Carson"
},
"reviewBody": "My mom made the same but with some \"modifications\". Instead of using the veggies, use the \"italian style\" type stewed tomatoes. It already has the bell peppers and the onions in it along with some other spices. Using these tomatoes takes either the bitterness or sweetness you get from using regular canned crushed tomatoes (they are always different). Also add some extra garlic and serve over egg noodles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KADELL22"
},
"reviewBody": "This was yummy! Just like I remember Mom making. I used diced tomatoes instead and added 1 can tomato sauce to make extra \"gravy\" for putting over mashed potatoes. My Mom taught me that a pinch of sugar takes the bitterness out of the sauce. Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We must have made this wrong! The end result was a mushy pile of meat and onions. The flavor was a little bland. We'll have to try again with some additional spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alan Hollister"
},
"reviewBody": "thought this was just so-so. It was a little sweet for my taste and I had added cayenne pepper. I was only able to use 2 peppers and 2 onions as the crockpot was full, even though it's a big one. doubt I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie H"
},
"reviewBody": "A keeper! I used the frozen \"seasoning mix\" (onions, celery, etc.) for the onion and frozen multi-colored pepper strips (a handful of each on each layer) but stuck to the rest of the recipe and served it over a bed of sticky rice. The family was a little scared at first but after the first bite it was gone - even the 3-yr. old loved it! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peach822"
},
"reviewBody": "Not sure why it is called easy and quick. It is a slow cooker recipe. It's pretty good. I added two beef bouillon cubes to give it a little body."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LONGTIMEDOMER"
},
"reviewBody": "Quick and easy to prepare, and like the author I added seasoning that I prefer. Must have been good, because I went back for seconds and there were none."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Crauthers"
},
"reviewBody": "Wonderful! Quick and easy, great over brown rice. I also added mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azdadof5"
},
"reviewBody": "This is my recipe, so I won't be pompass and rave about it here! I just wanted to mention, the paprika was just a slight suggestion in my submitte drecipe. I typically use a lot of seasonings in the flour... Mrs. Dash, lemon pepper, garlis salt, etc. have fun with it! Also, The longer it's cooked in the slow cooker, the better - for GOOD steakes 8 hours is the minimum! Also - it should read 2-3 onions and 2-3 peppers - the more the better! Enjoy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/74352/easy-and-quick-swiss-steak/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17320/main-dish/beef/swiss-steak/",
"name": "Swiss Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/74352/easy-and-quick-swiss-steak/",
"name": "Easy and Quick Swiss Steak"
}
}
]
}
}
, "about": [
]
}
]