				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Eggless Pasta"
,"datePublished": "1999-08-11T17:21:59.000-04:00"
,"dateModified": "2022-10-31T15:57:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Webby"
,"url": "https://www.allrecipes.com/cook/24329240"
}
]
,"description": "This eggless pasta recipe is easy to make at home with just three ingredients. It&#39;s sure to be a favorite for anyone on a low-cholesterol or vegan diet."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/j3TrN6gKf41aP-jjiCcCtIKd38Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7981764-1bd31a5873174b5bbd663a6eb2a03b38.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1932258290001",
"description": "See how to make homemade pasta without using eggs!",
"duration": "PT5M34S",
"name": "Eggless Pasta",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/b5cf5cb9-c9a6-4984-a358-9ff1d85b0192/0e54ed68-f1b5-4fe8-99f7-d18493948878/1280x720/match/image.jpg",
"uploadDate": "2021-07-13T08:44:22.962-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Eggless Pasta"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "60"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "301 kcal"
,"carbohydrateContent": "61 g"
,"fiberContent": "3 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "292 mg"
,"sugarContent": "2 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"2 cups semolina flour",
"0.5 teaspoon salt",
"0.5 cup warm water, or more as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix flour and salt together in a large bowl. Add warm water and stir to make a stiff dough; add more water if dough seems too dry."
} ,{
"@type": "HowToStep"
,"text": "Pat dough into a ball and turn out onto a lightly floured surface. Knead for 10 to 15 minutes. Cover and let rest for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Working with 1/4 of the dough at a time and keeping the rest covered to prevent it from drying out, roll dough by hand to a thickness of 1/16 inch. If using a pasta machine, stop at the third to the last setting. Cut pasta into desired shapes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/j3TrN6gKf41aP-jjiCcCtIKd38Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7981764-1bd31a5873174b5bbd663a6eb2a03b38.jpg"
}
]
,"text": "Bring a large pot of lightly salted water to a boil. Cook pasta in the boiling water until tender yet firm to the bite, 3 to 5 minutes. Drain."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika"
},
"reviewBody": "I had to add more water, and oil and garlic like someone suggested, some turmeric for color out came out delicious! A great alternative to egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I was really impressed with this recipe. Follow the directions for rolling out and resting, and it will come out. A couple days later I made the recipe WITH eggs, and quite frankly, I thought this one was better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherise Castillo"
},
"reviewBody": "Easy and delicious! I always have to double this recipe because so good in Chicken Noodle Soup. If you double it, use closer to 2 and 1/4 cups of water and then add more by teaspoon if you need to, until reaching the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin L"
},
"reviewBody": "I just made the dough and I had to add almost a whole cup of water instead of 1/2 cup. Not sure if my house is dry maybe that’s why it took more water none the less it’s a nice pliable dough. So far so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traycee1234"
},
"reviewBody": "I found this pasta dough to be easy to work with. I added olive oil to avoid dough being too dry. Rolled out and cutting with my kitchen aide attachments made it fun. I love making my own pasta! Thanks for the recipe as I will use this often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dale Muckerman"
},
"reviewBody": "Pasta came out mushy even though I gave it plenty of drying time. I don't think it should cook as long as the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nicholas Fagerlid"
},
"reviewBody": "Please note that you may need more water then the recipie calls for - we were using Red Mill Semolina and needed a whole 2 cups to get it to the proper consistancy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jasmine Connor"
},
"reviewBody": "Recipe twas perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Morton"
},
"reviewBody": "They're fun and easy to make! I usually switch out the water for soy or almond milk and add in some ground flax seed to make them an even more nutritional dish. Have fun making this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NoRegretzkys96"
},
"reviewBody": "Needed a little bit more water but it turned out great! Just made fettuccini alfredo for lunch with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Bauser"
},
"reviewBody": "Made this using my Kitchen Aide with pasta attachment. Came out awesome! Next time I'll try adding some herbs as others have done to give it some extra flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veggiemomma"
},
"reviewBody": "I made this pasta with Semolina flour and added about 1 Tbsp. of EVOO, some garlic powder and a dash of Italian seasonings and a little bit of salt &amp; a few grinds of fresh black pepper, and added a frozen cube of basil (defrosted), mixed it up in my Kitchenaid stand mixer, let it rest in frig for a half hour wrapped up, then took it out and kneaded it, then ran it through my Kitchenaid mixer/ spaghetti attachment, starting on #1, #2, #3 then lastly setting #4, then let it hang dry for 25 min, then cooked it in batches for 45 seconds in boiling water. I have to say, this turned out fabulous!!! (I also doubled the recipe) After boiling the pasta, I had some extras that I saved, and it tasted great the next day too. I used my homemade marinara sauce on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle"
},
"reviewBody": "Great basic pasta. Not a ton of flavor, but it is a basic recipe after all. Using olive oil helps a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oundrea Youngblood"
},
"reviewBody": "This is a great base recipe idea. I used a gluten-free flour blend, added olive oil, and Italian seasonings on our most recent meal with this recipe. Great ideas are here in the comments such as letting dry for a few min. before cooking and adding garlic powder. I have used garbanzo bean flour in the past as well. Thank you for the recipe and all the comments. (I also used my kitchen aid mixer and pasta attachments.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "uncleray"
},
"reviewBody": "The pasta seemed to turn out fine. I added some EVOO and Italian seasoning. Was so excited while cutting the fettuccini that I forgot that I needed a drying rack in a hurry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miscibility"
},
"reviewBody": "Made this a few weeks back to make agnolotti with homemade ricotta, spinach, mushrooms, garlic and caramelized onion. It was easy and worked fantastic for the dish. Great egg-less pasta recipe. Molte grazie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy "
},
"reviewBody": "I used this recipe to make noodles for chicken noodle soup. Everyone raved about it, and loved it much more than my usual egg noodle recipe. I want to buy a pasta attachment and try my hand at making my own spaghetti now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "This worked out really well, but I ended up using twice as much water as what was called for. I doubled the recipe - 4 cups flour and 2 1/2 cups water. The dough was really easy to work with - I made raviolis with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lenny B"
},
"reviewBody": "I added 1 tsp EVO and about 8 shakes of Italian seasoning as recommended by other reviewers. I also use a couple of tablespoons of whole wheat flour, since I didn't have enough semolina on hand. The texture was good, so I'll make these again. I think I will leave out the olive oil, add more Italian seasoning and a little more salt. I did rinse the fettucini (I know! I know!), because the flour I used to keep the noodles from sticking as I cranked them out cooked up a little gooey. And I don't need the extra carbs. I only went down to setting #2 on my pasta machine, and I think that was a good decision."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carreenie"
},
"reviewBody": "LOVE LOVE LOVE these. So easy and everyone thinks they taste great. Can't go wrong. We do add one tbsp oil and a bit more water, but wonderful noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fifi"
},
"reviewBody": "I wanted to edit my original post but couldn't so am adding another. I still think this recipe is great and even made some pasta with the Kitchen Aid extruder very successfully. I add 1 tbs of olive oil plus an extra 1/4 cup of water but I think I should try and cut down on the water. I am going to try with less water as with the extruder I think the pasta needs to be dryer. I posted a picture of large macaroni made with the extruder. I also made some bucatini. It was also fab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JP"
},
"reviewBody": "This was very good. I made as stated for a veggie lo mein recipe, but next time I will add some flavorings to the dough. As another review stated, I also had to add quite a bit more water than it said to. Probably because of where I live, it is very dry. Oh, I ran this through my new KitchenAid pasta roller and angel hair pasta cutter and it worked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "House of Aqua"
},
"reviewBody": "Overall this was a great recipe. I made a full batch and the only hitch was it was dry and I needed to add extra water and I also added some olive oil as well. It finally stopped crumbling and came together nicely after requiring additional liquids. I had some frozen basil cubes from Trader Joes than I mixed into the pasta while kneading. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Very good and very easy! Easy for pasta from scratch, that is. ;) I halved the recipe for a small pasta dish I was making for my husband and I and used half wheat flour and half all-purpose flour, and about a tsp of dried basil and it made for great pasta. After I rolled out the pieces, I folded them in half lightly, cut noodles and hung them on hangers to dry for a bit until I was ready to cook them. They cooked up perfectly! I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamaRoja"
},
"reviewBody": "I recently transitioned to a vegan diet and pasta was one of the hardest things to give up! I love this recipe. I replaced a bit of the flour with a couple of tablespoons of ground flax seed and followed some suggestions to add Olive Oil and herbs. It was phenomenal! My kids (who have struggled with the vegan thing) couldn't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C A Jones"
},
"reviewBody": "I will be making this a lot. I loved the texture of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gia"
},
"reviewBody": "it was ok... It was really gummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rljw1"
},
"reviewBody": "VERY GOOD RECIPE. I ADDED ITALIAN SEASONINGS TO THE DOUGH. mY LITTLE GIRL WHO IS ALLERGIC TO EGGS LOVES THESE NOODLES."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "VERY GOOD RECIPE. I ADDED ITALIAN SEASONINGS TO THE DOUGH. mY LITTLE GIRL WHO IS ALLERGIC TO EGGS LOVES THESE NOODLES."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "514marthajean"
},
"reviewBody": "this is the best recipe for making fresh pasta. Sometimes I add liqufied spinach instead of the water...superdelicious and nutritious. I make it in my Kitchen Aid Pasta press...it`s sooooo easy! Also, I do add about 1 tsp of olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JFW"
},
"reviewBody": "very good recipe made it with semolina/durham wheat flour i found the 1/2 cup water is far less then needed I added water a tbsp. at a time as it was mixing in my stand mixer. My husband really loves these noodles and since he is a heart patient they are not bad for him"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilsoapboxx"
},
"reviewBody": "Recipe was so easy, and tasted great! My 2 young children were happy that they could help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shuki"
},
"reviewBody": "This is the best fresh pasta recipe I've found so far. I tried to recreate the pasta taste that I had when I was in Italy, and this recipe is what does it. The biggest secret that I didn't figure out until my third batch of pasta is to let it dry before you cook it! If you cook the pasta right after you cut it it will be too soggy and soft. However if you let it dry for 10-20 minutes (until dry but not flaky) you can make al dente pasta after about 45 seconds of cooking. I also used a pasta machine with this and it allowed me to roll out very thin pasta very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good egg-free recipe. Used half semolina and half white whole wheat flour. Used the dough cycle of my bread maker to do the kneading work. Looking forward to trying with some vegetable paste as recommended by another reviewer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "birdwatcher"
},
"reviewBody": "Very good. Turned out purfect 1st time. I used kitchen aid attachment for the grinder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Apricot Andie Mora"
},
"reviewBody": "This is so easy! I just added about 1/2 teaspoon of olive oil to it and the texture came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "howcouldiknow"
},
"reviewBody": "Easy and accurate. Tried the first time with whole wheat which worked but was a little to o chewy and much harder to work with. Then i went out and bought semolina flour. LIKE NIGHT AND DAY! Semolina flour is a pleasure to work with, pretty much instantly a nice uniform dough. I rolled mine out very thinly and cut them into squares, then filled them with ricotta and folded them into tortellini. Actually much easier than you would think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DancingBear6"
},
"reviewBody": "I used half whole wheat flour and half white and it worked very nicely. Great recipe for those of us with egg allergies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whitney Ford"
},
"reviewBody": "Very easy. I used wheat flour since that is what I had on hand and it still worked after I adjusted the ratio of flour and water a bit. I also added orageno for flavor and a bit of olive oil to keep it from sticking. Instead of cutting it into strips, I used a very small cookie cutter to make shaped pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monk Holio"
},
"reviewBody": "Used this recipe for a project with my son. I am alergic to eggs and he knows it's hard to get fresh pasta that does not have eggs in them. Although it took a bit of time to get the hard part done we both LOVED the results. Heck my oldest son actually ate a bunch of the dough before it was cooked because he thought it was yummy. The only thing different we did was add some Extra Virgin Olive oil and a lil bit of garlic. Overall a great recipe and fun to boot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good basic, eggless recipe. I keep concentrated vegetable pastes in my freezer that I make myself from scraps. I made this recipe with 1/3 cup water and two tablespoons of sundried tomato paste, and also added two teaspoons of olive oil. I dressed the pasta with a very light cheese sauce made with light cream, romano, and nutmeg, and topped with a spinach and walnut sauce. This was a very good dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Ercolini"
},
"reviewBody": "Great recipe for those (like me) can't stomach the heaviness of egg pasta. I added 1 Tbls garlic powder to the flour before adding the liquid. Also I blended 5 Tbls fresh basil and 3/4 c fresh leaf spinach in the water. Next time I will decrease to water content when using the basil and spinach cause I had to add more flour to the dough to get it the right consistancy. I made ravioli stuffed with salmon, cottage cheese and green onion and they were fantastic! My boyfriend ate the leftovers COLD the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic - to finally find egg free pasta dough I can make at home. Really impressed - well worth a try guys."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Adding a bit or olive oil helps - and for those who feel that this doesn't have enough flavour, adding some herbs of your choice helps (reconstitute dry basil in the warm water for example).\r\n\r\nMany parts of italy never use eggs for their pasta, and you can also use this method with potatoes and flour to make Gnocchi or Spaetzle of a sort...\r\n\r\nIt's good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SilvrGhost"
},
"reviewBody": "Sticks together easily. But not bad for eggless"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12044/eggless-pasta/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12044/eggless-pasta/",
"name": "Eggless Pasta"
}
}
]
}
}
, "about": [
]
}
]