				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Eggplant Parmesan For the Slow Cooker"
,"datePublished": "2011-01-07T22:34:44.000-05:00"
,"dateModified": "2011-01-07T22:34:44.000-05:00"
,"author": [
{"@type": "Person"
,"name": "jboettcher2"
,"url": "https://www.allrecipes.com/cook/5752296"
}
]
,"description": "Make a big batch of eggplant Parmesan in your slow cooker and dinner will be waiting when you get home. No need to heat up your kitchen baking in an oven."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/35HFOtOIXaepwUpvTYLTko9m5sM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2432986-eggplant-parmesan-for-the-slow-cooker-Allrecipes-Magazine-4x3-1-4c537ec84ba447468e42d313bede765d.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Eggplant Parmesan For the Slow Cooker"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "93"
}
,"cookTime": "PT300M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "401 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "90 mg"
,"fiberContent": "13 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1870 mg"
,"sugarContent": "17 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 eggplant, peeled and cut into 1/2-inch slices",
"1 tablespoon salt, or as needed",
"1 cup extra-virgin olive oil, or as needed",
"2 eggs",
"0.33333334326744 cup water",
"3 tablespoons all-purpose flour",
"0.33333334326744 cup seasoned bread crumbs",
"0.5 cup grated Parmesan cheese",
"1 (32 ounce) jar prepared marinara sauce",
"1 (16 ounce) package mozzarella cheese, sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place eggplant slices in a large bowl in layers, sprinkling each layer with salt. Let stand for 30 minutes to drain. Rinse and dry on paper towels."
} ,{
"@type": "HowToStep"
,"text": "Heat olive oil in a large skillet over medium heat. Whisk eggs with water and flour until smooth. Dip eggplant slices in batter and fry in the hot oil until golden brown, working in batches of 2 to 3 slices at a time."
} ,{
"@type": "HowToStep"
,"text": "Mix seasoned bread crumbs with Parmesan cheese in a bowl. Place 1/4 of the eggplant slices into a slow cooker and top with 1/4 of the crumbs, 1/4 of the marinara sauce, and 1/4 of the mozzarella cheese. Repeat layers three more times."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on Low until tender and flavors have blended, 4 to 5 hours."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT330M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell"
},
"reviewBody": "Fast, easy, very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kat"
},
"reviewBody": "Like many of the other reviewer‘s, I skipped step two and did not fry the eggplant before adding to the crockpot. I was pleasantly surprised at how good it turned out. It was easy, delicious and I especially liked that I didn’t have to go through the trouble of frying the eggplant. That’s the part that I dislike the most when making eggplant Parmesan. It definitely wasn’t the same, it wasn’t crispy but after you put sauce and cheese on it it generally doesn’t stay crispy anyways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curly"
},
"reviewBody": "This came out so well! I wouldn’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ginger's Food"
},
"reviewBody": "The BEST flavor - amazing. I only wanted it a little crisper - which won't happen in a slow cooker. I've always hated eggplant, so in this COVID world, we are challenging ourselves to master food we never liked. This recipe did it! We are buying more eggplant and trying it with breaded eggplant and less sauce to see if we can have it less mushy. The flavor is spectacular no matter what the texture is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "haddick13"
},
"reviewBody": "Fun and easy dish to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "The favor was pretty good but the cook time was off. I used only one eggplant but 24oz sauce. The BF likes cheesy Italian dishes so I used 2 cups of Mozzarella and even added a half a cup Ricotta for fun. I skipped the frying per reviews, but did bread the sliced eggplant and even added a bit of extra crumb mixture to the top of each slice in the layers. Four hours on low and an hour and a half on warm, because I got home late, the eggplant were still firm...editable, but firm. So, longer cook time for me, definitely not the traditional version, but a good hot meal to come home to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Schwab"
},
"reviewBody": "Add ground up pistachios to the bread crumbs and add ricotta between the layers, but top with the mozzarella/provolone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Rizzo"
},
"reviewBody": "Absolutely delicious! This was my first time making Eggplant Parmesan in the crockpot. I will always use this recipe. The eggplant is so tender that you don’t need a knife to cut it. For the sauce I used Mids Three Cheese, have not found anything comparable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bebe"
},
"reviewBody": "This was wonderful! I only used one good size eggplant , can’t imagine 4. Marinara was 24 oz I think and all other ingredients unchanged. I did not peel the eggplant. Cooked on low for about 4.5 hours. Eggplant is one of my favorite vegetables so good recipes are always appreciated. Will most definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "monterrapin"
},
"reviewBody": "1st off... I wanna meet the slow cooker that can fit 4 eggplants!\nSecondly, I think the cook time is a bit too long...came out a little dry. Of course my 4 level Rival slow cooker really doesn't go that low. All-in-all I was pretty happy with the result. I'll make it again &amp; tweek it a smig!\n\nPeeled eggplant vs. non-peeled eggplant?\nI think I like em better with the skin on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrodjared"
},
"reviewBody": "It’s a hit every time! We make a vegan version by using an egg substitute (bananas, flax seed and a bit of water in a blender). We then bake the eggplant at 350 instead of frying for 15-20 minutes and proceed with rest of the recipe. Substitute the cheeses for your favorite non-dairy cheese and you’re good to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slow Cooker Bill"
},
"reviewBody": "Just love that I don't have to fry or bake the eggplant. Was a bit time consuming but overall It tasted great and really soft to cut into. This will be my new way to make eggplant Parmesan. Thanks for the post. Slow Cooker Bill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Bernhard Smith"
},
"reviewBody": "What a good idea! I have a small slow cooker, so I had to adjust for that. Oh, I didn't have any mozzarella, so I used a shredded Mexican cheese blend I had on hand. I didn't fry it, either. I didn't intend to change this recipe, but I used what I had on hand. I think it would be good as written, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Blake Wedekind"
},
"reviewBody": "Didn't turn out well. Not a good recipe for the crockpot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saler Axel"
},
"reviewBody": "So I did a little tweak because I was low on time. And honestly don’t think it changed a thing. The dish was yummy! I used the frozen Eggplant breaded Cutlets from Trader Joe’s. Instead of doing the eggplant prep and breading as directed in the recipe. I stacked it as directed in the recipe and sprinkled the parmigiana, sauce and mozzarella. It turned out great! The cutlets saved me on a day O"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dotti1"
},
"reviewBody": "Followed instructions it came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Therese M"
},
"reviewBody": "I was going to give it 4 1/2 stars but don't know how to do that. For me all that was missing was a little heat and some basil. Since I was cooking for a group, I put some chili flakes in a little bowl on the table and that seemed to satisfy everyone. I added a lot of finely chopped basil to the top of the EP before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tangy"
},
"reviewBody": "Really enjoyed this dish. Decided to bake eggplant instead of frying. After slicing eggplant I dipped in egg and thenSeasoned breadcrumbs placed in oven at 400. Till crispy.Then assembled as recipe instructed I would definitely make again actually a lot easier than baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Wisefield Schwab"
},
"reviewBody": "I made this for my family. It was delicious. Prep time was more like an hour. I would add a Splenda packet or two and more marinara sauce, I can’t wait to make it again. I might try to make it without skinning the eggplant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Millicent Hollins"
},
"reviewBody": "This is very good with some slight changes. I did not fry the eggplant the second time. I baked it. The Frying is too much oil. Also, do not place it in the slow cooker on high. The high setting will burn the food. Finally add about one half cup olive oil and chopped yellow onion into the sauce, to add back more flavor when the eggplant is baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Hardy"
},
"reviewBody": "This was so good! But instead of using a crockpot I put it in a 350°F oven for 45 min. Mmmmm.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "My man loved it and I thought it was pretty darn tasty. Used my own homemade marinara sauce rather than jarred and that made the dish. However, I will cut the recipe in half next time. After three days of leftovers, we were both ready to say ciao for a few months."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "busymom"
},
"reviewBody": "This was absolutely the best eggplant pam ever!!! Made it exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn "
},
"reviewBody": "This was a trial run. The preparation took way too long but the end result was delicious. I think next time will come out better because I'll know what I'm doing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley P"
},
"reviewBody": "Pretty good, a little too salty for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Rosencrants"
},
"reviewBody": "This is now my go to for eggplant parmy. Really turned out great and the only thing I added was some fennel. I never just dump into the crockpot and go but could see doing it with this. I did use a crockpot liner so clean up was nothing. I would suspect that without it there would be a problem. Thanks for this. Definite repeater."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommalou"
},
"reviewBody": "Made this just like it says and loved it!! So easy!! It's one I will make again for sure. Even the leftovers were yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Lynn Piraino"
},
"reviewBody": "This was my first attempt ever at anything eggplant. It came out fantastic....my Italian husband and his brother LOVED it!. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Wiley"
},
"reviewBody": "I also skipped the frying part and went straight to the layering. It was very easy and tasty and calorie friendly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "O'Paton"
},
"reviewBody": "This was a hit--even with my picky 5 year old. As other reviewers said, I didn't fry the eggplant. I did however, coat the eggplant slices in the bread crumbs and parmigiana. The residual dampness on the eggplant held a nice dusting, then I sprinkled the remainder on top of the dish towards the end of cooking. Delish! \nAs an aside for others who may face last minute plan changes: the day I intended to make this, I peeled and sliced the eggplant, and started it sweating--then plans changed. (arg) SO, I covered the pans with paper towel and when I got home later I rinsed the salt from each of the slices, rung them dry, then layered them between sheets of paper towel in a tupperware container and refrigerated it. Two days later I made this recipe and the eggplant was fine--possibly even better since it had more time to sweat.\nAll in all, definitely a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Lee"
},
"reviewBody": "Amazing and added sausage, family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eileen Turner"
},
"reviewBody": "Terrific flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Pasternak"
},
"reviewBody": "I made this the other night and it was delicious! I didn't cut the eggplant right but it still came out amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fred"
},
"reviewBody": "Watch the time in the slow cooker on this recipe. It looked about perfect after three hours on low in my slow cooker, but I didn't eat it until it had been in the cooker for 6 hours. It was very tasty, but the eggplant had pretty much turned to mush by then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Mendoza"
},
"reviewBody": "I followed others' suggestions and just layered the eggplant with the cheese &amp; breadcrumbs... It was convenient, but I thought it was definitely missing the crunch of real fried eggplant. Won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Very delicious! I had to cook it on high because of time factor. Was even great leftover!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "This was wonderful, next time I will add some garlic. My son went back for seconds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nik Dudly"
},
"reviewBody": "LOVE THIS RECIPE!!! I have passed it along to my mother and coworkers. SUBS- I subbed mozzarella for provolone, browned ground turkey and added to sauce, didn't have bread crumbs so I crushed a package of croutons. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "Please be aware that the cooking time may be different for your particular slow cooker. Mine was well done in 2 ½ hours. I used my large slow cooker and made three layers. The only change I made was to add only 1 tablespoon of flour to the egg mixture, and after dipping the eggplant slices, I coated them in the bread crumb mixture before frying them. It’s more of a habit than anything else. After cooking there is a lot of moisture on the cover, so I recommend covering the slow cooker with a clean dish towel before replacing the cover to absorb the moisture. The results are a delicious, soft eggplant parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ArnelT77"
},
"reviewBody": "Great recipe and easy to make. I seasoned the flour mixture to give the eggplant some extra flavor. It was fabulous. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Perkey"
},
"reviewBody": "So easy. I loved it. Made a couple small mods\nI used 1 eggplant since i wasnt cooking for 40 people, also combined flour and bread crumbs then fried.\nit was fantastic. I already recommended to my sister"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex"
},
"reviewBody": "I just made this for my family and we LOVE it!! I did change it up just a little, however...\n\n1) I did not fry the eggplant first, eliminating the need for water, oil, eggs, and flour.\n\n2) I used 2/3 cups bread crumbs, and 3/4 cups Parmesan cheese - AND I added a hearty pinch of salt to the mixture.\n\n3) I followed the suggestion of another reviewer and put the eggplant in raw, spraying each layer to get the bread crumbs to stick.\n\n\n\nIn the future, I will modify my version a little...\n\n1) I will use far less mozzarella cheese - I eyeballed the layers, and definitely eyeballed too much!\n\n2) I will not add extra salt - everything else has more than enough.\n\n3) I will add a dash or two of garlic to the bread crumb mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chaya"
},
"reviewBody": "These were awesome. I substituted ground beef with ground turkey. I followed everything else exactly. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cheyennegirl"
},
"reviewBody": "Don't know what happened as I followed directions exactly but dish was mush! Cooked in slow cooker for 4.5 hours. Have made eggplant parmesan many times in the oven and never experienced this. Flavor was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shyanna Hayes"
},
"reviewBody": "It was my first time having eggplant. I didn't really like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "chrolivi"
},
"reviewBody": "This was not for me, I think I'll stick with the breaded, baked in the oven version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EleganceKat"
},
"reviewBody": "Easy to follow and tasted really good. I didn't have seasoned bread crumbs, which was a plus because I added my own seasonings (Italian seasoning and cayenne pepper)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela C."
},
"reviewBody": "I made this for dinner this evening and it was a hit. I cook for a picky 16 year-old who hates most vegetables and loved this so much she wants to make a \"sloppy joe\" sandwich out of the leftovers for lunch tomorrow. I followed the recipe exactly for 4 servings. Great recipe and will definitely cook it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmarkr1982"
},
"reviewBody": "Followed recipe exactly.....very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Young"
},
"reviewBody": "Loved it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorissa"
},
"reviewBody": "I did not fry the eggplant I mixed oil egg and breading then layered sauce, eggplant, breading mix sauce cheese, etc.. and coocked my crockpot is new and cooks faster so it only took 2.5 hrs (since I didn't fry the eggplant 1st)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wapps"
},
"reviewBody": "Husband liked this too, egg plant was a bit mushy but was still good. Would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Imaaggie"
},
"reviewBody": "Easy and delicious, my family of three (my husband, 17 year old son and I) absolutely loved it. I followed the recipe with three revisions: cut the cooking time to 2 hours, used low fat mozzarella slices vs Parmesan (1/2 slice per eggplant piece) and used Arrabbiata sauce vs Marinara to add spice. I agree that frying may be unnecessary and plan to try skipping that step next time. Serve with a green salad and hot bread, what a great meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "retta"
},
"reviewBody": "It came out amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Easy and delicious recipe! To make it healthier at the suggestion of another review, I baked the breaded eggplant slices @ 350 degrees for 5 minutes a side before I started slow cooking everything. I let this sit on low in my slow cooker for about 9 hours and it just fell apart in my mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn Newton"
},
"reviewBody": "I, too, didnt fry the eggplant prior to putting in the crockpot. I did nuke it in the microwave until soft, though. This was good. I think next time I will use shredded mozza instead of sliced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRACYCARR920"
},
"reviewBody": "Eggplant parm is my favorite food so I am super picky about it. My husband, kids and I all loved this recipe. I added sauce to the bottom of my slow cooker before the first layer of eggplant and it didn't burn at all. I can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAWANNAM"
},
"reviewBody": "This was a huge hit! Made it exactly as written, but I really only needed three eggplant for my cooker. On low for 4-5 hours was perfect. I will try it without frying as someone else did, but loved the finished product!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WhatzforDinner"
},
"reviewBody": "The family is not big eggplant fans. A friend gave me some eggplant - so I tried this. HUGE hit. Wonderful recipe - easy and delicious. Four picky kids ate it. Awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patricia Tersigni"
},
"reviewBody": "I just finished making this recipe. It was easy but a little time consuming. I tasted the eggplant after I fried it and it was better than fried eggplant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Fillingim"
},
"reviewBody": "Easy and delish! I skipped over the first steps, and just went straight for the layering. I'm sure skipping over the whole frying process might have killed some of the flavor, but I couldn't tell, and it was much healthier sans the oil. I just cut my eggplant into slices, sprayed the crockpot with PAM (which I did after every layer of eggplant to make the breadcrumbs stick without using fat) and started layering. I baked on HIGH 3 hours (since my eggplant went in totally raw), and it was done just right. I will use this recipe again, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Staritz"
},
"reviewBody": "Pretty good. Way to difficult to fry the eggplant. It would be alot better to bake them. See Eggplant Parmasean II on All Recipes to see how to bake them. They are mush anyway after they are in the crock pot (not crisp at all), so no reason to fry. Used 2 large eggplants, 1.5 bottles of spaghetti sauce, and cooked it on Hi for 2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glennaj23"
},
"reviewBody": "I made this recipe this evening and it was a hit. Even my picky husband liked it and said he would eat it again. I followed it exactly with only two changes. I added a bit of cooked mild italian sausage for more protein and an additional jar of sauce. As did other reviewers, I found that this cooked very quickly and the timing should be no more than two hours at most. I plan on keeping this in my family recipe book as a go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ambientstorm"
},
"reviewBody": "Better than Provino's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Idstrom Chichelli"
},
"reviewBody": "This was delicious! Made exactly as written expect I didn't peel the eggplant. One of the best recipes I've found on this website!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KingToros"
},
"reviewBody": "This is the only recipe I have made twice in my slow cooker. (I've only had it a month). I use italian sausage sauce to add a bit of protein to the dish, and two jars instead of one. Comes out amazing every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Came out Great and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "canajo"
},
"reviewBody": "I made this today and it was amazing. So simple and one of the best eggplant parmesan dishes I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darline Wray"
},
"reviewBody": "My husband is italian and he loved it. Said it was one of the best eggplant parmesan's he has eaten. I did not have any marinara sauce, so I used a thick spagetti sauce. Still tasted wonderful. All my friends want this recipe. It is a huge hit ! Will most cook this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Robin Carpenter"
},
"reviewBody": "Warning, if your crock pot does not have a low, you may end up burning it if you leave it for 4-5 hrs. Mine was in for 4, I left and when I came back it was burnt to a crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweets"
},
"reviewBody": "this was easy to make,and is the best eggplant recipe i have used so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy2day"
},
"reviewBody": "This recipe was not only easy but delicious as well! All 6 of my children ages 3-12 ate it and enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "I made this last night for a get together. I used fresh white eggplant from my garden and used homemade sauce. We used it for eggplant parm sandwiches!It was nice and easy to make and turned out great with everything else I was making! I will make it again. Glad I could be the 1st review! Thanks jboettcher2!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223360/eggplant-parmesan-for-the-slow-cooker/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/22472/main-dish/vegetable-main-dishes/",
"name": "Vegetable Main Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17635/main-dish/vegetable-main-dishes/eggplant-parmesan/",
"name": "Eggplant Parmesan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223360/eggplant-parmesan-for-the-slow-cooker/",
"name": "Eggplant Parmesan For the Slow Cooker"
}
}
]
}
}
, "about": [
]
}
]