				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Eggplant Parmesan Casserole"
,"datePublished": "2019-10-10T00:51:29.000-04:00"
,"dateModified": "2021-11-02T13:18:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Use Chef John&#39;s simple techniques to make an eggplant casserole that has all the flavor and texture of the traditional version with fewer calories and a lot less oil."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QBKv11zg65E45pz7IHzirydACSw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5629389-571087fb936240eb8ddbb99cc0e2346e.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2842259019001",
"description": "A delicious eggplant Parmesan with way fewer calories.",
"duration": "PT5M11S",
"name": "Eggplant Parmesan Casserole",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9d7fed7c-8bc4-46cd-a176-7851688558a2/998c07ee-3977-47be-90ce-acd6ae0665a8/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T12:44:09.835-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Eggplant Parmesan Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "180"
}
,"cookTime": "PT65M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "397 kcal"
,"carbohydrateContent": "41 g"
,"cholesterolContent": "20 mg"
,"fiberContent": "12 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "906 mg"
,"sugarContent": "17 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 large eggplants",
"2 tablespoons olive oil",
"1 pinch salt, or as needed",
"1 tablespoon olive oil",
"2 cloves garlic, sliced",
"0.5 teaspoon red pepper flakes",
"3 cups prepared marinara sauce",
"0.5 cup water, plus more as needed",
"0.75 cup ricotta cheese",
"0.5 cup grated Parmesan cheese",
"0.25 cup shredded pepperjack cheese",
"salt and freshly ground black pepper to taste",
"0.75 cup dry bread crumbs",
"0.5 cup grated Parmesan cheese",
"2 tablespoons olive oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cut 5 crosswise slices from center area of each eggplant, about 1/2-inch thick, to total 10 slices. Peel and dice remaining pieces of eggplant."
} ,{
"@type": "HowToStep"
,"text": "Heat 2 tablespoons olive oil in a large skillet over medium-high heat until oil is very hot. Sprinkle eggplant slices lightly with a pinch of salt and cook in hot skillet in batches until slightly softened, about 3 minutes per side. Set eggplant slices aside on paper towels."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 tablespoon olive oil in skillet and cook garlic for about 10 seconds; add diced eggplant and season with a pinch of salt and red pepper flakes. Saute until eggplant is softened, about 5 minutes. Pour in marinara sauce and water. Turn heat to medium-low and cook until eggplant is tender, about 15 minutes; stir occasionally. If sauce gets too thick, add a little more water."
} ,{
"@type": "HowToStep"
,"text": "Combine ricotta cheese, 1/2 cup Parmesan cheese, pepperjack cheese, a pinch of salt, and a pinch black pepper in a bowl until thoroughly combined. Spread about 2 tablespoons cheese mixture over each eggplant slice. Fold eggplant slices in half to enclose the cheese mixture."
} ,{
"@type": "HowToStep"
,"text": "Spread about half the sauce into an 8x8-inch baking dish. Lay folded eggplant slices in a single layer into the dish. Spread remaining sauce over eggplant slices."
} ,{
"@type": "HowToStep"
,"text": "Combine bread crumbs, 1/2 cup Parmesan cheese, and 2 tablespoons olive oil in a bowl; mix thoroughly. Spread crumb mixture over eggplant casserole."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QBKv11zg65E45pz7IHzirydACSw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5629389-571087fb936240eb8ddbb99cc0e2346e.jpg"
}
]
,"text": "Bake in the preheated oven until casserole is bubbling and crumbs are browned, 35 to 40 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Baumann"
},
"reviewBody": "This was delicious!! I don't typically cook with eggplant so was apprehensive about how it would turn out-- but no need to worry! My whole family enjoyed it and I now make it on a regular basis. Just know it took me twice as long to prepare than stated but worth every additional minute. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "I made this and it turned out great! I used small white eggplants from the garden and just whatever cheese I had in the fridge. I simmered the sauce longer because I had little-ones eating...we ate it up! Thank you for another variation to a great dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ritdyck"
},
"reviewBody": "My 👪 family totally loved it! They have requested I make it again for Sunday dinner, 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lori0821"
},
"reviewBody": "Absolutely delicious! And easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth Clingo"
},
"reviewBody": "It definitely was different , I like vegetables …. But this was totally not my next go to !!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dzinerdeb"
},
"reviewBody": "I love this recipe and have made it as written a few times. But today I made kind of a hybrid eggplant parm and chiles rellenos. I roasted, peeled and sliced two poblano chiles and put them inside the eggplant with the cheeses. I also made individual casseroles instead of one large one, and they only took about 25 minutes to bake. A great recipe to start with and a yummy hybrid, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shazycat"
},
"reviewBody": "Wow, my grocery list is growing by the video! I love Chef John! what a GREAT instructor! I can't wait to try all of your recipes .....Thank you very much\nCheryl"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmclassics"
},
"reviewBody": "We've made this twice. It was delicious, just as written. Well, Prego was too sweet, so I added a little garlic salt. My next batch used a marinara sauce without sweeteners, so no adjustment was necessary.\n\nMy tips have to do with being a new gardener. I read the wrong advice, and some of our eggplant was overripe and had turned bitter. After slicing the eggplant, I put it onto paper towels and salted both sides. Waited 30 minutes, and then rinsed the salt off. I even tasted the corners of a few slices after it was cooked. One eggplant was TOO bitter, so it was discarded. (New gardener.) \n\nWe loved it. It is now in our favorites. It was like lasagna without the noodles. I'm passing this recipe on to my vegetarian nephew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Pfaff"
},
"reviewBody": "We used fresh eggplants from our garden to make this. They were small so we didn't have slices quite as large or as much leftover eggplant for the sauce, but regardless, we both loved it! My boyfriend doesn't even really like eggplant but he gobbled it up. Thanks for a great low-calorie twist on the original!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlie T."
},
"reviewBody": "Having made and enjoyed many of Chef John's recipes, I have 2 pieces of advice: 1 watch the video, and 2, don't be afraid to make the recipe your own. I made this recipe as presented, and while it's not \"traditional\" eggplant parm, I found it delicious. I found the half-inch slices just right and easily bendable after being in a HOT pan. The sliced garlic added a wonderful layer of flavor as well. Fewer calories and great flavor make it a definite keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Desmond"
},
"reviewBody": "This was excellent! Even my meat loving husband said it was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BECKY300N"
},
"reviewBody": "I prepared as written. I made a rookie mistake and burned the garlic. Had to pick out the burnt pieces. But the finished product was so tasty. I used jarred marinara so I always add herbs to it. We really liked the dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy"
},
"reviewBody": "Best eggplant parmesan recipe ever! I love eggplant parmesan but always have a problem getting my breading to stay in tact. This completely resolves that issue. Absolutely delicious! I will make this again and again! So happy I found this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I made half a recipe and really loved it. I did make a few changes. My domestic partner is not a fan of meatless dishes, so I added about 3-4 ounces of browned ground beef to the marinara sauce. I also used only about half or two-thirds of the crumb topping, as I thought it would be too much for my taste. I consider the recipe a real winner because my partner who almost never comments on my new recipes other than to say I worked too hard on it said, \"This is really good!\" Next time I'd add some basil and oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracerx29"
},
"reviewBody": "This was amazing! My husband even went back for seconds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Kasz Willmarth"
},
"reviewBody": "I loved the concept of this recipe, making it healthier but still crunchy. I completely peeled both the eggplants, sprayed the circles with cooking spray and baked them all at once in a 425 degree oven to save time. I used a jar of Rao marinara and also added cremini mushrooms and a chopped onion to the sauce. I used ricotta and mozzarella, parmesan, an egg and nutmeg for the filling. It came out amazing!!! I love all the eggplant in this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rla007"
},
"reviewBody": "This recipe is amazing exactly as written, given you are using your own home made Marinara sauce or a good quality brand. The first time trying a new recipe I always follow directions before giving it my own twist. My family devoured this, my Meat and Potatoes husband and my vegetarian father alike, so now now I use 3 eggplants- 5 cups of Marina sauce- I double the cheese filling but still use the same amount of Bread crumbs for the topping to might it a little lighter ( I use 4-C Gluten free plain variety). Now that this has become one of my staples I decided to grill the eggplant tonight ( instead of frying, since eggplant does soak up so much oil- I seasoned with a dash of oregano, basil and garlic . My family didn't notice a the difference and it was easier too! By the way, I buy Aged Parmesan- and grate it fresh. Less preservatives- and this dish tastes very Farm to Table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Johnson"
},
"reviewBody": "The first time I made this was for my boyfriend’s grandparents (risky, I know). But we all loved it! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Terri Wolford Wearstler"
},
"reviewBody": "So sorry, but it was labor intensive, too salty. Won't keep recipe. I liked the idea of pan searing eggplant and not frying. I think it was too salty because of the parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SGTPEPER"
},
"reviewBody": "This is just unbelievable! I wouldn't change a thing. Simply amazing and was told I need to make it again, SOON!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sarahg"
},
"reviewBody": "It was great. A little bland but I will make again, maybe adding basil next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dkailburn"
},
"reviewBody": "This was absolutely fabulous. Made it just as written. So much easier than frying the eggplant, and healthier too. Next time I will attempt to use low or no fat cheeses. It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gaye"
},
"reviewBody": "It was great! So much easier than frying all that eggplant. L"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teddylupin"
},
"reviewBody": "I added mozzarella on top and baked for an additional 5 minutes. Great recipe otherwise!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "49AB"
},
"reviewBody": "Very good, I also did layer the eggplant, I would cut down on\nthe sauce, just a personal preference. I would also cut the\nbread crumbs down a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "Yummmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tia"
},
"reviewBody": "Didn't hold together well egg plant fell apart"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssmith"
},
"reviewBody": "This recipe was delicious! I added a little extra seasonings to my sauteed garlic and eggplant to enhance the flavor. I also switched the pepper jack cheese for mozzarella, no other changes and it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Fifield England"
},
"reviewBody": "Loved this. only thing I changed was that I made twice as much breadcrumbs. Chef John's recipes are the besr"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "Made this on Jan 9, 2020. Loved it. Next time will add more garlic and red wine to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allyssa"
},
"reviewBody": "This would get 5 stars, but it is a fair lot of work for what it is. Next time, try using a rich pre-made marinara sauce (still homemade, but used in a previous dish) to reduce the work. C gives this a 9* rating -- and toddlers loved it with spiral pasta. Because real parm cheese is hard to find/expensive, I used half salty cheese from market and used decent cheddar instead of pepper jack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Venus Morrison"
},
"reviewBody": "Followed recipe exactly!!It was really good and will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "addles"
},
"reviewBody": "This was my first go at eggplant. I adjusted for my family and added mushrooms, an onion, and pound of hamburger as well as doubling it. Instead of frying the sliced eggplant we dipped in egg then breadcrumbs and baked at 350 for 8 min per side. Next time we decided we would skin all the eggplant as we didn’t care for it. My mom, stepdad, kids, boyfriend everyone devoured this over a day. Everyone’s first time ever eating eggplant and they are already asking for it again tho it may be a bit. It took us way longer than the hour and 20 minutes stayed. Worth it though. Love love love"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CarolT"
},
"reviewBody": "I thought this recipe was really good. My first time ever eating eggplant and I was pleasantly surprised. I even had seconds. I did however use my own homemade meat sauce. I would definitely make this again. As always I suggest using a recipe as a guideline and tweaking it to your own liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracey Standley"
},
"reviewBody": "I followed recipe to the tee, but i also added an egg to ricotta mixture. We both really liked this recipe and will make it again. But the prep time was WAY off...about 45 mins?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "giraffe30082"
},
"reviewBody": "This is absolutely the best Italian style casserole. I had previously breaded and baked eggplant and homemade sauce with hamburger and sausage in it that I pulled from the freezer. That just amped it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stalo09"
},
"reviewBody": "Thank you for the delicious recipe:) My family loved it and we can’t wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Touchton"
},
"reviewBody": "My daughter brought home the biggest eggplant from a farmers market that I've ever seen. This recipe seemed a perfect way to use it. Sliced eggplant 1/4 inch thick and used cayenne and cajun seasoning since I was out of crushed pepper. it smelled Heavenly coming out of the oven and tastes like a lighter version of lasagna. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "muzic2myheart"
},
"reviewBody": "This was okay to me. I am not big on eggplant to begin with. I am trying to do more vegetarian options and it was worth making. I will probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maree Sweet"
},
"reviewBody": "I made mine a little differently, however, I kept to the original recipe. I just put the sauce as a base then I cut round slices of eggplant and put them over it, I also fried up onion, mushrooms and garlic and put that over the top of eggplant and ricotta cheese, then more sauce, parmesan and tasty cheese. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kecmt21"
},
"reviewBody": "Only changes I made were adding fresh basil leaves (about 15 finely chopped) into the cheese mixture and topping the cheese mixture with artichoke hearts. I used about 8 oz of hearts that I chopped and spread evenly on top of the cheese mixture. I was concerned it would be too much bread crumb topping but it wasn't...just delicious! Thanks Chef John!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gopal"
},
"reviewBody": "Excellent - Easy to make and liked that it is the healthy version!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George Mykulak"
},
"reviewBody": "Easy, quick, healthy as you want to make it.....and very tasty.\nI added some cooked Hamburg to the dish for the meat eaters in the house but that is clearly optional. Will definitely incorporate this into our meal plans!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Reimers"
},
"reviewBody": "This is a kinda time consuming recipe. But it's yummy! I thought it needed something more so I added ground beef to the marinara sauce. Also thought it a bit runny so made noodles and put over them. Good recipe. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "It was very delicious. Lesson learned, dont cut the eggplant to thick. Hard to fold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Susie"
},
"reviewBody": "I made the topping with gluten free panko, and used less than in recipe. Preparation took 45 minutes! I substituted fresh ricotta for the pepper jack cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Warren Pope"
},
"reviewBody": "I wouldn't change a thing. This recipe is perfect! I'm a big fan of Eggplant Parmesan, and I was intrigued by the thought of making it in a casserole. I wasn't disappointed, I'll be making this again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Treaseek"
},
"reviewBody": "So fun to make and absolutely delicious. I used a 9x13 casserole dish and Trader Joe’s marinara due to time constraints. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "This is the first ever dish I made with eggplant and I loved it! What's even better, is that it's meat-free!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "beverly"
},
"reviewBody": "Wasn’t sure I liked the crumbs on top as they were kind of mushy even tho they browned and for some reason it had too much juice! It took me forever to prep it about 2 hours! I was expecting it to be easy but it was not! Thus I rated it a 3."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bjw"
},
"reviewBody": "Will definitely make again! Excellent flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Very good. Needs more cheese. BTW it freezes well. Cook first then put in oven at 350 for an hour or so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulette Garrido"
},
"reviewBody": "This was terrific! Very easy. I know people make changes and usually I read the reviews before I make a recipe to check in. The only change I made was to add sliced mushrooms with the chopped up zucchini. The hardest, or most difficult part of this recipe, was to not eat the cooked slices of zucchini while I’m waiting for the other parts of the recipe to come together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dominique Tomei"
},
"reviewBody": "Big hit. I only had small Japanese eggplant, so didn't fold them. Stacked them instead. The breadcrumb topping is fantastic - will be using it in other dishes also!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Gordon"
},
"reviewBody": "I made this and it is one of my favorite dishes/ I made no changes to recipe. Splendid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashagang"
},
"reviewBody": "Oh wow! This has completely changed how I make eggplant Parmesan. It is so much better, easier and fewer calories. My husband usually has some issues with vegetarian meals, but he loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLC"
},
"reviewBody": "Very easy to make and true to prep / cook time. My family LOVED it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy K"
},
"reviewBody": "This recipe was delicious. The whole family loved it. The crispy breadcrumbs on the top are a good addition to this casserole. I substituted mozzarella cheese for the pepper jack. That was just a personal taste change and it worked well. This recipe is a keeper and one to share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GKG"
},
"reviewBody": "I actually made this as a larger batch since I had extra eggplant and my family loves eggplant. I have saved this recipe as it is fantastic! I also used a few additions I had in my frig and pantry, but the basic recipe is great as written, I hope your family enjoys it as much as our son did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keith Horn"
},
"reviewBody": "I really enjoyed this. Taste great. Only change it had to make was putting more pepper jack cheese on top of the crumbs. The crumb mixture was really dry near the end of cooking and was like loose sand. Even with that I still give it 5 stars because it tastes really great. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack Farrell"
},
"reviewBody": "This was fantastic as made! Next time in the sauce I’m going to add some oregano and Italian seasoning as suggested by other reviewers just to tweak to my personal taste. The recipe as written was delicious. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Fabiszewski"
},
"reviewBody": "We loved this recipe and I’ve made it twice now. I tweaked it a little by using two slices of eggplant with mixture in middle instead of taco technique and added fresh spinach to cheese mixture mad in between. It’s amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItsNotme"
},
"reviewBody": "Eggplant Parmesan Casserole !! love Parmesansss"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Banshee"
},
"reviewBody": "added extra onion, mushrooms and sauce. I also added a shy amount of Italian seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne Dorin"
},
"reviewBody": "This is easy to make and very tasty. I added a couple ounces of leftover roasted chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Perryman-Ford Copley"
},
"reviewBody": "LOVED this, easy well thought out directions and the flavor and textures make for a decadent yet healthier meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I made this one night looking for something easy and a little different for dinner. With some fresh Italian bread and a salad this was a hit with the family. Making this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Heller Griffith"
},
"reviewBody": "I made this recipe as I’m written...it was delicious!! I highly recommend!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melanie Keyes"
},
"reviewBody": "It's not vegetarian, as written. Parmesan cheese is not vegetarian..... So take out the parm and it's a vegetarian recipe. I added more of the italian seasonings and it turned out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carla VanderYacht"
},
"reviewBody": "Unfortunately, like many of your vegetarian recipes, this is not vegetarian. Cheese is made with rennet which is made from the lining of a calves stomach, an animal product. Only kosher cheese or one made from a plant based rennet should be considered vegetarian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Zink"
},
"reviewBody": "Delicious. We reduced red pepper by half cuz one of my kids is sensitive to spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonC"
},
"reviewBody": "We loved this recipe..and it was so simple to make...the crispy topping as soooo good.The only thing I wished I did differently would be to use my homemade spaghetti sauce. That would have made it over the top...Thank you for such a great recipe...I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nfoster"
},
"reviewBody": "I made half of this recipe for 4 of us and it was plenty. It is a real hit in our house. It is just spicy enough to make it seem very different for our usual eggplant parm. Really like the taco like slices and then the chopped in sauce. The ricotta is a lovely addition. It will be made many more times that is for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YaMi"
},
"reviewBody": "Thanks to Chef John. Another ten star dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Freedman"
},
"reviewBody": "Great recipe! Easier, less time, less oil.... than the conventional eggplant Parmesanthat I have been making for the past 40 years. \n My friends said how can you improve on “Perfect “ and I invited them for dinner and showed them how with this new recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "denise merlo"
},
"reviewBody": "Very good! I enjoy making casseroles and this one is now one of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "Made as is and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoraNAjsmama"
},
"reviewBody": "Very good recipe! It definitely takes longer then 15 min to prep, but definitely worth it. All I did differently was add more sauce and more cheese! Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry"
},
"reviewBody": "Did not have pepper jack cheese, used an Italian blend suggested by another reviewer. My recommendation to myself, not a big fan, substitute another cheese for half of the parmigiana cheese. Otherwise, the dish is very good; always glad to find something my wife likes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kat"
},
"reviewBody": "Yum. I felt like it needed a tiny bit less spice and a little bit less breadcrumbs. Maybe a little less sauce, but I typically don't like my pasta terribly saucy. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyKay"
},
"reviewBody": "Good recipe!!! Didnt miss the traditional breading on the slices of eggplant, just sautéed lightly in oil. \n( I used more because the eggplant soaks it up). I also just laid the eggplant flat and spread cheese over it, then topped with the sauce.. Used less breadcrumbs on top also. Very tasty meatless casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CASPER76"
},
"reviewBody": "Great recipe as written. I made it as directed and we liked it. Ill be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOMMETT"
},
"reviewBody": "Used one larger eggplant and got 6 slices. Easily enough for 3-4 servings - I halved the recipe with the only exception of maybe using a bit extra marinara sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ghoul"
},
"reviewBody": "It was good and filling I just wish I would have took the skin off of the eggplant. After reheating it was just mush and and tough skin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith"
},
"reviewBody": "We all LOVED IT. Wonderful and a bit spicy with pepper jack cheese. It will be a family favorite. I love Chief John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Howell"
},
"reviewBody": "I thought the cheese filling was bland but my vegetarian wife, who I made it for, loved it. A solid 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "Delish...I made some changes (smaller amount and used ichiban eggplant). I also had some left over hamburger that I cubed up and sauteed it a bit with the eggplant to heat it up. I used my own sauce to make it up sooner. It was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Korologos"
},
"reviewBody": "I made it and I'm still enjoying it. Yes I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "It was good, but a bit bland overall. I will add spicy Italian sausage for the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Cearns"
},
"reviewBody": "I love this recipe so much that I made it 4 times in the last 3 months, each time for a different audience and all loved it. I think the 4th time is the best and most flavorful. The first 3 times I got great compliments but all commented it needed a bit more kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Sabo-Jett"
},
"reviewBody": "I made it for dinne tonight and we loved it! I did add sliced mushrooms to the sauce and next time I'll peel the whole egg plant before cooking,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahoy_Thar"
},
"reviewBody": "Nice recipe and a good mix of cheese, eggplant and sauce. I used smaller eggplant so instead of stuffing and folding the slices, I made little eggplant sandwiches with the stuffing. Worked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Joy Skipper"
},
"reviewBody": "I didn't change anything from the recipe and my husband absolutely loved it. This was my first attempt at eggplant parmesan and it was a success. My husband said it tasted like something from a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OdaMae"
},
"reviewBody": "Chef John! I love folding the eggplant and using minimal oil! Lucky enough to have pepper jack &amp; parm on hand I substituted cottage cheese for ricotta as I was out. Due to cutting carbs I also substituted flax seed for bread crumbs. Certainly this is prone to the flavors embedded in your marinara, mine was a recipe found on this site (substituted homegrown tomatoes for stewed, added ground fennel &amp; spinach and it was FANTASTICALLY AUTHENTIC! \nI've been a long time eggplang parm fan but didn't care for the breading, usually soggy. This is the only way to make eggplant parmesan for me! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SeaglassRocks"
},
"reviewBody": "This was DELICIOUS! I used 2 1/3 cups marinara, substituted mozzarella for pepper jack cheese and halved the breadcrumbs. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missjane"
},
"reviewBody": "REALLY good just added a little more spice cause we like it !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Michelle Winchester"
},
"reviewBody": "This was so easy and lighter in calories than my original recipe. I will be making this one more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vassilis Sinopoulos"
},
"reviewBody": "Very tasty!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/235794/eggplant-parmesan-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/22472/main-dish/vegetable-main-dishes/",
"name": "Vegetable Main Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17635/main-dish/vegetable-main-dishes/eggplant-parmesan/",
"name": "Eggplant Parmesan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/235794/eggplant-parmesan-casserole/",
"name": "Eggplant Parmesan Casserole"
}
}
]
}
}
, "about": [
]
}
]