				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Eggplant Parmesan I"
,"datePublished": "1999-07-18T23:26:43.000-04:00"
,"dateModified": "2022-07-14T17:07:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karen"
,"url": "https://www.allrecipes.com/cook/24324879"
}
]
,"description": "Wonderful directions for preparing eggplant if you&#39;ve never done it before. The eggplant is layered in a large pan with marinara sauce, mozzarella, ricotta and Parmesan cheese. This it &#39;s baked until the cheese topping is golden."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xcK-8pfY0YMXMQhwKzmM58ELC3g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5773742-c9058d5df0f14551b91360940d3c2366.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729106419001",
"description": "See how to make a cheesy eggplant casserole.",
"duration": "PT4M19S",
"name": "Eggplant Parmesan I",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/33e12be3-0ea8-478d-8898-a80378c2d36f/5a9d117c-6dc1-4799-8a8a-6886e4b42b63/1280x720/match/image.jpg",
"uploadDate": "2021-07-04T12:29:24.632-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Eggplant Parmesan I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "550"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "369 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "53 mg"
,"fiberContent": "6 g"
,"proteinContent": "14 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "2075 mg"
,"sugarContent": "13 g"
,"fatContent": "25 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 eggplant, cut into 3/4 inch slices",
"1.5 tablespoons salt",
"8 tablespoons olive oil",
"8 ounces ricotta cheese",
"6 ounces shredded mozzarella cheese",
"0.5 cup grated Parmesan cheese",
"1 egg, beaten",
"0.5 cup chopped fresh basil",
"4 cups pasta sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sprinkle both sides of the eggplant slices with salt. Place slices in a colander, and place a dish underneath the colander to capture liquid that will sweat out of the eggplant. Allow to sit for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, mix the ricotta, mozzarella cheese and 1/4 cup Parmesan cheese. Mix in egg and basil."
} ,{
"@type": "HowToStep"
,"text": "Rinse the eggplant in cold water until all salt is removed. In a large skillet, heat 4 tablespoons olive oil over medium heat. Place one layer of eggplant in the pan, brown each side. Repeat with remaining eggplant slices, using additional oil if necessary."
} ,{
"@type": "HowToStep"
,"text": "In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. Arrange a single layer of eggplant slices on top of the sauce. Top the eggplant with 1/2 of the cheese mixture. Repeat layering process until all the eggplant and cheese mixture is used. Pour remaining sauce on top of layers, and sprinkle with remaining Parmesan cheese."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xcK-8pfY0YMXMQhwKzmM58ELC3g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5773742-c9058d5df0f14551b91360940d3c2366.jpg"
}
]
,"text": "Bake 30 to 45 minutes in the preheated oven, until sauce is bubbly."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SDL"
},
"reviewBody": "My husband loves eggplant, me not so much. This recipe turned out great with the ricotta and parmesan cheeses. Fresh basil a must."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WeHaveTenFeet"
},
"reviewBody": "Best eggplant parm I have ever had. We used long thin eggplant slices, and replaced the ricotta with Tex Mex shreds. Trying it now with frozen grilled eggplant slices and cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Kawaller"
},
"reviewBody": "I just needed the cheese blend recipe as my husband had already fried the eggplant from our garden and I had made a marinara sauce using his tomatoes from his garden. I saved some of the grated mozzarella to put on top of my casserole. It came out great and I really liked the cheese blend. I like to make two small casseroles and freeze one so we have one for another night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DEC"
},
"reviewBody": "The eggplant did not brown but soaked up the olive oil. It would seem some type of breading was needed to crisp. The toppings also needed spice to offset the tomato/cheese mixture. I thought it somewhat bland and will try something differant next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kburroughs116"
},
"reviewBody": "My vegetarian daughter came home from college today and I made this for her. She loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Joyner"
},
"reviewBody": "When the directions say to fry the eggplant is where I made a change. After preparing the eggplant I brushed it lightly on both sides with olive oil. Put on a greased cookie sheet and baked it a 400 degrees for about 15 minutes or until soft. Used a spatula to place in cooking dish. I also made my own tomato, beef and sausage sauce. This turned out to be one of my best Italian recipes and quite easy with the different directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tom McCullough Sr."
},
"reviewBody": "Made exactly as written. Found it to be bland tasting and the eggplant was saturated with olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Schillen"
},
"reviewBody": "Very good, I used Ghee to fry the eggplant, worked very nice..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ciacci13"
},
"reviewBody": "Besides adding me own tweaks Here n there, I went by the book and am glad I did. This was prepared for Mother’s Day Sunday Dinner, Italian style. It was an absolute hit! \nThe tweaks I added was breading the eggplant sheets with seasoned bread crumbs and Romano before frying in grape seed oil. I also made a super chunky gravy (sauce) with mushrooms, whole garlic cloves, large sliced onions and hot Italian sausage crumbles. My layers were made of sautéed baby spinach leaves with the ricotta, burrata and parmesan. On top before baking, I added goat cheese dabs and a baked on layer of mootzy. Ok maybe I veered off the instructional path a few miles but this recipe was a great base for an artist to complete."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Hirsch"
},
"reviewBody": "I used two eggplants one wasn't enough! Came"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "laraiezzi"
},
"reviewBody": "We almost loved this, except the eggplant wasn’t quite cooked all the way through. Next time I think I’ll either cook it a bit longer first before I layer it, and/or leave it in the oven a bit longer. We loved the recipe though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Ehrhardt"
},
"reviewBody": "I am making it again tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Boutilier"
},
"reviewBody": "This turned out delish! We will make again! Even my meat eaters enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pennyg"
},
"reviewBody": "I won't make it again. It is more like a lasagne, using egglplant for noodles.\n Also, I couldn't get all the salt off. I rinsed, but obviously not well enough. For someone who seldom salts food, this was way too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn Heather"
},
"reviewBody": "Delicious! My only complaint is the recipe should've put how many cups instead of ounces. Its 2 cups of Mozzarella and 3/4 of a cup of Ricotta. However, since I've never liked Ricotta I borrowed from another reviewer and used Cottage Cheese. Also from another reviewer I put the slices in the oven at 400 for 20 minutes after first spraying the tray and then the slices, instead of frying. I also left out the egg, I didn't feel like I needed it. It turned out great and I served it with garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tricia"
},
"reviewBody": "Came out ok. Not all that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jim s"
},
"reviewBody": "Eggplant parmigiana is my favorite dish. This one was easier to make and tasted better than others I have made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Beaman"
},
"reviewBody": "Easy to make and was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Willie Botha"
},
"reviewBody": "I left out the cream cheese and egg and used more mozzarella. my guests, even eggplant haters, loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Guzauskas Ruby"
},
"reviewBody": "Good basic recipe. My daughters are not fans of ricotta cheese, but they do like eggplant. I followed recipe, leaving out salting step, and ricotta/egg mixture. Using a mandarin, I sliced 1/2 inch slices of eggplant and sautéed in olive oil (4 minutes on both sides). I layered according to directions using only sauce, eggplant, and cheese. I baked for 20 mins. to melt cheese. Casserole was moist and tasty! I served with Chicken parmesan. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KelleyBee"
},
"reviewBody": "Love this recipe, but I don't really get the name. Its more like Eggplant Lasagna. I skipped the pan fry step and just assembled with the sliced eggplant after rinsing away the salt. Simply add about 15-20 minutes more bake time if skipping the frying step. It turned out wonderful as part of our Thanksgiving meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ferg"
},
"reviewBody": "Excellent recipe. I used a 16 oz block of mozzarella and sliced it along with grating. Very cheesy! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rms516"
},
"reviewBody": "Did not like it at all. It was too mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denean Saielli-Johnson"
},
"reviewBody": "I like to bread my eggplant before frying, as it makes the dish more solid and extra delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tia's"
},
"reviewBody": "The dish was flavorful but next time I’ll only leave the salted eggplant for 30 min as the recipe calls for. After letting it soak for 2 hours and rinsing, the dish was good but a lot more saltier than we’re use to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronno"
},
"reviewBody": "Best eggplant parm I have ever had and I don't usually like eggplant parm. I added 3 whole cherry tomatoes to the top of each stack as a garnish and for a taste of fresh tomatoes. in addition I added more parm and mozzarella then called for to make it extra cheesy. My wife liked it because eggplant is not breaded before frying and is lighter on the stomach.\n\nAfter reading a few other reviews decided to add that I browned my eggplant in a well heated cast iron skillet at a little over medium high. Only had one slice absorb much oil and that was the first piece I put in the skillet before the oil reach maximum temp. After the oil got hot oil absorption was not a problem and got a nice sear on all the other pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zeppy"
},
"reviewBody": "Wonderful recipe! Made with Chinese eggplant. With no breading, wonderful recipe for my low carb wife. Agree, the ricotta was a great complement."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cocoa506"
},
"reviewBody": "Followed everything except I used the oven method rather than frying. I sprayed an aluminum lined cookie sheet with Pam Olive Oil on bottom of pan, then sprayed very lightly tops of sliced eggplant. Then baked at 350 degrees for 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "This was way too runny with sauce &amp; cheese. I used two eggplants and it probably needed at least two more to make up for the other ingredients. I will look for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ngrech"
},
"reviewBody": "Have used this recipe many times. The only adaptation I make is the addition of mozzarella to the parmesan topping (packages in Canada are measured in grams. I used all 320g on top which is about 12 oz)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolA77"
},
"reviewBody": "Made this for a family dinner. Everyone thought it was delicious. It is so easy to make. The first time I made it I did not cook the eggplant on the stovetop so it took a little longer in the oven. The second time I did. Both ways taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IntheKitch"
},
"reviewBody": "Amazing dish! I used 2 eggplants and made a homemade Marinara sauce. I would double the recipe because the family loved it, especially my wife who is the cook in the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grannysgoodies"
},
"reviewBody": "The only change I made was to bake instead of fry the eggplant. I laid it out on a cookie sheet and sprayed it with cooking spray, turned it over and did the same. Popped it into a 425 oven and baked until soft. Otherwise followed the recipe. My husband and I love it and will be eating it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frenchy8560"
},
"reviewBody": "Have made this several times. I like many reviewers find it easier to bake the egg plant slices in the oven. I prefer 425 degrees for about 15 to 20 minutes and I flip them midway. Also I almost double the cheese mixture. I can't imagine covering two layers with mixture as it is written. Maybe I just love cheese too much. LOL I serve it up with homemade meatballs, and garlic bread, and a side salad...Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Hopkins-Eyestone"
},
"reviewBody": "This was my first time making this or doing anything with eggplant. The sauce was amazing, but it turned out I had picked some over-ripe eggplant and it kinda ruined it. I pulled all the eggplant out and will use the sauce for a spaghetti casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I made my own marinara sauce and everyone loved the dish. They told me that if they ordered and ate this at a \"swanky\" Italian restaurant they would be so happy with the meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ardenmeadow"
},
"reviewBody": "Made it and it was easy. Delicious especially next day. Good choice for Gluten free as there is no breading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anka"
},
"reviewBody": "This is a pretty good recipe, easy to adjust to your liking. I made a basmati rice to go with it ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roger"
},
"reviewBody": "I made it per the recipe. It was pretty good although the ricotta and cheese mixture left the taste and consistency more like lasagna, really overwhelmed the eggplant. Next time I'll leave out the ricotta and a little less of the marinara."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alison Guynes"
},
"reviewBody": "This is less an eggplant parmesan and more an eggplant lasagna. Unless you're using monster eggplant you need to use two. I also had to double the cheese recipe because just doing the single batch barely covered one layer. I added garlic powder, dried oregano, and had to use dried basil as I didn't have fresh when I mixed it all in with the cheese. We didn't care for the texture of the eggplant after having fried it in olive oil because of how the eggplant sucked up the oil. I cooked it for 35 minutes in my convection oven, but it could probably have used a little longer. Overall it was an okay recipe, and I'll probably make it again, but I'll either bread the eggplant or I'll forgo the oil to keep the eggplant from becoming too soggy and slimy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karyn Borkowski"
},
"reviewBody": "Loved this recipe!!! Will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Didn't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaVern Flora"
},
"reviewBody": "I preferred this over other eggplant parmigiana recipes because you slice and bake instead of breaking and frying the eggplant slices. The prep is easier and faster. I brushed the eggplant with garlic infused olive oil because I had it and sprinkled it with garlic powder. I used store bought garlic and herb red sauce. My daughter and I loved better than any we've had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Call Me Alice"
},
"reviewBody": "2016.11.17 - Changes: Peeled eggplant, cut eggplant to only 1/2 inch slices, did not sweat eggplant, added salt and pepper while frying eggplant, ended up with only one layer of eggplant. Used marinara sauce. Just put a little sauce on top, as there was only one eggplant layer. Only needed to bake 30 minutes cook time. \nDBF loved it! I liked it! The eggplant didn't seem thoroughly cooked, though, so I think that next time I will cut it thinner and fry it until it is a little darker. Definitely have two jars of marinara sauce ready. We ate this with radiator pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wizardofohms"
},
"reviewBody": "I had to substitute cottage cheese for ricotta because I didn't have any. It turned out great! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura L"
},
"reviewBody": "It wasn't bad. It would have been better if the eggplant had been breaded - but overall fairly average. I think I'll try the rollatini recipes next time where the eggplant is rolled around the ricotta mixture - I think it would work better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissie"
},
"reviewBody": "I followed the recipe completely, only doubled the ricotta. My boyfriend &amp; I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eve Thorburn"
},
"reviewBody": "I liked it a lot, but my husband just said \"It's ok.\" He is not a vegetable person. I used as an entre but maybe I could get by as a side for him."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Teske"
},
"reviewBody": "Loved this recipe. One of the best . I must admit I only had cottage cheese but stayed true the rest of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "My family love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MB Avant"
},
"reviewBody": "Added in some cheddar and mozzarella cheeses along with the ricotta and parmesan for my cheese lovers, made a homemade sauce versus the jar of spaghetti sauce,and they loved it! Will definitely be making this again in the future. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzn_0617"
},
"reviewBody": "It was good but mushy. I think I will try one of the recipes that bread and fry the eggplant or even the one that bakes it first, next time, just to give it a little more firmness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa "
},
"reviewBody": "I most definitely will make again!! I used fresh mozzarella pearls instead of grated mozzarella and mixed with the ricotta (I used 15 oz ricotta) I found an amazing Eggplant and Artichoke Marinara made by Classico that I used and really made the dish special! I was pleasantly surprised that the eggplant wasn't breaded. I have never eaten or cooked eggplant...and that changes thanks to this yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Craig"
},
"reviewBody": "Good dish but the ingredient qua ties are off. It calls for one eggplant cut into 3/4\" slices fried until browned. You then make a layer in a 9\" X 13\" baking dish. One layer uses up the large eggplant so the whole layering concept is down the drain. If I ever make it again I'll either double the eggplant or use a smaller dish. FYI"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ronaldm"
},
"reviewBody": "I certainly will make it again. Expect to use more oil than the recipe calls for when frying the eggplant, although this can be greatly reduced with the use of a non-stick pan. I think the ricotta gives this recipe the classic flavor of Parmesan. In addition to the Parmesan cheese of course."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shedmom"
},
"reviewBody": "Love the ricotta addition in this recipe. My favorite Eggplant Parmesan recipe so far. And very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kia"
},
"reviewBody": "Loved loved it. The taste was great. I did not change anything just followed the recipe as it was written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Just added more ricotta and pizza blend shredded cheese. Never can go wrong with more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cheryl-Ceece Cole"
},
"reviewBody": "It turned out soggy without the bread crumbs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J- Wizzle"
},
"reviewBody": "YUM!!!!! easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tawk79"
},
"reviewBody": "Followed the recipe exactly. We loved it. I was told it was one of the best dishes I've ever made. Thank you for the recipe! It was a smash hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brandon Yates"
},
"reviewBody": "The end result was good, but the prep took forever &amp; frying the eggplant was SO frustrating. I let my eggplant dry out for well over 3 hours. I really don't understand frying in olive oil. It has such a low smoke point that it smoked up my whole house. The eggplant soaked up all the oil (I had breaded mine). I doubt I'll ever make this again since its so time consuming &amp; while the end result is good, it's not so stellar to justify the frustration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Smith"
},
"reviewBody": "The only change was from my Italian aunts way...keep the skin on &amp; slice thin. Really does make a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChayaT"
},
"reviewBody": "Made recipe as original with the addition of breadcrumbs before frying eggplant. Tasted fantastic. I had a little trouble spreading the cheese mixture. It was sort of cookie-dough texture and not so easy to work with. Also raised baking temperature to 400 last 10 minutes to soften eggplant. Combination of flavors was A+!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "val"
},
"reviewBody": "I love eggplant and my kids so this is awesome for dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Carr"
},
"reviewBody": "I enjoyed this recipe. It also works if you lightly spray the eggplant slices after preparing as directed and grill them until tender. Then prepare and bake as directed.\n This is healthier and tastes great! I also have used half part skim ricotta and half low fat or non-fat cottage cheese .\nYou won't miss the fat and it tastes wonderful! Use part skim mozzarella as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Burley"
},
"reviewBody": "Won over new Eggplant eaters in my house. It was my first time making it and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "elsepeth"
},
"reviewBody": "The taste was good don't get me wrong BUT I was expecting something a little closer to breaded eggplant parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dove Russo"
},
"reviewBody": "The finished product was absolutely delicious. It was likely my favorite eggplant lasagna ever. I would have rather had three layers of eggplant, and even without it, it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RGib"
},
"reviewBody": "After reading other reviews, I baked the eggplant. I sprayed the sliced eggplant with olive oil and sprinkled garlic salt. I have made it both ways, but will bake eggplant again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Talbot"
},
"reviewBody": "Loved it! This was my first attempt at eggplant. Next time I will peel the eggplant. I did add Italian sausage to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Al Dente"
},
"reviewBody": "My wife and family really liked it. My wife said it was even better the next day for lunch! I would add less basil, but that is a taste preference. Thanks for the recipe. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Agius"
},
"reviewBody": "Really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lshinder"
},
"reviewBody": "I followed the recipe except for a couple of minor changes.I didn't have any basil so I used a little bit of oregano. Also, I mixed a little bit of Italian bread crumbs in with the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "powerk"
},
"reviewBody": "Loved this!! First time eating and preparing eggplant. Total hit. Hubby made tomato sauce from scratch, but other than that, followed the recipe. One of our favourite dishes will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "loricakes"
},
"reviewBody": "Good if you are watching carbs, but I think I prefer it with breading, especially as it adds seasoning. I tried frying them without doing the salt step, as the top comment recommended. They still soaked up all the oil, so I'm not sure that advice helps any."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Brauninger"
},
"reviewBody": "Made it a couple of times now and I must say it is by far better than any other recipe. I feel the ricotta cheese is the difference in my tastes. Mmmmm it's so good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PlumPerch"
},
"reviewBody": "Delicious. If you actually cut the eggplant in 3/4\" slices as instructed, you'd be lucky to cover the bottom of the 9x13 pan and definitely wouldn't have enough for a second layer. I cut mine in ~1/2\" slices, and had just over one layer. Next time I will get two medium eggplants. Why not make it a little healthier by adding more vegetables relative to cheese?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cook in Texas"
},
"reviewBody": "We loved this, maybe next time I'll cut back on the ricotta just a bit. I breaded the eggplant in seasoned bread crumbs and Parmesan cheese before layering everything together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Hendrickson"
},
"reviewBody": "I rarely look forward to leftovers but I did with this dish. It was wonderful! I didn't have ricotta, but I just substituted sour cream. A note about the olive oil, don't keep adding more. The amount for the recipe is sufficient. If you keep adding more you are going to end up with very oily eggplant. Mine was fine, but I know from prior experience."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Ghenwa"
},
"reviewBody": "Amaziiiiiiiing! Use organic coconut oil to fry eggplant! That way u can add xtra coconut oil and not worry about what soaks in since coconut oil is very healthy for you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizette McKinley"
},
"reviewBody": "Quite tasty. I've made this a couple of times. I love eggplant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gemini"
},
"reviewBody": "Loved it..made a couple of changes.. no ricotta around so I used cottage cheese. I also added slices of potatoes, seasoned both layers with salt and pepper and voila..delic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Waltz"
},
"reviewBody": "Loved it. And one of the first times I cooked eggplant. Yikes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nikita"
},
"reviewBody": "I will definitely try this recipe again. As it was a last minute decision I did not have the cheese on hand and substituted with goat cheese and cheddar. Also the pasta sauce contained basil but I didn't have fresh basil on hand. However it was still delicious so I imagine next time with the correct ingredients will be even better. Also as per some comments I also dipped the eggplant in egg and then breadcrumbs. Only negative is that that it uses alot of oil for frying"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "We really enjoyed this dish. An easier and lower fat / calorie way to precook the eggplant is to spray it with oil or brush a little on, then put it under the broiler until it browns. Turn the slices and repeat oiling and broiling. I've never found it necessary to rub with salt first. I also substitute cottage cheese, whizzed in the food processor for the ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LillysMom"
},
"reviewBody": "Useful info from this site regarding prepping eggplant: \n\nIf you choose to salt your eggplant, first slice or cube it, and then salt generously, allowing the fruit to sit in a colander for at least an hour, preferably longer. Salted eggplant can sit purging for hours without harming the taste or texture. \n\nBUT...before cooking the eggplant, be sure to rinse the salt off well. THEN place the slices between sheets of paper towel and press gently to remove juices and firm the flesh. This is particularly important when frying your eggplant slices or cubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This is a great recipe. However there were a few big changes I needed to make. 1) unless you get an unusually large eggplant, you will likely need to have 3 eggplant or slice MUCH thinner than 3/4-inch. You won't have 2 layers unless you do this. Plus, I can't imagine feeding 8 people on one eggplant. 2) eggplant soaks up oil when it is fried, so you will need A LOT more than 8 Tbs. 3) peel the eggplant. The skin on an eggplant is kind of tough. 4) I added 2 cloves of garlic. It just seemed like basil wasn't enough. That change is optional, but the first three aren't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Wilson"
},
"reviewBody": "My family and I did not like this recipe at all. I am giving it 2 stars on the basis that we were able to eat it the night I made it. What a shame to waste the time and money. Here's what I found wrong: First off, 1 eggplant was not nearly enough to make more than 1 layer in a 13 x 9 pan. I used a HUGE eggplant that weighed at least 2-3 pounds and it still only gave me 1-1/2 layers. Second, as others have pointed out, the eggplant took such a long time to brown (at least 20 minutes for this step alone, which makes the prep time in the recipe off) and soaked up every bit of the olive oil to where I had to add more for each batch to brown (more than the 8 Tbs called for in the recipe). This in turn made the eggplant goopy and oily. Gross! Lastly, there was too much sauce. The end result was hard to serve, a goopy, saucy mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I changed it up a little. Didn't fry the eggplant and didn't use regatta. It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "margaret"
},
"reviewBody": "Really yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nina"
},
"reviewBody": "So glad to see a recipe for eggplant parm that is not breaded. This is how I normally make. Growing up in a Sicilian home(parents came from Terrassini) this is how my mother made. I have however brushed eggplant with extra virgin olive oil and bake the it on high heat instead of frying! I give it a 4 because I use Pecorino Romano cheese, also what we had growing up.\nNina"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "McBacon"
},
"reviewBody": "I would like to give this more stars. This was tasty, but I had very mushy texture. I think, as another person said, it was the lack of batter before frying, because it's true- eggplant soaks up oil like crazy! It would have been good if not for the mushiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mike420032000"
},
"reviewBody": "Slice 2 fresh tomatoes and layered over egg plant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "baylonjay"
},
"reviewBody": "this is a really great simple classic eggplant parmesan - that is not breaded and then fried or baked. When executed with fresh home made marinara and some added garlic (i like more garlic, and also lots of cracked pepper), and really fresh for the basil and all the cheeses.... it is sublime and perfect with garlic bread and salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "opheliamiller"
},
"reviewBody": "Perfect!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hailey"
},
"reviewBody": "I thought the recipe was delicious, however next time I would add more eggplant, I felt that it got lost in all the sauce and cheese. I also breaded the eggplant in Italian breadcrumbs to add some flavor and some crunch which turned out well. I was worried that the dish wouldn't have enough substance to it because it looked like there wasn't enough eggplant so at the last minute I decided to boil some spaghetti and I served the eggplant parmesan over it and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Tarr"
},
"reviewBody": "I really enjoyed this recipe. One thing I will change next time i make will be to cut away the skin and bread the eggplant in some panko before I fry it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RonnieB"
},
"reviewBody": "Loved it, used marinara sauce"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13981/eggplant-parmesan-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/22472/main-dish/vegetable-main-dishes/",
"name": "Vegetable Main Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17635/main-dish/vegetable-main-dishes/eggplant-parmesan/",
"name": "Eggplant Parmesan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13981/eggplant-parmesan-i/",
"name": "Eggplant Parmesan I"
}
}
]
}
}
, "about": [
]
}
]