				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Eggplant Parmesan With Easy Homemade Sauce"
,"datePublished": "2020-03-05T00:09:10.000-05:00"
,"dateModified": "2022-06-28T04:23:03.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Brenda"
,"url": "https://www.allrecipes.com/cook/3873048"
}
]
,"description": "Breaded eggplant slices in an easy homemade tomato sauce are baked under a topping of Parmesan cheese in this Italian-inspired favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZyhQABYuE4GvukicjuEdIj4puhM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/867454-134dc547a63c4478aec16e724c04fb72.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Eggplant Parmesan With Easy Homemade Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "71"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "389 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "41 mg"
,"fiberContent": "2 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "681 mg"
,"sugarContent": "6 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 cup Italian-seasoned bread crumbs",
"0.25 cup grated Parmesan cheese",
"1 pinch red pepper flakes, or to taste",
"1 eggplant - trimmed, peeled, and sliced 1/2-inch thick",
"0.5 cup olive oil",
"1 (6 ounce) can tomato paste",
"1.5 (6 ounce) cans water",
"0.25 teaspoon dried basil",
"0.25 teaspoon dried oregano",
"0.25 teaspoon dried parsley",
"1 clove garlic, crushed",
"1 teaspoon brown sugar",
"sea salt and ground black pepper to taste",
"1 (8 ounce) package fresh mozzarella cheese, sliced",
"0.75 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C). Grease an 8x14-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Mix seasoned bread crumbs, 1/4 cup Parmesan cheese, and red pepper flakes in a shallow bowl. Brush eggplant slices with olive oil and press into bread crumb mixture to coat. Lay slices onto a baking sheet and bake in the preheated oven until browned and tender, about 15 minutes. Remove eggplant and reduce oven temperature to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Whisk tomato paste and water in a saucepan, place over medium heat and bring to a simmer. Stir in basil, oregano, parsley, garlic, brown sugar, salt, and black pepper."
} ,{
"@type": "HowToStep"
,"text": "Place eggplant slices into the prepared baking dish, overlapping the slices. Spoon tomato sauce over eggplant and top with mozzarella cheese and 3/4 cup Parmesan cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until cheese is melted, about 15 minutes. If desired, broil for 1 to 2 more minutes to give cheese topping a golden color. Let stand for 5 minutes before serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnny Cee"
},
"reviewBody": "Changed it up a bit. Pecorino and Pepper Jack instead of Parmesan and Mozzarella.\nNo Bread Crumbs. Used Tony Cashiers Cajun Season instead of just S &amp; P. Used Anchovy paste. I cut the eggplant very thin (1/4 inch) and fried each slice in olive oil. (dipped in egg and flour before frying).\nInstead of laying in shingles I stacked the eggplant with large slices on the bottom and small slices on top. 6 stacks with small amount of sauce and Pecorino between each layer. 40 minutes at 350 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "makingithappen"
},
"reviewBody": "I have tried many different Eggplant Parmesan recipes from this website and this is by far the best one. No tweaks/substitutions required. The sauce tastes great, the eggplant is always well cooked. My husband (a staunch carnivore) also prefers this the best and often asks for this meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "Thank you for your positive feedback.\nI originally posted this recipe and want to add a few notes here: Instead of olive oil you can use Hellman's mayonnaise, or one of your choosing, to brush on eggplant before baking. Remember to turn heat down in oven when baking second time or it will be mushy. Also, the sauce is great as pizza sauce or on chicken parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BamaKat"
},
"reviewBody": "Love it! I add a few dollops of ricotta for extra moist and cheesy flavor,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugar19"
},
"reviewBody": "Good way to use my eggplant from my garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Mueller"
},
"reviewBody": "Made this for dinner this evening and followed the recipe fairly closely. I doubled the sauce and used a pinch of white sugar instead of brown. Put some sauce in the dish first. Made two layers of eggplant with cheese and sauce between and plenty on top. Ended up cooking it for about a half hour. Wife loved it!! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne reese"
},
"reviewBody": "Excellent and easy! Even the kids ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Hoeffel Morgan"
},
"reviewBody": "Results were delicious even with store bought sauce. Perfect amount for family of 4 when paired with pasta, bread and salad. Thanks for easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KAE2"
},
"reviewBody": "I didn't use the red pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CaraLee Epp"
},
"reviewBody": "I made this for my daughter and I on a weeknight, trying to get her to taste new vegetables (which she hates). She actually liked it! I used a jar of Fine Herbs pasta sauce instead of making my own but otherwise followed the recipe here. It was really tasty, served over linguini."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laisw"
},
"reviewBody": "I used egg as the sticking agent for the bread crumbs instead of olive oil, and store-bought sauce (Classico Tomato &amp; Basil) instead making my own. Also let the eggplant cook initially for 20 minutes instead of 15. Really really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liks2Cook"
},
"reviewBody": "OMG! I love eggplant and so does my brother. We both loved this right out of the oven plain and then when the recipe was completed...it was soooo amazing! And YES, so easy! I served it with small 3-cheese tortellini. This will come to the table again in my house"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nawiscool1"
},
"reviewBody": "I've made this dish a few times and really like it. I really like the sauce and now I make this sauce for all my spaghetti and pasta dishes that calls for jarred spaghetti sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Holtzman Ryerson"
},
"reviewBody": "This is so much easier than the traditional recipe I've used for years. I'll add a bit of garlic next time only because, well, you can never have enough garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martig"
},
"reviewBody": "I made this with my own sauce that I had in the freezer with turkey italian sausage in it. It was easy and delish. For the reviewer that said it was mushy. It is vegetable not chicken so it has a different consistency and does feel soft and easy to chew.\nMaybe cutting it a little thicker would help. Also, 1/2 cup bread crumbs and 1/4 cup parmesan had to be doubled to do a whole eggplant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Edel Henry"
},
"reviewBody": "The dish was beautifully make,everyone loved the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosemarie Place"
},
"reviewBody": "Loved the eggplant baked over fried. Sauce was a little too acidic for us, but eggplant was fabulous. We made the eggplant like miniature pizza rounds and really enjoyed them this way and then made eggplant sandwiches on toasted french bread with lots of sauce and that was equally delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cotton"
},
"reviewBody": "No changes and definitely be making again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Berthiaume"
},
"reviewBody": "So delicious, made it and didn't change anything, so good!!!! Everyone I made it for loved it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ariesgoddess77"
},
"reviewBody": "Perfect! My family loved it! Will def make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurita"
},
"reviewBody": "First time ever making this dish and it turned out great. I had some eggplants running around my fridge that were gifted to me from a friend's garden when I found this recipe. The eggplants turned out wonderfully via the cooking method in this recipe. \nI did have some packaged sauce kicking around, so I doctored that up a bit (loosely following this recipe but omitting the sugar and parsley), instead of starting from scratch. Before adding the sauce to pot I sautéed 2 chopped chicken breasts (another thing that needed to be used) with fresh herbs and garlic, and then added the sauce and simmered whilst waiting for the eggplants to roast. I served it with a spinach salad. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBoberz"
},
"reviewBody": "I had a very large eggplant which I peeled, sliced, rinsed and drained in my pasta strainer. To save time I used a jar of tomato basil pasta sauce (straight from the jar) instead of the tomato paste/homemade sauce. I mixed some garlic powder, dried basil and a pinch of red pepper to the two eggs. Then used plain bread crumbs. I made half of the recipe in the oven (added olive oil to the aluminum foil lined pan) at 475 for 8 min on each side to achieve the crispiness. The other half I made stove top on a medium setting and used approximately a tablespoon and a half of olive oil (just as yummy plain). I didn't have enough shredded cheese so I used sliced provolone in between the layers (I was desperate and in a hurry). Baked it at 375 for 15 min. It was DELICIOUS! I would have taken a picture (very nice presentation) but as soon as I took it out of the oven my family was all over it! I served it over whole wheat pasta tossed with a little olive oil, a sprinkle of garlic powder and dried basil. AMAZING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nora"
},
"reviewBody": "The best recipe. No changes need to be made. The sauce is superb. Easy and quick too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Qwence"
},
"reviewBody": "This turned out great! Fairly easy to follow recipe as well. This was my first time cooking with eggplant and I will use this recipe again. I made a few minor adjustments to suit what I had available... I added some Italian pasta seasoning, dry basil, and dry oregano to the bread crumbs since I only had plain crumbs. I also used more than a pinch of chilli pepper flakes as I like a bit of spice. \r\nI will spread the eggplant out on a bake sheet instead of stacking them in a baking pan next time. This is just personal preference as they still turned out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amateurchef"
},
"reviewBody": "As written, this recipe is a great value. Good flavor on a budget. I augmented with 1/2 lb browned Italian sausage and a can of sliced mushrooms. Will certainly make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ariel"
},
"reviewBody": "I made this today and it was so delicious!! It was perfect, especially with garlic bread. :) I'm definitely making this again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asimplemommy"
},
"reviewBody": "Great flavor, simple to make! I'd double or triple the eggplant and breading! I tried it with some thinly sliced chicken as well, amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mixinitup"
},
"reviewBody": "I really loved this recipe! I added a bit more sugar and that was it. It was easy,delicious and it was eggplant! The kids ate it and my husband ate it! Score :0)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "brenda"
},
"reviewBody": "I must have done something wrong! The eggplant was so mushy I couldn't even eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Goddard"
},
"reviewBody": "Don't leave out the red pepper. I used about 1/4 t. ground red pepper instead of flakes. My hubby wondered where the meat was, but I liked it just as it was. Great way to use egg plant from garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I don't actually like eggplant, but needed to use up what came in our CSA box. This was definitely one of the less offensive ways that I've had eggplant...it would probably be really good if you like eggplant. I would suggest sprinkling the extra breading over the top of the casserole for a nice crunch, as I did, because that turned out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsey"
},
"reviewBody": "this was phenomenal, end of story. sauce had just the right amount of kick to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy M Curry"
},
"reviewBody": "This was my first time making eggplant parmesan. I used two eggplants from my garden. I decided to use a jar of Muir Glen tomato sauce and add the spices suggested in the recipe. It was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abrasuell"
},
"reviewBody": "This was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luvmykiddos80"
},
"reviewBody": "Super easy to make, and my younger kiddos even wanted seconds! However, I made this for my family of 5 and there was only enough for one serving. No biggee, I will just double next time! I served with a spiral brown rice pasta and doubled the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie McClure"
},
"reviewBody": "I made this for Christmas Eve dinner for my Fiance and I. It turned out great and made a lot more than the 2 of us could eat. One thing to note is that I found it bit tough getting the breadcrumb mixture to stick to the eggplant with the olive oil but eventually I figured out that you just have to press it on and dump it on. Worked great and a good alternative because I can't eat eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ"
},
"reviewBody": "Delicious!! I prepped it the night before. Just added sauce and cheese on top before I actually baked it. Total hit with the family..young and old :-) Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was really good. I wish I would have added some type of meat to the sauce though, I am assuming this was a vegetarian meal but all in all, first try with eggplant, not horrible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MindyB"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINABEAR1"
},
"reviewBody": "Outstanding! I've never made eggplant parmesan before because it seems daunting and difficult, but I always order it at restaurants because I love it. I got a beautiful eggplant at the Farmer's market and felt it was time to try. This recipe was easy, delicious, and didn't take very long. I didn't have italian seasoned bread crumbs, so I used panko breadcrumbs mixed with italian seasoning and extra garlic powder. It was probably my favorite new recipe of the year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arianne Torres"
},
"reviewBody": "This was great! I omitted the red pepper flakes and had leftover breadcrumbs so i drizzled a little olive oil over the slices and breaded them again. We also had a portobello that was going bad so I chopped it, sauteed in some olive oil with garlic salt and tossed it into the sauce. Served over whole wheat spaghetti and topped with freshly chopped parsley.\n\nThis is going to be added to our dinner rotation. Thanks Brenda!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "This recipe is easy, not too time consuming, and tastes delicious. I use all fresh herbs rather than the dried for extra flavor. Will be using this for all of my eggplant this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "needlewings"
},
"reviewBody": "Awesome flavor! I used fresh basil and oregano from my garden and I doubled the recipe. I also omitted the brown sugar as I don't care for the sweetness in a tomato sauce. It turned out fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angelbach"
},
"reviewBody": "What an Inspiration! Just loved making my own sauce!\n\nHere is my tweak: baked the rounds for 25-30 minutes, turning them over every 5 minutes towards the end. Wanted them crisp on the outside and very soft on the inside. On the last 5 minutes I topped with a blend of Italian shredded cheese.\n\nThe sauce: I doubled the green spices and omitted the salt. I simmered until it was thick (my total preference is thick sauce) added 1/4 cup cream cheese to temper the acidity (could have used more).\n\nI put a dollop of the sauce onto each round, and pesto!\n\nYum! Yum!\n\nI did it this way mainly for easier portion control.\n\nOnce again, thanks for the inspiration!\n\nPS, By this time next year I will have a garden up and running and look forward to using fresh herbs and tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shris"
},
"reviewBody": "We used the homemade tomato sauce we made earlier in the year instead of this recipe--we like Alton Brown's roasted tomato sauce.\n\nThe method for this parmesan was terrific. We were very pleased with this, and it gave us just enough time to prepare side dishes to go with. An excellent method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TENNESSEE"
},
"reviewBody": "Delicious. Thank you, Brenda. Brenda writes:\n\"\"The few ingredients in the sauce is far tastier than canned sauce and makes the dish.\" Truer words \nwere never written. The sauce is incredibly easy\nand incredibly delicious. Even if you don't like\neggplant, make the sauce for anything requiring a\ntomato based sauce. You will not regret it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Carroll Fisher"
},
"reviewBody": "Very easy to make, I did add a little white sugar to the sauce, I left out the red pepper and I used zucchini AND eggplant. very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Comess"
},
"reviewBody": "So easy to make. I discovered that I didn't have Italian breadcrumbs but fortunately found a recipe to add herbs/spices to my plain ones. I followed the recipe except for the sauce. I did make the sauce but even with adding brown sugar to it, it was too acidic for my taste so I used some jarred spaghetti sauce and then added just a little of the tomato paste sauce on the top. Also used just shredded mozza. since I didn't have fresh. I had planned to have this for dinner tonight but it smelled so good out of the oven that we had it for lunch instead (and had seconds!) Will make again for sure. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elisabeth Thomas"
},
"reviewBody": "Yum! Dipping the eggplant in olive oil gives it a fabulous flavor. I made my own sauce with tomatoes from the garden, so I can't comment on the sauce recipe, but the eggplant preparation was very flavorful and perfectly cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nurseman"
},
"reviewBody": "So easy and so very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmarkun"
},
"reviewBody": "My favorite eggplant recipe. It has a zest to it that was so satisfying for everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy Mae"
},
"reviewBody": "I followed this recipe exactly and thought it was good. I also liked the addition of the red pepper flakes...gave a slight kick! Next time, I will add more spices per my own preference and also will double up on the sauce as my husband likes more sauce on his spaghetti dishes. Quick easy meal! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Jackson"
},
"reviewBody": "Excellent, easy, sooooo good. Had all the ingredients on hand so decided to try it. I left out the brown sugar, added a little fresh parsley along with the dried, loved the slightly hot flavor. I didn't have any pepper flakes so used a little bit of cayenne. Yum! Pretty quick from start to plate about 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Embles"
},
"reviewBody": "I cheated and used storebought sauce, so I can't speak to the homemade sauce, but the breaded eggplant portion of this recipe was absolutely delicious! I had extra breading, so I double breaded the eggplant. It was super easy to make, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OFFWORLD"
},
"reviewBody": "I never write reviews but I had to for this one. I tried this recipe tonight as written and it is fantastic. Super easy to make too. I did omit the hots, only because I'm not partial but it still was a hit. We had unexpected guests and everyone loved it, I'm so happy I put this easy meal together! Thank you Brenda!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvs2walk"
},
"reviewBody": "Love this recipe!!! Simple, quick and super EASY and delicious!!! My new \"go to\" recipe! Followed the recipe, no need to change a thing!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223359/eggplant-parmesan-with-easy-homemade-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/22472/main-dish/vegetable-main-dishes/",
"name": "Vegetable Main Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17635/main-dish/vegetable-main-dishes/eggplant-parmesan/",
"name": "Eggplant Parmesan Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223359/eggplant-parmesan-with-easy-homemade-sauce/",
"name": "Eggplant Parmesan With Easy Homemade Sauce"
}
}
]
}
}
, "about": [
]
}
]