				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Egg Roll Wrappers"
,"datePublished": "2000-09-21T11:19:35.000-04:00"
,"dateModified": "2022-10-28T10:36:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Matilda"
,"url": "https://www.allrecipes.com/cook/24326502"
}
]
,"description": "Make your own egg roll wrappers with just four ingredients! They fry up in peanut oil in minutes and are a great alternative to store-bought."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fGfKJ7-wtAJq9mSP2SDegeRHjeQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3507089-egg-roll-wrappers-Lallee-4x3-9cbe411621ab425ba2c8d2231e3e7a29.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Egg Roll Wrappers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "64"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "89 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "82 mg"
,"sugarContent": "0 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.75 cup cold water",
"1 large egg, beaten",
"0.25 teaspoon salt",
"0.875 cup all-purpose flour",
"2 tablespoons peanut oil, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk cold water, egg, and salt together in a medium bowl. Add flour in 3 batches, mixing well after each addition. Let stand at room temperature for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Heat a wok over high heat. Remove from the heat and thinly coat with 1 tablespoon peanut oil. Return to the heat and reduce the temperature to low."
} ,{
"@type": "HowToStep"
,"text": "Pour 1/4 of the egg mixture into the warm wok to make an 8-inch diameter circle. Rotate the wok quickly to spread batter into an even layer. Cook until the bottom is golden brown and the edges begin to curl, 45 to 60 seconds. Carefully remove from the wok and place onto a paper towel with the browned side down. Repeat to make one more wrapper."
} ,{
"@type": "HowToStep"
,"text": "Rub the wok with remaining 1 tablespoon of peanut oil, then make remaining two wrappers as directed above."
} ,{
"@type": "HowToStep"
,"text": "When wrappers have cooled completely, cut each one in half to yield eight wrappers."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dariel Rebollar"
},
"reviewBody": "I changed the peanut oil because I did not have any at hand so I used olive oil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nathalia Alexandra"
},
"reviewBody": "This recipe was way too thick, and even when I added more water it, the wrapper didn't come out like an egg roll"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trisha Brown"
},
"reviewBody": "This recipe really lacks the proper details to be successful. \n\nYou don't need to cook the wrapper until golden brown. They just need to be properly set, and peeling off on the edges. \n\nOnce cooled, fill it, and either bake or fry your egg roll until golden brown. \n\nYou are making glorified crepes. Keep them thin, and be gentle. The wrappers are delicate while hot. Make sure to restir before ladeling more batter into your pan, the flour will separate and sink to the bottom of your bowl. \n\nMy first run was decent, but it would have been better if I had a more accurate description of what to expect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sapphie"
},
"reviewBody": "This was a nice thing to try, but because I’ve never done anything like it before it didn’t turn out right. I tasted great, but it broke so badly that I had to get store bought wrappers to finish my egg rolls. I would not recommend this recipe unless you’ve got a lot of time to try and retry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dabofginger"
},
"reviewBody": "I have made them twice and they turn out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Roberta Chilzer"
},
"reviewBody": "This recipe didn't work, when I tried to roll them they busted apart so I couldn't even eat them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Selena Sayers"
},
"reviewBody": "for my first time trying to make egg roll wrappers, I found it rather difficult. there was way too much oil need to cook/fry them, and they weren't as thin as I would have expected. the finished results was also rather eggy and doughy. I then made the filling for it and tried to roll and seal it, but, it was unsealable, I think mainly because they were cooked in too much oil, although I reduced the amount used significantly. I tried wiping off the excess oil but it just didn't work. in the end I used tooth picks like needle and thread to hold it together, but in the end when I place it in the pan to fry, all the oil went into the wrapper and it was an oil mess. this was difinitely an epic fail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nora Dahlstrom"
},
"reviewBody": "good recipe but i didnt bother with your method of that weird cooking before i fry to make egg rolls. otherwise pretty good. and to anyone else be patient and practice. you will get the hang of it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "iamcookn"
},
"reviewBody": "Wow. I don't even know where to start. Perhaps my life long experience with making egg-rolls from store-bought wraps has been completely \"\"nontraditional\", but these wraps will make nothing like egg rolls you see in restaurants, kitchens, or even the frozen food section at Walmart. This method of cooking the wrap in a pan seemed odd but I wanted to try it and since I have had lots of experience making egg-rolls I felt it was worth a try. Like other reviewers I too struggled to get the batter thin enough, a crepe would have been preferable to what I was able to produce. I added more than an extra 100ml of water to get the batter even close to thin enough to work like the description. Then, these wrappers break and split when trying to roll them. Frying was out of the question since the oil would just go straight into the egg-roll and the filling was falling out. I tried baking instead to at least preserve my filling, but despite sufficient heat and time, the wraps stayed un-crisp, pasty white, and rubbery. I made a small batch as I knew this was a test (and more than half the wraps went in the trash before I even began to fill them) so the loss was not too great, but the only way to stomach these egg-rolls was to dump them out and just eat the filling with a fork. (note I didn't say un-roll since this was not necessary as the filling was falling out on it's own and if you pick up an egg-roll it fell to bits in your hands.) The edges of the wraps that were not 100% ru"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Greg Ridgeway"
},
"reviewBody": "I didn't care for this egg roll technique. Too messy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Twisted"
},
"reviewBody": "These made crepes. Looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jlymac"
},
"reviewBody": "Easy to make. Added a lot more water than called for. It needs to be a very thin batter to swirl in the pan like a crepe. Only the thin ones made it to wrapping, the rest broke. Seal the edges with a thick flour and water \"glue\" to keep closed. It took a few attempts to get the technique down. Keep trying, it is worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra in TN"
},
"reviewBody": "Wonderful treat and fun to make for my daughter and me! You need TIME to do these wrappers. Reviewers covered most everything, but I will add one HOPEFULLY HELPFUL TIP... USE any MESSED-UP DOUGH TO MAKE CHINESE CRACKERS! Just fry 'em up for a real \"no-fail\" treat! Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lallee"
},
"reviewBody": "Would make a bigger batch next time. Turned out great and was pretty easy. I didn't have a wok so I used a small skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Grace Goudy-Porr"
},
"reviewBody": "these are not bad. I prefer the pasta dough base that you roll out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nataly Diaz"
},
"reviewBody": "Will def make again. Super easy to follow !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Patricia Shadd Gerstl"
},
"reviewBody": "Theses wrappers do not hold together and dont fold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobby1970"
},
"reviewBody": "I tried this recipe with gluten free flower because my step daughter has celiac disease. I added a little more water than was called for and used a cast iron frying pan about the size you would want and put 1/8 cup of batter in and the dough came out good but had some trouble getting them to seal so I litely floured them and threw them in the fridge for a bit and it helped some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Gordon-Lucas"
},
"reviewBody": "I oil a hot griddle, swirl batter to make thin wrappers. I have used these with potstickers; rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "gigi stoner"
},
"reviewBody": "A lot of work and did not turn out. It took a lot of time to make them one by one. Maybe I did something wrong. I'll just stick to store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "These egg roll wrappers are excellent! I would recommend that you make sure they are warm before you fill them. I am definitely going to make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty Chamberlain"
},
"reviewBody": "I made these once before, and I just made them again. These are terrific. Way better than the store bought kind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "The taste was good but I found them a little too thick. It was difficult to get them to spread thin. I used a non-stick pan instead as I don't have a wok. Next time, I'll thin out the batter a tad more. Great recipe for beginners though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amanda"
},
"reviewBody": "This was easy and great. I used a crape maker they came out awesome and so easy. Little skill needed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "siesha27"
},
"reviewBody": "These tasted great. After reading the reviews, I added a little more water so my batter was runnier. Instead of rotating the pan, I used a basting brush to spread the batter out thin in the pan. It worked great and they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ky"
},
"reviewBody": "needed extra water...a couple of tablespoons per recipe. Try to make them 5x7\" for a couple of tablespoons of filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annwella"
},
"reviewBody": "Great recipe, the only problem I ran into was that it needed more water probably around 1 cup to 1 1/4 cup. After making many batches I found the thinner wrappers (a little thinner than a crepe) turned out best for stuffing and frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Emergy"
},
"reviewBody": "I couldn't determine the thickness in the wok. This is way too much mess and looks more like a crepe pancake than an eggroll wrapper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuzyQsBread"
},
"reviewBody": "Not really an egg roll wrapper as they are more of a pasta-ish type thing...but this IS a great crepe recipe ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ShepR"
},
"reviewBody": "Epic failure...probably more my bad though...they were more crepes than anything. I will be buying wrappers at the store from now on..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "arwenita75"
},
"reviewBody": "These made a thick crepe - used them as such and ended up going out to buy egg roll wrappers 'cause they just didn't work. Good crepe recipe I guess, if you don't have milk in the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WALLIZGRL"
},
"reviewBody": "These are great, I don't have a wok but I do have a crepe pan and I use that. I almost always double this recipe. Love them, mine do come out a little thick but no one complains."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen H."
},
"reviewBody": "The first two that I made were a bit thick, but once I got the hang of it, they turned out great! MUCH better than store-bought!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kimmy schmidt"
},
"reviewBody": "they seemed very eggy, were hard to seal, and never crisped up. good idea but either going to find another recipe or buy them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Dittmann"
},
"reviewBody": "These are great! (and easy once you get the hang of it)..To keep them from getting too thick, pour the batter in a circle... literally an \"O\" shape, instead of in a pancake-like circle. Then pick up the wok and shake/roll it around until the dough is spread thin and the circle is filled in. I found I didn't need any oil in my Teflon coated wok. One batch made about 6 wraps for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "POOKIETHEBEAR"
},
"reviewBody": "These are good. This was the first time I tried to make egg rolls, so I have nothing to compare them to. Mine ended up a bit too thick towards the end. I needed to thin the batter out some as I went. The taste was very good - filled and plain! If I make egg rolls again I would not hesitate to use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindaw2003"
},
"reviewBody": "First attempt turned out pretty good, not to hard to make! first time making eggs rolls at home period so this was a good simple recipe for the wraps without adding to much stress."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kinse10"
},
"reviewBody": "Really good, really simple and easy. And they taste and feel like real egg roll wrappers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sugarplum9085"
},
"reviewBody": "I had the hardest time with these, and I did do them right to a T. When I used them for egg rolls they kept breaking apart or coming undone despite my good attempts. It was incredibly frustrating, so I gave up and bought some egg roll wrappers at the grocery store, and in the end I am glad because they tasted and looked as authentic as egg rolls can get!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lolis Hernandez"
},
"reviewBody": "I think they taste very good, my mom and my daughter loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Giselle"
},
"reviewBody": "very easy to make, not exactly like the ones you buy at the super market but still very good. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Peters"
},
"reviewBody": "Make sure your batter is fairly thin! Don't use the given proportions verbatim but rather use your judgment to make sure they'll flow out so that they wind up nice and thin. Otherwise you'll wind up with little pancakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Bailey"
},
"reviewBody": "These are fantastic, filled them with curried beef, onion, bean sprouts and curry powder. Who needs take aways when there just as easy to make yourself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jabooshi"
},
"reviewBody": "These are very good! I put some shredded cabbage &amp; carrots and canned chicken &amp; terriyaki sauce &amp; used that to stuff them. They were so easy. I used a spoon to spread them as thin as I could get them. Mine turned out crepe-like, but I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tinabanana"
},
"reviewBody": "this was my first time making wrappers and egg rolls but it seemed to me the batter was too thick so i added some water to it. i used whole wheat flour and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NANCY861"
},
"reviewBody": "Excellent! I added parsley flakes for color and some onion powder for a little flavor and they were super!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janae"
},
"reviewBody": "These work great, but are definitely an acquired talent! I made them in a small frying pan set just below medium. I actually used about 1/8 the batter per wrapper (not 1/4), but doubled the recipe so I could throw out ones I ripped. They ended up being 5-6\" by 5-6\" (I tried to make them square-ish so they'd be easier to wrap). Be careful not to over cook them - the bottom side should be barely, barely golden, the top just barely not wet. Let them cool for a minute before wrapping, or they tear. Don't let them go too long, though, or they crack. DO NOT OVER FILL! Each wrapper makes one egg roll appx. the length of your thumb and 2-3 times the size. Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "catlover"
},
"reviewBody": "I also found these wrappers to be thick, but they were still tasty. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe tonight and I had a similar experience to the people who said it was thick and like a crepe, even after I added my filling and fried it...but it still tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janis Dee"
},
"reviewBody": "Did not enjoy this recipe at all. Maybe it was just me, but the wrappers turned out very thick and didn't get crispy once I used them to make eggrolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EMILY91183"
},
"reviewBody": "My wrappers kept cracking. I honestly have no idea if I cooked them too little or too much, because the temperature suggestions made no sense. The ingredients may have been right, but without better instructions on how to cook them, it just won't work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BroncosFan"
},
"reviewBody": "This is a great recipe for homemade egg roll wrappers. Have some patience - it does take a little practice, and make sure you roll them thin. I had no problems with them turning out like \"crepes.\" Just make sure you fry them long enough after filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This a great recipe. (I have used thhis recipe for more than 30 years) I often have to double or triple it. If you have any dough left - bake it with cinnamon and sugar as a treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LIZ1888"
},
"reviewBody": "This is not like any egg roll wrapper I've encountered. This made a crepe. Not what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melissa Abercrombie"
},
"reviewBody": "The egg mixture for these wrappers came out way too thick &amp; lended a very doughy and chewy texture.\r\nAm I doing something wrong?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pheobe Alverson"
},
"reviewBody": "These were fabulous. I bought rice paper instead of egg roll wrappers and thought I was doomed (I had already made the filling and everything!). Luckily my husband checked Allrecipes. This recipe saved my dinner. It didn't make enough, so I had to make another batch (even for just the 2 of us). But they are SO easy it wasn't a big deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tasty, easy and great to use! Try them with the sambusa recipe here on allrecipes, or eat them by themselves. I found that a skillet was much easier to use than a wok."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22532/egg-roll-wrappers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
"name": "Wraps and Rolls"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16366/appetizers-and-snacks/wraps-and-rolls/egg-rolls/",
"name": "Egg Roll Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22532/egg-roll-wrappers/",
"name": "Egg Roll Wrappers"
}
}
]
}
}
, "about": [
]
}
]