				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Egg Salad III"
,"datePublished": "2000-03-15T14:06:41.000-05:00"
,"dateModified": "2018-03-21T12:05:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "OLIVIES"
,"url": "https://www.allrecipes.com/cook/27718"
}
]
,"description": "This is a great egg salad recipe that a woman I babysat for made! The key ingredient is the chopped pimento-stuffed olives."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IHGfsRGA-tF4gb0j5USD8DYhPns=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3275381-3dd30410d61b448fb8354d6b2b10a435.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Egg Salad III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "125"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "349 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "383 mg"
,"fiberContent": "0 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "441 mg"
,"sugarContent": "1 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"8 eggs",
"0.5 cup mayonnaise",
"1 teaspoon ground black pepper",
"0.25 teaspoon paprika",
"2 tablespoons chopped pimento-stuffed green olives" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place eggs in a medium saucepan with enough cold water to cover, and bring to a boil. Cover saucepan, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel, and chop."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, mix eggs, mayonnaise, pepper, and paprika. Mash with a potato masher or fork until smooth. Gently stir in the olives. Refrigerate until serving."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Conner"
},
"reviewBody": "Great recipe little yellow mustard for me made it perfect. I love the olive idea I have never tried that before and I love olives. PS I didn’t waste all my eggs I ate them all ! Lol Very good and nice to have a little different once in awhile. Thanks for sharing !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dori Owens"
},
"reviewBody": "This is how my mother always made egg salad and how I do it. I am surprised at how many people have never heard of it made with olives instead of relish! We always add everything to taste, no recipe needed. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Ochoa Sugg"
},
"reviewBody": "I took the advice of other reviewers and added yellow mustard. It also needed salt but I really liked it! I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Hindman"
},
"reviewBody": "Instead of chopping the olives, I sliced them and decorated the top of stuffed eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darrell Cole"
},
"reviewBody": "I subbed chopped green onions for the olives. Otherwise this is a good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Duncan"
},
"reviewBody": "I used miracle whip,added finely chopped onion,dill relish and finely chopped green olives, now that's a egg salad! Put on tossed bread with lettace"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I love the addition of the Spanish olives. I tasted it as the recipe is... and felt it needed a little something more. So I added 1 TBLS Djoin mustard, 1/4 cup of minced celery, and three chopped scallions. Then is was perfect to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evet"
},
"reviewBody": "I made no changes and we loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pam"
},
"reviewBody": "This is a great and simple recipe.....loved the olives. I also added dijon mustard, chopped celery, onion &amp; peperoncino for more texture &amp; flavor. Great as stuffing for tomatoe or on bed of lettuce. Will make many more times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "This is just like my Mom's recipe that I grew up eating! I use a little Morton's Natures Seasoning and a dash of olive juice! I love this recipe in the summer with romaine lettuce or crisp pita chips!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Kelley"
},
"reviewBody": "The olives were key and I loved it! I used three eggs, 2 scoops of mayo, 5 olives diced, 1/2 cup celery, some dried minced onion, celery salt dash and dried dill-so so good! This is a def keeper for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lolly"
},
"reviewBody": "I don't like green olives either but I don't make egg salad without them. This recipe is how I make it., almost. I didn't use nearly as much pepper but what took it over the top for me was the mustard. I used about a half teaspoon of plain old salad mustard. Never thought of it before. To prepare, I use an egg slicer, Slice first, then turn the egg and dice. I have a little egg masher to finish it off. This is a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colin Campbell"
},
"reviewBody": "I used some pickled gherkins and it came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah F. Carr"
},
"reviewBody": "FINALLY! My mother made this and I grew up knowing only this kind of egg salad, which she called \"Egg and Olive\"! I've never had an actual recipe, as she and I just made it to taste. This recipe will come in handy as I pass it around to relatives and friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenisa Barr"
},
"reviewBody": "I feel like this needs more kick, maybe green onions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "I’m of the school of thought that when it comes to cooking season to taste! What is too salty/not enough salt, bland/bold, too peppery/needed pepper varies, depending on whose palate is doing the tasting! So…if it’s too bland, add some seasoning! I added pretty much the first thing I grabbed, some Sazon seasoning and a bit of ground mustard, tho’ any number of things I had in my spice cabinet would have worked – Penzey’s Fox Point Seasoning, Jane’s Krazy Mixed Up Salt, Lawrey’s Seasoned Salt, celery Salt, garlic salt, even Montreal Steak Seasoning – and the list could go on. Seems too peppery? Again, add it to taste! Start with a small amount, add more if you like. There are no boo-boos that way. I didn’t mash the eggs; I prefer my egg salad chunkier, however… if you were going to make canapés with this, on rye rounds, for example, with a garnish of fresh dill or parsley, the mashed version would not only spread better, it would be more fitting and easier to eat as a finger food. Also, it’s no problem to add more or less mayonnaise to your liking. I didn’t measure; I just dumped it in there till it was the way I wanted it. To please both Hubs’ and my palates, I knew we’d like the bite of fresh green onion and the crunch of chopped celery, so I added both. I’ve never added green olives before (tho’ I recall adding them to AR’s “Mother-in-Law Eggs” and liking them) and, while I may not add them routinely, I did enjoy them for something different than “the usual.”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvie"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ole"
},
"reviewBody": "Like what I make minus the paprika , but I like chunks of egg, so I just cut the eggs in 1/8's . I cut the olives in 1/4's. I add a little of the liquid from the olives too, maybe a tablespoon. When you mix in the mayo the eggs will break up a little more. If you mix too hard you won't have any chunks of egg left. The yolks pretty much disappear during the mixing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "This was excellent, with the green olives being a nice and different addition. After reading some of the reviews, for extra flavor I also added small amounts of garlic powder and Montreal Steak seasoning, and some chopped celery. I usually don't mash egg salad, so I left it chunky. Thanks OLIVIES for great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer McFarland"
},
"reviewBody": "This was very good. I love olives; so, I liked it a lot. Must be a fan of olives; or, you might not like it. But, it was overall very good. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bisdoggie"
},
"reviewBody": "I grew up with this as a staple from both my mother and grandmother. We always add just a touch of yellow mustard. It was made in small batches too, 2 eggs at a time usually and way less mayo. I think maybe 1 and 1/2 tsp max."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "like to cook"
},
"reviewBody": "Was looking for something different for egg salad and came across this recipe. Liking olives, I gave it a try. Great! I did add chopped celery as I like the flavor and added crunch. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "z24pride"
},
"reviewBody": "I too love eggs, and love olives, but when I mixed the two my taste buds weren't thankfull!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pshaw"
},
"reviewBody": "I loved this egg salad. I even added a little shredded cheese the second time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Flint"
},
"reviewBody": "A good base, but felt it needed more spice. I added a teaspoon of paprika, doubled the black pepper, a half tsp of cajun seasonings, and a finely chopped rib of celery and a green onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Starch"
},
"reviewBody": "Love this egg salad, for both taste and cost!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wannabe chefette"
},
"reviewBody": "I would have never thought of adding Spanish olives to egg salad but it was delicious! Will definitely do this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wilmany64"
},
"reviewBody": "I tried this recipe yesterday after a craving for egg salad, no celery. I do love olives and never thought of adding any. I did add a bit of Dijon mustard and mixed with LF mayo. I served on romaine like others suggested. It was the best and no bread?? even better! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROOBUNNY"
},
"reviewBody": "This is the recipe I grew up eating with the exception of the paprika. If you're like me and love Spanish olives, you'll love this recipe - I always wind up popping about 4 olives into my mouth while cutting the others for the salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "makuplver"
},
"reviewBody": "Thought this was a great base recipe, but made a few additions. I added a little dijon mustard, a few dashes of tabasco, some dill weed, and some lemon juice. It made fantastic sanwhiches, or just all by it's self. I will definatly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHORECOOK"
},
"reviewBody": "GREAT RECIPE! We love olives so I knew this would be a hit. I skipped the paprika and added a little Gulden's mustard. I did not mash the eggs as we like them chopped. I added the chopped olives to taste rather than measuring them. This was so good! Next time I think I will add some chopped onion. Thank you OLIVIES for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I have always made my egg salad with spanish olives (the ones in this recipe). And, I've always used my potato masher to stomp the eggs because I couldn't stand to have big chunks of egg whites. This recipe is good, but I guess it's the same one I've been using forever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewMommie26"
},
"reviewBody": "This egg salad recipe was exactly what I was looking for. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristin"
},
"reviewBody": "YUMMM!!!! This was a delicious break from the norm. I added a little mustard to suit my taste and doubled the amount of olives and it was absolutely delicious. This is definitely my new standard egg salad recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "parrishioner"
},
"reviewBody": "This is a good variant on an old favorite- the paprika is a nice, subtle addition. The olives add some salt, but you may want to add a little more. (I did!) Like all egg salad, it gets even better after it's had an hour or so to mellow in the fridge. If you can wait, that is..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa"
},
"reviewBody": "In one word \"delicious\". I didnt have pickle relish on hand and found this recipe. I never realized that egg salad had variations, I was skeptical about the olives but it is great with crackers Thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "I hate giving low ratings, but this just isn't the egg salad I expected and my husband loves egg salad. I liked the idea of mashing the eggs vs. chopping and the idea of green olives. He loves both so I thought it would be worth a try. After looking the recipe over there's way too much pepper. I cut that down to 1/4 tsp. This had no flavor so I added some chopped green onion and dijon mustard. It saved it a little, but not much. It's more like a spread than a salad. I'm going back to Jen's Heavenly Egg Salad as my standard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muffin Mom N Garlic Girl"
},
"reviewBody": "This is pretty much my standard recipe but I omit the pepper and add about 1/4 chopped celery. It gives it an awesome crunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Fiona Turro"
},
"reviewBody": "I was looking for something different to do with Egg Salad. Loving olives made me think this would be interesting. I was skeptical when it came time to actually put the chopped olives into the egg mixture, but I did it anyway. I'm afraid its just not to our taste. I ended up putting in diced celery and alot more paprika to try to perk it up. Sadly, that may have made it worse. Oh well, back to my same old boring recipe. Thanks for posting anyway...I'm glad I at least tried it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tinkerfaire"
},
"reviewBody": "I made this as is and test tasted it to make sure is was suitable to out tastes. I love the idea of putting green olives in but it wasn't so good. Not enough crunchines and bland. Thankfully I was able to fix this by adding onion, celery, green pepper, a little mustard and about 1/2 a tsp of garlic salt. Turned out great after that as is the repcipe just isn't the greatest for us, it has a good base just needs some modifications to make a good egg salad sandwhich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kay"
},
"reviewBody": "First egg salad I've ever made.\nI hit it with a bit of mustard. It really tasted good. I think it is the olives. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHOPPERS70"
},
"reviewBody": "I'll definitely use green olives again. Great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CrazyCook55"
},
"reviewBody": "Good base recipe but found it a little bland. I added about 1/4 cup of yellow mustard, 1/2 teaspoon of onion powder, and a dash of cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KMBLEE"
},
"reviewBody": "I grew up on this recipe minus the paprika and pepper. The more olives the better! I don't even like green olives! Just put a glob of mayo to your preferred creaminess in with the chopped eggs, add chopped olives, start with a little and add to taste. For even more flavor add a little of the olive juice! No salt needed!! I just wish it was filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie V."
},
"reviewBody": "I added some dehydrated onion, fresh ground pepper, mustard and a little sugar, AND a some cut up Velveeta cheese. Very tasty! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Bolonski"
},
"reviewBody": "This recipe was a great one for basics. For all those who found it too bland, you are suppose to be cooks add to it make it your own. I used Imported spicy Hungarian Paprika give it a good taste and kick, also increased the olives to give it a crunch,also added mustard, its a great recipe make it your own"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Dill"
},
"reviewBody": "Very good recipe, I omitted the olives because I dont like them. But the paprika gave it a nice touch. Use salt and pepper to your taste, adding a little bit at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy&Billy"
},
"reviewBody": "I really enjoyed this recipe and it made great sandwiches for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "I thought it a little bland. I added more olives &amp; chopped dill pickle and a dash of onion powder to liven it up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aaronmonto"
},
"reviewBody": "Probably my favorite egg salad recipe ever! Creamy and chunky, but not too much of either. The olives were also unique, but the recipe holds its own without them too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessjoy"
},
"reviewBody": "Finally! This is a great egg salad recipe. I just added some yellow mustard. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erika Davis"
},
"reviewBody": "This was very good. The olives give it an unexpected flavor. I didn't use paprika (out of it) but I added some salt and chopped celery. My four year old loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jewel"
},
"reviewBody": "What a GREAT recipe! The olives give it such a unique taste. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mamacita"
},
"reviewBody": "I tried this recipe because it was published in the cookbook. I figured it must be great! I didn't think much of it. It was mushy, and rather bland. I did doctor it up with several other spices and that helped. I just think at that point you are creating a new recipe and not using the one provided. Not my thing at all. If you like very bland and creamy egg salad this may be right for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara Butler"
},
"reviewBody": "Very good! I love green olives, never thought to use them in an egg salad. I added a dash of Frank's hot sauce for some extra kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marnie"
},
"reviewBody": "I don't think so. As someone else said, I love eggs and I like stuffed olives but the two just aren't a good combo. The recipe also needs salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CYNDI9"
},
"reviewBody": "I love eggs, I love olives, I hated this! The flavors just don't go well together. I am from the south and it's sweet pickles and Duke's mayo all the way for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe - entire family from adults to grandchildren love this egg salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMACGOLF"
},
"reviewBody": "Y U M M Y ! ! ! ! Thanks for sharing it! Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChickadeeD"
},
"reviewBody": "My husband said 5 stars but my son and I agree on 4 stars. I would make it again but I would probable add celery for a little crunch and extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AGGIEMOM03"
},
"reviewBody": "I made this without the olives, because I didn't have any and added pickle relish and mustard instead. I thought it needed salt... I think with the olives this would be just perfect and can't wait to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ELLY777"
},
"reviewBody": "I love the olive addition! This is my favorite egg salad recipe. It's so simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Lynn"
},
"reviewBody": "Loved this. I added more green olives because we love them. This was such a wonderful addition to egg salad...it takes away that overwhelming \"eggy\" taste. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "This was so good Stacey! I love olives and egg salad so needless to say, my taste buds were doin' the tango! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOSIE"
},
"reviewBody": "I love eggs. I scaled this recipe down since it was just me eating this and I added a few more spices to suit my taste. I did not have the olives, so I left them out and I did add a little mustard along with the mayo since I've always made it that way. Thanks for sharing Stacey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DeirdreDee"
},
"reviewBody": "This is an old recipe, I have been using a similar recipe from a 1959 cookbook for years (Mary Margaret McBride's Encyclopedia of Cooking): 3 eggs, 1/2 cup celery, 1 TBSP mustard, 2 TBSP mayo, 1/4-1/2 cup chopped olives. Since I work nights I have to take my lunch to work every day &amp; I pretty much always bring either egg salad or chicken salad sandwiches. This recipe is very tasty &amp; fast to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suki"
},
"reviewBody": "i found this a good basic recipe to work with. You could add mustard, or celery etc to it to add some variety to it. \r\nI'm not fond of olives in the salad ( it was worth trying anyways). For myself, i would only use real mayo- i feel that miracle whip ( and other subs)would not do this recipe justice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jean Tagliere"
},
"reviewBody": "Pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe;both my three year old and one year old love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QUASINAUGHT"
},
"reviewBody": "Really good. I hate olives so I left them out. I used mirical whip. My husband and 7 year old daughter both liked also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is, without a doubt, the best egg salad I have ever had. The ingredients are simple, the results amazing. The only change I made was to add a dash of worstershire sauce. All other egg salads pale in comparison -- Thanks, Stacey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Rudnick"
},
"reviewBody": "I've never been big on egg salad but...this recipe has converted me. Good stuff. Easy to make. I'm glad to have a new food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TCHR2BEAGLES"
},
"reviewBody": "quick and easy, I added chopped celery for more crunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lesley"
},
"reviewBody": "This was very good. Followed the directions exactly and thought that it did not need anything added to it. Thanks Stacey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PRESIDENTJIM"
},
"reviewBody": "Great recipe. I used mustard also. Everybody loved it. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ETOTARO"
},
"reviewBody": "I just made this and it is VERY GOOD. I made as first instructed and took a taste and found it a little bland, so I did as a few others instructed and put in some mustard. (I used Dijon and about 2 tsps. That made it much better!) The olives definately gave it that extra kick that my old recipe was missing!\r\nLoved using the potato masher! Made it so creamy. Served over lettuce instead of as sandwich, as I'm not a big bread fan! \r\nI will be making this again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HUOXU"
},
"reviewBody": "Not the first time I've made egg salad but I feel this is a pretty good recipe to start with but like another I also added mustard and also some salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved your Recipe. It was so good that it was gone in a day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DITTOBEAN"
},
"reviewBody": "I used a little more chopped olive and added a bit of chopped parsley. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "COOKER476"
},
"reviewBody": "For such a SUPER SIMPLE egg salad recipe, this was VERY, VERY GOOD. I made 1/2 of it to serve 2, and it made more than 1 cup, even before I added about 1/4 cup chopped celery. I deleted the lettuce (didn't have any). This was DELICIOUS. (I cooked the eggs my old-fashioned way: cover them with cold water, rapidly bring them to a boil, boil them rapidly for 13 minutes, and then immediately cool them in ice water. They peel wonderfully every time.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobby Darnell"
},
"reviewBody": "I was fortunate enough to have spent four days in Augusta at the Masters recently and lived off of the egg salad sandwiches they serve. I have been searching for a recipe similar ever since. This is not what I have been looking for but it is very, very good. I love black pepper more than most...as well as green olives, but unless you really pour on the pepper in your other dishes, you may want to ease back a shade. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOTHEROFLITTLE"
},
"reviewBody": "Ive always used sweet salad cubes but I love green olives so I thought well maybe it will be good.I like it with sweetcubes better.Thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WLWISEMAN1124"
},
"reviewBody": "First time I have ever tasted or made egg salad. This was Wonderful! Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ERIKA MD"
},
"reviewBody": "Delicious egg salad! Simple and suitable for even picky eaters!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLE888"
},
"reviewBody": "Absolutely delicious! I didn't change a thing about the recipe and it was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great, and extremely easy to make egg salad recipe. My family loves green olives, so we added a bit more. Add a little lettuce on the sandwich, and it is absolutely delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KITTYROCK01"
},
"reviewBody": "This is REALLY tasty! I made it true to recipe, except I added about a tablespoon of yellow mustard and threw in some extra olives &amp; juice! Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MBSFOOD"
},
"reviewBody": "This is the simplest most delicious thing I have made recently. I made it for my kids and I for lunch, and it was done quickly, plus they enjoyed helping. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "PUREDOLLER"
},
"reviewBody": "i made this recipe and it was incredibly bland, it needed a kick of something... maybe mustard? i just dont know...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "My4NonBlondes"
},
"reviewBody": "This is a pretty good egg salad, I made it exactly as written. It was lacking a little \"zip\", though, and I added a tablespoon or so of relish after I tasted the finished product, and that helped. I think next time I'll make it with miracle whip, and it will be a 5 star recipe then!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCHOUTEN"
},
"reviewBody": "We loved it. A little different than I usually make. Will use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "This is a good recipe that is different from the ordinary egg salad. I did add a little chopped celery and some celery salt. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YUMYUM123"
},
"reviewBody": "My BF made this recipe and being an olive fiend, he added additional olives. We both really enjoyed it but he had used sliced olives and I thought that next time, we should chop up the olives so that they're spread throughout the salad instead of having concentrated bites. But definitely the egg salad recipe we'll use from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BABSKITCHEN"
},
"reviewBody": "This was a very good recipe for egg salad. The potato masher is a nice idea. I am not a big fan of green olives but they taste great in here and I think the recipe could use even a little more. Thanks Stacey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a wonderful dip for ruffled potato chips!! That's the only way we eat it, and it's a much sought-after recipe at parties! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUSTCYN"
},
"reviewBody": "If you like olives you'll love this egg salad. I leave out the paprika and add a small amount of yellow mustard(only about a teaspoon). I usually dispense with the celery too. But the lettuce is a must. Don't forget to salt and pepper to taste too. I am always a lot more generous with the olives too. I've been making egg and olive salad for years. It's my favorite. When there are non-olive lovers around you can always make your favorite egg salad recipe and then add sliced or chopped olives on the sandwich instead of mixing them into the salad. I used to get egg and olive sandwiches made in a restaurant this way. It tastes just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PRAIRIEMOMMY"
},
"reviewBody": "I thought it was really good. I didn't follow the instructions given to make the eggs, so I have no comment on those (I just made them the way I always make them). I think the kids will even like it because they love olives. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is not good. The eggs come out way underdone. I would not recommend it at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amy Barker Roark"
},
"reviewBody": "I Love Egg Salad &amp; I Love Olives but this recipe was terrible. Too much pepper &amp; too much olive. I wasted all my eggs making a big batch of this. It was awful. I am sorry. I was so looking forward to liking it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16632/egg-salad-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/96/salad/",
"name": "Salad"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1986/salad/egg-salad/",
"name": "Egg Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16632/egg-salad-iii/",
"name": "Egg Salad III"
}
}
]
}
}
, "about": [
]
}
]