				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Emergency Garlic Bread"
,"datePublished": "2018-03-21T12:45:22.000-04:00"
,"dateModified": "2022-11-11T11:39:19.000-05:00"
,"author": [
{"@type": "Person"
,"name": "CANDYLAND7"
,"url": "https://www.allrecipes.com/cook/1148876"
}
]
,"description": "This garlic bread recipe uses sliced hot dog buns brushed with butter and sprinkled with garlic powder for a quick and easy side with 3 ingredients."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8vG_2KzBpiLOfLwcX1p0pFt276I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/805899-6a46eb7a7993488198209449dc73120b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Emergency Garlic Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "136"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "160 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "235 mg"
,"sugarContent": "3 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"4 hot dog buns",
"4 teaspoons butter, softened, or as needed",
"2 teaspoons garlic powder, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Set an oven rack about 6 inches from the heat source and preheat the oven&#39;s broiler."
} ,{
"@type": "HowToStep"
,"text": "Separate buns and spread butter onto the cut side of each one. Sprinkle with garlic powder. Place on a baking tray."
} ,{
"@type": "HowToStep"
,"text": "Toast under the preheated broiler until golden brown, about 4 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany Halter"
},
"reviewBody": "In an absolute pinch it's a go-to at our house. If you've got real butter and a clove or 2 of garlic it's really not bad at all. We also use this \"recipe\" for toasted sandwiches of all kind. Kids love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Taylor"
},
"reviewBody": "Lol this is awesome. I thought I was the only one that does this. Add your own flavors. Make it your own! Thanks for sharing and making me smile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cuppycakes"
},
"reviewBody": "Like other reviews stated - this is for emergency only"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle21689"
},
"reviewBody": "Lol perfect for an emergency. I didn’t have garlic bread to go with my spaghetti. Turned out pretty good. I added cheese, chili flakes and Italian seasoning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jeannie"
},
"reviewBody": "I've been making this for years! Didn't even need the recipe. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I will never worry about forgetting to buy or having no garlic bread. Perfect emergency recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annabelle Ward"
},
"reviewBody": "Used hamburger buns I had laying around, cut them into thirds, spread butter as well as Italian seasoning, garlic, and salt over them. Turned out soooooo perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ccmj2008"
},
"reviewBody": "I like it better than frozen garlic bread. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie"
},
"reviewBody": "Heard this referred to as \"poor people's garlic bread\"! However, when I was a kid, I used to make it on Wonder Bread and stuck it in the broiler for a few seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Quick, easy and delicious-my kind of recipe! I tried it with toast, and even that was yummy. Sometimes I add cheese and I might try some Italian seasoning. Now I can have it whenever I get a craving. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtchrista"
},
"reviewBody": "1st review I've done, maybe marked twice \"if made it\" but this I had to lol b/c I thought everyone did this lol! Growing up my mom made this, I did for my family, I will have to ask if my sons if they do in theirs! I love roasted garlic and when on hand I blend it in the butter, heavenly! A reviewer said they had trouble with lumps when mixing the garlic powder in with the butter. I've always used that method to be sure it's seasoned to taste (love garlic) never had lump issues. Maybe your butter wasn't softened enough or just required more blending. I'd give it another try as it is the way to be sure if you've added too little or too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OhioWolverine"
},
"reviewBody": "Unless you are a total food snob (in which case you shouldn't be looking for this recipe anyway) this is a GREAT alternative when you find you have no garlic bread! I love love it! I do add some Italian seasoning to the butter along with the garlic powder. ANd I don't broil. I just bake on 425 for around 6 mins or so. THANK YOU for this! Thank you for making the rest of us not feel like freaks when we have been using this recipe in a pinch for years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maureen Sanchez"
},
"reviewBody": "Using the broiler was a bit hard for me since it was below my oven. Since there wasn't a specified heat my first batch was burned. But to make sure they're crisp and not burnt, I put it at at 325 then let it broil for 10 minutes. It's longer sure but made sure they were golden brown and not black."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Bickel Shireman"
},
"reviewBody": "This is the garlic bread recipe my sons grew up on, especially when the budget was tight. It is what it is. Cheap, easy way to use up leftover bread or stretch a dollar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Great Recipe....I looked it up because it was an emergency ..... but after making it, I won't be buying garlic bread anymore...it was great ..the only difference is everyone like it better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nikyoujj"
},
"reviewBody": "Great for when you forgot the garlic bread! Works well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "This was a last minute saver. My family enjoyed it didnt even know it wasn't our usual brand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashly"
},
"reviewBody": "We have been doing this for years but we make it with regular bread. I also put a this layer of parmesan cheese on it and then sprinkle the garlic powder. We think its amazing although actual garlic bread is still better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just the wife and I now so it seems there is always leftover bread that I put in the freezer. Hating to waste anything, I routinely use it for garlic bread. Not as good as using fresh bread but very good. I have used ever kind of bread and rolls imaginable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quinie Leary"
},
"reviewBody": "I do this all the time with the inexpensive French Sandwich Rolls you can get from the Kwip Trip convenience stores (Aldi's also carries them). They are cheap (less than a $1.50 a package for 6), and make the most incredible crusty, chewy garlic bread! A swipe of margarine or butter, a sprinkle of garlic salt or powder, and a dash of parsley, bake at 400 for 7-8 mins and viola, instant yummy garlic bread without the fuss or expense. Each roll gives you two individual good size slices like the hot dog buns so it's perfect. You can sprinkle on Mozzarella cheese if you prefer cheese GB too. Thanks for the reminder that sometimes the simplest is often the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Stephens McCluskey"
},
"reviewBody": "I too, have been doing this for years. It's a great way to use up leftover hot dog, hamburger or sausage buns. A little italian seasoning and some shredded mozzarella will fancy it up too. We often put them on a cookie sheet and toast on the top rack of the BBQ for 5-8 minutes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I grew up with this as \"garlic bread,\" only my mom would diagonally slice a loaf of French bread, then butter each cut and then sprinkle in garlic powder. She then rolled it in foil and baked it for a while. It's the best! I prefer it over spicy, gloppy garlic bread recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "I have made my garlic bread this way for years. The only thing I add is \"Salad Supreme\" sprinkled on top. It makes a great tasting garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "Any type of roll or bread product will do in a pinch. I use anything from hot dog and hamburger rolls to sub rolls, water rolls, you name it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Schteveo Rukiddinme"
},
"reviewBody": "Hot Dog Bun Garlic Bread is the ONLY kind my grandsons will eat.\n\nI can make home made bread, bake the frozen stuff, buy good bread or use the pre-fab stuff from the store, all that is a No Go to all of 5 them.\n\nSomehow, the slightly sweet taste of the HDB's goes great with butter and garlic. [...what am I saying...who am I kidding....I'd eat the dog, or one of my pet goats, if it had garlic and butter spread on it!!!]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I have made garlic bread with hot dog buns many times. I use Garlic Bread Spread and toasted in the toaster oven and then have added Mozzarala cheese and Provolone cheese. Stick in the broiler to melt and brown the cheese. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin Baker"
},
"reviewBody": "I also have been doing this for years and Sara Jo is right, any kind of bread or bun will do. My families favorite (besides Garlic Bread) is when I do this with Bagels!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucylove"
},
"reviewBody": "Garlic bread emergencies happen with shocking regularity in our home and this recipe is my 911 solution. I make it exactly as written (I know! Who does that?) with a really loose interpretation of \"as needed\" and although it is easy to tell the difference between this and Italian bread, it is still quite delicious. Besides, I can only use so many breadcrumbs or make so many burgers, dogs, bun tacos and sloppy Joes. This recipe wins on 3 fronts - it's fast (10 minutes) and easy (3 ingredients), it uses up leftovers, and it's delicious. If that's not worth 5 stars, nothing is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "Easy and very good! Watch the time very carefully because even 1 minute can make a difference. I used my stove's broiler (don't have a toaster oven) and had to throw out my first batch because they burned. :( I used hamburger buns and even went out to get more just to try these again! I added parmesan cheese on a few, but I think I prefer them without it. Thanks for the great recipe CANDYLAND7! UPDATE 2/15: Following another reviewer's suggestion, I just toasted the hamburger roll in my regular toaster. After it toasted, I buttered it, sprinkled with garlic powder and parmesan cheese. In a pinch, this works great (actually it didn't burn like my in my broiler and no heating up the stove)! Great tasting and good for a snack, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanV71"
},
"reviewBody": "I've done this for many years, in fact when I was a kid the school cafeteria served their garlic bread like this with their spaghetti lunch. I add cheeses, garlic, even parsley occasionally to be fancy lol. The kids &amp; hubby love it lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quhethechao"
},
"reviewBody": "I tried this recipe since I had a craving for garlic bread but only had white sandwhich bread! I luckily had steak rolls and decided to try this recipe. I didn't exactly follow the ingredients, just doing it by eye. It did take longer than for minutes, mostly 'cause I didn't know if I should've set my broiler for low or high! I decided to be safe and went with high. It is good when you're in a pinch! It tastes delish and I had it with eggs. However, I put a little less garlic at first so had to add more and stick it in the broiler again. It came out crispy, just the way I like it! Overall, this recipe is great, especially if you cook often or have used a broiler. I am a terrible cook and have only used a broiler once, so I had just a bit of trouble. I would recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mrs. Peterson"
},
"reviewBody": "This was ok but I won't try this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BB Booker"
},
"reviewBody": "I love this recipe simply because I personally look up recipes online when it is an emergency and I have to make do with what I have. It is very hard to find basic, simple, and easy recipes like this one in a crunch. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cailoisa"
},
"reviewBody": "These taste great, and they're so easy to make as an afterthought. I just throw mine in the oven with whatever entree I'm making and adjust the cooking time. Extra delicious when sprinled with herbs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "LOL my mom taught me this years ago when we would have left over rolls! Works great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NMChef1"
},
"reviewBody": "I'd never thought of this, and I often have hot dog buns on hand.\nI have made \"real\" garlic bread recipes, and they're much nicer, but this was pretty decent. I ate the whole batch with dinner! When I made this, I used up a bottle of garlic powder, and it amounted to slightly less than 2 teaspoons - I would've liked quite a bit more. And for the butter, I used 2 tablespoons, more than the recipe mentioned. In my case, the hot dog buns were a softer bread than the garlic breads I'm used to, but that was okay. I guess I'll keep this in mind for occasional impromptu dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaLizGa"
},
"reviewBody": "Even if my guests could tell the bread was different from usual french bread, they didn't care! I could only find kaiser rolls as a viable option and I made garlic butter (from AR) using Earth Balance spread. Four minutes was way too long in my broiler; I would suggest keeping an eye on them from two minutes on. Much cheaper than the freezer and probably even a bit healthier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRANDMA"
},
"reviewBody": "Have used this since I was a bride 53 yrs ago. However, I learned to melt butter and add garlic powder, then just dip cut side of hot dog bun and place on a cookie rack on a raised cookie sheet. Bottom gets a bit crusty also. Dipping gets more butter on evenly. I will try parsley and maybe parm cheese this time. Having Lasagna Christmas Dinner 2013."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mara Kapes"
},
"reviewBody": "It wasn't great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perri Pender"
},
"reviewBody": "My Mom always made it this way or hamburger buns work also its DELISH!!!!! We sprinkle parm over the top also!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wschris"
},
"reviewBody": "very good for what it is - garlic bread in a pinch. no its not going to be the best you ever had, but if you need it quick &amp; easy here you go. i made it w ciabatta bread i had on hand and it worked great. i bet a nice addition would be some parmesan. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I make garlic bread this way a lot of times. Whenever I have extra hot dog or hamburger buns. Works every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jo C."
},
"reviewBody": "This is fine in a pinch. Not terrible, but I knew the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mark Farmer"
},
"reviewBody": "I have done this; it is just Ok, fresh garlic would have been 3 stars. I also try not to buy the cheep hot dog buns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motherof2"
},
"reviewBody": "Awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "Three ingredients and ready in under 10 minutes. I'll take it! My kids loved this as a side to their pasta dish. Great garlic bread recipe when you are in a pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Xenon"
},
"reviewBody": "I've known that for about 9 years now and i'm only a teenager. it also works great with Johnny's salad elegance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurie"
},
"reviewBody": "I love that someone else finds ways of using leftover hotdog and hamburger buns. Family loved it and we are making again this week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sweetpea1021"
},
"reviewBody": "Perfect! we needed garlic bread for dinner and right before i found the recipe someone pulled out a bag of hut dog buns!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Farrell"
},
"reviewBody": "This is a great way to use up old hot dog and hamburger buns. I topped ours with shredded cheddar cheese and shredded asiago cheese. Perfect in a pinch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JCrouch"
},
"reviewBody": "It was creative, but no one in our family liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vrh2d"
},
"reviewBody": "Lol! My mom (a fantastic cook) does this. She's also been known to use plain bread - she used to serve it to me and my siblings with canned chili for a quick lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tat"
},
"reviewBody": "Bless AllRecipes and the contributors for reassuring me that it's okay to make emergency garlic bread this way! I've done it before but always felt kinda guilty about it.\r\n\r\nThat's three leftover hamburger buns put to good use tonight! I did add some Italian seasoning and Parmesan cheese this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oct8pus"
},
"reviewBody": "haha YES. this is ultimate bachelor garlic bread.\ni also use sour dough bread and spread some butter on it, sprinkle it with garlic salt or parmesan cheese then fry it until it's golden brown on both sides."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "breezyauzette"
},
"reviewBody": "I too, have made this before. It is a delicious way to use up hamburger and hot dog buns that are left over from your picnic or bbq since our household only uses fresh unfrozen buns for those 2 meals. The kids also love it because I let them assemble their own and like another member's review stated, it is really tasty with a little Parmesan cheese or finely grated cheese on top.. Mrs. Dash is also a good little spice to sprinkle on top (hence the kid's wanting to make their own.) Great add to this site candland7."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stick a fork in me, I'm done"
},
"reviewBody": "lol!!! made this as a kid all the time. great with pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicia2006"
},
"reviewBody": "Great recipe! I thought it was exceptionally easy and it tasted really good. Also great for a small budget!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "0AshleyNicole0"
},
"reviewBody": "I used garlic salt because I couldn't find any garlic powder. I sprinkled with oregano and colby cheese. Great recipe for when you're in a bind"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kisstal"
},
"reviewBody": "Awesome quick save for the absent minded :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LRoberts"
},
"reviewBody": "I've been using this recipe for years!! Its a success every time!! Yummy;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IowaGardens"
},
"reviewBody": "I also sprinkle some parsley over top to make it look nice :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellieann"
},
"reviewBody": "Quick, easy, and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pennynow"
},
"reviewBody": "Whenever my husband makes burgers he always butters the bun, sprinkles on garlic powder and parmesan cheese and puts them on the grill - after a couple of minutes he puts a generous amount of grated ceddar over each half, grills til melted - You've never tasted a better cheeseburger! He sometimes does this without the burger! Best cheesebread ever! Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kittykolorful18"
},
"reviewBody": "I was making dinner for my family and we needed something to add the table and when dinner was on the table I quickly made this it made it so much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roadee55"
},
"reviewBody": "This is the way I prefer for garlic bread, even more so with kids around. I do add parsley flakes to mine. You can use this same method on any bread you want ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "frecklegirl19"
},
"reviewBody": "Until i was 14 i didn't know there was any other way to make garlic bread, i thought this was just what you do with leftover hotdog/hamburger buns"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Inga"
},
"reviewBody": "I've done this for years as well, not in an emergency, but to be frugal and use up items we already have. If we have company over, I'll serve something else, but this is our every day garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scotcheroo"
},
"reviewBody": "Awesome, easy recipe. Instead of garlic and butter, it works just as well to throw on some cheese for a quick, cheap cheesy bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2bake"
},
"reviewBody": "I am generally an all-from-scratch kind of girl, but on a crazy night, we loved this easy use of the leftover hot dog buns! Just a warning--don't try to mix the butter and garlic powder to spread on top! I tried this the first time, and it just clumped up, so I had to melt more butter and brush it on and then sprinkle on the garlic powder just as written. Thanks for saving my dinner tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vestal1"
},
"reviewBody": "I have used hotdog buns for years and my family loved it also. You don't have to cut and so easy to handle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lofftxdancer"
},
"reviewBody": "Looks like there;s alot of us who have been doing this for many years. Great reminder though. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn Holden Masterjohn"
},
"reviewBody": "This is a recipe I've used for years. Recently, I added Parmesan cheese too. Wow, it really classed it up! Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "foxtell8"
},
"reviewBody": "Who doesn't do this, when we have italian dinner at my Mom and Dads, everything in the breadbox gets tosted with butter and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glendalee"
},
"reviewBody": "I have done this for years. I do mix my seasonings in the butter and spread on any type of bread I have in the kitchen. My husband even liked this garlic bread on regular sliced sandwich bread from the store. I bake or broil the bread in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "covergirl"
},
"reviewBody": "Try this with English muffins, add a little dried parsley to the butter. Makes great garlic bread alone, or add spagetti sauce and shredded cheese to make little pizzas for the little ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caiden's mommy"
},
"reviewBody": "seriously?? Ok so it is wonderful &amp; a way to get rid of old hotdog buns :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TINAVOGT"
},
"reviewBody": "This is a great idea. I also use the leftover buns to make quick cinnamon buns. Just spread with butter and sprinkle a cinnamon/sugar combo and toast/broil. My mom used to make these for us when we were kids and now I make them for my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "babylou319"
},
"reviewBody": "We had a lot of hot dug buns left over from a cookout, so this was a great way to finish the buns off. After reading reviews, I also sprinkled Italian seasoning and Parmesan cheese on top. Great flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreenEyes"
},
"reviewBody": "my kids love this and they don't give a rip it's not french bread! great idea and has saved me many times! (also, great for leftover hot dog / hamburger buns after a cookout! )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BlyJean"
},
"reviewBody": "Our church served these quite often with pasta dishes when we would have fellowship dinners after service. I had forgot all about them as we moved and no longer attend that church. My go to's for day old or leftover bread/buns is usually homemade bread crumbs, croutons or bread pudding...I will be using this simply pleasing recipe as well now that I remember it!! how could I forget such an easy-cheap and great tasting recipe???? Hmmmm....good question.... The church ladies also added shredded cheese to about half of them and left the other half plain for those who don't or can't eat cheese. I will be making these tonight as I have eggplant parmesan....( from this site) that I made late last night ready to go in the oven for dinner. i came on here to look for a quick recipe for garlic bread to accompany my dinner as I don't have any and the nearest store to me is 25 miles ( i live in the boonies on Table rock Lake)....and found this one. I will make a homemade garlic bread spread with some herbs and seasonings and top the little \" french breads\" with an italian cheese blend and then broil until light golden and bubbly!! Another reviewer suggested serving these with sloppy joes....I have some leftover burger buns as well and will pt sloppy Joes on the menu for NFL sunday coming up this weekend !! These would also be a great base for a meatball sub.... I gave it a 5 for the ease-low cost and versatility of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wannabe chefette"
},
"reviewBody": "I didn't have a hot dog bun but I did have a leftover hamburger bun that needed to go. I sometimes use plain bread to make garlic bread. It's great in a pinch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ppequat"
},
"reviewBody": "I have been making this for 50 years. Our kids would have friends over &amp; ask for spaghetti &amp; \"those really good rolls\". The friends would make sure we would be having \"those rolls\" as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I've been making this for years but had some how forgotten about it's awesomeness until I realized I was broke until payday and the boys would really like garlic bread with dinner. This was a double bonus for me because it made some room in my freezer, which is awesome AND my boys were thrilled. So, YAY! I served this with Macaroni Gratinee, which is a fancy schmancy way of saying goulash. NOTE: This works with any kind of stale bread you may have on hand and is a lot better if you can use fresh garlic but it's not a necessity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EKERR19"
},
"reviewBody": "I've been making this forever! Yeah, it's not gourmet, lol but my kids just love it. We use leftover hotdog buns, hamburger buns, etc. - you name it. I've also added a bit of shredded cheese to it before broiling. My daughter wanted this for her sloppy joes last week and it works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beech1496"
},
"reviewBody": "Great idea! A great way to use up leftover buns. I actually cut the buns into slices after broiling and serve with marinara sauce. Some reviewers need to chill on the rating, and just enjoy this basic, yet creative, recipe! Who cares if you know the difference or not!!! It is a fun idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "This is great for when you have extra buns on hand (hot dog or hamburger), and you don't want to throw them away or you need a quick and tasty bread to go with dinner. Sure, it's not the best garlic bread ever, but it serves it's purpose, and the best part is no waste! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbi"
},
"reviewBody": "I've used hot dog rolls for years as \"garlic bread\". Can use minced garlic, garlic salt, fresh garlic...whatever! The hot dog rolls are the perfect size and brown nicely under the broiler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEME"
},
"reviewBody": "I used garlic salt because I'm a salt-o-holic and it tasted fabulous. Broiled mine an extra minute in the toaster oven because I wanted it a little toasted. It honestly tasted like the stuff from the store to me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bunny"
},
"reviewBody": "I ran across this recipe by accident and was surprised to find it. I do the same thing! I prefer hamburger buns, but either way my husby really likes them. Packaged buns work so much better than sandwich bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer DeFosse"
},
"reviewBody": "This is a great way to use up buns that might otherwise go to waste! I added Italian seasoning and some parmesan, and they were gone in a flash- my boys loved them. Thanks, Candyland!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelles095"
},
"reviewBody": "Delicious. I added a little bit of oregano, too. And it made it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheoah"
},
"reviewBody": "I did not have hamburger buns but used sliced bread instead and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Minnesota_Girl"
},
"reviewBody": "I thought everyone made garlic bread this way! We always have buns in the freezer and use this method to accompany our pasta dishes. It's the only thing my husband can \"cook!\" Thanks for posting this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LilTdoggy"
},
"reviewBody": "Also use regular bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "esmer"
},
"reviewBody": "i love this i do this all the time i love garlic bread but often forget or don't have time now my little brother and sisters do it too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "homiejess"
},
"reviewBody": "We loved this! Great in a pinch, when you don't want to put a whole lot of effort into something and still have it taste good. We have spaghetti at least once a week and this was nice to have accompanying it to make dinner different for once. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "This is a great way to save money... I made this with spaghetti one night because I am really trying hard not to waste any food (We'd had BBQ sandwiches a couple days before). I added Italian Seasoning and a mixture of Parmesan and Asiago cheeses.... Not bad!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V.Naehu808"
},
"reviewBody": "My hubby and I have been doing this for years. He loves hotdogs and so I seem to always have left over buns that are ready to go stale. I've even put them into the regular toaster, spread margarine, sprinkled garlic powder and italian seasoning and just eat it alone. (Snack time!)You get the five stars cuz your right, this is totally \"emergency\" garlic bread. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sixkyej"
},
"reviewBody": "Ha! I've made this several times before I even knew this was a \"recipe\" on here. I also add parmesan cheese and italian seasoning. Yum!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/86545/emergency-garlic-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14966/appetizers-and-snacks/garlic-bread/",
"name": "Garlic Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/86545/emergency-garlic-bread/",
"name": "Emergency Garlic Bread"
}
}
]
}
}
, "about": [
]
}
]