				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Empanadas"
,"datePublished": "1998-03-16T02:37:20.000-05:00"
,"dateModified": "2022-07-14T17:36:51.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Rosina"
,"url": "https://www.allrecipes.com/cook/24327790"
}
]
,"description": "Better make plenty - these disappear fast. The unbaked dough may be frozen. The baked cookies may also be frozen."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BWpBIsLitIeiOcuKFgQPmgAEnJc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/808529-023917b8044f42cf91bf0679c9cfad80.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Empanadas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "446"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "226 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "28 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "84 mg"
,"sugarContent": "18 g"
,"fatContent": "10 g"
,"servingSize": "2 1/2 dozen"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"0.5 cup butter, softened",
"1 (3 ounce) package cream cheese",
"1 cup sifted all-purpose flour",
"1 cup fruit preserves",
"0.33333334326744 cup white sugar",
"1 teaspoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "DAY BEFORE: Cream butter and cream cheese together until smoothly blended. Beat in the flour. Shape dough into a smooth ball, wrap in foil or cling wrap, and refrigerate overnight or up to a week."
} ,{
"@type": "HowToStep"
,"text": "AT BAKING TIME: Remove dough from refrigerator 30 minutes before using. Start heating oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll chilled dough thin. Cut with 3 or 4 inch round cookie cutter. Place small spoonful of jam in center of each round, moisten edges with water."
} ,{
"@type": "HowToStep"
,"text": "Fold round over and press edges together. Bake on ungreased cookie sheet 15 to 20 minutes. Immediately roll in sugar mixed with cinnamon (traditional) OR in confectioners&#39; sugar if preferred."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Leloux"
},
"reviewBody": "Today was my first time EVER making empanadas. I made the dough yesterday and took it out of the fridge and put it back in at least 4 times, and they STILL turned out amazingly! I did add maybe 1/2 tsp of salt and did the egg wash before baking. I was worried I undercooked ?these because they definitely weren’t browned very much (I cooked them for 18 mins), but they were perfect!!! I will be using this dough recipe with many other fillings and recipes. This was so easy, I am still in awe with the results. Thank would post a picture, but they were all gone within seconds!!! Thank you, thank you, thank you so much for sharing this wonderful recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amelia Chavez"
},
"reviewBody": "The dough was too soft, sticky not a good flavor either. It was very hard to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Van Boerum"
},
"reviewBody": "This is an excellent recipe. It was super easy to make, not too many ingredients, and the flavor of the dough is amazing.\n\nI needed to bake these the same night that I made the dough, so I made the dough and chilled the dough in the fridge for 45min. After 45min I was able to roll out the dough with lots of extra flour to prevent sticking, then brush with an egg wash and bake for 25min at 375.\n\nThey couldn't have turned out better. In fact, they were so good that the next day we made a triple batch with dinner and dessert fillings! Thank you for such an awesome recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Mckibbin"
},
"reviewBody": "Every time I make them they disappear within 20 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nday"
},
"reviewBody": "Very easy to follow. Turned great. I enjoyed using my new cast iron skillet. Made great lunch reheated while deer hunting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny Bissonnette"
},
"reviewBody": "The dough is amazing! I only let the dough sit for three hours before using and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JFF"
},
"reviewBody": "Super easy and it turned out very yummy. I used apple and peach pie fillings. Yummy! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruthy GG"
},
"reviewBody": "Based on positive reviews, i made a double batch of dough. My little hand mixer was not up to the job. Rolling out the dough was also difficult. Dough was not sweet at all. (Fine with me) I used apple pie filling, served with ice cream and caramel sauce. Yum. i don't know if I would make again...too much work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JARR"
},
"reviewBody": "The crust was so flaky and tasted so good. Humidity was high so I had to add a little more flour. Since it was my first batch, I used apple pie filling. So good. Will be making more flavors soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "avocadogirl14"
},
"reviewBody": "It was delicious. I baked them for 19 minutes and they were perfectly crunchy and crispy. They melt in your mouth and it was such a great dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sonja Schuman"
},
"reviewBody": "This was my first attempt at Empanadas, although I do bake a lot! This dough didn't taste that great. Additionally, all my filling bled out! After asking some friends what might've went wrong, I found out that I didn't properly seal the empanadas. You have to wet your finger and run it along the seam before pressing together. The recipe didn't mention that! Waste of precious time and ingredients. boo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Javier Ho"
},
"reviewBody": "I made the dough to use in a savory empanada with a smoked tri tip filling. The dough was easy to make and work with. I used plenty of flour on the working surface and rolling pin to prevent sticking. I added a little bit of salt to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ndaena06"
},
"reviewBody": "The dough is super simple yet so tasty! The whole recipe is simple with great flavor! You don't have to change anything in this! The dough made 12 empanadas. I will double the recipe next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "robinwagner"
},
"reviewBody": "Pretty good. My youngest daughter really liked it. I tried pumpkin too. I think the cream cheese in the dough is too fattening or not really being able to taste it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moses Albarran"
},
"reviewBody": "love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natcat"
},
"reviewBody": "So easy to make. It was a hit with the family! I will Def be making these again and experimenting with different kinds of fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leticia Chavez"
},
"reviewBody": "Great Recipe! Followed directions exactly, placed the dough on the refrigerator. I didn't get back to it for 2 days and it held up well. This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faby Valdez"
},
"reviewBody": "The best empanadas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gavin Erickson"
},
"reviewBody": "When we made this recipe it turned out nothing like the picture but it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer G"
},
"reviewBody": "I made these for a bake sale fundraiser and they were gone in no time! I doubled this recipe, left the dough in the fridge overnight and took it out in sections. I took out about 1/4 of the dough the first time and I'm glad I did. It was simple to roll but took me a while to get the hang of how much of the filling I could put in and how to seal it best. They did turn out amazing, and it was my first time making them. I did start out with cutting about a 3\" circle but the next time I made them more like 3.5\" which worked much better. I pulled out another section of dough when I was about halfway through filling the one I was working on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SloopjohnB"
},
"reviewBody": "I was surprised that the dough actually worked considering the ingredients, but it did. I noticed that the time it takes to roll the dough out and cut out the circles makes them quite soft and floppy - difficult to work with. So I put the circles back in the fridge to harden up again. Then I took them out, filled them and baked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "These were excellent. I used canned apple pie filling to save time and they were delicious! I've made them 3 times now and I used a cookie cutter to make them in 3\" in diameter (just right for bite sized dessert) and 4.5\" diameter (for more traditional sized empanadas). If you're new to making pastry dough, definitely recommend reading other reviewers' tips as this isn't the easiest/quickest thing to do if this is your first rodeo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Dusty"
},
"reviewBody": "This was my first time attempting empanadas, so I used this recipe, since it had great reviews. They are a hit! The dough was wonderful - easy to make and easy to use! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ethan Egert"
},
"reviewBody": "The dough needed a better binding agent and more sugar. I will try again though. I will tweak the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonja H."
},
"reviewBody": "Overall this is a really good recipe and I loved the flavor and texture of the dough but I gave it 4 stars because the filling was not all that interesting and as many said just leaked out. The dough can certainly be sticky but what I found helps is to refrigerate the dough into about 1\" balls rather than one large ball. Then I rolled each ball between two sheets of parchment paper using a little flour if it started sticking (don't use too much flour because the flour will dry out the dough which then causes cracks and more seepage). Be sure to keep the dough cold to prevent major sticking! For filling, I mixed cream cheese with some jam since I didn't have preserves and found that didn't seep out like plain jam. I also mixed cream cheese, honey and toasted pecans which was tasty, plus you can use more since it doesn't leak out at all. Have fun, be patient and enjoy. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne Rupprecht-Smith"
},
"reviewBody": "Easy to make, followed recipe, filled some with mincemeat and others with homemade strawberry jam, the jam was more likely to leak out though but it wasn't a problem because I used the Chef Sheets reusable non-stick sheets. Very tasty and tender bites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I'm so excited. Just made these and they turned out GREAT! I didnt deviate at all from the recipe and I am saluting the submitter of this recipe. Hats off to you! I will be experimenting with different fillings really soon. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Madrigal"
},
"reviewBody": "Let me start of by saying that I come from a Mexican family and that I grew up with empanadas. While this is not like the traditional dough it is really good. Fed them to my family (born and raised Mexican) and they all loved them. Made them with pumpkin stuffing and dusted them with sugar to make it a little sweeter (which they barely were). Also, for the people that said the dough was not easy to handle, I think it might be because the recipe calls for one package (3 oz) of cream cheese. One package of cream cheese is 8oz not 3oz!! I almost put the whole package in myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie G"
},
"reviewBody": "i made this dough for thanksgiving and it came out amazing. i used a touch of nutmeg in the dough but only because i did a custard filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyrts"
},
"reviewBody": "FIRST TIMER! although it was a little intimidating on the first few, but by the time I was on the last ones, I was 'a pro'. I used egg wash to seal them. I used strawberry preserves. I took them to taco night at church and EVERYONE loved them. And I amazed them by it being homemade dough. Thankfully I tripled the recipe- a whole block of the cream cheese, and I measured the flour then sifted (maybe I should have sifted then measured?). Be careful when removing from pan, they will break."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SmurfHearted"
},
"reviewBody": "I've made this several times, and been doing them more lately. I like to use pie filling, allows me to stuff them more. I also make them bigger, I suggest you double or quadruple the recipe. \nThis time I decided to do something a little different, I added spice and garlic to the dough. I plan to make a breakfast version with eggs and bacon so I thought it might add a little different flavor. We will see how my experiment comes out tomorrow! \nMy boyfriend loves these filled with cherry pie filling, as does my stepfather. Both have been asking for them for their birthdays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brendalyn Tavel"
},
"reviewBody": "This was great! The dough is amazing, I love it so much I'm going to make it again today with some ground beef filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jo Ann"
},
"reviewBody": "The flavor was good, nothing special. However, I felt that these were too time consuming thus the 3 stars. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "Yo me gusta empanadas! La receta es muy fácil y muy delicioso."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "birdluv4ever"
},
"reviewBody": "I made these empanadas for my spanish ll class's party, and they turned out berry well! (lol) Anyways I used mixed berry jam as the filling and they turned out nice. The only suggestion I would make is that if you are planning on making a lot as I was, make them mini! I just barely had enough and they were bite size! Still really good though. Just a tip. Overall these were great fun little festive treats!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "$wagmoney123"
},
"reviewBody": "muy bueno"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bea Lopez"
},
"reviewBody": "My favorite empanada recipe! Everyone LOVES these!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Boettcher"
},
"reviewBody": "I've never made empanadas before but, always wanting to try new recipes, I was excited to try this for a luncheon I hosted. The hardest part of this whole dish is to make sure you get a good seal all the way around the empanada. That and deciding which preserves to use for the filling. I chose to make some with Oregon Marion Berry Seedless Preserves and some with Apricot Preserves. Being a fragile dough, I found it easiest to place the cooked empanada on a bed of cinnamon sugar and then spoon additional sugar over top until coated.\nI served them with a dollop of Greek Goddess Honey Vanilla Greek Yogurt on top. They were a seriously big hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "Just made these. I'm having a themed dinner party on Friday and thought these looked good. I made some apple and some strawberry jam ones - they are both fantastic, so recommend them,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beca71"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah A"
},
"reviewBody": "This was the easiest ever! That hardest part was making them evenly shaped. The dough came out flakey and wonderful. I used apricot filling and pumpkin filling. The whole family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "This recipe makes just 11-13 empanadas, so if you cook for the family with three or more persons, you should even triple these recipe. The dough itself is tasty, but it is more cream cheese-y, not buttery. I made empanadas with cherry pie filling and didn't like the result very much. You shouldn't roll the dough thin, if you use preserve/berry filling, because the filling splatters out of the edges. Don't you too much filling, 1/2 teaspoon more and you ended up with the filling onto your baking sheet. The baked empanada is very fragile, you can easily tear it with your nail or spatula when it is hot. Probably I will make these empanadas again but with another filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Canalini"
},
"reviewBody": "I have made these many times and loved the recipe.I did find empanada dough cut and ready to use at our mexican grocery store in frozen foods.They are excellent and cheap!However,they are often out of them so I use this recipe and make my own.Yes,this is good as a pie crust as well.I find these easy to make not difficult at all if using enough flour and dough is properly chilled.I make savory and sweet with them.I thank you for a quality recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie Flietner"
},
"reviewBody": "Turned out great! I will do things a little different next time however. Next time I will double the apple part of the recipe cause it just wasn't enough. I could only make 6 and the filling was hardly enough for those. Next time I will also try to use chocolate pudding inside too :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Natalie Gutierrez"
},
"reviewBody": "The recipe was okay i guess, but when i baked it and let it cool. the whole thing was braking apart. IT was a whole mess and when baking it the fruit preserves were spilling out. Its okay if i wanted to make a crumble cake, but I am not a fan of this recipie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ArcanianBeast"
},
"reviewBody": "I used this at a culture fair bake sale in my high school. It took a lot of time for us to make but it was definitely worth it in the end. I would recommend using battered egg yolk instead of water to seal the edges. Also I would use a larger cookie cutter to try and keep the fruit from leaking. It doesn't make quite as much as it say it will either but it's definitely an all around favorite of mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candaceabc"
},
"reviewBody": "Thank you for this recipe. I just served it to my extended family for dessert on Mothers Day and everyone liked it. I didn't have the ingredients on hand to make the pastry the day/night prior so let it set up in the fridge for about 4-5 hours then used it immediately after removing from the fridge. It seemed to work out fine, but I'd make sure to allow for extra chilling time if I expected warmer weather. I used peach jam and sprinkled the empanadas with the cinnamon-sugar mix before baking instead of rolling tm after baking. This keeps the final product from being too sweet. Thanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allison Kanous"
},
"reviewBody": "1st time making Empanadas! I was not sure about the dough, reminded me of play-dough and very granular until I mushed it all together, and had to let it sit out a while longer so it was soft enough to roll out the next day. I had to leave it in the oven for 25 min and also the cinnamon/sugar wouldn't stick to the fresh-out-the-oven empanadas so I ended up coating them with butter and dropping them in that way. For the filling I just bough some apple pie filling and processed it in my blender, worked great. Overall they're a big hit, might try a different dough recipe next time though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lovetobake"
},
"reviewBody": "Good recipe. The only thing I think would make the recipe easier would be to toss the empanadas in cinnamon and sugar before baking because it doesn't want to stick very well to the cooked dough, and I like them COATED! For filling I cooked down some finely chopped apples with some sugar, cinnamon and a teeny sprinkle of nutmeg and clove. I also made a caramel sauce to dip them in. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "der smalls"
},
"reviewBody": "Amazing recipie the dough is best to work with if cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fsaad22"
},
"reviewBody": "The dough turned out too thick and gooey. But the turnout was still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IDYDELL"
},
"reviewBody": "Nice flaky crust. I made the fruit preserves and also mexican empandas. Really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "K.T."
},
"reviewBody": "Just made these for the kiddos. I rolled the dough out inbetween 2 sheets of waxed paper without any difficulty. I used the Pampered Chef sandwich sealer and baked them on my silpat. They literally slipped right off the mat and the mat wiped clean without any effort. Because 3 oz. packages of cream cheese do not exist, I read many reviews before making these to see what others did. In the end I used the entire 8 oz. brick of cream cheese, 1/4 cup of butter and 2 cups of flour. I think the dough could use some flavoring, maybe cinnamon. I found the dough tasteless and the kids did not like them either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjj3mom"
},
"reviewBody": "Yum! I refrigerated the dough overnight, so it was very hard when I took it out, but once it sat on the counter for about 30 minutes, it rolled out very easily. I would like the dough to be a bit sweeter, but with the cinnamon/sugar it was fine. I made 3 different kind using canned apple pie filling, canned strawberry pie filling and chocolate chips. I liked the apple best, but my kids liked the chocolate. I will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Very good and easy to make. Everyone at work loved them, they did not last long at the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trwaugh"
},
"reviewBody": "Very good... thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deeta Jean"
},
"reviewBody": "Wow! It is a mystery to me how a pastry dough with so few ingredients could be so wonderful. I am in love with this dough and will probably use it for a lot of things, including pies, in the future. It came out wonderfully delicate and almost melts in your mouth. I made these empanadas with cherry and apple pie filling. The cherry ones were good, but the apple ones were AMAZING! I simply chopped the cherries and apples up into smaller chunks, and made the empanada rounds a bit bigger than the recipe called for so I could squeeze more pie filling in there! \nI found it a bit hard to roll the bigger empanadas in the cinnamon sugar, so for the second batch, I simply coated a spare cookie sheet with a dusting of cinnamon sugar and when the empanadas were done, I transferred them to the coated sheet and then sprinkled the tops with cinnamon sugar as well. \nThese were a HUGE hit at my Super Bowl Fiesta and I will be making them again in the near future.\n\n*Tip - I found that the cherry pie filling oozed out of the seams on the first batch. For the second batch, I wetted the outside edge of the bottom, crimped the two edges together with the tines of a fork, then rolled the edges (much like you do for a pie crust) then crimped them again with the fork. I then pierced the tops with the fork to let steam escape. May seem like overkill, but the cherry pie filling did not leak at all after using this method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kadkins428"
},
"reviewBody": "This recipe is wonderful! This is the first time I made Empanadas and they were a huge hit! I followed the recipe exactly as it stands here. I filled mine with apricot preserves, strawberry preserves, a homemade apple filling, and blackberry jam. The jam leaked out, the others did not. This is definitely one I will be making again. I used a 3 inch rim drinking glass as my \"cutter\" it was a perfect size. Just make sure to pinch your edges together and do not over-fill. These are awesome. Will be adding these to my recipe box! ENJOY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney Jane Faith Kitts"
},
"reviewBody": "So quick and easy. I used Trader Joes Cherry Preserves with Fresh Cherries for the filling. The recipe does not make 1.5 dozen unless you make them with a very small cookie cutter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Seif-Wilke"
},
"reviewBody": "After reading the amazing reviews I will definitely be trying this recipe for both sweet and savory! We love our jalapeno poppers around here and may try filling some with crumbled bacon cream cheese and jalapenos chopped up ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosefrankel"
},
"reviewBody": "ABSOLUTELY DELICIOUS!!Everyone raved about it!! Will definitely keep it as my go to recipe for social gatherings!! doubled recipe and next time will probably quadruple it. LOVE, LOVE, LOVE IT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana Quintana"
},
"reviewBody": "Amazing! I used Trader Joes strawberry preserves and they are fantastic! Way smaller than I am used to, but I sort of like them this way. I am only sorry I didn't triple this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wildflower4182"
},
"reviewBody": "The dough is very \"sticky\" when it gets warmer, easier to work with if you flour your hands, cutting board, and rolling pin. I kept placing unused portion in fridge until I was ready for the next piece. This helped...I made gingerbread men cut outs and put the filling between the two pieces. Rolled in white and green sugar. Delicious and seasonal..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hayley Chase"
},
"reviewBody": "These are awesome with Nutella in the middle. Other than that I just followed the recipe including the cinnamon sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yanira"
},
"reviewBody": "I followed the recipe exactly to the instructions but the dough was so sticky. I ended up having to add more flour in order to make it workable. It was also better for me to make little balls and flatten each ball individually with a rolling pin. But everyone at the house loved the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "WhiskyAway"
},
"reviewBody": "The texture was very undesirable. Won't be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mainbean"
},
"reviewBody": "Terrific! My son rated them 4.5 stars only because nothing is perfect. We doubled the recipe and cut the dough into 3 inch circles and made mini empanadas for Fiesta day at school. For the filling we used canned cherry pie filling and canned raspberry cake filling. They tasted better while still warm, but we took them to school the day after baking and they were a big hit even at room temperature. I was not sure how to store them, given the cream cheese and butter, but we kept them at room temperature with no issues. These empanadas were great and we will definately make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINGERLY88"
},
"reviewBody": "The dough is sooo good! My choice of fillings was not the greatest. I used refried beans and cheese because I didn't have anything else and also some cheap strawberry preserves. But even so it was still good! My bf said I wish we could have these all the time! I'll make them again soon with some better fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tallbarb"
},
"reviewBody": "Easy and yummy. I made half with choc. chips as the filling and half with homemade raspberry jam. Both were excellent. I wouldn't change a thing except to advise that you dip your fork in flour when crimping the edges so the dough doesn't stick to the tines."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stargazermomma"
},
"reviewBody": "These are great! Though I was only able to make 17 rather than 32 and I used a 3\" biscuit cutter and rolled the dough to about 1/8\" thick. I had no problems with the preserves oozing out since I put a teaspoon on preserves in the middle. I also rushed the chilling but putting the dough in the freezer for about an hour and then letting it sit for about 10 minutes on the counter. The dough was quite sticky but I just rolled it in a little flour until it wasn't sticky anymore and it worked great. All in all these are delicious and I look forward to making them again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Jurkiewicz"
},
"reviewBody": "Easy, delicious, and pretty! I flute the edges with a fork to seal. I used strawbery preserves. Nice for a dinner party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Clark"
},
"reviewBody": "Amazing!! I used apple pie filling with extra cinnamon. I made these for work and they were gone before the afternoon was over! The crust is very light and is a nice balance to the sweet filling. Make extra as these will be very popular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "orchid_blossom"
},
"reviewBody": "Very good and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SELUNE13"
},
"reviewBody": "Made exactly as recipe stated. I didn't care too much for the preserve filling and it leaked all over the place. I think the one reviewer had a good suggestion in cooking down the preserves a bit before baking. I crimped pretty well and didn't overstuff and they still leaked out. I think next time I will use apple pie filling. I think that would be fabulous.\n\nThe dough was very easy for me to work with. I didn't have any sticking problems as some reviewers have stated. Very unusual to use cream cheese, but it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cfreni"
},
"reviewBody": "This recipe is perfect. I'm not exaggerating when I say that everyone that tries it loves it!! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ek91745"
},
"reviewBody": "Amazing! I filled some with cheese and hot dog, cheese and ham, nutella, raspberry jam from trader joe's, pepperjack cheese. All were wonderful. The only combo i didn't like was chocolate and peanut butter. These are also great frozen, and baked when company comes by. A very good last minute appetizer. Definite crowd pleaser. Got rave reviews from everybody!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Braiden"
},
"reviewBody": "these were simple to make and left a lot up to the imagination when it came to filling them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JackiG"
},
"reviewBody": "I wanted to give this five stars, but the dough was really hard to work with. I'm trying another batch today because they taste delicious! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twinklin'"
},
"reviewBody": "Fun to make and yummy to the tummy!! I used apple pie filling and peach jam. Both were appetizing!! My family LOVED them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sheridlee"
},
"reviewBody": "Made these for the first time the other day for a group dinner and everyone loved them! The only thing I really didn't care for was the preserves...the ones with pie filling were much better. The ones with preserves tended to leak out and you just didn't feel like you had enough \"umph\" to them...but people could not stop talking about them. \n\nI did triple the recipe and was very glad I did! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookswithkids"
},
"reviewBody": "Tis is a wonderfull recipe! I made it for my family and everbody loved it! A definite keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Beer"
},
"reviewBody": "This is an easy and delish recipe. The dough is flaky and tastes fantastic. I was skeptical of the cream cheese, but clearly this combination works! You don't taste the cream cheese in it at all - it is a wonderful pie dough. In fact, I fully intend to make a pie using this for crust. I made three different kinds: apple pie filling, pineapple preserves, and strawberry preserves. I liked the pineapple the best, but everyone else raved over the apple pie filling. I made a double batch and was glad I did. The recipe doesn't make much and when I doubled it I had some left over. The dough stayed in the fridge fine for five days. I actually thought it was easier to work with after it sat for a couple of days. The key is that the dough MUST be very cold. I plan to try making a savory one with ham and cheese. I am going to try to make it with very thinly sliced deli ham and cheese from a wedge of laughing cow swiss. I can almost taste it now. Make this recipe!!! You won't be sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alaskamom"
},
"reviewBody": "oh my goodness!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laliamora"
},
"reviewBody": "To avoid leakage you have to poke holes at the top with a fork, my grandmother has always poked holes on the top and they never leak. Good recipe! Try different fillings, pineapple, cherry, sweet potato, apple...so yum! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sposk"
},
"reviewBody": "These are a bit time consuming and I have no idea how you are supposed to make 30 out of one batch, but they came out alright. I personally would have prefered a dough that wasn't quite so bland, and I can think of many other desserts I would rather make instead, so I think I'll pass on this one in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Ritter"
},
"reviewBody": "Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MARSKYGIRL"
},
"reviewBody": "Very yummy! Used raspberry pie filling, which was too runny. Next time, I will for sure use a thick jam instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AtoZMom"
},
"reviewBody": "Yummy! These are easy to make, but it does take time. We used Neufchatel cheese b/c that's all I buy and it still tasted great. We refrigerated overnight. Also, we didn't roll these out. I cut the chilled dough in pieces and then rolled those in balls and flattened with a glass. I did have to flatten a little more by hand. We rolled the empanadas in sugar before baking and that turned out great! About half of the empanadas with strawberry jam leaked, but I probably put too much in those. I also made a few with peach preserves and none of those leaked. The preserves were not so runny so that might have something to do with it. In any case, both flavors were delicious. And the crust is delicious so it was okay that some leaked. My 10 yr old made these with me, and even my 9 and 4 yr olds got in on the action. Fun family recipe if you're not in a hurry. The oldest was taking these in for a cultural project at school and we had never made them before, so very happy that they came out so well. Great recipe!! We're going to try wiith savory fillings next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katgrace"
},
"reviewBody": "Everyone at work seemed to love them. Will make them again,soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KelliD"
},
"reviewBody": "Excellent recipe- My mom and I have been making these for our annual Cinco de Mayo party for 6 years now. We have to quadruple the recipe if we want to have leftovers, and they always turn out perfect! Best with peach preserves, we have tried strawberry and pineapple too but they aren't nearly as good. We use some cornstarch with water to brush the edges of the circles to help them stick together, and press the edges closed using our fingers not a fork for the prettiest presentation. A lot of work but well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "traci"
},
"reviewBody": "YUM!!! These do go very fast at my Cinco de Mayo parties so I always triple the recipe to have enough!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kalebsalo"
},
"reviewBody": "Very good, but I changed it slightly. I used canned pie filling (Cherry and Apple) I was a challange to seal up the empanda so it wouldn't leak when baked. I only had a couple that totally held tight and it felt like I was scrimping on filling. It doesn't really matter once there are cooled, but it looks better when they don't leak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Very yummy! We used nutella as filling in some of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicki Peoples"
},
"reviewBody": "These were really yummy. Make sure you use PLENTY of powdered sugar or flour (or a mix of the two) to roll them out on. When you do, it's a piece of cake... pie... empanada! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "YumLover"
},
"reviewBody": "I did not like this dough. It came out way too flaky for my taste. It's better for pastry empanadas, than savory ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linzbaker"
},
"reviewBody": "These turned out great! on an accidental miscalculation I ended up quadrupling the recipe. The dough is not unmanageable, just use lots of flour on your tools and rolling surface. I did not have a cookie cutter so I used a glass, sealed them with a little water and pinched them shut with a fork. I made most of them with a simple apple pie filling. I just chopped up the apples much smaller than I would for pie. The rest I filled with fruit preserves. I found the apple pie did not leak at all while the fruit preserve filling was very leaky when cooked. Since I had so many leftovers I just froze the prepared but unbaked remainders. I cook them from frozen just adding a few additional minutes. They turn out just as good as the fresh ones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Garza"
},
"reviewBody": "I have been searching for an empanada recipe like my mom used to make for quite awhile now. She made everything from memory and since she's passed, I can't ask her. But all the ingredients and steps seem the same... the picture looks like hers... I can't wait to try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie-K"
},
"reviewBody": "Wow, I was really surprised by this. Once cooked, any hint of cream cheese was gone. People actually said it was like a butter cookie crust. Will definitely keep this in mind for other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "num.num.num...food"
},
"reviewBody": "these were very yummy. they looked prettier with the cinnamon and sugar than the powdered sugar. I also recommend rolling them in the cinnamon sugar mixture before baking. I did both strawberry and raspberry jam. They were equally good. Also they do not fit much jam in them. It will start to come out. I recommend sealing edges with a fork to make them prettier."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10685/empanadas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10685/empanadas/",
"name": "Empanadas"
}
}
]
}
}
, "about": [
]
}
]