				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Empanada Dough"
,"datePublished": "2009-12-16T15:44:49.000-05:00"
,"dateModified": "2009-12-16T15:44:49.000-05:00"
,"author": [
{"@type": "Person"
,"name": "lola"
,"url": "https://www.allrecipes.com/cook/4064906"
}
]
,"description": "Make empanada dough with this basic recipe, then fill it with your favorite filling: pork, beef, chicken, cheese, shrimp — the sky&#39;s the limit!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ddmhkqIRe7WN6O23R_khGPJqGk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8018584-afa40469b4c545e0a3755027a8adbd30.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Empanada Dough"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.5",
"ratingCount": "49"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "62 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "56 mg"
,"sugarContent": "3 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.33333334326744 cup white sugar",
"0.5 teaspoon salt",
"0.5 cup water",
"1 large egg yolk",
"2 tablespoons all-purpose flour for dusting",
"2 tablespoons butter, melted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk 2 cups flour, sugar, and salt together in a bowl until well blended. Make a well in the center."
} ,{
"@type": "HowToStep"
,"text": "Whisk water and egg yolk together in a small bowl until smooth; pour into the well and mix to form a stiff dough."
} ,{
"@type": "HowToStep"
,"text": "Transfer the dough to a lightly floured surface and knead until smooth and elastic, about 8 minutes. Roll dough with a rolling pin until thin, dusting with flour as needed to prevent sticking. Brush melted butter over top and roll dough into a log."
} ,{
"@type": "HowToStep"
,"text": "Cut the log crosswise into about 24 slices. Roll each slice into a disk."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KylaHammer"
},
"reviewBody": "Too sweet, and made a rock hard dough. Baked it for 28 minutes and the bottoms were burnt, tops hardly had any color. I don't understand why so many comments are saying it's great but you need to reduce the sugar, butter, etc. If you have to change the ingredients for the recipe to work then it's a bad recipe. I'm disappointed I read the comments AFTER making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kimberly Brown"
},
"reviewBody": "Made these tonight, and they came out too hard. I did decrease the sugar to about a teaspoon, but other than that, I followed the recipe exactly (well, I halved it, but did the calculations correctly - I even used about half an egg yolk, since it called for one for the whole recipe). Maybe I rolled mine out too thin, but the edges were hard like a cracker. Plus, it was really hard to work with, very hard to knead. I'll try a different dough recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "heygab2227"
},
"reviewBody": "Good dough, I made a double batch which made it super hard to knead. It ended up being SUPER sweet. Like noticeably sweet from the first bite. Great for dessert, not so much for a savory dish. Definitely reduce the sugar level"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani "
},
"reviewBody": "This dough certainly is sweet, as other reviews have mentioned, but that works well for my family. We enjoy a sweet dough with a savory filling. It makes a nice balance that we all enjoy (a miracle in our household). My kids have even asked that I make the dough alone and fry up little squares for a snack! The one piece of advice I will give is for those using a dough hook on a stand mixer: be careful of your mixing time! On my first attempt, I let it go far too long and the dough was very difficult to roll out (still tasted great though). Keep a close eye on it and turn off your mixer just after the dough ball pulls from the sides and holds together well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jody Nelson"
},
"reviewBody": "I baked this one and it came out too hard a shell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GaryJYum"
},
"reviewBody": "These are so easy to make and delicious. I cut the sugar in half. My family can’t stop eating these so I’ll make them once every two weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kalina"
},
"reviewBody": "I used a whole egg in the mixture and only 1 tbsp of sugar. I made twelve and stuffed them with potatoes, cheese and taco seasoned ground beef. Before I baked them I coated the pan in butter and the tops of each empanada with egg white and butter. Baked for 15 minutes, turned them all over, and baked for another 15 minutes. They came out amazingly crispy! The dough tastes great with the butter and cheese. I would make these again in a pan cooked with oil to see the difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mamcart"
},
"reviewBody": "Dough was tough and there was no way to make the dough stick to itself once I folded it over the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "angela14"
},
"reviewBody": "We were not impressed with how this recipe turned out. The dough needed more water and was tough. Even after we brushed it with butter before baking, the empanadas were extremely hard to chew. this is not a recipe we will be trying again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noelle Watson"
},
"reviewBody": "I cut the sugar to 1 Tb as someone had previously recommended and added some Adobo seasoning. This dough turned out flakey and light which is perfect for our taste. Thank you for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francine Wilson"
},
"reviewBody": "I made these for the first time. I used our air fryer and Turkey meat. They came out good but kind of dry. Next time, will cook per instructions and use pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DracoMiss"
},
"reviewBody": "I make this all the time, and stuff it full of all sorts of things. Sometimes for heartier meat pies I’ll reduce the sugar and use half whole wheat flour. The kids love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate Peahater"
},
"reviewBody": "I left the dough for about 30 mins after rolling into the circles so that I could prepare the fillings, and found it much easier to work with after resting it. Beforehand it was very elastic and quite tough. Afterwards it rolled easily and I could get it much thinner. I'm not sure whether it would work even better if you rested it before doing the buttery jelly roll thing? In the end I thought it was very nice, but don't really see how rolling it with the butter helped? I assume it was supposed to make it a bit flaky but it didn't really seem to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cherise Maldonado"
},
"reviewBody": "This was first time making my own dough. they turned out OK. kind of on the sweet side but I will cut the sugar to maybe a tablespoon. Its a great recipe for beginners. definitely read others review that way you can figure a way that works for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaniger"
},
"reviewBody": "Delicious! I've made many empanadas and generally use the \"cut the butter into the flour\" variety of dough. Decided to try this instead and loved it! I mixed in my Kitchenaid mixer and added 1 T of water as dough seemed too dry to come together. Then kneaded with a bit of flour until smooth. Rolling into jelly roll, slicing 2\" piece and rolling to 5\" circle worked perfectly and was easier than fighting with dough that wants to shrink upon entering cut. Recipe as written made 12 empanadas. Baked at 375 for 16 minutes. Took about an hour from beginning to on the table. Will definitely use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Wood"
},
"reviewBody": "We used this recipe with the black bean &amp; cheese empanada recipe as we didn't want to use canned biscuits, the dough was great and had a slight sweetness to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laurel"
},
"reviewBody": "Not very good. Didn't like the flavor at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A'sonda Adams "
},
"reviewBody": "This recipe is by far the best and has sent my mouth back to my younger days! I've tried over seven other recipes and was disappointment on the brink of giving up I stumbled across this one. I'm happy I didn't quit. Reduce sugar like other reviewers suggested. I used 3 tablespoons. It's not so sweet. Trust me it makes the dough yummy as heck! Also add 6 table spoons of butterflavored shortening to the flour mix. Cut it up in small parts until it is crumbly. Oh boy you won't be disappointed. The dough isn't dry and if you have a large family like mines you will be making these for after school snacks or even lunch for a few days! Thanks for \nsharing such an amazing recipe. Add full sugar if you are filling these with sweets. It's a must try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Anderson Haluska"
},
"reviewBody": "I tweaked it a fair bit, so the rating is for my revised version. Reading the other reviews was very helpful. I reduced the sugar to 1 tablespoon to counter the complaint that the dough was too sweet. To counter the complaint that it was too dry I cut in about 6 tablespoons of lard and 2 of butter to the dry mixture. Then I mixed in the water and egg yolk. The dough needed to have a lot of flour added before it was workable. It baked into a light flaky crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "croy"
},
"reviewBody": "Highly disappointed. The dough is so tough. We added more water but my boyfriends are are tired from rolling it. Lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I did not care for this recipe. Dry, tough, hard to work with, and way too much sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eusebia Aquino-Hughes"
},
"reviewBody": "great :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs.Z"
},
"reviewBody": "I was unable to use the photo tab to insert the beautiful looking empanadas I made with this easy recipe I used leftover turkey meat from the day after Thanksgiving chopped into small pieces I put oil in a pan with onion green pepper sauteed that with some Puerto Rican sofrito that I made sauteed it all with the turkey meat for a little bit put that into my empanadas and they were absolutely wonderful after 30 minutes in the oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Stroede"
},
"reviewBody": "I really like this recipe. I stuffed mine with a mixture of chicken, 3 cheeses, onion, jalapenos, and spices. The sweetness mixed well with the other flavours. I fried mine because my husband prefers EVERYTHING fried. The texture was very good. I will defiantly use this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Destiny McPherson"
},
"reviewBody": "Fairly simple dough to make if you know how to make dough in general. Really sweet and tasty with different fillings too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulina Pelaez"
},
"reviewBody": "I knew it would be on the cracker type side because I didn't use any butter at all. I just rolled out the ball until I couldn't roll it out anymore and just cut out circles. Filled them up pretty packed of beef and crimped the edges with a fork, they fluffed up a bit but none of them exploded or had anything seep out. I used egg whites on the edges that I crimped with a fork, and egg yolk to brush on top for color. I read the other reviews and used 1tbsp of sugar and it was just right, not too sweet or anything. I liked how the dough tasted and its' consistency with the filling I used (ground beef, onions, garlic, tomato, oregano, and some flour). I will be making this again and I'll be making double this because it was only enough for like 10 empanadas :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bhagman"
},
"reviewBody": "I made the recipe and then read the reviews. I wish I had read the reviews first because I agree that there is too much sugar. If this dough was being used for dessert then I would leave the recipe alone but for a savory meal I will definitely cut the sugar way down! All in all the recipe was well received by kids and husband!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "deetergirl"
},
"reviewBody": "It was very hard to work with, too sweet, and my empanadas ended up being dry with a cracker like texture. I will not be using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Theodora Costopoulos"
},
"reviewBody": "This dough is awful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lquarles2222"
},
"reviewBody": "too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "swtp84"
},
"reviewBody": "Took the advice from others and reduced the sugar slightly and added some shortening (about 3 tbsp) Made Canastitas Caprese (Open-faced Empanadas with Tomato, Basil and Mozzarella and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara C. Rodgers"
},
"reviewBody": "The dough to have fun with. I filled them with Pepperoni and Mozzarella, mouth watering!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paola Eisner"
},
"reviewBody": "I made it thick and it was sweet and delicious. Could definitely eat it by itself :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lilikovaci"
},
"reviewBody": "it sucked.. dry.. not not soft or bread like at all.. not going to try this again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "skberg"
},
"reviewBody": "To dry and hard to work with made the recipe as written but I wish I had read others suggestion I won't be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Farrell"
},
"reviewBody": "We blend 1T butter with 6T shortening with 2 knives, then follow these directions. Our filling was a mixture of shredded chicken breasts, onions, hard boiled eggs, green olives, cumin, chili powder, chicken bouillon powder, bay leaf, paprika. Topped with sour cream and salsa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie Elsener"
},
"reviewBody": "I used 1 Tb and 1tsp sugar. Had to add a little extra water. Took a LONG time to make. Turned out very good. Needed less time to bake the empanada, maybe about 25 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ney"
},
"reviewBody": "Dough was too dry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TaraV1976"
},
"reviewBody": "I decreased the sugar to about a tbs. and ended up adding some more water to make the dough pliable. My empanadas turned out well. Make sure and roll your dough out well, so they aren't too thick. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "court84"
},
"reviewBody": "Good texture, but much too sweet. Would be good for banana empanadas."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/212956/empanada-dough/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/113/appetizers-and-snacks/pastries/",
"name": "Pastries"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/23131/appetizers-and-snacks/pastries/empanadas/",
"name": "Empanadas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/212956/empanada-dough/",
"name": "Empanada Dough"
}
}
]
}
}
, "about": [
]
}
]