				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Empire Biscuits"
,"datePublished": "2000-05-21T00:06:19.000-04:00"
,"dateModified": "2022-08-08T11:38:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Marcie"
,"url": "https://www.allrecipes.com/cook/24326173"
}
]
,"description": "This shortbread cookie is a traditional Scottish recipe. These are round cookies sandwiched with jam and topped off with a delicious icing and a cherry."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/i_7vAkeHf4aoh9ZMGcDPzaR4wo0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4784663-38f4e7ae756b46429d7835a46ca1d9e7.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Empire Biscuits"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "67"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "223 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "21 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "56 mg"
,"sugarContent": "28 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups butter, softened",
"1 cup white sugar",
"4 cups sifted all-purpose flour",
"1 cup raspberry preserves",
"24 maraschino cherries",
"8 cups confectioners' sugar",
"0.5 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream together the butter and sugar until smooth. Gradually stir in the flour until well blended. On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into rounds using a cookie cutter."
} ,{
"@type": "HowToStep"
,"text": "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Sandwich one teaspoon of jam between two cookies. Repeat with remaining cookies. In a medium bowl, gradually stir the milk into the confectioners&#39; sugar until the icing is of a spreadable consistency. Spread on top of the sandwiched cookies. Top each cookie with half of a cherry while the icing is still wet."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "Taste just like my Grandma’s! After my grandparents passed, we couldn’t find the recipe and I happened to stumble upon this and I make them every year now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary E Reynolds"
},
"reviewBody": "The shortbread is excellent! Wouldn’t change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSmeaton"
},
"reviewBody": "I made a half batch of these. I used a 2.5” cookie cutter and I got 13 whole empire biscuits. (That would have been 26 whole cookies.) The shortbread isn’t too sweet, that’s good when there is jam and icing on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Val"
},
"reviewBody": "Put the custard powder in, like one of your other cooks suggested..very nice colour and texture! They melt in your mouth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Hodgins"
},
"reviewBody": "I've been making this recipe for a few years now, it's become a Christmas tradition in my family now. This weekend I made three batches for a Mother's Day Tea by request."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack McLaughlin"
},
"reviewBody": "My Dad always talked about how is Grandmother made these cookies. Although I've posted meals cooked with pictures, my wife is the baker in our family. So my wife made these cookies and I can see why my Dad raved about them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TracyE"
},
"reviewBody": "I have made several versions of Imperial cookies and these are at the top. They take some time, but worth it. I found that the glaze icing recipe was at least double of what was needed however to cover all the cookies. Would half the icing next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Bigg"
},
"reviewBody": "My mom made these every Christmas. This is the 1st time I tried, they turned out awesome, I need to practice more putting on the icing lol!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joannayarbrough"
},
"reviewBody": "I made this for my son's Scottish-themed 1st birthday party. They were a hit! I halved the amount of frosting, as other reviewers suggested. I also added about a teaspoon on almond extract to give it a cherry flavor. I also changed the raspberry preserves to strawberry, only because my husband doesn't like raspberry. As one reviewer suggested, I heated the preserves to make the cookies stick together better. This was definitely a good idea. It made 20 finished cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara Marselle"
},
"reviewBody": "I use Madagascar vanilla and Madagascar vanilla beans, freshly scraped from their pods. We also add almond extract to the icing for enhanced flavor.\n\nWe prefer our Empire Biscuits to be about 2\" in diameter too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GW"
},
"reviewBody": "Delicious! Ended up with a pint of left over frosting. So maybe cut the frosting recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debymcs"
},
"reviewBody": "this recipe is the best empire biscuits I've made biscuit just melts in the mouth ideal for a cuppa or treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "These are delicious. Next time I would use a smaller cookie cutter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucky charms"
},
"reviewBody": "this was amazing loved it, will make many more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Pike Mollenkamp"
},
"reviewBody": "I use this recipe as my Christmas cookie cut out recipe every year. My kids complain if I try any other. It is so simple and quick. When I use it for empire biscuits, I don't add the cherry but use cherry preserves and let it squeeze up the center. I also add a bit of vanilla...just because. For my cutouts I frost with homemade buttercream and sprinkle with colored sugar. Don't be surprised that the cookie is less sweet then some sugar cookies...it is a good base when adding frosting, sugar, and jam after baking. Balances out to be a wonderful Christmas treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ailsa Scott"
},
"reviewBody": "Great recipe, everyone loves them! Massively too much icing sugar and also too much milk... Otherwise tasty stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cristina Ellis"
},
"reviewBody": "I am not a baker but I have to say this was easy to make and it was also very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Agius"
},
"reviewBody": "Delicious! Be sure to roll the dough out pretty thin - otherwise it's a pretty hefty cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ProBaker420"
},
"reviewBody": "Made them for a school project. They were lit, the whole class dabbed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aileen Smith"
},
"reviewBody": "Came from a scottish family - 1st generation American. When our Nanny (grandmother) passed most of her recipes were lost ??. We did however make these wonder treats w/the addition of Birds Custard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maevyn"
},
"reviewBody": "Everyone loves these cookies!\nI made it slightly different - added flour to the butter/sugar until it was a workable consistency, rather than throwing in all 4 cups (I used less). I found the cook time to be at 7 mins, so it was just golden on the bottom, and not brown. Also, something to note: when I calculated the calories, it worked out to roughly 400/finished cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elisabeth MacIntyre Koen"
},
"reviewBody": "I made this today, however the dough is so soft I could not roll it out. :( Maybe my butter was too soft, as it was hot here today. But I have put it in the fridge so hoping it stiffens up enough to roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PenAllen"
},
"reviewBody": "Didn't see any need to add icing and maraschino cherries when I had homemade blackberry jam. I was looking for a traditional shortbread recipe without cornstarch or icing sugar . This was perfect! I like my shortbread well done so I baked it 14 minutes and added the jelly after five minutes of cooling. First Christmas baking I've done in 10 years and am very happy with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heatheralexadra"
},
"reviewBody": "These were really good. The recipe was easy to follow but I made some subs.\n\nI used a mix of Earth Balance and refined coconut oil to to make them dairy free. I didnt have regular white sugar so I used half light brown sugar and half icing sugar. They were sweet enough and had a really nice melt in your mouth texture. I also added a 1/4 tsp of vanilla extract (bc i love vanilla, but i didnt taste it in the cookies)\n\nI baked for 8 minutes and maybe would have done 9 to make them a bit more crisp. They are delicate right out of the oven! so definitely wait for them to cool. \n\nAlso I halved the recipe and ending up with 16 cookie sandwiches (32 cookies)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catherine15"
},
"reviewBody": "Great recipe, went down very well with workmates!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Princessa5981"
},
"reviewBody": "This recipe turned out excellent. I halved the recipe as it was my first try at it but I will make the larger amount next time. I took the advice about cooking the jam a bit and had not trouble with the cookies sticking together. I will try it with the Birds Custard Powder next time. Definitely will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anet54"
},
"reviewBody": "Easy, easy recipe and when finished looks so professional people will think you really slaved over these. The cookies are to die for. Exactly what I want when I crave a cookie. The only change I made in the recipe: I added almond extract to the icing. Made all the difference in the world. TIP: Use parchment paper when baking. They'll come out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soprano2"
},
"reviewBody": "I've been looking for this recipe for so long! Used to dance at a Scottish restaurant in the 60s and we'd always buy a couple of these cookies there. But I was looking for Empire Cakes, not biscuits and could never find them until I put in 'Scottish cookies'. Thank you, I shall make them very soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ActingLikeAChef"
},
"reviewBody": "I was looking for a traditional Scottish cookie and stumbled upon this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladylynne"
},
"reviewBody": "This is the first time I've made a cookie like this and they came out GREAT! The basic biscuit itself is good even without the filling and icing. \nOf course being in a hurry, I didn't follow the directions exactly. I melted the butter instead of softening it and used my mixer to beat in the flour, so ended up with a fluffy mix that was IMPOSSIBLE to roll out. I put the mix in the fridge overnight and made them the next day. \nI did make a few changes....used a turbinado sugar instead of white and made the icing using vanilla soy milk. If you use a raw sugar like I did, add a little more than the recipe calls for and I used MUCH less confectioners sugar for the icing. \n\nIt probably took Julia Child 20 minutes to whip up several dozen of these...I took me much longer but were well worth the time spent. They were a HUGE hit at my job and I have made more as hostess gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "This was definitely one of the most fun \"recipes from home\" that I've made with my little girl. On the one hand, they were rather a lot of work, it was frustrating how easily they broke when lifting them off the cookie sheet, and I made them WAY too big, but Lily had a ball sandwiching them together, drizzling them with icing, and adding the cherry! Only change I made was to use 3c a.p. flour and 1c of Bird's custard powder as another reviewer suggested. Not sure I'll make them again, but we had a blast putting them together. Thanks so much, Marcie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "I agree with an earlier reviewer that it's better to substitute 1 cup of flour with 1 cup Bird's custard powder. Also, boil the jam before you spread it (spread while it's still hot). This will stick the biscuits together better, concentrate the taste, and give a chewier texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMOEGIE"
},
"reviewBody": "These cookies are wonderful! I didn't change a thing.\nThey were a big hit at Christmas dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barone"
},
"reviewBody": "Beth40 ,, these are BISCUITS not cookies ,,, we don't have \" cookies \" in Scotland ( just kidding ).\nYes they are just delicious and I have made them by substituting a cup of Bird's custard powder for a cup of flour, an added delicious touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lloyd Starr"
},
"reviewBody": "it was a good recipe...the 8 cups of confectioners sugar was way too much. This is a butter and sugar high recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Breanimal"
},
"reviewBody": "My grandmother is from Scotland and use to make these all the time. These came out just like her old recipe. It's a tough batter to work with (gets really sticky) but worth it in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenly McCulloch"
},
"reviewBody": "Made these for my Culture Feast project at school. Many people wanted seconds. I'm only 13 and I made these without any help, quick------easy--------DELICIOUS!!!!!!!!!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NightLad"
},
"reviewBody": "This is a great recipe that makes use of real shortbread without overcomplicating itself and getting all pretentious. Just like grandma used to make! The instructions were quite easy to follow along with and the cookies turned out just perfect; nice and light with a smooth, rich taste. As an added treat I was able to use my mother's homemade raspberry jam made from berries she grew in her backyard. Yum! My only pause for concern was the amount of confectioners' sugar called for; I found that I only needed about 2-2½ cups and I had plenty of icing left over. This is a fantastic recipe and if you have kids I’m sure they will love helping you use the cookie-cutter and licking the beaters. The kids can shape their own cookies with leftover batter, too! By following this recipe I made 2 dozen completed cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belinda Carter McDowell"
},
"reviewBody": "Excellent!! Need to make them small, very filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Matthew McAllister"
},
"reviewBody": "Nice simple recipe. However, as a native Jock here in the US, the best tip to make these biscuits even more endulgent and melt on the tongue - substitute one cup of flour for one cup of birds custard powder. You will get a richer golden colour, deeper crumble and crunch in the texture, and a toasted baked note to finish. My Gran's traditional recipe from Glasgow. try it and you won't be dissapointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "DELICIOUS! I made these exactly as written and wouldn't change a thing. Just be aware that the icing recipe makes a lot of icing...I think you need less thank half of what is written, you can always make more icing if you need it :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran"
},
"reviewBody": "I only make these at Christmas, in part because they're a little fussy to make but mostly because they are the most incredibly delicious cookies ever and I could eat 10 at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grace"
},
"reviewBody": "Fun to make and cute to look at :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veggielover"
},
"reviewBody": "I was so happy to find this recipe. It is a little time-consuming but the results are well worth it! It's a tradition to make them at Christmas but I do get requests for these biscuits throughout the year. They do make an impression on people!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swimminash"
},
"reviewBody": "This was a fabulous recipe! I made 96 for an international night at school and they were the first to go. It took a while, but it was worth it. I loved how easy it was to work with the dough. The cookies didn't burn in the oven or break when I spread on the jam. Strawberry jam worked just fine. It was a fairly simple recipe, too. Thanks a bunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILuv2cook"
},
"reviewBody": "Absolutely delicious! The cookies just melt in your mouth. My kids loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen Sumpter"
},
"reviewBody": "My grandmother, who is Scottish, made these cookies with us when we were little. She did not put cherries on them, but instead cut smaller holes in half of the cookies that were going on top. This isn't quite the same as the traditional empire biscuits we grew up on but very nice none the less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phrizzie"
},
"reviewBody": "My Irish husband absolutely loves these cookies. In fact, every St. Patrick's Day I use green maraschinos and add green colouring to the glaze as a special treat. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreens39"
},
"reviewBody": "Very tasty , buttery , nothing but compliments with these !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANDY GIRL"
},
"reviewBody": "Awsome recipe! exactly right! i advise you get a hand blender - the first time I tried it i used a spoon to mix and had the hardest time getting it to stick together - added water - bad idea, made the cookie a touch heavier than the light amaizing cookie i got with the use of a hand blender. I've used all kinds of filling, different jams, honey, nutella - thanks for this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did not use the cookie recipe since I have my own. However, my recipe for the icing never worked out, so I used this one and it turned out perfect! I will continue to use this one every time I make empire cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "EMILYAMT"
},
"reviewBody": "I was very excited when I found this recipe because I have very fond memories of Christmases past, making myself sick eating dozens of my grandmother's empire biscuits. However, when I made this recipe, I discovered that this recipe makes good sugar cookies, but they are not shortbread. This may be a different version of Empire Biscuits than the one I grew up with, but be warned - they are not shortbread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Tattoli-Steitz"
},
"reviewBody": "These were a little too sweet for me but they looked realy pretty. I used a flower shaped cut out and they realy made the cookie tray look nice. I would probably make them again just because of how they look plus they may not be too sweet for other people. I haven't handed out the trays yet so I haven't heard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JONZEZ4"
},
"reviewBody": "These cookies are wonderful! I found the dough to be a little sticky to roll out, but otherwise this was a very easy recipe, and the results are very impressive. I made them to add to a wedding cookie table, and got many compliments on how delicious they were and how pretty they looked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Neilson"
},
"reviewBody": "Marcie, thanks for this recipe! I will be using this recipe for Christmas and any occassion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent cookie recipe! Takes a little time to prepare but well worth it!\r\nI have shared this recipe with many friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Kids really loved these cookies. Found that they took quite along time to make but well worth the time......"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19263/empire-biscuits/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
"name": "UK and Ireland"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/707/world-cuisine/european/uk-and-ireland/scottish/",
"name": "Scottish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19263/empire-biscuits/",
"name": "Empire Biscuits"
}
}
]
}
}
, "about": [
]
}
]