				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Fabulous Beef Tenderloin"
,"datePublished": "2019-04-02T02:48:44.000-04:00"
,"dateModified": "2022-09-06T13:03:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Debbie Wright"
,"url": "https://www.allrecipes.com/cook/2134925"
}
]
,"description": "This is an easy beef tenderloin recipe that will melt in your mouth and wow your dinner guests. It&#39;s simple to prepare with just 3 ingredients."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DNShEts9eD7aJ7Gjg_US073H-10=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7044339-fabulous-beef-tenderloin-calexa01-1x1-1-d51096d1b371453d89e563490e050be5.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955994175001",
"description": "Impressive, melt-in-the-mouth beef tenderloin that’s so easy to make.",
"duration": "PT2M18S",
"name": "Fabulous Beef Tenderloin",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/da250dae-ebfc-48bc-8601-143e2279aff0/1be595b7-6c51-4929-9a21-af75896c3e35/1280x720/match/image.jpg",
"uploadDate": "2021-06-21T01:02:57.312-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Fabulous Beef Tenderloin"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "755"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "591 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "220 mg"
,"fiberContent": "0 g"
,"proteinContent": "67 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "2047 mg"
,"sugarContent": "1 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (3 pound) beef tenderloin roast",
"0.75 cup soy sauce",
"0.5 cup melted butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place roast into a shallow, glass baking dish. Pour soy sauce and melted butter over the tenderloin."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 10 minutes, then turn roast over and continue cooking, basting occasionally until the internal temperature of the roast reaches 140 degrees F (60 degrees C) for medium, 35 to 40 minutes (or cook to desired degree of doneness)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DNShEts9eD7aJ7Gjg_US073H-10=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7044339-fabulous-beef-tenderloin-calexa01-1x1-1-d51096d1b371453d89e563490e050be5.jpg"
}
]
,"text": "Let meat rest for 10 to 15 minutes before slicing."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super easy to make and so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Delicious! No fail every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Kirsten Lavin"
},
"reviewBody": "The easy way to host a party- casual or formal. No need to even measure as you can’t put too much or too little soy sauce or butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sherry Bartel"
},
"reviewBody": "The sauce had no depth of flavor. It tasted like soy sauce and of course was very salty. I would not recommend making this for such an expensive piece of meat. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "audreyksinclair"
},
"reviewBody": "It was truly fabulous! I doubled the sauce but used 1/2 soy sauce, 1/2 red wine with the butter. Roasted mushrooms and onions in sauce after meat was done. The best and easiest tenderloin recipe I have made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ldavis1917"
},
"reviewBody": "The title isn't hyperbole. This really is fabulous. I used an entire tinder loin, adjusted the butter and soy sauce for the larger cut of meat, and used a meat thermometer to take the guess work out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tksalinas"
},
"reviewBody": "Amazing! Such a hit with my guests. I used low-sodium soy sauce and placed the roast on a bed of onions and baby Bella mushrooms. Roasted to 140 degrees F. Took almost 90 min for a 5.5lb roast. Still salty, but delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ki249"
},
"reviewBody": "Suprisingly good - made as written, will add pepper next time ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CONESPRATT"
},
"reviewBody": "Bring beef tenderloin to room temperature before roasting. I substituted 3/8 cup red wine and 3/8 cup low-salt soy sauce instead of all soy sauce and used unsalted butter. I also added mushrooms and onion before roasting. Tent meat while it rests before slicing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Carr"
},
"reviewBody": "This is really delicious. I used a stick of butter, half cup of soy sauce and half cup red wine and a tablespoon of garlic. I also increased cooking time to 30 minutes then left in the hot oven another 30 minutes. Turned out perfectly and was super easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tatiana Will"
},
"reviewBody": "This is my new go to for beef tenderloin. it's so simple and easy. the cooking time never seems to work for me and I always have to cook it a little more but it's still an amazing recipe. Even my picky eaters go for seconds. I use the recipe as is and just throw onions and garlic on it. Throw it in the Dutch oven and set. I typically cut it into tips and serve it over pasta with a creamy sauce. so good. thank you for this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Rich"
},
"reviewBody": "I've been making this recipe since 2007. I wouldn't change a thing! So delicious and so easy to make. It's a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela HJ"
},
"reviewBody": "I made this today for Easter &amp; it was excellent. We love making beef tenderloin for special occasions and have made several different recipes. This one was SO easy and absolutely delicious. I did make a few changes, doubled the sauce (which may have been unnecessary because I have a lot leftover), topped it with chopped fresh garlic and sliced onions before putting in the oven. I was going to put mushrooms in the pan before it was done, but it was done earlier than expected, so I sauteed them in butter separately, then added pan juices to the mushrooms &amp; arrowroot (gluten free thickener) to make a gravy. I also made the blue cheese sauce from the blue cheese beef tenderloin recipe on this site &amp; served on the side. It was delicious with both the gravy and the blue cheese sauce AND also with both sauces together!! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I had an 8.80lb tenderloin roast to make for Easter. (2 tied together) I have never made one &amp; was nervous of ruining dinner. Followed the recipe/doubled, I DID season all sides with s,p, granulated onion, garlic &amp; rosemary. I did flip it twice at start,10 mins each time. Added sliced mushrooms last 15mins. My total time was 1hr 45mins with 15mins rest after. It was med-well, ends definitely had that delish crisp to them. NOT tough or overcooked BUT next time will do 1&amp;1/2hr cook time with 15min rest &amp; everyone thought it was better then Lelli’s or Flemmings so it was a major win &amp; will make a rotation for our big holiday dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dm3forsure"
},
"reviewBody": "Very Good! I use deer tenderloin and it came out excellent. Will definately use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Bender Sesler"
},
"reviewBody": "This recipe is amazing! Have made it several times and it is perfect every time. Here are a couple of recommendations/modifications/suggestions I make to the recipe: \n\n1. I slice a large onion and place the onion slices all over the bottom of the baking dish before placing the meat in the dish.\n\n2. I let the meat sit at room temperature for 1-2 hours before prepping/baking.\n\n3. I ask the butcher to trim the tenderloin for me, and he always grinds the trimmings into some terrific ground beef, which we usually freeze to use later for burgers, spaghetti, etc. Tenderloin is an expensive cut of meat, so it's good to get the ground beef from it as well.\n\n4. If you have any leftover beef tenderloin, use it the next day to make philly cheese steaks-they are divine! Use good kaiser rolls-butter them and then grill them for a little crunch. Put the leftover tenderloin and onions and sauce in a pan and reheat it on medium (sometimes I sautee additional onion if there isn't enough left from the previous night's recipe). When meat is reheated through, ad slices of provolone (depending on how many sandwiches you are making), and once the cheese is melted, put the meat and cheese on the crunchy rolls. Trust me when I say that these cheesesteaks are absolutely terrific!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "labeyer"
},
"reviewBody": "This was wonderful. I took another reviewers suggestion and did half the soy sauce with the other half red wine, added garlic powder and used unsalted butter. Thank you for the recipe Debbie and the recipe tweaks \"Pimpin in the kitchen\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I cannot believe how amazing this tasted with such a simple recipe! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Busy mom of 4"
},
"reviewBody": "I had my doubts about this recipe. But after reading the reviews I decided to use it. I had a 14 pound beef loin and adjusted as necessary (yes, it took like 3 cups of soy sauce and I used reduced sodium sauce). The loin took 3 hours so I basted every hour and the last hour I added mushrooms to the pan. It turned out amazing, cooked. I cooked to internal twmp of 140 and let rest for an hour. So juicy and flavorful. I also made a compound butter to go with the meat and everything turned out so good. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan R"
},
"reviewBody": "Amazing. So easy . The tenderloin was so moist and delicious, it did literally melt in my mouth. If you are hesitant about making a roast, I highly recommend this recipe. You won’t be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Warren"
},
"reviewBody": "Amazing! The first time I made this as is. The second time I made this, I subbed 1/2 of the soy sauce for red wine. Both ways are delicious, and I will never make a tenderloin any other way from now on. If you like a little less salt, go for the wine sub."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom413"
},
"reviewBody": "I added garlic and cut the soy sauce in half and added red wine. It was delicious! Super easy! I will definitely make it again -and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "I made this exactly as written. Exactly. It turned out perfect! I had several “foodies” say it was the best beef tenderloin they ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R&R"
},
"reviewBody": "I took the advice of others and used low sodium soy and unsalted butter. It wasn't salty at all. I also added cremini mushrooms to the liquid and it made for a good sauce to put on top of the meat. Very tender, will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teachmarkey"
},
"reviewBody": "This is restaurant quality food, and is ridiculously simple to make. The meat is expensive, so we use it as a special-occasion meal. Even if your cooking skills are non-existent, I would encourage anyone to try it. Friends will think you're a chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cara Pratt Chute"
},
"reviewBody": "Best meal I’ve ever had! Delicious! No knife needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Bruce McMain"
},
"reviewBody": "My beef turned out perfectly. I would give it 5 stars with the changes I made after reading multiple reviews. First . . . use low-sodium soy sauce and secondly .. . .my 6 lb. tenderloin was perfect (warm red center) after bringing to room temp first, cooking \n for one hour and 10 min. on 350 and allowing to rest for 15 min in a foil tent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ICookToEat"
},
"reviewBody": "Delicious and easy. Warning: use a thin soy sauce like Kikkoman. Last time I tried a high-quality dark soy (which I use to cook Asian food) and it changed the flavor and darkened the color of the meat substantially. This recipe is meant for a thin soy sauce. As others have said, the meat does not come out tasting like soy sauce--IF you use a thin soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Heston"
},
"reviewBody": "It was super delicious. I cooked it on my Traeger Pellet Grill and seasoned the meat with Johnny’s and pepper, and inserted roasted garlic throughout the roast. Side vegetables were roasted red potatoes, mushrooms, yellow and green zucchini, and onion. My oldest son and 3 adult grandchildren loved it. This is definitely a keeper recipe!! So easy too!!! I tried to upload a photo but was unsuccessful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Herbst"
},
"reviewBody": "Subbed some red wine for the tamari (soy sauce),"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Fabulous. Best tenderloin I have ever made. Got rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan McW"
},
"reviewBody": "Like others, used no-salt butter and half-salt soy sauce. That's it!\n\nThis was my first time cooking Beef Tenderloin and it turned out tasty and perfect. \n\nI placed a meat thermometer in the thickest part of the tenderloin and removed the roast as soon as it reached 140 inside. \n\nI flipped the roast after 10 minutes - for the first portion of cooking, place the roast with any folded sides facing up so the majority of the cooking time and is basting on the flat top portion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hiDho"
},
"reviewBody": "Good basic recipe. I used low sod. soy sauce and reduced to 1/2 Cup and 1/4 Cup butter.\nMy changes, like others:\nlots of fresh cracked pepper! About a cup of red wine and garlic and onion powder.\nThrew in quartered mushrooms during the last 10 mins of baking. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LESLIEPQ"
},
"reviewBody": "This recipe is SO easy and SO delish!! I've made it 3 times now and have had rave reviews. King's Hawaiian Sweet Rolls pair amazingly well with this tenderloin dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Yates"
},
"reviewBody": "Love this recipe. It's the best method I've ever used for beef tenderloin. Gave it four stars since, like others, a reduction in salt was needed (by using unsalted butter and low-sodium soy salt). Also, I'd recommend using less soy sauce and less butter if you're going to have two tenderloins in one pan...otherwise the liquid level is too high and your meat isn't going to brown. Lastly, I also threw in fresh thyme, fresh tarragon, and a bunch of whole garlic cloves. SO GOOD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brady Hutsick"
},
"reviewBody": "This is awesome! So simple but ohh so good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skip"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Cooperman"
},
"reviewBody": "I substituted the soy sauce for worcestershire sauce and added a little bit of minced garlic. I also did what some others said and put onions and mushrooms in the pan about 20 minutes before it needed to come out and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M"
},
"reviewBody": "So easy and so delicious! Give this recipe a try! You won’t be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Excellent and the leftovers are wonderful for French dip sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Creative Caterer"
},
"reviewBody": "This recipe is amazing! Will be making again and again. Foolproof way to ensure you don't overcook an expensive cut of meat.\nI only made one change to the very beginning of the recipe. I had beef tenderloin tips (large portions of beef tenderloin) I wanted to use. This would work with a whole beef tenderloin too. \nEarly in morning prepare a mixture of . . 1/3 cup olive oil, 1/8 cup balsamic vinegar, a few pumps Worcestershire sauce, 2-3 cloves minced garlic, 1/2 tsp dried basil and 1/2 tsp oregano and 1/2 tsp thyme. Slather this all over the meat. Marinate in this until ready to cook, turning occasionally. You may need to double dependent on the amount of beef. Bring meat to room temperature and prepare as directed. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Great Recipe. After I turn the meat I baste it every 10 minutes until I take it out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Echobell"
},
"reviewBody": "Tender as all get out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy M."
},
"reviewBody": "Yes it turned out delicious but bordered on being too salty. And that's with unsalted butter and low sodium soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Davidson"
},
"reviewBody": "It was awesome! And yes, I will use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brett Friedel"
},
"reviewBody": "Oh my goodness! This is such a simple recipe that works SO well!! I rub Montreal steak spice on the meat just for an added kick. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sdaniels1771"
},
"reviewBody": "Just needs some garlic cloves. I mince two and mixed it into the butter and soy sauce before pouring over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Artemis"
},
"reviewBody": "I did exactly as the recipe called for. I thought it would be too salty and too greasy but it was amazing. Everyone raved about it. This is a keeper. My son-in-law made a special request to have it for his birthday dinner. Simply awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "Made this for my family and they are begging me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lafnmel"
},
"reviewBody": "I made this for my first family dinner at my house for my son, his fiancé, and their daughter. Cooking has not been my strong suit but I have been trying to do more of it lately. Used this recipe since it seemed simple enough for me to do. It was fantastic!!!!! I had the butcher at the grocery store cut the right amount and type of beef I needed. It may have been expensive, but well worth every penny. Juicy, melt-in-your-mouth, and great as leftovers every time. Try this recipe. You are going to love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "Fabulous recipe! I made this for New Year's Eve and everyone loved it! I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dree"
},
"reviewBody": "FABULOUS! Made for my family of 9 for Christmas dinner and everyone loved it ! We are making it again this eve ! We loved it so much and it’s SUPER EASY to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsWilkerson"
},
"reviewBody": "After reading the reviews I was concerned that it would be too salty so I used unsalted butter and low-sodium soy sauce. I threw a few shallot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Germaine"
},
"reviewBody": "I just added a tiny bit of garlic . Family loved it! More importantly, my most difficult critic, kids, loved it! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LJNS"
},
"reviewBody": "Family said it was the best tenderloin they ever had! I also went with the low sodium soy sauce and salt free butter. Also added sweet onion and the mushrooms at the end. This will be on the table at Christmas Eve next year! The tenderloin was almost 6 lbs from Costco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jimbo"
},
"reviewBody": "Added garlic. Add 2 white or yellow onions at beginning, and a ton of mushrooms with 15 min left. Those were beat part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PVANORE"
},
"reviewBody": "This was soooo good. The soy sauce and butter made for a really great gravy and the meat was tender and better than good, it was delicious!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Delicious! So easy and so good. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julem"
},
"reviewBody": "Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "I made this last year for Christmas and again this year by request. This year I did rub it with a garlic pepper combo and did a quick sear of the tenderloin first. Due to multiple preferences between medium to rare I did leave it in about 15 minutes longer than suggested and it was a perfect medium on the ends and medium rare in the middle. My husband (rare) enjoyed the flavor and tenderness so much he didn’t mind the medium rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reneetberry"
},
"reviewBody": "absolutely delicious! I have been making this for Christmas for the past 5 years. turns out perfect! I buy a 4lb beef tenderloin. I trim it. I cut it in half. I put into the 13x9 clear casserole dish. I turn it every 15 minutes to coat with marinade. I bake it for 1hr, then I decrease temperature to 325 and bake 15 more minutes. I took it out and let rest on plate , tented loosely with foil, for 15 minutes, cut and serve! (comes out a little more than Medium NOT well done) I bought 2, 4lb tenderloins and did above and baked 2 casserole dishes side by side as above. It served 12 adults, some with 2nd helpings. I had left overs which easily would have served 4 more. Use salted butter and low sodium soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Didier Tripp"
},
"reviewBody": "This was my first time to cook a tenderloin, and I was pretty nervous to work with such an expensive cut. BUT... it was so awesome and soooo easy!! \n\nI used unsalted butter and low sodium soy, which I defiantly recommend. I added pearl onions and mushrooms the last 20ish minutes, and that was a fantastic addition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dottie"
},
"reviewBody": "Wonderful easy recipe. I had a 3 lb. beef tenderloin which I cooked at 350 degrees for 10 minutes then flipped it over as the recipe calls for. I took the tenderloin out after 33 minutes instead of the 35-40 minutes and inserted a meat thermometer which read 130 degrees. We like medium-rare and it was perfect! The soy sauce, butter and meat juices made a wonderful light sauce to spoon over the meat. Served with mushrooms cooked in butter and port wine and oven roasted potatoes. My husband and son loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vic A"
},
"reviewBody": "the best beef tenderloin ever and so moist and tender"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leo Rowe"
},
"reviewBody": "Absolutely delicious and simple. Use a meat thermometer for a perfectly cooked tenderloin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "Delicious and super easy! Guests loved it. I did have to double the time for medium for 3 lbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I have made this recipe for the past 6 Christmas dinners and it always comes out perfectly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This is such an intimidating cut of meat...yet a two Ingredient recipe made it virtually impossible to mess up… And more Importantly this is truly the best I’ve ever had! you will not be disappointed!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Lynn Stoffregen Osswald"
},
"reviewBody": "Excellent!!!! Tender and delicious. So simple. Our guests raved. Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Westrope"
},
"reviewBody": "OMG...It was amazing!! I was SO skeptical with only two ingredients!! I had a 2.2 pound beef tenderloin. Cooked it about 45 minutes on convection heat at 325 degrees. Added a pound of fresh sliced mushrooms about 15 minutes before it was done. I used a meat thermometer to watch the temp of the meat and cooked it to rare...140 degrees. I let it sit for 15 minutes covered in foil. Served it with fresh cooked green beans and baked potatoes. I only had regular soya sauce so I used unsalted butter. It was melt in your mouth and SO delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "WOW! So simple and absolutely delicious! My family has requested this for Christmas Eve dinner now too. I added sliced onions and mushrooms per suggestions made by other cooks - and both were well received. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cverbic cverbic@telus.net"
},
"reviewBody": "Everyone liked it. Definitely do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JudyB"
},
"reviewBody": "Very good. We did the option of 1/2 soy sauce and half red wine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calexa01"
},
"reviewBody": "By far, the best dish that I make. Recently, I made it using tenderloin steaks instead of a whole tenderloin. I also added 3/4c of red wine. It took about 50 minutes to cook for medium-well. Amazing recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MammaKay"
},
"reviewBody": "No, it was perfect and my daughter said it wouldn't be any good. She wanted to use a different recipe. But everyone was delighted with the meat, None was leftover. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Fitzgerald"
},
"reviewBody": "Turned out really good and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nantli"
},
"reviewBody": "So So easy to make. My hubby loves his meats and always raves about the taste on this tenderloin. Quick to put together and the time in the oven let's you prepare all your sides. we love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RonGoings"
},
"reviewBody": "Using venison instead of beef , sauce took the gamey taste out added some mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Kolb"
},
"reviewBody": "I used worstershire sauce instead of soy sauce and it turned out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KAI"
},
"reviewBody": "Absolutely delicious basic recipe and surprisingly quick and easy. But here are a few suggestions that may be helpful: 1), I used only about 1/4 cup of low sodium soy sauce and that was salty enough for us. 2) I reduced the amount of melted butter to about a 1/3 of a cup and added olive oil to make up the difference. 3) I would suggest browning the meat in an oven-safe skillet first, just to give it a nice color and surface texture. Then, just pop the skillet into the oven once the sauce is added..4) I also used a good sprinkling of cracked black pepper before browning, for an added flavor punch. With these tweaks, it’s a full 5 stars for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karin J Girman"
},
"reviewBody": "I agree with many previous comments about saltiness. Substitute low sodium soy sauce and unsalted butter, no worries. Yummy with red wine, mushrooms, onions and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Plaza"
},
"reviewBody": "Amazing and easy. I used low sodium soy sauce and unsalted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ELLYCAT"
},
"reviewBody": "This truly was a fabulous recipe! I have had it several times. My problem is I have a 6# tenderloin that won't fit into my 15x11 GLASS pan. I cannot find a large enough glass or ceramic pan. Someone suggested placing parchment on the bottom of my larger metal pan. With the acidity involved (soy sauce) I'm wondering if that would work. Has anyone cooked a large tenderloin in a roasting pan etc.? Any suggestions would be appreciated. If anyone can help me with this problem, you can send me an email at: rosseleanor@msn.com Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyShaw"
},
"reviewBody": "Made this for Christmas Dinner and the family loved it. I'm making it again for Easter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dochoot"
},
"reviewBody": "Outstanding and simple. I added garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farley Mcbride"
},
"reviewBody": "Love it have made it twice now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moto guzzi"
},
"reviewBody": "I was surprised how well this tasted with such simple preparation but a quarter pound of butter will make just about anything taste good. I did add garlic to the melted butter, used a 4.5 lb beef tenderloin and low sodium organic soy sauce but otherwise I followed the recipe as written. Poured the soy sauce over the meat first followed by the garlic butter, flipped it after 10 minutes, baked it for 30 more minutes and tented it for a good 20 minutes after pulling it out of the oven. I didn't get a chance to baste it but it turned out tender and juicy thanks to the tenting. Color was good. Flavor was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey Warner"
},
"reviewBody": "DELICIOUS! Very simple recipe, yet delicious! I find that 15 minutes cook time per each 1 pound of beef tenderloin is perfect. I modified the recipe slightly by replacing half of the soy sauce with red wine (Cabernet) and I always use Bragg Liquid Aminos (a natural alternative to soy soy) in place of soy sauce. I also added button mushrooms around the beef during the last 30 minutes of cooking. If you are new to making a beef tenderloin, I have a few suggestions: First, ask your butcher to trim it for you (this will save you money by not paying for fat you will discard at home) and save you time. Second, it’s important to remember that the tenderloin will not be completely cooked when you remove it from the oven. It continues to cook during the vital 10-15 minutes of resting. Enjoy!! Beef tenderloin is an expensive cut, but well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "I made this for the first time and it was amazing. I had a 6 pound loin so I doubled the ingredients but I’m doing it again, I would not double. There was plenty of juice. The flavor was wonderful and I will definitely make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Harrison Pittman"
},
"reviewBody": "We LOVED it! Made 5 lb tenderloin, rubbed kosher salt and softened butter all over prior to cooking. Cooked at 350 for 10, turned over like recipe says, then cooked for 55 minutes more until reached 130 degrees-after resting 10-15 minutes, was at perfect 135 for medium rare. Made Alton Brown’s horseradish sauce and served with sautéed peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1mortoy"
},
"reviewBody": "Amazing! Used low sodium soy sauce and unsaled butter. I did add 1/2 merlot and onion to roasting dish. I also put in sauted mushrooms in at the end. It was a big hit. Definitely use a meat thermometer. I was surprised how quickly a 7lb tenderloin cooked! I will be making this again. Thanks to all who shared their variatios ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buds4"
},
"reviewBody": "Soooooo easy! Didn't change a thing. It was awesome. Tender, tasty and melted in your mouth. I was tempted to add something but the soy and butter was perfect. Remember to keep basting. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reasors"
},
"reviewBody": "Great easy recipe! Will make often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KB50k"
},
"reviewBody": "One of the best recipes EVER for beef tenderloin. Easy and delicious. This recipe is a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This really was simple and delicious. I thought the soy sauce would make the gravy overly salty but it did not. I did have to cook the meat about 15 minutes longer than the recipe stated and might raise the heat next time. I added diced onions and mushrooms along with some beef brother to the drippings and thickened it with a little cornstarch &amp; water. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RCorvelli"
},
"reviewBody": "This was absolutely delicious! I bought a 5 lb roast for Christmas-was a bit nervous as it was expensive and I've never done this type of meat before. I doubled the ingredients and it turned out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Simula"
},
"reviewBody": "So simple, yet so wonderful. Seasoned the meat with salt, pepper and a little ranch dressing mix. Cooked two large tenderloins so doubled the butter, but added 3/4 c balsamic with the soy sauce. Cooked to 145 degrees. Tender delicious meat. Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Howell"
},
"reviewBody": "The only tweak I made was to rub some freshly ground pepper and crushed dried rosemary on the roast prior to putting the soy sauce+butter mixture. This is the easiest method I've seen, and it is utterly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherik678"
},
"reviewBody": "Took the suggestion to use low sodium soy sauce and mushrooms. Also added in carrots and celery and it turned out great!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/132351/fabulous-beef-tenderloin/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
"name": "Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/132351/fabulous-beef-tenderloin/",
"name": "Fabulous Beef Tenderloin"
}
}
]
}
}
, "about": [
]
}
]