				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Favorite Bourbon Pecan Pie"
,"datePublished": "2020-06-18T23:33:23.000-04:00"
,"dateModified": "2022-06-29T14:46:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BlueEyedBaker"
,"url": "https://www.allrecipes.com/cook/526646"
}
]
,"description": "This bourbon pecan pie is a touch more decadent than the normal holiday favorite. Using bourbon in place of vanilla adds a distinctive flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/N5MukXaE2P_XxZtJfvf3afIQ7FE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8783053-cd13c640621a47b8bd77bfa5dbf59da9.jpg",
"height": 1440,
"width": 1440
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Favorite Bourbon Pecan Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "102"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "533 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "81 mg"
,"fiberContent": "3 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "160 mg"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.5 cup white sugar",
"0.5 cup brown sugar",
"3 tablespoons unsalted butter, melted",
"0.5 cup light corn syrup",
"3 large eggs, beaten",
"2 tablespoons bourbon",
"2 cups pecan halves",
"1 (9 inch) unbaked deep-dish pie crust" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix white sugar, brown sugar, and butter together in a bowl. Stir in corn syrup, eggs, and bourbon, then fold in pecans. Pour mixture into the pie crust."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 10 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue to bake until the pie is set, 25 to 30 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven and place on a wire rack. Allow to cool completely before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martha Johnson"
},
"reviewBody": "This had great flavor! It was definitely not a deep dish recipe, though; regular pie plate would have been just fine. I used dark brown sugar and dark corn syrup. Next time I think I will cut the amount of pecans a bit, because I felt like it could have used a higher filling-to-pecans ratio. Guests loved it, though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diane S"
},
"reviewBody": "This recipe was bad, bad, bad! I followed the recipe exactly and it looks like mud and tasted terrible!!! What a waste of ingredients! I learned my lesson to definitely read the reviews before I try any of your recipes again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "chaberman43"
},
"reviewBody": "Absolute disaster. The filling was totally uncooked in the middle when I went to cut it. I don't know if it was the oven (cooking at family house for Christmas) or the recipe but I even baked it for an extra 20 minutes because it didn't seem done when I checked it and it still came out completely raw. I followed the recipe with no variations whatsoever. Will not be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigboo1267"
},
"reviewBody": "This is my go to recipe for a pecan pie. The only thing for me is that I jave made it at two different addresses, one with gas oven, the other with electric. In both, and every time, I have to bake about 50 minutes after reducing heat to have the pie set. It does not burn and comes out delicious, but the time is off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Pearson"
},
"reviewBody": "I made this for a get-together with friends for Thanksgiving. We are all bourbon drinkers so I was particularly interested in trying this traditional pecan pie with a hint of bourbon. To say it was a hit is an understatement. The bourbon added a richness to the flavors - I may try a double shot next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan Bennett"
},
"reviewBody": "Great pie! For the crust, I used Pie Crust IV from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gobriel "
},
"reviewBody": "Used only brown sugar (1 cup) and subbed fancy honey and maple syrup for karo. I did line the pie crust (frozen) with the pecans and it is much, much prettier this way. After the first 15 minutes, when I lowered the temperature, I went ahead and covered the edges of the crust. I baked the next 25 minutes as directed and then covered the whole pie in foil and continued baking another 15 minutes. Definitely the winner of Thanksgiving dinner! I have to admit, I added the bourbon \"One for me one for you\" style...there's a whole lotta family here ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hollybarbee4"
},
"reviewBody": "Made it for Thanksgiving easy recipe and everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Patterson"
},
"reviewBody": "Follow previous reviewer’s suggestion to lay pecans first, it did look nicer than folding them in. I turned the oven off after baking and let sit for another 10 minutes to set and brown up a little more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "laurengracie18"
},
"reviewBody": "turned out pretty well but i made a few changes, i used only brown sugar and soaked the pecans in the bourbon for a couple hours, i also use like 4x more bourbon, while the pecans were soaking i also added some vanilla extract, cinnamon and freshly ground nutmeg. i also recommend egg washing the edges of the crust before baking and buttering the pan before the crust goes in as it was very dry without either of those changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dianne"
},
"reviewBody": "There were several things that need to be adjusted. It had to be cook a good bit longer than called for. The Maker's Mark was overpowering. Way too strong! The pie was hard to cut using pecan halves. If pieces were used it would be easier to cut. I thought this might be a nice variation, but it is not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Deemuze"
},
"reviewBody": "I followed this recipe and baked as directed. The pie looked amazing. But, when I cut into it, it was complete liquid. Didn’t set at all. The 35 minute bake time is nowhere near enough time. Needs to be closer to 60 minutes from what I see of other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Stubblefield"
},
"reviewBody": "This pie is absolutely delicious just as it is. I accidentally got a regular pie shell instead of deep dish pie shell. My filing went to the top of the shell, but I couldn’t fit all of it in there. Regardless, this pie was uh-mazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alissa K"
},
"reviewBody": "This was an easy recipe to make recipe that came together nicely and the bourbon adds a nice flavor. I can see why it is a favorite. I adjusted the baking time and baked the pies 10-15 minutes longer than what was called for in the recipe. I will definitely be making these again and added this recipe to my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JerryC"
},
"reviewBody": "Taste was very good but it was super runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad"
},
"reviewBody": "I loved this recipe. The use of both sugars is key. I find that the white sugar adds a bit of a candy crunch to the top layer of pecans that the full brown sugar recipes lack. That being said I did change the ratio of white to brown sugar. Using 1/4 white and 3/4 brown. I also used dark corn syrup because it was what I had. Toasted half of the pecans this time around and soaked the other half in a table spoon of the bourbon. Idk if it makes a difference. I also make sure to chop up most of my pecans. I recently discovered that is my preference after trying various degrees of choppiness. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason Autry"
},
"reviewBody": "Made it last night and everything turned out great. I haven't tried it yet, but it definitely turned out amazing looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Homewood Farm"
},
"reviewBody": "I made this delicious pie for my husband who said it was the best Pecan pie he had ever had. I followed the recipe exactly and did not change a thing. It came out of the oven perfect. The reviewer who used egg substitute should have known better, egg substitute is exactly what the name implies EGG SUBSTITUTE not to be confused with whole eggs. No wonder it came out “soggy and nasty “ This recipe is definitely easy and most definitely a keeper. If you are going to try a new recipe why change some of the ingredients or add other ingredients ?? This does not make any sense at all to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dar"
},
"reviewBody": "While this looked great and flavor was great, it did not set up at all. It was super runny. All my ingredients were fresh. I even put it back in the oven for 10 minutes and it still didn’t set up. I’m going to try Chef Johns recipe that’s cooked before filling the pie and see if that works out better. I’m an experienced baker but have never made a pecan pie before. I followed the recipe to a T and am wondering if there are some tricks not mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Average Jane"
},
"reviewBody": "This was so good! I haven't made pecan pies much and this one was pretty much perfect. I lined the pan with parchment just in case, but for this pie I don't think it was strictly necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TrinaJ"
},
"reviewBody": "I made this for thanksgiving and turned out perfect! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maalba"
},
"reviewBody": "This pecan pie was such a hit ! Will be making every year! I did cook it a bit more and it was still mosit/gooey !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMCLRH2O"
},
"reviewBody": "Absolutely the best pecan pie I’ve made. Everyone raves about it and a couple people said it was better than their Moms. We had to substitute an Apple brandy for the bourbon and it was still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "PATTY"
},
"reviewBody": "Cooking time is off and should be baked for 60 minutes in order to set. I was nervous that I was going beyond the time by 15 minutes so I pulled it out of oven and it turned out runny. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Llamas"
},
"reviewBody": "It turned out as described. Just added more of the Bourbon to it. Not too much lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Yeats"
},
"reviewBody": "This was a hit with everyone that tried it!! Very good addition to my Holidays menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Supercook"
},
"reviewBody": "I didn’t change a thing to this recipe! It was excellent and not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "penguin"
},
"reviewBody": "This pie turned out fantastic great flavor and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Liz Scibetti"
},
"reviewBody": "I've made this pie multiple times now, and every time I do, it comes out tasting good, but it doesn't hold together. As soon as you cut into it, it falls apart. I follow the recipe exactly, no substitutions at all, but as soon as I add the bourbon to the mixing bowl, the filling immediately becomes watery. I've tried baking it longer, but it doesn't solve the issue. I wonder if there's a way to fix this? Maybe adding another egg? Other reviews mention adding chocolate chips, maybe I'll try that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Granola Girl"
},
"reviewBody": "Delicious! I added a dollop of bourbon whipped cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happily Retired"
},
"reviewBody": "I made this bourbon pecan pie for Thanksgiving dinner and it was a big hit. I will be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieD"
},
"reviewBody": "This turned out well. I think the bourbon takes some of the too sweet taste of a regular pecan pie. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Little Barn Farmstand- "
},
"reviewBody": "I added vanilla and 1/4 tsp cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KelliCat"
},
"reviewBody": "Followed the recipe exactly. I took it to a party and now I have people offering to pay me to make it. It turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Gallagher"
},
"reviewBody": "Such a great flavor, but I wish it wouldn't have turned out so runny. Even after I left it overnight it was still runny. I've made it twice though to try to see if I just messed something up the first time and because I was asked to make it again. I will try it again sometime and cook it longer. That's how much I loved the taste. I used a flavored bourbon and organized the pecans on the bottom before filling it. Looked fancy. But the second time I just folded them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THEBACCHUS"
},
"reviewBody": "I made this as a Christmas present for my sisters who absolutely loves pecan pie. She said it was the best pecan pie she has ever had. I’m no connoisseur like her, but I also thought it was delicious! The only difference I made was that I chopped the pecans finely for her (she has TMJ) and used only about 1 1/2 cups pecans chopped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Delphine Duerr"
},
"reviewBody": "In reading recipe n pictures show pecans in perfect order on top yet recipe says to fold in pecans to ingredients? Finish product -\nafter baking pie, pecans will not look like this ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BethTNFL"
},
"reviewBody": "Awesome pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Francisco Lee Imperial"
},
"reviewBody": "Made it using the recipe as is then adjusted! Pretty good, but I combined the feedback of some others here and it turned out better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beaner1082"
},
"reviewBody": "Tasted good but I think I might have done something wrong. It was still runny when we cut it. I let it cool to room temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaun"
},
"reviewBody": "made for thanksgiving last weekend. Had to make another on Tuesday! First one we ate. Great recipe easy to do and taste so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "x-nmac"
},
"reviewBody": "Ok this is going to be my go-to each year. Loved this! I used dark corn syrup instead of light, added 1 tsp vanilla. I used pecan pieces, not halves, and only used 1 1/2 cups. Might add some cinnamon next time, not sure. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pirategirl1968"
},
"reviewBody": "I added a VERY yummy whipped topping. Whipping cream- whisk ALOT. Add burbon, whisk a lot more and 10x sugar to sweeten up. Whisk until you get the fluffyness you like. Taste.... add more bourbon? Taste. Add more bourbon?? Lol. Please try it! AWESOME!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane Piedmont"
},
"reviewBody": "Tasted good but did not set. I followed the recipe exactly and it was still soupy. Have only made pecan pie twice and neither was successful so I'm not sure what to adjust to make it turn out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TiTi Bug"
},
"reviewBody": "OMG, this was so good!\nI combined 2 recipes together and added more bourbon! Like a half of cup! \nThen I added half cup of white sugar, a half cup of brown sugar and some vanilla!\nI didn't bother with cooking my corn syrup and chocolate, (why mess up a sauce pan when you don't have too!) I Just mixed it all together in one bowl and then poured it in my pie crust and baked it!\nIt was amazing! \nIt was like 3 pies into one!\nOne bite was full of pecans, another bite was full of chocolate, and then there was the bourbon!\nTotally my new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa in Phoenix"
},
"reviewBody": "I was worried. I've never made a pecan pie before, I'm not great at baking, and frequently screw things up so when I saw the \"disastrous\" review, I was quite nervous. I carefully followed the directions and when I poured the filling into the pie crust, it only filled about 1/2 way. Luckily, as it baked, it fluffed up and looked beautiful when it came out of the oven. It got rave reviews from everyone. My husband begged me to not add the bourbon (he likes to drink it, but for some weird reason he doesn't want it in his food) but he even said it was excellent and loved the bourbon flavor. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Brancato-Montanaro"
},
"reviewBody": "It was pretty good , got mixed reviews from the Christmas party I served it at ,, some thought it was too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Atkinson"
},
"reviewBody": "I had not made pecan pie in ages, and as a bourbon lover wanted to try this out. 2 things of note: I agree with some others, reduce the pecans to about 1 1/2 cups; mine came out a little underdone, but I think it was because I was nervous about overcooking it and I'm still getting used to my oven in my new place. That said, everyone loved it and the bourbon flavor was not at all overwhelming, so it may depend on which bourbon you use. Being an Oregonian, I used my favorite local one, Burnside Bourbon. I will definitely make this again ,with the above mentioned modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenk"
},
"reviewBody": "My family loves this. No substitutions necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARRIEL777"
},
"reviewBody": "This a good recipe. I altered the recipe to make 50% more filling and added a little extra bourbon. Easiest pie ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snhall1214"
},
"reviewBody": "I make this pie every Thanksgiving and follow this recipe almost exactly, EXCEPT for one part: soak the pecans in the bourbon overnight before baking the pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Gorniak"
},
"reviewBody": "I did make a change.... more bourbon :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merrily Long Cundiff"
},
"reviewBody": "This is by far the best pecan pie I have ever made! It has turned out perfect every time I've made it! I only cut back on the bourbon just a bit. I made it once for my in laws, who don't like alcohol so I replaced the bourbon with vanilla and it was delicious that way too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peg Martin"
},
"reviewBody": "This pie was easy and so good. Changes I made was putting in some Pampered Chef cinnamon spice blend and I baked it ubtil it was not runny. About 20 min more , 5 min at a time. I live in Sheridan Wyoming at about 3500 ft. Making it again for Christmas by request."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "So I used Fireball Whiskey instead of bourbon on a whim. I was pleasently surprised! Just the hint of cinnamon from the whiskey and a dash of vanilla and it was hands down the best pecan pie I have made to date. Looking forward to sharing it during holiday parties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kealohilani States"
},
"reviewBody": "I love this recipe I make it for the holidays. However it takes way more than 25 minutes to bake. It takes like 45 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valery Villarroel Ibrahim"
},
"reviewBody": "Absolutely delicious! This was first pecan pie I ever made from scratch and it was perfect. I didn't have bourbon, so I instead added 1 tablespoon of Amaretto. YUM! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michael bobe"
},
"reviewBody": "I've been making this pie for years. I made a few little changes. I add an extra half cup of pecans and an extra tablespoon of bourbon. Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Peterson"
},
"reviewBody": "A Perfect Pecan Pie! Truly the best one I have ever made or eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "I used 1.5 cups of pecan chips and threw in some chocolate chips, so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RESAMARIE"
},
"reviewBody": "My whole family (extended) loved this. It was a great alternative to the traditional pecan pie. My uncles claimed (joking) they could drive because of the bourbon but I am now required to make this every Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Recipe is perfect as is, my husband raves about this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jms3125"
},
"reviewBody": "Made this pie with a few adjustments. I used dark corn syrup because that's what I had and a few shakes of cinnamon. It took much longer to bake than instructed. I continued baking in 10 minute increments until the center was firm but bouncy, the pecans were nicely browned and the center temp of the pie was 200 degrees. It was absolutely delicious. Next time I'll double the bourbon and add even more cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Ross Shannon"
},
"reviewBody": "One of my go to holiday pies! Love this one of all the pecan pie recipes I've tried it's my favorite the bourbon makes it so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Didi3324"
},
"reviewBody": "Excellent. This was a super easy to make pecan pie and it was a success for thanksgiving. Hubby will never eat pecan pie from the store ever again. He loved it. It was a little watery after 35min in the oven so I let it bake for another 10mins and it was good after that. Will definitely keep making it going forward!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliane Soprano"
},
"reviewBody": "I made this last night on a lark. More of a cook than a baker. Love anything I do not have to drag out the mixer for. Takes 5 minutes to put together. I like pecan pie but before this one the only kind I was able to find was sickenly sweet or hard as a rock. This recipe conquers both problems. The bourbon flavor mellows wonderfully during the baking so it is distinct but not overwhelming. The filling is viscous but not too dense. My husband loved it - I use a gluten free crust so he could eat it. \n\nThis is going to be my go-to holiday dessert from now on. Happy Thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candygirl"
},
"reviewBody": "This is the exact recipe I have used every year for 25 years except for two things---a teaspoon of vanilla and I use dark corn syrup. I don't know how anyone could mess this pie up (one poster stated it was a disaster). It comes out perfect every time and if you really want to kick it up a notch, add chocolate chips. Fabulous, rich, decadent and so worth the calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roxann1"
},
"reviewBody": "This recipe was delicious - my son said it was the best pecan pie he has ever had!!! I did cook it for an 10 extra minutes though. People that wrote reviews that this recipe was awful or didn't turn our right should not be allowed in the kitchen to wash dishes, much less cook....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Crawford"
},
"reviewBody": "I didn't have any bourbon so I used Brandy. It redefined the word AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ziggy007"
},
"reviewBody": "I followed the recipe completely , truthfully not something I commonly do, it did turn out pretty and smelled great, the bourbon seemed a little strong though. I'm not sure what kind of bourbon other people used, but I had \"Buffalo Trace Kentucky Strain Bourbon\", perhaps a different kind would have made it better. Next time I'll most likely stick with old fashion pecan pie bourbon free. However it was worth a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica89"
},
"reviewBody": "In stead of bourbon I used Disaronno(Amaretto) this taste amasing!! like pecan pie married sweet. caramel/butterscoth/butter!!!!!! try you will be astonished!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kay4les"
},
"reviewBody": "Great recipe! I did make a few changes, left out the sugars, butter, syrup, eggs, crust, etc.......bourbon was a great help while preparing a huge Thanksgiving dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Gallagher"
},
"reviewBody": "Perfection, exactly as written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZandCsmommy"
},
"reviewBody": "My husband adores this pie. You can definitely taste the bourbon, so if you don't like the taste of bourbon this is not for you. After making this several times, I have decreased the pecans to 1 1/2 cups. I know it's a pecan pie, but I thought the amount of pecans was overwhelming. So glad I found this recipe. I've made it 4 times in the last 6 weeks and passed it down to my sister."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Wonderful! I recommend coarsly chopping your pecans as opposed to halves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Houpt"
},
"reviewBody": "This pie is pure heaven! It is the best pecan pie I have ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonda58"
},
"reviewBody": "Pecan pie is my husband's favorite so it's a holiday tradition in this family. WOW, do we have a new favorite recipe with which to carry on that tradition! The bourbon cuts down on the pie's natural sweetness and is the perfect amount for our tastes. A winner!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BSIMRET"
},
"reviewBody": "Wow! I've been using a recipe EXACTLY like this for the past 6 years!!! I also use the same recipe to make mini-pies to pass out as thank you treats to teachers &amp; friends around thanksgiving. Everyone raves about it. If the pie is jiggly /runny, cover the pie with foil and let it bake longer. The bourbon flavor mellows out, and makes this pie even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Paola"
},
"reviewBody": "Total Disaster. Rating based soley on the outcome I would give this 1 star. But to be fair, I don't know if it was such a disaster because maybe I did something wrong? First of all, the recipe calls for a 9\" deep dish pie crust. The filling however, only filled up about 1/2 inch of the pie dish. While cooking, it \"rose\" up to about halfway up the crust, but once it came out and cooled, it deflated down to maybe just 1/4 inch of filling. And what little there was, tasted awful, very eggy and not yummy at all. The only change I made to the recipe was that I used brandy instead of bourbon (all I had on hand). What I am wondering is that I used egg beaters instead of whole eggs. Would that have made such a huge difference? I am hesitant to even attempt this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah Jane Thompson"
},
"reviewBody": "This was ok. Had a strong bourbon taste that I didn't care much for, but it came out looking very pretty and set very nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristab"
},
"reviewBody": "Easy &amp; great tasting! Had to cook 30 minutes. It also lasts without turning watery after a day or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tizzylizz"
},
"reviewBody": "This was a really good and EASY Bourbon Pecan Pie recipe. My ugly picture with my horrible looking pie crust (but, it tasted good!) doesn't do this pie justice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GOLDENONE39"
},
"reviewBody": "This was okay. I was born and raised in Georgia and ours was much more flavorful. Needs more butter and bourbon taste which I will add the next time I make this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAN"
},
"reviewBody": "I made this for Thanksgiving dinner, &amp; Oh My! What an outporing of compliments did I get! This pie is seriously delicious. Thank You Kimberley"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Peterson"
},
"reviewBody": "20 some years ago I came across an elderly southern lady's recipe for Bourbon Pecan Pie. This is the exact same recipe, and I can tell you after baking this pie for 20+ years that it is without a doubt the best pecan pie there is. If you want a fancy presentation, take your pecans and arrange them in the pie crust. Press them down slightly. Then add your liquid. The nuts will rise to the top during baking leaving a professional appearance. I have only done this a few times when I really wanted a WOW presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Snyder"
},
"reviewBody": "The bourbon adds a really nice touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loricakes"
},
"reviewBody": "This was an excellent pie. Since I had no bourbon, I used Gentleman Jack instead. This is my new Thanksgiving pie. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKYBLUE1963"
},
"reviewBody": "This pie is delicious and so easy. I just used a bourbon that I happened to have on hand (Jim Beam) but I think any bourbon would do. I was worried that it might have to strong of an alcohol flavor, but it cooked right out and left it with a more sophisticated taste that was a welcome change from the same ole' pecan pie. Everyone loved it so I will be making again soon! Thanks for sharing Kimberly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice McCaffrey"
},
"reviewBody": "Excellent, in spite of the fact that I got involved in another project and overcooked it. It was nice that it was so forgiving!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/155135/favorite-bourbon-pecan-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2411/desserts/pies/pecan-pie/",
"name": "Pecan Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/155135/favorite-bourbon-pecan-pie/",
"name": "Favorite Bourbon Pecan Pie"
}
}
]
}
}
, "about": [
]
}
]