				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Five Flavor Pound Cake"
,"datePublished": "1998-11-26T23:33:03.000-05:00"
,"dateModified": "2022-11-03T12:26:33.000-04:00"
,"author": [
{"@type": "Person"
,"name": "PJ Coward"
,"url": "https://www.allrecipes.com/cook/24327451"
}
]
,"description": "This five flavor pound cake is flavored with coconut, lemon, rum, butter, and vanilla extracts for a moist, tender cake with a sweet, sugary glaze."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CPL-UM4ircL5szxcYmPQT0SHyK0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/659109-2ea48f7a0d364bfeaef57a6198deb119.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Five Flavor Pound Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "234"
}
,"cookTime": "PT95M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "511 kcal"
,"carbohydrateContent": "72 g"
,"cholesterolContent": "103 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "144 mg"
,"sugarContent": "51 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"3 cups all-purpose flour",
"0.5 teaspoon baking powder",
"1 cup milk",
"1 teaspoon coconut extract",
"1 teaspoon rum flavored extract",
"1 teaspoon butter flavored extract",
"1 teaspoon lemon extract",
"1 teaspoon vanilla extract",
"3 cups white sugar",
"1 cup butter, softened",
"0.5 cup shortening",
"5 large eggs, beaten",
"0.5 cup white sugar",
"0.25 cup water",
"0.5 teaspoon coconut extract",
"0.5 teaspoon rum flavored extract",
"0.5 teaspoon butter flavored extract",
"0.5 teaspoon lemon extract",
"0.5 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 10-inch tube pan."
} ,{
"@type": "HowToStep"
,"text": "Combine flour and baking powder in a medium bowl; set aside. Combine milk and extracts in a liquid measure; set aside."
} ,{
"@type": "HowToStep"
,"text": "Cream sugar, butter, and shortening in a large bowl with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Beat in flour mixture alternately with milk mixture in batches, beginning and ending with flour mixture. Spoon mixture into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 1 1/2 to 1 3/4 hours. Cool in the pan on a wire rack for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "While cake is cooling, make glaze: Combine sugar, water, and extracts in a saucepan. Bring to a boil, stirring until sugar is dissolved."
} ,{
"@type": "HowToStep"
,"text": "Turn cake out onto the wire rack. Place waxed paper under the rack to catch glaze drippings. Slowly spoon glaze over the top of hot cake. Cool completely."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I would emphasize to be sure you like the scent of the extracts you use. In any pound cake, the flavoring is really highlighted, and that's especially so for this one which relies on less butter than typical."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nice4ureye"
},
"reviewBody": "Very great cake I forgot to do the final step with adding the water sugar and 5 flavors however did everything else as directed and everyone raved about it including the kids wanted to know what to do with the crumbs as they literally enjoyed the crumbs as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roserobinson7"
},
"reviewBody": "This is my absolute favorite dessert! I am not a baker, except for my delicious cheesecakes, and I’ve always wanted to learn how to make a delicious 5 flavor pound cake that had the crunchy delicious edges. WELL THIS IS IT!!!♥️♥️♥️ I bookmarked this Allrecipes recipe a few years ago, and EVERYTIME I bake this pound cake it turns out delicious and perfect each time! I baked this one last night and forgot to take a pic of it before my husband and I both ate two big slices each, and gave our granddaughter a small slice. Well, here’s a pic of it anyway, LOL. It is sooooooooooooooo delicious! FYI, I greased my cake pan well with butter, NO FLOUR. It came out of the pan perfectly. I ALWAYS follow the recipe to a ‘T’ and there no overflow problems and no problems with flavoring like other reviewers mentioned, JUST A PERFECT CAKE EVERYTIME! I have two very nice Bundt cake pans, so I think it’s a great idea to make sure you get a really good pan for better results if you’ve been experiencing some issues with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Too artificial flavored"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Byers"
},
"reviewBody": "I made this cake recently. OMG. It was so good. Took to a small party and didn’t bring much home. The only thing I did differently was I left the cake in the pan out of the oven. Mixed the glaze. Punched holes in the cake and drizzled glaze over it. It makes part of the cake crunchy. The cake was dense"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hawaiitude"
},
"reviewBody": "I agree with the assessment that five flavors is too much. The cake has great crumb. texture, and a wonderful sugary crust. But the inside tastes of too many artificial flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Johnson"
},
"reviewBody": "It turned out well. I wish the glaze had a thicker consistency"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "The cake was delicious! I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa Ann Jones"
},
"reviewBody": "Best pound cake ever!!!!!! Two thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberley Graham"
},
"reviewBody": "My first time baking this cake and it turned out amazing! My Ma Suzy made it when I was a kid. It tastes so good that I can't believe I made it. I used sifted cake flour and because I like salty and sweet, I used salted butter instead of shortening. It's very moist and delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherisys"
},
"reviewBody": "I lost my five flavor pound cake recipe and Allrecipes did not disappoint! This is better than the recipe I had. My family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queen"
},
"reviewBody": "It was delicious, family went crazy over it. Don't think it had a chance to cool!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loveblueunicorn"
},
"reviewBody": "I made the recipe as instructed except used only vanilla, almond and lemon extracts. I also used goats milk instead of regular milk, butter flavor crisco was used. The cake came out perfect. My son came over and tasted it and left with half the cake. My family loves it. Will continue to make this recipe over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TTCOOKIN4TWO"
},
"reviewBody": "Made and baked both cake and glaze as directed. Removed from oven with a few crumbs attached to metal skewer. Light, moist texture. Lemon extract flavoring is dominant. Would make again and will swap out the lemon with another flavor or double up on one of the others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya P"
},
"reviewBody": "This was my second time in two days making this cake! Yes, second. The first was a hit and didn’t last, so for the holiday, so I ‘making a second. Because we cant drink whole milk, i used 2% and nobody knew the difference. Winner Winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frnchl62002"
},
"reviewBody": "Great pound cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaLona"
},
"reviewBody": "My husband is very picky when it comes to desserts and he LOVES this cake. I made it with lemon, vanilla, rum, and pumpkin spice extracts (because those are the only four flavors we had in the house). I took other reviewers' advice and beat the eggs separately before adding them to the creamed sugar. I also lightly floured the bundt pan after oiling it. The cake was perfectly baked after an hour and 30 minutes in the oven. I was able to dump it neatly from the bundt pan onto the cooling rack without any pieces breaking off the cake. I've stored it at room temperature in a cake display stand, tightly sealed in plastic wrap to preserve freshness (although at the rate my husband is eating it, the cake won't last for long anyway!). Excellent recipe! Will be a staple in our home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Hall"
},
"reviewBody": "Made this a while back back was a fresh taste for a pound cake. All the flavors in it was a great combinatio"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Champagne Ogini"
},
"reviewBody": "Amazingggg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Faulkner"
},
"reviewBody": "Very easy to make and so flavorful!! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dianas"
},
"reviewBody": "Made as directed in three loaf pans. Baked for about 1hr. 15 min. No complaints, but nothing unusual."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vargas Gracie"
},
"reviewBody": "I followed the recipe exactly as stated. It was moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Pottinger"
},
"reviewBody": "The only poundcake recipe you will ever need. I have used this recipe for 10+ years and always rave reviews. I recommend changing up the extract flavors for a treat. One of my favorites is caramel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ingrid M. Johnson"
},
"reviewBody": "This is a family favorite!!! I've been making it for years. If you can make this cake a day ahead of the event date...do it!!! The flavors settle together and the flavor is amazing. I play with the extract combo at times but the original five is great as well. Be sure to grease and flour the pan well. This cake is heavy and I tend to make a few cupcakes from the extra batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kasity H"
},
"reviewBody": "This cake is delicious! My family loves it. I made one change instead of regular milk, I used buttermilk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "felicia"
},
"reviewBody": "This is fantastic exactly the way it is. I have made this recipe over 20 times and it turns out great each time. It is very important to grease and lightly flour the pan though because it will stick. I have changed the flavors a few times just for different flavors but this is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tresha Ward"
},
"reviewBody": "It was delicious but unattractive because some parts of it \"fell\" so it was inconsistent in texture. We enjoyed eating it but I will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Moore"
},
"reviewBody": "I give this recipe a \"high 5\"! I don't make cakes from scratch, but wanted to surprise my husband with his favorite cake on his birthday. He was pleasantly surprised and nearly ate half the cake the first day!!! I did have to split my batter I was afraid my bundt pan would spill over. I used the remaining in a loaf pan which was fine as well. I am going to freeze that one and will wait to see how well that turns out. Thank you for helping me make my husband's birthday much sweeter!!! It's a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peppini"
},
"reviewBody": "Woah!! A whole lot of flavor! But I kind of expected that. What I didn't expect was the unusual and pleasant texture. It was soft and fluffy in the middle and chewy and crunchy on the outside. Love it!! I used Butter, vanilla, orange, and almond extracts. I used the glaze that is in the recipe and then made a thicker drizzle with 1 cup of greek yogurt and 3 cups of confectioner's sugar with 1 teaspoon of vanilla and orange extracts. A Dish of Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherrysherry"
},
"reviewBody": "very delicious moist cake however the glaze is not needed. I made the glaze and it's way too watery it just settled in the plan so I discarded it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Williams"
},
"reviewBody": "This cake will tantalize your tastebuds, you taste every single flavor. I added theses Flavors, Rum, Coconut, \nVanilla, Almond, and Butter . Also instead of whole milk I added Buttermilk. When I say this Cake is delicious and moist, it is uh uh GOOD !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This is my second time making it. I added sour cream &amp; orange flavoring. The first cake was gone in 2 days. My husband complained because he didn’t get any. This cake is so moist and fluffy. I think I ate 3 pieces myself. Super addictive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stiletto_castiron cook"
},
"reviewBody": "Everyone loovvveeedd this cake. Texture was amazing. \nPersonally, I think it was a bit too busy -flavor wise. I plan to cut back to 1/2 teaspoon on all flavoring next time. \nHonestly, I used rum, almond, vanilla, coconut and lemon. There's no second row flavoring in this group. Noticed this cake didn't have any salt added which was cool. I did use unsalted butter as well. Salt was not missed. I did use a 1/4 butter 3 Tblsp milk, confectioners sugar based glaze. I will definitely bake this again. It's a great template for all pound cakes just add one flavor. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wkay"
},
"reviewBody": "Left out lemon extract because I didn’t have any. Put in two small bundt pans to give as thank you gifts. Greased; floured and even used Bakers Joy because I had not used these pans for baking. They did not stick. Really good and easy recipe, I tasted the pieces I cut off bottom- delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MazeyG"
},
"reviewBody": "This is truly a very delicious cake. A must try!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Cammack"
},
"reviewBody": "Best cake ever! I combined my grandmother's recipe and this one. Tip: Do not preheat the oven! place the cake mixture in a cold oven and the set the temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redhead"
},
"reviewBody": "It was a wonderful cake! The only thing I would change, would be to use one stick of margarine and one stick of butteri instead of two sticks of butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Wilkins"
},
"reviewBody": "The first time I made this cake no one believed I baked it. I'm not a baker. Entrees are my thing but the easy directions made me look like a pro. I've made it five times since then and my family scarfs it up every time including the time I forgot to grease the pan and it fell apart. It was ugly but the taste was still spot on. I'm done. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILove2Cook"
},
"reviewBody": "My family made this recipe and it was very good. I unfortunately am gluten intolerant, so I had to watch everyone enjoy it. I love to bake, so I decided to try a gluten free version at home. I made the recipe as written, with two exceptions: I substituted all-purpose gluten free flour (Namaste) for the flour, and substituted buttermilk for the milk. I'm sure the milk would have been fine, but I find that buttermilk does better with gluten free flour for some reason. I used the same amount of flour it called for, but just used the gluten free flour. I baked it for an hour and twenty minutes and it was perfect. It was moist and those who tried it couldn't tell it was gluten free. There are many gluten free foods out there, but if they don't taste great, I won't waste my calorie allowance on them! This was very good. If you have to eat gluten free, give this a try with those substitutions. I'm making it again for Easter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Bullard"
},
"reviewBody": "This is my first pound cake. I made it to the exactness of the receipe. I looked up how to cream butter and sugar and beating eggs till they were ready, and not beating too much after the flour was added. We like lemon so I added two packets of dried lemon powder the the batter and later added 3 packets to the icing. \nI also greased and floured an aluminum pan thoroughly rather than perhaps screw up shape by trying wax paper or parchment.\nIT WAS BEAUTIFUL. JUST THE PERFECT RISE ABOVE TOP OF PAN. THE ICING SOAKED IN NICELY WHEN ADDED BY THE SPOON FULL. \nI am so proud. THANKS FOR HAVING THIS RECEIPE ON LINE? ONE CAN ALWAYS TRUST ALLRECEIPES TO HAVE THE BEST!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jano"
},
"reviewBody": "I followed the recipe exactly (except I greased AND floured the pan) and the cake was delicious--the best pound cake I've ever made. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsMac"
},
"reviewBody": "everyone who tries this one loves it! we substitute rum flavoring for the lemon, and it's just as awesome. one of these cakes was donated to a local fundraiser, and it brought $90 at auction! I make 2 for holidays just to have enough. It's great with strawberries and whipped cream too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Henrietta"
},
"reviewBody": "This is a great pound cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Just like my grandmothers. Bought back great memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I don't use shortening, I use vegetable oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Leal-Ontiveros"
},
"reviewBody": "The best pound cake ever! The only change I made was to swap the butter extract for almond. It is better than the 5 flavor pound cake my oldest son loves from a local bakery! Moist, dense, but not overly sweet. I don't even use the glaze. It doesn't need it at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ethel"
},
"reviewBody": "I have made this cake several times and it has been a hit. Made it for Christmas and it was like a fight for the last slice. Took it to work and it was once again a favorite. Love this recipe, would not change a thing about it. \n\nPurehoney"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "babycake"
},
"reviewBody": "This is a wonderful pound cake very moist and the flavors delicious. The top has a nice crunchy texture. I used whipping cream because I didn't have milk and it is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "minaayindra"
},
"reviewBody": "Wow! I have never had such an enthusiastic reception for a pound cake before! I made this and was happy at the subtle flavorings, the semi-moist texture, and the overall attractiveness of the finished cake. You should use the freshest extract, as a mixture of so many types could easily allow the fresh ones to drown out any older flavors in your supply. I was delighted that everyone could identify the flavorings consistently- unheard of in large combinations like this! The cake was firm but also had a slight crumb texture, just what you would want. Less baking time would make it stick together more solidly, so you have to find what your preferences are and time accordingly. The cake is HUGE and made a beautiful, crispy crust that everyone remarked on. The glaze adds to the crisp texture as the sugar crystalizes; again, be sure you are using fresh extracts as the five flavors are present in this coating as well. I noticed others commenting about the cake sticking to the pan- I had absolutely no issue with this, but I also grease tube pans thoroughly with solid shortening prior to baking (they are notorious for wanting to hold onto cakes)- I use a fluted pan with non-stick coating inside, so greasing it before baking seems to be sufficient to avoid any issues, and I have a beautifully decorative end product. Always let the cake cool for 10 minutes on a rack before you tip it out, no more and no less. I also beat the eggs for a minute prior to adding them to the batter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sidney Womack"
},
"reviewBody": "I had no problem with the cake sticking to the pan ; I followed the directions greased the pan with butter &amp; crisco and after cooling 10 min. turned it and out it came. thanks for the recipe ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larken"
},
"reviewBody": "This is my favorite cake to make for the holidays! It actually makes a great gift to give to families! Everyone loves this cake. We call it \"Pound Cake Surprise\" because each bite is a different flavor. If someone is new to the cake, they try to guess the flavors. The cake goes quite fast. (Sometimes I even substitute the flavors, depending on my mood or what I have in stock!). In regards to the cake sticking...happened to me rarely if I didn't use a non stick or if I failed to grease and flour the pan BUT I've started using \"Baker's Joy\". Baker's Joy is amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQ King"
},
"reviewBody": "I use this recipe all the time and I alter it sometimes. last cake i made I added 3/4 to 1 cup of white chocolate that I ground up in a blender or food processor. I also added around 1/4 to 1/2 cup of sour cream til mixture was good and smooth and slightly flowing in the bowl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faye's Besos"
},
"reviewBody": "I love this cake and have been making it for years. I will have to agree with the others when they tell you to go extra on the flouring of the pan. It sticks me almost every time. I'm starting to think that it might be the pan itself. Did I mention that I had to go to 6 different stores just the find the rum extract. I made sure I grab two bottles of this stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyle"
},
"reviewBody": "This is the same as my Grandma's recipe card (remember those) except she doubled the sugar and water in the glaze and adds a teaspoon of almond to just the glaze. HELPFUL HINTS. Use 'unsalted butter', Don't scrimp or substitute ingredients (this doesn't include your flavor choices, go wild), Beat eggs for three minutes before combining, Combine the wet and dry by slicing through the mixture with a spatula (be gentle), Use parchment paper in the bottom of your pan. Grandma's recipe suggests slowly spooning a third of the glaze over hot cake in the pan, wait five minutes, spoon another third, wait 5 minutes, etc. Let the cake cool in the pan. Seems like too much liquid but, trust me, it will absorb every drop and be the best pound cake you've ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "I had to make this pound cake, so many times I did not get a chance to post my rating. Bravo, Bravo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LaTonia Johnson"
},
"reviewBody": "I made the cake twice and each time it stuck to the bludt pan. Please advise! I followed the directions and it taste really good. I love the cake but please help me with the problem!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krenee"
},
"reviewBody": "Great, great cake. My first attempt came out dry with a crackly dry top. I believe I beat it too much after each egg. So I deleted the shortening and added a stick of butter. I also increased the glaze by 1/2, added almond and orange extracts and deleted a 1/2 cup of sugar. I used a 10-in dark metal bundt pan at 325 degrees for 1 hr and 20 min. It was perfect!!! Nice golden brown on top. I like to wait until the next day before I eat it so that it can settle. It tastes great with ice cream or for those who like cake with their coffee in the morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JW"
},
"reviewBody": "I did not find the flavor special at all. Very dense. Directions need clarification to avoid over mixing ingredients or cake will be dry. Made 2 x. Glaze is meh....ok but not stellar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AMYANDBREN"
},
"reviewBody": "This was good. With all the extracts, it tasted a bit \"artificial\"...use real when you can, and I would recommend reducing by 1/2 tsp. I think the sugar could also be reduced. I read the other reviews on this and decided to make the recipe as is without reducing the sugar. I love sweet, so that's not usually a problem for me. But this was very sweet, and it formed a very hard sugar crust on the top. Also, I baked for 1.5 hours and still could have reduced my time by probably about 5-10 minutes I'd guess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anna"
},
"reviewBody": "I've used this method of applying multiple flavors to both a buttermilk and a cream cheese pound cake. The flavor is amazing. My mother always request the 5 flavor pound cake. My oldest sister who is an avid baker has been trying to get the recipe from me. But I won't tell. I normally use 2 tsps of the Vanilla and cut back on the rum. As some have noted depending the the brand of rum flavor that you purchase, it's flavor can overpower the others. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noreen Baker"
},
"reviewBody": "OMG! This pound cake is absolutely the BEST! I followed the recipe pretty much as is. I did not have any problem with the cake sticking to the pan. I used a non-stick spring-form pan and greased it lightly just as a precaution after reading the reviews. I also cut down the sugar to 2-1/2 cups and it was delicious. Whenever I make a cake I always use cake flour because I believe the cake comes out lighter. This pound cake was dense as it shoud be for a pound cake, but still fluffy. I also followed the suggestion of beating the eggs separately, then added the 1/2 and 1/12, and extracts to the milk/egg mixture. Then I added the egg mixture alternately with the flour/baking soda mixture. I used 1 teaspoon of the following extracts: coconut, almond, vanilla, rum and orange. The combination of flavors blended well and the flavor was absolutely wonderful. It took willpower to only eat 1 piece! I used 1/2 and 1/2 (part milk and part cream) but I think it would be just as good using all whole milk. Thank you for this recipe. I can't wait to make it for our next family get-to-gether because I am sure everyone will love it! I would give it 10 stars if I could!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Wonderful! I am 51 years old and have been cooking since I was 9. Needless to say, I've made my share of pound cakes. A year or so ago I was on the quest for the perfect pound cake recipe. I made one each week for 5 weeks and finally gave up - not that they were bad, they just weren't exceptional. This recipe is! I made it 3 days ago and me and my husband have eaten half of it already! I took the advice of others and beat the eggs for about 4 minutes by themselves. I then added the butter, sugar, and butter flavored Crisco and creamed those along with the eggs. I did not deviate from the recipe ingredients and followed the rest of the directions as given. It has a crispy top crust, is beautifully golden brown, and the flavor gets better with each day. I've found my forever pound cake recipe!! Thank you PJ!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jot"
},
"reviewBody": "Tasted good the first day then was pretty dry the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nana"
},
"reviewBody": "I followed the recipe exactly. It was a nice, moist and dense cake but I gave it 4 stars because I found it too sweet for me. But that is just my personal preference. I think I will definitely try it again but with less sugar and maybe skip the glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Max"
},
"reviewBody": "After two unsuccessful attempts to make a traditional lemon pound cake I decided to try this recipe. I was pretty excited at the results. I followed directions almost as listed (used 1/2 cup less sugar) and replaced coconut extract with almond. Cake turned out light, moist and fluffy. I have a very old gas oven, so i cooked for one and half hours and it was fine. I used 10\" pan and did not have any overflow and per the other comments, i greased and added flour to the pan and it came out easily. I used the glaze becaue i like glazes, but could have omitted this as it leaves a bit of an aftertaste. Did not find the various flavors overpowering. Going to share over Christmas and hopefully this will be one my family enjoys."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Passionate Baker"
},
"reviewBody": "Baking is my \"Passion\", I have literally baked thousands of cakes and I must say that this is one of my absolute favorites. My cake fans simply LOVE it!!! For those of you using a bundt pan, a 10\" would be better; this cake pushes a 9\" pan to the limit and almost over the top. One member mentioned that she thought the \"flavors were fighting too much\". Everyone's palate is a little different and with this being said, you can tweak the flavors to satisfy your palate. Personally, I have made several versions of this cake and I prefer to use Brandy flavoring instead of Rum flavoring, simply because Rum can be a bit overpowering to me. Almond and orange flavorings are also FANTASTIC in this cake. You can also increase the butter and/or the vanilla if you feel the other flavors are overpowering. Or simply decrease the flavors that you like the least. Have fun with baking this cake and experiment with flavor variations (but stick with \"5\" flavors). This is an AWESOME, AWESOME Pound Cake Recipe..ENJOY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DROB17"
},
"reviewBody": "Excellent. I also add almond extract for a richer taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "Perfect pound cake texture and flavor. I followed the recipe almost exactly with just a few changes and suggestions. I took another reviewer's advice and cut the sugar to 2 1/2 cups - probably didn't make a difference. For the glaze, I used fresh squeezed lemon juice instead of water and didn't bother with the lemon flavoring in the glaze. Took the warnings about sticking and used a heavy coating of Crisco and flour. After cooling for 10 minutes, I removed the cake from the side pan, but left it on the tube part. Poured the glaze on (It sank right into the flat cracked top.) and refrigerated the cake overnight. The cake lifted right off (after sliding a knife under) when it was firm. Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannette"
},
"reviewBody": "Dense, flavorful, excellent - even without the glaze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Cole Pruitt"
},
"reviewBody": "Delicious...came out perfect on the first try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misty harrison (landymaybellin"
},
"reviewBody": "Today is my husband's birthday. Out of all the cakes out there, this is the one he wanted. This is one of those cakes you can change up the flavors to fit you. It's just that good! You don't have to be the best baker in the world to pull off a great cake when you have a great recipe like this one. \n Thanks so much for sharing and for helping me bake my wonderful husband a birthday cake almost as wonderful as he is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksfields"
},
"reviewBody": "The absolute BEST pound cake in the world!!!! Not too heavy, moist and very tasty! I have made this for atleast 8 different functions and it went fast with people wanting the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "homeecmjr"
},
"reviewBody": "I've been making this cake for about 20 years, but have used almond flavoring rather than rum. (I'm sure rum would be great too) But this recipe suggestion to drizzle the boiled glaze on top of cake over wax paper, is messy and wasteful, as too much drips off, no matter how careful you try to be. My recipe calls for glaze to be poured over hot cake right in the pan. Then, after glaze is absorbed, turn cake out of pan and continue cooling. Always delicious and never messy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robcangel"
},
"reviewBody": "Soo delicious and easy!!! Followed recipe exactly.UPDATE: How can you change so many ingredients in a recipe and then when it fails, you low rate the recipe? This happens sooo much on this site, and a lot of recipes are actually great, but a low rating can turn some people away before they even try it!!! I'm just sayin'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISONTI"
},
"reviewBody": "This cake is AMAZING!! Took it to my mom's Easter Sunday and my husband renamed it the Evil Addiction Cake! Only change I made was swapping out the butter extract for almond (to clone a local baker's flavors), and omitted the glaze. It is perfect without the glaze! Not too sweet or heavy, and SUPERMOIST. I used my Kitchen Aid and let it beat the fool out of the batter. I only needed 80 min of bake time. My husband already asked for me to bake another one, and he just finished the last of it this morning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joys from CA"
},
"reviewBody": "I am rating this 3* because it stuck to my bundt very badly despite the fact that I read the reviews and was conscious of greasing it very well. I used a \"heavy decorative\" pan. It was disappointing. I also used reg. rum as I didn't have extract. I replaced a bit of the milk with the rum and \"think\" I used a bit too much. The cake was tasty and moist, but I'm not sure any better (in my opinion) than the cake mix bundt cakes that I often make. I probably will try it again with a different pan and with the coconut extract which I didn't have this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doc2813"
},
"reviewBody": "Great recipe. Have fun with different flavors. With this recipe they all taste good.,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelmichelle"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Persephone"
},
"reviewBody": "I used coconut, rum, almond, vanilla &amp; lemon extract and the flavor was very good! However this recipe MUST be made with regular sugar. I tried it with Splenda, and the consistency was thicker and drier. But I had no choice, as I was making it for my parents who are diabetics. To fix the dryness, I made a simple frosting of sour cream and cream cheese with a bit of sugar and almond extract. It made it a bit more moist and it was alright. Also, I had to bake it for less time, since it started to brown right away! Around 1 hour worked fine. I also omitted the final sugar glaze. I think that I may try it again with a bit more shortening and perhaps butter to try and make it more moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeccaM"
},
"reviewBody": "This was yummy! I did not use all the flavorings, simply because I did not have them, but that I am sure would have made even better. I just used approx 5 tsp of homemade vanilla instead. I also made a chocolate sauce with semi sweet chocolate instead of the really sweet glaze. The combination was delicious, and not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shonese22"
},
"reviewBody": "This is the best pound cake recipe, hands down!!!! This was my first time ever baking a cake. This cake turned out perfect. It's def a must try. This cake/recipe deserves 10 stars lol. Enjoy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley"
},
"reviewBody": "Absolutely delicious!!! Very moist and flavorful. I didn't have rum or butter flavor extracts so I used almond and banana extracts instead. My husband loved it. He said it's the best pound cake he's ever tasted. It's the best cake I've tasted too. I wasn't a fan of pound cake before but I'll definitely be eating this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snitch34"
},
"reviewBody": "My older sister makes this cake all times of the year. I think she follows it as is. We love this cake with or without the glaze. My grandmom and aunt who are diabectis love this cake too and it is not that sweet as some of the other reviews state. Try if for yourself and see. I was not sure when my sister told me about this cake because of all the flavors but we now request this cake at a moments notice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Frideres"
},
"reviewBody": "This is very good! Changed only a few things, I used an angel food pan and omitted the coconut extract, (I'm allergic). It cooked beautifully, made the house smell wonderful and removed from pan without any trouble. On top of glaze I added dusting of powdered sugar and maraschino cherries. It worked beautifully for my sons 19th birthday! Thanks for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bkowach"
},
"reviewBody": "Very good. I baked in 5 smaller disposable bread pans to give as gifts. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baricat"
},
"reviewBody": "Yum!! Went heavier on the vanilla, and lighter on the coconut, since we're not huge fans. It was wonderful. Nice dense texture with moist, fine crumb. Works well for torting, as shown in the picture. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Myra Hensley"
},
"reviewBody": "I thought the flavors were fighting too much with one another."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUGGAGIE"
},
"reviewBody": "Very tasty recipe. I reduced the amount of sugar to 2 cups which was just the right amount of sweetness. I added raisins and nuts to add texture. It came out delicious and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chae"
},
"reviewBody": "I made this cake in two 8 inch rounds. There was way too much batter so it over flowed, a lot. But the cake was absolutely wonderful. I baked them for approximately 70 minutes and they were done. \nI also added 1tbl lemon juice and the zest of one lemon and omitted the coconut, lemon, rum and butter flavor. \n\nI iced with butter cream in a layer cake, received very good reviews! I'll make this again with less sugar, because I did find that to be slightly overwhelming"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was really yummy, although not quite as I expected judging from the other reviews. I used coconut, almond, rum, lemon and vanilla flavouring, and although it turned out really yummy, I couldn't really taste the added flavours. It just tasted like a really good, plain pound cake. Although... that may be because I used \"essences\" not \"extracts\".. just realised that extracts are probably stronger. Will add more essence in then next time! \n\nI poured the glaze on top, though I didn't used all of it, and I added milk to it to soften the sweetness. I also reduced the sugar to 2 1/2 cups, and it was still nice and sweet.\n\nAlso, next time I think I will add some sliced apples coated in lemon and cinnamon at the top before baking, I think it will go perfect with my cake's flavours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Simmons"
},
"reviewBody": "Excellent recipe. I got lots of compliments. I made as written, with the exception of changing some of the extracts. As other reviewers have said, it doesn't really matter which ones you add so long as you add 5 tsp. I chose lemon, butter, vanilla, almond, and orange."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marcosheller"
},
"reviewBody": "This pound cake is excellent! It's a keeper. I only had the vanilla and lemon flavorings and I didn't have milk, so I used half-n-half. For the glaze, I used vanilla and almond. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Henley"
},
"reviewBody": "Made this for a friend and the whole family loved it! Can't wait to try it for myself! Super easy to make. I made mine in a tube pan but I think I'll do it in a Bundt pan next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewBride"
},
"reviewBody": "We thought this cake was good. I was a little worried about all the different flavors, but they blended well together, and no one flavor dominated. It was a little bit sweet for my taste, but my husband enjoyed it. The texture was nice, and it was moist. I may try topping it with strawberries or peaches with whipped cream. Ours did stick in the pan, so next time I'll flour the pan, as well as greasing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marljong"
},
"reviewBody": "Incredible and delectable! The flavors are copiously harmonious, especially if you make it a day ahead prior to serving; it will be out of this world! I didn't need the glaze and omitted the shortening; added Malibu Coconut rum, orange extract; used buttermilk and self-rising flour from Allrecipe. Line the bottom of the oven, batter spilled over my 10 inch bundt pan. Baked for 1 hr 15 mins. In Love..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie S."
},
"reviewBody": "The only thing I changed were the flavors used in this. I had no coconut or rum extract, so my solution was to do 2 tsp of Malibu Coconut Rum. I also used 1 tsp almond extract, 1 tsp vanilla extract and 1 tsp lemon extract.\n\nI brought the whole milk, eggs and butter to room temperature, and really whipped the butter, shortening and sugar half to death. The cake only needed 1:30 to cook in my oven, and we topped it with fresh strawberry puree and fresh strawberry slices.\n\nThis is a keeper, and if I could give it more than five stars, I would!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Simply Divine"
},
"reviewBody": "I love this cake, simply divine. One question is this cake suppose to be a golden yellow looking cake. Just asking. I love the taste and it is very sweet I must say. My sweetheart loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Red_Stale_Moon"
},
"reviewBody": "I made this for a bake sale that my work was having and all of it sold! I didn't have the rum or coconut at the time, but I used honey with the others. People loved it! One man bought a piece and said he was coming back for more! Everyone was asking what I put in it! Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizann257"
},
"reviewBody": "Wonderful cake! Everybody enjoyed it and no one would let me take the leftovers to work. You know a recipe is a keeper when there's a fight over what's left. \n\nI used coconut extract instead of lemon just based on person preference and a few reviews and it was yummy! I also had a dark bundt pan and then outside turned out a bit darker than a few pictures listed. I cooked for 90 minutes and I definitely wouldn't go much longer than that."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8072/five-flavor-pound-cake-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
"name": "Pound Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8072/five-flavor-pound-cake-i/",
"name": "Five Flavor Pound Cake"
}
}
]
}
}
, "about": [
]
}
]