				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Flaky Food Processor Pie Crust"
,"datePublished": "1998-08-18T16:33:36.000-04:00"
,"dateModified": "2022-11-21T14:13:03.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Charlotte"
,"url": "https://www.allrecipes.com/cook/24322032"
}
]
,"description": "This food processor pie crust is a cinch to make. The secret to a good crust is to have everything very cold and to handle it as little as possible."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IUMuAAGuPcIK1GgarCj8oqykDsA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1069102-0ab30ae917e842ca8b1e26d19505c0f2.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Flaky Food Processor Pie Crust"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "165"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "207 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "15 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "147 mg"
,"sugarContent": "0 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"5 tablespoons shortening, chilled and cubed",
"4 tablespoons unsalted butter, chilled and cubed",
"0.5 teaspoon salt",
"3 tablespoons ice water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Measure flour into the processor with the regular blade attached. Add chilled and cubed shortening and unsalted butter. Add salt, close the lid, and pulse three times with three counts per pulse to lightly mix the ingredients."
} ,{
"@type": "HowToStep"
,"text": "With the motor running, pour ice water into the food processor bowl just until the dough just starts to get noticeably crumbly. Don&#39;t wait until it is a big clump or it will be way too wet and will turn out tough."
} ,{
"@type": "HowToStep"
,"text": "Transfer the crumbly dough into a bowl, and form it into a ball with your hand, squeezing it a bit to make it stick together. If it just won&#39;t form a ball, add a tiny bit more water."
} ,{
"@type": "HowToStep"
,"text": "Wrap dough in wax paper or plastic wrap and chill it for about 30 minutes in the refrigerator. Follow your pie recipe for rolling and baking."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am not sure why there are so many negative reviews with this recipe! I have made this 10+ times and it turns out great. I like that it's not super sweet because you can use it for both sweet and savory pies. I followed it to the T - pulsing three times for three seconds. I used salted butter and omitted the additional salt in the recipe. I used lard instead of shortening but all the other ratios were the same. At 3 tbsp of water, the dough formed beautifully. My only suggestion as it isn't written in the recipe is to let the dough sit at room temperature for about 15-30 min if it has been in the fridge for longer than 30 minutes. It will roll out easier. I just love the fact that using the food processor allows me to get great crusts in such a short time. From start to finish it takes like 10 minutes max per ball. I've also had great experience with freezing the wrapped dough balls. I just throw it in the fridge the night before to thaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have mad a lot of pie crusts over the years. This is literally the worst recipe I have ever used. I tried it two times just to make sure I wasn’t missing something. Although it tastes okay once it comes together it is virtually impossible to roll out. It crumbles and falls apart. Ugh. So frustrating. That you have to piece it together in chunks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Hubby loves pies. Pie crusts have always been my downfall. I have made this recipe probably 2-3 dozen times now. Always comes out flaky &amp; wonderful. Only change I make is to add 2 tsps of sugar to the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbe Hardymon May"
},
"reviewBody": "After 40 years of trying, I finally found a piecrust that turned out right! It was buttery and flaky. I have always been heavy handed and my piecrusts would be too tough and thick. With this one, it was a little short, meaning had too much shortening/butter so I sprinkled flour on the granite countertop and flour on top when I rolled it out and it did beautifully. I could pick it up and put it in the pie pan. I am so thankful I came across this recipe because I hate commercial frozen crust. It is as tasteless as Styrofoam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ChristineJCJ"
},
"reviewBody": "I always make my homemade pie dough without the food processor. I followed this pie dough recipe to the letter, and it was hard to roll it out and form without the dough falling apart. I believe if I didn't chill the dough 30 minutes after I rolled it out, it wouldn't have crumbled.\nI'm going to stick to making my pie crust by hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mishy48"
},
"reviewBody": "Great recipe. Super easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sparki Cook"
},
"reviewBody": "I just made this crust, I have not baked it yet. However I had to use 2-3 times the amount of water than the recipe called for, I am at high altitude Why? Ok, we just ate the potpie I used this crust for ...FANTASTIC I made the bottom thick &amp; Par cooked it, added my filling &amp; top crust. The thick crust on the bottom crisped up so great! It was crispy, flakey &amp; yummy. Love this recipe! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "I wasn't sure what to think of using a food processor for pastry but thought I would give this a go. I followed the recipe exactly, I used all butter as never use shortening. I froze the bitter beforehand. I did need to use a little more water to form the dough ball. I used the pastry to make a cheese and onion pie and the left overs for jam tarts. A really good tasting pastry, I will certainly use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Renee`"
},
"reviewBody": "Very Happy With This Recipe!! I used a mini food processor and it turned out great! Its enough for one pie crust. I baked it at 400F and used a cast iron skillet because I don't own a pie plate. It was PERFECT and SOOO flaky. One note, I did not measure my shortening, I just did heaping tablespoons so I am certain I ended up with a little more shortening than called for. I brushed melted butter on the crust top and sprinkled on sugar. Due to using a cast iron skillet I was afraid it would brown quickly so I covered it with foil the first 30 minutes, then uncovered for 20 minutes. PERFECT APPLE PIE. Will make for years to come. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bren"
},
"reviewBody": "Loved it! I've tried so many \"no-fail\" recipes and they have always failed. The crust is so tender, flakey and absolutely delish! I followed the recipe to a T and it will definitely be a repeat! I used this to make Apple Crumble Pie, also from this site. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen"
},
"reviewBody": "Making a nice pie crust has been my downfall until I found this recipe. For the first time I made a perfect crust that didn't fall apart when I transferred it to the pie plate. Next time I'll take a little more care to make it \"pretty\", but my confidence has had a boost. I was careful to have the butter and shortening very cold, as well as the bowl of the food processor. I'm throwing away all the other pie crust recipes accumulated during repeated failures."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamar"
},
"reviewBody": "Best recipe. Always turns out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmh"
},
"reviewBody": "This is a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kiss the Cook"
},
"reviewBody": "This recipe will not give you any “extra” dough. I doubled it and had to utilize smaller pie pans (8”). I had just enough for 2 pies with entire top crusts (didn’t have time for the fancy weaving). I used 2T more of butter and 2T less of the shortening. The crust was very good and I got to use my new food processor in making the crust - so much easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "qofe"
},
"reviewBody": "My whole life, I could bake anything I tried... except... pie crust. No matter what I did, no matter the recipe (which is pretty standard) my pie crust totally sucked. Until last year at Thanksgiving when I used this recipe. I think it's the shortening, and I froze that and the butter. It's just perfect. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie B"
},
"reviewBody": "I want to make this, but have a question - how do you measure out solid fats as TBSP? Do you just eyeball it? Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri's Favorites"
},
"reviewBody": "Wonderful recipe for a flaky crust that is my go-to for making pies. Just made a blueberry pie and my husband commented on the flaky crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "novice baker"
},
"reviewBody": "Turned out perfect. Tender and flaky. Way better than store bought. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Hertel"
},
"reviewBody": "Really good! I use lard instead of shortening, but other than that followed the recipe to a T. I use the low setting on my food processor (Cuisinart) and make sure to not add any more water than what the recipe calls for. I'll not be buying any more pie crusts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "I used this recipe for Pi Day 2018 for my Derby Pie. My family raved, I think it was the best pie crust I have ever made and I am not a fan of crust. My new go to, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ColleenM"
},
"reviewBody": "Not the best out there. It was pretty dry, I think it needed more water added and not less if using food processor. Doesn't make 2 crusts, more like 1 and 1/4"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CtUsaMom"
},
"reviewBody": "If you can work with the crumbly dough and roll it out, it's a very light and airy crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LS1217"
},
"reviewBody": "I'm glad this recipe worked for so many chefs here, but I had no luck. I tried this recipe twice...followed it to the letter. The result was disappointing. Both the quality and quantity of the pie crust dough was sub par. A real shame, as I would love to have a reliable, quality recipe for making pie crusts with a food processor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Senor Gancho"
},
"reviewBody": "Thanks for the video and the foundation for a great recipe.\nWhen it comes to measuring butter and shortening, I'm a big fan of using weights. (1 Tbsp butter=14.2g; 1 Tbsp shortening=12.8g) I just find it easier when adjusting measurements such as doubling this one to get two pie shells.\nI prefer a higher ration of butter to shortening, so I went with 170g of butter and about 70g of shortening)\nDefinitely stick them in the freezer a bit.\nIt made more sense to me to add the salt, give the processor a couple of pulses then add the fats.\nGood tip about adding the water cautiously near the end. Make a good snowball :-) before wrapping it up and letting it rest. 30min to 2 hrs depending on your time available.\nI'm definitely a fan of the food processor over the old pastry cutter for both efficiency and clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Columbier"
},
"reviewBody": "I will definitely make this again. It was the easier pie crust I have ever made and I didn't even freeze the butter and shortening, I just took it straight from the refrigerator and I didn't chill the dough before rolling it out. It was effortless, perfect pie crust. It's only enough for one crust, though, which is what I wanted for the key lime pie I was making."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I made this recipe exactly as written to top a homemade chicken pot pie. Like other reviewers, the dough crumbled and fell apart after being chilled and attempting to (gently) roll it out. I added a little more water which helped a little. Also, I guess that I just don't care for shortening because I did not enjoy the flavor of it in the end. My kids didn't like it either so it wasn't just me. Next time I will try Chef John's recipe using only butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Feno"
},
"reviewBody": "No changes and I will use it every time. Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lisa thiabult"
},
"reviewBody": "Followed directions butter and shortening frozen chilled for more than 1/2 hour but when I tried to roll it out it just crumbled. Not sure what happened."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Bell"
},
"reviewBody": "This is a phenomenal and easy crust to make. I use this crust for my apple dumplings and they are a hit every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Ross"
},
"reviewBody": "Used only butter. It was too crumbly to form a ball with only 3 TB of ice water. Used more water. Not much. Brushed an egg wash over the crust 10 minutes before the end of the bake. Verrrry nice results. Very pleased with this quick, easy crust. It tasted buttery, flaky and crumbly and tender, like French pastry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolores"
},
"reviewBody": "I inherited my mother's deep rooted fear of making pie crust and it wasn't until I retired and my son bought me my KitchenAid food processor that I put on my big girl panties and bravely tackled making my own home made pie crust. I found this recipe, and, after many pies that didn't look that great (my problem, not the recipe) but tasted yummy, I finally have the process down to a science. My pies are so yummy, and the crust so flaky, that I'm thinking of entering them in the county fair pie contests. :) The family always knows there's something yummy to eat at Grammy's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat turlick"
},
"reviewBody": "I used all butter. Delicious and easy. No more store bought pie dough for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "I made this and thought it was great tasting. I used salted butter and still added all the salt called for. I was trying to be careful about how much water to add, and I went a little short so I was glad I'd upped the servings to 20 for a double crust so there would be room for error (I am NOT a good pie crust baker). I should make another pie soon so I can get this down pat! Thanks, Charlotte!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise M Soweski"
},
"reviewBody": "This is the best pie crust I ever made..it is easy and fast..I made it four times so far.\nWill be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bruce Vereshagen"
},
"reviewBody": "This recipe did not work for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat"
},
"reviewBody": "I tried this recipe twice. Came out good the first time. The second time I used white lily flour. OMG. If I had put this pie in a contest I know it would have won a blue ribbon. If you are not from the south you can order white lily flour online. It is a soft , low protein flour unlike the northern hard wheat flour I can only get in Calif. I followed this recipe exactly. My shortening and butter were put in the freezer beforehand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dot Harrison"
},
"reviewBody": "wow..my pie crust was done in three minutes after the prep was done. I actually made two of them ,they were that simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsJPS"
},
"reviewBody": "Perfect! Used this to make a quiche and it was just right. I despise making homemade crust so this really was a nice surprise -- way less headache than usual."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Meredith Seiler"
},
"reviewBody": "Tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GeminiBaker"
},
"reviewBody": "I have tried this recipe twice. It's the first time I've ever made pie dough in a food processor. I have to say, the crust comes out really flaky, but it is really really easy to overprocess, because the recipe says \"with motor running.. add the water.\" I think this should be changed to \"pulse only\". Then it would be perfect! I also think the amount of water is not quite enough- I ended up adding 5 tablespoons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I had never made a homemade pie crust before this Thanksgiving. Asking for help and suggestions on thebuzz, Deb C. recommended this recipe. I made it as written and according to my family, it was \"awesome\". It was very simple to make, and it rolled out very nicely. My SIL who makes crusts was very impressed and said \"it isn't at all tough\". Not sure what a tough crust is as I don't eat the crust, but everyone ate it all. I used this to make my great-grandma's pumpkin pie recipe and a pecan pie. On day two of the pie my husband commented that the crust was still really good. As easy as this was to make, I know I will be using this crust again. Thanks, Deb for your suggestion. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHARLOTTE "
},
"reviewBody": "I love how my crusts turn out using this recipe. It has made me a great pie maker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This recipe makes a perfect pie crust. In addition, it was fast and easy. I didn't use cold shortening, but did use cold water and butter and it came out perfect. Thanks for sharing, I'll be using this recipe often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cyberjet"
},
"reviewBody": "I followed this recipe to the letter and ended up with a crust that was impossible to work with. I tried altering the amount of water but after 4 attempts with new ingredients each time, I gave up. I'm going back to making it the old fashioned way. Some things were just not meant to be done by a shortcut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "choppychick"
},
"reviewBody": "Flaky, yes, flavorful, not so much. I've been making pies for years, but cutting the butter in by hand when making multiple pastries is getting harder for my wrist. In this recipe I love that the food processor does the work. I will try this food processor procedure again using my own favorite all-butter recipe and see how it turns out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Perfect pie crust...and easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Hilliker"
},
"reviewBody": "I used all butter and no shortening. Otherwise it's a great basic crust recipe. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marjorie Bransfield"
},
"reviewBody": "The pie crust was falling apart even after chilling, but dillagence with forming a ball and rolling paid off. I suggest that when putting the dough in the shell that leaving a little extra at the top because it does shrink a little when cooking. However a little work pays off with an amazing crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Muterspaugh"
},
"reviewBody": "This was really easy to make in the food processor and tasted delicious. I didn't freeze the shortening or butter, but if I have time next time I\"ll give it a shot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ollianna786"
},
"reviewBody": "Turned out wonderfully even thought I initially thought I had added too much water. So much easier and faster than doing it with a pastry cutter! I will definitely be using this recipe again. Note: This recipe is for a single crust pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seeker"
},
"reviewBody": "Thank-you Charlotte. This recipe is the perfect balance of flavor and flakiness. If you are having any problems with making it, it's not the recipe. Crusts are often notorious for being touchy. So many variables can affect it, but once you've mastered it- it's all down hill. Everything is written here that you need to know in making this successful. For rolling out: I always use two pieces of wax paper. I doubled the recipe for two crusts and still came out perfect. However, my food processor was very full. My crust search stops here. I liked the ease of using the food processor too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lekili_"
},
"reviewBody": "This is a great recipe. I was looking for a pie crust recipe, mine was lost, so I thought I would try this. I'm used to making pie crust the old fashioned way, this is so much quicker and easier. You have to be careful with the amount of water you add, a little goes a long ways. After mixing I put it in the fridge, along with the rolling pin. To roll this out, you need to sandwich it between 2 layers of waxed paper. I doubled this and it made enough to make a large deep dish pie. The pie crust was tender, flaky, and had a nice flavour. I'll never make pie crust any other way again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sanakruz"
},
"reviewBody": "Easy success! Instead of shortening,I used coconut oil,(which is solid most of the time anyway...)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sberry"
},
"reviewBody": "I can cook... I can bake... but pie crusts have been my nemesis. I'm constantly at war with my Mother-in-law over the fact that she makes perfect pie crusts and mine are more like cardboard... until now!!! Finally a pie crust that I can't screw up!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trinklemansion"
},
"reviewBody": "This is the best food processor recipe for pie dough I have found. I tore the dough transferring to pie pan, and it patched up beautifully and you could not tell when pie was baked. Very flaky with excellent flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Debra Dassler"
},
"reviewBody": "This was a mess. The food process part of the recipe worked fine but rolling out this pie dough was a disaster. I followed the recipe exactly. The dough formed a ball but crumbled and stuck and fell apart when I tried to roll it out. I also wish the directions stated that this is a ONE pie crust recipe. Sheesh. I don't understand the 5 star rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Litegal1"
},
"reviewBody": "Rating for ease of prep &amp; rollout only (as I haven't eatten the lovely thing yet). Snap to put together - dough held together well while rolling out. Will rerate once used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmainwa"
},
"reviewBody": "The BEST, and easiest!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksmyers2004"
},
"reviewBody": "Perfect crust recipe. Very easy to make and to work with and everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Passion4food"
},
"reviewBody": "Sorry, didn't like the texture of this crust &amp; it's not clearly stated that it only makes one layer of crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobby"
},
"reviewBody": "After reading all the reviews and watching videos, I was always afraid of making pastry until I found this recipe which I followed to a \"T\". The pastry turned out perfect and flaky and the family loved it for my strawberry pie. Definitely a keeper and now I look forward to all the recipes calling for pastry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D Kae Ranne"
},
"reviewBody": "Finally a successful, flaky crust! My search is over. This will be my 'go to' crust recipe. Believe me I've tried A LOT of crust recipes. I used pastry flour instead of all purpose flour, otherwise I followed the recipe as written. I always roll my crusts between plastic wrap (I sometimes lay a couple of pieces together to get the size circle I want, so none of the crust touches any surface it might possibly stick to, and do the same on the top before beginning to roll), and not use wax paper, which tends to stick to the crust for me. Take the plastic wrap off the top of the crust when finished rolling, put your pie plate on top of the crust and invert the crust into the pan. Remove the final piece of plastic wrap once crust is in the pie pan. Clean up is a breeze and you've never touched the crust. This is recipe is great for a savory pie. I will probably add a small amount of sugar to the crust when making a fruit pie. Thank you, thank you, thank you!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha"
},
"reviewBody": "I've tried a lot of pie crust recipes in my years, but this is the only one I will ever use. So easy and taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "papermate75"
},
"reviewBody": "Before trying this recipe I had given up on making a home made pie crust! I recently purchased a food processor so I decided to search for a recipe &amp; make a crust from scratch. This recipe is wonderful! Between this recipe &amp; my new food processor, I made the best, flakies pie crust I had ever made. This crust was for a quiche recipe, but I can't wait to make in again for a dessert. I will never purchase the store bought crusts again. My husband loved the crust, too. He said it melted in his mouth. I highly recomment this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marta"
},
"reviewBody": "Great recipe, I have never made pie crust before. It took me a couple tries to get the idea of pulsing to get crumbly but not too wet on the dough. After I got that figured out, I am really happy with how flaky the crust is!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Royall Clark"
},
"reviewBody": "Finally I got a flaky pie crust! Followed the recipe almost to the letter. I put the flour, salt, and cubed fats into a bowl and put it in the freezer for a couple of hours while I took care of other stuff. When it came out of the food Processor, I put into a bowl lined with plastic wrap (idea from another reviewer, thanks!) and formed it into a ball and into the fridge for about an hour. Rolled it out between two sheets of wax paper. Easiest pie crust I've worked with but you need to keep it very cold. **UPDATE** I made this pie crust again today but didn't bake it. I just put the flour, salt, and fats into a zip lock bag and put several into the freezer. This being the beginning of the \"pie\" season, all I have to do now is get the frozen ingredients out of the freezer and throw it into the food processor! Almost an \"instant\" pie crust! Just can't say enough good things about this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katydid68"
},
"reviewBody": "Like some things are priceless, this pie dough recipe is starless. There aren't enough stars to give it. It is the best dough I've ever made! It is easy to work with and does not need to be chilled. I like a lttle more salt in my dough, and I like the combination of butter and shortening. This is better than the Barefoot Contessa's, which is a little too short for me. I love the speed of using the food processor. I'm afraid to double the recipe, but I will try that soon. Thank you so much Charlotte. This will be my pie dough recipe from now on.\nKatherine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Partyof5"
},
"reviewBody": "This is great. Best pie crust I've ever had (next to store bought), and first crust I've ever made. Wonderful, thank you so much for this idea and recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this pie crust today for the first time, and it was amazing...one of the flakiest I've ever made. I skipped the food processor altogether, just to make sure I didn't overwork the dough. I also added a smidgen of sugar, since I like mine slightly sweet. I used this for a prebaked pie shell for a chocolate cream pie and the crust was the best part. I'd definitely try this one out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MNRobin"
},
"reviewBody": "Awesome! Tons of compliments on my pies with this crust. No fail recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karencooking"
},
"reviewBody": "Wow!! This recipe was really easy. I had not made pie crust in over 20 years. It turned out perfect and no mess. I put the processor bowl and blade in the fridge and all the ingredients in the freezer. I also replaced part of the water in one tablespoon for distilled vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CWA"
},
"reviewBody": "I followed this recipe to letter trying to use my food processor to make pie crust. I have never had so much trouble with pie crust in my life! I left the dough in the refrigerator for hours trying to get it firm enough to roll out, but I ended up just piecing it together in the pie plate. I even made i a second time thinking maybe more shortening and less butter would help, but it didn't. I'm giving it 3 stars because it did taste good, but I'd give it 1 for the difficulty I had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarinandMe"
},
"reviewBody": "I tried it with whole grain flour... Might not have been the best idea. It fell apart while rolling it out, and I imagine the wheat bran interfered with some necessary chemistry going on in the white flour. Very fun to make in your food processor! My 4 month old was well entertained :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamagood"
},
"reviewBody": "The crust flavor was very good but the edges of the crust kept separating while I was roling it out. Can't figure out what I was doing wrong. Made a fresh from our garden raspberry pie that was great. I'll try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingInSeattle"
},
"reviewBody": "Used 1/2 cup butter instead of shortening. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice K"
},
"reviewBody": "I have been using this recipe for years and always get compliments on my pies. I vary the proportion of butter to crisco based on what I have on hand, and it doesn't matter - the result is always excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookzathomez"
},
"reviewBody": "I use a stick of butter instead of shortening and this turns out perfectly. It's easy to work with and almost impossible to mess up! Viva la food processor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "Not my favorite pie crust by any means. Part of the problem may be that it's often difficult to teach an old dog (at least THIS old dog) new tricks - I'm much more comfortable making a pie crust by hand - after 8 gazillion pie crusts you get the \"feel\" of them. The crust seemed a little heavy on the fat, so while it did LOOK nice, it was neither as tender nor as flaky as it should have been."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LANGDEV"
},
"reviewBody": "Soooo easy and the taste was amazing! I rolled it out between waxed paper. Next time I think I should flour the waxed paper- I had a little trouble transferring it to the pie pan and it tore a bit, but nothing that wasn't fixable. I think I would get better with a little more practice. I might try adding a tiny bit more water next time to see if it would make the baked pie crust a little less crumbly, but it really didn't matter this time since I was making a single crust French Silk pie. Overall a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donnag"
},
"reviewBody": "Easy and great tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JFHVT"
},
"reviewBody": "This was an \"ok\" recipe. Easy because it is made in the food processor but I found it kind of crumbly to roll out. Also...it only makes a single crust. Wish this was specified on the recipe itself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deeta Jean"
},
"reviewBody": "Wow! This was super easy to make and a perfect basic pie crust for my chicken pot pie. I made this with butter and it still came out beautifully flaky and flavorful. I plan to add just a bit of sugar to the recipe and whip up a cherry pie tonight. A simpler and better tasting recipe won't be found!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Affinito"
},
"reviewBody": "This is it. If you are frustrated by inconsistent pie crust results, here's the recipe to use. Do make sure you freeze the \"fat\" and process as little as possible. The result is a well marbled crust that flakes up perfectly. Again, don't over process (the fat and flour should not be blended) or add too much water (stop while it still looks dry). Other than that, this is a fool proof way to make a perfect pie crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DonnaTMann"
},
"reviewBody": "This is the easiest pie crust and everyone thinks I am a pro at it. I make an old fashioned version just by adding 2 tablespoons of sugar which helps make the crust more flaky. You must give this recipe a try! I would rate this 10 stars if I could. Thanks a million!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TDYX3"
},
"reviewBody": "used all butter - used to make my 1st 2 pumpkin pies ever - thanks to the Lighter Libby Pumpkin Pie recipe here on the site - ended up freezing the butter &amp; added 5 tablespoons of cold water rather than 3 - ended up with large crumbs - poured out onto table- pressed into dough ball with my hands - back into fridge for 3 hours until I could use it - rolled out beautifully - filled with light pumpkin pie filling and baked both - baked too long due to cracks on top but taste was awesome! flaky! buttery! utterly sinful - not good for you but can't beat the taste - cooled both pies &amp; froze 1 for Christmas - other pie was gone in 2 days thanks to our 6-year-old who loves pumpkin pie &amp; me too - will try to thaw pie in fridge for a day before reheating for 10 minutes - will see how it works out &amp; report back"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "c-nels"
},
"reviewBody": "So easy - the instructions are wonderful and so helpful. This is the best pie crust I've ever been able to make at home. I rolled it out after chilling using a cloth and rolling pin cover. It was excellent and so flaky. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GATCHLEY"
},
"reviewBody": "I made this today and it's the best pie crust I've ever made. I followed the recipe exactly except I doubled it and mixed 2 crust at once in the food processor. I dumped my crumbly dough from the food processor into a large ziploc bag and then formed it into a ball, then chilled in the fridge. I divided it half rolled it out between 2 sheets of wax paper for 2 crust. Very flaky crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BETHAROO2U"
},
"reviewBody": "Didn't work for me :( I added more and more water but it never formed into a ball, I couldn't get it to roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ursalita"
},
"reviewBody": "This was a perfect recipe! I never thought I'd be able to make pie crust but I had no problem with this. I made 4 crusts (for 2 double crust pies). The first was a little wet and took awhile to roll out. The last ones were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "This is great and so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "Wow, don't know what I did wrong, but this pie crust just fell apart and was a total disaster. I finally was able to fit the bottom crust in the pie pan, then filled it with the sliced peaches, then was able to put the top crust on (with many patches). I was so focused on trying to make the pie crust work that I realized afterwards that I forgot to add the dry ingredients to the peaches (flour, sugar, cinnamon, etc. sitting in a bowl). Well, I decided to bake it anyway. It was horrible. I think I just should have stayed out of the kitchen yesterday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pburns1959"
},
"reviewBody": "This is the easiest and best recipe I have ever used for Pie crust. I have tried for years to make great crust and making this in the food processor gives the dough less handling and makes it very flaky. I use 4 T of ice water instead of 3. It is wonderful. Thank you! Paula in MO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Derham Ratliff"
},
"reviewBody": "This is a wonderful pie crust. I will never make any other. I used all butter and it was fab. Thank you for this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bowhead"
},
"reviewBody": "This was an ugly crust but absolutely delightful!! So very flakey. Yum! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DOMESTIC BETH"
},
"reviewBody": "My first time making pie crust was using this recipe. I did as another reviewer suggested and put my butter and shortening in the flour and put the whole bowl in the freezer to chill. It didn't turn out pretty, but it was freaking delicious!! I need to make this a few more times because I'm sure with practice, it'll get better! I didn't once touch the dough with my bare hands as suggested and I'm glad because I can see how it could change the dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison"
},
"reviewBody": "This is the most perfect and easy pie crust to make. I've made 5 pies so far and it works out every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Carter"
},
"reviewBody": "This was very easy and perfect. I didn't use cold shortening but I did use cold butter and ice water and it still turned out perfectly. It was very fast to make and I will definitely never buy pie crust at the store again. I used this crust for a Strawberry Rubarb pie and used a lattice cutter on the top and it was VERY yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinksmom"
},
"reviewBody": "Well I have made this pie crust just now, I needed 3 crusts so I made them and they are now ready for me when I make pies this afternoon, or tomorrow. I'll let you all know how they turn out for me! They did work up just like the directions said...Nice and crumbly, then I put in plactic wrap, patted into a disk now they are chillin:) in the fridge, and it looks to be holding together really well :) I used Chrisco and frozen butter (unsalted). I post after I used them, HAPPY BAKING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth Ann Nelson"
},
"reviewBody": "Crust tasted good, and using the food processor was magic, but I had to add several extra Tablespoons of water for it to come together well."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12360/flaky-food-processor-pie-crust/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/818/desserts/pies/pie-crusts/",
"name": "Pie Crusts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17716/desserts/pies/pie-crusts/pastry-crusts/",
"name": "Pastry Crusts"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12360/flaky-food-processor-pie-crust/",
"name": "Flaky Food Processor Pie Crust"
}
}
]
}
}
, "about": [
]
}
]