				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Flan Mexicano (Mexican Flan)"
,"datePublished": "2020-06-18T23:42:00.000-04:00"
,"dateModified": "2022-10-25T15:01:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Amy Shurts"
,"url": "https://www.allrecipes.com/cook/3947397"
}
]
,"description": "This Mexican flan recipe makes a creamy, orange-scented custard with a golden syrupy topping of caramelized sugar in this treasured family dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0RRXJLJqN1Ek4ICOkxUGNMLAEWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4485442-58b33eae8ca844589869edb287572626.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Flan Mexicano (Mexican Flan)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "185"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "434 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "207 mg"
,"fiberContent": "0 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "115 mg"
,"sugarContent": "54 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup white sugar",
"1 (14 ounce) can sweetened condensed milk",
"1 cup whole milk",
"3 large eggs",
"3 large egg yolks",
"0.25 cup freshly squeezed orange juice",
"1 tablespoon grated orange peel",
"1 tablespoon vanilla extract",
"1 tablespoon cornstarch",
"1 cup heavy cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place sugar into a heavy saucepan over medium-high heat. Cook, stirring constantly, until sugar melts and turns a golden amber color, about 10 minutes. Watch carefully once syrup begins to change color because it burns quickly. Carefully pour caramel syrup into a flan mold. Set aside to cool."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Place an oven rack in the middle position."
} ,{
"@type": "HowToStep"
,"text": "Place sweetened condensed milk, whole milk, eggs, egg yolks, orange juice, orange peel, vanilla, and cornstarch into a blender; blend until smooth, about 1 minute. Pour in cream and pulse several times to incorporate. Pour mixture over cooled caramel syrup in the flan mold."
} ,{
"@type": "HowToStep"
,"text": "Line a roasting pan with a damp kitchen towel. Place the filled flan mold carefully on the towel in the roasting pan, then place the roasting pan on the oven rack. Fill the roasting pan with enough boiling water to reach halfway up the sides of the flan mold."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the center of flan is set but still slightly jiggles when nudged, 45 minutes to 1 hour. Let cool, then refrigerate for at least 4 hours."
} ,{
"@type": "HowToStep"
,"text": "To serve, run a sharp paring knife around the inside of the mold to release flan. Place a serving plate on the mold, then flip the mold over. Gently lift the mold to release flan and allow caramel syrup to cascade over custard. Remove the mold."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT365M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making this recipe for years... it's the best! Anyone who has ever tasted it, loved it. (I omit the orange)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gracie Garman"
},
"reviewBody": "This flan is amazing! I had a lot of fun making it, the texture was just what I was hoping for! this is a really good recipe and i'll use it again In the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reveenaskitchen"
},
"reviewBody": "I listening to the comments and adapted this recipe slightly, using a full can of evaporated milk in place of the whole milk &amp; orange juice, omitted the cornstarch, and adding a swig of orange blossom water, and finally, cooked it for around 1.5 hours since it was no where near ready after 40 mins, and holy schmoly, it was insanely delicious. My Mexican boyfriend said it was the best flan he's ever had. Cannot reccomend this recipe enough, I'll definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "czmrhqx8j6"
},
"reviewBody": "Perfect! Thanks for the recipe! Made as is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dservais64"
},
"reviewBody": "Amazing and easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crvail"
},
"reviewBody": "I have made this many times now for friends and family and it never fails to receive rave reviews! Excellent just as it is written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn Wesolosky"
},
"reviewBody": "Delicious Flan because of the orange zest.\nIn the future I will make in muffin tins to have serval even sizes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Shannon"
},
"reviewBody": "This recipe is perfect. My husband is a huge fan of Mexican Flan and said this was the best he has ever eaten, bar none. I did make my own condensed milk using Kerry \nGold butter (which has a high fat content). I'm not sure that made any difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phoebe Elmgrove"
},
"reviewBody": "Every time is a success! I didn’t change a thing and I have been doing this recipe for years! Thank you for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StephyLee"
},
"reviewBody": "I loved the idea of adding orange to this recipe. I made the recipe as it was written and found it was good, the consistency was perfect, but you really need to like the orange flavor to enjoy it. My review was based on the original recipe.\nI did make it a second time using just the zest and NOT the OJ (added more milk instead) and it had the perfect balance. Creamy, vanilla with a hint of orange that had people guessing what my \"secret ingredient\" was. My family liked both, but preferred the flan with just the zest.\nGreat recipe, thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tagsea"
},
"reviewBody": "Didn’t have oranges so made without. Almost a crepe brûlée texture. Very rich, much more than most flan I’m used too. A delicious surprise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Twiggs"
},
"reviewBody": "I loved it. The texture and taste was delicious. My only complaint is the caramel hardened and wouldn't come out of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrbrown76 "
},
"reviewBody": "This recipe is wonderful! The first time i made it , i made it twice. Both turned out awesome!\nSince this was such a hit, i started thinking about other flavors.\nThe next flan i made i followed this recipe, but replaced the orange flavors with coconut and lime!\nI was nervous, because this would be my 3rd flan. I decided to get coconut milk and coconut extract. Used a half can of coconut milk and mixed with half a can of the sweetened condensed milk. I added a half teaspoon of coconut extract.\nJuiced a lime and zested it.\nThis turned out so good! This recipe is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Currier"
},
"reviewBody": "I made this as dessert for a chili dinner for 8. I used ramekins for individual servings. I made it a day in advance and covered each ramekin in plastic wrap. The recipe is the perfect size for the 8 servings. (Must use a knife to loosen the flan.) Perhaps I cooked the sugar too long. Even though I took the flans out of the fridge about 2 hours before serving, some of the caramel was solid, yet I had enough liquid caramel in each ramekin to sweeten the dessert. I served it with three raspberries and a sprig of mint at the base for color. A thin slice of clementine would be attractive, too. Perhaps even a whole or sliced kumquat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "This was my very first time making flan and I loved it! I’m one that always messes up recipes and whatever I’m making almost always comes out as a flop but I followed this recipe to the tee and it came out fine! Maybe I screwed something up though because the center came out a little pudding like but I left it in the oven for 56 minutes and made sure the center was set before I took out? I also didn’t really enjoy the orange taste. I was going to make it without the orange juice and zest but decided to follow the recipe completely since it was my first time but I decided to use this recipe without the orange next time. Overall, as a Mexican and Flan lover, I really enjoyed eating this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XileXica"
},
"reviewBody": "I have eaten a lot of flan in my life having lived in Chile and Colombia, but I must say this flan was the best I’ve ever had. The orange was so fragrantly delicious. It was a wonderful surprise! I recommend everyone to make the recipe as written before deciding to make any changes. You won’t be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Rappazzo"
},
"reviewBody": "This tasted amazing! I omitted the orange peel only because I didn't actually have any oranges on hand, and for the baking it took 1 hour 20 minutes for some reason (after an hour it was still super jiggly all over). Other than that, followed the recipe as written and my whole family thoroughly enjoyed it. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMOFTWOBOYS"
},
"reviewBody": "I've always wanted to make flan, but thought it would be too hard. The hardest part was the sugar and it wasn't bad. I left out the orange juice and zest. I did everything else just like the recipe. It was delicious. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Zeh"
},
"reviewBody": "The orange was a great addition! Mine took longer to cook than directions. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Matt"
},
"reviewBody": "Mine turned out as an unset pudding with a rock hard disk on top. I would advise attempting an easier flan recipe before trying this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jl"
},
"reviewBody": "I loved this recipe; however, my husband who is from Central Mexico did not care for the orange flavor. I continue to make this one while my husband makes his recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANADAMABAKER"
},
"reviewBody": "so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzannah Brennan Shadle"
},
"reviewBody": "My husband has been wanting to try flan from different places to see which one he liked best. I made this one from Mexico. A Spanish flan and a Cuban flan. I didn’t make any adjustments to any of them. This recipe was the lightest with the hint of citrus. It was also the sweetest of the three. All three were taste tested by my husband, me, and my in-laws. This one was the least favorite. But that was due to the sweetness. None of us like super sweet foods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Parker"
},
"reviewBody": "A few tips for those new to flan and custurd.\n\nCarmalized sugar is suppose to harden quickly as it cools, so you must pour it into the flan dish as soon as the desired color is reached. It needs to be light brown to amber in color, then immediately removed from the heat because it can quickly go from amber to burnt (30sec-1min). Don't even try to use the carmel if it looks black because it will be bitter and ruin your dessert. The caramelized sugar liquifies again once left for a long period of time in the fridge. If you find that there is \"leftover\" or wasted sugar in the flan dish, it is because you choose to eat the flan sooner rather then later. If you leave the flan in the fridge for 24-48 hours, all the caramelized sugar will liquify and there will be none wasted. To clean up caramelized sugar or black burnt sugar in your pans fill pan with water to cover all the burnt sugar and boil until sugar dissolves! \n\nIf your flan has bubbles, hardened egg pieces, or fluffy in texture like scrambled eggs, I hate to tell you this but you OVERCOOKED your flan. It should be silky smooth like a creme brulee, but usually slightly firmer. The flan got too hot. Either it cooked too long in the oven or the bain Marie (water bath) was too shallow and the custard got too hot while baking. Custard must be cooked very slowly with even heat. A water bath is the best way to accomplish this. Someone mentioned making this without a water bath, which I highly doubt can be accomplished, unless the"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miyuki"
},
"reviewBody": "My husband wanted Mexican Flan in place of a birthday cake this year so I made this for him. It was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Medina"
},
"reviewBody": "I followed this recipe exactly, using freshly squeezed orange juice that I squeezed myself. The flan itself had wonderful flavors and an oh so creamy consistency but I would have loved it if the orange notes were a little more prominent. Maybe my oranges weren't sweet enough? Will have to try again! I wonder what the flan would taste like with store bought OJ such as Tropicana?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "This is fantastic! I did not have orange juice so I just used vanilla as the author indicated was the original recipe. Yum! I'm not sure it can get any better but next time, I will make sure to plan ahead and use the orange juice to see how it adds to the flavor. The texture is great and it slices so nicely. I used a Bundt pan since that was all I had. The only problem I had was getting the caramel out of the bottom of the pan once I flipped it over. Though some liquified and covered the top of the Flan, some stayed as a hard candy inside the pan. Had to set the bottom of pan in boiling water to melt the caramel in order to get it out. I'm not sure what I did wrong there but regardless, the Flan is superb!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Gale"
},
"reviewBody": "made it exactly as given. lovely"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "One of the best flans I’ve had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Soooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Bailey Mullen"
},
"reviewBody": "Skipped the blender and used stick blender. Used hottest tap water, not boiling. Used 8 individual ramekins. This is a fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Lou"
},
"reviewBody": "This is the easiest and most elegant recipe ever! I have become somewhat of an expert on this recipe, as this is the only desert my husband ever requests. He would eat it every day if I would make it that often. Although the recipe as written is perfect, I have tried a few things to make it easier and to add variety. \nTIPS: 1. If you use Turbinado Sugar, available at Walmart, you will not have any problems with your caramel sauce. This is the kind of sugar they use in Mexico, and it has a much better caramel flavor and melts easily. It will be ready almost as soon as it is melted. (Don't cook it for 10 minutes!) 2. You will get a better orange flavor if you use Valencia orange juice/peel. 3. Try new flavors, such as almond flavoring and toasted almond slices, coconut flavoring and toasted coconut flakes (NOT the shredded/sweetened stuff), etc. in place of the orange. Everything I have tried so far has been wonderful. 4. Use 6 whole eggs for simplicity, and if you make sure to put them in the blender and whip them before you add the other ingredients, you will not have to worry about pieces of egg and your flan will turn out light and fluffy. \n 5. Use one can of evaporated milk in place of the milk &amp; cream and omit the corn starch. This makes it easy to keep the ingredients on hand and not have to worry about buying cream. 6. Again for ease, I cook it in a 9x12 glass dish that has a lid and leave it in the dish for storage and I just flip each piece individually as I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shines"
},
"reviewBody": "I'm not a particular fan of Flan, but decided it would be a perfect desert for a brunch we were having. I tried another Flan recipe and it was okay, nothing special. Then I came across this one and made a \"trial\" one. My husband and I loved it so we made it for our brunch. I also don't like to cook, especially complicated dishes. Not only was it easy to make, everyone at our brunch loved it and wanted the recipe. Friends who don't like flan loved it! I even made another one mid week for a couple of friends and once again it didn't disappoint. Didn't change a thing in the recipe, but my husband (whose the cook of the family) and I both decided that any more orange juice or peel would've been overkill. This is a recipe will be my go-to for years to come, and will be passed down for generations!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Sharp"
},
"reviewBody": "First time ever making this. It turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nursejennyb"
},
"reviewBody": "Made it with the evaporated milk suggestion. It was delicious and so easy. The hint of orange was lovely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shantel Plant Kent"
},
"reviewBody": "Amazing a true to recipe \nCreamy and velvety my family thi is I'm a genius now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Meyer"
},
"reviewBody": "I had never eaten or attempted to make Flan before this recipe! My Flan loving husband requested Flan for Fathers Day. I followed this exactly and it turned out fantastic! (according to him,and I had to agree! )The Orange added wonderful flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha Bielman"
},
"reviewBody": "the recipe is great but don't stir the sugar. it won't turn into caramel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brookexox"
},
"reviewBody": "Delicious! Almond milk substituted for the milk no problem. \nOnly problem was that quite a bit of the caramel stuck to the glass pan so will need to troubleshoot that one next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson's Mommy"
},
"reviewBody": "Delicious! I made this flan for my son's school dinner function and it received excellent reviews! I followed the recipe almost verbatim -- I did not include the orange zest and I used two 8-inch cake pans to make two flans. I juiced a freshly picked orange from our tree, and used 1/4 cup as the recipe indicated. The orange flavor was perceptible, but did not overwhelm the custard. I will definitely make this again for future parties as it's very easy to make, it's delicious, and it presents very well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carm"
},
"reviewBody": "Not the best recipe. The foil was not a good idea. \nTasted good, but looked awful...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maysha7"
},
"reviewBody": "Really turned out great! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Bailey"
},
"reviewBody": "Made it the first time in a pie pan. Loved it so much, I bought a flan pan! Making it again tonight for Cinco de Mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laci Kuzenski"
},
"reviewBody": "It took me two tries to make this recipe work. The second time it was perfect! the consistency was perfect, and the vanilla flavor was glorious. Subbing milk for the orange juice, and eliminating the zest worked to make it a vanilla flan. \nPlease learn from my noob mistakes. 1) I assumed this would make 12 cupcake-sized ramekins. It really makes about twice that size. The result of my error was way too much sugar in the bottom, but that wasn't the end of the world. They were yummy hard candies that mostly stuck to the bottom. 2) I ruined a flour sack towel and messed up the water bath. Don't make my mistake. Don't drape the towel over the sides. If you do, it will draw out the water and the custard will bake unevenly. it might also upset your rammikins. In fact, make sure the towel is completely submerged in the water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pouran Moeini"
},
"reviewBody": "I like the orange zest addition . everybody loved it. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnne Taylor"
},
"reviewBody": "This was a great recipe. The only thing I changed, was I swapped out all the dairy for a can of coconut milk &amp; it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georg ann Robinson"
},
"reviewBody": "I have made this dish four times. It has such great flavor and everyone loves it. When you go to most food gatherings you will usually see cake, pies and cookies. This dish really stands out and always has great reviews.\nIt is my “go to” when I want to make a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodTina"
},
"reviewBody": "I made this for Christmas and it was delightful! Everyone loved it. I've never made it before so I followed the recipe without changes and it came out great! Even in a 9\" round cake pan. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dltr"
},
"reviewBody": "super easy, made it in an oval dish and placed it on a platter when serving. The hint of orange was very nice. Took it to a party and loved by all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mermadi"
},
"reviewBody": "I made this today for my custard-loving friend suffering from dental pain. She declared it the best flan ever. I omitted the orange because she's not adventurous. The texture was creamy and silky, luxurious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jmlarsen1"
},
"reviewBody": "I don't know what went wrong, but this turned out badly. Maybe the three stars are for me. I followed the directions, but made a few changes based on other reviews, plus one of my own. I substituted Grand Marnier for OJ. I left off the corn starch as per one reviewer. Other than that, I made it exactly as directed. The worst problem was that when I served it, most of the caramelized sugar pretty much remained a solid on the baking dish. I guess I will go back to prior flan recipes which always worked out for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine"
},
"reviewBody": "I made this for my husband's birthday. I normally do not like flan. This was the best! I used baker's sugar, omitted the orange since he doesn't care for that, and just used evaporated milk instead of cream and milk. I did not add corn starch. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelley"
},
"reviewBody": "I don't do much in the kitchen, so I enjoy trying recipes from this site when I do need to come up with something for a potluck or party. I followed this recipe exactly. It was soooo good and really easy. Even someone at the party who doesn't typically like flan because of the texture - he really liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ConkyJoe"
},
"reviewBody": "The orange enhancements and smooth texture made this flan better than any other ones I've had over the years. While following the recipe with near perfect results, next time I plan to make three tweaks: (i) use superfine caster baking sugar and add 2 tablespoons water when making the caramel, (ii) minimize agitating the custard batter to lessen air bubbles and strain through a sieve to remove any egg chalazae or air bubbles should they exist, and (iii) use a hot tap water bath (not boiling water bath). As other reviewers have commented, the most challenging step is making the caramel as it can quickly burn, or seize if over stirred. An alternative technique is to place a lid on the sugar mixture pot for the first minute, then remove the lid (do not stir). For the next 5-8 minutes, continue cooking the sugar mixture by swirling the pot very gently every 30 seconds, until the mixture is a golden amber color. Make this at least one day ahead, and the orange flavor continues to blossom through day 2 (if it lasts that long). Amy's mother-in-law's recipe rocks, and Amy adding orange zest makes for a gourmet dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Salomon"
},
"reviewBody": "Beautiful! I wish I took a photo but it was all gone in less than a minute! I made this for a party and everyone LOVED it! The texture is smooth and creamy. I did leave out the orange ingredients because I enjoy the vanilla. Overall it was wonderful and I will be using this recipe a lot more in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eliza6111"
},
"reviewBody": "Definitely new family favorite!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess Marinda"
},
"reviewBody": "Perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moises Campos"
},
"reviewBody": "Love it the only receipt I use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaili Galati"
},
"reviewBody": "SO GOOD! I cooked it in a 9 inch cake round (1.5 inches deep) with tin foil over top cuz I don't own a flan mold haha :D I used evaporated milk instead of whole milk, 1/2 the corn starch, and didn't add any of the orange stuff. I also used Baker's sugar instead of regular just because it's finer and a bit easier to melt but I'm sure regular sugar would have worked fine. I didn't feel like it was firmed up enough after an hour so I cooked it for 20 more minutes just in case and it came out perfect. :) My friends and family can't stop talking about it! Thank you so much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiff"
},
"reviewBody": "I just took mine out the oven and .....OMG!....once i read the recipe i ran to the kitchen only to realize I didnt have heavy cream...but no...i continue with sour cream (a tablespoon..yes i know) then added a 1/4 of cinnamon...it came out just right...the only thing that was missing at that point was Friends....lol their on the way...and had to refrain my four year old"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lon Hause"
},
"reviewBody": "I will definitely make again. The only change I made is that I used evaporated milk in place of milk and orange juice. I still used the orange zest. Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coco Tanaka"
},
"reviewBody": "Excellent Recipe. I omitted the orange juice and peel, substituted whole milk with evaporated milk, and added half a can of coconut milk. With all the ingredients, I also added about 1/4 cup of heavy whipping cream. This is an excellent recipe! Always my go-to for dessert/potluck! Quick, easy, and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "I don't have a flan pan, but this worked great in an 8\" cake pan coated with cooking spray. Would not add the orange zest next time, maybe even less juice, as I personally prefer more vanilla flavor. Would also decrease the amount of sugar syrup. Not all of it liquified and there was a lot stuck in the bottom of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrianne Lefkowitz"
},
"reviewBody": "I made this for Christmas dessert 2016 for 7 extremely discerning foodies, including inlaws and parents of inlaws who intimidate me whenever it comes to contributing ANY THING when it comes to meals. Well, it was a huge success! And not that difficult to make. But fair warning, the melted sugar is VERY hot during the melting process. I didn't get to take photos but it came out of the ramekins looking restaurant quality. i was shocked at my the results. Everyone raved and I was redeemed! Epilogue: candied sugar cleans up with hot water soaking or running through the dishwasher"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carine"
},
"reviewBody": "excellent! this time I skipped the orange zest for a more subtle orange taste. It is delicious with the zest but a bit too different for my kids. So easy to make this recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanVey"
},
"reviewBody": "This won first place at our Havana Nights service auction dessert contest. And let me tell you, there were some mean bakers there! No one knew who baked what, and they voted with their dollars. When I saw the cup holding the dollar bills next to the flan was overflowing, I knew I had a winner. I followed this recipe exactly! The addition of the orange made all the difference. And I sprung for a proper flan pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asianfreckles"
},
"reviewBody": "I have tried this recipe and another I found on allrecipes, and this one is so much creamier and richer tasting. This will definitely be my go to recipe. I didn't change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "I made this recipe without the orange juice or zest as I wanted something more traditional. Also, I only used 3/4 cup of sugar vs the 1 cup it called for. One thing I wanted to note for first timers like myself, keep the pan/dish warm so that when you pour the melted sugar/caramel into the pan... it won't harden quickly. I struggled with the caramel part! I used all of my sugar the first time only to mess up completely by making rock candy. Second time was fine, but once I poured it into the pan, it hardened and didn't spread evenly. A few parts were very thick... so after pouring the custard, cooking it and flipping it over (only let sit in fridge for 2 hours and it seemed fine!) I didn't have the pretty and even caramel distribution. Some parts were still undissolved.\n\nOne final note, I cooked it at 350 for 45 minutes and then lowered the heat to 325 for the remaining 15 since it still seemed a bit jiggly to me. \n\nIt tastes delicious and is so dense!!!!! I would say 3/4 of the can of sweetened condensed milk would be fine, too. Maybe even 1/2 of the can! However, my husband said it was perfect as it was! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meesh"
},
"reviewBody": "This recipe was excellent! The texture, and flavor was fabulous! For personal preference, I did leave out the orange juice, and zest. And I substituted evaporated milk for the whole milk and corn starch, because that is what I had on hand. The directions were very well done, and easy to follow. Next time I might use a little less sugar for the caramel, as it did not completely liquify during baking. I took a big chance having never made this recipe, and made four batches. They were served at a fiesta baby shower the next day, and everyone love it! This will be my flan recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lpierson"
},
"reviewBody": "Made this for my card group. Everyone raved about it and asked for the recipe. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica Flores"
},
"reviewBody": "I have made this about 5 times already. Everyone loves it! The only thing I can't get correctly is the cooking time. I have to leave it in the oven for almost 2 hours for it to cook thoroughly and I had to throw the first one out using the cooking time listed. I had left the first one in the fridge overnight and it did not set. Any tips would help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sdlady"
},
"reviewBody": "Thanks to those who suggested melting the sugar in the oven. In a ceramic souffle dish measuring about 7\" at the bottom I melted 3/4 cup C&amp;H Mexican sugar (azucar de caña, which has pale blonde large crystals) at 360 degrees (yes, 360) until liquified, about 40 minutes. I wanted a lighter flan, so I used a full 12-oz. can of 2% evaporated milk instead of whole milk, fat-free condensed milk, and, instead of heavy cream, 1/2 cup of half &amp; half. I did use the cornstarch, and I cut back the orange zest to 2 tsp. Baking time was about 45 minutes with refrigeration overnight. The resulting flan was silky, decadent and got rave reviews. I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Henriette Khoury"
},
"reviewBody": "This was a great recipe. Easy to do &amp; tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsCarnelian"
},
"reviewBody": "Previously reviewed and indicated that it filled 8 6oz custard cups, should have written 10 6 oz custard cups. Stir melting sugar with a flat edged wooden spatula. Use vanilla extract, not vanilla paste, because the bean bits sink to the bottom of the flan and kind of look like mold. Wish I knew how to edit previous reviews I've written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Iannuzzi"
},
"reviewBody": "Very good, was my first time making flan and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Benton"
},
"reviewBody": "Delicious! And so easy to make!! Love the addition of the orange flavour - it made the flan so fresh tasting. Will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darylfromjax"
},
"reviewBody": "Best recipe for flan I have tried. I like the mild orange taste. Big hit with company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Guynup"
},
"reviewBody": "Wow. This recipe is the BEST! I used light cream instead of heavy cream; and it still came out perfect. I loved the orange zest. I do not own a special pan to make flan. I used a metal pie pan. Some of the sugar topping stuck to the pan, but overall it was beautiful as well as tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alice Btoklas"
},
"reviewBody": "The flan was phenomenal but most of the carmelized sugar stayed in the ramekins, close to rock hard. Kind of a waste??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sergio"
},
"reviewBody": "I skipped the orange and used chilled cajeta (also known as \"dulce de leche\") instead of caramel. It turned out really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "After a recent trip to California, I came home slightly flan and horchata addicted. My kitchen became the testing grounds for the best recipes to curb the urge, and this flan recipe....boy did it hit the spot. I have made it both with and without the zest, and this addict (and her loyal crew) all preferred it without. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SpycGyrl"
},
"reviewBody": "We love Flan and no more box mixes for this family:) Made it without orange juice (used 1/4 milk in its place)and no zest since we like vanilla. Used one reviewers suggestion to caramelize sugar by placing the flan pan with sugar in a 350 degree oven for 30-35 minutes. Using regular white sugar, I added enough to cover the bottom of the pan, about 1/3 cup. It worked wonderfully! Thank you for sharing an authentic recipe!Update: I make this weekly for others and now use 5 whole eggs (co$t!) I also use an 8 inch pan for the flan inside of a 10 inch round pan to hold water. Works perfectly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvie Chisholm"
},
"reviewBody": "beautiful with super fine sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Zinser"
},
"reviewBody": "I have made this flan several times. I omit the orange juice because I prefer a vanilla flan without a citrus flavor. However, no matter how many times I make this recipe, my caramel ends up more like candy glass than caramel. I have tried tips offered by other reviewers and have even watched YouTube videos that demonstrate how to do this, and I've used thermometers , to no avail. I am starting to think my stove is bewitched! My kids don't mind, though. They lift the \"glass\" off their flan and eat it like a hard candy. I'm giving this five stars because it is easy to make and it's rich, creamy, and decadent, like I expect flan to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Captain"
},
"reviewBody": "awesome. simple &amp; a crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lumpyloo"
},
"reviewBody": "This was really tasty and easy. The orange flavor was lovely. When I cooked this, I must've overdone the caramel sauce, as the layer on the very bottom of the pan hardened (and then cracked when I poured in the custard filling!). But there was still sauce left, and it was very good. When taking out of the dish it seemed \"chunky\" and had cracked in one place, but was silky smooth once you ate it. I sliced into squares with thread to make serving easy at a potluck. I did this in a glass deep dish pie and had a bit left over - enough for two small ramekins worth; the ramekins overcooked and puffed up (then dropped) like a souffle... which still tasted good, but had a weird texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruno Sanchez"
},
"reviewBody": "You're having trouble with carnelizing because the sugar from mexico is not refined white sugar its a brownish sugar (not brown sugar) just brownish (azucar moreno) this sugar melts and caramelizes quite easily. Some supermarkets in the US are selling this type of sugar now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EP"
},
"reviewBody": "VERY good. Not exactly the same texture as traditional flan due to the addition of pumpkin. It's to be expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocaholic19"
},
"reviewBody": "Note: I used 2% milk and half and half cream and it still turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC Daddio"
},
"reviewBody": "I've made this at least a dozen times now, and regularly get requests to bring it for get-togethers. This is by far the best best best flan recipe I have ever tried! It's better than my Puerto Rican mother-in-law's sssssshhhhhh. Depending on the pan, I've had to adjust the cook time between 45 minutes to an hour and fifteen minutes. Amazon flanera pans work marvelously for this one. Remember to always rely on the toothpick test; If the toothpick comes out wet from the center, just pop it back in the oven for another 15 minutes and check again...Although one episode of (undercooked) flan pudding went over incredibly well too. You cannot go wrong with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC Daddio"
},
"reviewBody": "I've made this at least a dozen times now, and regularly get requests to bring it for get-togethers. This is by far the best best best flan recipe I have ever tried! It's better than my Puerto Rican mother-in-law's sssssshhhhhh. Depending on the pan, I've had to adjust the cook time between 45 minutes to an hour and fifteen minutes. Amazon flanera pans work marvelously for this one. Remember to always rely on the toothpick test; If the toothpick comes out wet from the center, just pop it back in the oven for another 15 minutes and check again...Although one episode of (undercooked) flan pudding went over incredibly well too. You cannot go wrong with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Great recipe! Changes were evaporated milk instead of whole milk, omitted orange products &amp; substituted 1/4 c of Bailey's coffee creamer, omitted cornstarch and added 1/4 tsp of coconut flavoring. Used a deep cake pan and it worked fine. This is a versatile recipe--I didn't have the orange products on hand, so I improvised. Family loved it. Will try it at some point with the orange."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Lamonica"
},
"reviewBody": "Great recipe. I agree with others that a bit of water in the sugar helps it melt easier. The second time I made it I substituted lemon juice and grated lemon peel. Liked the lemon version better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "We enjoyed this today for Cinco de Mayo! I chose to leave out the orange juice and orange zest and make it plain this time. It was very good and the next time I may add the orange additions and use a bit of whipped cream and chocolate sauce like the restaurants do. This was my first time making one of my favorite desserts! A word of warning...use a wooden spoon to stir the melted sugar. I didn't think it through and used one of my favorite hard plastic cooking spoons and melted 1/2 of it in the process. I had to remake the caramel sauce before finishing the recipe! Lesson learned. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kerry"
},
"reviewBody": "Way too dense and sweet for our family, will try a different recipe next time. We like a light custard so this would be fine for those that like a heavier style."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "I am a first timer to making Flan. I did no use the orange juice or orange peel, It turned out wonderful. My husband loved it and he has tried the best Miami has to offer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Captain Sunny Fox"
},
"reviewBody": "This is almost the exact recipe that I've had from years ago in my favorite Mexican cookbook. I love the fact that it uses cream and condensed milk---it's really rich. Next to my recipe, it's one of THE best flans I've ever eaten. REALLY rich!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dynnel"
},
"reviewBody": "This recipe was amazing. The second time I made it I used heavy cream as I was out of milk and it was even better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joannebl"
},
"reviewBody": "Made this for New Years Eve. It was delish and so easy to make. It's just as good as any Flan I've had in a restaurant. I made it without the orange juice or orange peel, used 2% milk and used 3/4 cup of sugar-which was more than enough. Family recipes are the best! Thanks so much for sharing this one."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214091/flan-mexicano-mexican-flan/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214091/flan-mexicano-mexican-flan/",
"name": "Flan Mexicano (Mexican Flan)"
}
}
]
}
}
, "about": [
]
}
]