				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Florida Key Lime Pie"
,"datePublished": "1999-04-10T16:41:09.000-04:00"
,"dateModified": "2022-07-14T16:18:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Marion McWhorter"
,"url": "https://www.allrecipes.com/cook/24326311"
}
]
,"description": "To make this heavenly key lime pie, combine lots of lime juice and lime zest with fluffy whipped cream cheese and condensed milk. Then spoon this slightly tart filling into a graham cracker crust, top with lots of sweetened whipped cream and chill."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AU7ggbQL0tQ9uO2Hjobsmp2vKcw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2450740-0786763c87a34c6295a1787e4c7050d0.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Florida Key Lime Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "122"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "921 kcal"
,"carbohydrateContent": "108 g"
,"cholesterolContent": "120 mg"
,"fiberContent": "1 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "24 g"
,"sodiumContent": "561 mg"
,"sugarContent": "96 g"
,"fatContent": "43 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 (9 inch) prepared graham cracker crust",
"2 (8 ounce) packages cream cheese, softened",
"2 (14 ounce) cans low-fat sweetened condensed milk",
"0.75 cup key lime juice",
"1 teaspoon grated lime zest",
"0.25 teaspoon salt",
"1 cup heavy cream, chilled",
"1 teaspoon vanilla extract",
"3 tablespoons confectioners' sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To Make Lime Filling: In a large mixing bowl, whip cream cheese until fluffy. Add condensed milk, lime juice, lime rind, and salt. Whip until mixture is smooth. Pour into graham cracker crust. Cover with plastic wrap and chill thoroughly."
} ,{
"@type": "HowToStep"
,"text": "To Make Topping: In a medium bowl, whip cream until soft peaks form. Add vanilla or lemon extract and confectioners&#39; sugar. Continue to whip until cream forms stiff peaks. Place topping in a fine-mesh sieve and place sieve over a bowl to catch liquid that drains off. Cover topping tightly with plastic wrap and allow to drain for 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Before serving, discard liquid that has drained from topping. Spread topping over pie."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Anne"
},
"reviewBody": "Wonderful flavor! I ended up boosting Madagascar Vanilla to a Tablespoon in the lime pie batter and it made the lime flavor pop. Also used shortbread for a crust as I like it better than graham cracker. Would make this gem again anytime!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KB in the cold soggy PNW"
},
"reviewBody": "Made this last night for Super Bowl, perfect accompaniment to my Mexican themed football party food! Instead of a pie I made individual parfaits and instead of graham cracker crust I crushed up some Trader Joe's mini biscotti in the bottom of each glass then topped w/ the custard and garnished with lots of lime zest, a mint sprig, a raspberry and a biscotti. They did not need the whip cream in my opinion nor did my guests who all raved about the parfaits! Recipe could not have been any easier and it'll be in my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanda Boyland"
},
"reviewBody": "I like it. I used cool whip instead of whipping cream. I got 2 pies from it. If using cool whip, used the small one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie Lawton Kraft-Johnson"
},
"reviewBody": "I did not have any sweetened condensed milk to I used evap milk and sugar. It turned out a little thin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly"
},
"reviewBody": "This came out great for me. My son’s favorite dessert is key lime so I decided to give it a whirl. It was the first homemade key lime pie I’ve made and I’m very pleased. It’s tart enough and the homemade topping is just sweet enough to balance it. I might use cool whip next time as many others suggest to save time. Overall great recipe and my son said it was better tasting than anything we’d bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "This pie is way better than the original Key lime in Key West my family loves it . I miss all the ingredients in my mixer and then put in graham cracker crust and let sit in fridge for a couple of days add cool whip and it’s delicious. Thank you for sharing the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jayne"
},
"reviewBody": "There is enough filling for 2 pies!!! What a waste since I only had one crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "Having been a Key Lime Pie addict for over twenty years I can honestly say that this is the recipe that comes closest to the pies I've had in South Florida. Not too sweet but not too tart either. I made it as published and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ele Hoper"
},
"reviewBody": "Classic, delicious no-bake recipe. As is, I'd put a full cup of key lime juice to meet my sweet/tart taste preference. Note that this recipe makes a large pie, for a family of four, we usually cut the filling in half - 1 cream cheese, 1 sweetened condensed milk with 1/2 cup key lime juice. Definitely make your own crust if you have the time (it's easy)! Enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kat Atomik"
},
"reviewBody": "A revision to my previous review, As I was never able to get this pie to come together with the ingredients&amp; steps as written through 2 spermatozoon attempts. Although the thinner pie did seem to set up a little better, it was still a soft mess inside even while ice cold. I don’t know, to this day, why other folks had a cheesecake like consistency- which I achieved with my second batch after I added 3lg. egg yolks to half of the filling batter&amp; baked at 325 till small bubbles began to break at the top. I wish I could try a piece from the keys- I’ve created a recipe that I imagine eats more like a custard pie or a lighter softer cheesecake based on this recipe and several others that I have been experimenting with for more than 15 yrs, I love key lime pie THAT much, and do just like my obsession with lemon squares- I have been researching all this time&amp; I finally, after realizing there is nothing EXACTLY right, at least not for me- have a perfect recipe to submit. So I do thank the author of this submission for that. She’s made me reset my focus and now I have something beautiful to offer. So TY, if anyone happens to understand the science behind why my attempts wouldn’t solidify, please message me- as I am very curious- and if it happens to be my fault somehow I will alter my rating accordingly. Peace love&amp; KILLER KEY LIME!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christian"
},
"reviewBody": "I did a few things different. I won’t waste your time explaining why, but it came out great this way. I used a casserole dish and made a crust out of 1 box of crushed vanilla wafers, 1/2 cup butter, 1 tsp sea salt, and 1/2 cup brown sugar (no-bake). I used only 1 can of sweetened condensed milk and I added 3/4 cup of heavy whipping cream to the filling. I used an electric mixer to whip/thicken it up. I did not make the topping but instead topped it with thin slices of lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hugs & Kisses XOXOXOX"
},
"reviewBody": "I used unsweetened coconut in the crust. I kept all the other components the same as the recipie. This was very refreshing and with the heat I didn't have to turn on the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GPMADISON"
},
"reviewBody": "Perfect recipe. I use prepared graham cracker crust but I cover bottom with chopped pecans , brush with melted butter and bake @ 400degrees for8-10 min"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dabirdfeeder"
},
"reviewBody": "I have made this several times now and this key lime pie is the best! Living in Florida- this is a popular dessert and it is served at many restaurants. This recipe is fabulous and tastes just like the pie served in the expensive restaurants in the area. I used 1 cup of lime juice instead of 3/4 and I used the graham cracker crust that is the thicker one. That's it. This is super simple and great tasting. People are very impressed when you serve this pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "I loved this! Made it for my husbands birthday while my parents where in (from Florida!) it was a bit to soft, I ended up serving it in bowls! Bit everyone still loved it! I made two so I'm hoping today the one is a bit more set. I'm thinking maybe I beat it to long? Not sure. First time making a pie. I usually make key lime cheesecakes in mini mason jars. Might needs to stay with that if I can't conquer this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLW"
},
"reviewBody": "DELICIOUS, EASY and enjoyed by all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "This was the best key lime pie we have ever tasted! Excellent!!! Squeezed about 30 key limes - 2 packages -- made a little more than 3/4 cup of juice -- used entire amount -- there was a lot left after filling the pie crust so put remainder in little dessert cups with a fresh raspberry on top -- refrigerated about 3 hours or more to set -- will make this over and over!! NOTE--- make sure cream cheese is very soft or else won't mix well!!! Leave on counter for at least two hours or more -- Also -- sift slowly the confection sugar for topping or else will clump -- and make sure the cream is very cold -- A+"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbara"
},
"reviewBody": "I have finally taken the time to rate this recipe after making it many many times. This is a favorite of our family and friends, many have asked for the recipe. I took this to someone recently and he loved it. When I told him the next time I see him I would bring his favorite pie, he said \"I have a new favorite pie\". It's this key lime pie recipe. Didn't change a thing. (However, I use Nellie and Joe's Key West Lime Juice in the bottle found at most supermarkets)\nI am an older woman who has baked hundreds of pies during my lifetime. This won't disappoint you!! (don't forget the lime zest! It puts it over the top) (usually, zest of one lime)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Clemens"
},
"reviewBody": "Something seems wrong with this recipe. The filling is super-runny even after two hours in the fridge. There is nothing in the filling that would make it firm enough to scoop with a spoon. What am I missing?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Laliberte"
},
"reviewBody": "Best key lime pie recipe. So easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csquared"
},
"reviewBody": "I made this recipe pretty much as is, except for adding a little (and I mean not much more than a tablespoon) of extra juice and about 1/4 tsp zest to the topping. The only thing that the recipe doesn't make clear is that if you make the recipe as is you will have enough filling for two pies. Not that this was bad, but if you only have one crust, you might want to cut the recipe in half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Young"
},
"reviewBody": "I didn't have enough cream cheese so I halved the recipe. I added a bit too much key lime juice so it turned out more pudding consistency. I'm hoping it sets up in the fridge tonight, but we couldn't wait. It tastes lovely! Nice and tart. I will definitely try it again with all the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Johnson"
},
"reviewBody": "I suggest reducing sweetened condensed milk to one can, it's too sweet otherwise. For simplicity, I use whipped topping. I also use fresh squeezed key limes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Piedad Villasenor"
},
"reviewBody": "We made it as suggested and it was very yummy! I may add more limes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "Perfectly yummy! And quite easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daunoir"
},
"reviewBody": "Wonderfully Delicious!!! Great recipe! Especially if you add your \nown personal touches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edna Trawick"
},
"reviewBody": "I have made this pie Three times now and think it is absolutely the best Key Lime Pie that I have ever had. Gave a slice to a neighbor and she commented that it look more like something you would buy at a Bakery. I assured her that I had made the pie at home. I do have a Key (Mexican) lime tree in my back yard and we had a bumper crop this year. I added the full 3/4 cup lime juice and since I have a very good zester I added 1 Tablespoon of lime zest. Great Pie thickens well and is an absolute dream to make, with the exception of juicing the limes because of the seed content of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Pehrson"
},
"reviewBody": "Very sweet but incredibly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "SO good and so much easier than I'd ever thought Key Lime Pie would be to make. My only (small!) complaint was that there was more filling than my pie crust could hold. Not that I'm above eating the filling on its own out of a bowl! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I only used one can of sweetened concensed milk and it was perfect. Very light and delicious. Makes enough filling for two store bought graham cracker pie crusts. Next time I may put it in a 9 x 13 pan. Nice dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSippigrl"
},
"reviewBody": "This was my first time to make Key Lime Pie and with slight modification, it was dee-licious! In an attempt to make it a bit healthier without sacrificing the taste, I found that only ONE package of RF cream cheese, ONE can of FF sweetened condensed milk, and 1/2 cup of juice was plenty to fill a RF graham cracker crust. I then topped it with Lite Cool Whip. It's a keeper. :))"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Donna Mae Baukat"
},
"reviewBody": "This did not work for me. Possibly the second can of condensed cream should never have been added. My grandsons were so disappointed because it did not set in the refrigerator after two plus hours. I'm looking for another Key Lime Pie recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Potter"
},
"reviewBody": "Fantastic Pie ! I have to think that anyone who gave it a bad rating used poor or improper ingredients. This is an amazingly rich dessert with good lime flavor. This will go down in the family for sure !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "This is really yummy! I love that it is no bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Stillwell"
},
"reviewBody": "I loved the idea of this cheesecake pie being like the lemon cheesecake ones from the 80s, but lime. I was refreshing and delicious. Everyone loved it at our Father's Day BBQ. We love fresh whip cream with vanilla bean paste so I made it thick and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooksalot"
},
"reviewBody": "I really liked this recipe and will use it again. The only things I changed were to use Kool Whip instead of the heavy cream, etc. and regular limes. The 3/4 cup key lime juice was about 6 limes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindyah"
},
"reviewBody": "Excellent and super easy! Have made this pie several times....have used homemade shortbread crust (the best), but also have used storebought graham cracker crusts - including individual portions. Due to time, have always skipped the topping and used whipped cream instead. Always a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindy Tran"
},
"reviewBody": "Easy and really good. I cut the recipe in half for 1 pie, left out the zest and used cool whip because I was lazy to make it fresh :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Captain K"
},
"reviewBody": "A great recipe that is also easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "OMG This reciepe Is AWESOME!!! I wouldnt change a thing!!!!! Reminds me of the Keys where my husband and I had our first key lime pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I can't say enough about this pie! It was unbelievable and really easy too. I didn't have the ingredients to make the topping, but had a container of french vanilla cool whip in my fridge and it was an excellent alternative. I will be making this pie for every occasion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Island Haole"
},
"reviewBody": "My daughter wanted key lime pie for her birthday after having it at a restaurant. I ended up selecting this recipe but added more zest and more juice. It was really yummy and rich BUT in the future I would whip cream and fold it into the filling mixture and then put the works into a pie shell. It would retain the richness but have a lighter texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanna Be a Cook!!"
},
"reviewBody": "LOVE! LOVE! LOVE! MY SISTER AND I MAKE THIS EVERY HOLIDAY AND IT IS ALWAYS LOVED, AND WE HAVE A BIG FAMILY WITH BIG OPINIONS! WE FOLLOW THE RECIPE TO THE \"T\" ! THE HOMEADE WHIP TOPPING IS AMAZING!!! BEST KEY LIME PIE RECIPE HANDS DOWN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaye Foster"
},
"reviewBody": "UNBELIEVABLY SPECTACULAR! about 20 years ago I had my first piece of key lime pie at the Breakers hotel in west palm beach FLA. I have looked for years for a recipe that comes close to its excellence and tried more than 100 different recipes with no luck. Until now. This is by far the most magnificent key lime pie on the planet. My tast buds are doing the happy dance!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shilah Stover"
},
"reviewBody": "I personally am not one for tart disserts, but I have to say this no-bake Key Lime pie was AMAZING!! I made this for a friend's birthday and both he and my husband said it was better than anything found in a restaurant that they have had. I did not make the topping that is included in this recipe however as it sounded too easy to mess up. Instead I made a Sturdy Whipped Cream Frosting submitted by Jo-Lynn. When I made the alt topping to top the Key Lime Pie I also squeezed 2 key limes (about 1 tsp) into the frosting and it was simply amazing! Yes this pie may seem like and taste like a cross between a pie and cheese cake, but that was part of the attraction to try it was the extra creamy texture allure! You will not regret making this if you like Key Lime pie!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbie"
},
"reviewBody": "This key lime pie was fantastic! Would not change a thing on the recipe, will enjoy again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I must be missing something because this didn't taste like key lime at all! First, I could barely taste the lime at all. Second, the filling is enough for 2 pies not just 1. Either I missed something or my taste buds just wanted a tangier version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam2"
},
"reviewBody": "Love it!!! I add some extra lime juice - I love it extra tart. Tastes even better after chilling for a couple of days! I also use the Keebler mini graham cracker crusts to make it quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krissyp"
},
"reviewBody": "Very similar to the key lime pie I had at Hooters Key West (my favorite pie). I originally added an entire packet of gelatin but did not like texture. The second time I added about a quarter packet of gelatin and the result was perfect. I also added a margarita glaze to the plate when serving, ofcourse piled high with whipped cream and a fresh lime. Excellent super easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "This was a fabulous pie. I cut the filling in half since I only had 1 pkg of Neufchatel cheese. I didn't grate the lime zest (too dangerous for the knuckles) and didn't let the whipped cream sit and drain off any resulting liquid. I used heavy whipping cream and topped the pie directly. In my hurry, I forgot to let the crust cool thoroughly and it was still very very warm when I put the filling in (which I didn't discover until I went to put this in the fridge) but I went ahead and popped it in to the refrigerator (after all the damage was already done) and it turned out fine. My family loved this pie. This had the right balance between tart and sweet. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "Very good. I made my own graham cracker crust and didn't bother with the topping. Perfect tartness though it is a bit rich. Small servings are best with this dessert. Next time, if I have the ingredients, I'll make the topping to go with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul C Belau"
},
"reviewBody": "I've traveled to the Keys many times just to have Key lime pie. Had a recipe many years ago from a dear friend of mine that lived in Key West. This recipe was the bomb, It was better than I have ever had.Wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "healthydarkchocolate"
},
"reviewBody": "It was good, but I was looking for more of a New York cheesecake texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pattie B"
},
"reviewBody": "My family went nuts for this saying this was the best Key Lime Pie they ever ate. I used Fat Free products for everything I could find and they could not tell the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LeAnn"
},
"reviewBody": "Well this recipe created the foundation for what I found to be the best key lime pie recipe. I also thought the orignal recipe didn't set up well (but we did love it) and I thought the topping was missing something..\n\nI tweaked this just a bit and added one packet of unflavorerd gelatin to the lime juice and let it sit for a few mins (maybe 10) stuck it in the microwave for just a bit and added that last during the mixing phase.\n\nI also changed the topping which I must say was much better (we thought) we omitted the vanilla altogether and whipped about half a cup of heavy cream until we got peaks added the powdered sugar and then I added half cup of SOUR CREAM and spread this over about 30 mins after pie was chilled.. Pie was perfectly set after 2 hours.\n\nThis second pie was DIVINE it was a little less tart than some but my offical recipe for Key lime pie now thanks.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chin-Chin"
},
"reviewBody": "I've yet to meet a person who doesn't like this recipe. I've been making it for like ever now, and it's always something that is looked forward to. And when it's done... man, you'd never see a more depressed house then ours, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "This recipe is awesome! My entire family absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Morris"
},
"reviewBody": "As per other comments on this making enough for two pies, I halved the recipe and it was the perfect amt for one pre-made 9\" graham cracker crust. I loved the smooth creamy texture of the pie and it seemed to taste even better a day or two after I made it. It didn't set as thick as I had hoped it would, but I will definitely make it again! My usual recipe calls for eggs and a meringue top which I really like, but this recipe definitely gives it a run for its money!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandibear"
},
"reviewBody": "My hubby is from florida and keylime pie is his favorite so i tried this recipes HE LOOOVED IT! I have made it quite a bit and evryone loves it. I did make a few minor changes we like it more tart so instead of just the keylimes (which i squeezed fresh mysself!) i added more lime zest and made it a little pulpy and added about 1/2 of reg lime juice. All and all this recipe was great! THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer W"
},
"reviewBody": "The only reason I give this three stars instead of five is not because of the flavor, but because of the recipe. I always end up with enough filling and topping for two pies. Also, I don't know what all the straining for the topping is about- I've never had any liquid come out of the whipping, whether I put it in a sieve or not. I really like the flavor, but I agree with whomever else said this is more like a key lime cheesecake- the filling is very creamy and cream cheesy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Elizabeth"
},
"reviewBody": "I love Key Lime Pie and I was looking for an easy no bake recipe and this is it!!! Although the filling seems to be enough for two pies. I increased the juice to 1 full cup and used 2 tsp. of zest. For the topping I mixed frozen whipped topping (8 ounces) with 1 brick of cream cheese, 1/4 cup white sugar (was out of powdered sugar), and 1 tsp. lime zest. This also made enough for two pies. So, after pouring the filling into the crust and spreading the topping on, just pop it in the freezer for a couple of hours to firm up. Delicious; make sure you cut small pieces because this is definitely fattening. Oh well still good if not good-for-you!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ange Rayner"
},
"reviewBody": "This was really delicous - made as directed. I should have added a little more lime juice as it was more creamy than lime. Made with Graham Cracker Crust I from this site which i think made the pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANDREALEE"
},
"reviewBody": "LOVE IT!! So yummy. I used nellies &amp; Joe's key lime juice. I added alittle creamy cool whip to the mix, which I also topped it with. I thought the mix might need a little thickening. I used a extra large size graham cracker crust, it really fillled it high. The Next time I halfed the recipe, use a normal size shortbread crust and it was just as good and filled it perfect. So easy and yummy. The lime zest really adds to the pie. I didn't have a zester so I peeled some and chopped it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Wow!!! Great pie! Of course I used almost a cup of regular lime juice!! I will add more zest next time. Rich and creamy. I might even used a few ounces less of milk....hmmm good thought... I like a very strong lime flavor...also added 1/2 tsp of zest to whip topping! Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy W."
},
"reviewBody": "excellent but the calories!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annekj"
},
"reviewBody": "On our last vacation to Florida, my husband and I tried Key Lime Pie at almost every restaurant we went to. I made this last night as a special treat. While it wasn't as good as our favorite in Florida, it was still great. I used fat free sweetened condensed milk. I, also, used bottled key lime juice, so I did not have any zest. I did not make the topping. I used whipped topping as others have done. This was so simple to make. Next time, I may try low fat or fat free cream cheese and make my own graham cracker crust. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medic's Wife"
},
"reviewBody": "The BEST! My boyfriend LOVED it! It was great frozen too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessmatt99"
},
"reviewBody": "I can't believe I made something that tastes this amazing! I am a key lime pie aficianado, and this way the best I've ever had. And not too sweet! Very tart and delicious. I'm not sure what others are finding too sweet- it was PERFECT and I can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHASSIS"
},
"reviewBody": "I made this for my husband as he loves key lime pie. It was fairly easy except it took a while to juice the limes - that's the reason for the 4 stars. I had to use regular limes as key limes are not easy to find in my area. It turned out very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AQUARIUS"
},
"reviewBody": "My husband calls me sugar-addict but even for me this pie was too sweet! I like Key Lime pie and usually I have it at restaurants but I'd never tried to make it by myself. This was the first time for me to make Key Lime pie so I was looking for a recipe which seemed very good. I tried this recipe because this has cream cheese which I like. I found a recipe which has sour cream, or doesn't have either. I still don't know which one is the genuine Key Lime pie recipe... But at least I knew every recipe has condensed milk which probably makes the pie very sweet. I wonder what happens if I use half condensed milk and half evaporated milk. Anyways, overall the taste was not very bad but it was just too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Being a native Floridian, this really is the best I've had in a very, very long time. The only change I made was that I added a topping made from mixing cream cheese, cool whip and a little sugar. I spread this on after I let the pie chill overnight, just before serving. It was awesome. Reminded me of a key lime pie I had in Cedar Key once. Very good recipe...thanks for it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelly"
},
"reviewBody": "i thought this was excellent. i followed the recipe almost exactly - i only added extra lime juice and zest because i LOVE the tartness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mwcook93"
},
"reviewBody": "This alleged \"dessert\" is quite possibly the most dissapointing thing to come from my kitchen. The consistancy was that of old milk and it tasted of rancid potatoe salad with a bit of a lime zing. Long story short, it was bad.... REALLY BAD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne Burns"
},
"reviewBody": "I like this pie... I also like soy sauce... But let me warn you, the two don't go well together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate Verhulst"
},
"reviewBody": "this is so good, a tiny bit too sweet, still loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JanHomeCookin"
},
"reviewBody": "This was really good; smooth, creamy and tart. It came out quite soft, never set up very firm. HOWEVER, next time (like tomorrow!) I think I'll make graham cracker crust crumbs, put them in custard cups and bake about 5 minutes. That way, we'll have individual desserts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved it!! I made this for my family and they were so impressed. i took a pampered chef decorator gun and put whipped cream peaks all over the top and it looked awesome...thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was very disappointed in this recipe. It seems like something is missing as it does not set well...very poor consistency. I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Went over great! :-)))))"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have just added Key Lime Pie to my recipes-my very favorites! This one is a WOW!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe, every one loved it and was so easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CB-W"
},
"reviewBody": "I made this for the office treat day for St Paddy's Day '03 &amp; everyone loved it. I increased the lime juice to one cup. I love it because of no baking &amp; it's an eggless recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easier than it seem. I would suggest you use whip cream for topping though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Half say too tart, half say just fine. I discovered that hand squeezing made a mild key lime pie/cheesecake, whereas an electric jucier made the pie more tart. I suspect more oils are extracted with the juicer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aubry Canales"
},
"reviewBody": "I was lazy and out of time, so I did not do the topping like she suggested, but instead just served it with cool whip. It was a huge hit at TWO parties!! Thanks! I have to add to this again....I STILL make this pie and it STILL disappears anywhere I take it. So easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOROTHYFIELDMAN"
},
"reviewBody": "This was a great pie! The only thing I changed was I made a chocolate crust instead of the graham cracker crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Pretty good. More like a key lime cheescake. I don't understand why people think it was too tart--I added more lime juice and zest than the recipe called for! The wipped topping beats any you'll ever find in the store. I made a homemade graham cracker crust, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "\"Awesome\", wonderful, excellant...but don't check your weight watcher's calorie counter !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy Renea"
},
"reviewBody": "My 12 year old nephew ask me to make this for him and he loved it. The 9 in crust I bought was not big enough, so with the extra filling we made Key Lime frozen cookies with regular graham crackers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GLOBARN"
},
"reviewBody": "This is a wonderful recipe. Easy to make and tastes sooo good, just like Marion McWhorter said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHURMAY"
},
"reviewBody": "Using reduced fat graham cracker crust, low fat sweetened condensed milk and low fat whipped topping, this was a delicious AND healthy dessert. Key lime pie is one of my husband's favorites, and he loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrooklynKim"
},
"reviewBody": "I made this recipe to satisfy one of my pregnancy cravings. It more then did the job!!! It was easy to make and very delicious. I followed another reviewers suggestion and decreased the lime juice to 1/4 cup to make it less tart. My whole family enjoyed this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christiane Potts"
},
"reviewBody": "Since moving south I've fallen in love with key lime pie and have been searching for and making recipes for this delight ever since. This has to be the best tasting one I've come across thus far. It help too that it's so easy to make. Wish there were more than 5 stars to give."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We have been looking for a key lime pie with bite. Well this is it. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ukienomad"
},
"reviewBody": "Very good - would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This pie was wonderful! I found it a bit tart for my taste so I simply put in less key lime juice and it came out perfect. The topping was also a big hit though I doubled the recipe for a thicker layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been looking for a Key Lim Pie recipe that\r\ndid not have eggs for a quite a while. I thought this\r\nwas perfect. The tartness was just right and the texture \r\nwas perfect. I used cool whip for topping and it turned out\r\ngreat. I got many compliments on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Darby “SilverSprite2004” Kenne"
},
"reviewBody": "Way too tart, very heavy. Would not make this pie again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "a tasty treat with just enough zip to twang the tastebuds. easily prepared. definitely a \"keeper!\" a bit to tangy for children, however."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15049/florida-key-lime-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
"name": "Custard and Cream Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2409/desserts/pies/custard-and-cream-pies/key-lime-pie/",
"name": "Key Lime Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15049/florida-key-lime-pie/",
"name": "Florida Key Lime Pie"
}
}
]
}
}
, "about": [
]
}
]