				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Flourless Chocolate Cake"
,"datePublished": "1999-02-03T21:40:43.000-05:00"
,"dateModified": "2023-01-11T12:06:02.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Maggie"
,"url": "https://www.allrecipes.com/cook/Maggie"
}
]
,"description": "This rich flourless chocolate cake is easy to make for a fudgy, decadent, gluten-free dessert that&#39;s perfect for any special occasion."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uKGllGXqH5zUg9qaOQfSzjdYhv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/668993-flourless-chocolate-cake-i-Dianne-1x1-1-82e35d707aef47659e3bb09fd1c847f9.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1822996897001",
"description": "This dense chocolate cake is perfect for those who avoid flour or gluten.",
"duration": "PT2M57S",
"name": "Flourless Chocolate Cake I",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/c3a5bcde-48ad-4018-af69-976f8de9acca/b7e19a8a-bb7c-42b5-9dc1-944ef5bcc7c3/1280x720/match/image.jpg",
"uploadDate": "2021-07-02T22:11:24.271-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Flourless Chocolate Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1053"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "341 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "102 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "66 mg"
,"sugarContent": "24 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.75 cup white sugar",
"0.5 cup water",
"0.25 teaspoon salt",
"18 (1 ounce) squares bittersweet chocolate",
"1 cup unsalted butter",
"6 eggs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 300 degrees F (150 degrees C). Grease a 10-inch round cake pan; set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine sugar, water, and salt in a small saucepan over medium heat. Stir until completely dissolved; set aside."
} ,{
"@type": "HowToStep"
,"text": "Melt bittersweet chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each interval, 1 to 3 minutes. Pour chocolate into the bowl of an electric mixer."
} ,{
"@type": "HowToStep"
,"text": "Cut butter into pieces; beat butter, one piece at a time, into chocolate until combined. Beat in hot sugar water. Slowly beat in eggs, one at a time."
} ,{
"@type": "HowToStep"
,"text": "Pour batter into the prepared cake pan. Have a pan larger than the cake pan ready; put the cake pan in the larger pan and fill the larger pan with boiling water halfway up the sides of the cake pan."
} ,{
"@type": "HowToStep"
,"text": "Bake cake in the water bath in the preheated oven for 45 minutes. The center will still look wet. Place cake in the refrigerator until thoroughly chilled, 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uKGllGXqH5zUg9qaOQfSzjdYhv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/668993-flourless-chocolate-cake-i-Dianne-1x1-1-82e35d707aef47659e3bb09fd1c847f9.jpg"
}
]
,"text": "To unmold, dip the bottom of the cake pan in hot water for 10 seconds and invert onto a serving plate."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT550M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakertologist"
},
"reviewBody": "I made only one change and that was to use Allulose for the sweetener. All else was as written. I used a 9.5\" springform pan wrapped under with two layers of foil. It came out fantastic! The texture was smooth, creamy and super rich. I covered the cake with a chocolate ganache and then with fresh raspberries. It was a hit and our dinner guests oohed and ahhed over it. Then they made it disappear!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This cake has smooth creamy texture. It’s like a firm ganache. Truffle chocolate lovers will adore it. I did modify it I omitted the water added a teaspoon of vanilla and used the preparation method of flourless chocolate cake ll. The method is simplified with everything is mixed over a double boiler. ( I used a bowl over a pot of simmering water). Before adding the eggs, I tempered the eggs. I have received lots of compliments and recipe requests"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My cake also had the separated fat layer at the bottom that someone else mentioned. Not sure what I did wrong. I followed the recipe exactly. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Harris"
},
"reviewBody": "Fantastic, the best I ever tried! Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it- my favorite- I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Clark"
},
"reviewBody": "Very easy to make and very elegant looking. Lots of compliments on taste as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Nothing tastes like chocolate but 18 oz is pretty pricy for a 10 inch cake. I will stick with flourless chocolate cake 11 . Delicious with 4 oz."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "random5811"
},
"reviewBody": "This was amazing!! Fudgy, delectable texture and taste! We made this for our gluten-free friend's party. She thought it was great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "We baked it for 20-30 minutes longer than the recipe showed. It had perfect texture &amp; taste. Melt in your mouth nearly a chocolate cheesecake, without the cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BASHERGIRL"
},
"reviewBody": "This recipe was amazing! I am gluten free and wanted something to take to holiday parties. Followed the recipe as written, changed some of the prep, but all turned out well! Rather than a cake on, I used 16 single serve ramekins and topped with whipped cream. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Tuggy"
},
"reviewBody": "A-maz-ing. I am not gluten free, but this just sounded too good not to try. I made it first thing in the morning for a 7pm dessert, and it really wasn't long enough to firmly set (especially with the fridge door opening and closing all day). So would recommend keeping instruction to make the day before. It is very rich so serves many. We enjoyed it for leftovers the next few days. I made a mango puree to put on top, which was heavenly together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy Liver"
},
"reviewBody": "I made this as written and it’s absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nzaccagnino1"
},
"reviewBody": "It was okay. It was less of a cake and more of a fudge consistency. It wasn't what I anticipated so I was a little disappointed but the cake shaped fudge It made was tastey and simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "klaushouse748"
},
"reviewBody": "This was a disaster. I checked, rechecked, and checked again to make sure I made it correctly. I'm not a novice baker at all, but this was one soupy mess. I baked it for 55 minutes because at 45 it was still liquidy. At 55 minutes, it was very gently firmed to the touch...or so I thought, until I let it set, cool, and cut. It was like a lava cake that ran a flow of chocolate out of the center. I literally POURED it back into a baking dish to bake again. I have no idea what I did wrong. I did the hot water bath with hot water, baked at 300 as instructed. At best, it was chocolate pudding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maddi3on"
},
"reviewBody": "Amazing recipe, tastes exactly like one I used to have as a child so brought back a lot of happy memories. This is now a regular cake in my household that my dad won't stop talking about!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Conlisk"
},
"reviewBody": "Made it as described and many compliments. Only came out 1/2” high using a 10” spring form pan with parchment paper on the bottom and sides. Plan to make it in a 7-8” spring form pan next time and will probably need to adjust cooking time accordingly though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I have made this 4 times. I follow the recipe and it always turns out great. Everyone always raves about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Powers"
},
"reviewBody": "D.E.L.I.C.I.O.U.S!!! This was so fun, for my Husbands birthday, everyone loved it especially him! We all gobbled it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big Fry"
},
"reviewBody": "Wonderful results. Did use espresso instead of water like one reviewer mentioned. Slice into small pieces as it is so rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Myers"
},
"reviewBody": "I made it for Valentine's Day and followed the recipe exactly. It turned out unbelievably good! So chocolatey and moist. I will make it for all my friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Medlin"
},
"reviewBody": "Followed the recipe and it came out perfect. Dusted with how did sugar . I soaked raspberries in Chambord and added a few of those to each slice with a Chambord drizzle, then just a little dollop of whipped cream. Absolutely amazing and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amalie HINSON"
},
"reviewBody": "I followed the recipe, using Ghirardelli bittersweet chocolate chips. The only issue with the making the cake was that it would not finish baking. I added minutes 2 or 3 at a time and could not get it to bake through. Eventually I raised the oven temp to 350 and was able to finish baking. It did not burn. Honestly, I did not care for the cake myself. I would recommend using semi-sweet chips for a better balance of sugar to chocolate. I took it to work and people there thought it was good. I will be making the flourless chocolate cake II. I have made it before and liked it better, and it's much less expensive to make. I guess it's a matter of taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "K. A."
},
"reviewBody": "This is the most awful cake of any kind that I have ever eaten. It was overly eggy and by the next day after even worse and totally inedible. Won't repeat this!!! It was a waste of Ghirardelli chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanknee"
},
"reviewBody": "This is my first review! This cake came out absolutely perfect. It got rave reviews! I followed everything to the letter and did not change a thing. I had to use a hand mixer as I don’t own a stand-up and it was still perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Roades"
},
"reviewBody": "This is a really good recipe! I only added half the butter it called for (because I didn't have anymore) , and it still turned out great. It passed the taste testing of my gluten-free family members! Definitely very rich though. Don't cut your pieces too big. This can easily serve 10-12 people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis To"
},
"reviewBody": "OH my gosh, what a decadent dessert! I have never made this before, but was looking to try a new recipe! I ended up using 18 oz of semi-sweet chocolate chips since that was all I had. It was very easy to make and literally melts in your mouth! Amazing recipe!!! I highly recommend!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "haf"
},
"reviewBody": "This is an update. I've tried the chocolate dessert made by Chef Jassi Bindra at Punjab Grill in DC. He, I think put a layer of pistachios and chocolate nibs under a flourless chocolate cake infused with cardamom. I tried this. It's in the refrigerator cooling so we'll have to wait a day to see how it turns out. Will serve with Ina Garten's raspberry sauce, fresh Raspberries and a sprig of mint (if I can find it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "Make sure eggs are room temperature and add 1 tsp. vanilla after eggs. I used a springform pan and wrapped it in a double layer of foil to prevent water from leaking into pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Since dark chocolate comes in 3.5 ounce bars, I have made this twice with 17.5 ounces of chocolate rather than 18 ounces and it turns out great. I also haven't done the water bath either time. It's a hit in our house, but I can't say if it would be better with the water bath."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amylynns18"
},
"reviewBody": "So good!! And gluten free!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melsey62"
},
"reviewBody": "Excellent recipe. I used mostly unsweetened chocolate by accident. I did manage to add some bittersweet chocolate and semi sweet. This is definitely a chocolate purist cake. I recommend the water bath. I think it helped with the texture and overall quality . It pairs well with coffee. In fact I added a pinch of espresso just for a flavor enhancement."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Frances C"
},
"reviewBody": "I made this resipe and the instructions were not clear- I had halfed the resipe and so I thought 9 squares was = to 1/2 an ounce instead it was 9 sqares that were each 1 ounce. My cake had choolate on the top and this jello stuff on the bottem that looked like worms- GROSS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen S."
},
"reviewBody": "Delicious! Very rich, a little goes a long ways! I had some fresh strawberries and whip cream on hand, as well as vanilla ice cream - both helped cut the rich chocolate. I can imagine it would pair well with raspberry sauce. I sprinkled some powdered sugar on top for an extra touch, but its not needed. I can't tolerate much wheat so its great to have a dessert I can enjoy along with my entire family. I substituted Splenda and Egg Substitute and it came out fine. I used a 10 oz bag of Bittersweet baking chunks, and 8 oz of Dark Chocolate baking chunks. I used a 9 inch round cake pan sprayed with cooking spray. I didn't have a pan big enough to set it in the water bath, so I put the water on the shelf below in the oven. Be sure the butter is room temperature, and eggs are not too cold or the chocolate will seize up, also making sure the sugar water is hot when you add it would help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mw"
},
"reviewBody": "I used large eggs so cut back to 5 rather than 6. Otherwise followed the recipe exactly. A great flourless chocolate cake that I will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karmalysa"
},
"reviewBody": "Seriously. If you need chocolate in your life, you need this recipe. I make chocolate ganache to top it and everyone LOVES it! I’ve made a few variations with this recipe now ... i zested an orange and put some in the cake and in the ganache, same with fresh peppermint for the mint lovers in the house. This is our new favorite dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christi pari"
},
"reviewBody": "made with strong coffee instead of water, added 3 min to baking time, make sure butter is room temp. beat eggs before adding them one at a time. baked in a springform covered in foil, in a shallow dish with water in the bottom. chilled overnight and served with whipped cream. most delicious thing i have ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene A Berry Woods"
},
"reviewBody": "Made a mini one. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LIESLPANKE"
},
"reviewBody": "Lovely, elegant, silky smooth mouthfeel, deeply chocolatey. I've tried a few alterations over the years, ie espresso instead of water, separating the eggs, but that yielded an entirely different dessert which I wasn't as crazy about. So I have come back around to leaving everything the same except for adding a half a teaspoon real vanilla. Be careful not to over bake, you don't want to lose that luscious creamy mouthfeel.\n\n I serve this with raspberries and a Frangelico whip cream. I like that it's called \"Flourless\" Chocolate Torte, as opposed to Gluten Free....three thumbs up. Oh, wait..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chossid"
},
"reviewBody": "Used coffee liqueur in place of water.\n\nI make this fairly often. Usually I will add a little bit of liqueur to it. It’s a wonderful cake except I wouldn’t really call it a cake. More like a fudge pie without the crust. It has a texture like a really nice truffle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kori"
},
"reviewBody": "Made this cake in a springform pan. Used 8 oz Ghirardelli bittersweet chocolate squares and 10 oz semisweet chips. Put pan of boiling water in the oven on the rack below the cake. Served with vanilla ice cream. The cake was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DJS52"
},
"reviewBody": "This definitely depends on your fondness for a rich dessert. I made it and it came out lovely, but to me, I felt like I was eating chocolate butter. Too much of a good thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie Walsh"
},
"reviewBody": "I added a bit of chili powder and lemon zest to add depth to the chocolate. Be sure to use high quality chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacey Adams"
},
"reviewBody": "I made this for a friend’s birthday dessert. I would definitely make it again. Very easy recipe and ingredients you typically have on hand if you bake. I used a 10 inch spring form pan and it turned out great. I was afraid it wouldn’t be ready in time ( only had 4 hours to chill)\nSo I put it in the refrigerator and then in the freezer for a while and back in the refrigerator before serving. It worked and I was pleased !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shadyfolks"
},
"reviewBody": "OH MY GOSH, this is wonderful. I read 3-4 of the most helpful reviews and watched the video. Had to use a 9\" springform, so I baked 5-10 minutes longer. \n\nFollowed the the directions exactly as written, using a hand mixer. \n\nThis recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laura"
},
"reviewBody": "Turned out delicious!! I made it almost exactly as instructed. I couldn’t find 1 ounce squares anywhere, so I bought 2 10oz bags of bittersweet chocolate chips. Having the extra 2 oz of chocolate didn’t seem to make a difference. I didn’t have a cake pan, so I used an 8x8 Pyrex baking dish instead. I also only have regular egg beaters. The only problem was, when I flipped it over, the bottom middle was still runny. I put it in the oven on low broil, and that seemed to cook it. (Since it’s square, I haven’t cut into the middle yet, so I’m not positive, but I won’t really mind a gooey mess, anyway) I poured homemade raspberry freezer jam over the top. Next time maybe I’ll try mint or espresso flavor. I wonder if substituting coffee for water would taste good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Belkin Van Assche"
},
"reviewBody": "I made this using 3 whole eggs and 3 egg whites as an other user stated. I also did not put the cake tin in a water bath. Everyone who ate it said it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahsmwilson"
},
"reviewBody": "I make this for every special occasion! Super rich and creamy. I use ghiradelli bittersweet chips, I use 2 full bags (20 oz minus a few for my kids to nibble on) because it’s easier than getting the kitchen scale out ;-) I usually sub the brewed coffee left from that morning in my carafe for the water. Make sure the chocolate is really warm and runny because it will be easier to mix the butter in if it doesn’t firm up as you are mixing. I top with lightly sweetened whipped cream. I use a springform pan. Definitely make the day ahead so you have plenty of time for it to chill. Soooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelli"
},
"reviewBody": "Made this for thanksgiving, super easy and very delicious. My mom begged me to make it again for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Baked this twice in a row. I used the dairy-free bakers chocolate for my dairy allergy people, 56% cacao. Used Crisco instead of butter and added a touch extra water. I cut out 2 of the egg yolks and whipped the whites. Did not use a water bath but baked at 275 instead. I only had a 9\" pan which seemed fine. Turned out great. Super chocolatey and smooth. To cut into pieces without crumbling I used a hot chef's knife run under hot water between each slice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Gordon"
},
"reviewBody": "Was a hit at tonight's dinner. Used 18 oz of Giradelli chocolate chips...60% bittersweet chocolate. It was done with only 5 hours in the fridge. Sprinkled some powdered sugar and decorated with a raspberries. But it is so rich that I have half left over. Can't do this too often. Next time I might half the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rrousseau"
},
"reviewBody": "So easy, quick and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elissa Scotland"
},
"reviewBody": "This is my go-to chocolate torte-like cake. I have made it at least 30 times over the last decade. Sometimes I sub coconut oil for the butter. I use one circular pan or two loaf pan. I split the mixture into two loaf pans, bake, cool, refrigerate overnight and then slice into pieces that are approx 2 inches square. I put the pieces into several ziplock bags or containers and then freeze them. \n\nThe individual portions defrost quickly or can be heated in the microwave and served with a simple vanilla ice-cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Cafaro"
},
"reviewBody": "I made it according to the recipe e veto o used half bittersweet chocolate and half semi sweet chips because that’s what I had on hand. I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitehlg"
},
"reviewBody": "I made this cake completely like the directions and the family said it like a restaurant quality version. Very rich, chocolatey, creamy and delicious. Unfortunately, I dusted it with cocoa, rather than confectioners sugar, and that was terrible without whipped topping. Dust with confectioners sugar, not cocoa. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nyxie"
},
"reviewBody": "Wouldn't change a thing. Fabulous dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Kassahn"
},
"reviewBody": "Amazing!! Added a little peppermint oil ,wow! Very rich, very small slice is enough for most. Hard to find anything to eat if you are gluten free that is this good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy LeMaster"
},
"reviewBody": "Spectacular in taste and consistency and appreciated by everyone I shared it with. It was a little difficult to turn out of the pan and to cut and serve, but it was very forgiving in being remolded when it got damaged, and no one seemed to mind how it looked once they tasted it! Served with icing sugar and raspberries. Very rich and decadent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "It was amazing! I brought it into work for a carry-in, and everyone loved it! It was super simple to make too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roshella"
},
"reviewBody": "I made this recipe precisely as written. The results were amazing. Deep, intense chocolate deliciousness. This would be excellent with a raspberry drizzle and/or whipped cream. I served it with vanilla ice cream which was also good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "Always gets rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty"
},
"reviewBody": "I've made this recipe many many times and everyone LOVES it! I usually just use half semisweet chocolate chips and half bittersweet chocolate, but I've also tried all semisweet and it's still great. This is now one of our family favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Absolutely the best chocolate cake I've ever had! Smooth, creamy and very rich chocolate flavor. I did use 1/4 cup coffee and 1/4 water (for the 1/2 cup water). Another review recommended parchment in bottom of pan. I will try it without next time - and oh yes, you can bet I'll be making this delicious cake again! - because I had trouble getting the cake to release. If no parchment, I think the cake would have come out easier after placing in hot water for a few minutes before turning out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Lamanna"
},
"reviewBody": "OMG resturant quality!! I have 3 GF peeps in my family and they loved it !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie Larson"
},
"reviewBody": "I have made this recipe several times!! It is awesome no changes needed!! I made the mistake of not paying attention to the type of chocolate I bought this time :( Ghirardelli chocolate Unsweetened is not the same as bittersweet!! One of the reviews comments were that there cake turned out buttery and grainy, that is why!! A very unfortunate expensive mistake :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lesjoh"
},
"reviewBody": "I made this EXACTLY as directed, with the exception that I used Kahlua instead of water because, why not? Also, since I serve as suggested with fresh raspberries and compote, the cake needs no fruity flavor from any liquor. Because it is so rich, I had enough for my contribution to a potluck and also for my book club. My husband (who ate more than his fair share at the potluck) begged me never to make it again as he couldn't resist it. Even my calorie-conscious sister ate the whole piece with relish. The members of the book club all wanted the recipe, as well as several people at the potluck. Pricey ingredients but way easier than slogging through cookie baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcasa"
},
"reviewBody": "A delicious cake, very rich &amp; dense. I served it with homemade whipped cream. I also did not read the directions prior to making it and did not realize it had to sit overnight. I served it 6 hours after making it and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Zoe Skaggs"
},
"reviewBody": "I made this and it didn't look good. The taste was okay, but it was grainy and lumpy. It was very watery. I am sorry for being so negative, but I wouldn't suggest it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie"
},
"reviewBody": "Simple and absolutely delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saman"
},
"reviewBody": "This was completely amazing. Best served with whipped cream and berries to balance the richness - cut small slices - a little goes a long way!!! Guests exclaimed with delight at the first bite. The second time I replaced the water with espresso - elevated to another dimension."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kreck"
},
"reviewBody": "This cake is a winner every time! I pair it with raspberries and a dusting of powdered sugar and it looks elegant. What I love is that I can/must do it ahead of time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karen h"
},
"reviewBody": "Very rich - almost fudge consistency. Great with whipped cream and berries. I made once with Swerve instead of sugar for my Keto pals - well received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "This was a hit at the holiday get together. Everyone was on a gluten free diet. Needless to say when they had a piece of this cake with the homemade raspberry sauce, they were delighted! Everyone loved this recipe. Cut small pieces, this cake is rich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbarabp"
},
"reviewBody": "Made it just as written but did add 1 tsp. vanilla...served with homemade vanilla ice cream...it was a hit...wanted something both gluten free &amp; that could be served for Passover. They loved it so much I have been asked to make it for Easter also.\nwill serve with homemade whipped cream... it is so rich that it does need something with it &amp; as was written by others, cut in small pieces... I will pre cut when taking it for the holidays, don't want it to get wasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Gomez"
},
"reviewBody": "Amazing a must try if you are trying to stay aways from flour..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Sarah"
},
"reviewBody": "I needed a cake I can bring to Passover for my mother’s birthday. This recipe is amazing! Tastes unbelievable, and it’s easy to make. Better than the gourmet bakery bought equivalent. Will make it this year and for many to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason R"
},
"reviewBody": "Very good, used semi sweet chocolate as the only bittersweet I could find was $3 for 4 ounces.\n\nTopped with a chocolate ganache"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy Hill"
},
"reviewBody": "Delicious indulgence. Used a 9” pan instead of the 10”, and it turned out insanely delicious. Served it at a dinner party last night and everyone was crazy happy. I did not use the raspberry nor the cream- just sprinkled with confectioners sugar for presentation. I will be doing this again. Thanks for the scrumptious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsDale"
},
"reviewBody": "I added a teaspoon of vanilla during the blending process, which really came through in the finished product. This is a very rich, creamy, and indulgent treat. It's by no means a \"gluten-free\" type of cake--it stands alone without any qualifiers. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody"
},
"reviewBody": "This is my new favorite dessert. I am serious about my chocolate and frequently disappointed that other desserts are not chocolately or rich enough. Well this one is THE one! I had to substitute for the bittersweet chocolate (had none) so found a suggestion online to use 2/3 as much unsweetened chocolate plus 2 tsp sugar per oz. I used all the eggs as written, but tempered them. My butter was a little melty when added. The cake was tricky to get out of my 9” round uncoated pan even with Crisco and cocoa powder applied; will use springform pan next time. We ate the cake with Cool Whip and topped with powdered sugar sprinkle and fresh raspberries. Superb. Definitely top of the line dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Nixon-Brown"
},
"reviewBody": "Rave reviews came out perfect Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joan schwartz"
},
"reviewBody": "It was like a gooey brownie....FANTASTIC. It was even better with ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline DiCarlo"
},
"reviewBody": "Oh my. This was the best ever flourless chocolate cake. HOWEVER, much credit must go to Chef Guy, the chef who posted that he substituted some of the eggs for egg whites. Genius, simply genius. It came out silky, light, decadent and fabulous. I tried another recipe yesterday.....noooooo......don't do it. This is the bomb. Thanks, Chef Guy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Maniglia Russo"
},
"reviewBody": "We loved it however, don't be fooled cuz it's flourless. If you're on WW it's 15 pts. but, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belinda"
},
"reviewBody": "Very rich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Hemmer"
},
"reviewBody": "I've made this several times now and it is always a hit! I love it! I am gluten and dairy intolerant, so I was thrilled to find a cake recipe that I could enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "madi"
},
"reviewBody": "I followed the recipe to a T, yet it turned out awful. After it was chilled and I took it out of the pan, I noticed the cake had a gelatinous texture. It tasted so heavily of eggs even though i put in the proper amount. After spending so much time on it, unfortunately had to be thrown away as it was inedible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Duffy"
},
"reviewBody": "Perfect!! I replace the water with coffee. 3 eggs with 3 egg whites. Easy and elegant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vanillatabby"
},
"reviewBody": "I have never made anything in a water bath before, and it turned out incredible! Just what I was craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Giaimo Bain"
},
"reviewBody": "I've been making this recipe for the last few years now. I cook and bake for a very large family, some of which are diabetic. I have been able to substitute Splenda, along with a mix of bittersweet and 70% cocoa bars, without any problem into this recipe to allow for everyone to have a very delicious dessert treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COLE01"
},
"reviewBody": "very good and my GF husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msb"
},
"reviewBody": "recommend watching the video"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greenlexia"
},
"reviewBody": "I did it following everything exactly and it's amazing!! Its true that the cake has a very gourmet taste while its easy to do, Loved it! \n\nI did it in round mini-cake moldes and served each on top of a layer of cream anglaise then toped everything with pistachios, mint and albahaca. It was a perfect mix!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Chris Harrison Boeh"
},
"reviewBody": "This cake is so decadent! I had a chocolate craving and decided to give this a try. The process of beating butter and eggs into chocolate was very therapeutic. I didn't have any issues with the eggs cooking because by the time I got to that part the chocolate was all cooled down. The one near-disaster i had came when i put the spring form cake pan i was using into a hot water bath. I thought it would be watertight, but it definitely wasn't! The finished product reminds me of a chocolate cheesecake. SO. DELICIOUS! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "manl;ey"
},
"reviewBody": "Followed recipe exactly. Put a pot of boiling water in the oven under it rather than placing the springform pan in the water to avoid water leaking into pan. Served with strawberries and whipped cream on the side. Made for 12 ladies, only one of whom is gluten free. Everyone raved about it. I will make it again. Came out like a rich dark chocolate cheescake. Used Ghirardelli bittersweet 60% chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Shay-Kubiak"
},
"reviewBody": "I made no changes to the recipe. Served it at a family gathering and it was proclaimed \"better than in a restaurant!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "My husband said it's the best dessert I've ever made. Followed the recipe to the letter and wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Koons"
},
"reviewBody": "Loved it! I just used any chocolate I had and used salted butter too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tabitha A."
},
"reviewBody": "The only change I made to the recipe was to use half semi-sweet and half milk chocolate baking squares/chips so that the cake would be sweeter. I followed all the steps to a T. The cake would not bake. Over an hour and a half later the cake was still pretty much raw batter. I think the baking temperature should be much higher... is the 300 degree Fahrenheit temperature a typo? This was a huge waste of my time and expensive chocolate. It was meant to be a birthday surprise for a friend who is gf. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adam Wingenbach"
},
"reviewBody": "This was my first time making any flourless cake. The taste was spectacular, but ti did not turn out for me. I'm certain that I mixed too fast for too long. Once in the oven my batter overflowed into the water in the pan and made a mess. I salvages what i could, but it never quite set, and ended up an ugly (but tasty) mess. I will be trying this again - with, perhaps, a little less enthusiasm on the mixer."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8149/flourless-chocolate-cake-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
"name": "Chocolate Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8149/flourless-chocolate-cake-i/",
"name": "Flourless Chocolate Cake"
}
}
]
}
}
, "about": [
]
}
]