				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Freeze-and-Reheat Breakfast Burritos"
,"datePublished": "2018-08-07T01:45:31.000-04:00"
,"dateModified": "2023-01-18T15:10:58.000-05:00"
,"author": [
{"@type": "Person"
,"name": "fabeveryday"
,"url": "https://www.allrecipes.com/cook/fabeveryday"
}
]
,"description": "Learn how to make breakfast burritos stuffed with crisp bacon, scrambled egg, cheese, and hash browns wrapped in foil for easy freezing and reheating."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BmnDvAZyG_N-R3jhVQxGAF_szG0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261844-freeze-and-reheat-breakfast-burritos-ddmfs-3X4-0359-8c6dd90974a545ddab2504633cd43f00.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Freeze-and-Reheat Breakfast Burritos"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "21"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "546 kcal"
,"carbohydrateContent": "55 g"
,"cholesterolContent": "217 mg"
,"fiberContent": "4 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1269 mg"
,"sugarContent": "3 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 (12 ounce) package bacon",
"10 large eggs",
"3 tablespoons milk",
"0.25 teaspoon salt",
"3 tablespoons vegetable oil",
"4 cups frozen hash brown potatoes with peppers and onion (such as Ore-Ida® Potatoes O'Brien®)",
"0.5 teaspoon garlic salt",
"0.25 teaspoon ground black pepper",
"10 sheets aluminum foil",
"10 large flour tortillas",
"1.5 cups shredded Cheddar cheese",
"1 cup salsa, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels and crumble into bits. Keep the skillet warm."
} ,{
"@type": "HowToStep"
,"text": "Whisk together eggs, milk, and salt in a bowl until combined. Pour into the hot skillet. Cook and stir over medium-high heat until eggs are scrambled and set, about 5 minutes. Transfer to a bowl."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in the same skillet over medium-high heat. Add frozen potatoes, garlic salt, and pepper. Fry until browned on the bottom, 4 to 5 minutes. Flip and cook until other side is browned, 4 to 5 minutes more. Let cool."
} ,{
"@type": "HowToStep"
,"text": "Lay 10 sheets of aluminum foil, slightly larger than tortillas, on a flat work surface. Lay 1 tortilla on each aluminum foil piece; evenly distribute Cheddar cheese on top. Add scrambled eggs, bacon bits, salsa, and potatoes to each tortilla, in that order. Tightly roll burritos, tucking tops and bottoms in first."
} ,{
"@type": "HowToStep"
,"text": "Wrap aluminum foil tightly around each burrito, covering it completely. Place in resealable plastic bags in a single layer. Remove as much air as possible from the bags before sealing. Store in the freezer until ready to reheat."
} ,{
"@type": "HowToStep"
,"text": "Reheat by removing the aluminum foil, placing burrito on a microwave-safe plate, and covering it with a paper towel. Heat in the microwave until evenly warmed through, 1 to 2 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Palmer-Sipe"
},
"reviewBody": "This was a delight, premade, I knew what was in it, and cheaper than \"just add an egg \"I usually have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a half recipe to see if we liked it. We backpack and carry a freeze dried breakfast skillet so looking for something similar. Couldn’t find hash browns with onions and peppers so sautéed some before I cooked the potatoes. Didn’t overcook the eggs since someone said recipe was dry. Used sausage. Both of us liked this and I plan to make more and freeze dry them. We can either eat in a burrito or without on the trail. Good find."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane Tarpey"
},
"reviewBody": "I made these for my grown son's breakfasts since he leaves for work very early. He states they are good. I thought they were dry. I would do them again for convenience but I can't rave about them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia "
},
"reviewBody": "My husband loves these. They are easy to make and store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancyw680"
},
"reviewBody": "These burritos are fantastic! The first time I made them, I followed the recipe exactly. The second time, I used ground sausage instead of bacon. Both ways are delicious. This is a keeper in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "han"
},
"reviewBody": "bf really liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Hanlon"
},
"reviewBody": "I made these for a fishing trip..they are really tasty and perfect to put in the microwave before heading out on the water. We microwaved them for about 2-3 minutes, wrapped them back in tin foil and into a baggie. Ate them on the boat along with our coffee..perfect breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Bachman"
},
"reviewBody": "Put sausage and bacon in it and doubled the tortillas so they dont tear."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kate"
},
"reviewBody": "Making these is a bit of work but once you have all the ingredients cooked, the assembly line to make them went smoothly. We went away on a group trip to the mountain cabin. Made and froze these as per recipe. They transport well in a cooler and ice packs. Put in freezer when we arrived. Fantastic idea! We just grabbed out of the freezer, microwaved for 3 minutes and we were out the door exploring. I have made a second time, using left over steak and baked potatoes. I made hash browns with onions, garlic, paprika, s&amp;p. I rolled them up and we now have steak burritos in the home freezer! Options to serve with: sour cream, salsa, avocado, pico, or just catsup. Thanks for such a great breakfast on the go recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoanS8849"
},
"reviewBody": "These were wonderful. Loved the Ore Ida potatoes in them! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennie"
},
"reviewBody": "Was a hit before the 4th of July parade!! I think our 3 year old granddaughter ate the most Will have in freezer to pop in microwave often!\nGreat breakfast !! Fruit on the side and your done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Super easy and the kids love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Morehouse"
},
"reviewBody": "this worked well. needed to double everything for my family size. froze nicely and was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wolfcook"
},
"reviewBody": "Update 2/7/2019: Okay DO NOT try to reheat these from frozen. I managed to make it work by heating it for 3 minutes, 1 minute at a time, and turning it after each minute was up. This got the insides fully warmed but made the tortilla overcooked and chewy. Much better to remove individual burrito from freezer, put in fridge, then reheat for a minute or two. The texture also isn't what I wanted, too heavy on the potatoes (using my 1.75 oz egg and potato), I would bump the egg to 2 or 3 oz and just make a lot more eggs than the recipe calls for, then 1 or .50 oz of potato. Needs some tweaking, basically. Might be a personal preference, I like lots of eggs in my burritos, however my husband prefers the potato so I'll be keeping the ratio as is for him. ORIGINAL: Overall a really great recipe! Only thing I would change is to season the eggs after they are cooked instead of before, seasoning them prior to being cooked makes the end result watery. I also whisked them for a long time to make them airy and did the chef method of constantly and briskly stirring with a spatula until they start forming, keeping them as smooth as possible, but this takes a lot of effort which I only do because my husband is picky about eggs. I also used heavy cream instead of milk, it is high in fat but I had some sitting around that needed to be used up and it is delicious in eggs. Sour cream is actually a better alternative to milk but milk is still more commonly used and in more fridges than sour cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SZYQ1"
},
"reviewBody": "I made 5 of these for my husband and he really enjoyed the breakfast burritos. I used La Victoria Roasted Pepper Salsa and instead of measuring, I just spooned the amount of salsa I felt was appropriate for him. Otherwise, I felt the amount of ingredients were spot on to yield the burritos. I don't think it's possible to write how to wrap a burrito any better than the recipe author did. It does get easier after wrapping the first one, following the written directions. Overall, my husband says this is a perfect and delicious recipe as written, but also easy to adjust if you'd like to use a different meat in the burritos (e.g. sausage, ham, etc.). Excellent and I'll be making these or another variant of them in the future for him. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zgorazmataz"
},
"reviewBody": "I made a lot. I used eggs, sausage, bacon, cheese and garlic. Half had sausage and half had bacon. My hubby absolutely loved them. Yeah! It’s a winner. Made 20 all together. I will definitely be making a stash of these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Powell"
},
"reviewBody": "Hubby says Do it again ?. \nWe are on a temporary work assignment so we are living in our 5th wheel during the week. \nYou know the limited space in a 5th wheel. So on the weekend I made these to freeze so he could have a warm breakfast every day without cooking.\nGreat recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "The recipe is easy to follow but takes longer time then posted. They forgot about the assembly and wrapping time. And the time to let it all cool (unless serving it hot) before assembling burritos.\n\nBut they turned out great and everyone was full and satisfied. I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Rosenbarker"
},
"reviewBody": "Easy peasy to make. I watched a YouTube video on how to fold a tortilla and added the ingredients less the salsa. Mrs. does not like spicy :(0 I used mayo instead. Happy wife = happy life! ;0)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/261844/freeze-and-reheat-breakfast-burritos/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1310/breakfast-and-brunch/eggs/breakfast-burritos/",
"name": "Breakfast Burrito Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/261844/freeze-and-reheat-breakfast-burritos/",
"name": "Freeze-and-Reheat Breakfast Burritos"
}
}
]
}
}
, "about": [
]
}
]