				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "French Chocolate Cake"
,"datePublished": "1998-11-22T23:04:17.000-05:00"
,"dateModified": "2023-02-13T01:54:37.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Michelle Chen"
,"url": "https://www.allrecipes.com/cook/26842726"
}
]
,"description": "This classic French sponge cake is a dense cake that is delicious when dusted with confectioners&#39; sugar and served with lightly sweetened whipped cream or a fruit coulis. Cut it into 10 generous pieces."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/o_uYA733UGLy6xnAKKOIAWgoc3U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/802088-french-chocolate-cake-Valerie-Brunmeier-4x3-1-a84274270ce7449c9a68668509924f44.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "French Chocolate Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "57"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "294 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "108 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "31 mg"
,"sugarContent": "21 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"0.5 cup white sugar",
"10 (1 ounce) squares semi-sweet chocolate",
"0.75 cup unsalted butter, cubed",
"2 teaspoons vanilla extract",
"5 eggs, separated",
"0.25 cup sifted all-purpose flour",
"1 dash cream of tartar",
"salt to taste",
"0.5 tablespoon confectioners' sugar, for dusting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Generously grease a 9-inch springform cake tin. Dust with a little sugar, and tap out excess."
} ,{
"@type": "HowToStep"
,"text": "Set aside 3 tablespoons of sugar. Place chocolate, butter, and remaining sugar in a large, heavy-based pan. Cook over moderate heat until chocolate and butter have melted, and sugar has dissolved. Remove the pan from heat. Stir in vanilla, and leave mixture to cool slightly."
} ,{
"@type": "HowToStep"
,"text": "Beat egg yolks into chocolate mixture one at a time, beating well after each addition. Stir in flour."
} ,{
"@type": "HowToStep"
,"text": "In a scrupulously clean, grease-free, and large bowl, beat egg whites until foamy. Add cream of tartar and salt, and beat to stiff peaks. Sprinkle reserved sugar over egg whites, and beat until stiff and glossy. Use a whisk or spatula to fold 1/3 of egg whites into chocolate mixture, then carefully fold in remaining whites. Carefully pour batter into the prepared tin, and tap the tin gently to release air bubbles."
} ,{
"@type": "HowToStep"
,"text": "Bake until well risen and a skewer inserted into center of the cake comes out clean, for about 45 minutes to 1 hour. Check cake after 30 minutes; if cake appears to rise unevenly, rotate after 30 to 35 minutes. If cake starts to crack or become too brown, place a piece of foil lightly over top. Transfer cake to a wire cooling rack, and remove the sides of the springform tin. Cool completely, and then remove the base. Do not attempt to remove cake before it&#39;s completely cooled as this cake is very fragile."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Smeltzer"
},
"reviewBody": "I've been stirring over medium heat for at least 15 minutes and I still have granulation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mara Maffucci Miller"
},
"reviewBody": "I made this yesterday during an active time in my kitchen, mistakenly thinking I could multitask. After cake had been in oven around 10 minutes I realized I had forgotten to add the balance of the sugar after the initial 3 T. I was nervous cake would be terrible and it was great, even without sugar. I did dust with confectioners sugar, so maybe that made up for forgotten sugar. In any case, it was terrific and well received"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MC Karen"
},
"reviewBody": "This recipe is a winner and I'll definitely make it again. I rarely bake and found this recipe easy to follow and make. I made two small changes. First, I lined my pan with parchment paper. The cake came right out, no sticking at all. Second, I used a square pan as I could not locate my round pan. No change to the bake time. I served with raspberry sauce and some whipped cream. Thank you for submitting this delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asoupir"
},
"reviewBody": "Delicious cake, just as the recipe is written. No substitutions or changes needed. I served it with a raspberry coulis &amp; whipped cream, which complimented the cake very well. It was better the second day. One note, the cake is very time-consuming to make, taking almost an hour to make, as well as almost an hour to bake, so be forewarned. It's not difficult, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Adamson Johnson"
},
"reviewBody": "Moist, decadent, intense chocolate flavor. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cinnamonh"
},
"reviewBody": "Delicious and light because of folding in the egg whites. I thought it would be heavy, but no. Husband said, honey this has such delicious flavor.\" ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BoiseNoise"
},
"reviewBody": "I helped a teenage friend make this recipe for her French class, and I liked it so well that I decided to bake it again for Easter! The only change I made was to cook it only 35 minutes, since my springform pan was larger than 9 inches. The flavor and texture were wonderful! The cake does tend to fall slightly in the middle as it cools . . . but as you can see from the photo, I guess it is supposed to be that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Long"
},
"reviewBody": "I've made this about 8 times and it's great for birthdays. Each person can make it as sweet as they want with whipped cream and fruit. I always use the European butter. According to our French exchange students, it tastes like the cakes their moms make at home. A winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieQ"
},
"reviewBody": "Honestly, I wasn't going to rate this one, because I did t have all the ingredients, so I substituted! (When a pregnant lady has a craving, she'll try anything!) even though I subsist used oil for the butter and used slightly less chocolate (it was all I had in the house), it came out wonderful! Not as dense (for lack of the butter) but almost fluffy but with an excellent flavor. Next time I want to try it with all the right ingredients! Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "patty crocker"
},
"reviewBody": "Not at all impressed with this. Easy enough to make, but I think it's quite bland. This is more like a brownie than a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hiromi"
},
"reviewBody": "This is so good! I am not a big fan of chocolate cake, but I love this one. I did use bitter sweet chocolate chips instead semi-sweet. \n\nI put whipped cream and raspberries on top. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Brunmeier"
},
"reviewBody": "I was concerned about the cake having only 1/4c flour so I doubled it and it turned out to be about the consistency of a brownie. Everyone loved the flavor and it was very pretty with the powdered sugar sprinkled over the top. I will make again. It would be very good with a raspberry sauce or drizzled with a chocolate syrup. Update: I've made this cake several times without adding more flour and it is wonderful as written! I do sometimes substitute bittersweet for some of the semi-sweet to give it a richer chocolate taste. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "One word.......heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "I have made this cake three times now and even though the second and third ones never looked as good as the first, they were all delicious. My third cake looked like a sunken soufflé, and even the Chocolate Ganache recipe I poured over it couldn't hide its' sadness, but it was a big hit with everyone who ate it. The perfect chocolate fix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan K."
},
"reviewBody": "This was as close to the chocolate cake I ate in Paris."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sama 24"
},
"reviewBody": "my boyfriend is from france and this was a huge hit! i cant wait to make this for his family when they come to visit us. \ni added 9 ounces of semi sweet chocolate and 1 ounce of dark choocolate.\nas well i added some coco powder to the flour 1 table spoon. \n\ni added my own glaze ontop. \nwill make again!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skatru"
},
"reviewBody": "Turned out perfectly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BroBro"
},
"reviewBody": "I did not add cream of tartar, because I do not keep it on hand. I added a bit a baking powder to keep it from sinking and help it rise better while baking. Cream of Tartar, is to help stabilize the egg whites. I was reading substitutes for this product, so in the future I can add a product that does the same thing. Salt is not a substitute for cream of tartar, lemon juice or vinegar, may be added as a substitute to the egg whites to help stabilize them. Substitute lemon juice or vinegar for cream of tartar in your recipes at a ratio of 3 to 1. 1 dash cream of tartar would be 3 dashes or drops, I suppose would be the liquid equivalent of a dash, of either lemon juice or vinegar. It should not be enough, with only several drops to flavor the product but only stabilize your egg whites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsey Wolnowski"
},
"reviewBody": "I made this for our Valentine's Dessert tonight. Oh. My. God. AMAZING!\r\nI thought it sounded like a lot of work when I first read the instructions, but it was actually really quick and easy! I cooked mine in a flan pan instead of the spring-form, so it cooked in about 45 mins. I covered it with a half batch of chocolate ganache (1/2 cup good quality semi sweet chocolate chips melted with 1/2 cup whipping cream and a splash of real vanilla) I'm for sure adding this to my list of favorite recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justdar"
},
"reviewBody": "Amazing!!! Rich, dark, dense and delicious! Must serve with Satiny Chocolate Glaze from this site along with fresh raspberries. You won't regret the extra time it takes to prepare this sinfulness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La Panadera"
},
"reviewBody": "We liked this cake. I made it for Christmas Day dinner. Instead of a 9-inch springform pan, I used two 7\" springform pans and baked them for about 40 minutes, or until they were puffy and tested clean. The great thing about this cake is that once it cools down, it pulls aways from the pan by itself. So taking the ring off is easy. If I know I might be giving one away, I trace the bottom pan over a cardboard circle, cover it in aluminum foil and press that down into the springform pan. That way if I want to leave it behind, I don't have to worry about having the pan bottom returned to me. I used TJ dark chocolate in the big Belgium bar. I also covered it with the Satiny Chocolate Glaze from this site, and served it with fresh raspberries on the side. Not too sweet, not too dense either, just a pleasant mouthful of chocolate goodness. I'm going to see if I can make it sugar free next time! Lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenvalerie"
},
"reviewBody": "Oh my gosh this was heaven. Don't change a thing and trust that it's worth it because it is! Topped with ganache it is a 5 star dessert worthy of whatever event or occassion you're making it for - even if you're only making it because its Wednesday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alle G"
},
"reviewBody": "I have to admit, I was a little skeptical, especially after it came out of the oven and it looked so dry on the outside. I was afraid that it was just going to be a dry, crispy mess. Boy was I wrong!!!! This was absolutely delicious!!! It had the richness of a chocolate cake without the sickly sweetness that you get from traditional cakes. I served it with raspberry sauce and homemade whipped cream and everyone thought it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miguel"
},
"reviewBody": "great tasting cake!!!! love the rich flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happyhippy1000"
},
"reviewBody": "super nice cake! make sure to add 280 grams of choclate, not 28 grams as indicated in the recipe (1 oz). however, less chocolate makes it less rich ;-) in france this cake is called a 'moelleux au chocolat', very popular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joshua Alan Burgin I"
},
"reviewBody": "This was seriously one of the best desserts I have ever made! It was pretty simple to make and totally delighted my dinner guests. I cut the recipe in half and used my 5-inch Springform pan. I also substituted the butter for margarine and worked very well! I believe I will be making this again for another dinner party this weekend :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PATTI777"
},
"reviewBody": "followed recipe with the exception of cutting back on the chocolate (used 4 oz baking chocolate and 12 T cocoa) .... remarkably good with strawberry sauce and whipped cream ~ perfect ending to our Valentines' Day dinner ~ mine did not fall ~ rather a cross between cake, brownie and cheesecake. Overall, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Bergin"
},
"reviewBody": "Tastes awesome - mine collapsed, but that's my fault, not the cake's. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elainelow"
},
"reviewBody": "This is an AMAZING chocolate torte - it's dense, moist and oh-so chocolatey. I cut down the number of eggs to 3 and it still tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aura_bryt"
},
"reviewBody": "last christmas i made this cake as a supprise for my boyfriends father who grew up in france. he loves this cake and i am making it agian for his birthday in 8 days :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pianist827"
},
"reviewBody": "A friend of mine has a french foreign exchange student staying at his house for a month. Her birthday is in a few weeks and I volunteered to make the cake. I made a practice cake to see if I could make it correctly and to see how it tasted. I thought it tasted great, as did my grandparents. my dad and sister didn't think so...but they're not known to be sweet lovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Q."
},
"reviewBody": "This cake is great! I have been making this recipe for years now, and everybody loves it. I also was concerned about the lack of flour, but this cake turns out perfect with the ingredients listed. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twilight9876"
},
"reviewBody": "beaautifully fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENCHISPAS"
},
"reviewBody": "I made this for my friend who is French, from France. She LOVED IT! She said that she was going to pay me the ultimate compliment and then she said that it was better than her mother's french chocolate cake. It really did taste fabulous. Thanks for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Mercer"
},
"reviewBody": "It's my go-to recipe for a rich, dense and impressive cake for get-togethers. People always ask for the recipe!\nIf you don't have cream of tartar on hand, a pinch of salt will do just fine.\nI serve the cake with a dusting of powdered sugar and strawberry or raspberry sauce on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NUKA1"
},
"reviewBody": "Abolutely delicious. I added 2 tablespoons of creme de cacao which gave it just a little kick. Stored it over night and didn't crumble at all when I cut it. Everyone love it. Served with vanilla ice cream and strawberry puree. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carmella"
},
"reviewBody": "Good texture. The cake did fall after it had cooled down, but this type of cake does that. It created a very 'creamy' texture in the centre that was really enjoyed by my family. If you were serving it just as a cake, it could be a bit sweeter, perhaps, but we served it with ice cream, strawberries, and a chocolate ganache which provided the necessary 'sweetness'(I think)and contrasted nicely with the strong chocolate flavor of the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "your mom"
},
"reviewBody": "I think this cake is great! Working as a pastry baker, I have made cakes like this before. The cake usually sinks in a little at the top after cooling. I like to fill the indention with whipped cream, freeze it overnight and then glaze with a melted ganache icing. Sooo elegant but still pretty easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Seconds after taking it out of the oven it began to fall. About 10 minutes later it had dropped about 1/2 way down the pan BUT it tasted great anyway! I made this for a dinner party &amp; everyone loved it, I served it with mint chocolate chip ice cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Meiling206"
},
"reviewBody": "I followed the recipe to a T. The cake was just mediocre. I bake alot and most things turn out very good. After baking this cake, it quickly sank a little. I used the correct technique in \"folding\" in the egg whites into the chocolate, so do not think that was an issue. The texture was like a fluffy brownie. I probably will not make this again. Thanks for posting though Michelle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMALIAA"
},
"reviewBody": "Incredibly Delicious! Cake was crisp on the outside and moist and fluffy on the inside. I accidentally forgot to add the 3Tbs of sugar to the egg whites but it worked out perfectly, and I tend to prefer not so sweet chocolate cakes. Will definatly be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "k_in_NL"
},
"reviewBody": "Lovely cake - rich on chocolate (used chocolate with 56% cacao content), but not too sweet. The texture was slightly brownie-like...not sure why because I was careful with the amount of flour after reading the reviews. Served it with rasberrry sauce and whipped cream for my BF's bday. He loved it! Bonus part... the cake kept well for over a week (it's just the 2 of us). Will definitely make again. The Hague, Netherlands"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLJOHNSON4"
},
"reviewBody": "Very delicious! Took a little time to make, but worth it! I drizzled it with raspberry sauce, then topped it with homemade whipped cream.......yum! All four of my kids loved it, as well as my hubby!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith N. Hope"
},
"reviewBody": "very tasty, served at a refined party, and everyone loved it. very nice when drizzled with white chocolate and raspberry sauce, and each piece is garnished with a strawberry and a dash of whipped cream with an alomand wafer and a touch of cinammon on top. will definetely make this agian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had to do a report on France for my Global Studies class and I decided to make this for everyone in the class. Everyone loved it! Also, I took it to my French teacher whom lived in France for 30 years and she said that indeed, it was French, and she wanted the recipe, as well as 4 other teachers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slsonline"
},
"reviewBody": "I LOVE this torte. It is very rich and flavourful. I always serve this for desert when I have dinner parties - everyone asks for the recipe.\r\nI use the recipe for Raspberry Sauce, and top the torte with that, along with fresh whipped cream (no fake stuff for this desert!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "I followed the directions but this did not turn out at all-I ended up throwing it out. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i tried this recipe twice. the first time didn't turn out right. it sank too much. (almost flat.) but the taste was great so i tried again. the second time turned out well. don't think it's that easy to prepare but love the rich chocolate flavor. need to practice some more..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this cake was delicious; all my friends loved it; it was a nice change from the traditional American-style chocolate sponge cake; it turned out pretty well even though I didn't have a spring tin pan or enough chocolate(2oz. short)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8098/french-chocolate-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
"name": "French"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8098/french-chocolate-cake/",
"name": "French Chocolate Cake"
}
}
]
}
}
, "about": [
]
}
]