				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Fresh Semolina and Egg Pasta"
,"datePublished": "2000-04-28T18:04:36.000-04:00"
,"dateModified": "2023-02-10T17:26:57.000-05:00"
,"author": [
{"@type": "Person"
,"name": "jenn"
,"url": "https://www.allrecipes.com/cook/62"
}
]
,"description": "Fresh semolina pasta is literally at your fingertips as you knead together two types of flour, salt, eggs, and olive oil to make homemade pasta dough."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v--j12OEaM0pbsHABDkP5yvUvbM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17662-fresh-semolina-and-egg-pasta-Beauty-3x4-1-b5b323cc013540d6be591b3cfdbc3daa.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1895236819001",
"description": "See how to make homemade fresh pasta.",
"duration": "PT3M50S",
"name": "Fresh Semolina and Egg Pasta",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0230aee3-936e-4e30-9604-ea1cf45d3754/c7a262e3-6b4f-449d-9dfe-b69851aab04a/1280x720/match/image.jpg",
"uploadDate": "2021-07-09T20:25:38.984-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Fresh Semolina and Egg Pasta"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "270"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "197 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "140 mg"
,"fiberContent": "1 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "53 mg"
,"sugarContent": "0 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"2 cups semolina flour",
"1 pinch salt",
"6 large eggs",
"2 tablespoons olive oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sift all-purpose flour, semolina flour, and a pinch of salt together in a large bowl. Make a mountain out of flour mixture on a clean surface; create a deep well in the center. Break eggs into the well and add olive oil. Whisk eggs very gently with a fork, gradually incorporating flour from the sides of the well. When mixture becomes too thick to mix with a fork, begin kneading with your hands."
} ,{
"@type": "HowToStep"
,"text": "Knead dough until it is smooth and supple, 8 to 12 minutes, Dust dough and work surface with semolina as needed to keep dough from becoming sticky. Wrap dough tightly in plastic wrap; allow it to rest at room temperature for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Roll out dough with a pasta machine or a rolling pin to desired thickness. Cut into your favorite style of noodle or stuff with your favorite filling to make ravioli."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v--j12OEaM0pbsHABDkP5yvUvbM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17662-fresh-semolina-and-egg-pasta-Beauty-3x4-1-b5b323cc013540d6be591b3cfdbc3daa.jpg"
}
]
,"text": "Bring a large pot of lightly salted water to a boil. Cook pasta in the boiling water until tender yet firm to the bite, 1 to 3 minutes (or longer depending on thickness). Drain immediately and toss with your favorite sauce."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It came together beautifully. It may be heretical but I used egg beaters because of cholesterol issues and I used a food processor adjusting flour/water until there were 3 balls of dough. I find this results in the best consistency for a KitchenAid roller or press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie loves to cook"
},
"reviewBody": "Great texture &amp; taste. I made entirely in kitchen aid stand mixer, with pasta attachments. I added dried basil to dough, and pressed out lasagna &amp; fettuccine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy L. Thatcher Bober"
},
"reviewBody": "I made this pasta yesterday and it was so good! This recipe is my new favorite! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "z7mb9vxngq"
},
"reviewBody": "This was the best recipe for homemade noodles that I have ever tried! Perfect taste and texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "norma"
},
"reviewBody": "Excellent recipe. This is my new 'go to' pasta recipe. As with all flour based recipes, the size of the eggs as well as humidity may effect the mix. Very simple to add a little more liquid (water works) or a bit more flour.\nCome on people-chill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Modest Muslimah"
},
"reviewBody": "This whole recipe I made by hand. To make it easier to knead as well as roll out I added some hot water and some additional olive oil and it came out great! definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay"
},
"reviewBody": "Very simple, \"Kneads\"(see the lil play on words there- lol,) a little muscle work to get it ready for pasta machine. Cooked quickly and tasted GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Suarez"
},
"reviewBody": "Super simple recipe! I had to add two more eggs than it called for but I believe it’s because the eggs I was using weren’t large eggs. The pasta has come out perfect every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I made this, and it came out perfect. I did up the salt to 1 tsp. It was not dry at all. I made it into sheets for lasagna. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Courtney"
},
"reviewBody": "I've made this more times than I can count, for spaghetti, linguini, soup noodles, and lasagna. This recipe makes about 1kg or 2.2 lbs of excellent, protein-rich pasta that doesn't need a meat sauce (but is lovely with that, too).\n\nIt works well as written. I make it in a Bosch Kitchen Machine, and I usually double it. I also use Muscovy duck eggs, which are huge, so I use only 5 of those (10 if doubled). The key to this pasta is making sure it's not too wet. If the dough isn't pulling away from the sides of the bowl, add a little flour. Give it time and mix more... flour takes time to incorporate. I oil the plastic wrap (with a pastry brush dipped in olive oil).\n\nDo keep the dough dry! When rolling out, I use the same ratio of 1:1 white flour and semolina to dust the dough (and machine) liberally at all stages, including the final. When the spaghetti or linguini cranks out, I dust it like crazy so it doesn't stick together, then put it in small piles (like 1/2 to 1 cup) on a cookie sheet. When that's full of piles, I freeze it, and when the pasta's frozen, I dump it into a freezer bag. If you make larger piles, the dough will compress.\n\nWhen you cook this from frozen pasta, it's really no different from fresh: just dump the piles of pasta into salted boiling water, stirring some, and they will sort themselves into lovely noodles again. We've never had a bad experience with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "So easy, and Excellent result. This is not my first try at pasta, but it never worked so well. I keep my semolina in the freezer. No idea if that contributes to food results. Following others’ suggestions, I mixed flours and salt in KA bowl. Wisked eggs and olive oil together, with a about a T of water, because eggs looked small. Poured into center of flour. Dough hook on 4 incorporated dry into liquid slowly - like a fork, but easy! Looked a little scrappy after 10 minutes mixing with dough hook. Gathered into a ball to rest, covered. Nicer after rest. \nKneaded a few times, sliced off a fist full, patted it flat, rolled through pasta machine on 1. Folded, ran through again on 1, then once on 3, then once on 5, sprinkling lightly with semolina between, then wider noodle cutter. Laid them flat on the counter while I did the next batch. Covered until water boiled. \nI was worried that I hadn’t floured them after cutting to prevent sticking together. They were clumped when I picked them up, but they separated when they hit the boiling water. I’ll try to remember to dust next time anyway. Cooked at least 8 minutes, but 5 is pretty thick. Delicious, Beautiful noodles! Next time I’ll take them to 7, as these were a bit thick for my taste after cooking, but that was my doing. Read a suggestion to cut and lay all sheets out first, so they can dry out for a minute before noodle cut. Makes sense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bkb"
},
"reviewBody": "I made this recipe exactly by the recipe. I used my kitchenaid stand mixer to mix and knead the dough. It was very firm. I wrapped it and let it rest for 30 minutes. I then devided it into 4 pieces and started with one portion and kept the other three pieces wrapped up to keep them from getting dried out. I used my pasta attachment and made fettuccine. The final thickness I used was 5. Make sure to dust your pasta with semonilia pasta to keep it from sticking. Turned out tender and delicious. I will always use this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave Nespoli"
},
"reviewBody": "A trick I've learned over the years is to omit the white from the last egg. Bread flour is good for spaghetti, but thicker noodles are better with AP or cake flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JohnT"
},
"reviewBody": "Had to add an extra splash of olive oil and water until it came together. Makes 2 lbs of pasta. I quartered it and shaped into rectangles before putting it in the fridge to rest in hope that it makes it easier to run through the pasta maker.\nAfter taking out of the fridge I rolled it out a little with a rolling pin before running it through the kitchen aid pasta attachment. Family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ken Richner"
},
"reviewBody": "Not sure what's wrong with this recipe But like a few others the liquid to dry ratio was way off! \n(I even asked my wife to grab a 7th egg to try to save it but that only made it marginaly better I think 9-10 would have worked)The stuff was dry and could barely hold shape and cumbled!!! Like pie crust! It could be the Semolina or the flour brand/type IDK this is not the first time I made fresh pasta but it was a waste if 2 cups of each flour's and 7 eggs! I will use my old recipe. Foods should not be wasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia"
},
"reviewBody": "Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Pfannkoch"
},
"reviewBody": "I received a pasta roller and cutter set for Christmas so I made this pasta today. My son made a ragu to go with it. It was delicious. There were no leftovers -- it was flavorful and hearty with a nice chew. I followed the recipe exactly and it was the perfect amount of salt. \nThe video was very helpful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KimBurns"
},
"reviewBody": "I made this in the KitchenAid mixer it turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Erin W"
},
"reviewBody": "The ratios are way off. I wish I'd listened to the other reviewers. It came out so dry and crumbly. I ended up adding another egg and another TB of olive oil and I think I may have saved it but haven't cooked it yet. I couldn't make this in my stand mixer it just fell apart. Hopefully this isn't a lot of time and food wasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coachnitro"
},
"reviewBody": "Recipe is great, just wish it was weighed measurements"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Totone"
},
"reviewBody": "Love this recipe! It was easy to follow and work great through my pasta press. I made spaghetti in an hour from start to finish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Hill"
},
"reviewBody": "the dough was easy to work with , I did cheat and used my machines for the tough stuff. I made a full large sheet pan of ravioli and had more than enough dough left for a healthy batch of rigatoni."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Gomes"
},
"reviewBody": "Amazing!! Used it in a fairly dry bolognese-style meat sauce lasagna. Only change was that it didn't need the olive oil.\n\nDidn't sift the flours - just dumped 2 cups each of all purpose and semolina, and pinch of salt into bowl of Kitchen Aid mixer, fitted with dough hook. Turned on mixer and dropped eggs, one at a time, scraping sides of bowl until the hook gathered the flours into a ball; then, let it knead for 4 to 5 minutes. Into a plastic bag for 30 minutes; and then rolled out, and laid flat on parchment.\n\nCut the sheets to length.\n\nNow, learn from my experience - I assembled the lasagna without first boiling the pasta. Bad idea - pasta turned into disgusting mush.\n\nSecond attempt - boiled pasta for 15 secs or so, then plunged into ice water. \n\nBINGO!!! - pasta layers held form and had nice toothsome bite.\n\nHope this helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ImdaPrincesse "
},
"reviewBody": "Made half of the recipe and that was plenty for four people. Super simple and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol Drake"
},
"reviewBody": "Mine was very dry. I followed the recipe pretty exactly.\nPerhaps I need to sift the flour (and thereby use less)?\nI ended up adding an extra egg, then some more oil and water until it was the desired consistency.\nTurned out pretty delicious anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "richard g"
},
"reviewBody": "this is awesome!! I made lasagna with this recipe and it's incredible!\n\nso people need to realize that not all \"all purpose flour\" is the same. my all purpose flour isn't bleached and it has more hard wheat(bread flour) then soft wheat(cake flour) so what happened was it didn't have enough moisture. so I had the issue just like another reviewer had with crumbly texture. so even though all pasta recipes tell you to make a \"well\" and put the wet ingredients in I'm going to incorporate the flour until dough consistency is reached. I make bread and I should have done this but I figured it would be different. \n\nI ended up having to add more oil and water to get it to the perfect dough. but this isn't the recipes fault. it's the different all purpose flour from different companies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brian Raskiewicz"
},
"reviewBody": "It was very hard mixing and kneading by hand. It was very flakey and dry. There was flour that could not be absorbed into the dough anymore. I did it exactly in the video and the dough did not come out as shown at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CHRISTYG"
},
"reviewBody": "Not sure what I did, but made this exactly as written. I got a bunch of crumbly flour that was nowhere near a dough. I added some olive oil, still crumbly, then a tbsp of water, still crumbly. I added a bit more water but was concerned I was going to end up with leaden noodles but nothing I was doing was coming near a dough. I finally doused it with some water knowing I was probably already giving up. Then I had glue, so I threw the wad in the trash. I'm not used to failing in the kitchen, so I'm sort of at a loss on this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Payton"
},
"reviewBody": "I've tried this recipe 3 times now. And it's great if you don't follow the recipe. The proportions are so far off its ridiculous. I would not recommend this recipe. In order to make it work, you have top change it all together. Also, I've been scratch cooking for 40 years. Not my first rodeo. Find a better one. They're out there"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirl"
},
"reviewBody": "My granddaughters loved making their homemade pasta. We forgot to let it rest but we will let it rest next time and see if it changes the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jones"
},
"reviewBody": "I'm allergic to eggs so used Bob's Red Mill egg replacer. I had to add an additional 2 tbsp. of water and knead for about 12 minutes. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quiqui Dagle"
},
"reviewBody": "Absolutely nothing negative, great recipe and delicious pasta! My husband and I made both fettuccine and thin spaghetti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry"
},
"reviewBody": "I followed the directions carefully. The pasta was too dry to run through the machine and then it occurred to me that eggs can be different sizes so I just added more egg until the pasta was pliable. It came out wonderfully tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules Mead"
},
"reviewBody": "Pasta turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Byrnes"
},
"reviewBody": "This is my go to pasta recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ken gill"
},
"reviewBody": "Did like many others used extra large eggs, and it's a wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Starlette"
},
"reviewBody": "Made it but only used a third of the ingredients (made a smaller batch). Still came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Hannah Ruth Eades"
},
"reviewBody": "Others say there was way too much flour but I have no idea what they are talking about. I couldn't get it through the machine with it being so wet! The last recipe I followed used TWO eggs to that much flour and I found much better success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCabrera75"
},
"reviewBody": "This was such a great recipe! It was super easy to follow and gave me perfect pasta! I did mix it in my stand mixer adding the eggs one at a time then kneading it by hand for 8-10 minutes. I can't wait to do it agian!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzzannemarie"
},
"reviewBody": "Don't know if it is because I live at 9000 ft above sea level but I had to keep adding water to the dough to get it soft, it crumbled terrible. Once I got that fixed it was easy and fun to work with. I added a pinch of oregano to the dough (looks like a lot but it was just a pinch) and for the filling a ricotta cheese with no egg and lots of lemon basil - wow what a combo. Made a homemade vodka red sauce and it was delish. Next time I will tweak it a bit more but all in all a good basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tim S"
},
"reviewBody": "a waste of an hour, six eggs and four cups of flour. \n\nAbsolutely no way to form consistent noodles out of this dry/mealy/tough dough. would not go through my atlas machine at \"1\" width."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary_S"
},
"reviewBody": "I add 2 TBLS water and use 1 tsp salt instead of a pinch... could do even more salt. I frequently add herbs or spice for extra flavor.. 1/2 cup of finely chopped parsley does well. I mix in a stand mixer. After mixing done...leave in bowl, place very damp towel over the whole thing and let sit 30 minutes before working it. (semolina available in bulk bins... not in bags... for \"organic food\" national chains... also available in bags in many ethnic grocery stores.. I get mine from an \"India\" grocery store locally)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CanadaRox"
},
"reviewBody": "I followed the recipe exactly and the pasta turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Nohra"
},
"reviewBody": "This was so easy and it made a ton of pasta. I can get several meals out of this. I've tried several recipes that worked out well but this is the first one that felt like a real pasta rather than just doughy noodles. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JordanMarie09"
},
"reviewBody": "Makes a huge amount, but the dough stores refrigerated, so it's great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia N"
},
"reviewBody": "I used a bread baking machine to knead the dough for me and then used a small pasta machine to make it into flat sheets for ravioli. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Mallett"
},
"reviewBody": "Easy to make and came out exactly as it should have. I also used my kitchenAid mixer to make it. Used the flat paddle to blend it and as soon as it came together, I used the dough hook for about 5 mins. Dough came out nice and smooth and easy to roll. Will definitely keep this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamatha Lambrinie"
},
"reviewBody": "Changes I made are just a preference to my taste:\n\nInstead of all-purpose flour I used Tipo \"00\" (you can buy it on Amazon)\n\n1/2 tsp of Kosher salt instead of 1 pinch of salt.\n\n8 eggs instead of 6 eggs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlh0905"
},
"reviewBody": "We did have to add another egg. The semolina pasta is a great addition for a good pasta texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I made this pasta dough today and it is by far the best recipe I have made. The only issue I had was the dough was a bit dry so what I did was dampen my hands in water until it reached the correct texture as I was kneading. Made fettuccini for dinner tonight and the only thing wrong was I didn't cook enough, this is my go to receipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leasa"
},
"reviewBody": "I halved it and needed one more egg. Otherwise, outstanding!!! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Zabawski"
},
"reviewBody": "I found pasta flour at the grocery so it was premixed. Cut the recipe in half cuz there's only 2 of us. I added about a teaspoon of Italian seasoning this was an awesome recipe. I will try my food processor next time to mix it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JPL"
},
"reviewBody": "I used the Kitchenaid stand mixer and ran for 7 min at speed 2. Great, used noodles for chicken noodle soup and pasta. The semolina makes a difference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Teel Foerster"
},
"reviewBody": "Excellent basic recipe. For the critics-you just need more experience handling dough and adjust accordingly. Weather,humidity,size of eggs and flour will always change consistency. Have fun!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eddiana02"
},
"reviewBody": "2nd time made was easier. Before making again, watch videos on how to use kitchen aide when making pasta to refresh. Use paddle to start and switch to dough hook. Will have to finish this by hand though...motor won't handle it. This recipe makes a lot so plan to freeze. Next time add dry oregano and basil and replace salt with garlic salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duboo"
},
"reviewBody": "This is my first attempt making pasta with seminole flour and it came out fantastic. I loved both the flavor and the texture. I did probably have the dough a little too moist the initial couple of cuts, but it quickly dried down and was perfect. I used my kitchenaid bowl to knead. I used the paddle for about a minute and the dough hook for several minutes. I let rest on the counter with a bowl covering it for about 30 minutes. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theodore Utkin"
},
"reviewBody": "The recipe is well-balanced, the result is amazing. The pasta turns out out very plastical. You can make it very thin, nearly transparent - looks great in your chicken broth, or thicker - for a side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CJ38"
},
"reviewBody": "Loved it once I adjusted the dough with some cold water and additional oil...actually doubled the oil and slowly added cold water until I could work the dough. I also found that cutting the dough into four pieces made the kneading easier. I used my grandmother's trick to knead....rolled the dough with my hand, then upended, pushed down and rolled the other way. It helped to smooth it all out. \nEnded up being the best home made pasta I ever s recipe is huge, so I wrapped, bagged, and froze the leftover noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristens"
},
"reviewBody": "I made this WITHOUT a kitchenaid! I made a 1/2 because I just wanted to try it out; so 1 c semolina, 1 c white/wheat (house blend), 2 eggs and some olive oil. Lots of kneading later, and a few drops of water as it dried, I cranked it through my pasta roller &amp; cutter. This will be my new go-to recipe for pasta!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bren"
},
"reviewBody": "Loved it!! I used my Kitchen Aide to knead the dough and the pasta attachment to roll it out. It was fairly easy to make and the cooked pasta is delicious. I did have to add an a tablespoon of water to make it come together but my eggs may have been a bit small. Great recipe, thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Kovler McCabe"
},
"reviewBody": "Absolutely perfect every single time, and I've made this countless times! I put the dry ingredients in my Cuisinart bread machine, beat the eggs and stir the olive oil into them, then add that on top. Use the pasta dough setting and it's ready in less than 15 minutes. Take it out, wrap it and let it sit for a while before cutting. If I don't use it all, I wrap it well and keep it in the refrigerator. I tried numerous recipes before I found this one and this was exactly what I had been looking for. No looking back! Perfect for ravioli, spaghetti, ziti... you name it! Kudos, Jenn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "forhealth"
},
"reviewBody": "If anyone really wants to have fresh home-made pasta, get a good pasta machine and this recipe. The work is definitely worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Roberts"
},
"reviewBody": "Love the pasta, worked great. Have substituted wheat for the Semolina to make it a little healthier and it worked well. Negative reviews must of done it wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lynx4"
},
"reviewBody": "This is a very durable pasta. I too experienced the recipe being a little too dry to make a dough ball. However, I do have a couple of things that probably accounted for that. First, I have my own chickens and therefore my eggs are not uniform in size. So it's likely that what the recipe is calling \"large eggs\" might be larger than my eggs. Second, we are having \"Santa Ana\" conditions here, which means that there is very little humidity in the air. As a result, the dough would be dryer than usual. I just added an extra egg and about two tablespoons of water (you don't have to use water. You can use broth or tomato paste or pureed pumpkin or basically anything else that's liquid or pureed. Realize, however, that it will really only color the pasta and not really add any flavor to it). \nI took one star off because it is a lot more work than my traditional recipe (which doesn't use semolina or olive oil so it comes out quite different). Many other commenters talked about using their Kitchen Aid mixer, which I did too. However, it wasn't that easy. I equipped it with the dough hook and mixed it using the hook. It was during this stage that I saw there were little balls of dough, but it wasn't coming together in a ball. That's when I added the additional egg. The dough balls were bigger, but still not one big ball. That's when I added the two tablespoons of water and the dough came together perfectly. Once I got the consistency right I let the Kitchen Aid run wit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SpycGyrl"
},
"reviewBody": "I wanted to use my new pasta machine and thought I would use this for my first try. It's a good recipe. I used my KitchenAid to mix and ran it through my machine, after resting. It was just the consistency and my pasta was perfect! Thanks for a great recipe that I'll be using regularly. I'd love to find similar ones to add spinach, etc. to the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAYR"
},
"reviewBody": "This was my first pasta experience and it was great! I didn't have any issues following this recipe exactly. We halved the amounts and used the kitchenaid - as recommended by many reviewers. The kitchenaid started jumping when the dough came together, so we finished the kneading by hand for another 4-5 min. No issues with dryness or flaking. Easy to roll after a 30 minute rest and kept the remaining dough in the fridge overnight (cling wrapped tightly). No problems rolling the next morning either. \nDon't forget to keep the pasta separated to dry on a dryer rack or on a tray dusted with flour, else it will stick and all the rolling and cutting will be wasted :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ'sRunningKnot"
},
"reviewBody": "My go to pasta recipe !I let my kitchen aid do the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Howell"
},
"reviewBody": "Kitchenaid users, make only one batch at a time. I doubled it today and my 6 qt couldn't keep up. Some flour is drier than others, and organic eggs might run small, so don't be afraid to add WATER as needed. It's that simple! This is the best egg pasta recipe ever. I'm using it again today to make 2400 ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddie Hoss"
},
"reviewBody": "Kneaded it the old fashion way...my two hands. After the suggested eight minutes, I was ready for some pasta! Great recipie and very tasty pasta! Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMCGEOCH"
},
"reviewBody": "I made this for my family and parents one night in my family's lasagna recipe. It was much better than the regular pasta made from all purpose flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adam Landrum"
},
"reviewBody": "Great recipe. I wanted to know how to make the pasta in the picture. After finding instructions online, we used a pencil (lightly floured), cut the pasta sheet into 2\"x3\" strips, and starting from the corner, rolled the pasta and slid the pencil out. The instructions said to wait about fifteen minutes making pasta sheets, but that made some of the sheets dry. I say wait maybe five minutes before rolling your sheets. We used kitchen aide attachment set at 4. Next time I would do 5, as when rolled 4 was a little thick. Hope that helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "When I first made this I didn't have a pasta machine, but this still came out wonderfully with my low tech rolling pin and pizza cutter. Now that I have a pasta machine, it comes out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Made lasagna and ravioli. Easy to work with even without a pasta maker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbail33"
},
"reviewBody": "Great recipe. Does anyone know a good method for making macaroni and other pasta shapes?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "Great pasta. Easy to make. One recipe made enough for a 9x13 pan of lasagna and about 18 cheese ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carols Favorite"
},
"reviewBody": "easy and worked EXACTLY as described. We will keep this one as a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Smith"
},
"reviewBody": "I would give this 10 stars if I could. My husband and I made a veggie-bechamel lasagna and the pasta was so light it almost melted in your mouth. Goodbye boxed pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Schiavone"
},
"reviewBody": "I used my Kitchen Aid mixer and the recipe worked great. No complaints!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "I made these as noodles in chicken broth for Christmas dinner...i changed from olive oil to vegetable oil and i also used my kitchen aid mixer to mix and knead...they turned out wonderfully"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joan"
},
"reviewBody": "Doubled the recipe for ravioli for Thanksgiving. This recipe is excellent! My husband mixed and kneaded -- it took him considerable strength to knead until smooth. We added two additional eggs (ours were labeled \"large\" but they weren't at all), plus another tablespoon of olive oil and a bit of water. Beautiful dough once done. The final ravioli were amazing as well, filled with ricotta, eggs, sun dried tomato, fresh parsley, asiago, parmesan, and romano. Still have a lot of dough leftover, too -- we've frozen it and will use around Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RPMsMama"
},
"reviewBody": "Love this recipe! Pasta has never tasted so GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ang Marie Per"
},
"reviewBody": "I made this recipe for my homemade Bolognese sauce and it was AMAZING... so much, that when I presented it to the Judges on MasterChef 6, they LOVED it! A must try indeed...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda May"
},
"reviewBody": "This recipe produced a very easy to roll out pasta, it was a no fuss recipe pretty much anybody can execute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "This recipe is flawless. I make it every week now that I have a kitchen aid mixer. Spaghetti, Fettucine, bowtie pasta, hand cut, lasagna... this recipe never fails."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camlnurs"
},
"reviewBody": "I didn't change a thing! This is by far the best recipe for fresh pasta. Just be sure your ingredients are exact measures then it will be perfect every time. Thanks so much for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margaret Maggie Crabtree"
},
"reviewBody": "Flour can very in protein content- and that affects how water and HOW much water absorbs... which could be why some had problems with flour being too much or too little. The more protein the more it absorbs water...so if it's too dry you may have had some high protein flours. You adjust with a little bit of water until you get it to the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lennie"
},
"reviewBody": "I made it two nights ago - it turned out nice and golden and eggy. We made spaghetti, and it cooked in about three minutes. Strands held together like store bought, but the pasta feels and tastes much better in the mouth. I froze some, and tonight took some from the freezer and dropped it directly into boiling salted water. Delicious. \n\nFor those who had trouble with the consistency of the dough, I highly recommend weighing the ingredients rather than going by volume. It's the best way I've found to get consistent results. \n\nOh, and I can't say enough good things about using a stand mixer to knead the dough, then rolling it out with a hand-operated machine. Results are very consistently of a high quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Alright: so i discovered half a bag of semolina in my fridge early today and decided to make fresh ravioli for dinner. I found this recipe, and after realizing how big it was, i decided to halve it. Now, I'm not afraid of a little kneading, so i didn't bother breaking out the kitchenaid for this. I used Large eggs, and am going to have to agree with the reviewer who said that there's too much flour in this recipe for the amount of liquid involved. \n\nMy dough was TOUGH. After resting a bit, it was more pliable, but it was still far too tough, and i found myself wishing i could add some egg afterward, but it wouldn't have incorporated correctly. We all know that tough dough means tough pasta. So my end result was chewy. I also agree with the person who said the recipe could do with a little more than a \"pinch\" of salt, as well. That said. Its an OK recipe. Not great. But its OK."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shenry1313"
},
"reviewBody": "I was using Giada' s pasta recipe until tonight when I tried this one. This was way better! Had a nice dense texture. We like some bite to our posts. This will be the only recipe we use from now on. Made it exactly as the recipe says. Used my Kitchenaid. Came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason R"
},
"reviewBody": "I'm an Executive Sous Chef and I used this recipe the other day. I, like most of you used a large stand mixer to mix ingredients then kneaded it by hand. It is a very simple and easy recipe to use at home and in the Professional setting. I highly recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "What's for dinner, mom?"
},
"reviewBody": "I mixed the dough in my KitchenAid mixer then finished by hand. I added garlic powder, parsley and black pepper to my dough. I used some high maize flour to up the fiber of the pasta. I had no issues with the flour/egg ratio. I also used egg beaters to cut the cholesterol. Delicious! ***UPDATE** In an effort to minimize my use of Egg substitute products, I tried using all organic egg whites. I still used some high maize flour and a bit of inulin (natural fiber) powder, to up the health factor. I skipped the oil making these fat free as well. No fat, high fiber and sodium free as I skipped that as well. I have learned to roll my dough sheets out and then let them dry for about 30 minutes before running through the machine. The noodles cooked up beautifully! Everyone enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Pistol"
},
"reviewBody": "Great recipe. Made it just as the instructions said, and as the dough came together was worried that there was too much flour. Kept kneading and eventually it was absorbed. After resting, quartered the dough and rolled out with a pin, turning dough regularly and dusting with fine semolina. Then cut into strips. This made enough for two dinners for two. I let the finished pasta sit on the counter for a few minutes, then put into containers like those in which I had seen fresh pasta sold, and refrigerated. If you want more egg, just add an egg, don't worry about buying jumbo eggs. Can't wait to serve this with a ragout."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEM"
},
"reviewBody": "Tried this tonight. It came out fantastic! I live at altitude and the climate is quite dry so I added about 1 1/2 tablespoons of water. Can't wait to make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicky's' Taste of Italy"
},
"reviewBody": "Best pasta recipe ever! I made it for my family and they loved it!! Full of flavor!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loves2Cook"
},
"reviewBody": "I like this recipe, although I did add 1 extra teaspoon of oil. The important step is to let the dough rest at least 30 mins as indicated in the instructions. That really helps the dough come together so that it becomes a nice consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "A great recipe. Halved the quantity and mixed it by hand. Took about 5 minutes of hand kneading for it to come together and I let it rest for 20 minutes before putting it through my machine. My usually non discerning boyfriend even noticed the difference in the quality between this and the boxed pasta I normally make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gigi Peeters"
},
"reviewBody": "The taste was lovely but in the pasta machine it broke to short pieces, so next time another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kfherring"
},
"reviewBody": "I just made this recipe with my boyfriend for dinner and it was amazing! I was a little worried at first that the dough would be too dry but as it kneaded it softened and smoothed out. I used my kitchenaid stand mixer to knead and then the pasta roller and cutter attachments for it to roll it out. It made great linguini! The leftover pasta is hanging over a broomstick and 2 chairs drying out right now. When it is still kind of damp but not sticky I will scrunch it up into little nests for storage and then let it dry out completely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat Kronengold"
},
"reviewBody": "Perfect."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17662/fresh-semolina-and-egg-pasta/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17662/fresh-semolina-and-egg-pasta/",
"name": "Fresh Semolina and Egg Pasta"
}
}
]
}
}
, "about": [
]
}
]