				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Frijoles I"
,"datePublished": "2018-06-08T09:18:36.000-04:00"
,"dateModified": "2022-07-14T18:15:46.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karen"
,"url": "https://www.allrecipes.com/cook/24324907"
}
]
,"description": "A friend passed this recipe to me. It is a little more work, but worth it for authentic refried bean taste."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/HuGJ7McXsw8aHm2om7pAW4TDItY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7748547-ccd4edd4c30f4c07b90b0fa67e528081.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Frijoles I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "75"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "224 kcal"
,"carbohydrateContent": "21 g"
,"cholesterolContent": "32 mg"
,"fiberContent": "5 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "427 mg"
,"sugarContent": "1 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pound dry pinto beans",
"2 onions, diced",
"1 clove garlic, minced",
"2 teaspoons salt",
"1.5 teaspoons pepper",
"0.75 cup butter",
"1 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Soak pinto beans overnight in 1 quart of water."
} ,{
"@type": "HowToStep"
,"text": "Place beans into a large saucepan, and add water to cover. Add onions, garlic, salt and pepper. Bring to a boil, then simmer over medium-low heat until beans are tender, about 1 to 2 hours. Add additional water to the pan as needed to prevent burning."
} ,{
"@type": "HowToStep"
,"text": "Mash the beans with a potato masher, and mix in the butter. Continue cooking, stirring occasionally, until the mixture is thickened and the butter is absorbed. Adjust seasonings to taste."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Spread the bean mixture into a 9x13 inch baking dish, and sprinkle shredded cheese over the top. Bake for 15 minutes, or until cheese is melted."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT270M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Worst beans I have ever made. Zero flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ali"
},
"reviewBody": "Too much butter and pepper. It’s missing something but I’m not sure what"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maidenmade"
},
"reviewBody": "I’m a Texan Hispanic and when my Mom made beans, we we’re always excited for them to be done. Remember to clean and sort your bean before you cook them. Just pour them on your counter or table and spread them out in a single layer. Remove the small rocks, half (not whole) or wrinkled beans. I’m a clean freak, so I always give mine a quick rinse. We never soaked our beans, we just started them off with cold water. As for flavoring, it’s all to personal taste. We included a meaty ham hock, which helped flavor the beans and the cooking liquid. When the beans come to a boil, turn down the heat to keep them at a rolling simmer, add some salt, put on a lid. As it cooks, taste the cooking liquid for saltiness, add more salt if it’s bland. Add water, if needed, to make sure they’re covered or you’ll burn them! You DON’T want that smell in your house! When done, serve them up in a bowl, with fresh black pepper, piece of the ham hock and cooking liquor. Yum! We never drained our beans. We stored it all together in the fridge. You can easily mash the beans right after cooking them, add some cooking liquid to thin them out to your preferred thickness. The reason for a bit of oil, butter, or margarine when making “refried beans” from cold beans is so that the beans don’t stick to the pan. Skip the fat if you include some of the cooking liquid. When the beans are heated, they’ll be soft enough to mash. We just used a potato masher. Mash them to your preferred texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "This is my favorite staple. I've made this so many different ways. I just made it with black beans and I cut the butter to 1/2 a cup. Adding bacon fat makes these to die for!! I leave the cheese off until serving, so they last longer in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these in an Instant Pot and they came out perfect. For ease of serving I placed the beans in individual ramekins, topped with cheese and melted it in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "I followed this recipe as written, except I added 1 cup of pepper-jack cheese. If I'd not used the pepper-jack, 2 cups of cheddar would still be the correct amount for our taste. I'm only guessing, but I think the use of lard instead of the butter would push my rating to 5 stars. This was very simple to make, delicious, and I see no need to ever buy this in a can again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tika"
},
"reviewBody": "This is a very tasty side dish. I will admit that I used canned beans to speed up the process a bit but it turned out great. I would definitely cut down on the butter next time though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caitlin Kunz"
},
"reviewBody": "These were tasty. I used less butter and only one onion and they turned our perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msimmons"
},
"reviewBody": "It was very easy to make. I found a similar recipe that was done in a crockpot so I decided to try that and it was great. I just have to watch the \"helpful friend\" who caused it to be a little to salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jannis Bremer"
},
"reviewBody": "I followed the recipe measurements, except adding 2 garlic cloves rather than one, sprinkled a little chili powder in it, substituted coconut oil for the butter and used less cheese on top. This made it healthier and we loved the taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "texascookers"
},
"reviewBody": "Very impressive recipe. I followed all the directions except instead of doing just butter, I did 2/3 of what the recipe called for in bacon grease and the rest in butter. When buying the pinto beans it didn't look like enough, so I used 1 1/2 pounds instead of just one pound. Big mistake! The taste was really good, but we had a lot left over. Resist the urge to buy more when it doesn't look like enough. Since I don't have a potato masher, I used our blender, and I'm really glad we did, because I was able to get the texture just perfect. Remember to drain the water before mashing it (the recipe didn't really clarify that). Instead of soaking it overnight, just boil the beans and let them sit in hot water for an hour and they soften up. We served these on nachos and they tasted so good. Great recipe, Karen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Freeman"
},
"reviewBody": "great dish, thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lauren Ward"
},
"reviewBody": "I cut back the amount of butter but it still just tasted too buttery for me. My boyfriend liked them and they weren't too difficult to make but I'll pass on them in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VAMOM"
},
"reviewBody": "I made these fat free because that is what I am used to from the store. I omitted the butter, and added some cumin and a little chili powder for extra flavor. I also added the cheese in the beans instead of on top so my picky non-cheese eating child would eat it. It worked out fine and all loved the beans. I froze the extra in quart sized freezer bags to use as needed for recipes. If you buy the beans in bulk it is less expensive and tastier to make these yourself and freeze them instead of buying the stuff in the cans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosemarie"
},
"reviewBody": "use less pepper! my mouth is burning. it's pretty good. i will try some soyrizo in it next time. it's missing something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Armitage"
},
"reviewBody": "Delicious! I cooked them in the crockpot on low for 8 hours while at work. I added some chili powder and cumin. This was a simple recipe with excellent flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "greengirl"
},
"reviewBody": "Okay, so I've tried to make this one twice this week already. I checked the recipe several times and all I can figure is I must need to COVER the pot while simmering because the beans are still way too chewy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey L"
},
"reviewBody": "Delicious! I can't stop eating them. Nutritious, delicious, and inexpensive - what more could you want? I added some chipotle Tabasco and the juice from a jar of jalapenos for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mrs.G."
},
"reviewBody": "I had never made refried beans before and this was a great place for me to start. I have made a version of this three times now and each time used a different *oil* I used butter the first time, bacon grease the second time and vegetable oil the third time. I have come to the conclusion that it is just a matter of personal taste preference. Everyone really liked all three. I think I will probably use vegetable oil from now on because it is the least expensive. So glad I tried it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MANDENICOL"
},
"reviewBody": "We really didn't care for these. The butter flavor was just really strange. We are not used it butter flavored pinto beans. If you are this might work for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Anne"
},
"reviewBody": "These were okay, but lacked flavor. I added a lot of extra spices. Also, The texture was sort of weird - I cooked the beans for 3 1/2 hours after soaking overnight and they still seemed a little under-done.\n***update the next day - I just made enchiladas with the leftover beans and they were incredible. No weird texture or anything. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissadee"
},
"reviewBody": "Delish. I made an error when cooking the beans, added to much cooking water to start, but was able to fix it by adding one can of refried beans. Next time I will use water just to cover the beans while cooking. Made for my bunco group, and got raves. Will for sure make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica A."
},
"reviewBody": "I have made these several times now, and they are so forgiving! I make them a little different everytime; sometimes I just add garlic, some butter, and maybe some cumin and chili powder. Other times I add salt, pepper, red pepper flakes, cumin, taco seasoning, and garlic. Each time I have made it it has been very good--I blend the beans up in batches with a blender to make them smoother though--I also never use the amount of butter they call for, only one to two tablespoons, and sometimes none at all and it is still good. I especially like to use this for nachos, by putting nachos in a dish and piling on salsa, the refried beans, jalapenos, and cheese, baking it for 10-15 minutes and then serving with shredded lettuce and tomato on top--pretty healthy and really fun to both prepare and to eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Apple Jacks"
},
"reviewBody": "I think this is a wonderful basic recipe. Instead of two, I only used one good-sized white onion. I wasn't sure which type or size would suit the recipe best...it would certainly be helpful to specify for beginners like myself :) My preference is for smooth refried beans, so I blended the mixture for a while and it came out great. I recommmend lime pepper, bay leaf, oregano, and cayenne to spice it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Surpriseitswendy"
},
"reviewBody": "I made this for my family of picky eaters and they ranted and raved. We live close to the border, so I just picked up some flour tortillas and some tostadas and and added the beans, then cheese, lettuce, and salsa. These were to die for!! I love using a recipe that tastes authentic, but does not contain lard or having to fry! Thanks a bunch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie"
},
"reviewBody": "Awesome Recipe cooked as directed. \nA tip if you love spice- add some juice from a jar of pickled jalapenos while the beans are simmering down (approx 1/2 cup worth) It gives the beans excellent flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WrenskiBaby"
},
"reviewBody": "You really don't need to soak the beans; just wash them, bring to a boil (6 c. water for every 3 c. beans) and cook overnight or all day in a slow cooker. And use bacon drippings, lard or shortening, not butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Turner"
},
"reviewBody": "These are great! The whole family loves them. try adding different types of cheese to it. Such as Pepper Jack etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "I forgot to soak the beans the night before, so I used 2 cans of pinto beans (liquid as well). Added a little chicken bouillon and sauteed onion and garlic. I only used 1/4 cup butter. After waiting a while hoping the excess liquid would simmer away, I grew impatient and tossed in a can of refried beans, mashed the whole mixture up, and poured it in an 8x8 pan. I topped it with cheddar and queso fresco (leftover from the enchiladas) and baked it. Turned out awesome! The pan was scraped clean when I took it home. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I would substitute lard or bacon fat for the butter because the butteriness throws off the flavor. This is still better than the can, which I feel has an odd aftertaste of preservatives and metal. Refried beans traditionally have a hint of savory pork taste/smell to them. I recommend using these refried beans in an awesome 7 Layer Dip, as a side dish with Spanish Rice and Enchiladas, or spread on a tortilla with other toppings. If you prefer/prepare this buttery version, please be warned that you may raise eyebrows of those who are regular refried bean eaters &gt;:/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roxycat"
},
"reviewBody": "this is a keeper. i substituted bacon drippings instead of butter &amp; added a little bit of chili powder to give this more flavor. came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Doe"
},
"reviewBody": "I've made this recipe twice - the first time, exactly as written had such excellent, tasty results that I went ahead and made minor changes to create refried chili, the second time. Nice flavour, nice consistency, overally great result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Brock Fuller"
},
"reviewBody": "Really good. With all these great recipes to try it makes me want to open up a restaurant and serve up all these tasy dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sola"
},
"reviewBody": "These were great. I cooked them for around 3 and half hours, so it took almost no effort to mash them with a large fork (I don't have a potato masher). I layered half the beans with tortillas, salsa and plenty of cheddar cheese and baked @ 350 for 20 minutes. It was delicious, and I still have the other half of the batch left for some other tasty dish. I will probably make my refried beans like this a lot now, rather than buying them in a can. The only change I think I made was adding less margarine-- I didn't strictly measure, but I think it was closer to a 1/2 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KERSTIN"
},
"reviewBody": "This was better than what they serve in mexican restuarants or out of a can, but it still tasted as if there was something missing. Not sure what it could be though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BajaValle"
},
"reviewBody": "If made correctly this is a tasty dish. The only things that I would consider not authentic is well, the butter (normally a litte bacon grease), obviously, and the salt (which is ALWAYS added at 20/30 mins before the beans are fully done. You can always add not fat and a dash of cumin and garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenInCalifornia"
},
"reviewBody": "These were great. I'll never go back to the canned ones! Mine were a little salty for our taste, but that's easily adjusted. I just eyeballed it anyway, so it was probably my fault. Great recipe, Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lisa Green McIntyre"
},
"reviewBody": "Tried this twice thinking maybe the mistake was mine. Just too buttery of a flavor. The second time, I only used 1/3 of the amount the recipe calls for. Still too buttery flavored. I was making them to put into burritos. Who wants a butter flavored burrito? Perhaps good for other uses, but not at all to my liking. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "skc102"
},
"reviewBody": "This isn't bad, but to make them really good try this! While the beans finish cooking, fry a pound (yes a pound) of lean bacon, add onion, garlic, jalepeno and the beans. Cook until everything is done and mash the beans. YES, leave ALL the grease in the pan. Not good for the arteries, but oh so good on the taste buds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tracy2303"
},
"reviewBody": "I wish I didn't even have to give them one star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa1977"
},
"reviewBody": "If god wanted refried beans for dinner, he would use this recipe. I made some of the dishes for my mexican dinner the night before and this one I couldn't stop eating from the bowel with a spoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TERRAWOLF"
},
"reviewBody": "Decent, but not on par with what i was hoping for. Maybe I messed something up. I will try these again and see what happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBorchert"
},
"reviewBody": "Great recipe! Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katiedidnt"
},
"reviewBody": "I am a novice at cooking beans, so I didn't realize how much they grow when water is added. I used a 2 lb bag and ended up with tons of beans! Mine ended up a bit dry, next time I will add more water. Also, I halved the butter and it was plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KLEVERGRL1"
},
"reviewBody": "Clearly I'm in the minority here...these beans had nearly no taste at all. Rather than serve them at a mexican food dinner I hosted, I threw these down the garbage disposal. I followed the instructions precisely, so I'm at a loss as to what the other folks tasted. These were nothing like the beans served locally here in Arizona restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RACHAEL"
},
"reviewBody": "Yum! These are the best beans ever. I made a double batch and they were instantly gone. I want more right now as a matter of fact. I put in a little more garlic and usually simmer a jalapeno or two with the beans. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEYNOW1"
},
"reviewBody": "I cook dried pinto beans fairly often but we're usually tired of eating leftovers before the pot of beans is gone. I had no idea how easy it would be to make delicious refried beans from them. From now on, I'll use this recipe on the leftovers and pop them in the freezer for our next Mexican meal. I'll never buy another can of refried beans. These are so good! Thanks Karen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love making things from scratch and this recipe was a hit. Easy to make. I did not change or alter any of the ingredients. Leftovers froze well. We have used them on tacos, salads and for bean burritos. I'll definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "*~*Autumn*~*"
},
"reviewBody": "I did this recipe, and used canned pinto beans instead. I also melted the butter with the garlic in a saucepan, and after mashing the beans, I went ahead and added the butter to the beans slowly until I reached the desired consistency. It turned out good, and used it as the base for the seven layer dip!! It was wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wilemon"
},
"reviewBody": "Very good, I used black beans, substituted garlic salt for one of the teaspoons of salt, and also added some green chili peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carey Cox"
},
"reviewBody": "These are delicious. I haven't tried them with dried beans yet, but using canned beans was a success. I used mexican oaxaca cheese instead of cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MIK_4"
},
"reviewBody": "Next time I will cut back a little on the pepper but it was still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy, tasty, and makes a good leftover sidedish. Reduced amount of butter and increased amount of garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DARZMAN"
},
"reviewBody": "Easy preparation and a hit at our mexican fiesta!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "I'm a big bean person, so this recipe immediately appealed to me and seemed to go well with my \"bff\", Karen's Super Bowl party. I could eat refried beans right out of the can, so this was a tremendous treat! Ka and I didn't have enough time to do it the long way, so we subbed with canned beans. We also added canned green chiles and cut waaaaaay back on the butter. This was excellent and I wish there had been some leftovers! Good job Karen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "I'm nuts too"
},
"reviewBody": "MMMM. Very authentic taste, the kids liked them as well. I'll have to confess...I cheated, I used canned beans &amp; then picked it up from step 2. None the less still delicious. I'll do it right next time when I don't forget to soak the beans. I'll also cut the salt &amp; pepper amounts in 1/2 as they were a bit salty and as my son says \"spicy\". Oh, I forgot to add the butter at the end...perhaps thats why. Thanks Karen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had an extra bag of beans so I made this. These are really good! Although I don't agree with the author, it didn't seem like much work to me. The only thing I did different was added more garlic and froze the ones we weren't eating that night. Last night we were having tacos so I added the beans to the taco meat and it was fantastic! Very budget minded, just what I need with 3 kids~~~~Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used your recipe for frijoles and it was delicious. I took this dish to a church gathering and out of the two bean dishes made, mine was the first one to go. The only change I made was to substitue some of the onions for green onions. I had to improvise because I was out of white onions. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Worley Torrance"
},
"reviewBody": "These came out really soupy. I think next time I will drain a little of the water off before mashing them. Also, I had to keep it on a very low simmer to keep the beans from burning to the pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used this recipe for whole beans. I subsituted pepper for cayenne pepper and added a couple of bay leaves. I left out butter/cheese. Very easy and flavorful. Not to mention lowfat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Littlewood"
},
"reviewBody": "Authenic taste. Made a double batch and froze half - still great the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great Frijoles! Much better than any you'll get from a can!\r\nAnd as good as those from the best restaurants!\r\n\r\nAs a variation I like to use 1/2 black beans, the black beans add a rich flavor.\r\n\r\nI doubled the recipe and put 1/2 in the freezer!! Great time saver!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/38169/frijoles-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/38169/frijoles-i/",
"name": "Frijoles I"
}
}
]
}
}
, "about": [
]
}
]