				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Frosty Strawberry Squares"
,"datePublished": "2020-06-18T23:09:29.000-04:00"
,"dateModified": "2022-07-14T15:43:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "TAMIELAW"
,"url": "https://www.allrecipes.com/cook/703071"
}
]
,"description": "Strawberry fluff is frozen on a sweet walnut crust before cutting into squares to serve. Enjoy this treat on a hot summer day."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-ysVzfOQolcYaZx2peyIGIkXPJM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/665112-548d7e67f9dc4b268a9929b066e2f9c4.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3786494512001",
"description": "A sweet treat to beat the heat!",
"duration": "PT2M14S",
"name": "Frosty Strawberry Squares",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/871be630-e230-4403-a80d-6cd4d513de5f/98c7d95d-f32d-4ea0-b601-1dfd55fa79a2/1280x720/match/image.jpg",
"uploadDate": "2021-07-26T23:14:21.736-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Frosty Strawberry Squares"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "83"
}
,"cookTime": "PT360M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "24 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "37 mg"
,"sugarContent": "14 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"0.5 cup packed brown sugar",
"0.5 cup chopped walnuts",
"0.5 cup butter, melted",
"2 egg whites",
"1 cup white sugar",
"2 cups sliced strawberries",
"2 tablespoons lemon juice",
"1 cup heavy cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Line a rimmed baking sheet with aluminum foil. In a bowl, stir together the flour, brown sugar, walnuts and melted butter. Toast in the oven until walnuts are fragrant, about 15 minutes; stir occasionally. Sprinkle 2/3 of the walnut mixture evenly over the bottom of the 9x13 inch dish."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, whip the egg whites with the lemon juice until they can hold a soft peak. Gradually add white sugar while continuing to whip to firm peaks. Fold in the strawberries."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-ysVzfOQolcYaZx2peyIGIkXPJM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/665112-548d7e67f9dc4b268a9929b066e2f9c4.jpg"
}
]
,"text": "In a separate bowl, whip the cream with an electric mixer until stiff but not grainy. Fold into the strawberry mixture. Spoon over the crust in the dish and spread evenly. Top with the remaining walnut mixture. Freeze for 6 hours, or overnight."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT390M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I got this recipe from a friend more than 25 years ago. The original recipe called for whipping the 2 cups of strawberries with the egg whites, sugar and lemon juice in step 2. It comes out a pretty pink and you don't see any strawberries. There's no problem cutting it when frozen. Can be done either way. You need a very large pan to combine the whipped cream with the strawberry mixture! It is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathi"
},
"reviewBody": "There is a very slight risk of salmonella infection from the raw egg whites used to make it. If you want to eliminate that risk completely, use pasteurized whites, which are available either dried or fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim B"
},
"reviewBody": "Wish I had read the reviews and mashed the strawberries. It's really difficult to eat frozen slices. Luckily I had chopped too many nuts, maybe an extra half a cup, and just threw them in. Didn't need extra butter or sugar. I also used pecans instead of walnuts (personal preference). It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Lash"
},
"reviewBody": "Will surely make this again. It was a big hit in the household. As others, we upped the crust by 50% and not having walnuts used toasted pecan with sea salt. Double yum. Also had no cream, but whipped up chilled whole evaporated milk. Definately a Keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mcooks"
},
"reviewBody": "There are 3 similar recipes for same thing, however HEAVY CREAM DOESN’t work! You have to use WHIPPING CREAM...BIG DIFFERENCE"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tatiana Kost"
},
"reviewBody": "I will make it again someday but I really like everything with it together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jean Myers"
},
"reviewBody": "TRe pan was to large and sweeter than I would have liked it. If I make this again I would prepare like said but cut down the sugar and place them in dessert bowls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tyrone Alston"
},
"reviewBody": "Too much work. Not able to successfully make. So many recipes here are excellent. Likely not make this again but it gave me ideas. I hope others enjoy it. did have good flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "golfbaker"
},
"reviewBody": "Great recipe for warm weather events. Received a similar recipe from my cousin and make it often in the summer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Willi Wilson"
},
"reviewBody": "I'm giving the recipe 3 stars for these reasons.\n* I made the recipe exactly as written and found that a 9x13 in pan is much too large. I ended up throwing the first batch away and down sized to an 8x8.\n* The chopped walnuts are much too large and hard to cut preventing you from making presentable portions. Much better ground up.\n* The strawberries sliced and frozen are also too hard to cut, and bite comfortably. I agree with other reviews. They should be ground up and incorporated into the cream and egg whites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "That's Good Stuff"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilcarpenterdude"
},
"reviewBody": "That's Good Stuff"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenda Davis Webb"
},
"reviewBody": "I have had this recipe forever and it is one of my all-time favorite go-to recipes. Everyone loves it and it is light and refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Save a lot of time and just use cool whip topping fold in frozen thawed strawberries and pour over your crust and freeze, absouluty delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flinner"
},
"reviewBody": "Our favorite summer time dessert! We now use Cool Whip instead of whipping up the heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grace"
},
"reviewBody": "No crusts at all! Just spread into a 9x 9 pan and froze. Delicious and fresh- no guilt! Making it again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nyah King"
},
"reviewBody": "Quick and easy to make. Good treat for the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Marie"
},
"reviewBody": "Delicious and was a big hit. Very easy to make. I was using a hand mixer and would change to my standup mixer next time. It took a long time for the meringue portion to get thick. I would also cut the strawberries smaller as the sliced were a tad hard when frozen. I also added some fresh on the finished dessert. I also cooked the crumble a bit longer to make it a bit crispier. 15 minutes didn't do it so it was more like 18-20. It's so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerri"
},
"reviewBody": "Everyone loved it! I only changed to pecans. Otherwise made it as the recipe said"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherry"
},
"reviewBody": "Winning recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BNNYBTT"
},
"reviewBody": "This was delicious. I did follow another readers suggestion and cut my strawberries in chunks. I also found if you let it sit out for about 20 mins it's much easier to cut and eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Taylor Thompson"
},
"reviewBody": "Didn't turn out at all like I thought it would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmandsk"
},
"reviewBody": "The original recipe is from Better Homes &amp; Gardens, September, 1987. That version (and this is how I make it) says to place the sugar, egg whites, sliced or chopped strawberries and lemon juice in a bowl and beat on high for @ 10 mins. Although it takes less time on a stand mixer, it will whip up nice and fluffy and the berries break up so there are no big chunks. Also, I've always made it using the entire crust mixture on the bottom of the pan, then put sliced berries on top of each serving. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bruce Mitchell"
},
"reviewBody": "This was very good but as with others reviews, not super crazy about the hard frozen strawberries. Maybe finely chopped or mashed would work better. Also had trouble getting the whites to firm up which would have helped with fluffiness. Definitely will try again with improved methodology though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "This was the most refreshing dessert I've had in a long time.. Received outstanding compliments about this at work. It was simple to prepare and assemble, great to make with my grand- daughter. I found eating it at a room temperature brought the taste of the strawberries out. Tried frozen and it seemed to need more sugar. Would be great to take to a BBQ this summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue bean"
},
"reviewBody": "I used to make something very similar to this, but my daughter in law says it's unsafe because of the uncooked egg whites. I have never been sick with it, and ate this since a little girl but now I have doubts serving it to anyone. Anyone have thoughts on this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan McDonald"
},
"reviewBody": "Use whipping cream, crust was great, I used crushed pecans, I increased the crust as others said and sliced strawberries thin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Made to recipe first time but blended strawberries. Next time instead of strawberries used tinned peaches &amp; fresh mango. Also exchanged walnuts for macadamias. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "this was an easy recipe that looked and tasted great. will definitely use it again for a party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEMEMEME"
},
"reviewBody": "It was delisios"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Easterngirl"
},
"reviewBody": "Thank you so much to all who left comments - they helped me get this perfect. So I increased the amount of crumb mixture a little; chopped strawberries then mashed them a bit. Saw that liquid was gathering in the bowl so just before I folded the strawberries I drained them. Used a little more whipped cream (by 1/4 cup, plus a little sugar) to lighten the mixture. It is a gorgeous, delicious, concoction. Didn't like that it took so many bowls but it was a hit with everyone. Glad I now know how to make a great crumb mixture. I'll use the leftover crumbs when serving plain ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diva"
},
"reviewBody": "Fantastic! EVERYONE raved! I make thicker walnut crust following OkinawanPrincess instructions in reviews. Froze in a smaller dish (8 1/2 x 8 1/2) so would have more filling. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luciagaldi"
},
"reviewBody": "I added more fruit. I added blueberries and raspberries. I chopped strawberries. Used whole berries for top instead of crust crumbs because it is ti sweet. Looks red white and blue"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MVYFL"
},
"reviewBody": "I used some of the suggestions I.e. cut sugar in half, mashed 3/4 of the berries with a potato masher, and used an 11x9 in. pan. Family and friends loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Clark"
},
"reviewBody": "Have been making this recipe for at least 35 years. My family always ask for this, spring, summer, fall or winter. I do mash the strawberries well and add 1 1/2 times the crust recipe ingredients.b An old favorite to be sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Koekje"
},
"reviewBody": "This was not tasty. The crust was bland and the strawberry taste got lost in the heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Ann Bovee"
},
"reviewBody": "These are fantastic, the only difference I did was chopping the strawberries due to others suggestions and we had no problem slicing them. Once individual serving were out we let them sit for 5-10 minutes so they softened a bit and were much more enjoyable! These are going to become a new summer treat for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Destiny Cooper"
},
"reviewBody": "LOVE it!!!!!like homemade ice cream cobbler... Super delicious- it's like a refreshing tangy slightly strawberry thin cobbler.\n \nThe only few things I would tweak is that it really doesn't make that much filling- I wanted/expected really thick bars- but its more like a thin even layer. Also I think it's not enough strawberries for me. Next time I will add more strawberries or some strawberry nectar. Also -I didn't get the pretty pale pink color others did; which kinda bummed me out. \n\nI took a couple other suggestions and diced the berries thin/small, cut down on the lemon juice and I increased the crust by 1/2. I definitely recommend at LEAST a 1/2 increase- since I had difficulty covering it with even that amount- but I also wanted a double crust or sandwich feel. If you just want a bottom and sprinkled top adding the extra 1/2 should work. I also added vanilla to my whipping cream and I really like the added flavor. \n\nAll in all next time I make it I will double the filling and double the crust and maybe even put in a smaller container. I think the 9 X 13 is not necessary. (but again I want thick filling) \n have fun with this recipe!!! oh and it's MESSY to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Paris"
},
"reviewBody": "Great recipe but I underestimated the time I needed to make it. Made the mistake of putting \"crust\" on a (too)small cookie sheet to bake - it took a lot of time and stirring to get it done right. Next time I'll find my biggest baking sheet or divide in two. Still not sure it ended up as intended, but it got a little brown and was crispy so I thought that was correct. You can't \"pat\" it in pan if you cook as I did (until it's crispy); however, I just dumped it in pan and evened it out and by the time we ate it, the filling had softened the crust up just perfectly. As far as the strawberry filling goes, I did chop the berries up and then I mashed about 2/3 of them into even smaller pieces. The rest I left as chopped &amp; added at end. I also had trouble with the egg whites/lemon mixture beating to stiff peaks with my portable mixer; took me at least 10 minutes. Finally, I took out about half of what I had beaten out of the bowl and added another egg white - that worked better. Then I just kept adding the first egg/lemon back in very slowly until I got soft peaks. Maybe next time I will beat the egg whites for awhile and add the lemon juice slowly towards the end. I did double the crust - good suggestion by someone else. Nice taste; really refreshing and worth the effort. I took it out of freezer about 10 minutes before serving - soft, but kept its shape and cut well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianneAZ"
},
"reviewBody": "I used to make this &amp; will again for a outdoor dinner party I am throwing in a couple of days. \nI just wanted to address the lady that she said she wouldn't make it because of the raw egg whites. \nI was concerned so I did some research. Salmonella only grows in the egg yolk and not the egg white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foxy"
},
"reviewBody": "Even my picky husband, whose greatest compliment on any food is \"that was okay\" pronounced this dish \"delicious.\" Made exactly as written, using Splenda brown sugar and Truvia white sugar baking mix, and substituting one 8 oz. tub of lite cool whip for the heavy cream. It was a hit at the big family Easter dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beautiful Baker"
},
"reviewBody": "My tastebuds love this delicious dessert! Anything strawberry has always been my favorite, but this recipe made me want to marry these frosty strawberry squares! I will definetly use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "I love anything strawberry so this was a WIN! A little cold on sensitive teeth, mash the strawberries well so you're not biting down on a big frozen chunk. So nice on a hot summer day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itascuis91"
},
"reviewBody": "Since it was my first time with this recipe and I was making it for company, I read all the reviews for advice. I blended the strawberries thoroughly before mixing with the meringue and cream. I also 1 1/2'd the crust, and in my estimation, I could easily have doubled it. These were delicious, and the walnut crust was perfect. Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CathyV"
},
"reviewBody": "We loved it- It reminded us of Good Humor's Strawberry Shortcake Bars. (One point- I didn't know from the picture that it needs a plate &amp; fork, I was originally looking for a bar.). I chopped the strawberries up as some suggested, but still felt that the icy strawberries against the sweet whipped topping could have been better. Next time I will mash the strawberries and add a little sweetener to them, and let sit, so that the tart /sweet is lessened.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robbie Hall"
},
"reviewBody": "I originally got this recipe from a lady at a church potluck about 35 years ago. We made it for years and then I lost my last copy of the recipe. I looked here on All-recipes just to see if there was something similar and found the exact recipe I had been using for years! I am so happy to have rediscovered it! I don't know of anyone who's tried it who doesn't just love it! I have given it away for years to people myself! But I use chopped almonds in place of the walnuts. We love it with almonds. I also use a partially thawed package of frozen sliced strawberries (15 oz) in place of fresh strawberries, whip them with the egg whites, and it works just as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "hhamilton"
},
"reviewBody": "This recipe did not impress me. It was good, but I have no usual desire to make it again or make it again with variations. I made it in a 9 x 9 pan, to have a thicker crust - 4 days ago - and there are still left overs in the freezer. Very odd in my house. We will move on and try other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dora"
},
"reviewBody": "I made this recipe for a potluck dinner we were going to two days later. I had to taste it to make sure it was ok for them but after that, I decided to make something else and keep this for us. It was so delicious and easy to make. I did decide to chop the strawberries instead of slicing them but I followed the recipe otherwise. I would also like a thicker crust--it was so tasty! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya S."
},
"reviewBody": "I brought this dessert to work and it was a hit all around, everyone loved it! I did modify the recipe a little based on my preferences and other reviews : increased 1 1/2 times the crust amount, mashed the strawberries and replaced walnuts with pecans. This will be my \"go-to\" recipe for summer. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This was really tasty and perfect for summer! A couple little changes: I don't like walnuts so I used pecans which were great. I also doubled the crust/topping and it was just the right amount for a 13x9 pan. Also from the reviews, I chopped the strawberries rather than sliced...A bit messy, but worth it! Even my 8 year old who won't eat anything that doesn't have chocolate gobbled it up! This one's a keeper, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "reinadelacocina"
},
"reviewBody": "These are yummy! I didn't have a 9x13, so I used a smaller pan and obviously my crust was plentiful. I followed the recipe to a T, and changed nothing. It was light, and just the right amount of sweetness, but I think personally it might have had a bit too much crust. I chopped my strawberries instead of slicing, and they came out great. Thanks for the recipe, will likely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "snappy25"
},
"reviewBody": "I haven't tried this recipe because I don't use raw egg whites in a recipe. It sounds good, but, I would be uneasy about serving it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie Collins"
},
"reviewBody": "This was very easy. Only thing I did differently was to add some rhubarb which I had cooked down a little first, with the strawberries. Have to use all that is growing in the garden :&gt;D. Very satisfying on a hot summer night! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Maggio Holliman"
},
"reviewBody": "My family loved these! They're great for any summer time get together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2dylan&morgan"
},
"reviewBody": "This is just like the strawberry fluff my mom made when I was growing up. Delicious and surprisingly easy to make. I didn't put any of the nut mixture on the top.... we just left it on the bottom. And we used pecans instead of walnuts. Great desert no matter which way you make it! :) Oh, I also let the strawberries thaw before I blended it in. That worked out so nice. I didn't have to cut them up beforehand. They blended in really nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "4.5\r\nstars. This is a very interesting and tasty dessert. I had no problems\r\nmaking it. Followed other people suggestions I sliced strawberries\r\nfiner. I used confectioners` sugar, so didn`t have a problem with the\r\nsugar dissolving and cut the sugar to 1/2 cup, because we didn`t like\r\ntoo sweet things. The crust itself is very tasty and compliments the\r\nfilling perfectly. The filling is good too. You can my this and keep in\r\na freezer as an ice cream. This dessert is like a great strawberry ice\r\ncream torte. Actually we liked the dessert but the reason I say just\r\n4.5 stars is that I am not sure the dessert will become a favorite in\r\nmy house. We, especially my mom, like, but don`t enjoy frozen desserts\r\n(except an ice cream). Althought this recipe would be a great thing for\r\na hot summertime weather (maybe I just chose not a right season and the\r\nweather to make it). But I will try this dessert in the summer and will\r\nhave it in my mind for an appropriate occassion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deeganmotox14"
},
"reviewBody": "This was an amazing recipe! I followed everything to the tee except for making 1&amp;1/2 of the crust. I feel as though you could even double the crust! \r\nMake sure that you whip the eggs and lemon long enough as well as the heavy cream, otherwise you will have a hard time with the dessert setting up. \r\nWill make over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BrittanyG"
},
"reviewBody": "just ok to me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OkinawanPrincess"
},
"reviewBody": "Absolutely delicious! I wanted a thicker crust so I increased 1 1/2 times the crust amount ( 1 1/2 c flour, 3/4 c br sugar, 3/4c chopped walnuts and 3/4 c butter). I finely chopped up 2 c. of fresh strawberries and sprinkled 1T of white sugar over the strawberries to help make it more sweeter and release its' red juices. When I folded the strawberry mixture into the whipped cream, its' juices made a pretty pink color. And when I poured the filling over the crust it made nice pink and white swirls throughout the filling. I froze this dessert for at least 8 hours before cutting into it. Once frozen solid I had no problem cutting into the squares. I placed a dollop of homemade whipped cream from this site,\"Sweetened Whipped Cream\". This dessert makes a pretty presentation with flecked strawberry bits in the pinkish hue filling. The strawberries are definitely sweet and juicy. The filling itself is light, fluffy and creamy. I like the crunchy toasted walnuts in the crust as well as the topping. It adds a nice texture to the dessert. It is not too sweet -just right. The crust ended up being the right amount for this size dessert and I am glad I increased the amount. We all enjoyed this cool and creamy dessert. Frozen whipped cream blended with chopped strawberries and topped with a crunchy walnut topping, is a refreshing and perfect way to end a hot, humid day here in Hawaii!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "declaba"
},
"reviewBody": "Followed the directions exactly and it came out great! I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAG'S MOM"
},
"reviewBody": "This was really good! One thing I did based on a review was to make 1 1/2 times the amount of the crust. While the crust is sooo yummy, it dominated the dish, so the next time I make it I think I'll make as written and see how it tastes. Also, I chopped the strawberries fine but they were still icy so next time I will mash them up. I have to give it 5 stars though because it's easy to make and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mom2bzlck"
},
"reviewBody": "Wonderful summer dessert...two changes I will make next time will be to chop or even mash the strawberries and to make a litte more crust. But overall very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOEYE"
},
"reviewBody": "We loved this recipe - added blueberries since we were going with the \"red, white and blue\" theme. So happy that no \"frozen whipped topping\" was an ingredient (never use the stuff) but instead the recipe called for real cream, not \"oil\". Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "The flavor of this dessert is fabulous. I followed the other reviewers’ advice and chopped my strawberries into small pieces, however the strawberries were still like little strawberry ice cubes which I didn’t care for. I would make it the next time by mashing the strawberries. But overall it is a delicious and refreshing summer dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larkspur"
},
"reviewBody": "I am shocked that so few people have tried this recipe...it is truly fantastic, and quite simple to put together. After reading the reviews, I made a couple of changes...I chopped up my two cups of sliced strawberries to make them finer, as one reviewer said that the sliced strawberries got very hard when frozen and made the dessert hard to cut. This was a great idea...the strawberry juices got into the fluffy mixture, turning it a pretty pale pink color. And I had no problems cutting the frozen dessert. Also, I cut the lemon juice to about 1 tsp.; I may add more next time, as the dessert was pretty sweet. I had a bit of a problem with the meringue portion, as my sugar didn't dissolve, no matter how much I whipped it. When I added the strawberries, though, the sugar dissolved just fine and the dessert came out fabulously well. My family absolutely loved it..the only complaint they had was that there should have been more crust. So next time I may make 1 1/2 times the crust portion, to make a thicker crust. Thanks for sharing this recipe...it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GoBadgers"
},
"reviewBody": "Loved the crust and the overall flavor, but even though I cut the strawberries into small pieces and let it sit out at least 15 minutes, they were still frozen hard. I might try mashing them next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wilma Laura Wiggins"
},
"reviewBody": "This was not so popular at my house. One comment was that the strawberries should have been chopped fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LivingWithTheEssentials"
},
"reviewBody": "Made this as a birthday treat for my husband. It was a hit and my first attempt to whip egg whites (easy after all:). I did chunk the strawberries so they would be easier to eat when frozen. Perfect for a hot summer day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl S."
},
"reviewBody": "I've been looking for this recipe for years! This is sooo good! Took about 9 hrs. to freeze well and I would add 1/4 or 1/2 T. less lemon juice next time. But still good as is if you like it more tart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FLNGRVE74"
},
"reviewBody": "This is delicious! Like another reviewer, I too will chop my strawberries next time instead of slicing them. Will just make it easier to eat and serve since they do harden. Really delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "The whole family enjoyed it!! Even though its a mess of dishes it was great. Everyone that tried it love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle"
},
"reviewBody": "I've loved this dessert since my mother started making it when I was a kid. The strawberry cream is relatively light and the crust is just delicious. We use pecans instead of walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy64"
},
"reviewBody": "I first learned of this recipe in Home Ec class when I was in High School! (aprox. 1980) We made it in class and I have made it every year for Christmas ever since!\nThe only thimg I do differently is I double the recipe for the crust because we love more of it and I put quite a bit of the crust mixture on top. I also add more strawberries and I beat the strawberries with the eggs and sugar. However, I save some bigger chunks to fold in with the whipping cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tizzylizz"
},
"reviewBody": "We really liked this, something a bit different to use with all the fresh strawberries coming into season. I didn't care for the large frozen strawberry slices, next time I will try chopping them smaller or mash them up a bit before adding to the cream."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/54788/frosty-strawberry-squares/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/54788/frosty-strawberry-squares/",
"name": "Frosty Strawberry Squares"
}
}
]
}
}
, "about": [
]
}
]