				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Game Day Bites"
,"datePublished": "2019-04-02T02:43:14.000-04:00"
,"dateModified": "2022-10-11T10:54:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kathy Bezemes Walstrom"
,"url": "https://www.allrecipes.com/cook/650"
}
]
,"description": "These game day bites are moist and cheesy miniature burgers. They will disappear quickly, so be prepared to make a second batch! Great for parties."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UXSS2LcmAaSGGNqfCsVcWC6FRoE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2020742-b47006ea2a9c40c488dc18313bc7ce9a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Game Day Bites"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "230"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "176 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "25 mg"
,"fiberContent": "1 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "327 mg"
,"sugarContent": "2 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound ground beef chuck",
"1 (8 ounce) package shredded Cheddar cheese",
"1 tablespoon mayonnaise",
"1 (1 ounce) package dry onion soup mix",
"24 (2 inch square) dinner rolls, split" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Thoroughly mix ground beef chuck, Cheddar cheese, mayonnaise, and dry onion soup mix in a medium bowl."
} ,{
"@type": "HowToStep"
,"text": "Spread even amounts of ground beef onto the bottom half of each roll. Place top halves on, forming little sandwiches. Place on a baking sheet or baking pan. Cover the pan tightly with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until meat is cooked through, 30 to 35 minutes."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Twitty"
},
"reviewBody": "Seasoned my ground chuck like I normally season my burgers so no need for dry onion soup as onion powder is a staple in my seasoning variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kenpo9"
},
"reviewBody": "These were so delicious its ridiculous. I put the meat mixture between two sheets of waxed paper and rolled to an eighth of an inch then cut into squares and put on Hawaiian sweet rolls. \nThanks to whoever posted this one. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ibscarry"
},
"reviewBody": "I made this by the recipe. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rondah"
},
"reviewBody": "Made these for my 16 year old and his buddies for super bowl. (No cheese). Used Hawaiian rolls. All 24 gone in 2 min, even with all the other food. Lol. Cooked 30 min. Update: this remains a crowd pleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "My family raved over this and insisted that these be in regular rotation. The flavor is great, I wish I'd cut the onion soup mix back by 1/4 but they were very good anyway. I only used 12 Sara Lee dinner rolls but kept the same amount of meat. They took about 10 minutes longer to cook through but I think the meat to bun ratio was good. About 5 minutes before they were done when I opened up the foil to check the temp of the burgers for doneness I brushed melted butter over the top buns and closed them back up again to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookingKate"
},
"reviewBody": "This recipe is a hit with a slight change in the cooking process. I gave the recipe 4 stars because as is the bottoms were very hard. To avoid this, we cook the burgers on a broiler pan with a shallow layer of water in the bottom part of the pan, just enough water to cover the bottom of the pan. Still wrap the burgers with aluminum foil tightly to seal in the moisture while cooking. This then allows the burgers to be steamed as a Krystal or White Castle burger is. Cook for 45-50 minutes. Allow to cool on the pan for 5-10 minutes uncovered. \n\nAlso, we use King's Hawaiian rolls and 90% lean ground beef. I have made this recipe at least 8 times using this method and its great. The meat is cooked thoroughly in the middle and the bottoms are still soft. It has been a hit at several football parties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chip Andrus"
},
"reviewBody": "I was surprised that you could put raw meat in buns, put them in the oven and not have a greasy mess. Well you don't have a mess with this recipe just good sliders."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bognardiaries"
},
"reviewBody": "This was delicious. The next time I make it, I will decrease the amount of onion soup mix because it ended up being very strong -still delicious, but strong. I also used a wedge of laughing cow cheese instead of the mayonnaise and that worked great. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blackbottomcupcake"
},
"reviewBody": "I followed the recipe w/the exception of the rolls (I used dinner rolls, cooked according to package). My rolls came out a little crispy, not soft, not sure why. Overall, they were delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary N"
},
"reviewBody": "This is a great recipe! My family loved it! I made them exactly as directed. The only problem was the rolls were too crispy on the bottom. I made sure they were tightly covered with foil. I did use a glass pan and that may have been a problem. Also, the meat was not cooked through at 30 minutes, so I did bake an extra 10 minutes. I know the meat was not too thick as I did not use more than the recipe required and I used the Savory Butter Hawaiian rolls. I did not use all the meat mixture. Next time I will be sure to use a metal pan and I may spread the meat out on a pan and cook separately. Even with the cr"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nana Jan"
},
"reviewBody": "EASY TASTY BUDGET FRIENDLY KID APPROVED \n\nDid a trial run for super bowl party, made to the recipe using 93% lean meat &amp; the Savory butter rolls. No water bath used and still no issues with the rolls. . And not soggy either! \n\n I actually mixed the meat on a paper plate and then divided up the meat mixture into equal parts and rolled each into a ball. then I flattened it with my palms to fit the rolls. (Used disposable kitchen gloves, I didn't want a lot of uncooked meat making dirty dishes/pizza cutters, etc. bit of a germ phobe I guess) \n\nHubby very happy with the results, going on the menu for the game. Three rolls wouldn't fit into the pan so I just wrapped them up in foil and baked that way. Came out great!!!!!!!!! No muss no fuss \n\nThanks very much Kathy!!!!\n\nUpdate 11/13/16: I have made these so many times this past year because of requests from family members who love them, that I have the recipe memorized. No better recommendation than that! Note, I ALWAYS make to the recipe, see comments above"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t-townmom"
},
"reviewBody": "These were a hit at my Sugar Bowl party. Everyone raved about them. Though I used all the same ingredients I did things a little different in the cooking. I did not want greasy soggy buns so I opted to press the meat mixture on a nonstick cookie sheet and bake at 350 for 25 min. When you see the amount of grease that comes from the meat mixture you will appreciate this extra step. There was a lot of grease! Then I cut the meat into squares and placed them on the buns. I covered with foil and placed back in the oven for about 10 min. This warmed the buns and everything came out perfect. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tyreenelson"
},
"reviewBody": "These are a party favorite! So easy and delicious, especially with Hawaiian sweet rolls as buns. Just don't forget to cover them in the oven - I did once and they were like little bricks! Still tasty though! Haha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stixx"
},
"reviewBody": "Awesome. like many reviews i use hawaiin rolls. i cut them in half and throw them in the oven on a tray with about 2 minutes left on the time. I use 85/15, 90 was too lean and changed the flavor for us too much. i use lipton onion soup mix. when i cook them i only use about 75% of recommended cheese and put it on the side after. to spice things up i take about 2 tablespoons of pickled jalepeño juice and 5 tablespoons of dices pickled jalepeños to the beef mix before cooking. i make 12 equal patties per the other ingredients suggested on the orignal recipie. after 20 min i pull out the tray a sprinle the remaining cheese on top of each pattie and place 1 pickled jalepeño on the top of each. it usually cooks perfectly at 23-24 min for our liking. after they come out i place a dill pickle slice on top of each as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big B"
},
"reviewBody": "I made the miniburgers exactly according to recipe, and they turned out surprisingly delicious! (I was very skeptical about raw meat on bun). And they were even better the next day warmed in microwave! I will make them again leaving out some of the onion soup mix. Also, it only made 12-I used potato dinner rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hollyclark78"
},
"reviewBody": "Huge hit at our Super Bowl party and so easy! We added ketchup and a pickle slice to some, buffalo sauce and blue cheese to some and left some plain... They were all awesome! Next time I want to try BBQ sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Pierre"
},
"reviewBody": "Very bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmberMarie"
},
"reviewBody": "I made these for the Super Bowl and the taste was great. The only thing I will change next time is to not bake them in the bun. The bottom of the buns got a little hard and my family likes them soft. Taste was amazing though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RosieCooks"
},
"reviewBody": "Total success!I premixed meat mixture night before. I did precook the meat in the oven for a few minutes (325 for 8 mins.). Assembled as directed and cooked as directed and out came these awesome sliders! Next time, I'll follow directions exactly. Weird how the bun didn't sog up the way I imagined it would. Used Martin Potato Slider Rolls, added pickles and ketchup. Tasted exactly like WC! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bgusler"
},
"reviewBody": "Decided to try this for a Super Bowl party I was going to. Made it just like the recipe says except I omitted the onion mix and used ranch seasoning mix instead. Soo good! They were a big hit. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MDUNNAVANT"
},
"reviewBody": "They're messy making them difficult finger food, but they are oh so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mr. drinky"
},
"reviewBody": "not bad. onion soup mix taste was really strong. i might try this again with no onion soup and spice it up myself to better suit our tastes.cooking time was bang on for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Forsee Schuler"
},
"reviewBody": "This was great, I didn't think one pound of beef would be enough, but it was and it was quick and easy. My family loved them. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lugmr"
},
"reviewBody": "I Read several reviews before making these and used a combination of tips. First rolled out beef mixture and baked on foil lined cookie sheet for 15 minutes. Next, I cut them in squares with a pizza cutter and placed on rolls. I used Hawaiian king rolls. Some thought these were to sweet but we liked them. I used a glass baking pan and covered them tightly with aluminum foil. Baked for additional 15 minutes. I have made them twice now and everyone loved them. They are not \"gourmet\", as some reviews criticized but are easy and tasty. Kids and husband loved them. \r\nYou can also use a leaner beef and less cheese to make them a little less fattening. Also, I used about 1.5 lbs of beef, a full packet of soup mix, and about 6 ounces of cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amyks510"
},
"reviewBody": "I really liked these. I'd maybe try a little less dry onion soup mix. Tasted a little over powering with the whole packet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "My husband really liked these, me not so much, but I think thats just due to personal tastes. I flattened burger mix onto a small cookie sheet and baked at 350 for 15-20 minutes. Then I cut the meat into square pieces to fit inside the buns. I used Sara Lee dinner rolls for the bread and baked the sadwiches for a few minutes in the buns. Pretty easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ToriRN"
},
"reviewBody": "Made these for Super Bowl party yesterday - they were a hit! Used 93% lean ground beef, they were not greasy at all. I did add more meat (about another 1/2 lb) to the one packet of soup mix and threw in some more cheese. I agree that one pkg for just 1 lb of meat would be too much. Used King Hawaiian rolls. Placed them in a low-sided pan so that there was no air space above the rolls, wrapped the foil tightly and they stayed nice and soft. Had the left overs for dinner tonight, heated in the micro wave they were still soft and yummy. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexi5288"
},
"reviewBody": "It was delicious even though I cooked them on the grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LEAH1976"
},
"reviewBody": "Turned out way better than I expected, the bottom of the roll wasnt greasy at all. I used Hawaiian rolls, and I wont do that next time, as it made them too sweet. Everyone loved them still, and this is such a different recipe than Im used to, with the raw meat going on the rolls like that. Im very pleasantly surprised!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "figgy"
},
"reviewBody": "Made these the other night using the recipe on here for dry onion soup mix in place of the packaged stuff. The flavor was good and buns were soft but the meat was hard and dry. Don't know why as I followed the recipe exactly. Maybe my oven was hotter? I may try again but not sure what to do differently to keep the meat from getting dried out as I want to be sure it's cooked thru too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "These are simple to make, easy on the budget, and a big hit with the everyone. \nWhat more can you ask for? \nI couldn’t find the buns listed in the recipe so I used regular hamburger buns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "These are wonderful! I used one package of Hawaiian Rolls (12), ground chuck, 2% cheddar cheese, light mayo, and the dry soup mix. I put 1/2 the recipe on one package of rolls, just as the recipe says to do. No soggy bottoms at all. I was a little concerned that they would be too oniony, but they weren't. Definitely a keeper! *** The next day, I wrapped one in a paper towel and warmed it up in the microwave. Still very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peach"
},
"reviewBody": "I follwed the recipe. I did based on other reviews place a pan of water on the rack under the bites while they were baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Geesey"
},
"reviewBody": "OMG! I made these for the first time for Superbowl Sunday and they are a HIT!! I could only find frozen Parker Rolls at the grocery store, so I let them rise and partially baked them (about 7 mins.), and then cut them in half. I used a tablespoon to measure out the meat mixture, then I rolled it and flattened it to the size of the rolls. I used a 9X13 baking pan and covered the rolls with foil, and then I covered the whole pan with foil and baked them for the time specified in Kathy's recipe. They were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coronagirl0828"
},
"reviewBody": "These were pretty good. The recipe was a little confusing when it came to the rolls though. I bought already baked dinner rolls and just cooked the meat on a griddle. I am assuming the recipe wanted you to buy frozen dinner rolls but I am not sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Topsail Girl"
},
"reviewBody": "I found if I use 90/10 or 97/3 ground beef the bites do not get too greasy. I also line a baking sheet with aluminum foil and place the bites on a wire rack and that also helps out I have made these bites probably hundreds of times in the past 5 or 6 years. Very easy and very yummy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Antona"
},
"reviewBody": "These are sooo good!I was a little scared of the raw meat going on the bun,thinking it would end up greasy but it didnt.I used 85% ground beef and Martins Potatoe party rolls,which come in a 24 pack.Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LizzieBearCooks"
},
"reviewBody": "I was impressed at how these turned out. They were very easy, and quite tasty. Despite many comments, I found that 1lb of meat was sufficient for 24 buns. I used dollar rolls, and a small scooper to portion out the meat, and the ratio was very good. I also found the cooking time needed to be more like 40 minutes. Definitely a good dish for a crowd!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "Super easy and inexpensive..every body loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cora"
},
"reviewBody": "This rolls were absolutely fabulous! So easy to make and they were all gone in no time. These are great for kids and adults also. Didn't really change a thing except I added just a little more mayo. Per other reviewers, I used a damp paper towel on top of the rolls. They came out perfectly. Thinking about trying them on the grill. Has anyone attempted this? Would be interested in knowing how they turned out. Great recipe - Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "favabeens"
},
"reviewBody": "This recipe is so good. Though I couldn't bring myself to put raw meat on the buns. Sarah Lee now makes mini buns and these worked great for me. At the suggestions of other reviewers, I pre-cooked the meat - flattened in a 13x9 pan - and baked for 8 mins. Then cut and put on the buns. SO GOOD! This is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "QUASINAUGHT"
},
"reviewBody": "Not that good. The meat tasted like mini meatloaves. The buns however where good. I liked the crispy bottoms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINGERLY88"
},
"reviewBody": "We love these! I could've sworn I had onion soup mix but couldn't find it so I just added minced dried onion. I also added a little salt &amp; pepper &amp; just put sliced american on top instead of cheddar. They taste like a cross between White Castle &amp; McD's little cheeseburgers. MMMmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KnitOn"
},
"reviewBody": "My son loves these so much! Now, when we have a house full of teenage boys, this is my \"go-to\" recipe. I even have guys asking me to make these...and offering to help! They are delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "Amazing!! I used the savory butter Hawaiian rolls. Just make the meat mixture, slap it on the rolls and bake, yum! No need to pre bake the rolls, use fresh not frozen and save yourself a step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jan C"
},
"reviewBody": "Flavors are there but it took twice as long for the meat to cook and even then we found a couple of super rare ones. Buns were dry on the edges and tasted almost burnt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aznaroses"
},
"reviewBody": "Amazingly good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carnyx58"
},
"reviewBody": "These burgers have an amazing flavor!!! I made them as sliders the first time and they turned out great, the only downfall was that the buns got hard quickly so the leftovers didn't taste as good. About a week ago I decided to see if the same recipe would work for regular hamburgers, and it surely did! I used probably about 3/4lb of ground beef and created the mixture by using low fat mayo instead of regular. I also didn't use the entire packet of onion soup mix because I was afraid of overdoing it. After making the mixture I made two patties and put them in the oven in a 8x8 pan with foil over top of them for the same time directed by the recipe. There was a ton of juices in the bottom of the pan which showed me how much the slider buns soak up. The burgers tasted great to me and my husband complimented me on them. I think they could have been a little more flavorful so I'm going to use more (probably all) of the onion soup mix next time around and I'm going to continue cooking them in the oven without rolls so I can get the least amount of fat per serving that is possible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HALFFINGR"
},
"reviewBody": "I took them to 2 different superbowl parties this year and they were a huge hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Peck"
},
"reviewBody": "I subbed 1.2 lb of ground turkey, 2% shredded cheddar cheese, and baked in a 9x13 pan before I cut with a pizza cutter and served on dinner rolls. They went over very well when I served them for dinner and when I took them to a Super Bowl party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Disneymom"
},
"reviewBody": "Very good sliders! I made them for the Super Bowl and they were a hit! My husband took the leftovers to the office and he said that they heated up well in the microwave. The next time I make them I will decrease the onion mix. We are not big onion eaters, though! I took the suggestions of other members and rolled the beef mixture onto a cutting board and then cut perfect squares. I then placed the sliders on the top portion of a broiler pan (completely covered in aluminum foil) and placed it on top of the bottom pan that I had filled with water. I tightly covered the sliders and baked them in a gas oven for 35-40 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Larese"
},
"reviewBody": "Followed the recipe exactly, but added a water bath below pan. Some reviews suggested adding a moist paper towel on top of rolls before baking. I will do this next time, as the tops of the buns were kind of crispy. Overall, a delicious recipe that was simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Alexander"
},
"reviewBody": "I lived in Brooklyn years ago, just down the street from a White Castle. I never understood the appeal of their steamed sliders, I always thought they were slimy &amp; gross. So I hesitated when I saw others comparing this recipe to the white castle version. I just made this yesterday (for the Super Bowl, yes!) and luckily it turned out delicious. The flavor is definitely very onion-y. I happen to love that, but I would cut back a bit on the soup mix if you don't love onion. As suggested in the recipe, I cooked this in the pan that the mini rolls came with. I used a pound of beef for only 12 buns so my burgers came out thicker, and I had to cook them longer. The buns were perfectly crispy yet soft inside. I added a lot more cheese. The texture of the meat ends up soft - a lot like meatloaf, so it can be hard to tell when it's cooked all the way through. This was a big hit with my husband. A genius way to cook mini burgers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lydmarie"
},
"reviewBody": "These are delicious and not at all soggy. I placed a damp paper towel on the top buns before wrapping in silver foil as another person suggested. The bottom buns were actually crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Johnson"
},
"reviewBody": "Closest recipe I've found to white castle, big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "The only rolls I could find in the store were the aunt millies. They are about double the size so there are only 12. The flavor was great, just like those famous mini burgers. I put a water bath in the oven to try to prevent the rolls from getting to done, but they still were a little hard. I think next time I will cook for a few minutes less as the meat was plenty done enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jogoose"
},
"reviewBody": "Fantastic. My sister made these for our group and everyone loved them. So easy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "yummy!!! I couldn't find the frozen rolls so I used the brown and serve rolls. SO YUMMY and cute!! I can't wait to make again ~ very easy to make!! A big hit for football sunday!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Imma Cookn"
},
"reviewBody": "Yum o! These little burgers taste just like White Castle sliders. Great recipe. I made the recipe exactly as written and it came out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne barry"
},
"reviewBody": "These are very good, although they do of course turn out extremely greasy...delicious though, and I was able to save them for a few days afterward in the fridge for lunches and snacks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NEENEE265"
},
"reviewBody": "Very good! I also cooked the meat first on a 9x13 pan, because speading raw meat on buns sounded kind of gross. But the flavor of these was so good! I followed other reviewers and used hot dog buns cut in thirds (that way I didn't even have to go to the store, I had everything on hand) It wasn't too much onion soup mix for us, but I did have about 1 1/2 pounds of meat. Great recipe, so easy and delicious, I will make these often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VALROMO1"
},
"reviewBody": "I followed recipe other than my cheese being mozzarella simply because that is all I had. These really did taste like white castles. Even the heart burn later :). My rolls came in an aluminum tray so I assembled in the tray and wrapped the entire tray in heavy duty aluminum foil. Baked for 30, my buns were perfect and my meat was cooked. Family loved them. I will make these again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "POLARBEE"
},
"reviewBody": "These were really excellent! The bottom of the rolls (I used Hawaiian butter ones) did get a little crispy so next time I'll put them in a water bath. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne34z"
},
"reviewBody": "Very good. My kids love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tclaycomb"
},
"reviewBody": "These are so good! I did cut back a little on the onion soup mix as well and added a tiny bit more cheese...You can't make enough of these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "These were a huge dissapointment. There was hardly any flavor and the bread just overwhelmed any meat flavor there might have been. I only made 14 (instead of 24 as the recipe calls for) and it was still tasteless. Will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kking206"
},
"reviewBody": "Amazing! a much easier way to make sliders! the onion soup mix is way too much though...cut it in half or even a quarter. a shake or two of some dried minced onion doesn't hurt either! i also spread some dill pickle relish on a few! yummy! will make over and over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLIE101"
},
"reviewBody": "Awesome! Mixed ground chuck, mayo, Lipton onion soup mix, and shredded cheddar, pressed in a 9x13 pan and baked on 350 for about 20 min. Then used a pizza cutter to cut the meat into squares. Added to Sara Lee dinner rolls, wrapped in foil and \"steamed\" in oven for about 8 minutes. Added a dill chip and a squirt of mustard and voila! The whole family loved them. Really easy to prepare too. Will be making these again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueandBob Butler"
},
"reviewBody": "WOW, these are awesome, i followed others suggestions and pressed and pre cooked hamburger mixture into 9x13 pan, cooked at 350 for 25 minutes then cut into 18 squares (because they shrank so much) i used 1.19 lbs of ground round and followed the original directions for 8 oz shredded cheddar and 1 pkg dry onion soup mix and TBS mayo . after the meat mixture was cooked and cut i split the rolls and placed the square piece of hamburger into the rolls. and then wrapped the whole bunch of them in double wrapped tin foil and placed them back in oven at 250 to warm and steam the rolls.. the only problem is they stuck a bit to the bottom of the tin foil.. the taste was amazing served them with baked french fries II"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "THE HOOVE"
},
"reviewBody": "The kids thought it was okay. Husband saw me putting raw meat on buns, then putting it in the oven and would not eat it. It does not match the burger king mini burgers like I had hopes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MImom"
},
"reviewBody": "This was a fun idea for a week night meal for our family. I used Sara Lee dinner rolls and ground round. We weren't crazy about the sogginess of the buns from the grease of the meat and may cook meat first next time. Used another reviewers idea for placing damp paper towel over buns to keep them for getting overly dry on their tops. This worked great. Overall fun idea for a recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meleana"
},
"reviewBody": "These were awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bferris19"
},
"reviewBody": "Taste is right on with these, but I didn't have the courage to spread the meat mixture directly onto the buns in a raw state (I have a 3 yr old.) I precooked it for like ten minutes beforehand. Here's the secret White Castle addition I added - mix a small bottle of strained Veal Baby Food into the meat mixture -- yup, believe it or not! The buns are important in this recipe too - I think the best option is cheap store brand hot dog buns cut into thirds, personally. I got some nice mini kaisers from the bakery but they were just too bready and not authentic. Great recipe idea though - thank you for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RAH"
},
"reviewBody": "They turned out a little soggy for me, but I think I did something wrong. Will definatly try them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fancybroad"
},
"reviewBody": "My hubby and kids love these little burgers. I do use the wet paper towel on top that other reviews suggested and using a 9x13 pan to pat out the meat and cut into even squares is great. I usually use ground turkey and 1/2 pack of of the soup mix, but do add some of my homemade bbq sauce or A1 to the mix. these reheat great in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Branning Burek"
},
"reviewBody": "Followed the recipe to the T. My husband was in heaven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "heidird"
},
"reviewBody": "Love the idea, but not crazy about the flavor of the burger. Have never been to White Castle, maybe they are supposed to taste this way. The recipe though did work great--used a very lean beef so no greasy buns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessitlv"
},
"reviewBody": "I used the whole pack of seasoning and it was not too strong at all. I actually thought they could have used more salt. I bought 2 packs of Sarah Lee dinner rolls, they came in packs of 12 rolls. The rolls are all attached together so I split them into bunches of 6 rolls stuck together. I sliced the tops off each bunch of 6 rolls and put the bottom parts into the baking dish. I divided the meat up into 4 parts and plopped it down on each section of rolls. Then I spread the meat out so it covered all the bottoms. Topped them, covered with foil and cooked 35 minutes. They came apart easy because the rolls were already divided I just had to pull them apart a little. The bread was soft, not soggy and the meat was perfectly cooked. The way I made them was quick and easy with no mess. The kids loved these mini burgers with chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1SWILSON"
},
"reviewBody": "I really like this recipe. I did not mind the rolls being a little \"crispy\" on top. We added more mayo after they were done. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MELISSA39"
},
"reviewBody": "The taste was great! The only problem was the buns came out a bit too hard. I think next time I'll roll out the meat, cut into squares and bake covered as directed. Then just warm the rolls up a little at the end. Will definitely make again---thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Better with turkey and worchestshire sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laura Godwin"
},
"reviewBody": "these were not so good, ok but the rolls got hard and i had to add my own sauce so they weren't so dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susabelle"
},
"reviewBody": "Need to figure out how to make the buns soft, not cripsy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marym"
},
"reviewBody": "I did not have the dry onion soup mix so I used a 3/4 of a can of condensed campbells french onion soup, added it the meat mixture. Recommend the sweet hawiian rolls for sure! This is a great recipe and good for entertaining."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cari"
},
"reviewBody": "These were awesome!!! They tasted almost exactly like White Castle!! They were perfect for the Superbowl! I used Hawaiian butter rolls...great! I followed the recipe to a tee and it is just perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkthecook"
},
"reviewBody": "I tried these 3 ways, prebaking the buns a bit, not baking them, and not baking whole wheat buns! Just to see....They all came out great, and the gang actually prefered the unbaked bun variety, less work for me! Made the meat mixture just as directed. A delicious, fun recipe! If you have teenage boys gaming at your house this should be a staple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried these 3 ways, prebaking the buns a bit, not baking them, and not baking whole wheat buns! Just to see....They all came out great, and the gang actually prefered the unbaked bun variety, less work for me! Made the meat mixture just as directed. A delicious, fun recipe! If you have teenage boys gaming at your house this should be a staple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sweet t 528"
},
"reviewBody": "Very tasty burgers. I used a whole packet of beefy onion soup mix - didn't taste too oniony for us. I cooked the meat patties on a cookie sheet covered in foil for about 30 minutes. ALOT of grease came out of the burgers, so the buns would have been soaked had I done it that way. The grocery store was out of dinner rolls, so I actually used mini bagels - and they tasted very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gene W"
},
"reviewBody": "Maybe I'm doing something wrong, but I was incredulous immediately when I read this recipe. As I foresaw the bottom bun because soaked in grease, the top bun was over cooked and hard and the meat was gray and unappetizing looking. The taste was fine. I followed the recipe exactly and covered it tightly with thick aluminum foil. I did this recipe a second time and just fried them in a ribbed frying pan and warmed the buns in the toaster oven. They were great. Gene"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mduffy2"
},
"reviewBody": "These were good but mostly just tasted like onion soup mix. It's important to not use more that 1 lb. of hamburger. The package I had was 1 1/2 lbs. which added an extra half hour to the cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thompsonkristib"
},
"reviewBody": "This is my first review I have ever done.... I absolutely loved these. I used Hawaiian Savory Butter rolls as one had suggested. I also baked the meat separately on a cookie sheet as another had advised and then cut the meat with a pizza roller and distributed onto the buns. A pound of beef was not enough for my 24 rolls. I will use more meat next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "agolden"
},
"reviewBody": "These were a hit at our Super Bowl gathering. I used ground turkey breast, which can be dry, so I added another tbsp of mayo to the mixture. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPA"
},
"reviewBody": "I was very reluctant to put raw meat in the buns and then put in the oven. It turned out superb. I left out the cheese and the mayo. It wasn't missed. They went very quickly. A 1/2 pound of ground chuck from Whole Foods was enough for the 12 mini/slider buns I bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nancyakron"
},
"reviewBody": "I made this recipe as written. The bottom bun was soggy and I used 92% beef. We ate them as open faced sandwiches, the meat was delicious and I cooked them for 40 minutes, so do others eat them soggy?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLW1989"
},
"reviewBody": "I didn't change a thing and my whole group gobbled them up with rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Duckworth"
},
"reviewBody": "Wonderful. These are just too cute and go down easy. All liked them. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nenna"
},
"reviewBody": "I thought this was great. My five kids agreed. Since Onion Soup mix has MSG, I used dried onion and salt instead ( you could always use seasoning salt). I also used the Earth Grains Thin Buns for lower carbs. They were delicious as there is not much dough to get soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOMARTIN"
},
"reviewBody": "Got to have a dill chip on them and I will cut back on the onion soup next time...maybe only half an envelope."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy C."
},
"reviewBody": "have made these 3 times, always turn out good. I use Sara Lee dinner rolls, will try the Hawian next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25511/game-day-bites/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1235/appetizers-and-snacks/meat-and-poultry/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25511/game-day-bites/",
"name": "Game Day Bites"
}
}
]
}
}
, "about": [
]
}
]