				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Garlic Scape Pesto"
,"datePublished": "2019-07-10T03:01:47.000-04:00"
,"dateModified": "2022-11-22T17:38:19.000-05:00"
,"author": [
{"@type": "Person"
,"name": "amandajo"
,"url": "https://www.allrecipes.com/cook/3323710"
}
]
,"description": "A fresh garlic scapes pesto recipe. Garlic scapes are perfect for an easy, fragrant pesto to spread on bread or crackers, mixed with pasta, and more."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gqs-O5UjhmlK-YGoqXsIxgnb2RY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9261594-a06f4a00720c46e393b0e2eb35091eac.jpg",
"height": 1499,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Garlic Scape Pesto"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "65"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "108 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "3 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "58 mg"
,"sugarContent": "0 g"
,"fatContent": "9 g"
,"servingSize": "3 1/2 cups"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound garlic scapes, cut into 2-inch pieces",
"1.25 cups grated Parmesan cheese",
"1 cup olive oil",
"1 tablespoon lemon juice",
"ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Blend garlic scapes, Parmesan cheese, olive oil, lemon juice, and pepper together in a food processor until smooth."
} ]
,"recipeYield": ["28"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2p2qdrphqs"
},
"reviewBody": "I used 4 cups chopped scapes &amp; blanched for 30 seconds, added about 1/2 cup pine nuts &amp; a teaspoon of Himalayan salt,OMG. I can’t stop taste testing,delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie-Paule"
},
"reviewBody": "This, my first time at growing garlic &amp; making pesto was wonderful! Very easy and adaptable recipe. I added walnuts, more olive oil and lemon juice to taste. Make sure to harvest the scapes when still soft &amp; use the tender parts of the scape to make a smooth pesto. I used as a spread, also added to sautéed mushrooms &amp; pasta salad recipe. Would also make an awesome garlic bread. I made 1/2 recipe &amp; froze half of that for future use in muffin cups. Definitely a keeper. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denis Gadwa"
},
"reviewBody": "Great way to use the scapes from the garden. I added roasted salted pumpkin seeds for the nutrition and texture.\nTurned out nicely. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Animal"
},
"reviewBody": "I always have scapes and don't know what to do with them. I am glad I found this recipe! I couldn't find pine nuts so substituted slivered almonds. After reading all the reviews, I couldn't decide whether to blanch or not so I went with a happy medium and poured boiling water over them. It turned out great! So easy to make and I can't wait to use. I will also freeze some in jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sher"
},
"reviewBody": "I never knew what to do with scapes, but when a friend gave me some today, I tried this recipe!! Yummy!! And so darned easy!! Definitely for the garlic lover (which I am!!). The only change I made was I threw in a handful of pine nuts that were languishing in the pantry. Now I’ll look forward to “scape season!” Thanks, amandajo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mermie"
},
"reviewBody": "smells and looks as great as tastes. I don't have a big food processor, so I pureed in small batches and brought all together. It's easy and wonderful. goes with everything. wondering how to preserve it, I made so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clint and Joana Murphy"
},
"reviewBody": "Yum! Wow. This is the first time I’ve ever used garlic scapes, and this is the perfect recipe to use to be able to fully appreciate their flavor. I got them in a mixed box of produce, and I wasn’t sure what to do with them. The simplicity of this recipe won me over, and the flavor is outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Heldron"
},
"reviewBody": "My boyfriend was at the neighbor’s house and told him how much I enjoy cooking, so he sent a box full of scapes over. Today is my first official day of summer vacation, so what better places to be than outside in the garden and then in the kitchen! Although I’d never done anything with scapes before, I am always up for trying something new and I sure do love garlic and pesto! I am very happy with this simple, yet delicious, recipe! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "I will make it again! I wish I had found this recipe before I tried what the Farmers Market lady told me as it took over 30 minutes to prepare, pieces were larger and made 2x the quantity I was looking for. Happy to have friends who enjoy pesto. This is 1st time I have tried garlic pesto but it will be awhile before I use it all up, next time I will look at this recipe BEFORE I start"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen McNeil"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Elk"
},
"reviewBody": "My 15-yr old said this was his favorite homemade pasta dish he had every eaten. I did modify it because I was worried the raw scapes would be too garlicky. \n\nHere's what I did:\n\nFirst, I trimmed off the flowers and blanched the scapes in a big pot of boiling water. \n\nThen, I strained the scapes and blended them as directed but added 1/4 cup pine nuts (for a half recipe, double for full). \n\nI reused the boiling water to make the pasta. \n\nFinally, freshly shaved parmesan on top.\n\nEveryone ate it up, even my 10-yr old. Better than basil pesto in my son's opinion!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RT Wellman"
},
"reviewBody": "Great, easy recipe. When I used some Asiago to supplement the Parmesan, the pesto needed some salt. I added a teaspoon of miso and...Wow, fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna D."
},
"reviewBody": "I am not a big steak fan, but my husband is. When I found myself with garlic scapes in a CSA box in 2017, I tried this recipe. I liked it so much, I bought bunches of scapes, made several batches and froze it in individual servings to use the rest of the summer and fall. So good and flavorful. Somehow one batch ended up very peppery, so I needed to watch it carefully when I made the 2018 supply."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "9hbeans"
},
"reviewBody": "This was great! I halved the ingredients as I only had abt 10 oz. of scapes. Next time I would use a little more care to not add the tougher part of the scape as the texture was a little firmer than regular pesto and I would definitely add toasted slivered almonds, walnuts or pine nuts! \n\nI’ve always grown a lot of basil and I’ve been intimidated to make pesto. This was my first try and I would easily and confidently use this as a basic recipe for basil pesto it turned out so well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Viki"
},
"reviewBody": "Hubby loved it! Nice way to use up scapes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolynCooks"
},
"reviewBody": "Freshly picked, young scapes are tender. If they are tough than they were not picked at the right time, or they sat around too long! I personally like to add fresh herbs to this but this is a good basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Cuthbert"
},
"reviewBody": "OMG! I made it for tomorrow nights dinner frenzy with friends, but have to have some on pasta right now for lunch - SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susie Q"
},
"reviewBody": "Amazing stuff! It almost blew my head off! I mixed it with a bit of mayo and that smoothed it out...a little! Then I added it to linguini and it was fabulous! The heat had disparate and it was easy to take."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny Slater"
},
"reviewBody": "Woohoo! Way too strong for me, my eyes water?? I used it as a pasta sauce cut heavily with 10% cream, about 6:1 ratio"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coreo"
},
"reviewBody": "SO GOOD! I didnt quite have a pound of scapes so I added in a couple handfuls of spinach and basil to supplement. Added walnuts and lemon... absolutely delicious!! Cant wait for the rest of my scapes to come in!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Snugs"
},
"reviewBody": "I made this and put it over linguine pasta. I LOVE garlic but this was so strong that I couldn't finish it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deidre Hufnagel"
},
"reviewBody": "I made this last year with a different recipe and it didn't turn out as well. This is a super easy recipe and turns out fantastic. I did blanch the scapes last night to make it less \"stringy\" and that helped a lot. If you have friends or family with garlic make sure to snap those tops off and use them. Can't wait to use this tonight as a simple pesto sauce on pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time I bought a bunch of garlic scrapes. Yum! I halved the recipe as there was only one bunch. It mad two 1/2 cup containers. One I froze, the other I will bring to serve with pita chips as an appetizer for a party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libby Hill"
},
"reviewBody": "This is a terrific recipe for garlic scapes. We make a dip with this pesto, mayo, sour cream and turmeric. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Tibbitts"
},
"reviewBody": "I have now tasted it and its not bad. Its just that my spices were overdone waiting for it to thicken which it didn't even a little bit. Not sure why. Ill always use lemon and butter for fish but I don't think this works so well and needs tweaking. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkerish"
},
"reviewBody": "Easy and soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Stemwedel"
},
"reviewBody": "Whatever you do, don't blanch the scapes! I tried it and it killed the garlic flavor. I made another batch, following the recipe. Much better! It really does need salt though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Herman"
},
"reviewBody": "This is killer! Don't change it at all. Good God my house smells good and so many uses for this pesto as is! Smelling it gets your ideas a rolling....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dean Deutscher"
},
"reviewBody": "Very good way to use the few scapes I get each year. I use it on pasta as well as a condiment on sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snydersb"
},
"reviewBody": "My sister and I look forward to mid-June in Maryland \nevery year when we can harvest or purchase scapes. I used fresh large flakes of parmesan, pine nuts (1/4 cup) and plenty of salt and an extra 1/2 cup olive oil (in addition to the recipe). To make the scapes more tender for chopping in the blender, I blanched them - bring a large pot of water to boil, dump in scapes and let sit for 4 minutes or so. Drain and dunk them in water with lots of ice cubes. Drain after about 2 minutes. The scapes will be lots easier to chop and process. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta Burkhart Polak"
},
"reviewBody": "I love this recipe. I use the pesto as a base for my homemade greek pizza. It is to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IvorySoapGirl"
},
"reviewBody": "This is a great basic recipe for scape pesto. I've made it as is and sometimes added pine nuts or walnuts and sometimes added basil to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brittca"
},
"reviewBody": "I made this garlic scape pesto the first time exactly as described (delicious, but lots of garlic) and so the second time I blanched the garlic scapes before adding them and I love it even more! Blanching seems to cut the harshness of the garlic just enough and it makes the pesto texture resemble a more traditional basil pesto. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Hogan"
},
"reviewBody": "Excellent and simple recipe. I had about half the amount of garlic scapes so I reduced the recipe such. Came out perfectly. Now I want to put it on everything even though it'll give you some garlic breath. :-). This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjanep"
},
"reviewBody": "Great recipe, make a great dip by mixing this with cream cheese - lovely color, and the cream cheese cuts a bit of the intensity of the garlic. Yummy on pita chips, veggies, spread on crusty warm bread - pretty much anything savory!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Payne"
},
"reviewBody": "Not a fan of the spread or substitute for pesto BUT garlic scape is what sends my salad dressing recipe over the edge.\nOlive oil,balsamic,salt,soy sauce,grey poupon,Ts yogurt and Ts garlic scape.......enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alidanui"
},
"reviewBody": "No changes. Great on grilled Halibut, or really, on anything"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nap2"
},
"reviewBody": "It's very good but I would suggest the following:\nMake half the recipe to start. The sharpness of garlic scapes is not for everyone.\nAdd 1/2 cup walnuts to the full recipe, 1/4 to half recipe. This will help mellow the sharpness.\nIf you have ample scapes, use just the most tender parts of the garlic scape from the tip to just below the flower bud.\nCut the scapes into 1/2 inch pieces; the scapes are very stringy and will otherwise get caught in the processor blades. Add cut scapes to the processor gradually rather than all at once.\n\nThat said, the recipe worked for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Stelling"
},
"reviewBody": "Super Easy. Tasty and flexible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thyme2eat"
},
"reviewBody": "Fantastic. Completely subbed as a lower fat, much more flavor substitute for mayo on sandwiches. Great with pasta. I only wish I had made more than a pint. Next season, I will definitely make much more and freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Birthrightrose"
},
"reviewBody": "I loved this! We spread it on bagel chips and topped it with smoked salmon. It was a hit at the party we went to, and I'll make it again for sure! The scapes need to be chopped finely before being put into the food processor. I cut them into 2\" pieces, but should have chopped them much more. I added the juice of a whole lemon. To make the pesto more smooth I ended up scraping the batch into my blender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Elisabeth Nimtzmeyer"
},
"reviewBody": "The texture was chunky, which I expected and could have dealt with had the flavor been worth a hoot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "2ys4you"
},
"reviewBody": "I have to admit, this recipe wasn't my favorite. I had never used garlic scapes before, and I doubt I will again. Scapes are quite tough and the resulting purée remained slightly chunky, even with additional olive oil. I served the pesto over spaghetti and had to eat some of it on toasted baguette to cut the intensity. It's REALLY garlicky and super strong. I think it might be good if you turned it into a cream sauce or added it to other dishes as a garlic replacement, but as a straight-up pesto, I'm not a fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "This was delicious and easy. I left out the lemon juice and took someone else's idea and added sundried tomatoes. Great use of the scapes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "organicmom"
},
"reviewBody": "Like others I was looking for a recipe to use garlic scapes from our summer CSA. This was a real hit with my two year old and I. My husband felt it was a little bland (what?). I did cut the flower tops off the scapes and only used the greens. I followed the recipe as stated. I served over penne pasta and cut up chicken breast. Seemed to yield about three cups. I only used one with one pound of pasta. I divided the remaining pesto into one cup servings and froze. I will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mam5016"
},
"reviewBody": "This was very good and a very easy way to use up the garlic scapes from my CSA. I added sunflower seeds b/c I like the pine nuts in my usual basil pesto and wanted something similar in this. It came out delicious, was easy to make, and went very well over whole wheat pasta with some turkey meatballs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "noelstar7"
},
"reviewBody": "This pesto is amazing as a base for a veggie pizza, in a grilled cheese, as a dip for bread, added to hummus....pretty much anything I've tried it on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooky"
},
"reviewBody": "Garlic lovers, this is the recipe for you! Follow it exactly as it is written. We have always made the traditional pesto with basil, parsley and pinenuts; we won't be making that anymore. This recipe far surpasses any pesto we have ever had. We had enough scapes to make 2 1/2 batches and all are tucked away in the freezer where many will be given as Christmas gifts. We used fresh lemon juice as some people are allergic to sulfites that are contained in bottled juice; and a lovely black Malabar pepper. Thanks to whomever came up with this recipe. June 2014; a year later. Just cut the scapes and starting this pesto. I froze what we didnt use last summer in cute little jars and gave them as Christmas presents and birthday gifts throughout the year. Everyone has requested that they be repeated this year. Guess we will have to grow more garlic to satisfy everyone. 2016 - grew MORE garlic; might need to go into business. Great stuff! 2019 giving scapes away; over 600 garlic bulbs. Have shared scapes and this recipe numerous times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fisherwoman"
},
"reviewBody": "I deliberately didn't read the reviews until I had made it exactly as the recipe dictates. WOW! Now I might experiment, but the original recipe is just great~!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamaterrig"
},
"reviewBody": "This was a good jumping off place for garlic scapes I received in CSA since I never used them before. I added some pine nuts and feel like it needed a little salt. I winged the amounts of the ingredients and ended up with 3 cups of pesto. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "patricia"
},
"reviewBody": "Very Very garlicky, added sum dried tomatoes. Heard you can blanch the scapes for a less garlicky taste. Freezes well.Yes, blanching decreases that strong garlic flavor, also add some basil , roasted almonds and parmesan (lufa recipe) yum, yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy McSprouts Couillard"
},
"reviewBody": "I loved this recipe!! I ended up adding about 1/4 cup of walnuts and a little more oil and cheese. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Krieg Boll"
},
"reviewBody": "Delicious! I would grow garlic just for the scapes! Like others, I added walnuts. I freeze in 4 ounce containers to eat in the winter. I searched all the local farm markets for scapes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryd"
},
"reviewBody": "This is incredibly easy and so delicious. Great as a dip. Though I can't wait to serve it on grilled pork loin chops. So fresh tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KitchenDiva"
},
"reviewBody": "Incredible pesto--I made several large batches and froze them--they thaw just beautifully. GREAT for having with pasta dishes or just spread on fresh, warm bread in the winter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmweisberger"
},
"reviewBody": "I LOVE garlic scape pesto. So much, that this is my first reveiw! I made this recipe, though I was not exact about the measurements, as I just used all the garlic scapes I had. I don't think you can go wrong--but it's spicy, in the garlicky way! If it's to spicy for you, you can blanch the garlic scapes first. Also, this keeps in the freezer. I put it in 8 oz canning jars, filled 1/2 from top and freeze..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DITTYBEAR"
},
"reviewBody": "I agree that it has a different texture than basil pesto. It was good on pasta and I also mixed a little into some chicken salad. It kept covered in the fridge for several days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Bradford"
},
"reviewBody": "It has a different texture than basil pesto but the flavor was good. I added chopped walnuts. Did'nt have pinenuts"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/199868/garlic-scape-pesto/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/496/side-dish/sauces-and-condiments/sauces/pasta-sauces/",
"name": "Pasta Sauces"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/199868/garlic-scape-pesto/",
"name": "Garlic Scape Pesto"
}
}
]
}
}
, "about": [
]
}
]