				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Georgia Cracker Salad"
,"datePublished": "2018-06-08T09:26:40.000-04:00"
,"dateModified": "2018-06-08T09:26:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "CHEAPMARYHUNT"
,"url": "https://www.allrecipes.com/cook/1315563"
}
]
,"description": "Crackers are tossed with tomato, egg and green onion in the quick mayonnaise salad. This is a traditional Southern salad. Best if eaten immediately upon preparing."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yRvIjYx4HO55fGjCc1xey9sjVPk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1635715-d4d4cf4003de44eea5a5d7f3cf722c44.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Georgia Cracker Salad"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "27"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "769 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "84 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "853 mg"
,"sugarContent": "3 g"
,"fatContent": "71 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT12M"
,"recipeIngredient": [
"1 (4 ounce) packet saltine crackers",
"1 large tomato, chopped",
"3 green onions, finely chopped",
"1.5 cups mayonnaise",
"1 hard-cooked egg, chopped",
"salt and freshly ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Coarsely crumble the saltines into a medium bowl. Mix in the tomato, onions and mayonnaise. Stir in the hard-cooked egg, and season with salt and pepper."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT22M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe really surprised me. I did use grape tomatoes and placed a scoop on fresh spinach. Made it more eye appealing . Did not add salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "One of my favorite things about this site is finding recipes that sound so “out there” from what you know of that you can’t help but want to try and see if the rating and reviews really stands the test. It does!! This recipe is also very versatile. I made as-is except I added a second Roma tomato and 1/2c shredded cheddar cheese and reduced the Mayo to 1c. However I could see if you add more veggies (sweet bell peppers, jalapeños, cucumbers!!) it may need to be increased. I didn’t know what 4oz crackers were so used a full sleeve. I think bacon would also be a nice touch. Will absolutely make again. I will also be the first to sign up for a family get together side dish. This can’t get any easier folks! Get everything prepped, mix together and serve! Just need to be sure when “serving time” is scheduled as yes, this recipe’s amazingness won’t last all day but I predict it will be one of the first ones to go. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlie T."
},
"reviewBody": "A fun, easy, flavorful lunch for us. For me, too much mayo, so I will cut back next time. I did toss in some Louisiana hot sauce for a little kick. Do not be put off because it sounds odd. It's worth making!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jay Cry"
},
"reviewBody": "I made this and add cheddar cheese and seeded the tomatoes and added chop yellow and red bell pepper. I cut down on the Mayo and add only half the crackers at first serving and add the other cracker later to restore the crunch. It is a salad that need to be eaten the same day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda King Lemmons"
},
"reviewBody": "I saw this recipe on the Paula Dean Cooking show. I thought “That just doesn’t seem right.” I was on Corona lockdown so I thought I would try it. Oh my gosh!! It’s awesome!’ Simple, crunchy. And plenty of flavor!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Hamilton"
},
"reviewBody": "My mom always made this for summer cookouts, so I grew up on this. I made it for my family and now my grand kids. (That is how long this recipe has been around!) Everyone loves it. The only thing I add that is not listed is celery seeds (not celery salt). This salad is not only good with BBQ chicken or pork, but is great along side a grilled steak. We always had a debate on whether this was better the next day or not. Some liked the soft crackers and melded flavors while some liked crisp crackers (soggy bread haters). I like both."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chef Mash"
},
"reviewBody": "As a good southern girl, I had to try this. I ignored the nutrition breakdown thinking I had eaten well all week and it would be a special treat, so reduced the mayo as others suggested then I halved the recipe for my husband and myself. We both love all of the ingredients individually &amp; in other recipes so I was confident it was going to be 'lip-smacking delicious'. I'm sorry to say I was wrong. We didn't care for it. I salvaged the meal by adding a can of drained tuna but I will not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DEE C."
},
"reviewBody": "With no offense meant to the submitter, I have to say this is the weirdest thing I've ever made. And that one word, weird, sums up this salad for me. It was interesting to try but I won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "First time for trying a salad recipe like this one. I actually made a small batch of this and a small batch of 'Cracker Salad' from AR. My husband and the neighbor man both liked this recipe the best. It is good and different. I added the crushed crackers right before serving so that there would still be texture to the salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teenie61"
},
"reviewBody": "Yum! Best with garden fresh tomatoes. So easy quick and great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "This is phenomenal! Who knew??? I mixed everything except the crackers ahead of time. Crushed &amp; added the crackers as we were lining up to eat. We loved it so much I'm making it for another get-together this weekend! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Mayer Kaelblein"
},
"reviewBody": "Everyone, while they thought it was weird, loved it enough to have seconds! I think I'll add crisp bacon bits next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "<3"
},
"reviewBody": "this is a good recipe, i was looking for a different egg salad recipe that i could make with not a lot of ingredients (its the night before my husband and i usually go grocery shopping so we were running low) &amp; i liked the idea of putting crackers into it before serving. i normally eat egg salad with plain potato chips, but didnt have any and the crackers were a nice substitute. i didn't have any tomato, &amp; i used a white onion rather than green. i also added in some bacon bits &amp; used light miracle whip to taste. it was very, very good! thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "This is another comfort food for me. I first learned how to make this via Paula Deen(this is her recipe)and I make this about once a month. I usually add some Frank's and sometimes, shredded sharp cheddar. Make this right before you eat/serve it, it gets soggy easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mee-Maw"
},
"reviewBody": "Very good. Looking of something different for lunch today. Reduced the recipe to just 1. Will make again. Thanks for the recipe post."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STEINY"
},
"reviewBody": "i made this yesterday- Hubby thought it was chicken salad- good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "I made this last night from The Lady and Sons cookbook. I searched on Allrecipes today to possibly find a variation. While it was definitely delicious as is and I'll make this again for sure, it needed a little something more. Next time I'll add some chopped red onion and a few more shakes of black pepper. I highly suggest using less mayo, you can always add more later if you need it. As for potlucks, picnics, etc. it would be perfect - just bring the crackers separately in a baggie and add right before serving. Taste and ease of prep = *5*!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EJsMommy"
},
"reviewBody": "This is very addicting. The first couple times I made as is, but now I add a couple extra eggs. I suggest you make it with a cup of mayo then add more if you think it needs it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erimess"
},
"reviewBody": "I used grape tomatoes and cut them in half, but otherwise made as is. I was a bit leary of this, thinking the crackers were a weird idea and would get all mushy. Well, it didn't get all mushy but it does definitely need to be eaten right away. I thought it was way too much mayo. I went ahead and put it all in because normally I think things are too dry and have too little of whatever dressing, but this was just too much. I rarely say that. It wasn't bad, but only a little was good... and I doubted it would be any good if I left the rest for later. So, I won't be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Hall"
},
"reviewBody": "5 star taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aggie"
},
"reviewBody": "What a treat for my Southern family! Nice fresh, summery taste that's not spicy. Tastes like something my mom would have made when times were lean. This would have been 5 stars if not for the need for last-minute preparation. I doubled all the ingredients except the mayo, which I halved. Also added black pepper. I did assemble everything except for the crackers, then added those with each individual serving. I'd like to try this with sour cream instead of mayo, and serve as a spread for crackers of any kind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marites"
},
"reviewBody": "This is a great recipe. It's been a favorite for a while from \"lady &amp; son's.\" However, I add onions. It adds just the right touch. Also, crackers can only be added right before it is served!!! Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momof2"
},
"reviewBody": "Very good recipe (from Lady ahd Son's). When I saw her make it....I thought there was no way that this could be good...was I wrong. You do need to eat this right away...it does not keep at all. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I was extremely surprised at how tasty this was. It doesn't keep very well - it got soggy fast - and it might benefit from a little garlic powder, but it is still a very quick and easy little dish. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshine"
},
"reviewBody": "I love this recipe--Had it in my Lady and Son's Cookbook. I always add a jalapeno pepper for an extra kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingood"
},
"reviewBody": "FABULOUS! I took it to a church function and it was gone!! I did two large tomatoes, 1 cucumber, green onions, 2 eggs, and 1/4 c. shredded parmesan...eveything that I had on hand. I added the crackers last and after 2 hours they were soggy but still good. SO EASY!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/85816/georgia-cracker-salad/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/96/salad/",
"name": "Salad"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1986/salad/egg-salad/",
"name": "Egg Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/85816/georgia-cracker-salad/",
"name": "Georgia Cracker Salad"
}
}
]
}
}
, "about": [
]
}
]