				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "German Chocolate Thumbprint Cookies"
,"datePublished": "2020-06-18T23:05:31.000-04:00"
,"dateModified": "2022-07-14T17:18:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Carla Maenius"
,"url": "https://www.allrecipes.com/cook/24321796"
}
]
,"description": "A chewy chocolate cookie topped with a German chocolate icing. Very good, and they freeze wonderfully if you have any left to freeze. Do not substitute canned frosting or you will be disappointed."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yExFQDGqL-Cq9bqdCiYg96D--_Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27450-ed5e257e9fb04b74815d3d3490e4c90e.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5278637920001",
"description": "Chock-full of caramel, coconut and pecans!",
"duration": "PT55S",
"name": "German Chocolate Thumbprint Cookies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/b567cb77-ddc2-42a2-9b91-baaf15a1d3d4/01134f69-eaec-4617-a672-5d9215ddc0b8/1280x720/match/image.jpg",
"uploadDate": "2021-07-30T20:41:33.280-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "German Chocolate Thumbprint Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "92"
}
,"cookTime": "PT26M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "105 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "19 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "92 mg"
,"sugarContent": "9 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup white sugar",
"1 cup evaporated milk",
"0.5 cup butter",
"1 teaspoon vanilla extract",
"3 egg yolks, beaten",
"1.5 cups flaked coconut",
"1.5 cups chopped pecans",
"1 (18.25 ounce) package German chocolate cake mix",
"0.33333334326744 cup butter, melted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a heavy 2-quart saucepan, combine sugar, milk, 1/2 cup butter, vanilla and egg yolk. Blend well. Cook over medium heat for 10 to 13 minutes or until thickened and bubbly. Stir frequently. Stir in coconut and pecans. Remove from heat and cool to room temperature."
} ,{
"@type": "HowToStep"
,"text": "Reserve 1 1/4 cups of the topping mixture and set aside. In a large bowl, combine cake mix, melted butter and remaining topping mixture. Stir by hand until thoroughly moistened. Shape dough into 1 inch balls. Place 2 inches apart on ungreased cookie sheet. Using your finger, make an indention in center of each ball. Fill each indention with 1/2 teaspoon of reserved topping."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yExFQDGqL-Cq9bqdCiYg96D--_Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27450-ed5e257e9fb04b74815d3d3490e4c90e.jpg"
}
]
,"text": "Bake for 10 to 13 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely."
} ]
,"recipeYield": ["60"]
,"totalTime": "PT46M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used to have this recipe or one very similar but lost it over the years. These were perfect, going to be a great addition to the snack tins I'm making for the holidays. I wish I had found this version before I made the first batch with another recipe that just aren't as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Koval"
},
"reviewBody": "This is an awesome and easy recipe. Unbelievably good. The topping made enough for 2 boxes of German Chocolate Cake dough. In my kitchen one box made 48 cookies. Very pleased and will look forward to baking this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandm7675"
},
"reviewBody": "I took the advice of other reviewers. Adding the 1/2 cup of semi sweet chocolate chips, the 1/2 cup of flour and chilling the dough. I will only add 1/4c of flour next time. The dough was pretty crumbly and took great effort to correct. However, the taste was phenomenal! My fella is enjoying them tremendously!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maureen"
},
"reviewBody": "I made as directed and they are delicious! These are not the prettiest cookies but I made half the batch in a muffin tin and they turned out better looking and just as delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommy cheffy "
},
"reviewBody": "I loved this cookie and my kids who hate coconut absolutely loved it. The cookie does not come out flat as it depends how deep you press on the dough and the spooning of the mixture. What I do as an extra is add a small bag of pudding mix to the mixture for the cookie and it comes out much chewier (we love our cookies this way) however I've made these cookies as is and they come out terrific either way. Happy baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlys"
},
"reviewBody": "As some of the reviewers stated, I added 1/2 cup flour. They turned out perfect. I believe this is necessary because the recipe calls for an 18.25 oz cake mix. The cake mixes today are 15.25 oz. So by adding the 1/2 cup flour, it compensates for the less amount of cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Yes I used brownie mix I didn't have cake mix and yes will make agine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Fredrick"
},
"reviewBody": "Oh they spread out! They are delicious, sure beats baking a German Chocolate cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Joan Rizzo"
},
"reviewBody": "Very delicious. Screwed up the recipe a bit by adding a can of evaporated milk instead of a cup, but I just cooked it a little longer and they turned out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DS10S"
},
"reviewBody": "I did add flour to this recipe as others recommended. and I will make this recipe again. \nThe amazing thing to me about this is that it was really not to sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetTee"
},
"reviewBody": "This recipe was so easy to follow &amp; the cookies taste amazing.....everyone thinks they were so hard to make , I did as everyone else suggested &amp; added flour to the cookie batter. I loved that I had leftover batter to make another batch the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Condor"
},
"reviewBody": "Beauty is only skin deep! These are delicious. I took others’ advice and added 1/2 cup of flour, and I chilled the dough in between pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy McCartney"
},
"reviewBody": "I made this exactly like recipe and they were fantastic. rave reviews from guest at party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Smith"
},
"reviewBody": "I added 1/2 c of flour to the cake batter, as well as 1/2c of mini semi-sweet chips, and chilled for 2 hours. Then I used a Tbsp measuring cup to get consistent sized cookie balls, and put them into a mini muffin tin w/ a 1/4 tbsp of the filling in them and baked for 12 minutes. Let them cool before taking them out of tin and they turned out perfectly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma Ryan"
},
"reviewBody": "I found this recipe in an old cookbook and decided to try it since I had most of the ingredients. However, I noticed the cake mix I had was only 15.25 ounces, 3 ounces less than the recipe called for. I had a dark chocolate cake mix, so I measured out 3 ounces of that (using a scale, not a measuring cup) and added it to the dough. I then made the recipe exactly as written, and they were delicious! They received rave reviews from family and co-workers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I followed the recipe exactly. I did not add flour or refrigerate. The filling was the exact amount needed. The cookies did not spread they are perfect thumbprint cookies with perfect amount of filling. I used real butter. I beat the egg yolks until a creamy consistency. I baked cookies 12 min let them cool on cookie sheet for 5 mins then removed to wax paper to finish cooling (I don't have a cooling rack). I got 4.5 dozen. They taste delicious. I will definitely make them again. I think this will be one of my annual Christmas cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MikeandChristy Brockett"
},
"reviewBody": "My husband loves German chocolate cake and I thought these would be a fun treat. They're wonderful and the whole family loves them. I stick to the recipe but reduce the sugar in the topping by a small amount, as its pretty sweet. These cookies aren't pretty but sure are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plumeria girl"
},
"reviewBody": "Will definitely make again. My husband that doesn't even like coconut loved them. This recipe is going to my stash of favorites forever. I did follow the suggestions of adding 1/2 cup flour and 1/2 cup of chocolate chips to dough. My oven bake a little hotter than most, so I reduced the heat to 325 and baked for 11 minutes. That was the magic combo for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresia Horn Glenn"
},
"reviewBody": "I drizzled sweetened condensed milk over the top and it made them even better... Heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MiChelle"
},
"reviewBody": "Good recipe. I didn't have a problem with mine running. My cake mix was a 15.25 oz so I added 3 oz of cake upsizer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TeeJai"
},
"reviewBody": "I think that one thing that is missing out of the instructions is that when you use the cake mix only use the powder part of the cake mix do not follow the instructions on a cake box to where it tells you to add water a and oil if you're trying to make cookies the only thing you need to combine is the cake mix with the toppings mixture along with the melted butter. I made the mistake by following the instructions for the cake mix and trying to combine it with the homemade topping mixture and melted butter and of course it was too runny so I was left making a cake after all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Stitt"
},
"reviewBody": "Delicious! Mmmm.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Murphy5"
},
"reviewBody": "I really hoped these would be great since I love German chocolate cake. The icing portion was delicious, but the cookies were just so-so. They didn't disappear from the cookie jar very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Schwarze"
},
"reviewBody": "I used a bit less sugar as I was using sweetened coconut, and they turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tangoagatha"
},
"reviewBody": "I have not tried this recipe, but read the reviews. I have a suggestion. I make several types of thumbprint cookies during Christmas, &amp; I always make my \"thumb\" print AFTER they cook. As soon as my cookie sheet leaves the oven, I set it on my hoosier cabinet, &amp; use my All Clad 1tsp measurer to press the indention into the top of the cookie. I quickly work through all the cookies, making the dent, then start over to make sure it didn't \"puff\" back up again. Then, I let them cook, &amp; insert the filling for my thumbprints later. I have NEVER had a problem getting a thumbprint cookie to set up using this method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsSanders"
},
"reviewBody": "Great recipe. I added the 1/2 cup of flour and rolled the dough into balls before I refrigerated for the hour. Didn't last \nLong at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Mann"
},
"reviewBody": "These cookies are delish - they have a bit of that cake batter flavor, which is a nice touch. I used devil's food cake mix b/c could not find german chocolate and it turned out fine (any choc mix will work I think). Note: be generous with the dollop of topping you put on each cookie - it sets up fairly well. \nI disagree with the user who said these are not attractive - I think they look very nice, not sloppy at all - will be going on the \"cookie table\" at my sister inlaw's wedding next month."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CaliKC"
},
"reviewBody": "I made these per directions and they tasted great but were a little flat, so like everyone else I modified a bit - made the topping as is (cause what else really could it need, it's GREAT). Then used 2 cups (for consistency) of the topping to cake mix, plus 3/4 cup flour, cut melted butter to 1/4 cup, and added 1/2 tsp baking powder. Worked great, and got lots of requests for the recipe. Thanks Carla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Not sure why so many people have had trouble with these cookies spreading or having to add flour. I made this recipe exactly as written and had no trouble at all. Perhaps people are not paying attention to how much filling to add to the cake mix portion? I didn't get 5 dozen cookies out of it but didn't really try to accurately measure the amount of dough I used either. And though they are not that attractive, German chocolate cake isn't either, so I think if you like German chocolate enough you care more about the taste than the appearance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Kocon"
},
"reviewBody": "My family loved these cookies. I made them pretty much as is...except I only used 1 cup of pecans and 1 cup of coconut because the the nuts and coconut came in 2 cup bags, I decided I would save a cup of each to make another batch! I don't think that made any difference as the cookies were still wonderful. I did add a 1/4 cup of flour per other reviews as I was worried about spread, but I don't think I really needed to. Next time I will not. I think it made my mix too dry, so I added a tablespoon of water to counter the flour I put in. I have a brownie recipe I make that also uses a cake mix, and it seemed to be the same consistency...which is somewhat dry, but moist when baked. Very good, will make just as recipe is posted next time. Thanks Carla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "all4thechallenges"
},
"reviewBody": "Very yummy as is! Took it to a potluck and was the first thing gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RRTK70"
},
"reviewBody": "Used other tips and added 1/2 c of flour. Took them to a party and they were a hit. I was asked several times for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vlasprincess"
},
"reviewBody": "These turned out divine! I made these for my co-workers and customers where I work, (I'm a bartender) and everyone raved about them. I even got two marriage proposals :) The only thing I added was 1/3 cup of flour to the cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlebaker"
},
"reviewBody": "Though they are not very pretty, the cookies are delicious. I'm pretty picky when it comes to cookies - they have to be soft and chewy on the inside with a bit of a crisp on the outside - that is exactly what these cookies were. The topping - homemade, always go for homemade if you can, it always tastes better - was the perfect amount of sweetness for the not-too-sweet cookie. Together, the topping and cookie, had a fantastic taste, and yet they still tasted good apart. Will definitely make again - though I'll try and figure out how to make them a little prettier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Savoy"
},
"reviewBody": "even though we didnt use pecans they were grate! at first i thout it look my dogs poo i loved it way mor than i thought!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brandi collins"
},
"reviewBody": "This was the best cookie I have ever eaten! I read other reviews and think that they may have made theirs wrong. I had no trouble with them spreading and you do NOT need to add flour. The cake mix does not say to be prepared therefore all you do is add butter to dry cake mix so it is not runny. It is a little hard to shape because the mix is dry but once they bake it all cones together perfect. No need to change a thing! Yummmmmy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SABRA"
},
"reviewBody": "I just had these for the first time. A friend made them. WOW! If you like German chocolate, you will love these cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke129"
},
"reviewBody": "I LOVE German Chocolate Cake....actually anything w/ coconut, and these cookies are AWESOME! Thank you for a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt"
},
"reviewBody": "I read the reviews and I added 1/3 c of flour and refrigerated it overnight. I also added chocolate chips into the cookie batter, and I used devil's food cake. The cookies came out perfect, but they are REALLY chocolatey! They were not flat at all either. My boyfriend loves them. Definately making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pdsavoie"
},
"reviewBody": "These are really yummy! Instead of going through the difficulty of making a German Chocolate cake, I would make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "I always forget to go back and rate the recipes that I love. THIS IS THE BEST COOKIE EVER!!! Would not change a thing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISTISS"
},
"reviewBody": "I thought these cookies were great! I did at about 1/3 cup flour to it. I let it set in refrigerator overnight. No flat cookies here. A little bit crispy on the outside and chewy on the the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Phil Young"
},
"reviewBody": "It Was OK"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Misha"
},
"reviewBody": "Okay, I'm SO frustrated! I originally found this recipe while I was supposed to be working, and made them several times in my employer's oven. They always turned out fabulous. They looked just like the picture, and tasted wonderful. I scoffed at all you whiny amateurs who couldn't get them right. :) However...baking them in MY oven is a very different story! They go flat, like so many of the complaints I've seen. I've NEVER gotten them to look right at home! It has to be a temperature issue, wouldn't you think? I'm determined to figure this out, because my family and I LOVE these cookies! Meanwhile...to decrease the ugly, I'm using a heart-shaped cookie cutter on the flatties I made tonight. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "23DAISYS"
},
"reviewBody": "The hubby loved these. Followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jvdveen"
},
"reviewBody": "I came across this recipe after looking for a German cookie recipe. Duh! I thought these cookies were really good. Yes, they come out flat and chewy if you bake per original directions but I'm not complaining. Might try adding some flour as recommended by other reviewers. \n\nThey were sweet, chewy and easy to make. I don't think they are 'ugly' as others have stated. Come on what do you expect from chocolate cake mix, coconut and pecans!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KIM22871"
},
"reviewBody": "These cookies were just okay. They turned out really flat and I add the extra 1/2 cup flour like others suggested. I don't think I will make these again. Not at all what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kate"
},
"reviewBody": "After reading the other reviews, I decided my first batch would be done in a mini-muffin pan. I used devil's food mix (YUM!) I didn't add the 1/2c flour, and they were a little \"cakey\" for my taste. I will make them again as mini-muffins with the 1/2c flour. Thanks for a great recipe for my cookie collection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CanadaLadyBug"
},
"reviewBody": "The cookies turned out ugly and flat. They tasted just ok. I made the mistake of not reading the reviews till after I made them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "N8VTXN"
},
"reviewBody": "I've made dozens of yummy recipes from this site over the years, but this one drove me to actually write a review. Someone I adore loves German Chocolate Cake, but he also lives far away. :( GCTC to the rescue. At first I snickered at the thought of using a cake mix for the cookie dough. Then I felt a little devilish at the thought of getting away with it. The first batch valiantly gave itself in the name of research. My sister dedicated herself to scrutinizing the cookie batter while her husband choked down the filling. After passing reviews, batch #2 was apparenly abducted by aliens while setting up in the fridge. Batch #3 turned out beautifully, and was packed and on its way to the object of my affection. Without even trying the originally recipe, I followed the pack and added the 1/2 c flour to the cookie batter. I also refrigerated the dough overnight and used a sorbet scoop to portion the dough and a small melon baller to hollow out an indentation for the filling. Save yourself alot of grief and just make a double batch to begin with so half can be devoured \"raw\" and the other half can make it to the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Cheng"
},
"reviewBody": "Amy and I ate it all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cyndy C."
},
"reviewBody": "Sorry to give this a low rating, but I took them to a gathering and brought home about the whole plate and then no one would eat them here at home. The filling has possibilities, but the cookie base was kind of tasteless. Maybe I'm one of those people who like things on the sweeter side. Just not worth the effort or calories for me- sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmnix"
},
"reviewBody": "I made these for a friend who loves German chocolate cake...they were a huge hit, about to make another batch!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "I made the mistake of not reading the comments until now. Great cookie, but it goes flat. Next time I will put the extra flour in like everyone else. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "traveljunkie"
},
"reviewBody": "I had a terrible time with these! I followed the tips and added 1/2 cup of flour, then refrigerated the dough. But it was way too dry to even roll into a ball! So I put it all into a sprayed 9x13 dish, added the filling on top, and baked for 35 minutes. They are still warm, but I don't think the consistency will even hold up as a \"brownie\". I admit that they are good, but it seems that they are too tempermental! Maybe I'll try again when it's not snowing out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DARLENE1"
},
"reviewBody": "GREAT TASTING! I added 1/2 cup flour (as others suggested) otherwise followed recipe exactly. They still flattened out a little more than I was hoping, so next time I will up the flour a little more. When the cookies cooled I drizzled the tops with melted chocolate chips that I put in a little zip-lock bag that I snipped the corner of. It made them look GREAT...everyone loved them! P.S. I've also tried them with a Devils Food Cake Mix &amp; they were wonderful! Thanks for a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TWIL"
},
"reviewBody": "If you love german chocolate cake you will love these cookies, Imade these for a cookie psrty and every person there asked for the recipie and before everyone left all of the cookies were gone. I did add the 1/2 cup of flour. Fantastic recipie I have already made three more batches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MALOONIEP"
},
"reviewBody": "These were ugly, butyummy! Since they were ugly and I was taking them to work, I decided to put the dough in an 8x8 pan, then put the topping mixture on. These were the best \"brownies\" I have ever made! I baked them for about 35 mnutes. I just kept checking them. I did end up taking some of the ugly cookies to work and one lady said they were the best cookies she had ever had! NOTE-I am high altitude, about 7000 above sea level, so not sure if they flattened due to that. I may try baking powder next time. (and I did add the extra 1/2 cup or so of flour because they were too sticky to work with). I think I will stick with the brownie version for now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jess51725"
},
"reviewBody": "I had terrible luck with these. When I made the dough it ended up too dry, so I had to add some water which made it very sticky. The cookies ended up flat like everyone stated. These tasted alright, but I will never make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BunnyD"
},
"reviewBody": "Excellent cookie recipe! I loved the convenience of using a cake mix for the majority of the cookie dough. The coconut/pecan topping was actually really easy to make from scratch, and not overly sweet like the canned versions. I added 1/2 cup of flour to the cookie batter as suggested by the other reviewers, and chilled the dough before making the cookies and in between batches - they came out beautifully. My husband loves German Chocolate Cake so I can't wait for him to try these! \n\n** I've made these cookies multiple times and found that added about 1/2 cup of semi sweet chocolate chips to the batter makes it even better and brings out more of the chocolate flavor! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SHANNYN79"
},
"reviewBody": "These didn;t turn out quite so well for me. They sounded wonderful, but mine were a complete flop. Someday, I might attempt them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mc Coy"
},
"reviewBody": "I have just found my favorite cookie of all time... Seriously, these are wonderful! I followed the suggestions made by others to add 1/2 c flour to the cookie batter, and they turned out fabulous! Although they're not the prettiest looking cookies, what they lack in appearance is certainly made up by their taste!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caseyspunk"
},
"reviewBody": "These were very delicious and chewy, lots of good flavor. I refrigerated the dough as others recommended. They did spread out a bit though, but I'd still make them again. Make sure the balls that you make are small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CK"
},
"reviewBody": "Great cookies, they were a big hit... easy to make as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rnscoot"
},
"reviewBody": "Fabulous cookie! Freezes very well and a real crowd pleaser. Thanks for the recipe Carla. I too added the extra flour and refigerated before shaping and baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice_H"
},
"reviewBody": "As long as we don't think of these as traditional thumbprint cookies, I have no problems with them whatsoever. My husband is a german chocolate fiend, and his office requires him to bring his own treats on his birthday, so these make an annual appearance since they are easier to handle than cake. Everyone who tastes them asks for the recipe, thinking they are really difficult to make, but they are so easy and soooo good!\n\nI haven't yet tried adding flour to the mixture (which I should be doing anyway since I live at altitude), but I'm going to make a batch this weekend and try it.\n\nOne complaint: I wish the recipe told how much frosting to put INTO the cake mix, not how much to hold out. My husband and I can't stop snacking on the darn stuff as it cools, so it's always a guess as to how much should go into the cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HAPPY23"
},
"reviewBody": "I must say I followed the recipe exactly and made the same exceptions as previous users by adding flour and refrigerated the dough. Well, it did come out as I was rolling them. So, I just took the dough and laid it flat as to make bar cookies. Well, that worked and my family devoured them. They were great as a bar cookie. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANDYSHED"
},
"reviewBody": "Great recipe. As suggested in other ratings, I added a 1/2 cup of flour to the cookie base and refrigerated the dough for 1 hour. I shaped as I would a normal thumbprint cookie and had no problems with the cookie spreading. They look great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph P."
},
"reviewBody": "Wow! These cookies are terrific and addictive! Just make sure you read the instructions all the way through before attempting. My topping mixture looked a little curded while cooking, but it still tasted great, so I am not sure if it is supposed to do that or not. Also, I used the pre-chopped \"cookie\" pecans that were extra-finely chopped. This worked great for the topping and didn't leave any annoyingly large pieces in the actual cookie. Also, like previous reviewer, I added a 1/2 C flour to cookie mix and chilled dough for about 45 minutes. My cookies spread, but not in a bad way - they still looked good. Although, the way they tasted, I doubt anyone would have cared about how they looked! Finally, you can use more than a 1/2 tsp of the topping per cookie - I just heaped it on and still had plenty to make 60 cookies from the single batch. Yummy - this is now offically one of my husband's favorite cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjgailey"
},
"reviewBody": "These are great cookies! I added 1/2 cup of flour to the dough and chilled for 30 minutes and they turned out perfect! They did not run and were the perfect \"cookie\" texture and looked great! Were a huge hit at my husband's company. Also, I did have alot of filling left, so maybe use only 1/2 next time...these made 4 doz. cookies for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "American Beauty"
},
"reviewBody": "I made 2 batches in the same day. Batch #1: made exactly as stated, and put dough in fridge. Cookies spread to 3\", and were flat. Batch #2: I significantly cut the amount of filling I added to the cake mix, hoping the cookies wouldn't be so flat and spread so much. No appreciable difference.\r\n\r\nThese taste great -- unique blend of crunchy and chewy. My guests adored them, and asked for the recipe! But beware: they spread a LOT. Even making them in 1\" balls yields a 3\" cookie. I had a lot of filling left over after Batch #1 and even more with Batch #2 and froze it for I-don't-know-what. \r\n\r\nThe only way I'd improve them would be to somehow make them not as flat. Perhaps adding 50% more coconut and nearly that much more pecans would help bulk them up.\r\n\r\nWhatever, I highly recommend these. They're addictive: be sure to make more than enough for what you need, because you'll end up eating several while they're still warm from the oven. Mmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMBACUB"
},
"reviewBody": "My husband LOVED these and I loved the taste too which is why I gave them 5 stars........but I would only give 2 stars for appearance. I was expecting a cute little thumbprint cookie filled with the coconut/pecan mixture. Instead, the cookie spread out and flattened completely; I even refrigerated the dough prior to baking. Delicious to eat but not so appealing to look at."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINGERLY88"
},
"reviewBody": "I really like these. They are moist (I didn't bake them the whole 10 mins. I baked them about 8mins.) These are a change and are great for coconut lovers. I do belive that store bought filling would be alright but the homemade is so much better. I tinkered with the idea of taking the easy way out and using the store bought and I am glad that I didn't! I ate so many of these! I think I might drizzle a little melted chocolate across the tops of these to fancy them up a little. Otherwise great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "MARY210\r\nThese cookies are delicious. I was cookie testing this weekend for our Christmas Cookie Exchange. This is it. Thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denice Easter"
},
"reviewBody": "Carla, I just want you to know that I have been looking for this recipe for over 15 years and I want to thank you soooo much for posting it on this site!!! I had the original recipe back in 1986 and I lost it due to moving and haven't been able to find it until now. So, Thank You, Thank You, Thank You!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I brought these to a Christmas party--having never made them before--and guests loved them. I have had several requests for the recipe since then. Very easy, but do not appear to be an \"easy\" cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "Yummy! I did find that I needed to refrigerate the dough a little. Maybe my house was to warm. Before I refrigerated the dough the cookies spread while baking. After they did not as much. Thanks for a great recipe. I will be using this one for a long time to come."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M."
},
"reviewBody": "These are very good cookies. They do taste like the cake, but with a cookie consistency. Very rich. Loved them! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmmdessert"
},
"reviewBody": "I was going to make German chocolate cake but stumbled into this recipe instead. This is a delicious cookie that is crispy on the edges and chewy in the center. I didn't have any pecans, but walnuts were a great substitute. I had enough cookie dough and filling to make six dozen cookies. It's a nice change of pace from the usual jam-filled thumbprint cookie. Thanks for a great recipe, Carla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaruka"
},
"reviewBody": "The very BEST cookie I have ever eaten. I receive raves from everyone\r\nwho tastes one...and it super easy to make."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24432/german-chocolate-thumbprint-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14691/desserts/cookies/thumbprint-cookies/",
"name": "Thumbprint Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24432/german-chocolate-thumbprint-cookies/",
"name": "German Chocolate Thumbprint Cookies"
}
}
]
}
}
, "about": [
]
}
]