				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Gingerbread Boys"
,"datePublished": "1998-12-12T12:19:52.000-05:00"
,"dateModified": "2022-08-18T18:03:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JBS BOX"
,"url": "https://www.allrecipes.com/cook/46167"
}
]
,"description": "These gingerbread cookies without molasses have a hint of orange flavor and can be cut into gingerbread men or whichever shape you like."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/G28wsoMAQ5wYYhm2QpXrp4icPFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/48821-3bf53fffd7dd4660ab2accd40ce73642.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Gingerbread Boys"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "425"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "73 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "86 mg"
,"sugarContent": "5 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup butter, softened",
"1.5 cups white sugar",
"1 egg",
"1.5 tablespoons orange zest",
"2 tablespoons dark corn syrup",
"3 cups all-purpose flour",
"2 teaspoons baking soda",
"2 teaspoons ground cinnamon",
"1 teaspoon ground ginger",
"0.5 teaspoon ground cloves",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cream the butter and the sugar together. Add the egg and mix well. Mix in the orange peel and dark corn syrup. Add the flour, baking soda, cinnamon, ginger, ground cloves and salt, mixing until well combined. Chill dough for at least 2 hours, I like to chill overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. On a lightly floured surface, roll dough out to 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 1 inch apart on the prepared cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 to 12 minutes in the preheated oven, until cookies are firm and lightly toasted on the edges."
} ]
,"recipeYield": ["60"]
,"totalTime": "PT145M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gina-dwyerbutterfly"
},
"reviewBody": "This is a great gingerbread cookie recipe, and my go to one every Christmas! I get lots of compliments and many ask me for the recipe, so thank you for sharing. I do not add the orange zest, and use molasses in place of the corn syrup, but keep everything else the same. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gina"
},
"reviewBody": "This is my go to Gingerbread cookie! So good. I also swap out the corn syrup for molasses, and I do not put in the orange zest. I chill dough for few hours, and roll out between 2 sheets of wax paper. Everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Josephine Etznab"
},
"reviewBody": "I first made this recipe exactly as written and the dough had an awful texture. I tried it again with substitutions mentioned in many reviews: less butter, more flour, molasses instead of corn syrup and it was better but not great. This dough was unforgiving both times. I didn't have trouble with too much spreading, but the cracks were numerous. It required numerous steps of rolling, chilling, and rerolling to get a smooth surface. The photo shows one cookie that was rolled only once and another with multiple rolls. The flavor was okay. The orange was nice but definitely needs more ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These gingerbread men are perfect with a cup of coffee or hot tea. I will be making many more of these guys, because they keep disappearing from my cookie jar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used molasses bc I had a whole bottle of it ..and i like its tang. We are waiting for the chill to be over. i will update once i roll them and bake! So far im enthalled ..it smells better than my grannys (she was a depression era amaizng cook) , rest her soul..shhh I didnt taste raw dough ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaprico"
},
"reviewBody": "Ever since I tried this recipe for the first time in 2009, it's been my only go-to recipe for Gingerbread character cookies every Christmas. The real test has been when people have taken their first bite, and immediately comment on how much they enjoy the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doge"
},
"reviewBody": "absolutely delicious, omit the orange zest and replace corn syrup with molasses"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Loved the taste and they were cooked so well!! Better than store bought for sure!! I substituted molasses like other bakers for the corn syrup. Dough started to become crumbly so I added another egg, perfect (my eggs may have been small sized). Left the dough in the FREEZER for an HOUR for quicker baking, and it rolled out perfect. Left them in the oven for 10ish minutes, they spread out not too much maybe 1 cm. Dipped some in melted chocolate chips and were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "It turned out to great! As many mention you have to add an extra cup of flour because it will not roll out. Also, it’s best to let chill overnight to have a firm dough to roll out. I baked mine for 7 minutes at 375F and it came out great! Highly recommend trying this recipe:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Kaitlyn"
},
"reviewBody": "These cookies are fantastic! The only things I changed were: I made them without the orange and substituted molasses for corn syrup like other reviewers mentioned. They work great! I used it for a Christmas open house and they were a huge hit! They taste great topped with the Sugar Cookie frosting recipe also on Allrecipes from JB BOX. Next time I think I would add orange flavoring to the icing to get a citrus flavor. I think it would complement it nicely. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "They taste amazing, crunchy. I baked about 10 minutes. They spread a lot. The dough was dry &amp; rolled out well. I used large eggs. I used molasses instead of corn syrup &amp; omitted the orange zest. I wish they would spread less though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chandra"
},
"reviewBody": "I do not care for gingerbread cookies but I like making them. These are delicious! The dough was so easy to work with, I followed the recipe exactly. My kids even liked them. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amandakhalaf"
},
"reviewBody": "Y’all, I tossed these in powdered sugar instead of icing them and my family and friends are obsessed. I’ve been using all recipes for years, but this was the recipe to make me finally leave a review."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "I substituted 1/2 tsp of orange oil for the zest, they turned out super tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Andrews Kosinski"
},
"reviewBody": "Great texture, crisp but has a little chew. The only change was using molasses instead of corn syrup. Baked 7-8 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Reed-allen"
},
"reviewBody": "This is my go to gingerbread cookie recipe every year. They have amazing flavor and turn out great every time! Chill before baking!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Gingerbread Boys by JBS BOX. These amounts: 1 1/2t ginger, 1 1/2t cinnamon, 1/8t cloves = very light gingerbread taste; more of a spice cookie. No need to grease pan. Not good for cutouts. choice for cutouts. Maybe just \"log\" it &amp; slice. E"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonBolel"
},
"reviewBody": "Absolutely delicious with a mild spicy flavour that even the children loved! I wanted to keep my recipe milk-free (parev) so I substituted the butter with half coconut oil and half sunflower oil. The texture of the baked cookies was excellent. Crispy, crunchy, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan MacFarlane"
},
"reviewBody": "Loved this recipe! The orange zest gave the cookies a lovely orange fragrance!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abubnic"
},
"reviewBody": "I have been making this recipe for many years and my Gingerbread Boys come out perfectly every time. \n\nI use Norpro's gingerbread cookie pan. I press the dough into the cookie molds and then, I put the tray in the fridge for 10-15 minutes so that the dough &amp; the tray are cold when they go into the oven. I follow the recipe as is, except that I add two eggs instead of one for a crispy texture on the outside and a cake-like texture in the inside. Everyone raves about these cookies! I especially like the orange zest flavoring. \n\nBe sure to use fresh spices. I never use spices from the previous year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PIPPYPOPPY3"
},
"reviewBody": "It tasted good, but after I made it the dough was very crumbly. I refrigerated it overnight, and it became too sticky to handle. I put some flour in it and kneaded it until it was greatly combined. It still wasn’t enough. I decided to refrigerate it for 2 hours and it then became too crumbly again. I retraced my steps to make sure I didn’t miss anything and I was sure I had everything. I just decided to lightly moisten the dough and cook it. And it seemed to work better. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "natureinspired"
},
"reviewBody": "This recipe produces a very flavorful dough that pleases everyone during the holidays. However, I had a lot of trouble with my cookies spreading. To combat this, I added another 1/2 cup flour, baked on parchment paper instead of a greased cookie sheet, and rolled my cookies ultra thin, about 1/8 of an inch. I also only baked my cookies about 6-8 minutes, as my early attempts burned on the edges. These tricks dramatically decreased the spreading of my cookies. Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandiedog"
},
"reviewBody": "These are the best gingerbread cookies in the world! They’re chewy yet they hold their shape. They’re my most requested cookie at Christmas but there’s one problem, I can barely get them decorated before they’re gobbled up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PamG"
},
"reviewBody": "I can't roll out cookies to save myself so I just balled the dough and flattened the balls with a glass dipped in sugar. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Team Troh "
},
"reviewBody": "Excellent recipe! I don't even like cookies but I couldn't stop eating these. Per other reviewers, I omitted the orange zest and substituted molasses for the corn syrup - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandyS"
},
"reviewBody": "Oh, my goodness - these are SO delicious with the zesty orange flavour!! My little grandson and I had a wonderful time making gingerbread men, stars and mittens then decorating them! I used molasses, as suggested by other reviewers, and the dough is perfect for rolling and cutting. This is my new “go to” recipe. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Whited Miller"
},
"reviewBody": "Substituted molasses for corn syrup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "I baked this according to other reviewers and used molasses instead of corn syrup (otherwise the same) and I still didn’t like them. I DEFINITELY had to add flour. The dough was gooey even after being refrigerated all night. Yikes! Also, they weren’t gingerbread’y. They were graham cracker’y. Not enough flavor. :-/\nthanks anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H P"
},
"reviewBody": "These cookies were great! I’ve never had homemade gingerbread and the store bought kind are always either cakey or unpleasantly hard and crunchy so I though that was kind of the thing with gingerbread. Like fruitcake, no one really likes it, but it’s traditional. I’m a beginner at all things baking and this is the first time I’ve ever made a rolled cookie recipe. It turned out perfect! The cookies were soft and chewy and perfectly seasoned. Not bland and not too spicy. I did substitute the corn syrup with molasses because that’s what I had on hand. For all other beginner bakers here’s a tip that really helped me: because the amount of flour can vary significantly when measured by volume, add the flour a little at a time. Not enough time flour and you will end up with greasy and flat cookies. Too much flour and you end up with a crumbly dough and/or a bland cookie. I like to mix it with my hands once I’ve got everything combined and judge from there. The dough shouldn’t stick all over you’re hands (or spoon) and should be nice and pliable, kind of like play dough. I will definitely be making these cookies for Christmas this year! Thank you for the delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Islandgirl"
},
"reviewBody": "These gingerbread cookies were a sad cookie that kind of resembled gingerbread. You guys are missing out on a delicious spicy gingerbread cookie if this is your go to recipe. Too sweet, not enough spice and flavor. How can you make gingerbread without molasses?! Stick with Betty Crocker’s recipe. It is WAY better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Foster"
},
"reviewBody": "Really good. Love the hint of orange in them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TiffanyTiffany"
},
"reviewBody": "This will be my new \"go-to\" for gingerbread cookies! Like others suggested, I used molasses in place of the corn syrup. Although I think that the orange zest would be delicious, I didn't have any oranges in the house so it was omitted. I did have a lot of difficulty rolling out the dough after it had been chilled, but once I finally did, the results were great. My oven tends to run a little hot, so I baked at 350 F instead and they were perfect at 11 minutes. I decorated and gave as gifts to rave reviews. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Debbie Curtis"
},
"reviewBody": "I made these last year and they were great. Made them this year exactly the same way and they spread across the cookie sheet. I threw them all away. What a waste!! Will not make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wegenka-Moretti"
},
"reviewBody": "Fantastic! I double the spices because we like it spicy. This recipe tastes great and is really easy to roll out. Definitely let the dough chill overnight to allow the flavours to mingle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hessa Hessa"
},
"reviewBody": "I loooove it its soft and easy ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BTSARMYSINCE2015"
},
"reviewBody": "These worked perfectly! I added some nice berries chopped up finely as clothes. Forgot to take a photo -.-"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Wenger"
},
"reviewBody": "I made these exactly like the recipe, including chilling before rolling. I found the dough rather stiff to work with even though i only used half of the dough at a time. We LOVED the flavor. More orange and spice than the heavy molasses taste usually associated with gingerbread. Unfortunately they were very crunchy and my gingerbread fans prefer a softer cookie. I guess the search goes on for the perfect recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeniseMG"
},
"reviewBody": "Best gingerbread cookie recipe I have ever tasted! The orange essence was wonderful! Like others, I substituted molasses for the dark corn syrup. I added fresh ginger too, since I had in on hand and it enhanced the flavor beautifully. I had never used wax paper to roll out cut out cookies before but I took another reviewer's advice and was glad I did. Since I did not have to keep adding flour to prevent the batter from sticking to the rolling pin, I am convinced it prevented the cookies from getting stiff and tasteless. Will make this every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiddo96"
},
"reviewBody": "Best gingerbread recipe ever, never like gingerbread before these...only made them for my son"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Raymond"
},
"reviewBody": "I followed the recipe. They did expand, but nothing disastrous as described in other posts. I chilled overnight. It was hard to roll out, but kneading it for a few minutes helps. Cute and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susana"
},
"reviewBody": "Skipped the orange as I’m old fashioned. Otherwise followed recipe exactly and wow! these were way better than any I’ve had previously. Rolled out on parchment with waxed paper on top and put in freezer before removing scraps. Don’t get your ‘boys’ too close or they’ll merge during the bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GinaR"
},
"reviewBody": "The flavor of this cookie is amazing! It’s now my favorite gingerbread cookie recipe. Easy to make too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "deltaseal6"
},
"reviewBody": "They taste like sugar cookies with some spice. The texture is good but they are not gingerbread cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mlizon"
},
"reviewBody": "Taste like snickerdoodles and ginger bread combined. No molasses, which makes it simpler. Very easy to make. No need to refridgerate, still turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "These Ginger Cookie Boys are from the BHG Christmas Time Cook Book, 1974. Best gingerbread cookies ever. Have been making them for 40+ years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LittleK"
},
"reviewBody": "Highly recommend this recipe. I wanted a gingerbread cookie recipe that had good flavor, not too sweet and would be soft. These were perfect. I loved the ginger and orange flavors. Will be making these one of our holiday favorites. Chilled the dough overnight and after bringing closer to room temp we were able to dust with some flour and sugar and rolled and cut out fine. Also, I halved the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Dittebrand Golden"
},
"reviewBody": "These are great with a milder gingerbread taste. I don't love gingerbread but my husband does so I thought this would be a good compromise. They dough was very hard after refrigerating and we had to let it sit for a little bit but in the end it all rolled out great and were some of the easiest cutout cookies I've made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Coulter"
},
"reviewBody": "I made these cookies for nice who has celiac disease. I used cloud 9 gluten free flour and they turned out great. Can't tell they are gluten free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Dixon"
},
"reviewBody": "I made no changes I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Glass"
},
"reviewBody": "Fantastic taste. Like others, I used molasses. It was a bit crumbly at first but became more playable as it warmed a bit. A Christmas staple for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wvgirl"
},
"reviewBody": "These cookies are delicious and I love the orange flavor. I followed the recipe exactly as written. I refrigerated the dough overnight. It was a little hard to roll out at first but got easier as the dough warmed up a little. I used a large cookie cutter for the first pan and the cookies spread too much. For the rest, I made the cookies thicker and I switched to a smaller cookie cutter with the attached outline print (inexpensive and purchased at Walmart). The smaller cookies with the imprint didn't spread as much and are as cute as can be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kpo"
},
"reviewBody": "Pros: makes a beautiful dough thats easy to handle after refrigeration overnight. Tastes amazing (I used 1/2 fresh orange rind for zest - also traded molasses for corn syrup).\nCon: Dough spreads so does not keep sharp edges when using cookie cutters (my snowflakes looked like daisies).\nMaybe less baking powder next time?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayatri"
},
"reviewBody": "The taste is amazing! And the dough is very easy to work with once chilled - I kept it overnight in the fridge. Will definitely be making again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "I used molasses instead of corn syrup. For sturdy crispy walls I baked for 10 min. For a slightly chewier cookie I took them out after 8. Baked beautifully on my silpat. Oh and the flour amount was just right as is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NLyttleton"
},
"reviewBody": "My dough came out fairly dry and crumbly, which made it impossible to roll out. I ended up trying to make a log and slicing them; they didn't look pretty but they tasted good all the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snugs Smith"
},
"reviewBody": "Beautiful cookies!!! You are an amazing baker!! Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPARKLYSCOTTY"
},
"reviewBody": "I love this recipe. The dough is elastic and a real pleasure to work with, partly due to the amazing aroma that comes off of it while you work. The cookies baked up like a dream, and tasted great. I doubled the ginger, like many other reviewers, and added a dash of nutmeg. I also used maple syrup instead of corn syrup or molasses. I'll be turning to this recipe time and again in future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "I put in molasses like others said and left out the zest, and used fresh ginger. It was a very loose batter which needed quite a bit of extra flour for rolling. It cooked well but didn't have a strong ginger flavour, I would use more if I repeat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bearjes1100"
},
"reviewBody": "Very good recipe with some change: I used half butter and 2 eggs and double the ginger. Knead the dough with your hands and better to chill it for more than 3 hours. I didn't have wax paper so I just used the Saran Wrap which I used to wrap the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LouBelle"
},
"reviewBody": "Great recipe!! As a substitute for corn syrup, I used 2-3 tbsp of Golden Syrup and 1 Tsp of molasses, but these were lovely! I also baked for 12 minutes, and while they did spread a bit, they stayed whole and the end consistency was exactly how I like: cruncy on the outide but not completely brittle inside. Best I've made to date, definitely saving the recipe for next Christmas! I would say do make sure to allow sufficient space around them on the baking tray to avoid spreading into each other, but I found the flour ration was just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Made these exactly like the recipe said and they are awesome!!! I have been looking for a good recipe that's not too spicy and these are perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GALA62"
},
"reviewBody": "I really like this recipe - but have quite a few alterations so I'm giving it 4-stars, but these are tweaks, this is my go-to gingerbread recipe every year.\nMy changes: half white sugar/half brown sugar, molasses instead of corn syrup, double the ginger and double the cloves (we like ours with a kick!).\n\nThis dough rolls like a dream. Just don't try to roll the whole thing at once! When you take the dough from the mixer (a stand mixer really is best here - my Kitchen-Aid has no problem with it), portion the dough, wrap in Saran Wrap &amp; pop in the frig. One trick I like when rolling dough is to use a 50/50 mix of flour and confectioner's sugar. The dough doesn't get as tough when you re-roll it.\n\nI like to brush the cookies before baking with a bit of water and sprinkle with coarse sparkling sugar. I cut them a little thicker, so they are softer and a bit chewy. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pititafl"
},
"reviewBody": "What an awesome cookie!!! I am a gingerbread cookie addict, and this one was one the best I have ever tried! The whole batch was gone in one day. I substituted the syrup for molasses but kept the rest as is. Very very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jammininAZ"
},
"reviewBody": "Oh my goodness, these are a-maze-ing! I'm not a huge cookie fan, but these are yummy. The touch of orange makes them addicting. I used brown sugar instead of white and added more ginger (another tsp), and did everything else the same. Put in the freezer for about 30 mins and cut in quarters, taking one out at a time. Rolled between waxed paper (genius!!) about 1/4\" thick. They're sweet enough that they don't need frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Nance"
},
"reviewBody": "These are the best! The dough was easy to work with and the taste was excellent with a hint of the orange zest. Even after working the dough over and over, still not one broken boy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Stroud"
},
"reviewBody": "These are the best gingerbread cookies ever! Flavorful but not overly spiced. I substituted molasses for dark corn syrup because that is what I had. The orange zest is a wonderful flavor enhancer and takes the cookies a notch up! I could not keep the kids from eating them while we were trying to frost them. The adults could not resist either. Half the cookies were eaten without frosting and the other half eaten right after being frosted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "wheatqueen"
},
"reviewBody": "Just made a batch and as others said, the shapes spread out quite a bit while baking. They don't look like their cut outs at all. And after tasting one they really don't taste much like I was expecting. I will be looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue Margaret Warren"
},
"reviewBody": "I liked this recipe but had to make several adjustments. First, I added 1-2 cups of flour, doubled the ginger, and left out the orange. The cooky had a nice texture, but next time ill double all the spices-we like our cookys spicey!!!The fun thing was my husband frosted/decorated them and he had never done that before-he even added the gumdrops!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meegs"
},
"reviewBody": "Excellent. I left out the orange zest and substituted molasses for corn syrup. Put it in the fridge for 1.5 hours and they turned out just great. They taste like they came from an upscale bakery!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Herbert"
},
"reviewBody": "Very good and easy to work with. Not a traditional gingerbread as it doesn't seem so strong, so I actually liked the taste better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erinthomas06"
},
"reviewBody": "I quite enjoyed this recipe. I substituted the corn syrup for molasses but still didn't find the taste to be as 'gingerbread-y' as I would have liked but orange flavor is nice and fresh. Left my dough in overnight and didn't have too much problems rolling it out. My first batch I baked for 8 minutes and they came out harder than I wanted so I baked my second batch for 6 minutes and found they were perfect. They harden up as they stand. Id make this again for sure but maybe add just a touch more molasses"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juliajkim"
},
"reviewBody": "I just finished baking the cookies and they came out AWESOME!! I never liked the traditional gingerbread cookies and never finished eating one of them. But these are so delicious I can't stop eating!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sublimenade"
},
"reviewBody": "Really, really dry! Had to add water to the dough. Good taste though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "may"
},
"reviewBody": "This recipe has become a tradition in our home. I find it needs less flour so I add it slowly until it forms a nice dough. I substitute molasses instead of corn syrup and go heavy on the orange zest. It is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "I made these gingerbread cookies with my first grade class and they turned out perfectly! I substituted the corn syrup for molasses and rolled the dough between 2 sheets of waxed paper, as others recommended. I was a bit worried because the dough seemed dry and crumbly at first and I only had 3 hours to refrigerate it, but it rolled out perfectly. The best part? The kids all loved it! Will I make these again next year? YES!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Keith"
},
"reviewBody": "Just use molasses instead of corn syrup! Best gingerbread cookies ever!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sushidrake"
},
"reviewBody": "This recipe is delicious. I made two sheet pans of gingerbread last year and build an incredible gingerbread house. eating all the construction scraps was delicious. Never been a big fan of gingerbread, but this recipe changed my mind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C Middleman"
},
"reviewBody": "This is the best gingerbread cookie recipe I've tasted without a strong molasses flavor and with a taste of orange."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Gadacz"
},
"reviewBody": "I loved the taste of this recipe, but my gingerbread turned out kind of crumby. I made it work. My sons actually needed it for a school project and modeled it into their letters of their name and initials. Maybe I did something wrong, but mine did not roll out well. Like I said, I made it work. Anyone else have a similar problem. Was the dough supposed to be like that?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Reinhard"
},
"reviewBody": "This recipe is really great. I have made both with and without the orange zest, and have found that the zest really adds a nice touch and flavor. I made these a few Christmases ago, and then again for my boyfriend for Valentine's Day. He loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Noel"
},
"reviewBody": "Amazingly Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "This has been my go to recipe for the past 5 years. I love the crisp gingerbread cookies and the orange zest adds an extra something. I make exactly as written and have always had good results. The kids are making some now to frost later for Santa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "This has been my go to recipe for the past 5 years. I love the crisp gingerbread cookies and the orange zest adds an extra something. I make exactly as written and have always had good results. The kids are making some now to frost later for Santa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tich"
},
"reviewBody": "Just like some of the previous reviewers mentioned, this cookie does taste great. It's moist and orange zest is great. However, it is quite greasy and it does spread out and puff out a lot. It is also very difficult to keep from breaking if you have any cutouts with smaller, thinner parts. I've tried this 3 times and although we enjoy the taste, I will look for other recipes, because it's such a pain to work with even after refrigerating overnight and using small batches while the rest waits in the fridge. You could use another cup of flour if you have the same issue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin MaLoon Rowley"
},
"reviewBody": "The flavor is great! I was very dissapointed however that they didnt hold there shape AT ALL when they baked! I was super frustrated with the time that it takes to roll out cookies that don't even stay the shape you made them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra Bourne"
},
"reviewBody": "Excellent! The best Gingerbread I have tasted, since it not very gingerbready, instead it is sweeter. My kids loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wildflower4182"
},
"reviewBody": "I went the more natural route and used molasses instead of corn syrup...they came out delicious!! This year, going to try gingerbread house with this recipe...Nephew couldn't stop eating the dough lol...it's that good :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Rincon"
},
"reviewBody": "Wow, these are wonderful, crisp and chewy at the same time. The orange peel adds so much to the spices. I too made a few changes, mainly using dark molassas and about 1/4 tsp. more of cinnamon. I used a pumpkin cookie cutter and made them for my grandkids for haloween. I will use this again at Christmas for cut out cookies. Oh I added about 1 tablespoon more molasses and rolled on floured partchment paper. No problems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLM91"
},
"reviewBody": "OH MY GOODNESS!! I was craving gingerbread cookies, but had no recipe for them. I tried a recipe on another site, with no sucess, until I found this!!! I did not have any dark corn syrup so I substituted for blackstrap molasses. I hate the taste of molasses, but these cookies were perfectly balanced and delicious. Even my hubby, who isn't a gingerbread fan, loves them!! I found I had to add a little water to the chilled dough as mine was a little crumbly, but otherwise they were perfect!!! Will definitely be baking again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Raihana"
},
"reviewBody": "AMAZING flavour and crispy - just how I like it. I rated 4 because it is humid here in Singapore and it is just impossible to cut out the gingerbread men as the dough became sticky fast. So i worked in batches, just enough dough taken out from the fridge to fit one baking tray. \n\nI rolled out the dough on lightly floured baking paper, pressed down the cookie cutter and before I removed the cookie cutter, I peeled away the extra dough around it. I was left with the gingerbread man and then I transferred that to the baking tray. It's time-consuming but I wouldn't trade the recipe for anything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Marie Salvesen"
},
"reviewBody": "Amazing! the citrus flavor completely cancels out the weird aftertaste that most gingerbread cookies have. I made these for Christmas and everyone wanted the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pink-raspberry"
},
"reviewBody": "As someone who isn't a big fan of gingerbread, this recipe completely won me over. I substituted molasses for corn syrup and didn't have any ground cloves, but it was still delicious! Roll the dough thin or thick depending on how chewy/crispy you want them. Mmm. The whole house smelled like Christmas :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Miller"
},
"reviewBody": "This is seriously the best gingerbread I have had! I hated to give them away they were so good. The orange zest is really subtle but really puts this cookie above all the rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Seidenspinner Durjan"
},
"reviewBody": "best gingerbread dough I have ever worked with! Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "12.12.13 ... https://www.allrecipes.com/recipe/11165/gingerbread-boys/ ... I changed the spices some - 1 1/2t ginger, 1 1/2t cinnamon, 1/8t cloves - &amp; I didn't \"do\" the orange bit; but I'm still gonna rate it. Using the spices as I did, it was a very light gingerbread taste. I don't see how using more cinnamon than ginger would give it a more gingerbread taste (enough to call it gingerbread even). 'Think these are more of a spice cookie. The cookies are fine, but not exactly a great choice for cutouts - as someone else said. They aren't bad, but details blur. Just okay. I didn't have a problem rolling after refrigerating then letting warm up some. I subbed honey for dark corn syrup. If you like the light taste (&amp; color btw), maybe just \"log\" it &amp; slice. :) A few days later: Just told by the 14yr old boy, I'd have to make 'em again. :? Really?!? Guess I'll be the one using the log &amp; roll tip! :D (Oh, used a simple vanilla glaze with 'em - tasted like the cinnamon roll frosting from Pillsbury) To sum it up, three stars from me; but up to four since the kids actually had a positive comment. :D Big news - well, kind of - there's no need to grease the pan. The flour will keep them from sticking. Greasing the pan will make them spread more. Note4Me: NINJAbread boys - :) By scent, predominant ginger. Can't tell cinnamon really. no molasses, but dark corn syrup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mariebluelily"
},
"reviewBody": "I liked these a lot first time ever making gingerbread. My guest were half and half some didnt like the orange flavor I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IceBear"
},
"reviewBody": "This recipe rocks. I'd never made gingerbread before, and not only was this really easy, but the results were delicious - a new favourite, and appeals to both traditional gingerbread fans and those who like cookies but not necessarily traditional gingerbread! Light texture, beautifully spiced, easy to work with and roll out, and the orange peel is a wonderful touch. I substituted brown Demerara sugar for the white sugar and it worked out really well. To answer some earlier comments: a) to roll out after chilling, I found I had to cut the dough into quarters then the small pieces were easier to roll out (while still chilled); b) I had to watch not to roll these too thin (not less than 1/4 in.), and to watch the time and not bake longer than 10 min., or they would singe or get too \"crispy\" (overdone); c) also by rolling out and using the cookie cutters on only a quarter of the dough at a time, it mostly avoided the problem of the dough getting too warm and soft to roll out/cut since you were always working with dough that was still a bit chilled up until the last few cuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susanna"
},
"reviewBody": "THE BEST 4 STARS GINGERBREAD COOKIE RECIPE EVER ! I must of read/reviewed and tasted over 100s of these GB recipes from friends and family over a couple of years and I almost gave up trying out my own. I give this first batch 4 stars only because it was abit bland for me and my husband but perfect for my toddlers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ransomedheart"
},
"reviewBody": "These are difficult to roll out. The flavor is really good but it needs more ginger and at least 3 Tbsp real molasses instead of 2 Tbsp corn syrup to make it more like gingerbread. \nOverall I wouldn't throw the recipe away because it tastes great. But I would use a different recipe if you want to use cookie cutters."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11165/gingerbread-boys/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11165/gingerbread-boys/",
"name": "Gingerbread Boys"
}
}
]
}
}
, "about": [
]
}
]