				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Gingerbread Cookie Mix in a Jar"
,"datePublished": "1998-11-29T01:57:18.000-05:00"
,"dateModified": "2022-12-06T19:05:07.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Staci"
,"url": "https://www.allrecipes.com/cook/24328367"
}
]
,"description": "Gingerbread cookie mix is layered in a jar; attach a gingerbread man cookie cutter and the baking instructions with a ribbon for a gorgeous gift!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yM8iZJjkr0SLSO62JYgquQOZVFU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Gingerbread-Cookie-Mix-in-a-Jar-Chef-Mo-c60116aec17140288b888d9524898089.jpg",
"height": 1124,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Gingerbread Cookie Mix in a Jar"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "43"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "137 kcal"
,"carbohydrateContent": "31 g"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "101 mg"
,"sugarContent": "12 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3.5 cups all-purpose flour, divided",
"1 teaspoon baking soda",
"1 teaspoon baking powder",
"2 teaspoons ground ginger",
"1 teaspoon ground cloves",
"1 teaspoon ground cinnamon",
"1 teaspoon ground allspice",
"1 cup packed brown sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together 2 cups flour, baking soda, and baking powder in a medium bowl."
} ,{
"@type": "HowToStep"
,"text": "Mix together remaining 1 1/2 cups flour, ginger, cloves, cinnamon, and allspice in a separate bowl."
} ,{
"@type": "HowToStep"
,"text": "Layer flour-baking powder mixture, brown sugar, and flour-spice mixture into a 1-quart wide mouth canning jar, in that order. Pack firmly after adding each layer."
} ,{
"@type": "HowToStep"
,"text": "Cover the jar with a lid and seal well. Write an instructions tag and attach it to the jar."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "So simple to make! Great gift just be sure to push down the layers and it fits perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Repp"
},
"reviewBody": "I love this recipe! I add the 1TB vinegar as recommended and they come out perfect every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leandie Erasmus"
},
"reviewBody": "This recipe is delicious and easy to make. Definitely add the tablespoon of vinegar as suggested by other reviewers. Also definitely at least halve, if not quarter the amount of cloves and allspice. I quadrupled the amount of ginger and added half a teaspoon of nutmeg.\n\nThe first time I made the recipe I halved it, but still used one egg. this resulted in delightfully soft gingerbread cookies. The full recipe with vinegar results in nice crunchy cookies that aren't too brittle. \n\nThe dough gets easier to work with the more it's handled after coming out of the refrigerator. I did not have trouble rolling the dough and cutting out shapes.\n\nThe cookies are tasty without icing sugar. Sweet, but not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJW1996"
},
"reviewBody": "Found this searching for edible gift ideas. Never made gingerbread cookies before and so happy to find a great recipe on first try. I made one \"test\" jar, let it sit for a day and then baked the cookies. I added 1TB vinegar as recommended in the reviews. I did find that the packed brown sugar really clumped hard even after only 1 day in the jar but it broke down fine when I worked it good in my stand mixer....I just wonder how it would be sitting even longer....I guess I'll find out when I make it again.\n\nAfter baking them These came out great....moist dough, easy to role out after refrigerating and cut with cookie cutters. I'm too lazy to do icing, but I dusted most with powdered sugar and even drizzled some caramel on a few because I had it leftover from another recipe. I served them at our church cafe and they got sooooo many compliments. Multiple people kept asking who made them and a couple of people who said they are ginger cookie fanatics said the caramel \"put 'em over the top.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "asha febinia"
},
"reviewBody": "I thought this recipe needs a little bit of fine tuning. I suggest halving the cloves (or even quarter it) because it's overpowering the other spices. I personally like to taste a bit more ginger and nutmeg. I used dark molasses and thus made the cookie taste slightly bitter, which is fine, if you plan to decorate the cookies with icing. But since I like this plain, I think I'll substitute with light molasses or even golden syrup next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GraceF"
},
"reviewBody": "Yum! I just finished cooking these in the oven, and man, the smell is delicious! I've never really been a fan of gingerbread, but can i just say, these taste delicious! The only reason I made these was because we needed to make taste testers for our GALA Day at our school, I was on cooking duty and managed to sneak one biscuit in before handing them in! I did add the one tablespoon vinegar, as all the comments suggested. Credit to whoever made this, hopefully there will be a lot more compliments as everyone tries one tomorrow! THANK YOU VERY MUCH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wynskyn"
},
"reviewBody": "I added the 1 tablespoon vinegar that has been suggested as well and these cookies were fabulous!\n\nWhen putting them in jars, I recommend splitting the first flour mixture in half and layering flour, 1/2-cup brown sugar, flour, 1/2-cup brown sugar. Then finishing off with the spices. Makes it easier to pack down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mamalisa"
},
"reviewBody": "Don't know what I'm doing wrong but I simply can't fit all the ingredients into a quart jar. I've been pushing it down like crazy but it just won't work. Too bad! They smell delicious and it looks like a great gift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicola Olsen"
},
"reviewBody": "This was a great gift for a friend at Christmas, but you need a really big jar to fit all the dry ingredients in. From the picture the jar doesn't look that big, but I had to use 2 big spaghetti jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "As is, this recipe does NOT fit in a quart sized jar. There are more than 4.5 C's of ingredients to fit into a 4 C jar, sadly, I didn't realize that until it was too late. My pretty gift-jars come with an extra baggie of 1/2 C flour/spice mixture! So, adjust the recipe/servings accordingly. I baked them first to see if they were yummy and, with the other reviewers suggestions they were! Soft and chewy, the way I like my gingerbread. Adjustments made: -halved all spices except cinnamon -added 1 TBSP of vinegar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christmaszorro"
},
"reviewBody": "Great idea"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Black"
},
"reviewBody": "My family loves the crunch and snap of gingerbread. These cookies have become a holiday must have. Halve all of the spices except for cinnamon. Can be made without allspice in a pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "I made a batch for my family and I did add the 1 Tablespoon of vinegar as was recommended and they came out perfect… so I then proceeded to make 12 more jars for Christmas gifts. They are amazing! I handed them out yesterday, and I’ve already received five phone calls asking for the specifications to the measurements so more could be made. I compressed everything when measuring and added the flour mixtures in the jar about a ½ cup at a time, and there was plenty of room to spare at the top. Just be sure to watch them in the oven, and check on them... for ours, they were done in aproximately 9-10 minutes.\n\nAlso, if you are making many jars of this recipe, as I did, I found that about four jars takes up roughly one 5 pound bag of flour (with about 1-1/2 C left over) and roughly one 2 pound bag of brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "This is my 3rd year making these cookies. At Christmas time, this recipes has become my speciality cookie. Everyone will request I make them a batch. I place two cookies in a cookie bag and decorate with ribbon. I even have gingerbread parties--the kids and adults like decorating them. What a way to give instead of gift buying!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Talia"
},
"reviewBody": "I found this to be a wonderful recipe. It is true that the cookies come out a littel hard. I baked mine for seven minnutes. They soften up nicily if you put frosting on them and let them sit for a while. It is also helpful to use the suggested changes from the other reviewers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beannay"
},
"reviewBody": "My 4 year old loved the taste of these cookies. My house smelt wonderful. They were a little difficult to cut out for children since the dough split very easily. I will make them again if I can't find a recipe that tastes as good but holds together a little better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MegInTheSandbox"
},
"reviewBody": "The dough was a little harder to work with than hoped, but the taste and smell of these soft cookies are fantastic! For perfect softness, cover with a cloth as they cool until just warm. Then transfer to zipper lock bags or airtight container with a slice of apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was great fun to make and hopefully the kids grandparents will enjoy it too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AshleyH"
},
"reviewBody": "Delicious gingerbread cookies! The best I've had. Fun to make too. I took other people's suggestion and added the tablespoon of vinegar and they weren't one bit crubly. They stayed fresh tasting and chewing for over a week! I was shocked. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "FABULOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSNIBBLE"
},
"reviewBody": "This was a wonderful recipe. The cookies came out great, nice and chewy. I used this as a Christmas gift for teachers and neighbors, tying on a cute gingebread man cookie cutter with wraphia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am giving it out this year in bags! (Added the vinegar to mine too) HERe is a poem I am going to attach with a cookie cutter.Credit to Me (Madeleline McJones mom in the hat)\r\n\r\nAnd It happened this way, they will all come to say\r\nThat mom was cooking, some cookies that day\r\nAnd her daughter was helping, as daughters will do\r\nAnd the cookies were making baking smells too\r\nThe daughter said something,\r\nShe said something loud and she said it quite clear.\r\nShe said “This is the best day I have had all year!”\r\nThose few simple words on that baking day\r\nSurprised mommy so, she did not know what to say\r\nThat moment had caught that mom off guard, \r\nBut since she was busy she did not think on it to hard.\r\nThose words that had came out sounded so sincere\r\nThat mommy replied, “I am proud of you, dear”\r\nBut from that moment on, to this very day \r\nMommy planned on giving cookie cutters away.\r\nSo she had been shopping and shopping \r\nOn, you guessed it, EBAY!\r\nSo here you go, you may get one or two \r\nThey my be dingy and old, they may be shiny and new\r\nBut either way they will make cookies for you\r\nFind yourself a friend, any toddler will do\r\nThen cook up some cookies, They are good for you!\r\nThey do not come from a box, a bag, or a store \r\nAnd they do take some time and make a mess on the floor \r\nBut if you are lucky your partner may say\r\nThose words that make that mommy cry to this very day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe for everyone I knew for Christmas presents and they all LOVED it. I got so many compliments and requests for the recipe. The best part was the spices mixture being on top, as soon as you open the jar it smells wonderful. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My daughter loved these cookies. I reduced the cloves to half a teaspoon, because I thought it would be too spicy and I added 1 tablespoon of vinegar which kept the dough from being crumbly. I burnt one batch and they were hard as a rock so be careful not to cook for longer then 10 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAIRBEAR"
},
"reviewBody": "I gave these as gifts and everyone raved about them. They are very fun to put together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KYLEEH"
},
"reviewBody": "I made this for Christmas gifts. I added a little copper cookie-cutter tied on with raffia. I baked some myself to be sure it was good and they turned out great! I will likely make them again this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not a good dough, dry and crumbly. After refrigerating could not even make a ball of dough in my hands. Ended up adding, gradually, almost 3/4 cup of water! Kids were frustrated that the reciple didn't work. Cookies were so dry they baked fast, taste is so-so. Will search for better, moister, easier gingerbread cookie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THIS WAS NOT THE BEST RECIPE. THE DOUGH WAS VERY DRY AND CRUMBLY, AND THE COOKIES WERE VERY HARD. I ADJUSTED THE TIMING SHORTER, THEY WERE BETTER, BUT I WILL CONTINUE TO LOOK FOR OTHER GINGERBREAD RECIPES. MICH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these with my kids and they were great! Soft &amp; chewy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIAKISS"
},
"reviewBody": "So easy to make and they taste great. The whole family said \"Thanks Staci\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great gift and great cookie! I enjoyed giving these out in '99 and look forward to it again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VEGGIE4343"
},
"reviewBody": "This was the best recipe I have found for gingerbread cookies. Good and spicy. The dough was very easy to handle too! I will be making them again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made delicious cookies - soft, but crispy. My kids had a blast helping!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It tastes great. My kid is handing them out for X-Mas gifts to teachers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was soooooooooooooo fun! I can't wait to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was great for my clinets at the care home. Thay can make this and give to family with pride."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11135/gingerbread-cookie-mix-in-a-jar/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11135/gingerbread-cookie-mix-in-a-jar/",
"name": "Gingerbread Cookie Mix in a Jar"
}
}
]
}
}
, "about": [
]
}
]