				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Gingerbread Whoopie Pies"
,"datePublished": "2012-12-13T15:09:02.000-05:00"
,"dateModified": "2020-06-18T23:52:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "These spicy whoopie pies are flavored with cinnamon, ginger, and molasses. Filled with a cream cheese frosting, they make a fun treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MJcrIKGmwuf4IfZJdIK_IeD54ng=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1585152-aaad55af58cd48d580ee4a27b59d87bd.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2021050232001",
"description": "This holiday take on the traditional treat will make you say \"whoopie!\"",
"duration": "PT4M29S",
"name": "Gingerbread Whoopie Pies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0633b7a3-3584-4021-8968-d8389194b826/8739a285-eda8-4833-bb25-00f9190c89c6/1280x720/match/image.jpg",
"uploadDate": "2021-07-27T03:21:26.564-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Gingerbread Whoopie Pies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "38"
}
,"cookTime": "PT12M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "423 kcal"
,"carbohydrateContent": "63 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "371 mg"
,"sugarContent": "42 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"10 ounces all-purpose flour",
"0.5 cup white sugar",
"0.5 cup dark molasses",
"2.5 teaspoons ground ginger, or more to taste",
"1.25 teaspoons baking soda",
"1 teaspoon ground cinnamon",
"0.75 teaspoon salt",
"0.33333334326744 cup vegetable oil",
"1 egg, beaten",
"0.33333334326744 cup boiling water",
"Filling:",
"2.5 cups confectioners' sugar",
"1 (8 ounce) package cream cheese, room temperature",
"0.25 cup butter, room temperature",
"2 teaspoons heavy whipping cream, or as needed",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or a silicone baking mat."
} ,{
"@type": "HowToStep"
,"text": "Combine flour, white sugar, molasses, ginger, baking soda, cinnamon, and salt together in a large bowl. Mix in vegetable oil and egg until combined. Pour in boiling water and whisk until smooth."
} ,{
"@type": "HowToStep"
,"text": "Drop dough in balls onto prepared baking sheet, about 1 inch apart, using a 1-ounce cookie scoop."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until puffed and golden, about 12 minutes. Allow to cool on the pan for about 5 minutes before transferring onto a rack to cool completely."
} ,{
"@type": "HowToStep"
,"text": "Beat confectioners&#39; sugar, cream cheese, butter, cream, and vanilla extract in the bowl of a stand mixer on low until combined. Increase speed to high and beat until light and fluffy."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MJcrIKGmwuf4IfZJdIK_IeD54ng=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1585152-aaad55af58cd48d580ee4a27b59d87bd.jpg"
}
]
,"text": "Spread about 2 teaspoons of filling onto the bottom of a cookie; top with another similarly sized cookie. Repeat with remaining cookies. Chill for 30 minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT72M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was awesome. I used a swiss meringue expresso buttercream for filling. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Girl"
},
"reviewBody": "It was great! Soft and chewy! I even ran put of molasses and had to use a corn syrup/brown sugar substitute and it still turned put well!A definate family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "These were fantastic. Nice change from the regular cocoa based cookies. I made a different filling instead of this cream cheese based one but loved the cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridgette Gladwin"
},
"reviewBody": "Followed exactly, my oven must run hotter, only baked for 10 mins\nThank you for the great, tasty, yummy recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah kokosa"
},
"reviewBody": "You should watch his video before making!!! Most people that are having issues appear to be having difficulty with their batter. If you measure the flour by weight and adjust the boiling water by the consistency of the batter (We needed a splash or 2 more than the recipe stated) it will turn out perfect. These were absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danab"
},
"reviewBody": "First, I should note that I did have to make alterations due to family food allergies/intolerances; however the recipe still turned out very well. My subs were Bob's Red Mill 1 to 1 Baking Flour, Simple Truth confectioner's sugar (made with tapioca starch instead of corn starch), soy-free Earth Balance, and Daiya cream cheese. fyi, we used canola oil for the vegetable oil and simply omitted the cream. \n\nYou would think with all of my subs that the recipe wouldn't turn out the same, but i believe it did. The results were excellent. I did have to add more flour, probably partly due to the gf flour and partly due to my living in the high desert. After reaching the consistency shown in the video, I proceeded. The cookie is soft and delicious, a perfect cookie for the whoopie pie. The filling was super-sweet, hence my 1-star deduction. This was solved by cutting the pies in half :) My kids and I agreed they were much better cold. I forgot to take pictures, but the pies looked exactly like those shown in the recipe.\n\nThis recipe's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ezmarelda"
},
"reviewBody": "These turned out amazing!! I have been told that this recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jami Farris"
},
"reviewBody": "These spread out a bit more than I anticipated. The edges were a little crunchy for me. Perhaps I baked slightly too long. However the flavor was really good and the filling was great. Much better after setting up in the fridge for a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndyAck"
},
"reviewBody": "This turned out the way I usually make my whoopie pies. I am a New England girl and make the chocolate ones frequently for family events. I started making changes a few years ago with pumpkin whoopie pies with cream cheese filling so making the gingerbread turned out great and will make them again for Christmas for the family gathering. I don't use heavy cream but half and half if needed for consistency. I used 2 cups of all purpose flour and they came out perfect! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "Well I definitely should have read the weighing the flour note before baking these BUT I ended up baking them a little longer and crumbled them up for cake balls. I used about half the filling recipe mixed with the “cake” then made them into balls, froze them for 1/2 hour, then drizzled the remaining filling over the top. They actually turned out pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Stoy"
},
"reviewBody": "Since I did not see the footnote until I was finished (It was not included in the printed copy. Next time, use an asterisk!), my batter was too runny for cookies. I poured it into an 8 X 8 pan and baked it for 25 minutes and iced it with a 1/2 batch of frosting. It is fine this way, but not what I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flower1!"
},
"reviewBody": "I made these, but filled them with maple filling per my grandson’s request. That were fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "puerca83"
},
"reviewBody": "These turned out great! I'm from Maine, so whoopie pies are a big treat for me! The gingerbread was a nice twist on the classic chocolate and the cream cheese filling was delectable instead of the usual vanilla icing. I agree with other users, follow this recipe EXACTLY, especially the part about adding the boiling water to the dough and how the texture should look and you'll be just fine. People who are complaining about the texture most likely didn't do this--they should look like very viscous gingerbread cookies on the baking sheet when you prepare them, and turn out to be well-formed, soft cookies. They will create the perfect shape just because of their texture, you shouldn't have to shape or cut them into circles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Micaela Lees"
},
"reviewBody": "These are great. The gingerbread taste is light and the icing tastes yummy with it. If I make them again, I'm going to also make some whip cream and fold it into the icing as it will be fluffier"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattiB"
},
"reviewBody": "Llooknhh licrigh@"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MVK"
},
"reviewBody": "I wasn't able to drop the dough in \"balls.\" It wasn't a consistency that could form balls. However, the dough puffed up a bit in the oven. It made soft and slightly puffed cookies, which seemed a fine form for whoopie pies. The flavor was good and a nice match for the sweet frosting. This is a good dessert for those with less of a sweet tooth. So many holiday treats are super sweet or super rich. This is a nice change of good flavor that is not over powering or heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Zach"
},
"reviewBody": "They tasted fine, but they came out flat, and the dough was liquid. Never making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sillyworm"
},
"reviewBody": "I followed the recipe and got rave reviews - at the party I took them to. They were all eaten quickly. However, they were just too sweet for my taste. The gingerbread part was lovely by itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was such a dissapointment the cookies came out flat as board and hard as a rock and I followed the recipe just like it said. I wanted to like this but something didn't go right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SarahBusch39"
},
"reviewBody": "This was such a dissapointment the cookies came out flat as board and hard as a rock and I followed the recipe just like it said. I wanted to like this but something didn't go right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "There are many varieties of whoopie pies and I’ve learned you judge whoopie pies on what you are used to. I’m still a big fan of the chocolate whoopie pie but this was nice variation for the fall. The cake portion in wonderful, especially if eaten the following day allowing the spices to meld. The cream center was way too sweet for me and I would substitute the filling I use on my regular whoopie pies. Other than that, it was a nice treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mommaDowell"
},
"reviewBody": "The gingerbread was a flop for me and I didn't care for the taste. The cookies didn't rise. I'm sure it was because the flour is given in pounds instead of cups and my scale may have been off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "I have made these 5 times and everyone loves them and asks for the recipe I followed the recipe and they come put perfect every time thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CupcakeGirl"
},
"reviewBody": "These are delicious but very much like a cookie. I would have loved for a cake like puffy whoopie pie. The filling is delicious and plentiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marsia Hill"
},
"reviewBody": "I tried these and the cake did not rise. Not what I was expecting. luckily my husband will eat them as cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacque Tanner Levine"
},
"reviewBody": "I had to make these twice, I mistakenly used a measuring cup &amp; measured out 10oz.of flour, when I reread the directions I saw the footnote from the chef, so thought I could just add the remainder of the flour to measure 2 cups, the cake came out like a Pfeffernusse,So I tried again using 1 1/2 cups of flour &amp; they came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gnvrlnn"
},
"reviewBody": "The gingerbread didnt rise. I used a scoop &amp; these were 2x the size they should be. The filling was too liquidy &amp; I tried to save it with more powdered sugar but I didn't want to use the rest of my powdered sugar. It was some what better after sticking it in the fridge for a bit. These were a disaster &amp; no one ate a complete cookie but me. Everyone took a few bites &amp; didn't like them, lucky to my sweet tooth I ate the entire batch. I'm going to try another gingerbread recipe &amp; frosting, I'll stay away from gingerbread whoopie pies. I didn't read till later to weigh the flour &amp; it would have been an option but I'll pass, thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen G"
},
"reviewBody": "Great recipe! The combination of gingerbread and the cream cheese filling is delicious. I recommend using more filling per pie than you think is necessary (it can get a little lost in the fluffy cakes) and using a toothpick to keep it together while it firms up in the refrigerator."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crissy"
},
"reviewBody": "Stumbled upon this recipe and I'm glad I did! They are delicious. My son has requested more. He said they are \"AMAZING\" ! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Good but don't cook for 12 min, learned the hard way on the first batch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frankifer"
},
"reviewBody": "Highly recommend following Chef John's advice of weighing your flour to be absolutely sure. Followed recipe exactly and the \"pies\" turned out fantastic and utterly delicious! Cookie stayed moist with a strong but very pleasant molasses flavor. Filling was perfect, smooth and overall not too sweet. Chef John, you are one of my absolute FAVORITES. Every one of your recipes I have made has turned out marvelous. Your personal style lends to the intuitiveness of your most helpful videos, even to a neonatal-novice like myself. And I SO enjoy your charming humor! \nThanks again Chef!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian S"
},
"reviewBody": "I watched chef John's video and followed his recipe exactly as written. Well, almost exactly - I doubled the recipe for a class party. These were easy to put together with very little mess. The cakes baked up in the expected amount of time. The size came out very consistent using my cookie scoop! A stand mixer came in very handy for putting the filling together. I gave it some time on high speed to make sure it was properly fluffy (watch the video).\nI took the completed pies to a class of 5th graders for their holiday party and most of the kids finished them. After just one bite, one boy exclaimed \"I will have an order of 20!\" He followed up with my daughter later to ensure they could be delivered after the holiday break :). At home, we put the extras to good use. The gingerbread flavor was present but not overpowering. The combination of the gingerbread cake and the cream cheese filling was light and the textures perfect. Overall, a great dessert! The doubled recipe made 28 complete whoopie pies. The cream however, was probably 50% more than what was needed. No problem, we will just make more whoopie(s)! \nWe appreciated the video as it was instructive and a good length. Our 5th grader did not appreciate his quirky sense of humor, but then that was not the intended audience. We will be looking for more of your recipes. Thanks Chef John!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230499/gingerbread-whoopie-pies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16417/desserts/cookies/whoopie-pies/",
"name": "Whoopie Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230499/gingerbread-whoopie-pies/",
"name": "Gingerbread Whoopie Pies"
}
}
]
}
}
, "about": [
]
}
]