				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Gingerbread Men"
,"datePublished": "1998-12-14T12:49:35.000-05:00"
,"dateModified": "2022-08-08T11:39:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kim Mills"
,"url": "https://www.allrecipes.com/cook/24325237"
}
]
,"description": "This recipe for gingerbread men uses butterscotch pudding mix and doesn&#39;t require molasses!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3P2hjPWT5d8NkaDdV_OTRLv1ZnE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/797434-a8ca639a4c3a46c9a8dc5c4f0489d88d.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1832683410001",
"description": "See how to make easy 5-star gingerbread cookies.",
"duration": "PT4M42S",
"name": "Gingerbread Men",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4b226136-b25e-4f83-9f6f-46e12a5fdac7/da58c3ac-d5e2-41f4-889b-615b220584e6/1280x720/match/image.jpg",
"uploadDate": "2021-07-16T23:28:55.449-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Gingerbread Men"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "1007"
}
,"cookTime": "PT12M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "79 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "14 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "63 mg"
,"sugarContent": "6 g"
,"fatContent": "3 g"
,"servingSize": "2 1/2 dozen"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (3.5 ounce) package cook and serve butterscotch pudding mix",
"0.5 cup butter",
"0.5 cup packed brown sugar",
"1 egg",
"1.5 cups all-purpose flour",
"0.5 teaspoon baking soda",
"1.5 teaspoons ground ginger",
"1 teaspoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the dry butterscotch pudding mix, butter, and brown sugar until smooth. Stir in the egg. Combine the flour, baking soda, ginger, and cinnamon; stir into the pudding mixture. Cover, and chill dough until firm, about 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease baking sheets. On a floured board, roll dough out to about 1/8 inch thickness, and cut into man shapes using a cookie cutter. Place cookies 2 inches apart on the prepared baking sheets."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3P2hjPWT5d8NkaDdV_OTRLv1ZnE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/797434-a8ca639a4c3a46c9a8dc5c4f0489d88d.jpg"
}
]
,"text": "Bake for 10 to 12 minutes in the preheated oven, until cookies are golden at the edges. Cool on wire racks."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT97M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Okay please listen up all of you avid bakers out there! I’ve eaten all types of gingerbread cookies, and these are absolutely the best! I was all over the Internet, trying to find the best recipe (and preferably one without molasses so I didn’t waste the rest of the jar) to make to give as gifts for Christmas, and this one is definitely it! Now, after reading some reviews online, I found that the best way to modify this recipe was to also increase the cinnamon to 1 1/2 tsp and add 1/2 tsp cloves and 1/4 tsp nutmeg (per batch). They rolled out like a dream and were SO good, even before we iced them. This recipe will become one of my annual Christmas cookie recipes! A double batch made 32 cookies! I also made them in a Wilson form pan which made them easier and I didn’t have to roll out (my preferred way from now on) they don’t spread in a pre formed pan and we’re chewy and delicious! I’m leaving this comment so others can feel safe in using their expensive ingredients and not worry that they’re going to waste them. I promise you won’t be disappointed, if you follow these instructions! They tasted magical! 🎉😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making these cookies over 20 years. I recently misplaced my hard copy and had to look online to try and find it, as I could not remember all the measurements. This is the one!!! ( although I use more cinnamon). I did read through many reviews and thought I could try to address some concerns I read as well....\n1- Dough to sticky? Add some flour. Its not supposed to stick to the countertop. \n2- Do you make the pudding ahead if time? No, just dump the box in with the dry ingredients. \n3- Does this taste like butterscotch? No, not at all! \n4- Does this taste like traditional gingerbread? Um, no. ( better, IMO) \n\nAnd some helpful hints: Roll your dough thick ( just over 1/4 inch) for softer cookies and no crunchy hands and feet.\nI live in Denver. I use the shorter end of the baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "There wasn't too much of a flavor to these. Just make sure you cut them on the thicker side. They bake quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jojo Ho"
},
"reviewBody": "Easy recipe and the the cookies were perfect. This will be my 5th batch. I have shared it with neighbors and family. They loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kbeachw"
},
"reviewBody": "These are so good, perfect for kids as others stated. Roll it out right on some parchment fit to your cookie sheet, remove the excess, pop the pan in the freezer for 5 minutes. Freezing helps them keep their shape when they bake. I rolled them a little thicker at 1/4” and they were perfect at 350 for 10 minutes 30 seconds. Thank you for the recipe!! Mix the pudding in dry as stated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hannah"
},
"reviewBody": "This was a very interesting recipe! I love the reindeer pictures too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan Langley"
},
"reviewBody": "The recipe was easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Liz"
},
"reviewBody": "I make this every year for Christmas. I love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gribowjm"
},
"reviewBody": "This recipe was super simple and easy and tasted great too! Not to spicy and baked up nice. Will be our go to gingerbreads from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Small"
},
"reviewBody": "This recipe is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "icooknaked"
},
"reviewBody": "I made it exactly as written. It made probably a dozen large cookies (we made a variety of sizes). When it is first mixed together it is very dry and crumbly. Don’t worry it comes together after refrigerating and kneading. I rolled them out between two pieces of parchment paper, no need for flour. Then popped them in the freezer for a few minutes before baking to help them keep their shape. They hardly spread at all. Very mild gingerbread flavor. I would actually add more spices next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "So nice to be able to make gingerbread men for Christmas without having to buy molasses, and then trying to use it up after. They have a nice gingerbread taste, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "epspugnardi"
},
"reviewBody": "Theses are SO delicious! I make them for friends and family at Christmas, and I get so many compliments!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malgorzata Idzkowska Edmonston"
},
"reviewBody": "WARNING \nif you make this cookies once you'll never come out of the kitchen but you will be baking them for the rest of your life for your grandkids the best and easy to do"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smbaker906"
},
"reviewBody": "I made these in a pinch when I realized I was out of molasses but happened to have a box of butterscotch pudding mix in the pantry. The dough was easy to work with, but I was rather disappointed with the taste. I prefer a very traditional gingerbread flavor, and these just seemed bland. My daughter loved them, though. I also baked them for 8-10 minutes rather than 10-12 to prevent the edges from burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beach Livin"
},
"reviewBody": "I’ve tried several gingerbread recipes over the years and this is my favorite! I didn’t make any changes and it turned out great. I normally prefer recipes that are ‘made from scratch’ as much as possible so I was hesitant at first due to the box of pudding. My family is pretty picky and they all loved these. So I will continue to use this recipe every Christmas season. Thank you for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miranda"
},
"reviewBody": "I never made gingerbread cookies before and I’m so happy I used this recipe! They are delicious! I added a simple royal icing after to add a little more sweetness but honestly they are great as is. Followed the recipe exactly but baked for 8 minutes. I think the full time definitely would’ve burnt them. The dough seems dry after first taking from the fridge just let it rest at room temperature for about five minutes and it’s good to go. I also split my dough in three batches leaving the batch I wasn’t using refrigerated because it does get very soft fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Badger"
},
"reviewBody": "These were pretty good, I did add some extra ginger and cinnamon and a dash of salt. The flavor is still not as strong as regular gingerbread, but we did enjoy them. The batch size is rather small, I had to make 2 batches to end u with a little more than I would normally expect from one.\nI will likely make these again, especially with the smaller batch size. Less quilt if I eat all of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wazevedo"
},
"reviewBody": "I doubled the recipe and used chocolate pudding. yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany S"
},
"reviewBody": "It was a good cookie i like the switch for butterscotch pudding mix i had to add another half cup of butter the dough was to dry without it kept crumbling and less time first two batches burned i probably have a hotter oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Brandon"
},
"reviewBody": "Not as spicy as regular gingerbread but moist and delicious! Most folks comments about dryness, I could see during mixing and after refrigeration but I just worked the dough a little more then I usually would and the butter warmed right up and added the moisture needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eve S"
},
"reviewBody": "Made exactly as recipe stated. These held their shape well and had a nice mild ginger flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Poland"
},
"reviewBody": "I had to make some sturdy cutter cookies of 3 types that would not all break apart when I flew on a plane to Kansas. Theme was related to Wizard of Oz, so I found cutters and searched for a few good recipes. \n\nThis one became the flying monkeys. \n\nI added some Fireball whiskey and extra seasonal spices. It seems that it was a bit more moist then the original recipe described. So even though I froze them before cooking they spread out a bit. It did not matter. Because fatter monkeys fly better! LOL!\n\nResult was a few broke but not badly, legs are thinner. I used broken pieces for tasting for the silent auction. Total brought in forty dollars to a non profit for the late deafened. This is totally worth trying again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sgsealy"
},
"reviewBody": "Disclaimer: I have never eaten nor made gingerbread before. My daughter read the book The Gingerbread Man and asked to make our own gingerbread men so I chose this recipe. Made it exactly as written and it turned out great! The dough was easy to work with and the cookies were not too hard or too soft. I could taste the ginger but it was mild, so if you're looking for a spicier cookie this may not be it for you. My kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Indu Dadwal"
},
"reviewBody": "My kids loved it. I'm making g it again today!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie May Cook"
},
"reviewBody": "These cookies are so good!! Made them for Christmas and everyone loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JILLY"
},
"reviewBody": "Followed recipe as written. TERRIFIC flavor, rolled out well and cut out well. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephen Myler"
},
"reviewBody": "Good for kids. Not amazing, but definitely tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "I’m stuck! Just took this out of the fridge and it’s very dry. Breaks apart when I try to roll it. What should I do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Duffy"
},
"reviewBody": "Yummy, but not good for cut out cookies. I improvised the spices to my families liking and everyone liked them. However these cookies rise while cooking and stay pretty soft, so they weren't great as traditional gingerbread men cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britty87"
},
"reviewBody": "These came out so tasty! I took the advice of another reviewer and used my hands to mix the wet and dry ingredients otherwise it seems too dry to mix with a spoon. I accidentally grabbed instant pudding mix but it didn'tseem to be a problem at all. I also didn't have any ground ginger on hand only pumpkin pie spice. The mild gingerbread flavor is perfect for my family, my four year old loved them! They baked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Sheu"
},
"reviewBody": "I made these last year and they were a blast. Making them again this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn McKenna"
},
"reviewBody": "Love these! Best cookie cutter dough I’ve ever made. I added some nutmeg for some extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAWCHO"
},
"reviewBody": "Very nice! Just the right amount of gingerbread taste - smooth. Oh yeah, gonna eat them all and then make more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nana"
},
"reviewBody": "When baking my gingerbread cookies I found 10 minutes was to long. 8 minutes is perfect. They taste great and so simple to make. This is a keeper. Also the icing is wonderful. I recommend to use both."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spunkykitty"
},
"reviewBody": "Great recipe! I tried a different gingerbread recipe before and as I baked the other ones, they spread out really wide and the shapes were distorted. With this recipe, the cookies really held their shape! I’m making these from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLRYN1"
},
"reviewBody": "Added 1/2 tspground cloves and nutmeg to add little more spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vee"
},
"reviewBody": "I make these cookies for my kindergarten classes every year after reading many versions of the \"Gingerbread Man\" story. They love them. As many have mentioned before, most kids do not like true gingerbread. So this recipe is really great for those who aren't big fans of gingerbread... like me and quite a few 5 year-olds. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "This is the best gingerbread recipe. Especially if you find traditional gingerbread a bit too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookie E"
},
"reviewBody": "followed the recipe exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cat3605"
},
"reviewBody": "Very easy recipe to follow and cookies came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Licata"
},
"reviewBody": "Perfect texture with a balanced flavor, definitely not your typical gingerbread flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vojtech"
},
"reviewBody": "We made these tonight instead of buying a gingerbread house kit. Came out PERFECT! Baking for 10 minutes gave it a soft texture the kids could nibble on. The full 15 minutes made them sturdy to frost and build from. I may go a little lighter on the ground ginger, but that is just personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Sand-Espinoza"
},
"reviewBody": "I had to add 2 tablespoons of vegetable oil. The dough was very dry and crumbly. I also added 1/4 teaspoon salt because I used unsalted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aspeer"
},
"reviewBody": "A great gingerbread cookie dough. The butterscotch pudding softens the flavor and leaves these cookies nice and soft, chewy... A great cookie for those that do not like a harsh or spicy gingerbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "A. Diller"
},
"reviewBody": "This was a total fail. I'm not rating it lower because I may have been at fault. I used instant pudding instead of cook and serve because that is what my store carries- other reveiwes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We followed the recipe exactly and the cookies were a big hit. It was a 4 generational Christmas cookies baking day and a new favorite for all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcasa"
},
"reviewBody": "Fantastic!! I made the dough with my 5 year old and it turned out great. I did use instant pudding only because I can not read and purchase the wrong ingredients. Oops. These came out perfectly and are amazing!! Perfect balance of spice for the little ones yet the ginger taste is still present. The dough was crumbling at first but came together in the end. Our gingerbread people were a little thin and cooked in 8 minutes. This just became a new holiday tradition for our family thank you for an amazing recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Amory Smith"
},
"reviewBody": "These cookies are phenomenal!!! Do not refrigerate dough more than 1 hour and don’t use too much flour when rolling it out. I got 14 medium gingerbread men out of this. I’m not usually a gingerbread fan but I will make these every year!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mistry"
},
"reviewBody": "Incredibly easy and super delicious! The recipe is good as is! I added a bit more spice for my own taste though. No salt needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah.Cathey.84"
},
"reviewBody": "Super easy!!! I added just a drop of milk to make the dough easier to work with. But I love this recipe. Very easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "orourkjr"
},
"reviewBody": "I accidentally added nearly twice the amount of cinnamon and ginger but it turned out really good, so I will continue to make the recipe with the additional amounts. I'm glad I read the previous reviews and knew the dough doesn't ball together. The dough was very crumbly (I used my kitchenmaid mixer) but I followed others suggestions and just packed it together into a ball. Once I smooshed it all up, it stayed together. Rolled out very nice, hardly needed any flour on my table or rolling pin. The first batch was slightly too brown, so I reduced the time in the oven to 9 minutes and they are perfect. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Excellent for children who don't like molasses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Zamora"
},
"reviewBody": "Oh my goodness!!! I’d never made gingerbread before this recipe, so I had no idea how they’d turn out. I was able to make the recipe so easily, followed it to a T, while my 1 year old son was crying under my feet, and they still came out AMAZING! He ate them, and even my dad who doesn’t like gingerbread said they tasted really good! I’ll definitely be using this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "Made this for fun during the Christmas season and it turned out pretty good. I had to use about a 1/4 cup more butter to make the dough not so dry but turned out good. Family liked them and I had fun decorating them! Lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimi"
},
"reviewBody": "I love this recipe. I make it every Christmas time. I followed the recipe exactly. The dough is easy to work with if you chill it. The cookies come out soft and chewy. I use this recipe to make gingerbread men for my family to decorate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Matt Michaels"
},
"reviewBody": "These fell apart and wouldn’t cut into shapes. The dough was too soft even after it was chilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erdem dayi"
},
"reviewBody": "was nice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These turned out fantastic.\n\nSince I am not from America I couldn't get my hands on butterscotch pudding mix, so instead I got vanilla and decided to add the butterscotch flavour with a butterscotch cream alcohol, adding a touch more flour to maintain the correct consistency. I also used nutmeg instead of cinnamon as I prefer it, and the cookies turned out great.\n\nI will definitely be using this recipe again with my previous changes and probably doubling or even tripling the amounts as the batch makes only a few decent sized cookies and not quite enough for a group of adults together or a self-admitted sugar lover, I think the amount goes well if it is just yourself and possibly some small children snacking on them though.\n\nI think a frosting using the butterscotch alcohol and regular vanilla frosting mix would do wonders on these too, with maybe a touch of nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "I wanted to make a simple gingerbread that I could add to my holiday cookies (I never cared for gingerbread when I was a kid but I wanted to try them again) and I am so glad I found this! Once I told people that these were a softer cookie, they were a complete hit. I made DOZENS of them for everyone! I took them to a cookie exchange at my job and my coworkers referred to them as \"ginger crack\" because they were SO good! :) I do have a few suggestions: First, watch the video on here. Use dark brown sugar. Don't over mix your dough or it will make your cookies tough! Chill your dough until it is very firm, and keep it in the fridge between batches. Role your dough out between sheets of wax paper sprinkled with flour (again - don't over mix when you collect your extra dough after cutting). Finally, use parchment paper instead of spraying your pan to make clean up a breeze! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelt"
},
"reviewBody": "I've found these to be much more popular than traditional gingerbread cookies (which I personally prefer)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vienna"
},
"reviewBody": "Boy these taste fantastic!!! I didn't change anything to the recipe, my kids loved them--we made them for Christmas. I cooled the dough but it was still sticky, but I used enough flour under the dough and on top while using cookie cutters so it worked fine for me. \n\nMy kids found it too sticky to work with even with the flour, so they did another cookie dough, but I'm really good at working with sticky dough so I had no problem with it. I will use this again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desiree"
},
"reviewBody": "These are perfect, delicious and easy, which I love! I've made these twice in two days. I just wish they made more per batch because they go so quickly at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afgirl38"
},
"reviewBody": "This is an easy gingerbread cookie I've been using for a few years now. The cookies come out soft and taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeanie Nickerson"
},
"reviewBody": "These cookies are horrible. They had a nice consistency but were inedible ....not sweet enough to call a cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLSS1124"
},
"reviewBody": "Always a hit!! Dark pan produces best results, stay on low end (10 min) for softness, and be sure to let the pan cool to room temp before moving to cookie to a cooling rack to harden. Perfection!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMYMBRUNO"
},
"reviewBody": "This is our go to gingerbread cookie recipe for the last 3 years and get requested almost weekly between Thanksgiving and Christmas. Students that don't like gingerbread cookies absolutely love these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Schwarz Jekel"
},
"reviewBody": "Easy and tasty. My kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista Van Wagner Roberts"
},
"reviewBody": "Love these cookies..super soft, the first time i made them i used butterscotch pudding..this time i used pumpkin spice pudding and added extra ginger...thank you for this amazing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYBOP"
},
"reviewBody": "i was looking for a milder gingerbread cookie for my kid's kindergarten class. This for the bill! The dough was easy to work with. The batch wasn't very big. I 5x the recipe and it all fit in my 6quart kitchenaid mixer. I suspect it will make about 50 gingerbread men but I haven't finished baking yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia Andrade"
},
"reviewBody": "Delicious! I did add cloves and allspice just to make it a little more gingerbread-y."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Richard"
},
"reviewBody": "I have made this for several years. At first it was because it seemed easy and I was intimidated by other gingerbread recipes. Then it was because the kids love them and request them every year. Finally it is because when I make the molasses ones I have molasses left over for a year, throw it out and buy more for the next year. With this recipe I get kid friendly gingerbread and no leftover ingredients to waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Came out perfect! We do not do well with cut out cookies, but this worked perfectly. Plus it was yummy, and easy to make. Will be a Christmas cookie go to from here on out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "julesdavidson"
},
"reviewBody": "Four days later and this cookie is still soft - wayyy better than most gingerbread receipes that turn to rocks after baking!! The taste is great for kids!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOM"
},
"reviewBody": "I veganized the recipe by using plant based butter and soy milk. I also didn't have any vegetable oil, so I used coconut oil instead. It came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mallyduck"
},
"reviewBody": "Wow, this is so much easier using the butterscotch pudding and they come out delicious. I have made gingerbread from molasses and it is much more expensive and time consuming. It rolled nice after I got it out of the fridge and worked the dough a little bit. I was able to get a good number of cookies out of one batch. This was my first test batch and they were so good that I am using this for an upcoming cookie exchange. It isn't straight up gingerbread tasting but that is probably better since some people don't gingerbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Hewell"
},
"reviewBody": "Great recipe, tasted even better than the ones I made with Molasses. After rolling, the shapes could easily be cut out of the chilled dough, and they tasted delicious when finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jmgregs"
},
"reviewBody": "Because another reviewer cautioned that these didn't taste like traditional gingerbread men, I added about 2T of molasses. That did the trick! Yum! I like that they are a bit on the soft side; I prefer a softer cookie to a crunchy one. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinkey"
},
"reviewBody": "My picky 5 year old was stuck on having gingerbread cookies for Christmas. I was worried he wouldn't like the Ginger flavor so I tried this recipe since it also used the pudding and he loved them. I'm not a big fan of gingerbread cookies but I liked these. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misha"
},
"reviewBody": "I love this! So easy to make and low on sugar. It's a Christmas tradition now in my family to make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CS320"
},
"reviewBody": "It doesn't get anymore simple than this. What a winning recipe! I love it. The cookies turned out beautiful with a nice, mild gingerbread flavor. This is a keeper and a must try for easy Christmas gingerbread cookies! I wouldn't change anything, this recipe is just wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mmaenz"
},
"reviewBody": "Patience is the key when mixing these. This is the third Christmas we've made these. Really not fussy! Great flavor and texture. The third rolling still make viable cookies that are more \"puffy\" and soft. I do bake them on parchment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skykite"
},
"reviewBody": "Delicious! Great texture and flavor. I don't love the super molassesy flavor of some gingerbread. This one is more of a ginger snap flavor but a nicer texture. I used vanilla pudding because Publix was out of butterscotch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather, USA"
},
"reviewBody": "Made the exact recipe, no changes. I served these at a party and the plate was cleared before the chocolate chip cookies. Yummy! Everyone really liked these gingerbread cookies. The kids helped make and decorate. Super easy and they didn't take a long time to make! I will make this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen R. Orfitelli"
},
"reviewBody": "Simply the best gingerbread cookie I've made. It is soft and chewy and perfect with and without decorations. It's that tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather L Muehleisen"
},
"reviewBody": "I love this recipe. I made 'Ninja Bread Men' for my son's karate instructor. They were so delicious, I had to make another batch because everyone ate the first batch before I could get them to the instructor. They don't taste like traditional gingerbread but they are wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Kay"
},
"reviewBody": "Great cookie! Easy to make... and like other reviewers, I baked them for only 8 minutes. I used parchment paper to roll them out (place the dough between two layers of parchment paper) instead of flour. I also combined a package of instant butterscotch pudding with cook and serve vanilla pudding. I did not chill the dough at all -- no time -- and it really didn't make any difference that I could tell. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sayeh Pakzad"
},
"reviewBody": "I add a pack of Butterscotch pudding instead of the powder, it turned out so soft and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne McAllister"
},
"reviewBody": "I made this exactly as directed with my grandchildren and they were a big hit. Love this recipe. The dough rolled out easily and it tasted great. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jana Elliott"
},
"reviewBody": "Nice taste, but VERY dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zarah A."
},
"reviewBody": "It's a really nice, easy recipe to make. Even without the molasses, I really enjoyed the taste! The recipe is very mild as the 'ginger' part of gingerbread goes, which is good for kids. If you want a stronger gingerbread flavour add a bit more ginger and nutmeg to suit your taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "I love these cookies! I am not big on the traditional gingerbread taste, so these are prefect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GreatScott"
},
"reviewBody": "Mild, bland flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniela Hofmann"
},
"reviewBody": "They turned out great - as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Alisa"
},
"reviewBody": "Loved it. I have a recipe from a pastry chef that I've used in the past that is quite good; however, I need something quicker and easier. My other recipe creates delicious cookies, but it is time consuming and the dough is tough to work with and cookies are sometimes brittle. This recipe was quick , easy to work with, and surprisingly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki"
},
"reviewBody": "I don't like hard cookies and these come out super soft. They are also not overly gingery, which I like. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Houde-MacDonald"
},
"reviewBody": "Very easy to make and tasted delicious!! Our family of five all loved it and agreed it tasted better than the molasses variety! Made with it our 3 year old... It was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "These cookies were a big hit at Thanksgiving and Christmas. My husband and the kids loved them. The kids love to decorate them too. We will make these every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2eat"
},
"reviewBody": "This is our only gingerbread recipe in the house! Yes, it is a mild tasting cookie and depending on the thickness, its chewy. An awesome combo. Its not a traditional tasting gingerbread but its a keeper for my family. thank you."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9329/gingerbread-men/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9329/gingerbread-men/",
"name": "Gingerbread Men"
}
}
]
}
}
, "about": [
]
}
]