				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Gnocchi Bake"
,"datePublished": "2019-04-02T02:45:31.000-04:00"
,"dateModified": "2019-04-02T02:45:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "andrea_d"
,"url": "https://www.allrecipes.com/cook/432216"
}
]
,"description": "A quick and easy blend of gnocchi, sausage, cheese, and your favorite spaghetti sauce baked together for a hearty casserole."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1lvezZ1oPoji-VIk6Fctj_tZexI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4553171-6ccc0ae2254e40e280bd819db6d21e82.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Gnocchi Bake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "308"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "321 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "49 mg"
,"fiberContent": "2 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "852 mg"
,"sugarContent": "5 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (18 ounce) package frozen or fresh gnocchi",
"1 pound bulk Italian sausage",
"1 (14 ounce) jar spaghetti sauce",
"1.5 cups shredded mozzarella cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add gnocchi, and cook until tender, 5 to 8 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, crumble the sausage into a skillet over medium-high heat. Cook and stir until evenly browned. Drain grease, and stir in the spaghetti sauce. Remove from heat, and carefully mix in the cooked gnocchi and half of the mozzarella cheese. Transfer to a casserole dish. Sprinkle the remaining cheese on top."
} ,{
"@type": "HowToStep"
,"text": "Bake for 15 to 20 minutes in the preheated oven, until the cheese is melted and the sauce is bubbly."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Angarano Lewicki"
},
"reviewBody": "Easy and so delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter"
},
"reviewBody": "What a delicious meal! My family couldn't get enough! I highly recommend this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael Young Boyer"
},
"reviewBody": "I have never had gnocchi before and while some said this was a basic recipe it is really good. I’m all for one pot meals that taste good that my family will eat. Would change anything about the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryMargaret"
},
"reviewBody": "It was delicious, with a few additions, the second time around. I saute onion, sweet peppers, mushrooms then added Italian seasoned ground turkey and browned. Added the marinara sauce and Italian seasoning. Threw some chopped broccoli in the pot when cooking the gnocchi. Drained and added them to the marinara pan. Then mixed in the full 1 1/2 cup of cheese. Poured it all into the baking dish. Sprinkled with grated Parmesan cheese and baked as directed. Wonderful. Recipes are suggestions to me except when baking. Then I get in trouble when I improvise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria Martinez-Gerhardt"
},
"reviewBody": "This was a first time for a gnocchi bake. It was easy to make and came out great. It’s hard to mess up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ibscarry"
},
"reviewBody": "I made this awhile ago and forgot to review it. I don’t really remember the particulars of how I made it, but i don’t remember making substitutions, and I did use fresh mozzarella. What I do remember is the taste of this was fantastic. My son and I loved this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "csmithlmt"
},
"reviewBody": "I found this during the first couple weeks of the pandemic, when i had to buy whatever groceries were available. I ended up with gnocchi and had never had it before. We followed the recipe, but used breakfast sausage abbr added a teaspoon of fennel. It was a huge hit! Well be eating gnocchi (however you say it) many times again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom"
},
"reviewBody": "Added yellow and green bell pepper to sausage while cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kspisich"
},
"reviewBody": "Quick and easy weekday meal. I follow this recipe to a T, making no changes or substitutions. Something my entire family looks forward to when it is on the menu for the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kcw"
},
"reviewBody": "Easy and delicious! My son loves it and will pretty much polish it off in one night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxy Gonzalez"
},
"reviewBody": "We absolutely loved this. The only thing I did differently was add mushrooms, black olives and pepperoni. I have since been asked if I could make this weekly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slaubhan"
},
"reviewBody": "My son wanted to try gnocchi and I found this recipe while searching AR. It had ingredients we like and was super easy to make. Great recipe for a quick dinner, makes enough to feed a family of four and have leftovers. I followed the recipe as is until the end, and then I did broil on high for about five minutes to brown the cheese just a tad. Delicious dish that even a picky water should like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lare Bear"
},
"reviewBody": "After making the dish with a few of my modifications, my grandson and wife were in it before I got the camera to snap a picture :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey E Wrobel"
},
"reviewBody": "It was alright, but super easy to make.\n\nI am honestly not crazy about gnocchi, though I tried it to use up some Italian sausage we had on hand. I added probably more sauce and a lot less cheese, plus fresh garlic I cooked with the sausage.\n\nMy family likes it, all except for our youngest child, who is extremely picky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim MacEachern"
},
"reviewBody": "Very tasty. Added 2 cloves of garlic and some diced onion to the sausage meat, along with Italian seasoning and some freshly cracked pepper. Also added 1/2 cup of Parmesan cheese to the meat mixture instead of the mozzarella. Topped with mozzarella prior to baking. Will def make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna-Bat"
},
"reviewBody": "Used ground beef because that's what we had in the house, and some shredded fresh basil, and everything was delicious! Super simple weekday dish with the benefits of leftovers. Even my 18 month old liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Machado"
},
"reviewBody": "Good RECIPE. Not sure why that one chick got mad at how easy this recipe was when she has recipes saved on how to make salads..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andi"
},
"reviewBody": "There were no leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wayne williams"
},
"reviewBody": "If was pretty good I added more sauce than it called for I would make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Varghese"
},
"reviewBody": "This was quite tasty! I saute 1/2 onion &amp; minced garlic before adding saugage. Also added basil/italian seasoning to the spaghetti sause"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "memoo"
},
"reviewBody": "Used a bit extra sauce (600g) and forgot the mozzerella, so i used ementaler. Still so good, there were no leftovers in this house! Thanks All recipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmy Cook"
},
"reviewBody": "Simple and tasty. What more could one want? I did add a step by pan-frying the gnocchi in some butter after they were par-boiled which added to the overall flavour of the dish, and I used my homemade pasta sauce because it's cheaper, easy and tastes better than the store stuff, but other than that made this as per the recipe. Both my girls loved it, as well as the hubby. Will make again next time I want gnocchi."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roseanne"
},
"reviewBody": "I used hot Italian sausage and vodka spaghetti sauce. Used about 2+ cups of mozzarella cheese. I made this ahead of when I needed and put in the refrigerator then reheated, covered, in the oven. Very tasty. Very filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gena Sissy Garner Crawford"
},
"reviewBody": "This is a super easy, very satisfying meal. I made a tossed salad and garlic bread to go with it. I happened to have some Italian sausage, I had precooked, in the freezer and some Trader Joe's gnocchi and some inexpensive pasta sauce and shredded Mozzarella. It was awesome and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2Cook"
},
"reviewBody": "Delicious and easy! I didn't change a thing. For the sauce, I used some homemade sauce that I had leftover. It has lots of garlic, olive oil and parsley so if you use store-bought sauce you might want to add some garlic when you brown the sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hiserodtm"
},
"reviewBody": "Very simple and very tasty. Loved by all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Morse-Wendt"
},
"reviewBody": "season sausage with oregano, basil, and fennel. season sauce with basil, oregano and garlic salt. cook sausage with 1 tsp minced garlic. drain sausage and bake in medium casserole dish for 15 minutes. serve with garlic bread. Luke ate gnocchi on 1/9/15"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Wilson"
},
"reviewBody": "Yum a great fall dish, everyone including my very picky husband-who hates everything that's not meat and potatoes-loved it. Easy fast and satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Really easy family meal with a month old, a two yr old, and an impatient husband. Very satisfying. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Britshain"
},
"reviewBody": "Rinse the gnocchi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Figurski"
},
"reviewBody": "Delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FarmMom"
},
"reviewBody": "Very yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn68PA"
},
"reviewBody": "I love delicious basic dishes! So nice to make after a long work day because it's so easy. I made it with angel hair pasta instead of gnocchi and it was just awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kelley"
},
"reviewBody": "Okay so this recipe was good. Wasnt the best but I think that was partly my fault and my improvising. I didnt have sausage and the only meat I had thawed was turkey bacon (which smelled and tasted weird, even for turkey bacon....old maybe?) and I used 24 oz. sauce, also. I used a little more cheese and then we all put some more on top after we got our plates (we are cheese lovers). All in all it was a good meal, but I know it would be a great one if I had used sausage (or even chicken). I would never recommend turkey bacon (or at least that package I had). \n\np.s. It was very filling. One plate and we were full.\n\np.p.s I used salt, pepper and oregano, which was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "letseat2013"
},
"reviewBody": "Super easy and great. Let's face it, we don't always have time to spend hours in the kitchen. I used Mennonite sausage instead of Italian since I am Mennonite and it was great! I also used the mini gnocchi but really liked it. I sliced fresh mozzarella on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "My3Boys"
},
"reviewBody": "I made this last night but used ground beef because that's just what I had on hand. Family loved it. Added a little shredded parmesan in with the mozzarella cheese to make it extra cheesy. Will make again. It's easy and was enough for some leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PamW"
},
"reviewBody": "Great recipe! I made a few modifications. After reading a few comments, I thought the gnochi would be too heavy, so I used half gnochi and half tortellini. I also added olives and cut back on the cheese just a bit. I used Paul Newman's Own Roasted Garlic sauce. I like my casseroles to be a little more moist, so I added about 3/4 cup of beef broth. It turned out great. Next time, I will probably add zuccini, which would be a nice light addition to the heavy meat and pasta flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsAouita"
},
"reviewBody": "I made this with ground beef (no pork is consumed in our home) and I added some mushrooms, garlic and some peas because I wanted \"dinner in one dish\" It turned out great. Hubby loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mattimai"
},
"reviewBody": "I guess I am your \"average college student.\"\nfirst off, I don't cook. Its just not something that I'm spectacular at. \nsecond off, THIS IS AMAZING.\nwent to Aldi and spent a whole 13 bucks to make this. Makes just enough for me and my fiance and then for me to have lunch the next day. \nIf you're on a budget, this is the way to go. Its quick and easy. Longest part was waiting for the italian sausage to cook. I kind of ignore measuring the cheese I put enough for it to be SUPER cheesy, then I put sliced mozzarella on top while its baking to have a nice baked top on it, kinda like lasagna. \nOverall, this is fantastic. 2nd time making it right now! YUMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BaierKitchen"
},
"reviewBody": "This recipe is great! We love cheese so we added more and realized that you need to add a full jar of sauce if you are going to have leftovers. Without the extra sauce, the bake gets too dry when you rewarm it in the oven. Also, we didn't know what kind of Italian sausage to buy, so we picked out the kind that looked like a braut, which doesn't chop well when you cook it on a pan! We will have to try this again either with sausage you find in a plastic tube or buying the same kind again and chopping them up into discs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "We'd probably give it 4 1/2 stars. We bought some gnocchi in the pasta aisle. Looked for recipes that would be good for kids and easy. This fits the bill. There are lots of ways to personalize it, but we stuck with the original recipe this time. It didn't taste gummy to us. We used Newman's Own pasta sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AdeleD"
},
"reviewBody": "Not bad. Not great, but not bad. Will probably find another gnocchi recipe to try next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koffegirl"
},
"reviewBody": "Easy to make and turned out great. I also make with ground beef. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marce"
},
"reviewBody": "Yummy! I did like a previous reviewer and used half gnocchi and half tortellini. I didn't add any meat. I added some sliced black olives and I cut up some artichoke hearts and added to the sauce. It was very easy - I used canned spaghetti sauce. I served with garlic bread. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherryL"
},
"reviewBody": "Granted, this is very basic, but it still gave me an idea for the gnocchi in my pantry. I had never thought to use it in a casserole. I halved the recipe because I had 1/2 lb. of sausage and there are only two of us. It would have been delicious as is, but I had some leftover eggplant, a zucchini and a couple of mushrooms I needed to use, so I diced the eggplant and zucchini and sliced the mushrooms. After sauteeing some chopped onions in a bit of olive oil, I added and browned the sausage, removed it from the skillet and added the remaining veggies with a chopped garlic clove. When they were done,I proceeded with the recipe as written. I did add a bit of parmesan on top with the mozzarella. Great comfort food. Also a way to use any veggies you have to make a one dish meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KateL"
},
"reviewBody": "This is a good base recipe for a basic yummy raindy-day dish. Like others, I added a bit -- used chorizo sausage, finely chopped onion, chopped garlic and, to avoid the gumm-iness of the gnocchi, I parboiled first then pan fried in butter and basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy and the whole family enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Very nice dish. I didn't think it was gummy or too cheesy at all. Make sure you cook the gnocchi as directed; if you cook it too long, it will become gooey or mushy. It's done when it floats to the top--most of the pasta will be done all at the same time, I promise. I thought this was a bit heavy, but you could elimate the sausage to lighten it a tad. The gnocchi definitely makes it filling! We both gobbled this up and enjoyed the leftovers as well. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gourmet Guy"
},
"reviewBody": "It is silly how good this is. I used Bob Evans Premium Cuts Italian Sausage, Parmesan &amp; Romano Robusto Ragu, regular old gnocchi and 3 cups of mozzarella - ridiculous....outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tanyrocky"
},
"reviewBody": "This was a very easy recipe to make, but it was a little simple and not much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeavenleeKid"
},
"reviewBody": "This Gnocchi Bake is outstanding! I love gnocchi so when I saw this recipe I had to make it. Me, my husband and 4 of our kids who ate it loved it! Delicious and easy. I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "photojenny25"
},
"reviewBody": "absolutely fabulous!!! My husband raved and raved about this. He even suggested that I put this into our regular rotation. The only thing I did different was to add 1 tsp. of Italian seasoning with the sauce. The ghocchi turned out tender and perfect!!! Thank you so much for such a simple but fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taramore"
},
"reviewBody": "I added a small bunch of kale (chopped), a red pepper and an onion (softened in the pan). I didn't pre-cook the sausage, but added it with the spaghetti sauce and above ingredients to the slow cooker for several hours. Then followed the instructions to prepare for baking. Four of us feasted on it, and there was some leftover for my son to take to work. \nDelicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Newell"
},
"reviewBody": "Fantastic and simple recipe. I used a full jar of spaghetti sauce (garlic &amp; onion) AND a 1/2 jar of light alfredo sauce. OMG, the flavor was wonderful. Will definitely make again very soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Eh. This was mediocre at best. I have to laugh... this really isn't a recipe at all. Just about every cook has made this or something similar, whether following a \"recipe\" or not. On the flipside, I must say this is perfect for us working folks (it really IS that easy to throw together!). For me, the gnocchi was the deal breaker. It is far too heavy for a gooey, cheese-laden baked dish. Penne or rotini would be a better choice, IMHO. Maybe this will float your boat, but it just didn't mine. Thanks anyways, andrea_d! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Cruickshank"
},
"reviewBody": "i didnt have itailan saucebut i used turkey sauceage never try it does not turn out right"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cork"
},
"reviewBody": "I made this the first time with gnocchi and it was good. This time I used tortellini and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingismylife"
},
"reviewBody": "This recipe is absolutely delicious! This was my first time cooking gnocchi, and thought this looked good. Was it ever! I tasted the gnocchi after cooking it, and was surprised at how bland it was. I was hoping it wouldn't be so bland after I mixed it with the sauce and cheese and sausage. It turned out brilliantly! Thanks for the awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neutle2"
},
"reviewBody": "Delicious. I make my own gnocchi but this is a dish that everyone loves. My mom thought beat the traditional pasta dishes. She has a hard time with pasta but this was so easy on her."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Julianne"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALG"
},
"reviewBody": "I made this for my family as a quick weeknight meal and they LOVED it!!! My 5yr old told me it was the best meal she's ever had!! Will be making this regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motherof2"
},
"reviewBody": "Perfect for pasta and cheese lovers! It was hard to keep my mmmmmms to myself as I ate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "newhopemom"
},
"reviewBody": "I sliced pizza-brats we already had instead of using sausage, and sauteed the slices with onion and garlic while the gnocchi cooked. It turned out just great. Will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heathergodwin"
},
"reviewBody": "This turned out excellant and was easy enough that I could let my kids help me cook it. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "evetsangel"
},
"reviewBody": "All of the ingredients on this sounded great. But mixed together forget it. Maybe I had bad gnocchi, but I would have rather had noodles in this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "This was really good! I added more sauce to make it a little saucier but other than that I followed it to the tee! Step son loves it too, thanks for a great gnocchi recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa - Recipe Diva"
},
"reviewBody": "This is a great recipe! Thanks for sharing it! Of course, I did make some changes according to what I had on had. Boiled the gnocchi. For the sauce, I had two cans of tomato sauce, 1 can of diced tomatoes. I added dried herbs (basil, oregano, and parsley) and fresh garlic to the sauce and added frozen meatballs, as I didn't have any sausage. Spooned some sauce on the bottom of the pan. Then put down all the gnocchi in a single layer. Then put down chopped up provolone cheese (deli style, cut up small). Mixed about a half bad of fresh spinach into the sauce mixture and stir gently until it wilts. Then spooned the meatball/spinach sauce mixture on top. Sprinkled a little more provolone and some parmesan on top of the whole thing. \n\nThe point is... this recipe is very easily adaptable to what you have on hand. Delicious! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ben"
},
"reviewBody": "I changed this recipe quite a bit and ended up making it vegetarian. I took out the italian sausage, because I didn't have any on hand, and added some leftover homade pasta sauce (garlic, onion, mushrooms, and zuchinni, tomatoe sauce, spices). I also added a small zuchinni to make up for the lack of sausage. Tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "Fantastic and will definately make again! I will probably double the batch next time because we ate it until we were uncomfortably full and argued over who got the leftovers.... haha. I did add 1 can of drained diced tomatoes, a small dash of Italian Seasonings, 1 onion, and 1 tbsp of diced garlic. The onion and garlic was cooked with the Italian Sausage, the diced tomatoes were mixed with the sauce, and I used just a small amount of Italian seasoning with the tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pfafftacular"
},
"reviewBody": "Quick, easy and tasty! Added some ricotta/carrot/herb mixture to the sauce, which was leftover from making stuffed mini peppers - it made it just that much more creamy and delicious. My wife took it to work the next day for lunch and said it was just as good leftover. We will definitely be having this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "This is a fantastic easy recipe. I like the idea of buying already made gnocchi rather than taking the time to make them. Not all recipes need to be types where you make every ingredient. This was easy to make and had great flavor. I added some garlic powder and basil to the mixture once all combined. I also made this ahead of when I needed and put in the refrigerator then finished baking. I increased baking time 15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "This is a simple and delicious recipe - perfect for an easy week night dinner. I wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lwylie"
},
"reviewBody": "The whole family loved it! Super easy to make. I made it with Chicken sausage and lowfat mazzerella cheese just to shave off a few calories and it was still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela RG"
},
"reviewBody": "This is a wonderful simple dish, a little too saucy for me. So next time I will either add more gnocchi or use less sauce. Definitely season to your taste with garlic, basil, or whatever you happen to have on hand. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KOALAGIRL"
},
"reviewBody": "10-12-11 Tonight I made this a WHITE GNOCCHI BAKE by using light alfredo sauce and sun dried tomatoes instead of the tomato sauce and the creamed spinach I added last time. It was so creamy and delicious!! 11-2-10 I totally tweaked this recipe to what I had on hand, but it's still an awesome recipe - - a great base to build on. I used cooked chicken instead of the sausage, and added chopped onion, minced garlic, a box of cooked creamed spinach, and a dash of nutmeg. The spinach added richness and a pretty color to the dish. This was SO simple, yet tasted wonderful. Thank you so much for sharing this recipe, WannaBeChef. We'll be having this over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "creativecook"
},
"reviewBody": "Awesome recipe, so tasty. I added 1 small chopped onion and 2 cups fresh chopped spinach to add some vegetables into the mix. Fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "We used alfredo instead of a tomato based sauce, and no cheese. Also skipped the baking step. Tasty! My husband and toddler loved it, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miss jackson"
},
"reviewBody": "great simple recipe. i made with ground beef and added some fresh herbs to the meat while cooking. topped with fresh parm. delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Hite"
},
"reviewBody": "I had leftover chicken from the night before so I diced some of it the bake instead of the sausage. It was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Oliner"
},
"reviewBody": "This is such a delicious recipe, everyone I made it for adored it. I used fresh whole grain gnocchi, which gave it a delicious earthy taste, vegetarian sausage, and provolone cheese instead of mozzarella cheese because I didn't have any mozzarella in my fridge. I also cooked up some onions in the skillet before I added the veggie sausage and added a hit of dried oregano, basil, and red chili flakes to the mix for extra flavor. Wonderful vegetarian recipe and my boyfriend couldn't tell it wasn't real meat. I highly recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RMH55"
},
"reviewBody": "This was simple to make and quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peach"
},
"reviewBody": "Made this using the Quick Gnocchi recipe on this site last night. It was the perfect amount for this recipe. I had 2 cups of Mozzerella cheese and used the whole bag. I had Hot Itallian sausage and used it as it was what was on hand, but will use mild or sweet next time. This was VERY GOOD and I can't wait to cook it the next time we have company over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "I thought this was great...my husband absolutely loved it! I added some diced onion to give it a little crunch, and sauteed it with the sausage so it didn't take any extra time. The leftovers were great when reheated also. Overall a very simple, good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "beefymac"
},
"reviewBody": "This was very easy to make and was pretty tasty. I would make it again if I needed a quick and simple dish, but I would not crave it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRAYCE"
},
"reviewBody": "Delicious. I used Rinaldi meat sauce-1/2 hot &amp; 1/2 mild Italian sausage-added 2 bay leaves-minced garlic-fresh mushrooms-1 can of well drained spinach &amp; some red pepper flakes. I let this simmer for a while for a little more flavor. It did thicken up a little so I added some of the gnocchi water to thin it. I've had many requests for the recipe. Try it you'll like it. Thanks Andrea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manda"
},
"reviewBody": "This is a great basic recipe and fun and easy to adapt. I used an Italian four cheese blend instead of mozzarella and a vodka sauce instead of regular spaghetti sauce and it was amazing. I love gnocchi. I used a premade gnocchi but next time I'll use fresh made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CorkiDeCat"
},
"reviewBody": "Quick, easy, versatile and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Petelski-Steeves"
},
"reviewBody": "If you love quick, easy and tasty, you'll enjoy this one. I didn't have any italian sausage on hand. I substituted breadfast sausage with good results. I used Kraft Italian 4 cheese mixture. Will make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "Given that this recipe is fast, easy and has only four ingredients I give it a thumbs up. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Naibu"
},
"reviewBody": "My family liked it, however I think I should have cooked the gnocchi a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy"
},
"reviewBody": "My family LOVES this! I see some people are slamming it because it's so simple... GIVE ME A BREAK! What's not to love about a yummy and yet simple dinner?!?!?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "I am not going to say this is the most amazing meal and you must try, from the list of ingredients and the simplicity of this recipe you know that will not be true, but it’s a good base if like me you have ingredients that need using up and rather short of time. I followed the recipe exactly only adding mushrooms and onions to the skillet when cooking the sausage, glad I did for the extra flavor and texture. My Gnocchi was cooked to perfection and the meal was ok, nothing spectacular. Not sure its something I would make again in a hurry, if I did I think I would use mature cheddar cheese instead of Mozzarella for extra taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "catey_d07"
},
"reviewBody": "this was my first time using gnocchi so i was somewhat apprehensive. it turned out pretty ok. instead of using italian sausage i just used italian seasoned ground turkey and added 2 cloves of minced garlic. my boyfriend liked it a lot more than I did but he likes anything with pasta sauce in it. The gnocchi was a little gummy but thats expected with the consistency of it. i used a lot lot lot of cheese within the mixture and on top so that was very good! all in all.. i will make this recipe again, definitely something different from the norm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SSgtsdaisy"
},
"reviewBody": "This is the best Gnocchi dish I have ever made. I wouldn't change a thing! We live in Italy and this is good enough to be put in a menu!! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Griffith Power"
},
"reviewBody": "This recipe was quick, easy and delicious. I did tweak it a tiny bit by adding fresh garlic to the sausage as I fried it, as well as fresh red pepper flakes. So good. Will definitely make again on a cold winter night. Very filling too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mo McF"
},
"reviewBody": "Very good, quick and easy. I followed the recipe exactly, but used turkey sausage instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AMESNJAMES"
},
"reviewBody": "mixed reviews in my family on this. I don't think my husband loved it and I don't think he hated it. I have two toddlers who I thought would like it but was surprised my 3 yr old son didn't like it. My 2 yr old daughter ate hers though. I liked it. I used regular pork sausage because I personally don't like italian sausage. I used prepackaged gnochhi, fyi. I boiled it for approx 6 min and it was perfect. My husband and I both thought it could use more cheese and I already had used around 2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sadari"
},
"reviewBody": "Three stars because the cooking time is way off, the flavor was probably 4 stars though. My package of gnocchi said to only cook for 1 to 1 1/2 minutes, only until it floated to the top. I did that heated the sauce through in the sausage, melted the cheese in, and the added the gnocchi. I baked only for five minutes, just long enough for the cheese on top to melt. I couldn't see baking it for 20 minutes when everything in it was already cooked. My intuition was right, the gnocchi came out the perfect consistency and everything was hot though. I also used a 24 oz. jar of sauce because it's what I had and I don't mind a little extra sauce, a 20 oz. jar would have probably been perfect. Next time I think I was use all or half ground turkey, I'm not a big sausage fan and the flavor was a bit overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maggieb"
},
"reviewBody": "This is our favorite gnocchi recipe! I actually use smoked sausage links (1 lb.), 26 oz. spaghetti sauce, 4 oz. cheese, and 1 lb. gnocchi! It is outstanding. Thanks for sharing :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/57071/gnocchi-bake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/57071/gnocchi-bake/",
"name": "Gnocchi Bake"
}
}
]
}
}
, "about": [
]
}
]