				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grandma&#39;s Ground Beef Casserole"
,"datePublished": "2020-07-02T18:28:55.000-04:00"
,"dateModified": "2022-09-30T16:47:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LaDonna Langwell"
,"url": "https://www.allrecipes.com/cook/mrswolfie"
}
]
,"description": "My grandmother&#39;s old-fashioned hamburger casserole is comfort food at its best! Featuring ground beef, noodles, and a cheesy sauce, this recipe dates back to the 1940&#39;s."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/N-OJiui5Mj1ICQRNz8LQ7otGNlk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231808-grandmas-ground-beef-casserole-DDMFS-1x1-1-2e581c9e358b4ced8b07fe37cadb5a32.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6168287350001",
"description": "Grandma's recipe for ground beef casserole is a rich and delicious weeknight dinner! Ground beef, noodles, onions, and cheese are baked in a casserole dish until bubbly!",
"duration": "PT1M42S",
"name": "How to Make Grandma's Ground Beef Casserole",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/08/11/231808_GrandmasGroundBeefCasserole_MFS-WD-3x2-1.jpg",
"uploadDate": "2022-05-17T15:52:29.695-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grandma&#39;s Ground Beef Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "484"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "519 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "120 mg"
,"fiberContent": "4 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "1597 mg"
,"sugarContent": "8 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound ground beef",
"2 (15 ounce) cans tomato sauce",
"1 teaspoon white sugar",
"1 teaspoon garlic salt",
"1 teaspoon salt",
"1 (8 ounce) package egg noodles",
"1 cup sour cream",
"3 ounces cream cheese, softened",
"1 large white onion, diced",
"0.5 cup shredded sharp Cheddar cheese, or more to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease."
} ,{
"@type": "HowToStep"
,"text": "Mix tomato sauce, sugar, garlic salt, and salt into the ground beef; simmer until flavors blend, about 20 minutes. Remove from the heat, cover the skillet, and cool to room temperature."
} ,{
"@type": "HowToStep"
,"text": "While the sauce is cooking, bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, 7 to 9 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "While the egg noodles are cooking, preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Mix sour cream, cream cheese, and onion together in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Layer 1/2 of the egg noodles into the prepared casserole dish. Top with 1/2 of the sour cream mixture, then 1/2 of the ground beef mixture. Repeat layers once more. Sprinkle Cheddar cheese over top."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/N-OJiui5Mj1ICQRNz8LQ7otGNlk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/231808-grandmas-ground-beef-casserole-DDMFS-1x1-1-2e581c9e358b4ced8b07fe37cadb5a32.jpg"
}
]
,"text": "Bake in the preheated oven until cheese is melted and golden brown, 25 to 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seralet"
},
"reviewBody": "This does take a while to make, but it’s delicious. Great comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great base recipe that you can tweak to your own personal tastes. I did not add salt. I sautéed the onion and a couple of cloves of garlic with the ground beef. I added 1 tsp. of Italian seasonings. I switched out the cheddar for Mozzarella, and I put a layer of that in the middle in addition to the layer on top. Also, I added in some pepperoni to the sauce. I used small shell pasta as it is what I had on hand, but I think any pasta would work. I did not let the sauce come to room temperature due to time constraints and everything came out fine. Next time I'll might try switching out the sour cream and cream cheese for ricotta. We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine"
},
"reviewBody": "Easy and tasty! I sauteed the onion with the ground beef, and added twice the tomato sauce and some Italian seasoning. When it was bubbling, I mixed in half a package of uncooked noodles, put the cover on it and let it sit for an hour. Added maybe a tablespoon of milk to the cream cheese/sour cream mixture to make it easier to spread. The family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was very good. I didn't have tomato sauce so I substituted tomato soup. I would also use twice the amount of egg noodles that it called for as it didn't cover the entire bottom of the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BKOMAR76"
},
"reviewBody": "Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lee J. Farrell"
},
"reviewBody": "My family didn't like the onions. Too many and needed to be pre-cooked. Next time they want me to try powdered onion flakes for flavor or sauté the onions fully before adding"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Kraft-Wetter"
},
"reviewBody": "I will make again, but will cut the salts in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Johanna Bloemen Craig"
},
"reviewBody": "The family liked it, but will cut back on the onion by 1/2 and sauté with the ground beef instead of adding to the cheese mixture raw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robin White"
},
"reviewBody": "Seems like lasagna with egg noodles. I cooked onion, garlic, green pepper. Remove. Cook ground beef. Drain. Add Onion mix. Add tomato sauce mix, and 1.5 tsp Italian seasoning. Used recipe except forgot sour cream at store. If I made it again, I would use cottage cheese in place of sourcream and cream cheese layer. I used lots of mozzarella cheese. Didn't use garlic salt. Needed More spices and I like mild. Predict better made 1 day ahead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good meal overall but the prep time was ridiculous. Took me the better part of an hour and a half to put together. I added green peppers and a sufficient amount of garlic. A nice meal to make on occasion when you have a fair bit of time on your hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Stidhem-Dura"
},
"reviewBody": "Easy to make but really loved by my guys. I did chop up some small yellow and red bell peppers to add with the onion. YUMMM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My Mimi would always make this for us. Yummy! I also sauté my onions with the meat. I accidentally bought tomato sauce with Italian herbs and that improved the flavor. I used coconut sugar , mixed up salt and only 23 oz of tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A little bland but I didn't put a whole onion in it. Not a big onion fan. My household went back for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Glaser"
},
"reviewBody": "Really liked this! I read reviews and made a few minor changes to adjust for my family’s preferences. The red sauce: upped the sugar from a teaspoon to a tablespoon, cut the salt in half, and added in some red pepper flakes and Italian seasoning. We like sweet and spicy. The beef mixture: I used real garlic (2 cloves, finely chopped) and cooked it along with the onions in some olive oil before mixing in with the ground beef and browning the beef. I also drained the ground beef before mixing in with the red sauce. I didn’t love the idea of crunchy onions, so I wanted them cooked in with the ground beef. I almost used mozzarella as some suggested, but used Colby jack (it’s what I had) and it was good. Definitely will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "AWESOME"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindyv"
},
"reviewBody": "This was a great recipe that my family really enjoyed. I cooked the onions with the beef and added green onion to the sour cream and cream cheese. It was a hit! Thanks for reminding me of this comfort meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dds"
},
"reviewBody": "It was average but enjoyable. Used ground moose meat. Fried onion with the meat. Used fresh garlic, minced. Added no salt. I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda davis"
},
"reviewBody": "I doubled up and used shredded mottzarella instead of cheadar. Served with a salad and warm pita bread. Everyone asked for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Roll"
},
"reviewBody": "My family loved this. My daughter didn't even notice it had tomato sauce in it, she went to town on it. This will be made again. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kemi Le"
},
"reviewBody": "Next time I will cook the onions first a bit. I didn't cool down the sauce all the way because I was low on time and that may have helped cook the onions just a bit. I also covered the dish with tin foil for 20 minutes. My son still thought the onions were too crunchy. Everyone else loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Hixenbaugh"
},
"reviewBody": "delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Massina Gallivan"
},
"reviewBody": "used Wegmann's grandpa's pasta sauce to add a kick to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SANDYD2"
},
"reviewBody": "I and two other adults really liked this! While we found the flavor of the onion/cream cheese/sour cream mixture savory and delicious, it won't be for everyone. As I was making it, I wasn't expecting to be pleased. The sauce looked too runny and it seemed like I had too many noodles. But it was delicious. Like the review recommendations, I sauteed the onions until translucent before mixing them into the cream cheese and sour cream. Everything else, I did exactly as in the recipe. Suggestions: 1) sautee the onions in a little olive oil until translucent 2) try adding the cheddar cheese halfway through cooking; mine got a little browner than I would like or 3) use mozzerella or Italian blend cheese instead of the cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gtc"
},
"reviewBody": "I was hoping this was going to be similar to my aunts \"goulash\" as she called it. I added corn to the recipe. It wasn't the same but it was still very good. Not sure if I'll add the sour cream next time....not sure. Maybe that's the weird taste that someone below said. I think I will use jar sauce. It has more flavor than just tomato sauce in the can. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jen Zielinski"
},
"reviewBody": "Weird taste to the cheese mixture that no one in my family cared for. Measurements also seemed off. Won’t make again…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia"
},
"reviewBody": "I didn't have sour cream and so substituted it with plain yogurt. Absolutely delicious! Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "uucasmogmailcom"
},
"reviewBody": "Thanks for this great recipe!! For those concerned about Salt/ Sodium, cut the salt in-half in the recipe, and use No-Salt Tomato Sauce, and lastly - use garlic powder or actual minced garlic. This is the perfect, basic, delicious pasta, meat, sauce casserole. My only other substitution, aside from reducing the salt and using no-salt tomato sauce, is - I use ground turkey instead of ground beef, and if I want it Vegan, I use Gardein Ground Be'f."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi RC"
},
"reviewBody": "I love this because I was able to take tips from other reviews and make it my own. I sautéed the onions and some garlic first and then added the ground beef. I doubled the recipe so I used about 21 oz of tomato sauce and about once cup of red wine and added that with the seasonings. I let that simmer and then added about a quarter cup of heavy cream. Sauce was amazing! I should’ve cut down on the pasta though because then the ration would’ve been perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KRISSLIE"
},
"reviewBody": "I love this recipe! I’ve made it many years ago. My recipe was slightly different. It called for green onions instead of a regular onion. And it was not cooked beforehand, either. It was delicious and everyone loved it. Try green onions! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sueliz"
},
"reviewBody": "If you caramelize the onions before mixing, it makes a huge difference in the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "deb"
},
"reviewBody": "I have to tweak all these recipes because it's just my husband and I, it may have had a little too much tomato sauce and not quite enough pasta, but otherwise followed recipe exactly, but it was not at all what I thought it would be. The ingredients sounded like a recipe I had eaten about 30 years ago that I loved. However, it didn't turn out at all like I had hoped. Very disappointed. won't be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Armstrong"
},
"reviewBody": "Next time I will cook the onions with the beef. Some were a little crunchy for my families taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa925"
},
"reviewBody": "Wow! This is a great recipe! Try it! You can use any type of pasta you like. Total hit. Thank you so much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not bad, but not great. There were two negatives to report. The first, as noted by me and another, was the fact that the raw onions really detracted from the dish. It was certainly still edible, but the onions were certainly still raw. The other problem as I, the preparer, felt was that the layering wasn't quite adequate. That is, although there was certainly sufficient pasta for each layer, the other two components (the onion/cream cheese/sour cream, and the hamburger/tomato sauce/etc) weren't sufficient to make two complete layers. Still, it's being eaten. But I did like one of the other commentors remark about cooking the onions together with the ground beef. But then what do you do with the cream cheese/source cream?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "thubble"
},
"reviewBody": "It was just okay. I wouldn't make it again. I did sub the garlic salt for garlic powder, so it wasn't salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So good!! Will be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jaron Brown"
},
"reviewBody": "Followed recipe to a T. A little salty for my liking but I have high bp so I have a low sodium diet. Will probably eliminate the 1 tsp of salt and just use 1 tsp of garlic salt. Also, maybe throw some cheddar cheese in after the first layer. Flavors come together nicely! I did add just a pinch of minced garlic to the tomato/beef sauce since I’m a fan of garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniel Nilssen"
},
"reviewBody": "This recipe was simple, easy and good but the sour cream was a little overwhelming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really liked it .we all did and I made cornbread with it ;. it was yummy ;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Velena Moran"
},
"reviewBody": "Substituted red wine for one of the cans of tomato sauce, added garlic and thyme meat mixture. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arleen Gibson"
},
"reviewBody": "Yummy! Used 28 oz. can diced tomatoes instead of sauce - grandkids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale "
},
"reviewBody": "This was very good! I don’t double recipes when they are new to my family and boy was that a mistake because I didn’t have enough for 2nds!! This is a keeper for sure! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I love a good base recipe like this one because they are easy and fun to experiment with. I made the following changes: I substituted one of the cans of tomato sauce with a 16 oz. jar of Pace picanti sauce, used 3 tsp. of chopped garlic, added 1 generous tsp. each of dried basil and oregano, 1/4 tsp. of baking soda (to cut the acid in the tomatoes), sauteed the onion and garlic with the ground beef and 1/2 cup of chopped green pepper, used 8 oz. of cream cheese, and topped it all with at least a cup of sharp cheddar cheese. I kept taste testing the sauces until I had the seasonings to our liking. Was also careful not to use more than 8 oz. of noodles. Assembled it as per the instructions. My 3 quart baking dish was full to the top. Delicious! Will make again, but will try with two jars of the Picanti sauce for a bit more zip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah"
},
"reviewBody": "This is the second time I made it. This time I increased the sour cream and cream cheese by half, doubled the shreaded cheese and I cooked the onions with the meat. I did not have egg noodles so used bow tie noodles. It turned out very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam Lipschutz-Halpern"
},
"reviewBody": "I used ground venison"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pdevine"
},
"reviewBody": "Excellent meal. Good for freezing left overs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "granny0004outlookcom"
},
"reviewBody": "I thought the recipe was excellent. I made no changes. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "musgrove22"
},
"reviewBody": "Good and filling. I used 2 bags of sharp cheddar cheese. I think I might add artichoke hearts and black olives to the mix next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Carney"
},
"reviewBody": "It is a huge hit at our house! I have made it twice so far. The second time I added a packet of taco seasoning and it was delicious! I have come up with several thoughts about how to change up this recipe a bit. I like the layered cream cheese sour cream onion mix I am going to make that the basis for several variations! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "4.5 but I’m rounding up because it’s Grandma! :) Great throwback recipe LaDonna! Considering I test my husband’s taste bud boundaries constantly, he loves when I make a simple, hearty casserole like this! And while the ingredients list might look ho-hum, this is a really good recipe to make! It’s budget friendly, it can adapt to what you have on-hand and you can adjust to taste! Like others, browned onions with the beef. Used 1 can tomato sauce, another small jar homemade spaghetti sauce. Delicious and would make again! My husband is counting down the days! ;) Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shellalees"
},
"reviewBody": "The amounts did not fill a 9X13 dish- luckily I made this for only 3 people. You need to at least double the recipe to get this to fill a 9x13 with the exception of tomato sauce. I’ve tried another recipe that adds cream of mushroom soup to cheddar for the top layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "safeece"
},
"reviewBody": "I have a larger family to feed so I increased everything except the ground beef. I always make ground beef stretch further. I'll even use only 1/2 lb for up to two boxes of helper on my cheat days. Meat is expensive. It went over well, even with my 12 year old son, who insists he doesn't like casseroles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "buccaholic27"
},
"reviewBody": "It was good, I will make it again. I just felt like something was too much, maybe the sour cream or maybe it was just me. I did use 2 lbs of ground beef instead on one. I also cut the onion up more than normal. I may tweak around the recipe but i did enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lockett27"
},
"reviewBody": "I made this this past weekend and i did like it. I am not sure maybe i will cut the sour cream down a little bit, I did use 2 pounds of beef instead of 1. I may look into the comment section for additions to this recipe. I twas positively received in the household. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "amandaraerains"
},
"reviewBody": "I ate a few bites and just couldn’t do any more. This would be a lot better with pasta noodles and jarred spaghetti sauce. I followed the recipe to a T. The egg noodles got super mushy and the sauce is almost sour. The sour cream/cream cheese mixture is ok, but I think ricotta cheese would be better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy Gibson"
},
"reviewBody": "I added about 12-14 oz of tomato paste and a couple of teaspoons of black pepper ( doubled the recipe also)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dariotzx"
},
"reviewBody": "I sub the onion for onion powder (around 2-3 teaspoons) and I used a whole 8oz cheddar cheese bag on top.\n\nEveryone, including the picky eaters loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgd56"
},
"reviewBody": "Everyone in my family loves this dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MMMICHELLE"
},
"reviewBody": "Half of my family found this recipe too rich. I would not make it again. Good if you want HEAVY comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "julinovack"
},
"reviewBody": "The sour cream overtook the recipe. If I make this again, I will use only Philadelphia cream cheese, 8 ounces, and will saute onions in the ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wordbank1"
},
"reviewBody": "Easy to make, tastes delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "hayes_40"
},
"reviewBody": "I think this recipe would’ve been a lot better with a jar of spaghetti sauce instead of tomato. Also the cook time didn’t seem nearly long enough, as the onions were still tasting raw and nothing mixed together in the oven. It was ok. I didn’t hate it but I probably won’t make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Young"
},
"reviewBody": "Made this for a 17 year-old boy who liked it a lot. It was very tasty. Leftovers were eaten the same night. Next time, however, I will pre-cook the onion. Even though the casserole was bubbling and brown on top, the taste of raw onion was undeniable. 5 stars if we didn't have onion breath."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Richard Gilchrist"
},
"reviewBody": "Looking for a new hamburger casserole recipe that was different I stumbled on this. I truly believe it is the worst thing I ever made. Because so many comments said dry I added a third can of tomato sauce. Still dry as toast. So many commenter said tasteless I tasted after every addition and adjusted the spices. What looked and tasted good going into the oven was a dry tasteless mess when it came out. No need to ever make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trisha Schoonover"
},
"reviewBody": "I made it, and it was pretty good. I would sauté the onions first, I don't like crunchy onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bfj6kbgdqp"
},
"reviewBody": "Delicious. Followed recipe to a tee. Great comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "6rbkwpk56p"
},
"reviewBody": "Bland. Not enough flavor. Even added fresh garlic more salt and pepper still not enough flavor to the meal. Would not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Renna"
},
"reviewBody": "I followed other reviewers suggestions &amp; puréed the onion. Also I used non fat Greek Yogurt in place of sour cream, chose high protein low fat cream cheese &amp; Italian tomato sauce. I used a low fat Mexican blend cheese for the topping, doubling the amount &amp; omitting the salt. I love being able to adapt recipes to our needs &amp; liking yet not truly change the ingredients. The 4 year old was thrilled to have tried something new and loved it! Next time I will use ground turkey. Definitely 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bloated"
},
"reviewBody": "Double batch made for tremendous leftovers. Substituted mostaccioli for the egg noodles, added paste to enhance the sauce, added a layered drizzle of queso and chopped black olives &amp; utilized Isernio's italian seasoned ground chicken as I was out of beef. Dusted w/penko crumbs &amp; browned it off for 30-seconds. Your mileage may vary some, but woman &amp; child loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Messer Jacobs Cashion"
},
"reviewBody": "It was delicious. I sautéed the onions with the ground beef and after simmering the tomato mixture for 20 minutes, added the sour cream and cream cheese to the mixture. Then I poured everything over the noodles and added cheese on top. It was wonderful!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calran1125"
},
"reviewBody": "I just tried this recipe and I really like it. It has the perfect combination of ingredients to compliment each other."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "howlofawolf092655"
},
"reviewBody": "Added jalapeños and tomatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goodgirlfromno"
},
"reviewBody": "I read the other reviews and I also knew that this is an old recipe, and it needed some spiffing up so I added fresh garlic, oregano, bell pepper and onion. I used a seasoned tomato sauce from a can as well and it came out a lot like lasagna, without the lasagna noodles. I used mozzarella and Cheddar cheese. I have to say that it was faster than lasagna, the noodles made it easier to pull together. I used flat large egg noodles and it was delicious. I know, my recipe was nothing like what was listed in the original recipe, but the original recipe gave me ideas, and using the original as a guide was helpful, and overall, it was delicious, my family loved it and so did I. Thanks to your grandmother for the inspiration!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellenwtate"
},
"reviewBody": "This is the same recipe my mother made that has been a huge and comforting favorite for our home. We call is “GLOP.” The only difference is that scallions were used rather than white onions. They were added to the sour cream and cream cheese just before the hot pasta was added. Excellent stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Page"
},
"reviewBody": "I have a collection of cookbooks from the 40s and 50s that I have gotten from my grandma and my mom. I’ve made a lot of recipes from them. Most times I have to spice things up a bit for our tastes, but we both thought this was great, as written. Can’t thank you enough for a recipe I didn’t have, and will definitely enjoy making again and again. I may try it with taco seasoning in the meat some time, and tomatoes and avocado, maybe slices olives to top servings. Meantime, we will eat it just like this! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillinny.innny I.llinny.ing"
},
"reviewBody": "This is a delicious recipe I have made it many times and the whole family loves it. This recipe is very simple and very good. If viewers want to make a zillion changes, then post it as your new recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle&Kev'sMom"
},
"reviewBody": "This was a huge hit! I made this exactly as written, I always do the first time, and I wouldn’t change a thing. It’s surprisingly delicious considering the simple ingredients. Comes together quickly, inexpensive, and it makes a lot of food! Everyone loved it, and is asking for it to be made again. Thank you for this gem of a recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "Yummy. Double up (or more) the egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisha"
},
"reviewBody": "This recipe is really good, but I did tweak it a little bit. I added 2 tsp of ground basil, 1 tsp salt, 1 tsp pepper and 1 tsp oregano to the beef and tomato sauce mixture. I also used 16 oz of egg noodles instead of 8 oz. I topped it with sharp cheddar and about 1/4 cup of mozzarella. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Cappelletti Schroeck"
},
"reviewBody": "It was delicious! I added mushrooms (cooked with the turkey), and used ground turkey. Also put some fresh mozzarella on the layer with the cream cheese/sour cream. Sprinkled a little fresh basil in between layers as well. I'm thinking next time instead of mushrooms I'm going to try eggplant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cacphelm"
},
"reviewBody": "I liked it but a little rich in flavor and substance. Don't know what do do about it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard Foster"
},
"reviewBody": "I did make a double portion of this casserole. When I make it again, I do plan on making a few changes. One would be more seasoning in the sauce. Overall, a nice, hearty meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Really good! Will make again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Reisner"
},
"reviewBody": "This turned out really well. I used plain Greek yogurt and mozzarella instead of cream cheese and sour cream. I also sauted peppers, onions and mushrooms to add to the ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marjorie seip"
},
"reviewBody": "This is delicious. Made it just like recipe says. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nora Fasano"
},
"reviewBody": "Cooked as recipes suggested. This was horrible. What a way to waste a # of hamburger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "It was easy to make and turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Okamura"
},
"reviewBody": "Very good and easy. Like the recommendations of others, I added parsley and Italian seasoning with the tomato sauce. I only had the 8oz tomato sauce so I squeezed some tomato paste and added some water. Also, I minced the onions, but the crunch added a nice texture without overpowering. As summer approaches, I think I’ll microwave at 50% rather than bake in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Sciacca Maydew"
},
"reviewBody": "This is a great recipe. I followed the instructions and did not add or delete anything. It is delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bouch620"
},
"reviewBody": "Followed directions exactly. Too much sour cream and cream cheese. Ridiculous. Wasted time, money and ingredients .1 cup of sour cream... really? Should have known better from the get go. Stay away from this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne B"
},
"reviewBody": "I made this with spaghetti sauce and used 3 pepper shredded cheese on top. I like a little kick. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline Lyle"
},
"reviewBody": "Very yummy! But I recommend less salt and more cream cheese than noted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommasitaB"
},
"reviewBody": "My husband said to add this one into the often meal rotation. He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine419"
},
"reviewBody": "My entire family of picky eaters loved this dish! I made it as is and am adding it to my list of go-to recipes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Condriet"
},
"reviewBody": "Family loved this meal more than lasagna; less filing and just as flavorful. Added a diced Italian sausage link and substituted the cheddar cheese for mozzarella. Definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHEMOANGELS"
},
"reviewBody": "My family loved this! I did tweak it just a bit - instead of doing the layers I mixed everything together in a big bowl, then put it in the 13x9x2. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carla Coffee"
},
"reviewBody": "I love onions but they were way to strong and I only used 1/2 an onion. Next time I will use less or not at all. Otherwise good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachelle Phipps"
},
"reviewBody": "I’m a busy homeschool mom of seven kiddos so I rarely have time to leave reviews but with this recipe, I just had to. This is perfect and it is so versatile! I used 1.5 pounds of ground venison, and didn’t add garlic salt (just garlic powder). I added some fresh garlic to the pan and sautéed the onion with it like other reviewers did. I added fresh spinach to the layers because I love spinach in casseroles. And I was out of egg noodles so I just cooked up 3 cups of elbow macaroni. It worked out fine! I sprinkled with Mozzarella cheese, as well. My whole family LOVED it This is one of those fantastic base recipes that you can do anything to as long as you have some intermediate cooking skills"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Manship Santos"
},
"reviewBody": "This was great! Better than that frozen stuff. I added a little Italian Seasoning to the hamburger and cheese mixture. Otherwise followed the recipe. Thank you"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231808/grandmas-ground-beef-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
"name": "Pasta and Noodles"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
"name": "Noodle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231808/grandmas-ground-beef-casserole/",
"name": "Grandma&#39;s Ground Beef Casserole"
}
}
]
}
}
, "about": [
]
}
]