				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grandma&#39;s English Muffin Bread"
,"datePublished": "1998-08-28T09:36:30.000-04:00"
,"dateModified": "2022-12-07T14:54:25.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Stephanie Knewasser"
,"url": "https://www.allrecipes.com/cook/24328418"
}
]
,"description": "With this grandma&#39;s recipe, dough for English muffins is made in a bread machine, baked in the oven, and finally sliced and toasted to taste just right."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/elPViKqBW5yLJxqQnwoDJkXGqY4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/343742-068a9770ba29456ca4410ead073ff398.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grandma&#39;s English Muffin Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "131"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "84 kcal"
,"carbohydrateContent": "17 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "118 mg"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup warm milk",
"0.25 cup water",
"3 cups all-purpose flour",
"0.5 tablespoon white sugar",
"1 teaspoon salt",
"0.125 teaspoon baking powder",
"2.25 teaspoons active dry yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place milk, water, flour, sugar, salt, baking powder, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes."
} ,{
"@type": "HowToStep"
,"text": "Shape 2/3 of the dough into a loaf; place into a 9x5-inch nonstick loaf pan. Shape remaining dough into a smaller loaf; place into a 7x3-inch nonstick loaf pan. Cover and let rise until doubled in volume, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake loaves in the preheated oven until golden brown on top, about 15 minutes. Carefully tip loaves out of the pans onto a work surface and gently tap bottoms. If they sound hollow, bread is done."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashb"
},
"reviewBody": "I subbed in 1 cup whole wheat flour. My kids love this bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jdbNC"
},
"reviewBody": "Tried this recipe for the 2nd time yesterday. My error on 1st attempt was mixing yeast with wet ingredients and salt, meaning the dough didn't rise. \nMade the whole recipe the second time in the bread maker on 1.5lb loaf with medium crust. turned out very good. My 15 year old sons eyes lit up as he ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Eagle"
},
"reviewBody": "This is my second time making this bread. I absolutely loved it the first time and am looking forward to it in toast tomorrow morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "candee"
},
"reviewBody": "3"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mkasdorf"
},
"reviewBody": "Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bonnietwo"
},
"reviewBody": "This is really good. I used two largish tin cans from the recycle bin and while the sliced rounds are a bit bigger than traditional English muffin and I haven't made a breakfast sandwich yet, the bread makes great toast and I look forward to having my favorite sausage 'muffin\" with a slice of pepper jack cheese.\nI pan sprayed the inside of the cans and put corn meal all around and the bread just slid out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melnal"
},
"reviewBody": "I don’t have a bread machine so I dumped all ingredients into my KitchenAid mixer and used the dough hook. When it was fully formed I let it go a couple more minutes, then turned it into an oiled bowl for the first rise. A couple hours later I formed the loafs and let it rise again (took about 1.5 hours to double in size). This bread is DELICIOUS!! And soooo easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "barb"
},
"reviewBody": "Grease and corn meal the pans. I used 2 different non stick pans and had to dig it out of both of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi McNair"
},
"reviewBody": "I forgot about using big cans. I like that its easier sounding than my Muffin bread. But its worth the wait . Don't try it in stores because you will be sad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtnay"
},
"reviewBody": "This will be a recipe I will make weekly. It toasts beautifully, and my husband loves it. I let the bread maker mix and proof it, then kneaded I to loaves to rise and bake. It is strange that there are two different size pans; I may try adjusting quantities to get two regular-sized loaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PinkyBelle"
},
"reviewBody": "I enjoyed the ease of making this recipe and the flavor and texture of the finished product. I divided the dough into two 9x5 inch silicone bread pans that I oiled with olive oil. I'm not sure why I could not have put all into one. The two breads ended up being only a couple of inches high, but still delicious both un-toasted and toasted (even better). I baked an additional 7 minutes to the recipe -- worked for my oven. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy"
},
"reviewBody": "Made ti exactly to recipe and baked in loaf tins for 20 minutes.Lovely soft crust and crumb. Tastes equally good toasted or plain. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joann"
},
"reviewBody": "I have made this recipe twice over last 2 weeks and it is delicious. I used self rising, unbleached flour last time and recipe was still perfect. Used muffin rings and made 9 large English muffins. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Bueker"
},
"reviewBody": "I baked this in one loaf pan 9x13 for 15 minutes. This is a non sweet bread so yes you need to toast, butter, and jelly is great. Tastes like English muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nona"
},
"reviewBody": "Loved the way this comes out. Great taste and texture. Will definitely be a regular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CEJONES"
},
"reviewBody": "Great! Did the whole thing in my bread machine. Easy! As others suggested, did a 1.5 loaf on medium. Came out perfect. Slices perfectly with a bread knife. We used it for sandwiches. Our favorite bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela Cutrer Strussion"
},
"reviewBody": "Extremely dense, outside was crispy.....Tastes more like bread than English muffins. Someone stated that getting the dough out of the bread maker was a gooey mess, I agree 100%."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robetta"
},
"reviewBody": "followed recipe and turned out very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bandonandy"
},
"reviewBody": "This recipe is exactly one half of the recipe I've used for the last 30 years. I make it every Christmas. Tastes great!\nOne difference, the quarter tsp of baking powder should read \"baking soda\". And I'm not sure if a quarter tsp of anything will make a difference.\nThe main thing is making a yeast bread with milk instead of just water.\nForget the bread machine; you can mix it in a bowl.\nOne other change, if you use the full 3 cups of flour, it's really difficult to mix. Use a bit less flour, don't knead the dough, just put it into a greased loaf pan dusted with corn meal. Let it rise and bake.\nToast before eating. Great with just butter or for tuna fish sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phantom"
},
"reviewBody": "haven't tried yet but to answer Tamara it back to the old fashion way of doing by hand, mix and kneed until smooth let raise"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr B"
},
"reviewBody": "English Muffin bread looks interesting. However, what is the process if you do not have a bread machine. \nI buy muffins practically every week. I cannot send review without a rating, so I rated it a five, presuming it would have been delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nona Dooley"
},
"reviewBody": "Can 8 make this gluten free by just using 1-1 gf baking flout"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akitamom2"
},
"reviewBody": "Very good easy recipe. Tastes great toasted. Might add cheese next time. Poppy seeds too. Hubby liked it too. I just made a nice loaf in a rectangle pan. Two minutes before it was done I put butter on top. Came out golden brown. And little nooks and crannies! Will try muffins next time.\nUPDATE: I made this bread again. Had to bake it in my extra large toaster oven. Came out good again. Used honey instead of sugar and bread machine yeast. Used the dough cycle on the bread maker and it rose up great. I did have to put it under the broiler to brown it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GraceSuggs"
},
"reviewBody": "This is being added to our weekly baking list. It’s fabulous. I made no changes this time but next week I am excited to try baking it in a coffee can to get that traditional round shape. I did bake mine a little longer but won’t do that next time- it came out too hard after I toasted it later. Wonderful recipe, thank you for taking the time to share it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Lombardo"
},
"reviewBody": "I made it but I made it in the breadmaker instead of portioning it out what I did before it started baking I quoted the breadmaker with corn meal and then put the door back in and let it bake and it came out oh so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mklee"
},
"reviewBody": "I tried making this three times and it didn't turn out right all three times. I tried another recipe on a different site and am eating my third batch and love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DianneBP"
},
"reviewBody": "I've tried this a few times and it always comes out dense! What am I doing wrong? I do the dough cycle, I punched it down and reshape it. Should the dough be kneaded or just punched down? Any suggestions would be helpful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian Latham"
},
"reviewBody": "no changes was great the way its made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toeless1"
},
"reviewBody": "I've made this bread a few times &amp; family absolutely loves it it's a regular bread on the table now I try to make some to take to my mother-in-law I took a small loaf to her &amp; she only allowed her self 2 slices in morning 1 slice in afternoon 1 slice with her tea at bedtime"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliana Abdul Majid"
},
"reviewBody": "I have change and make me as bun. I don't put the baking powder &amp; water. But add 1 tbs of margerine &amp; 1 tbs of olive oil and add some extra milk.\nThe bread comes fluffy and nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyr"
},
"reviewBody": "I will make again!! Very good. I did dough in bread machine then split into 6 pieces and baked on a cookie sheet on parchment paper with corn meal. Next time I would split dough into 8 to 10 pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikeheath0426"
},
"reviewBody": "Used stand mixer on #2 for about 10 minutes. Also subbed in 1/4 cup sourdough starter for the 1/4 cup water. Came out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Stanfill"
},
"reviewBody": "I'm giving this five stars because it's delicious and I hope people try it. I'm a little puzzled about the pan size though. The recipe uses three cups of flour and 1 1/4 cups liquids and barely enough other ingredients to fit in a thimble. Yet the recipe calls for using \"one 9x5 pan and one 7x3\". Folks, use ONE 9x5. If you divide it out your bread is going to be about the height of biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie rose"
},
"reviewBody": "Tried this recipe,made the dough in stand mixer,let it rise for two hours.Knocked it back and rolled to 3/4 inch thickness and rested for ten mins.Cut into 8 rounds with scone cutter.placed them on maize meal covered tray to rise for half an hour.Preheated fan oven to 200 degrees c.Flipped over each muffin and sprinkled maize meal so both sides are now coated.In oven for 15 minutes and hey presto ,absolutely fabulous looking and tasting little treats for brekkie cut in half and toasted,lashings of marmite :) Never buying rubbish shop bought ones again !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "Wonderful recipe! I've been eyeing this for a while and so glad I finally tried it! Used the bread machine's dough cycle as recipe directed. I then divided the dough into six balls, dusted with cornmeal, then flattened a bit. Placed on greased and lightly cornnmealed sheets. Covered with lint-free towels and let rise ~45 min. (They really didn't rise much but they expand more while baking). Baked at 425 deg F oven for 8 min, then turned over and baked another 7 min. I could not wait until breakfast, so I just had a half with butter and jelly. Wonderful texture, crispy outside, softer inside, and better than store-bought! Who knew? Thank you Stephanie and your Grandma!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SimplyChey2014"
},
"reviewBody": "This is a really awesome recipe. This was my first time making bread and it turned out so good. I don't have a bread machine so I hand mixed everything,and it still was delicious. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gnvrlnn"
},
"reviewBody": "I made this with out a bread maker. Mixed all the dry ingredients - except the yeast. Mixed the milk &amp; water in a small bowl &amp; put it in the micro for 2 minutes, put the yeast in &amp; let that sit for about 10 minutes. Then put the yeast mixture in the dry ingredients &amp; mixed it with a spoon &amp; then with my hands. I covered it &amp; let it rise for 1 hour. This dough was really fluffy. I do eventually want to try this in a coffee can, but I rolled it out &amp; it made it 6 english muffins to my suprise &amp; I made the rest of the dough into a loaf. Let everything rise some more while the oven pre heated. Put them in the oven at 400° for 8 minutes &amp; flipped for 6 minutes. &amp; well that was too much time for the muffins. I left the loaf in for 5 more minutes. These were really fluffy &amp; I got the crevases in the bread, but it lacks the english muffin flavor. I have made the recipe called English Muffins countless times &amp; although Ive never gotten the crevases, its got that good flavor of english muffins. I think I will try adding a bit of baking powder to my go to english muffin recipe &amp; maybe get those crevases we're shooting for. I love the texture of these though. After making this recipe, I give them each a 4. &amp; I dont have time to change the other review so Im giving a 5."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I made this tonight to go with chicken noodle soup and it was fantastic and easy! I made mine in a 9x5 pan and it was perfect! The family loved it too so this will be a frequent staple in our house. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laughing Paws"
},
"reviewBody": "This is the sixth or seventh English Muffin recipe I've tried and I got Perfect results on my first try. These are Excellent! I rolled out the dough until it was an inch thick, cut out 8 3 inch wide muffins, reworked the leftover dough and put that into a small loaf pan. After they'd raised I put them in the oven for 8 minutes and then flipped them over and dropped the temp down to 375 for another 6 minutes. Don't turn them over before you cook them for 8 minutes otherwise you'll smoosh out the nooks and crannies.\n\nI don't have a bread machine so I mixed the dry ingredients, made a well in the middle and then mixed it all together. It was easy.\n\nThese have the BEST flavor of any English Muffin's I've ever had. Next time I'll add cinnamon and raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZS "
},
"reviewBody": "Have made this many, many times always mixing with a stand mixer. I don't divide the dough as the loaves are too flat for our liking - use one 9x5 pan and bake until it's a light golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Miller"
},
"reviewBody": "Hooray for Grandmas and their recipes! I was a bit unsure of ratio, knowing it takes 1 cup of liquid to 4 cups of flour, but this turned out perfect. Being summer and hot I decided to cook the bread in the machine. I set it 1 1/2 lb loaf, at medium darkness, and it turned out fantastic. I will have to find some round metal cans to make this more like traditional muffins. Thanks so much for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROGERBERRY"
},
"reviewBody": "made the whole loaf in my bread machine set on medium size and medium crust. it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chicaD"
},
"reviewBody": "I stuffed the dough 2/3 the way up a can and it puffed up much higher when it was done raising/cooking. Next time I'll do just over half full. Other than figuring that out, it was really great. I loved the ease (I usually do regular ones...good but much more time-consuming.) and the flavor was really great. I had plenty of holes for my butter to melt into. =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Smith"
},
"reviewBody": "OMG! this is absoultly wonderful bread. The thing I did was to splenda sugar blend for the sugar. Turned out wonderful using the medium crust setting for a crunchy crust. Doesn't get any better than this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joanna Lynne Cortina"
},
"reviewBody": "I don't know what happened.\nWe don't have a bread machine so I kneaded the dough by hand. It's so heavy to the touch and so hard to shape. I halved the recipe so I could just shape it into a log or a loaf. I was thinking that I'd slice it after I bake it so I can toast it. The dough didn't rise, after I waited for an hour. So I just baked it. After baking, the top looks like a rock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suze"
},
"reviewBody": "Easy and good. Will definitely be making again, but next time will let it rise a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOSMOM"
},
"reviewBody": "Excellent! I made them as regular loaves because I didn't have cans... but they were great - everyone LOVED them. I had to stop the family from eating it all before tomorrow morning breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LASTCHILD"
},
"reviewBody": "These are ab fab.....family won't eat store bought anymore!! And so easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taylor Carroll"
},
"reviewBody": "I made this twice- the first time was with the two pans, although they were the same size. The bread was SO good toasted! I wanted to try it again using just my bread machine. The bread fell. I will try adjusting the recipe so it works in just the bread machine. Any suggestions would be greatly appreciated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jblhopper"
},
"reviewBody": "I followed the recipe except for replacing 1 1/2 cup flour with Whole White Wheat Flour which I normally do for all my bread recipes without any problems. I mixed it with my BM, then baked in oven. It turned out very heavy and did not rise alot and was more like french bread than english muffin bread. I will give it another try and see if it is any different"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "I made this bread in the bread machine, spritzed it with a little bit of olive oil mist, rolled it in cornmeal and baked at 350. It didn't seem to turn golden brown. The bread was denser than I'd like, no nooks and crannies and I didn't think it had any of the flavor of English Muffins. It wasn't at all sour. The loaf was very nice, toasted nicely and was quickly gobbled up. I have no idea what or why I should divide it into two unequal parts, so I didn't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannine"
},
"reviewBody": "This is the best bread ever! It disappears before I have time to slice it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JeanneE"
},
"reviewBody": "I am not sure what I did wrong, but mine didnt rise at all. It tastes fantastic, but it is really flat and dense. I made the dough in a bread machine, so I wonder if that might have been the problem. I'd love any suggestions on what I did wrong. It still is excellent! I am determined to figure out what happened to mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manderly"
},
"reviewBody": "I have made it as written as well as with whole wheat pastry flour. The original is better but if you want it a bit healthier the latter isn't bad at all. :) This is my favorite bread for toast and jam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Palmer Jeffery"
},
"reviewBody": "I have been trying to make a version of this in the machine that my mom made when I was growing up. Sadly I didnt find her recipe. My husband immediately came out with \"where did you get this bread? Its really good!\" and I knew it was a keeper. Perfect texture....no changes needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelc"
},
"reviewBody": "This is a BIG staple in our house. I make it all the time. I've also given it as a gift. I can never get the \"unequal parts\" correct. I just do my best. It's super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Joy"
},
"reviewBody": "So delicious!!! Anything less than a five star rating is just plain user error!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larryhunt2001"
},
"reviewBody": "I have tried several english muffin recipes in my bread machine, this is the best! Last time my husband wanted Eggs Benedict, I was out of homemade, so I bought some, never again. I am making some now so I have some on hand when he comes home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lylarose"
},
"reviewBody": "I changed things up a bit. I exchanged 1 cup of whole wheat flour instead of white flour. It tasted great. I think next time, I will try to roll them into balls and flatten them slightly. It had great texture with the wheat flour. Now I just have to get the presentation too! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CorkiDeCat"
},
"reviewBody": "BRAVO! After trying to find a good recipe off and on thru the years, I am done looking. I thought it would raise like normal bread, but it didn't take long! Only change: It was 111 today in the AZ desert, so I used a 10x5 pan in my counter top convection oven at 325 for about 20 minutes. Thank you Stephanie for sharing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Parker"
},
"reviewBody": "I love this bread. I make it all of the time. It is the only bread that my kids like that I bake. There is one thing; I do however just half the bread equally and put it in two bread pans of equal size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SWAGNER777"
},
"reviewBody": "These are delicious just like Thomas English muffins except a lot cheaper. Defiantly a keeper. Thanks Stephanie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail C Hester"
},
"reviewBody": "it was perfiect and it came out well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kath"
},
"reviewBody": "Great Recipe ~ a big hit with hubby. I made this in my bread machine today! My husband stops home from work during the day and he was able to sample it and he loved it! Btw, he took the whole loaf with him as he left...that speaks volumes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lynda edris"
},
"reviewBody": "I can't rate this yet as I just put it in the oven. HOWEVER when the dough cycle finished on my machine, I couldn't even get it out of the container. It was a gooey mess. I followed the recipe exactly. When I finally got it all out by adding extra flour and greasing my hands it only was big enough to put into one 9x5 pan. There was nothing left for a 7x3. Can anyone tell me what I may have done wrong. AND, it is not raining so that should not have affected it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yamatograd"
},
"reviewBody": "This recipe is wonderful toasted or not. I had a slice straight out of the oven with real butter...OMG...SO good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smitty"
},
"reviewBody": "i have never tasted such good english muffin bread...followed the instructions for bread machine dough cycle then formed it into a french loaf type loaf ... let it rise for 40 mins and baked in 325 oven for 25 minutes...it rose even more when baking and it is so lite and fluffy and tasty...i sprinkled cornmeal on the baking sheet before i put the dough on it...man oh man...a new fave bread recipe... thanks grandma!!!update...since i REALLY like this bread and make it often i thought i would try and make english muffins from the dough and am i glad i did...i rolled the dough to about 1/4 - 1/2 inch thick and let it rest covered for about 10 minutes, then cut out six 3 1/2 inch circles and placed them on parchment sprinkled with cornmeal...rolled up the rest of the dough into a little loaf and put it in my small loaf pan...i put into the oven with the light on and let rise for about 1/2 hour...baked the muffins in the oven at 350 for about 8 minutes and flipped over and baked the second side the same...they also rose abit more while baking...and the little loaf of bread i baked at 350 for about 20 minutes...well am i glad i did that...the BEST english muffins i have ever made...THEY EVEN HAD NOOKS AND CRANNIES and were lite on the inside and a bit chewy on the outside...just as we like them...and the little loaf of bread turned out like the others i made from this recipe...THANKS SO MUCH AGAIN for this recipe...really no need for me to try any others!!!! june 26th...i subbed bu"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SCOUTSAGIRL"
},
"reviewBody": "Can you give a recipe less than 1 star? I wish! I don't know what magic a bread machine conjures to make this palatable, but when trying to make this the \"old-fashioned way\" it ain't a happenin' thing. I made this the same way I have made other breads (with much success) but this one was a tough, doughy monster that didn't want to come together. When it did, it was chewy in dough form and totally unpalatable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katie Fear"
},
"reviewBody": "I don't understand. Maybe you can't make it without a bread maker. I tried it with my kitchenaid dough hook and I proofed the yeast first... it hardly rose at all. I have flat bread. It looks ridiculous. Bummer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justina Schneeweis"
},
"reviewBody": "This bread is wonderful! I used to buy english muffins every few days and make breakfast sandwiches for my family. I'm never buying them again. I used the coffee can idea, and like another reviewer i made the mistake of using a can with a lip. To get the bread out I simply opened the other end of the can with a can opener, cut the bubbly round top off the bread and it came right out the bottom. We snacked on the golden top while it was fresh and the perfectly circular bread has been making sanwiches. 20 minutes in the oven worked for me.***** NOTE FOR BAKING IN CANS WITH LIPS. I found that the cans with lips can be easily rid of the lips with a can opener!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsPacNW"
},
"reviewBody": "This recipe has become a staple in my household. It makes 8 english muffin rings plus up to three more \"muffins\".\nI make this recipe atleast 2x a month."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mothergoose"
},
"reviewBody": "i make this everyday, with my kids two a day aren't enough! what an excellent recipe. i mix my ingredients roll the two breads in cornmeal,shape like a baguette and bake them on my bread stone until golden. FANTASTIC!! of course toast,use homemade butter and homemade jam or jelly the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Davis"
},
"reviewBody": "I made this recipe entirely in my bread machine. It is delicious. My daughter &amp; son are visiting from out of town and enjoyed this so much that I will be making a loaf tomorrow for them to take home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sbruins79"
},
"reviewBody": "Very good recipe, but I baked for 10 minutes as the directions instructed, and It would have been mush had I not put it back in the oven. Probably baked more like 25 minutes. Very English muffin like. I think the trick is to avoid working the dough as it was full of air pockets and very light once it came out of the bread maker. Also allowing it to rise (turn the oven on and place over the vent burner) is very important to avoid having a dense bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieCC"
},
"reviewBody": "This is *wonderful*. I make English muffins with it by cutting into six pieces, making balls of dough, then slightly flattening them on top. FANTASTIC. I cannot have pre-made English muffins due to allergies, so this was doubley-good for me - it's been ages since I had an English muffin!!! Thank you so much for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "Taste is great, will make again. More of a batter bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "I have a question, not a rating... what if one does not have a bread machine? Then what? Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stinkabinka"
},
"reviewBody": "i will never buy english muffins again. my son and i ate some fresh out of the oven. thanks grandma. has anyone replaced some of the white flour with whole wheat?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hope"
},
"reviewBody": "This recipe was easy and OH! SO GOOD!... I used rice milk in mine due to dd's dairy allergy and it came out fine. Next time I'm going to try it in a coffee can. We loved it with butter and honey as suggested in other reviews. I will be making this again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Effie"
},
"reviewBody": "I used this recipe as it had rated highly and I needed an English Muffin that could be made in a bread machine - too lazy to knead by hand! I cooked them as instructed for Traditional English Muffins. I'm really pleased how much like the real thing they look and taste. Much easier than I expected, I'll definitely be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "This recipe is so great. My wife and I wanted to eat it all as soon as it came out. I took the advice of other reviews and used two 11.5oz coffee tins to make round muffins. Two of them worked perfect although we had to let them cook a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Gotaas Carter"
},
"reviewBody": "What a yummy recipe! A little sidenote (totally user error!): I baked mine in two coffee cans, but didn't pay attention to the fact that the cans had \"lips\" at the top, so, I couldn't get the bread out. I had to cut it and make a mess. Guess I'll have to look for a better can! I also tried this with wheat flour, and it didn't turn out as well. I will never buy store bought muffins again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Anne Cutler"
},
"reviewBody": "Made mine in a can, posted photo for folks who can't visualize how your sample photo slices are round from bread :). Used plain soymilk plus extra 1/2 tsp sugar in lieu of the milk to make this a pareve/non-dairy bread. perfect! Super light crust slid right out of the can after baking, sliced beautifully after cooling and toasted up JUST perfectly. I'm in love!! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chari Campbell"
},
"reviewBody": "Great tasting right out of the oven! (I couldn't wait any longer!) Love the crust!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnieO60"
},
"reviewBody": "This is a wonderful recipe. Tastes better than the store bought kind. I had mine with butter and honey. Yummy! DO toast it for the best flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Elane Berry"
},
"reviewBody": "Phenomenal! Soooo good, I don't think I will ever buy english muffins again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMHAYNES"
},
"reviewBody": "This recipe is simple and delicious.\nI plan on sharing this with all my co-workers tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xeracia"
},
"reviewBody": "I left this in the brad machine for the entire cycle and made a loaf. We then sliced it and toasted it and had it with bacon and eggs. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KEZ"
},
"reviewBody": "I forgot to buy English muffins this week. I knew I'd seen recipes on this site for English Muffin Bread so I looked them up. I chose this one as friends from the Quality Cook had made it and rated it well. I can see why this was excellent. I greased the loaf pans and coated them in cornflour. Neither my husband or daughter could believe how much like English muffins this was. Thanks Stephanie's Grandma."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanaquil"
},
"reviewBody": "I thought I had reviewed this bread. My 7yo and I love this recipe, it makes awesome bread. I wouldn't change a thing, execpt to bake in greased coffee cans. Have made many times, a true classic. Thanks Stephanie's Grandma! Origianl review: Lovely bread! I used a coffee can to make part of this, and I loved how the bread came out---the ridges on the coffee can made perfect slicing marks. I also make a regular loaf in addition to the coffee can loaf. (see posted photo)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Butchart Cowie"
},
"reviewBody": "Absolutely awesome!!! This bread came out perfect exactly as the recipe states. Only difference is that I just put all the dough in one larger bread pan. We can't keep it long as we eat it up so fast!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JcolleenD"
},
"reviewBody": "the bread is GREAT! the first time i made it i think i ate an entire loaf my self! Fresh from the over is of course prefered, but even after a few days the flavor and aroma is heavenly from the toaster"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARLYNSMOMMY"
},
"reviewBody": "This bread is so good, and does taste like English muffins! I didn't use this with a bread machine, and just kneaded it in my Kitchenaide. Excellent recipe! Thanx for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SELEA"
},
"reviewBody": "English Muffin Bread is always tasty and wonderful! The recipe specifies bread pans, the picture shows English Muffins, not bread baked in loaf pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELA0870"
},
"reviewBody": "OH MY GOSH!!! Delicious. Definitely toast it though. Great with butter and whipped honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Knewasser"
},
"reviewBody": "This is in response to Reviewer Selea. This is Stephanie, this is my recipe &amp; my photo. I baked the bread in a large greased &amp; floured CAN, as I said my grandmother used to do. When it was cool, I sliced &amp; toasted it. It's bread, just baked in a can instead of a traditional bread pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gardengirl3642"
},
"reviewBody": "Flavor was very good! Only problem I had was it didn't raise very high, so I didn't have a real textured bread. This recipe is worth a second try though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This bread was just delicious! I made it for my family and they loved it! It tastes just like bakery fresh english muffins and it was easy to make and clean up after. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LESLIE SMITH"
},
"reviewBody": "This is a fabulous recipe! It is so easy and delicious. Last year I made it to give to friends and neighbors with a small jar of jam (and directions to toast) for a holiday gift. I can't emphasize enough to toast and butter each slice. It is so good!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/6903/grandmas-english-muffin-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
"name": "Breakfast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/6903/grandmas-english-muffin-bread/",
"name": "Grandma&#39;s English Muffin Bread"
}
}
]
}
}
, "about": [
]
}
]