				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grandpa&#39;s Peanut Butter Fudge"
,"datePublished": "2000-02-23T09:02:19.000-05:00"
,"dateModified": "2020-06-18T23:02:37.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Adriander"
,"url": "https://www.allrecipes.com/cook/8964"
}
]
,"description": "A rich homemade peanut butter fudge. Make it a tradition in your family."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cz6nguHL4qHwoqKKqMlojFWhwr4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1076649-3bb7fa7368064f649ed9eb28b8c46e2e.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6138734636001",
"description": "This family fudge recipe is creamy and delicious! ",
"duration": "PT1M",
"name": "Grandpa's Peanut Butter Fudge ",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4c7d62aa-83ef-4793-88f2-24e5ae88ebdd/2f75ab92-ef82-4073-ae3d-f546d5b708fb/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T12:31:03.509-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grandpa&#39;s Peanut Butter Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "220"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "26 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "59 mg"
,"sugarContent": "24 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups brown sugar",
"2 cups white sugar",
"1 cup milk",
"1.5 cups creamy peanut butter",
"1 tablespoon margarine",
"1.25 teaspoons vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix brown and white sugar with the milk in large pot; bring mixture to a boil. Stir in peanut butter, reduce heat to medium, and bring the mixture back to boil (stirring constantly). Remove the pot from heat when a drop of the mixture forms a ball in a glass of cold water."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cz6nguHL4qHwoqKKqMlojFWhwr4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1076649-3bb7fa7368064f649ed9eb28b8c46e2e.jpg"
}
]
,"text": "Stir margarine and vanilla into the mixture; stir vigorously until the fudge hardens. (Always stir in same direction.) Pour fudge onto buttered plates or waxed paper. Let cool and cut into 1-inch pieces."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cajunmel"
},
"reviewBody": "I didn’t think this would turn out right because after boiling for 8 minutes the mixture was of a thin liquid, but I added an extra tablespoon of peanut butter and BBC an extra 7 oz jar of marshmallow cream. I then stirred it for a couple of minutes and poured it into my pan and let it set up in the fridge over night. It set up perfectly. It cut beautifully ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just made this yesterday. I really, really wanted to like this recipe, actually am considering selling PB fudge as a side hustle, already had a simple, decent recipe and wanted to try some alternatives. I chose this recipe because it had much less butter, brown sugar, and milk. Been thinking about this recipe for a week now, one of those where you read it, and say to yourself \"this could be really good\".\n\nIt was not. While edible and sweet... it barely tastes like peanut. Mine came out like a gritty sludge, I remember it was crystallizing in the pot as it was boiling... and I was worried that I hadn't boiled it enough. I had some today, and it almost made me cry, thinking of the ingredients and time I wasted making it. We've eaten about 3-4 pieces, and I am pretty sure I'm just going to throw the rest away. I really hate to waste food, but this was ... a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Precious Blankenship"
},
"reviewBody": "I've recently gotten back into cooking and am trying to find recipes that are like the ones my mom used. This is the closest I've seen so far. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherri Rarey"
},
"reviewBody": "It was delicious but it never set up. It remained creamy and never hard enough to cut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alfaduetto"
},
"reviewBody": "Got in a hurry the first two times I made this. They were a little grainy. The third time I got to true soft ball using 137 degF and all was great. Very very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char317"
},
"reviewBody": "I decided I wanted to make fudge as Christmas gifts this year but wanted to find a recipe that was like what my dad &amp; aunt made when i was a kid. all i remembered was that it had brown &amp; white sugar no marshmellow anything in it and they poured it into buttered platters. So i googled peanut better fudge and looked at every recipe after reading the ingredients of this recipe and reading the instructions it came back to me thay they would also drop some fudge into a glass of water so i decided i would try this recipe out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "car540"
},
"reviewBody": "Looks really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T. L. Tucker"
},
"reviewBody": "Made as directed several years at Christmas. Always turns out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2021"
},
"reviewBody": "Tastes great from what I tasted out of the pot. I hope it sets properly! Added the peanut butter, butter and vanilla after cooking sugar and milk to soft ball."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Stephens"
},
"reviewBody": "So, I just tried this. I have a disability and cannot vigorously mix it though, so I'm basically playing Peanut Butter Fudge roulette right now. Plus, this is my first time making fudge and I do not have a candy thermometer. I'm living on the edge right now. LOL I mean, if it doesn't harden up, I suppose we will just have Peanut Butter Fudge soup. That sounds good, too. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashlei P"
},
"reviewBody": "First time fudge maker here and no candy thermometer. I read some reviews prior to making this fudge and cut the recipe in half so I didn't waste a bunch if it didn't turn out. I brought the sugars and milk to a boil and turned to medium and follow the directions, using a cold cup of water. As soon as the mixture turned to a ball when dropped in water I put it in my mixer and added the PB- mixed in completely then added butter and vanilla right away. On the lowest setting I mixed for about 6 minutes until the fudge started to thicken. Came out great, nice and tender fudge like you want and peanut buttery goodness. Can't wait to share and make for the holidays or any occasion honestly! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sadie"
},
"reviewBody": "Excellent! I'm new to fudge making and was looking for a peanut butter fudge that would replicate the delicious fudge my mom made over 60 years ago. Even though the texture of this one isn't the same as I remembered, I wasn't disappointed in the outcome. It's delicious, and easy to make. I was looking for a hard, dry texture and \"Grandpa's\" is smooth and creamy. I read through the reviews before starting and didn't add the peanut butter until after the sugar mixture had reached 234°. I stirred a pinch of salt and 1/4 tsp of maple extract in with the peanut butter. The salt cuts through some of the sweetness. A half recipe made the right amount of fudge for an 8\" pie plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hillary Collier"
},
"reviewBody": "Awesome recipe! It came out perfect! ??????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Inez Earnest"
},
"reviewBody": "The flavor is awesome, and I followed the advice in some of the comments to add the peanut butter after taking the mixture off the heat, however, it was dry and crumbly. After a bit of research, I discovered that this recipe did not explain that you have to allow the mix to cook to 110F before the vigorous stirring. This helps to prevent crystallization. Corn syrup could also help, but I don’t know how that would affect the flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "This makes a good peanut butter fudge and it's easy enough to make. I used an instant read thermometer to make sure the temperature was between 232 and 235 degrees. I also took the advice of other reviewers and used my Kitchen Aid to stir it after removing it from the heat. You don't want to stir it until it gets hard, as it says in the directions. You just need to stir it until it is cooler and begins to thicken. Otherwise it will begin to get lumpy. It's nice to have a recipe that doesn't rely on marshmallow fluff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jenna"
},
"reviewBody": "When I made this it turned out really gritty, I am pretty sure I did something wrong though. It was my first time making this. Could someone help me out? It also never cooled right, its still super sticky. It looks nothing like the pictures, but when making it the steps looked very similar to the video. Everything looked right. It was a mistake on my end, I just cannot figure out where I messed up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aila"
},
"reviewBody": "i substituted milk for water, and i didnt measure the peanut butter too well, i also didnt use vanilla extract, but it looks great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookiemonster27"
},
"reviewBody": "super easy and makes great tasting fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Carreras Wells"
},
"reviewBody": "My father in law loves peanut butter fudge and buys it everywhere, but it's never peanut buttery enough for him. He's told us about the wonderful fudge his grandmother used to make so I decided I'd try this one. HE LOVES IT! I have made it several times and I typically add extra peanut butter for him."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Adams Weaver"
},
"reviewBody": "Just finished pouring onto plate. Looks nice. My concern is that I wasn’t sure how hard it was suppose to get Before I poured onto plate. I couldn’t stir any longer because it was so thick so I poured. I’ve never made fudge before so we will see. Batter tasted yummy for sure though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Steinbach"
},
"reviewBody": "I am not a fudge maker but this was very easy and turned out great. The only change to ingredients I made was to use evaporated milk. I don’t own a candy thermometer so I attempted the softball test. Putting the peanut butter, butter and vanilla in the mixing bowl ahead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Samantha Vogt-Evans"
},
"reviewBody": "great taste, but didn't firm up enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Angela Beedle"
},
"reviewBody": "I followed the reviews. Used my candy thermometer got to soft ball and dumped the sugar mixture into my kitchen aide with the peanut butter, butterz and vanilla. I started washing up the dishes. After about 20 minutes I check the fudge and its dust! Its not smooth or creamy in the slightests. Not to sure what to do with this. Im sure I can find a creative way to use it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hagen Day"
},
"reviewBody": "nice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Lynette Holmes"
},
"reviewBody": "made this but didn't have brown sugar so i used four cups of granulated sugar instead.....the fudge turned out perfect....thanks so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Nichole"
},
"reviewBody": "Not really suee what stie till harden means but I stirred it til it was thick and it's been like 30 mins or more and it's still soft on the inside. What did I do wrong ? Taste amazing though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scamp"
},
"reviewBody": "I changed nothing. It stayed creamy long enough to use as icing on a sheet cake with enough remaining for some fudge snacks on the side. It is a good and easy recipe. Made it without a candy thermometer, mit’s more fun! Pan licking good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy Mumford Brown"
},
"reviewBody": "Tasty recipe but I made a few cha\nUse evaporated milk in place of regular milk. Evap. milk has less water and fudge cooks faster. When fudge is at softball stage take off stove. At this point I let the fudge cool some then start beating (reduces beating time.). DO NOT let the fudge harden in the pan. It is a nightware. Beat fudge until the glossy top changes to dull. You will ge able to tell when it changes. THEN pour into prepared buttered pan to harden. Delicious recipe with minor changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelia Pittman"
},
"reviewBody": "Very easy. Good. Tasting receipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patriciaj"
},
"reviewBody": "Very good and easy fudge. I put in the fridge to get it to set up quicker. I followed the recipe exactly and used a 9x13 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Picerno"
},
"reviewBody": "I used a candy thermometer and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenm98674"
},
"reviewBody": "This is the best peanut butter fudge. Followed the recipe exactly and it turned out perfectly. Tastes heavenly. And NO marshmallow cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Dabbs"
},
"reviewBody": "Lost the family recipe , found this one . Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vina Rose"
},
"reviewBody": "I made this fudge recipe tonight and it turned out perfect. I have attempted making fudge a few times in my 54 years, but it would never set for me. Not sure what I was doing wrong, but tonight it set perfectly. I did add walnuts and it is delicious! I even got to cut it with a knife this time!! GREAT RECIPE FOR FUDGE!! \n Cool cool double cool :o) Thanks Pam for sharing your moms recipe with us!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla Spence"
},
"reviewBody": "Added 1 cup of walnuts.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Miller"
},
"reviewBody": "This is great for that old fashion, make it hard kind of fudge. My bf loves, remind him if his mom's!!! Points for me ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Hand"
},
"reviewBody": "I have been using this recipe for years. It is wonderful every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "junedaze75"
},
"reviewBody": "My 6 yr old grandson and I decided to give this recipe a go. I’ve never made fudge before and I was pleasantly surprised at how easy this recipe was. Not to mention very delicious! I stirred the mixture by hand after it was brought up to temperature (candy thermometer is a must). Next time I’ll pour the mixture into a bowl and use a hand mixer. The texture was perfect! After chilling it overnight in the fridge, even better !!! I am planning to make this fudge a part of my homemade holiday gifts! Thanks for a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "I just made this and put it in fridge to cook down! Tasted good soo far. I just hope it turns out like a chewy fudge and not creamy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "llynns"
},
"reviewBody": "something went horribly wrong! all the reviews made is sound fool proof...it is not! it all went downhill when I put it into the kitchen aid and it hardened almost immediately when I added the peanut butter and butter...didnt even make it to the vanilla before it was crumbling. maybr it will be great over ice cream? It's not grainy though, just crumbly. and almost fits into 10x15 cookie sheet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Garote"
},
"reviewBody": "This is almost the exact recipe that my grandma used to make for our family. She now has Alzheimer's and has forgotten the recipe. We all thought it was lost for good. I'm making this for christ ma's presents for my family this year. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Austin"
},
"reviewBody": "I changed up two things after cooking: I used a 7x11 pan for this (recipe says pour it on a plate?) and also, after cooking I set the pan in some cold water to speed up the process of cooling while stirring. It came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam Tortorice"
},
"reviewBody": "Thank you for this recipe. I used to watch my mother make peanut butter fudge and beat it by hand until her bicep bulged. ( An impressive woman). I have made this many times the way it is written. I always like using the soft ball method without a problem. It's like writing in cursive. Try it to see if you remember how. For the reviewers who had bad results; an old friend used to say \"The arrows don't miss the target, It's the Indian\" Try it again. You will end up with great fudge and a feeling of accomplishment. Isn't that what cooking is about. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Taylor"
},
"reviewBody": "It tastes just like my Grandma's! I had to go old school and use the soft ball method. (I'm too cheap to buy a thermometer here) I enjoy the experience of a classic method and a classic taste. This recipe nailed both. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lauren Elizabeth Lindauer"
},
"reviewBody": "I have made this 3 times now and the first two, it didn't set. This time, instead of whipping it by hand, I put it in my stand mixer and turned it on slowly progressing to high speed for 7 minutes. It finally set! \n\nI gave this a 3, because without my strand mixer, I wouldn't have ever been able to get it to set up. However, based on taste it is my favorite, which is why I always come back to it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Raven"
},
"reviewBody": "Easy, very yummy, old school recipe! This was my first attempt ever @ making fudge. This is a excellent recipe!!! Soooo yummy! Makes A LOT! I didn’t tweak this recipe at all, it turned out beautifully! Thank you for sharing this wonderful recipe! I will use this recipe over n over again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreen Lee"
},
"reviewBody": "Went with other people’s reviews came out just fine like soft peanut butter flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chris Spencer Sekunna"
},
"reviewBody": "HELP... I read dozens of reviews and this sounds so easy, but I have made 3 different batches.\nThe first 2 did not set \nThis last one is dry crumbles.\nWHAT AM I DOING WRONG????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Kramer"
},
"reviewBody": "Exact copy and it's very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lora Fletcher"
},
"reviewBody": "We're"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymona Callais"
},
"reviewBody": "Easy recipe to follow, and the fudge was a success! It set perfectly and was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannette Palmatier"
},
"reviewBody": "I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "i qould make it again but put half of everything i found it a little to sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Torrey Anderson"
},
"reviewBody": "I was trying to find a recipe close to my grandpa's classic peanut butter fudge (I only have his chocolate written down) and this was quite close. My only issue with the instructions is cooking the peanut butter during the initial candy making process, as he always told me to cook the milk and sugar to soft ball, remove from heat, then add your fats and vanilla while stirring until your arm feels like it's going to fall off. Using his technique I came to the desired consistency of fudge I was looking for and am pleased with the results. I had to take a star off for the directions because I believe adding the peanut butter too soon is why others are experiencing issues with the final product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Lolo"
},
"reviewBody": "I used dark brown sugar and half and half. These changes accually turned out really good!!! The fudge has a nice strong peanut butter flavor and its creamy and rich!! I didn't have milk so half and half did the trick!! Thanks for sharing such an awesome recipie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alsgal613"
},
"reviewBody": "Absolutely delicious! I had been looking for a peanut butter fudge recipe that didn't have marshmallow creme or confectioner's sugar when I came across this one. So glad I did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Giffin"
},
"reviewBody": "I have not made fudge for years, but I wanted peanut butter fudge. It's really hard to find a recipe that doesn't use marshmallow cream it turned out great. The only change I made was butter instead of marg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ken Cossitt"
},
"reviewBody": "Sadly I didn't have access to a candy thermometer and I'm pretty sure i didn't get things hot enough so it didn't set up quite right.\n\nStill turned out delicious though and I'll definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "worlds best grandma"
},
"reviewBody": "Not much of a peanut butter taste. I tasted more brown sugar than peanut butter. Not creamy at all. I won't be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheWhiteWolf"
},
"reviewBody": "I followed the directions exactly and beat for 5-6 minutes with a hand mixer on the lowest setting. It came out smooth, creamy and wonderful. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CCCooks"
},
"reviewBody": "Cut it in half &amp; it worked great! Very creamy &amp; easy recipe. Reminds me of the kind my Mom used to make in a skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SHNSGMA"
},
"reviewBody": "This rating is not so much for the dish but for the instructions. I made it and it never came out of liquid form. After reading reviews I discovered it needed to boil for a while at 235 degrees with a candy thermometer and then it had to be beaten with an electric mixer for 10-14 minutes. I put the whole mess back in the pot and started over boiling with all ingredients. I have fudge, not sure what it tastes like, I'm sick of dealing with it all day and really don't care to try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ron Christiansen"
},
"reviewBody": "I have made this twice and both times it has came out soft. Is this the way it is suppose to be ? I was thinking more firm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "briggymariep"
},
"reviewBody": "I read some of the reviews. I always add the vanilla and butter be for I do a \"soft ball test\", and when it was finally ready (for those who find it easier w/a candy thermometer: 230-250 degrees ferenheight) id quickly add the peanut butter, stir it vigurously, and quickly transfeer it to a pan lines with wax or parchment paper. Ive never had a setting issues that way. I love the ingredient ammounts, Plus im thankfull it dosent include fluff-so messy! Great recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitney"
},
"reviewBody": "Great creamy peanut butter flavor and really easy to make. If you've never made fudge before and want to give it a try this is the perfect recipe. It can also be made using chunky peanut butter if you want to add some crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tana Zawlocki"
},
"reviewBody": "The easiest fudge I've ever made. I love the taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa Sheehan"
},
"reviewBody": "Always a hit with kids and friends always are asking for it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debsyjo"
},
"reviewBody": "Easy as pie! First time I've ever attempted making my own fudge and I have to say I'm quite pleased! I've just poured it into their respective tubs to cool down, and when it's done I'll take another pic. I decided to make sweets as gifts for my Dad and Husband this year rather than buying any, as I wanted to show them how good they've made my year and how glad I am that they are my family, and this recipe turned out absolutely perfect for the sentiment. Thank you so much for sharing, this is fabulous. And if I can do it, it can be done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol L Buckingham Ferrer"
},
"reviewBody": "Going to try this recipe next week, one of my bowling ladies made it and brought to bowling party yesterday - oh my god - soooooo good!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Elizabeth Rogers"
},
"reviewBody": "The best peanut butter fudge recipe I ever made. Perfect. Great tasting. I did put the peanut butter in with the butter and vanilla. Mainly because that is the way I have always done it and was afraid to cook the peanut butter in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Ive never had peanut butter fudge before, but my boyfriend loves it so i thought id try to make it. I followed the recipe exactly, tested the sugar milk mixture for the softball stage in a glass of cold cold water, and mixed peanut butter in after i took it off the heat.\nit turned out great! \nnot grainy at all, super smooth. Might be my favorite fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bklingelsmith"
},
"reviewBody": "I followed the recipe and ended up with caramels that tasted like peanut butter. Ended up pouring melted chocolate over the top and calling it peanut butter candy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna M."
},
"reviewBody": "Thank you soooo much for this recipe! This is the first fudge recipe that has ever worked for me. Definitely giving five stars for this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillbont"
},
"reviewBody": "I made this fudge twice last Christmas for holiday gift plates, and my life-long love affair with chocolate fudge took a sudden turn...all I can say is one of the batches never left the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erae84"
},
"reviewBody": "I'm not a big fan of fudge myself, so I made this for my girlfriend. She said it was delicious, but next time I will make it in a more shallow pan - it was waaayyy too rich to be so thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Solstice"
},
"reviewBody": "This is still setting (I can tell it's going to without a problem most likely) but I tasted the fudge in its non set state and it was really good! Very easy to make for me as a first time homemade fudge maker (on my own)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cally"
},
"reviewBody": "Loved it. Made for my Christmas cookie dish this year! So easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Harbl"
},
"reviewBody": "Tastes great but I too followed the recipe exact and it is more like a caramel. From now reading all the reviews I think the problem with it not setting is we are following the recipe and adding the peanut butter when it comes to a boil. Most of the 5 star ratings say they added it after the softball stage. I also used my kitchen aid mixer so this is the only difference I see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy cooker"
},
"reviewBody": "I tried this recipe and it was awesome! Thanks for sharing. I did as someone suggested used therm. And timed the beating for 6minutes. Everyone who tried it said it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Constance"
},
"reviewBody": "This is the only fudge I can make! It's so good, and easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "This was super easy and super delicious. If you love peanut butter then this is for you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRACYFAWN"
},
"reviewBody": "I have used this recipe for years and love it. Turns out perfect every time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "This fudge was good but it was gritty and the mixture was REALLY runny so I added more peanut butter,I think that the sugar to milk and peanut butter ratio left a bit to be desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcurf"
},
"reviewBody": "I can't belive it! I cannot make fudge it is the one thing that I can't make. This recipie rocks, it was setting, which in my experience never happens for me. I shut the burner off after it reached 234 degrees, then added the Peanut butter, butter and vanilla, I mixed gently which brought the temp down around 180, I poured into my kitchen aid which I had read to do in other reviews, and started to mix, only mine was setting before I even started the mixer, so I only mixed for about 10 minutes on number 2 speed, and then patted it into my pre-prepped pan. The flavor is awsome, and is one of the best fudges I have ever tasted. I am totally not sure how people are getting PB carmels out of this, becuase I got fudge, and I suck at fudge. The only changes I made was that I used 2 TB of butter, and I used half and half instead of milk cause that was what I had and I needed to use it up. Thank you, Thank you, Thank you. This is going to be a family christmas tradition from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pyrzqxgl"
},
"reviewBody": "I substituted 2 Tablespoons of butter but otherwise was faithful to the recipe. It was delicious, and not overly sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Caldwell"
},
"reviewBody": "I have made this exact recipe for the last two Christmas' and without a doubt this is the best I have ever tried. I use a candy thermometer, so no guesswork as to the soft ball stage and an electric mixer, which saves the hand beating. Everyone that tries it has to have the recipe. Thanks Grandpa for this special treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Parker"
},
"reviewBody": "Best peanut butter fudge recipe I have made. Comes out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Sredna"
},
"reviewBody": "Sooooo delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcjack"
},
"reviewBody": "outstanding"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LoveJC03"
},
"reviewBody": "I just tried making it and I don't know what happened. I ended up with a dried crumbled mess, so I thought I'd add a little milk to make it creamy again and it looked like taco meat. I am the one girl who cannot make peanut butter fudge to save my life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "awesome-cookieB)"
},
"reviewBody": "Very good fudge, tastes exactly like peanut butter but is a little bit too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "This fudge is so easy to make and it tastes great. I cooked the sugar milk to a boil and used my hand mixer after adding the peanut butter. I topped the fudge with 2 handfuls of chocolate chips and pressed them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Hey! This is my recipe exactly - do we have the same Grandpa? :) One thing I do which seems to bring it to the soft ball stage quicker is add a little bit of almost any type of syrup - corn syrup, maple syrup, honey, anything along that line - about 1 Tbsp. Don't ask me why that helps, but it seems to. I love the suggestions to use a beater - I'm going to try that next time. I've also never tried adding the peanut butter right at the beginning - I think I'll give that a try also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen Gibbs"
},
"reviewBody": "OMG, this is the best fudge I've ever had. Keep stirring and it won't be grainy. Thanks so much for posting this. It should be 10 stars!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BigBearMe"
},
"reviewBody": "I would have to give this a one. At least for me, this did not turn out at all. After reading the reviews, I used a candy thermometer and tried to use my Kitchen Aid mixer. I started the mixer and went to the sink with the pan to put it in hot water, when I turned back to check on the candy, it was powdery. I was very careful measuring the ingredients, even used my digital scale to make sure the sugar amounts were correct. The only thing is, I do live at about 7300 foot level in the mountains of Southern California."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SCOUTSAGIRL"
},
"reviewBody": "Too sweet, WAY WAY too sweet. Even for fudge, which is sweet, this is over the top. Too bad there's no less than 1 star rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juanice"
},
"reviewBody": "This was fantastic, my dad made great fudge and this reminds me of his, thank you, he passed 5 years ago!!!!! A great homemade taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KWilson"
},
"reviewBody": "This was my first attempt ever in making fudge, so I was concerned how it would turn out. No worries with this recipe though! I followed the directions exactly (with the exception of using almond milk instead of regular milk), and it turned out beautifully. I made this for an annual Halloween party, and everyone devoured it! This will be my go-to recipe for fudge forever. Thank you so much for sharing this wonderful recipe!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19168/grandpas-peanut-butter-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
"name": "Fudge Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1279/desserts/candy/fudge/peanut-butter/",
"name": "Peanut Butter"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19168/grandpas-peanut-butter-fudge/",
"name": "Grandpa&#39;s Peanut Butter Fudge"
}
}
]
}
}
, "about": [
]
}
]