				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grandma&#39;s Polish Perogies"
,"datePublished": "2019-04-02T02:47:25.000-04:00"
,"dateModified": "2022-05-31T09:27:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "STEPH577"
,"url": "https://www.allrecipes.com/cook/1146320"
}
]
,"description": "This recipe for perogies has been passed down for generations. Learn how to make these delicious potato dumplings that are easy to customize."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7zBqG85Cww2uXwSMA4oN1eTgJyQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3540617-2954b01afc2f4e518ffbf58403c6b222.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3609424195001",
"description": "See how to make traditional potato-filled perogies.",
"duration": "PT4M14S",
"name": "Grandma's Polish Perogies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d4044e05-61ea-41e9-b40a-1460ae5777ed/39ccd199-e3e1-4b11-82f0-fb1e23fc7e3f/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T23:33:43.876-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grandma&#39;s Polish Perogies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "483"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "281 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "50 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "351 mg"
,"sugarContent": "1 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"4.5 cups all-purpose flour",
"2 teaspoons salt",
"2 cups sour cream",
"2 eggs",
"1 egg yolk",
"2 tablespoons butter, melted",
"2 tablespoons vegetable oil",
"8 baking potatoes, peeled and cubed",
"1 cup shredded Cheddar cheese",
"2 tablespoons processed cheese sauce",
"1 pinch onion salt, or to taste",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare the dough: Stir together flour and salt in a large bowl. Whisk together sour cream, eggs, egg yolk, butter, and oil in a separate bowl. Stir the wet ingredients into the flour until well blended and the dough comes together. Cover the bowl with a towel, and let stand for 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, prepare the filling: Place potatoes into a pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Drain potatoes, and mash with shredded cheese and cheese sauce while still hot. Season with onion salt, salt, and pepper. Set aside to cool."
} ,{
"@type": "HowToStep"
,"text": "Separate pierogi dough into two balls. Roll out one ball at a time on a lightly floured surface until it is thin enough to work with, but not too thin so that it tears, between 1/8- and 1/4-inch thick. Cut into circles using a cookie cutter, pierogi cutter, or a glass, 3- to 4-inches in diameter."
} ,{
"@type": "HowToStep"
,"text": "Assemble the perogies: Brush a little water around the edges of the circles, and spoon some filling into the center. Fold the circles over into half-circles, and press to seal the edges with fingers, or use a fork for crimped edges."
} ,{
"@type": "HowToStep"
,"text": "Place perogies on a cookie sheet, and freeze. Once frozen, transfer to freezer storage bags or containers."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7zBqG85Cww2uXwSMA4oN1eTgJyQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3540617-2954b01afc2f4e518ffbf58403c6b222.jpg"
}
]
,"text": "To cook the perogies: Bring a large pot of lightly salted water to a boil. Lower perogies into the water in batches. Cook until they float to the top, about 5 minutes. Do not boil too long, or they will be soggy. Remove with a slotted spoon."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethsara"
},
"reviewBody": "TO Alkie, My husbands Grandma made her pierogies with Dry Bakers cheese. I think I have the recipe for the filling but Never had her dough recipe. I am going to try this dough since it got some good reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imauniongirl"
},
"reviewBody": "I made this for my polish husband's family, about 30 of them. To this day, they still rave about *my* peirogies and ask for the recipe. I made the dough exactly as the recipe which is what they were so amazed with. For the filling I did half of the peirogies as suggested in the recipe and the other half a mushroom-kraut filling i found. They were both gone super quick. If you want authentic peirogies - or at least the best dough according to my polish inlaws, this is the recipe for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I would give this recipe a 4.5. Suggested changes: I found the dough to be very sticky so would increase the flour to 5 cups. I boiled the potatoes whole for 30 mins until fork tender then peeled and riced them. Also, I added 1 medium finely chopped onion, which I sauteed in 1 T of butter, to the filling. Lastly, I added 2 t of onion powder and 1/2 t garlic powder to the filling. Makes them less bland and more like the brand name pierogis you can buy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "huktonlife"
},
"reviewBody": "I find Perogies made with potatoes and the dough are too starchy. I fill them with Italian sausage and saurkraut. This is the way my Polish Aunt made them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "alkie"
},
"reviewBody": "My grandmother who was Polish use to make these with farmer boy cheese only, boil then fry them in butter. Can't find farmer boy cheese here in NC"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miranda"
},
"reviewBody": "Wonderful! I boiled half and fried half. I opted to skip freezing due to time. I had no leaks, I probably just got lucky. The flavor was perfect, and I served them with cabbage rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "turnercameron692"
},
"reviewBody": "Loved it! I used this the first time I made perogies. I made them too big. I followed this recipe for my second time and made them smaller - much better. I love the hack about freezing them separate on a cookie sheet so they don't stick together when you freeze them after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon McKenney"
},
"reviewBody": "Just like Baba's!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Changes696"
},
"reviewBody": "Excellent recipe! My husband and I tag teamed and made it exactly how you did. We served it with our New Years pork and sauerkraut meal!! What an excellent addition. I see a tradition here!! I will roll the dough thin next time though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicachica"
},
"reviewBody": "This is the easiest dough I've ever worked with! Didn't even need to use flour to roll out the dough.\nI use potato flakes to make my filling. It's faster and easier. \nAlso, boiling your dumplings in a rice cooker works much better than doing them on the stovetop. There is almost no cooling of the water, even when adding frozen pierogies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Db F"
},
"reviewBody": "I dont like sourcream so i didnt care for the flavor much.if you like sourcream go for it .my husb. Loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delucaj0810"
},
"reviewBody": "Delicious and authentic! This recipe was so easy and made so many more Pierogies than I anticipated. I only made a half batch because I only had 1 cup of Greek yogurt that I substituted for the sour cream and I made 26 Pierogies. This was my first time making homemade Pierogies and I am so glad I did, I never need to buy frozen ever again. These are so yummy and taste just like my grandmother’s recipe that I never got to acquire before she passed. I boiled all of them in batches of six, cooled then froze is the same small batches of 6. I personally like to pan sear Pierogies in caramelized-onions to get a crispy brown crust on them. This recipe takes me back to childhood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carole D"
},
"reviewBody": "I eliminated the processed cheese sauce. The quantity of potatoes called for was way too much, had a huge bowl of mashed potatoes leftover after filling all the pierogis, 4 to 6 potatos would have been plenty. This dough was easier to handle and work with than the other pierogi dough recipes I've tried, but be sure to roll it quite thin (no more than 3/16\") to avoid have pierogis that are too dense and doughy. The potato filling was a little too bland for us, I will add some spices next time and make a variety of fillings, mushroom and probably saurkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "svkillips"
},
"reviewBody": "It should be noted that 8 baking potatoes is a pretty imprecise measure. The average baker is almost a half pound so 4+ lbs of filling for 20 pierogis is WAY off. Since this little project was my son’s idea and he wanted to just follow the recipe we did as it said but there was a TON of filling leftover. It would have been much better had the recipe provided a weight rather than a number. We could have probably done well w 1 lb or two bakers. ***We used the rest of the filling for potato soup and potato pancakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jbrown62709"
},
"reviewBody": "This was my first time making these. My family is Polish so i wanted to try. They are very time consuming but with butter and onions on top they were AMAZING!! Made with Polish kielbasa!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Higgins Lauzon"
},
"reviewBody": "Delish. My husband rolled out the dough which really cut down the time. I made exactly as written and they were perfect. I got a little fancy after the first few batches and started adding different fillings to the potato filling. I will make these again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred Freed"
},
"reviewBody": "I loved these perogies. I used the shredded mexican cheese blend from Walmart. I used leftover potatoes from Xmas. I added some onion powder to the potatoes. \nA few helpful hints\nCover a large cutting board with an old pillowcase. Dust it with flour. You won't work too much flour into your dough and they won't stick.\nThe dough seemed a little dry so I added some water to the dough but that may have been to my error in measuring the flour\nWork with maybe a fourth of the dough at a time to keep it from drying out.\nI used a wide mouth canning jars to cut the dough seemed like the perfect size to me\nCook until they float it will take much longer than store bought perogies\nI like to finish them in a saute of butter and onion.\nAgain very good hope you enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Danilowicz"
},
"reviewBody": "This recipe was great! The dough was easy to roll out and manipulate compared to other recipes I have used. I made my own potato filling. Using some water around the edges to seal worked really well. We also used a fork to make it look fancy. This is a tradition that I started with my daughters 3 years ago. They love making them and between the 3 of us we made about 120 pierogi today in about 3 hours start to finish. If I had made the filling ahead of time that would have cut out about 45 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Deshazor"
},
"reviewBody": "This is a great recipe! If you desire crisp pierogies lay them on a plate layer by layer, separated by wax paper (they’ll stick together once dry if you lay them on top of each other). Once your batch is boiled and free of excess water, pan fry with a little oil and onions and eat with applesauce or sour cream. It’s an extra step but I don’t consider them finished until they’re fried and they are delicious that way!\n\nAdditionally, try different fillings. Make the potato base like you would extra thick mashed potatoes, separate it into a few different bowls, then add cheddar cheese to one, diced cooked onions to another, sauerkraut to another, and you can even do farmers cheese (sweet filling). This recipe is a great base to build upon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Cosgrove"
},
"reviewBody": "I made these today for my family dinner. They were a huge hit. Best perogies we’ve had. \n\nI would recommend adding a little more salt to the dough, but other than that, these are amazing. \n\nAwesome make ahead meal too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alycja"
},
"reviewBody": "I am giving you one less star for writing the name wrong: it’s called PIEROGI"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Followed the recipe exactly, except I sautéed them in butter after boiling them. They were very bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome! Our 11yr old grandson requested these for a birthday treat. Made as directed, used grated cheese instead of cheese sauce. Outstanding, time consuming, made over 2 days works best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jana"
},
"reviewBody": "Made the dough portion of this, not great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Wow! This recipe is amazing. The dough is a dream to work with and so good. We did add more cheese, did not use cheese spread, but we did have to much filling left. No problem I floured it the next morning and fried making potato pancakes. Yummmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TG"
},
"reviewBody": "I didn’t add the cheese sauce and just used a bit of extra milk instead. By themselves they’re fairly plain, but browning them in butter with onions after boiling them is very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherie Lytle Moyer"
},
"reviewBody": "Absolutely wonderful! It's a simple recipe to follow, just a bit time-consuming. I also ended up with an absurd amount of filling. I had to triple the dough recipe in order to use all of my filling. I didn't mind though....just more pierogies for my freezer! Soooooo yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren’s Life!"
},
"reviewBody": "I made a few changes: \n1. We added sausage inside of the filling \n2. we fried them\nThey were delicous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard LeBlanc"
},
"reviewBody": "Not as labor intense as it sounds. Makes best tasting perogies our family has ever had, and we buy gourmet perogies in addition to grocery store brands. Substituted cream cheese per the video - very creamy and used whole milk, which was adequate. Hack: to the recipe I added 1 slice of thick bacon and 1/2 onion, frying the onion and bacon sliced into small 1/2” squares, together. Added that to the potato mixture after done and mashed; the bacon and onion were easily blended. The taste was outstanding. Yield for the recipe is ~60 3.5” perogies BTW, do not see yield in original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zach"
},
"reviewBody": "Taste just like the ones I used to get from a shop run by polish ladies in Calgary! Whole family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HermFam"
},
"reviewBody": "Very good recipe. I used a dumpling cutter so they looked a little different, but the flavor was perfect! I was a little short on the sour cream for the dough, so I mixed together some cream cheese a milk to get a similar texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sequoia04"
},
"reviewBody": "Definitely fry these up in a pan after boiling them. \nI made them using the lid for my smallest pot. It seemed to work fine but made them pretty large.\nI found the filling pretty dry. If I make these again I may try adding sour cream or something to filling.\nI cut the recipe in half but wound up with a gigantic bowl of mashed potatoes leftover. I only used a fraction of them to fill the pierogies even though I halved the potatoes too. Apparently my 4 russets were at least 2x as large as they should've been. I guess I'll make some potato pancakes this weekend with the leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emilee"
},
"reviewBody": "Added onions and did not add cheese sauce. Also, pan fried them in some oil after boiling for crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "WOW, my first time making perogies, made the dough recipe exactly as written, beautiful to work with. I did add finely chopped and sauté onions to the mashed potatoes instead of the onion powder (just a personal choice). After freezing, I saute them in butter and more sliced onions, they were delicious! Thanks for sharing STEPH77"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle millson"
},
"reviewBody": "My friend and I tried 3 recipes for the dough and it was so hard to roll. This recipe was the easiest to make and the best tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Halcrow"
},
"reviewBody": "The dough was very good and I made my own fillings. It was delicate and sticky dough and for once, I had no « duds » while I boiled them for 3 minutes. My first attempt I halved the recipe and the second I made 1/4 of it. It was the same with time. It will be my new go-to recipe for perogies dough. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ria"
},
"reviewBody": "These pierogies are very easy to make even for a novice like me. The recipe did make more potatoes than needed for one batch of dough...This may be because my baking potatoes were large. I may have had an out of proportion amount of potatoes if I did not roll them out thin enough as well. That said... I got 40 pierogies out of one batch of dough. I made larger 2-3 inch half circles. (The amount each batch makes is determined by how big of a circle you cut out.) The dough was easy to handle and sealed well when I wet the edges. I can't wait to make another batch of dough to use with the rest of my potatoes! :) I did not make any changes to my recipe except adding a bit more cheese and seasoning to my taste with Pepper, onion salt, and garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "red fraggle"
},
"reviewBody": "These are delicious! I halved the recipe because it was my first time making them, but I will be doubling it in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Donakowski"
},
"reviewBody": "I gave up on Pierogi dough until I found this recipe. I did modify it a bit. Less flour, more eggs, a little water. But it was great to work with and made a nice thin dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djdeb63"
},
"reviewBody": "These are the best perogies I've ever had! I make them with organic ingredients often. They freeze well which makes it easy to have on hand when the craving starts! I don't use the cheese sauce listed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Mallory"
},
"reviewBody": "We make these Pierogies every year. At Christmas we serve them and our guest enjoy your them very much. This year we added roasted garlic to the potatoes Delicious is all I can say. Try this recipe you will enjoy them.\nWe came from a small town in Ohio and they make homemade Pierogies every Friday. We’ve never had a pirogi so good before moving to Austintown. This recipe taste just like the ones they made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bernie"
},
"reviewBody": "Very happy with this recipe. The dough was easy to work with. It was stretchy and didn’t tear easily. The only problem I had was it was too sticky. But I used extra large eggs, and I think that was the problem. I just rolled it in lots of flour and then it went through my pasta machine quite nicely. Very tasty. This is my new favourite Perogies recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Bourgoin"
},
"reviewBody": "I've made this recipe three times with rave reviews from the picky eaters of my family! I make an onion, cheddar cheese and potato filling, ground meat and even buffalo chicken. For a treat I did strawberry filled ones for Easter. This recipe for dough is amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hariet Brown"
},
"reviewBody": "Such wonderfully creamy whipped innards. Me and my boys Cody and Brody nearly thought we’d travelled back to an old shtetl, huddled by a fire, drowning in soup and dumplings. Food CAN be that powerful, just ask ALL the grandma’s passing down timeless recipes such as this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al the chef"
},
"reviewBody": "It's a winner everytime I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn84olives"
},
"reviewBody": "This turned out great. You really don't need 5lbs of potatoes. Just about 4 baking potatoes will do. I had fun making these, really easy to do"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacinda Crewe"
},
"reviewBody": "Great, simple recipe! My 5 star review is for the dough (though the filling is good, too... maybe not quite flavorful enough for me). \n\nI've made this several times and it turns out well each and every time. I've cooked freshly made perogies, and also from frozen and both turn out wonderfully.\n\nFor filling, you can do anything that your heart desires! This is a great use for leftover mashed potatoes. I've also done fillings with sauteed veggies, middle eastern spiced ground meat, potatoes with cream cheese and dill, blueberries with a pinch of cinnamon and sugar inside, cooked apple pie filling... anything goes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Hall"
},
"reviewBody": "Definitely making again. Fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don Summers"
},
"reviewBody": "I just made these and my wife loved them. I’ve never made perogies before in my life and I have to say this recipe makes a great meal. The instructions were clear, accurate and resulted in a fine product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustJen"
},
"reviewBody": "This dough recipe is amazingly delicious!! With Pierogis you can use any filling...I’m sure the one mentioned in this recipe is awesome, but I chose a potato recipe from this site “Caramelized Onion and Horseradish Smashed Potatoes” as the filling in my Pierogis. I served them with homemade beer braised venison bratwurst and sauerkraut!! I found a recipe that my husband and I love to make a whole dinner together!! It is now our signature dish, thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Riter"
},
"reviewBody": "Perfect every time. Easy to work with. Great project to do with Grandkids. It truly is the Polish recipe for perogie’s dough this Polish girl grew up with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dadoo"
},
"reviewBody": "There are hundreds of pierogi recipes out there. I made this one years ago for the first time and never used another one. I grew up in coal-country PA. The pierogi capital. And this recipe is the best one, closest in taste to what I grew up with. We ate many homemade pierogies at home that were made by church groups, firehouses and of course Mrs.T's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tammy"
},
"reviewBody": "This receipt is terrific. I have tried many receipts and nothing compares to this recipe. Dont waste your time looking for another perogie “dough” recipe. It is so EASY to make..you won’t believe it. Don’t change a thing, it’s perfect. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Newbery"
},
"reviewBody": "Very easy to make, the hardest part is filling the perogies and stretching the dough, good thing my wife was home. These were honestly the best perogies I have ever eaten. I'll never buy bagged again. Make sure to use onion salt as recommendes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "They turned out great. The dough was pretty easy to work with once you added a little flour to the counter and rolling pin. I doubled the cheese and added sautéed onions. They definitely taste better in butter and soft then fried and harder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Farhat"
},
"reviewBody": "Love love love thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JackiG"
},
"reviewBody": "I ended up with a huge amount of leftover mashed potatoes, probably could have cut the amount in half. It’s a decent recipe, but I doubt grandma and great-grandma used processed cheese sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel S"
},
"reviewBody": "This recipe is so good. Definitely reminds me of my grandmother's. I usually make a big batch, and we freeze them to cook whenever we are feeling the itch. \nI make my filling a little different than the recipe, but that is personal preference. The first time we made this recipe, we followed it to a tee and they were perfectly delicious. I make the filling like I make my mashed potatoes. milk, sour cream, butter, salt, pepper, onion powder and garlic powder. All to taste. \nI get tons of compliments on this recipe. So, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Simon-Smith"
},
"reviewBody": "Loved it. Very easy. Wish that the potato amount was by weight. I guessed and it still turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christian Mozumdar"
},
"reviewBody": "I made only the dough for the pierogi because I had a prior commitment to specific filling. But the dough was excellent. Had zero broken pierogi after boiling. The last dough I used was rough to work with and no matter what I did many busted open in the boiling water. The dough is this good- I’ll try the whole recipe next time!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MacKenzie Carullo"
},
"reviewBody": "We added \nBaked bacon @ 400 degrees for 20 mins then chopped it up and added on top of the potato mixture\nseasoned with olive oil salt and pepper \n\n\nAfter the potatoes are mashed and cool we mixed in cheddar and 1 package shredded Farmers cheese as well as 1/2 sweet onion uncooked\nMake sure to roll your dough very thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssteckley"
},
"reviewBody": "Came out good. Wife loved them. I would just recommend that you either make a half batch of the filling, or double the recipe for the dough. LOTS of filling left over.\n\nI fried in a little oil after boiling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Flare"
},
"reviewBody": "I thought this was a pretty good recipe. The pierogies turned out well and had a good taste to them. My only complaint with the recipe is it didn't say how much filling to put in each pierogi. As a result, I seriously under-filled mine and had a bunch of leftover potato filling (which was fine since I like mashed potatoes). Other than that, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Justine Tadena"
},
"reviewBody": "Came out good! fried and served with sauteed onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dobermanmom"
},
"reviewBody": "Nope. Greasy and oily. They also don’t fry up crispy. They’re too heavy, and not with the effort to roll out. They were a sticky mess to make and I won’t use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaBug"
},
"reviewBody": "My husband is from Pennsylvania and we can't get them around here. He was so happy with this recipe. He said they remind him of his grandma's. I replicated the recipe exactly and my only note is I had a lot of leftover filling. Next time I will use only 6 potatos. Other than that the family and my neighbors enjoyed them a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Marie Adams"
},
"reviewBody": "Best dough recipe I've found! so smooth and easy to use.. I tweaked my potatoes with the cheese we eat but I have to say awesome dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julia Kerr"
},
"reviewBody": "I could have used some more details in the recipe itself. For example, the dough was VERY sticky and I wasn't sure if it was supposed to be sticky or if I should add more flour to combat it. (The stickiness ended up being combated by the flour in the \"rolling out\" stage.) I didn't know how big the circles should be, or how they would shrink in size once cut. That being said, when the recipe was all completed and my pierogi finished boiling they were delicious. I tried a second filling: 1 small cabbage, some baby bella mushrooms, 1 small onion, 1 celery, 1 shredded carrot, and 1/2 a green pepper with seasoning salt, garlic powder, dill, a dash of red wine vinegar, and black pepper to taste. It was a nice alternative to the traditional potato. This had been on my cooking bucket list for a while so I was happy that I had some success on my first try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Solbrig"
},
"reviewBody": "I have made this twice so far. The first time I made them exactly as the recipe suggests and they were very tasty, but pale in color. The second time, I fried them a bit in a pan after boiling to add some color and texture. I got a compliment from a Polish girl at the party I took them to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Zapala-Park"
},
"reviewBody": "I make these all the time. closes to my Mom's recipe. Never fails me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizz"
},
"reviewBody": "I had 7 small baked potatoes in the fridge and choose this recipe to use them up (scooped out the middle)...the pierogis were so yummy! I did not find the dough hard to work with, after reading reviews I made sure to use plenty of flour when rolling them out (and I had to use 1/2 sour cream, 1/2 buttermilk due to shortage of s. cream). I also browned up some ground pork so we had three flavors, potato/cheese mix (did not use any type of liquid cheese!), potato/pork, and potato/bacon. Need to improve my pierogi shaping, but overall a great recipe and easier than anticipated. PS. Did not freeze them but boiled right away. Took them out when floated to the top of boiling water, dried on paper towels and fried in butter - worked out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KCFood"
},
"reviewBody": "Plan to make a day of it! The first time I made it, half way through (2 hours?) I told myself this takes too much time, I'm not making it again... first bite, amazing, 'okay, I have to make this again!' Filling I used cheddar cheese, pepper, butter with russet potatoes. I made the potatoes first, then the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joeandanne"
},
"reviewBody": "I use my pasta roller to roll out the dough and got a beautiful uniform thickness. The dough was easy to work with, just a little sticky for the rollers so added lots of flour while rolling. I used bacon, cheese &amp; onion with the potatoes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valgurl1"
},
"reviewBody": "I made these for the first time for my boyfriend who LOVES perogies, so there was a bit of pressure. But I did everything the recipe said. But after I boiled them I put them on napkins to absorb the moisture so they don't get soggy. Then I fried them in oil and lemon pepper. If you haven't had them with lemon pepper you're missing out!! It makes all the flavors just pop! I dipped them in sour cream and they were to die for! My boyfriend said that those are the BEST HE'S EVER HAD!!! He can't stop eating them! Thank you for this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Williams"
},
"reviewBody": "No changes made to this recipe. I made someone's Polish Grandmother proud :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Hebda"
},
"reviewBody": "Turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cj37"
},
"reviewBody": "Best perogies I've ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RJT"
},
"reviewBody": "I made the dough as is, and it was perfect and pretty forgiving compared to other doughs. For the filling I used my mashed potatoes. (homemade with sour cr, cream ch and bacon) Next time I am trying it with my hot spinach dip inside. Again the dough is perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lsalafia"
},
"reviewBody": "Best all around perogie dough I've ever made. Easy to work with. Just be prepared to feed a large group. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "These turned out amazing. The recipe was easy to follow and simple. Added a few ingredients to my potato filling - parsley, garlic powder, and omitted the cheez whiz. Was able to refrigerate the dough overnight and make a second batch the following day. Both sets were great! Family loved the perogies and we will have this on the menu for Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn"
},
"reviewBody": "Made the recipe as is the first time. Grew up with polish neighborhoods and now live in the south where you CAN NOT get a good perogie. These are better than I remember them to be. Just finished making them and had to boil then saute 2 just to be sure they were ok. More than ok, they are worth the time. I recommend you flour your board when putting them aside to cook later as they will stick. Only made the potatoes and can't wait to saute them in butter and onions. Totally worth the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Faye"
},
"reviewBody": "Thank you so much for this recipe! Just like my mom's. Followed recipe exactly and turned out wonderfully. The only thing I might change next time is to add a bit more shredded cheese to my filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefania Di Pietro"
},
"reviewBody": "Absolutely amazing recipe! They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tori Mikula"
},
"reviewBody": "I love them! I did change the processed cheese to melt cheese and I used extra sharp cheddar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Smith"
},
"reviewBody": "I liked the final product but found a few problems; first, the dough was very sticky and hard to work with. if I were to make this again, I would add at least another half cup of flour, or would add only as much sour cream as was needed instead of the whole amount at once. Also, I used medium potatoes and had too much filling, so I would use small ones next time. Very tasty though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Formica"
},
"reviewBody": "These are time consuming, but oh -so- worth it. The recipe makes approximately 3 dozen, depending on how big you make them. I did have extra potato filling, but that will get eaten quickly in the form of potato pancakes in the morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Cullens Kork"
},
"reviewBody": "Just made these and they are as good if not better than the ones my dear Mother In Law made or the ones we would buy from a ukranian church. I didn't alter other than boiling minced onion with the potatoes and using a food mill for smooth filling. I think I have a winner recipe. Thank you. I also got almost 8 dozen well worth a few hours in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "I pretty much followed the recipe, except I added more cheese to the potatoes. This dough is unbelievable! So delicate, not dense and chewy at all - I think the sour cream has a lot to do with that. This is my new go to pierogi recipe. It's a winner, a lot of work, but worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "b4tehpwn"
},
"reviewBody": "This dough recipe is spot on! I usually fill mine with red cabbage, kielbasa, grain mustard, and mashed potatoes for nice quick, easy meals. Another trick is to use leftover casseroles in them, Sheppard's Pie-rogi are a fave in our home thanks to this dough. They freeze incredibly for a quick boil and fry! I've made HUGE batches and tossed most of them in the freezer and served them later - they're always delicious! I've tried my fair share of pierogi recipes since marrying my husband, who is Polish, and eaten my weight in pierogi at various festivals and these are hands down, my family's favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GinRob"
},
"reviewBody": "My husband normally buys these from the freezer section of the store, but after I took the time through the very simple recipe, he loves them. They have much more flavor than store bought and you can freeze them.I found out, at least in my home, in order to freeze them. I have to lay them separately on a covered flat surface, then after they're frozen, put them in freezer bags. They have been going quickly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie L"
},
"reviewBody": "The dough is the best to work with easy, I did Change out the cheese for brick and I sauted onion and butter for more of a flavor punch. Just like when I was a kid and we got them from the church.\n Also made a sauerkraut filling.\n#1 tip, make your fillings and freeze them in portions size makes it so much easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Made these, but found the dough very spongey and hard to roll thin enough. Would not make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darwin04"
},
"reviewBody": "By far the best dough for perogies I have seen and used. I will use this one again and again , if the dough is too moist just add flour into it as you pat it out. Turn it over often to make sure both sides have a bit of flour on it. I added about 2 Tbl. Of Italian seasoning to the flour ( I make mine). I also used my own filling: Mashed potatoes (4 large), scrambled hamburger (1/4 lb), 1/4 C diced saluted onions, 2 Tbl diced saluted garlic, 1/4 C Sharp cheddar cheese, and salt and pepper to taste. The dough makes about 60 perogies, the filling is enough for two batches. Drop individually into boiling water(I keep the water from the potatoes and just add some more to it to cook the perogies.). They will float to the top when done. Then I allowed them to dry a bit and fried in a mixture of canola oil and unsalted butter. 4 people ate all but about 10 perogies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Sinfield"
},
"reviewBody": "super easy and so delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney0321"
},
"reviewBody": "Best tasting AND easiest recipe yet! Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Klima"
},
"reviewBody": "These were delicious! A new family favorite for sure. I also made some stuffed with saurerkraut. All the other recipes I had did not include sour cream, but wow are these delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Crevier"
},
"reviewBody": "This is a fantastic dough recipe and everything worked out perfectly when following the recipe written. \n\nI find I don't need to cook these with onions and bacon. Just butter in the pan and fry each side until crispy. \n\nFortunately for my husband, I wanted to make pizza-rogies. The dough was still wonderful to work with two days later and it complemented the marble cheese, pepperoni, and homemade tomato sauce that I packed inside each one. I find that it works best if you put in the sauce and cheese, fold it until it's almost in half, then pack in the pepperoni. Seal with egg white if you're nervous, but freezing them before cooking will do just as nicely. \n\nNow instead of requesting that we order pizze, my husband begs for these weekly and has insisted that I make them for him for his birthday dinner. A+ on this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolyn"
},
"reviewBody": "The dough is the best I've ever worked with. I have been making them for over 30 years and this recipe is the best I've ever tried. I did not use the filling recipe but the dough recipe is heavenly. Two teaspoons of salt is way to much, I used half a teaspoon. I also omitted the oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Whitney"
},
"reviewBody": "Really easy to make and very good. Made absolutely no changes to the ingredients. Instead of boiling, we baked them (20 minutes per side at 320). I brushed them with melted butter and salted with garlic salt."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/84706/grandmas-polish-perogies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/84706/grandmas-polish-perogies/",
"name": "Grandma&#39;s Polish Perogies"
}
}
]
}
}
, "about": [
]
}
]