				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grandpa McAndrew&#39;s Irish Soda Bread"
,"datePublished": "2020-06-18T23:07:30.000-04:00"
,"dateModified": "2022-07-14T17:32:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Nancy"
,"url": "https://www.allrecipes.com/cook/246597"
}
]
,"description": "My mom bugged grandpa for this recipe but he told her he didn&#39;t have one. So, when he made the bread one day she captured each ingredient in a bowl and measured it and put it in the bowl he planned to mix it in!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dOkoG8HIqeKmvpzK3F_OYwrG59M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/34900-Grandpa-McAndrews-Irish-Soda-Bread-mfs_001-7ebcb2546ace42d3b170ccac554f2f2b.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grandpa McAndrew&#39;s Irish Soda Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "116"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "255 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "25 mg"
,"fiberContent": "2 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "153 mg"
,"sugarContent": "10 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 cups all-purpose flour",
"0.5 teaspoon baking soda",
"2 tablespoons white sugar",
"0.5 cup raisins",
"1 egg, beaten",
"1 cup buttermilk",
"2 tablespoons margarine, melted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a cast iron skillet."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, mix together the flour, baking soda and sugar. Toss the raisins with the flour mixture until coated. Make a well in the center and add the egg, buttermilk, and melted margarine. Stir until all of the dry ingredients are absorbed. Turn the dough out onto a floured surface and knead for a few quick turns just to even out the dough. Handle the dough as little as possible. Pat into a flat circle, and place into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake the bread for 40 to 45 minutes in the preheated oven, or until the edges are golden."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRF1111"
},
"reviewBody": "We love this bread! The only thing I add is a little bit of salt. Otherwise the recipe is perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LineCooking"
},
"reviewBody": "Put it on the table for a family gathering at Christmas, it was gone before dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dancinglibn"
},
"reviewBody": "Definitely add the half tsp salt!\nI made 4 loaves, using 4 separate batches. 2 were white flour, 2 were wheat. Wheat 1 was a bit dry and bland; white 1 was very yummy and a tiny bit drier than ideal; wheat 2 was yummy, white 2 was good but a bit dry and could have used more flavour (maybe more sugar or more raisins). Clearly, the recipe is generally good, but my baking is a bit uneven! Next time I will add a bit more buttermilk and raisins and see if that comes out consistently better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Myke McDonald"
},
"reviewBody": "This is cake not bread. It has fruit and sugar in it. Soda bread is flour, salt, baking soda and buttermilk (soured milk)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheCocobeLoco"
},
"reviewBody": "Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladydi"
},
"reviewBody": "Really tasty, easy bread. I added 1/2 tsp salt per other reviewers. Also 3/4 tsp caraway seeds. Serving with colcannon. And Guinness stout!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hilaryrn"
},
"reviewBody": "I love how simple this recipe is. And tastes really good. Just up the salt, baking soda, butter, and sugar. So easy and delicious it’s worth the modifications??. I tripled the recipe for a party and added 1t salt (still needed a tad more 1-1/4 would have been better), 2t baking soda from 1-1/2 called for, 1 stick of butter, 1/2c sugar. It made 7-8 small loaves. Turned out great. Just slightly sweet. Lacked a little salt so I sprinkled all the loaves with fine sea salt. Everyone devoured it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Decent enough. Easy recipe but I prefer the Soda Bread Muffin recipe on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mim"
},
"reviewBody": "Will definitely make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Stima"
},
"reviewBody": "No change to recipe! It is perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris459"
},
"reviewBody": "Absolutely loved it. Made 2 loaves for a church dinner when we realized the 2 I bought from the store weren't going to be enough. Everyone said this recipe was better than the store bought ones. Will definitely be making again. I did forget to add some salt, but it still tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Korologos"
},
"reviewBody": "I never made soda bread before. It definitely was easy to make. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Blah taste. I’ll try it with 1/2 tsp next time as other reviewers have suggested. I guess I handled it too much because the texture was off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "I happened to have buttermilk left from another recipe and decided to give this a try. Very easy to make, moist and delicious. My family loved it! No leftovers ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mike"
},
"reviewBody": "Fantastic!! Everyone loved it, will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Mania"
},
"reviewBody": "Made two loaves, one with caraway seeds and one without. Turned out wonderful. I agree that it could use salt and will add some in next time. I find myself adding too much butter to make up for the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peggy Pawlowski"
},
"reviewBody": "Don’t need eggs and you can make buttermilk but using a tbsp of lemon juice and adding milk to make total amount of liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Axelia"
},
"reviewBody": "I'm going to be that most hated person who didn't make the recipe exactly to the directions (because I didn't have eggs or buttermilk; not to be a pain!) BUT I feel it speaks a lot when a recipe can hold up to so many substitutions. In leiu of my missing ingredients, I used some water with vinegar left to sit, and baby food. So far so good. Then, while kneading, I apparently had some unconscious anger, because I ended up kneading the life out of it--oops! So I ran back and added some more baby food and now sour cream, and kneaded much less (it really is supposed to be a wet dough), and voila! Perfect soda bread that I really regretted having to gift the rest to my parents and in-laws. Will definitely try again according to the recipe. Oh, and do add that bit of salt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoachPotato"
},
"reviewBody": "I increased the amount of sugar and raisins, added a pinch of salt and some homemade vanilla extract, and put a little sugar glaze to top it off when cooled. It was all gone in less than 24 hours, so I made a second loaf a couple days later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It came out really dense (just as my last couple attempts at making soda bread). What did I do wrong?\nDid I over- or under -knead?\nThe box of baking soda I used had been open for a while. Could this possibly have an impact? \nPlease help! I love soda bread but keep getting it wrong...\nthanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kutterba"
},
"reviewBody": "It turned out so dry - maybe I did something wrong. Will have to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "While this bread really didn't rise for us, we definitely liked the texture and flavor (we did sub honey for the sugar and added a teensy bit of salt). Be sure to heed the recipe's advice of handling this dough as little as possible for the best texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Wang"
},
"reviewBody": "This is the BEST Irish soda bread recipe. It is simple authentic and delicious! Cooking it in the cast iron skillet gives it just the right crust. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "northern exposure"
},
"reviewBody": "My new go-to recipe for soda bread. I've been looking a long time for the soda bread of my childhood and this is it! I did add 1/4 teaspoon of salt, but don't think it made a difference. I added an additional tablespoon of sugar because we like it just a tad sweeter. Baked on a pizza stone. Love it. The texture is amazing. Be sure to handle the dough minimally and gently."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosyshell"
},
"reviewBody": "I've made this many times and it's delicious. Great both with raisins and without. Easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "The only reason I gave this 4 stars instead of 5 is that I added salt, per everyone's recommendations (plus, I checked some of my cookbooks, and they all called for salt). But this was wonderful...and great for breakfast, toasted with a little honey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Taffys"
},
"reviewBody": "Sorry , but I had high hopes for this. My husband can't understand why I keep trying Irish soda bread with our corned beef and cabbage because he thinks it is not good. Unfortunately, this recipe didn't do the trick either. I found it dry and tasteless. I didn't cook it for more than 35 minuets but it was hard and SO HEAVEY. I'll keep looking for a recipie that we both like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bernadette Dizzine"
},
"reviewBody": "I just noticed this recipe contains no baking powder, as well as no salt. I collect Irish Soda Bread recipes and every one I have adds baking powder as well as baking soda. I made it as written and used butter and ate with more butter and orange marmalade. My husband said \"Good soda bread,\" will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Larry Benish"
},
"reviewBody": "Great bread. Easy and Quick. I dusted the finished loaf with powder sugar and found this a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tea's"
},
"reviewBody": "I'm rating this one high, because it made me a great loaf of tasty soda bread, with NO SALT. Only 2 T. sugar for the entire loaf is a plus, and the bread was still sweet. I liked the level, but may try my next loaf at half the sugar, just to sample it. EASY recipe, great for when you're out of yeast. This density on this makes for good sandwich bread, toast or even french toast bread. (I didn't have raisins on hand- just left them out and had regular bread.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Coralie"
},
"reviewBody": "Tastes pretty good. It didn't rise either time I made it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Friedhoff Hibbs"
},
"reviewBody": "Loved this - baked it in a 8\" cake pan. I added another tablespoon sugar since my husband likes things on the sweet side. Brushed the top with a little melted butter and buttermilk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Ok. I panicked after placing my bread in the oven and scrolling through the \"add salt\" reviews. I had noted them prior to preparing this and completely forgot. I literally sprinkled a minescule pinch over the top. Not sure if it made a difference.... Just pulled it from the oven rubbed it with an 1/8 tbsp. Of butter and tap. Of raw honey. Bravo! I will make this all year round. So easy. So incredibly delicious. I didn't know i like Irish soda bread until today. HAPPY ST. PATRICK'S DAY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loveu68"
},
"reviewBody": "Delicious!!!!!! Made this recipe and LOVED IT!!!! I've had many irish soda breads and this one is the best. I did listen to the viewers and added 1/2 tsp of salt,but I also sifted the flour,baking soda,sugar and salt. So it would be lighter.( I hate it when the bread comes out heavy). I mixed everything in the bowl, didn't even touch my counter. DO Not over mix. Once it came together I put it on a cookie sheet, sprayed with baking spray. Left it out for 5 minutes at room temp. covered with a clean dish cloth. I brushed the top with butter and sprinkled granulated sugar.Half the bread was gone in 5 minutes. I guess I'm going to make another one for St. Patty's Day....lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dspacc"
},
"reviewBody": "Loved this bread. I made a loaf and added salt as others mentioned. The first one came out GREAT\nAnd had to make another. The only thing I will say is be very careful not to over handle the dough or over mix. One loaf came out very \"rubbery\" \nI baked it on a baking stone and cut the top in an x shape. U can't go wrong with this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ELKAYEL"
},
"reviewBody": "I make this every St. Patrick's Day and my family loves it! No changes required; perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosebud056"
},
"reviewBody": "I love this bread! I left out the raisins and added two tablespoons of honey. My kids love it and they don't like anything! Way better than any other recipe I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewlywedCook10"
},
"reviewBody": "This is a wonderful recipe. The only addition I made was to coat the top with butter and buttermilk and cut the customary X in the center.\n\nOtherwise, wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmers"
},
"reviewBody": "Made this for St. Patty's day for both mine and boyfriend's works. After reading prior reviews I also added some salt. Still a little bland, so I think next time I'll add some spices for the heck of it. Other then that, really easy and came out decent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni C"
},
"reviewBody": "I used what I had on hand. Instead of buttermilk I used Chobani Honey Yogurt along with milk to make one cup and added juice of 1/2 lemon to that. I also used 1/2 tsp salt (as someone recommended). The dough was quite dry but working it well help it to adhere. Baked in a small round oven safe dish (sprayed with Pam) cut a large X on top before putting into oven. Brushed with melted butter and milk and baked according to directions. My son commented on how good it was and I thought it was wonderful!! A little bland, but with butter it was great! Would do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Poetgrl"
},
"reviewBody": "Simple and excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Faye"
},
"reviewBody": "I was so looking forward to this recipe because it had raisins. I made no substitutions except to put water on my hands to knead it because it was so dry it would not adhere together. My husband said it needed baking powder also. He made two of the other Irish soda breads and they were fab. I will try this again using some of the suggestions, but I was very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "Well, Grandpa McAndrew must've been one heck of a guy, because this is one heck of a good Irish Soda Bread! I do however think that when \"Mom\" was copying down the recipe she did forget to add the salt...a little bit is all you need. I chose to add 1/2 tsp. I like my soda breads a little sweeter, so I doubled the amount of sugar to 1/4 cup. After I formed the bread I lightly scored it and brushed it with an egg wash. I popped it the oven on a baking sheet lined with parchment paper and baked it at 375 for about 45 minutes. This is a great recipe for traditional Irish soda bread - perfect warm with butter served with a cup of tea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mellskitchen"
},
"reviewBody": "I just made this recipe today and it is not bad, though I do agree with what someone else said about it needing some salt. Plus I found it to be a bit dry. I did make one change and that was I put it in a bread pan instead of a cast iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Smith"
},
"reviewBody": "Made this today with Irish Stew, and the whole family thought it was delicious. Now, I've never had Irish Soda Bread before so I cannot say if it turned out like it was supposed to. :) But, I can say that I made two -- the first one I used entirely all-purpose flour with the raisins, and the second one, I used 2 cups all-purpose, 1/2 cup barley flour, and 1/2 cup fresh ground wheat flour, and no raisins. Eight children and my husband all loved it -- some liked the one with the raisins, and of course, those who don't like raisins liked the other. I did add the 1/2 tsp salt as other reviewers suggested. Lots of smiles at the dinner table and no leftovers tonight - and that's what's important."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marchingjaybird"
},
"reviewBody": "My favorite soda bread recipe that I've tried so far! I think I might add a pinch of salt the next time I bake it, but I followed the recipe exactly and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "newcook"
},
"reviewBody": "It does look really dry when it comes out of the oven but tastes pretty good with butter and jam. It's a bit bland but for the simplicity, I am giving it 4 stars. I added more sugar because I like my breakfast bread a little sweet and next time, I am adding more raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jen c."
},
"reviewBody": "Did not add the raisins - I don't remember soda bread having raisins so I omitted them. Made 3 loaves - one for my office, one for hubby's and one for home. All were gone within 2 days! Really really good for soaking up some Irish Stew!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kate"
},
"reviewBody": "Great, easy recipe. Used dried cranberries instead of raisins. Use an 8 inch or 9 inch cast iron skillet. Brushed with melted butter just out of the oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DC Girly Girl"
},
"reviewBody": "Not a fan. It came out very gooey and bland. I did add the 1/2 tsp of salt and topped with butter as recommended by other reviews. Sorry..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "what a wonderful recipe! next time i will add a little salt, besides that i wouldnt change a thing. thank you grandpa mcandrew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lvmygrls2"
},
"reviewBody": "what a wonderful recipe! next time i will add a little salt, besides that i wouldnt change a thing. thank you grandpa mcandrew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "Very Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mairin gonzales"
},
"reviewBody": "great bread recommend cooking alittle longer than an hr if cooking in loaf pan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Thought this was a great recipe. A few tweeks I did was doubled the sugar, 3/4t.salt, 1/2c. walnuts, 1/2c. Craisins. Even my grandson liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karyn Andrea"
},
"reviewBody": "I followed this recipe almost to the letter (plus the 1/2 t salt recommended by someone and using both currants and raisins) and it was just blah. I'm not sure why people have liked this so much - heavy and tasteless. It's edible with butter and jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "br00kli"
},
"reviewBody": "My first problem was that I seemed to have about a full cup too much flour. Maybe I messed that up somehow, I sometimes amaze myself. I used Craisins instead of raisins, which I liked. I also added salt, as suggested. And instead of using buttermilk, I chose plain greek yogurt, which I'm guessing is why my dough was too dry. I managed to salvage most of the dough, and I really enjoyed what remained. I liked my mediocre version enough to try it once more, with buttermilk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lorelei_sis"
},
"reviewBody": "My husband made this for our weekend get together with friends, left out the rasins in order not to mess with the flavor of the Irish Stew. Everyone enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I used 1 cup of plain yogurt in place of the buttermilk. This recipe is very, very tasty. It's the one I will use all the time now. We go through the whole loaf in one meal every time. Thanks for capturing the ingredients for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I made this for the first time this St. Patrick's Day and it was great. It was easy to make and tasted delicious. The only thing is I needed about 1/2 cup more flour than directed. The dough was much too runny to try to knead, but after adding more flour, it was perfect. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "Neither I nor hubs had ever tried Irish Soda Bread until now, nor have I ever made it. Now that we have, we differ in our opinions. I thought it heavy, with a dense crumb and flat taste, which didn't appeal to me. In addition, I noticed the recipe lacked salt. I meant to add some but forgot, and its absence was noticeable to me. I think it would have definitely heightened the flavor. Certainly no fault of the recipe, but I now know I'm not a huge fan of Irish Soda Bread, although it did make a pretty loaf. On the other hand, hubs said he didn't miss the salt, and loved the different texture of the bread. He also liked the slight tang and sweetness. He said Grandpa McAndrew had a darn fine recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "This was my first attempt to make Irish Soda Bread.... I was making my annual St Patty's Day dinner for my family and was going to pick some up from the grocery bakery.... but I saw this recipe and just had to try it!! I thought well I make my corn bread in the cast iron pot so why not this!! This was absolutely delicious!!!! I had everything but the buttermilk but replaced it with evap milk and the bread just came out fine. Like others have stated I added the raisins and a tad of salt and a little extra sugar. It was perfect. It's also a good recipe I think that u could experiment with. Next time I make this I WILL use the buttermilk and maybe more or different fruits. Yes I also agree it tastes the best with butter on it when warm... but u could always warm it up in your microwave. My husband and son enjoyed this. I will make again and probably for next St Patty's day too. PS it made a nice size loaf which we ate over half of it last night with dinner. I just had another piece this morning with a little butter for a snack. Really delish! Thanx so much for sharing this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chicago girl"
},
"reviewBody": "This recipe is fantastic. I add more fruit than just raisins. I use green raisins, dried blueberries, dried cranberries, dried strawberries, and dried raspberries. (I re-hyrdrate mine in a little water first before combining them with the other ingredients so that they are a little softer and cook more fluidly. Moreover, I combine them with the buttermilk, egg, and butter before combining with the dry ingredients.) I also add a little salt. The other reviews are right that a little salt goes a LONG way in this recipe. Lastly, after the bread has cooked for 40 minutes, I quickly melt butter and baste it on top of the bread and cook it for the last 5 minutes that way. It gives the crust a nice crisp texture and golden glow. It's amazing. The other thing I would point out is that because this bread is so heavy and thick, I find it cooks better between 42 and 48 minutes... sometimes 50 (i've made this in multiple kitchens). Know your oven! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "joy-of-jesus-smileymom"
},
"reviewBody": "Not bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "This is my first experience with Irish soda bread, and thanks to this recipe, it was a very good one! This bread has a very simple, but delicious flavor. Very soft and moist on the inside with a wonderful crunchy crust. I followed the recipe exactly, other than leaving out the raisins since I don't like them, and served with a little butter melted on the bread. Great recipe, will definitely make this again next St. Patrick's Day and probably even once or twice before then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Rochester"
},
"reviewBody": "Wow! This bread is awesome! (As I am eating a piece right now...) I had to use the buttermilk substitute (lemon juice and milk) but other than that I followed directions exactly. This is definitely going to be a regular ,\\menu item in my house. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janine Meeth Tinklenberg"
},
"reviewBody": "This is the most like the recipe I used to have and lost. I've been making it for the past 3 or 4 years and it's delicious! Just make sure you eat it while it is still warm...that's when it's the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellie81"
},
"reviewBody": "Made this to go with dinner tonight. Smelled so good I took a piece. It's great wouldn't change a thing. Thanks for this recipe. Kids just got home from school gave them a piece. They hated the raisens. Oh well. I loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rVaughn"
},
"reviewBody": "This is the first time I have made or had Irish Soda Bread. From what I have heard this recipe is pretty accurate to taste, texture, and ingredients. I really liked it, followed the recipe and not reviewer recommendations but eyeballed the amount of raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "We all loved this bread. It is a great base recipe for those who prefer additional ingredients. We thought this was great just as it is, but I may play with it on occassion for variety as I plan on making this very often. What a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "I thought this was a good, easy receipe. I used the ingredients as stated and it turned out fine. I saw no need for salt as another reviewer suggested. It is supposed to be a flat, solid bread. It tasted great for the type of bread it is and I was looking for a traditional type Irish Soada bread for St. Patrick's day that was easy and this fit the bill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kasiw"
},
"reviewBody": "This recipe was extremely easy, but pretty bland. This was my first time making Irish soda bread, so I don't know what it traditionally tastes like, but I sure wasn't crazy about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Splitter"
},
"reviewBody": "Thanks for sharing this recipe! Dried red currants and golden raisins were reconstituted in hot water for 20-30 minutes, drained well, added to the flour mix, and the flavoured water reserved to adjust the consistency of the dough, as needed. Next loaf will include toasted and finely chopped hazelnuts. Thanks again for the share, Grandad McAndrew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Whiffen"
},
"reviewBody": "This bread turned out great- heavy and dense the way its supposed to be. I added a cup of golden raisins and 1/2 tsp. of salt. If you don't have buttermilk, you can substitute. Use a one cup measure, add 1 tablespoon of lemon juice or winegar, fill with milk and let stand for 5 minutes. I had to have a slice while it was still warm with melting butter. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fuldaman"
},
"reviewBody": "I have used chopped walnuts instead and sometimes with, the raisins (great way to get rid of the old snack packs from kid's lunches)... it always turns out just what I wanted in a heavier soda bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenniferm1"
},
"reviewBody": "I think I might have done something wrong cause it turned out to flat. I'll have to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "violinnm"
},
"reviewBody": "I discovered this recipe years ago and cannot tell you how many times I have baked it for my husband and friends (me, to!). My husband has spent time working in Ireland and finds this to be rather authentic. It is one of our favorite Sunday breakfast foods and for anytime we want a taste of Ireland. Thank you for another wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Havener"
},
"reviewBody": "With the 1/2tsp of salt, this has now become my standard recipe for this bread. It's perfect! Dense, smooth, rich, looks beautiful and rustic, and of course tastes delish. Thanks Grandpa McAndrew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashi Meessir"
},
"reviewBody": "pretty goods, but i rather like the ones that you must leave to rise frist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "testarossa11"
},
"reviewBody": "I didn't have a skillet, or proper pan to cook this in, so I just formed it the best I could and baked it on a cookie sheet. It was tasty enough, but a bit flaky, like a biscuit. Didn't seem to have the dense quality of the usual Irish soda bread. I added some caraway seeds, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank Barnett"
},
"reviewBody": "A couple of others said this did not taste like Irish soda bread. Having never tried Irish soda bread, I can't comment on that, but it was very good. The only changes I made were to put in a few more raisins, 1/2 t. salt and I baked it on a pre-heated pizza stone. I hate to admit it, but my wife and I ate half of it for dinner last night and the rest of it toasted for breakfast this morning. Possibly the best bread I have ever made and so easy, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodwithattitude"
},
"reviewBody": "I added a wee bit of salt and used dried chopped apricots and prunes instead of raisins.\n\nVery yummy. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "VERY good. I loved this recipe. I added more raisins- it was super tasty. If you have leftovers heat the slices up in the microwave for 20-30 seconds; tastes just like it is out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emo"
},
"reviewBody": "Yummy yummy yummy! I made this for St Patrick's day but it was so easy I could pretty much whip it up any time I wanted it. It had a really simple flavor that could go well with many different things, we ate it with butter and jam, it was a huge hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Woods"
},
"reviewBody": "Excellent and easy! I get lots of compliments on this each time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katiemaytoo"
},
"reviewBody": "I didn't know what to expect, but this was good. Sweet and not too dry. I took it to a St. Patrick's Day party and everyone liked it (even those who had had soda breads before)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ev"
},
"reviewBody": "A perfect, fast recipe. I've made it twice and it's been great both times. I usually like to fool around with ingredients but there's no need to with this one. Good stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DANCEOTTER"
},
"reviewBody": "I made this with my students. It was so easy and they all liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SRASWAMP"
},
"reviewBody": "This is a very easy to make, wonderfully moist bread! I topped the bread with a melted butter &amp; powdered sugar frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIZME"
},
"reviewBody": "I used olive oil instead of margarine, and soy milk instead of the buttermilk. I also added salt, and it was pretty good! We ate almost the whole loaf right away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Honeee"
},
"reviewBody": "Sent looking for a simple irish soda bread minus the carroway seads (sp) but with raisens and this one fit the requirements. Used golden raisins just because that is my preferance in baking.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "This recipe was alright, but not much flavor.It had a floury taste, and It could have had more raisins in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mindala"
},
"reviewBody": "The best soda bread ever!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yummy! This one was so incredibly quick and tastes great. I actually didn't have buttermilk so I substituted 1 cup plain yogurt (what the Joy of Cooking suggests as a substitution)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a wonderful recipe and it came out perfectly with the additions from the two prior reviews. However I did something else different....since i cannot eat eggs, I substituted 1 tablespoon of baking powder, 1 tablespoon water, and 1 tablespoon vegetable oil instead of using the one egg....it was WONDERFUL!!!! Thanks guys!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very good look forward to making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Myra"
},
"reviewBody": "This recipe was extremely easy and took very little time. It was too powdery looking, but tasted okay. I made another one using 3tbls of margarine. It looks better but I believe brushing the top with egg white and water would give it a glazed appearance. It is very heavy and slightly sweet. I served mine with whipped cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Please ADD SALT, a little will do you just fine. The first time I made this it was a total flop. One dash of salt could have saved this recipe. Second attempt with 1/2 teaspoon of salt, MUCH BETTER."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/34900/grandpa-mcandrews-irish-soda-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
"name": "Irish Soda Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/34900/grandpa-mcandrews-irish-soda-bread/",
"name": "Grandpa McAndrew&#39;s Irish Soda Bread"
}
}
]
}
}
, "about": [
]
}
]