				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Great Grandma Johns&#39; Pasties"
,"datePublished": "2019-04-03T23:32:00.000-04:00"
,"dateModified": "2022-07-14T16:33:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JJohns"
,"url": "https://www.allrecipes.com/cook/820685"
}
]
,"description": "This recipe originated in Cornwall England, and was adapted by my Great Grandmother Johns. It was originally made for the coal miners and wrapped in butcher paper. The hard pastry shell would keep the juicy contents fresh until the miners were ready to eat. My Grandma would serve with relishes and Coca Cola. If you want to make these more quickly, you can use refrigerated pie crusts instead of the pastry recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PKqQjwKGSnY9U2lKUrvVXjKHzRw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1331162-98c6b2b6b85545e7b3e9faf92ecfd610.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Great Grandma Johns&#39; Pasties"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "42"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "621 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "45 mg"
,"fiberContent": "4 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "186 mg"
,"sugarContent": "2 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"0.25 teaspoon salt",
"0.5 cup shortening",
"0.25 cup cold water",
"0.75 pound boneless beef sirloin, cubed",
"1 medium onion, sliced",
"2 medium potatoes, peeled and thinly sliced",
"1 teaspoon dried parsley",
"salt and ground black pepper to taste",
"0.25 cup water, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, stir together the flour and 1/4 teaspoon of salt. Cut in butter with a fork or pastry blender until the mixture resembles bread crumbs. Stir in cold water with a fork until the mixture is able to come together in a ball. Knead a couple of times then divide pastry into two pieces. Pastry may be refrigerated for later use at this time."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C). On a lightly floured surface, roll out each half of the pastry into a 10-inch circle."
} ,{
"@type": "HowToStep"
,"text": "Place half of the potato slices in a line down the center of each circle, leaving at least 1 inch at each end uncovered. Arrange onion slices over the potatoes, and season with salt, pepper and some of the dried parsley. Place half of the beef cubes over each onion layer, then season again with salt, pepper and dried parsley. Fold the edges over the pastry over the filling, and tuck in the ends."
} ,{
"@type": "HowToStep"
,"text": "Transfer the two pastries to a greased baking sheet, and cut a few slits in the top of each one for ventilation."
} ,{
"@type": "HowToStep"
,"text": "Bake for 45 minutes in the preheated oven. Remove from the oven, and reduce heat to 350 degrees F (175 degrees C). Spoon 1 teaspoon of water into each slit on the tops of the pasties. Return to the oven, and bake for an additional 15 minutes, or until golden brown. Serve whole, or cut into halves."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna M Montana"
},
"reviewBody": "I made this with pork and frozen pie pastry. It is very yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "The filling was really tasty..I used the Pillsbury pie crusts because they are made with lard and I don't care for them with a sweet pie filling. I used some Susie-Q Santa Maria Tri-tip Seasoning instead of salt and pepper.. and I put some butter bits on top of the meat. I used part of a carrot and a stalk of celery and mixed them with the potato cubes..then layered the onion, then the meat on top. Wow..it was nice and moist and so tasty.. My DH said keep this recipe..he really liked it. Thanks for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "The pastie turned out great. I was short time so used a Pillsbury pie crust and also added rutabagas to the mixture. This made two pasties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "denycemoody"
},
"reviewBody": "My great grandma use to make these but I never got the recipe from her. Made these and they are exactly like her old recipe, so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley Woodward"
},
"reviewBody": "I will be making changes to this recipe that is why I'm only giving 3 stars. The flavors were good but the amount of dough was not enough for the inside ingredients. I will try it again doubling the dough. I made for 4 servings which would be plenty of inside ingredients but definitely not enough dough to wrap it all in. I will re-rate after I try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elaine"
},
"reviewBody": "I am giving it 5 stars even though I didn't taste it! My husbands family makes a version of this he loves &amp; since it was his birthday I thought I would give it a try. I don't eat red meat but according to my husband it matched his moms. It was pretty easy and the only changes I made where to make it into one giant pie instead of two little ones and I beat an egg for the top of it just for pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Looks great. I'm making them tonight. Years ago we started freezing gravy in an ice cube tray and added one cube to each large pasty before closing them up and baking them. Although this would not have been good for the original miners who kept them in their pockets until lunch and needed them \"tough\", they are so flavorful with the added gravy! There were stories on the Iron Range in Northern Minnesota of miners from the past who judged the best pasty as one that could withstand a drop from the walkway of the mine to the floor below!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mlizon"
},
"reviewBody": "Just used Pillsbury buttermilk biscuits and turned out great. For filling, I chopped all the veggies quite small, pre-boiled the potatoes and carrots, and added onions and ground beef (pre-cooked the meat as well). Used salt, pepper, garlic powder, and parsley. Was good but pretty mild. Maybe try more spices or a little gravy or something to make it more moist. Quite good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MANORBOOKS"
},
"reviewBody": "This is almost exactly like my Scottish mother makes with one exception. On top of the meat layer she dots the pasties with little butter cubes. Love the look of the pasties made by caustic_soda. They look exactly like my Mom's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erinc"
},
"reviewBody": "What a wonderful recipe! We loved they way that the thin slices of potato melted into the pie crust and the kids didn't even notice they were in there! I sliced the the top sirloin really thin, Philly style. Next time I'll make the crust instead of using a store made one;it ripped a little and spilled out the juices. I think adding peppers and mushrooms might be nice too next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bmg2479"
},
"reviewBody": "Just made this recipe yesterday and did the pastry from scratch as per the recipe. I also added carrots. I would have given this 5 stars if the recipe included gravy. For those of us not eating this dish in a coal mine, I think gravy would have really helped enhance the recipe as the inside was really moist, but the outer crust could use something to dip in. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janine Brooks"
},
"reviewBody": "Too Dry . . . crust was sticky and didn't cover the dish well. Won't be serving again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkimmel507"
},
"reviewBody": "Love this. Being South African I had these growing up made by my Nana then my mother and I now make it for my family. The only thing I add is a huge teaspoon of butter before I fold the pastry over the meat, onion and potato"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "This is a great recipe. I have looked for this for years. My grandparents use to make this for me as a child and i loved them. They also came to Canada for Cornwall. For a special treat they would put my initial on the top with the extra pastry. Thanks you brought back many great memories. I will be making this for my children and grandkids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manny"
},
"reviewBody": "These were awesome. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coletteeee"
},
"reviewBody": "very easy to make, and quick, I added leftover fried rice to mine and it came out delish!."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toddy"
},
"reviewBody": "Simple to make, and very satisfying. I made this as is to see what it tasted like, but I think I may jazz it up in the future with some spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephiehawk"
},
"reviewBody": "I really enjoy making these. Very filling and fun to make. Not everytime, but once in awhile 1 or 2 of them will be so moist that when they are done and I take them off the cooking sheet the filling comes out of the bottom. Still good eating. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ArmyCook"
},
"reviewBody": "I use ground beef in mine, and I tend to make a HUGE batch of these every fall because they freeze so well and are great throughout the colder months. Grew up eating these covered in ketchup and even now that is still my favorite way to eat 'em."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LillyBet"
},
"reviewBody": "Overall, very good. Not keen on the crust though. It's bland and somewhat dry. I read previous reviews and took many suggestions into consideration when putting the pastie together. I used beef tips which were incredibly tender. Made a cheese and onion for myself. Will look for another pastry crust recipe or like others...get the store bought one! I LOVE pasty's from the West Cornwall Pasty Company in the U.K."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Hahn"
},
"reviewBody": "This is what my husband grew up eating. I used what I had leftover roast. Next time, I'll season each layer with salt and pepper. I made it in a 10\" pie plate since I didn't need to carry it anywhere. I figured coal miner's wives wouldn't have made extra work for themselves if it wasn't required. Adding the water in the end seemed to steam the pasty. Great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tlthompson"
},
"reviewBody": "This is a nice simple recipe. For a busy night shortcut, I used the Pillsbury pie crusts, and serve with Heinz jar gravy. You can whip them up pretty quickly and pop them in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Day"
},
"reviewBody": "My husband asked for this for his birthday dinner, and I had never even had these before, much less made them. To be honest I was very scared about this whole recipe, because I didn't cook the meat or potatoes before hand and I thought for sure that they weren't going to be cooked all the way through. I was also very unsure about how it was going to taste, (with only salt, pepper and I used fresh parsley). Not only was this dish surprisingly tasty, but you can bet that I will be making it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeffmegashkim"
},
"reviewBody": "Excellent! I used ham, potatoes and onion because thats all I had on hand. With the ham it needed something, so I added gravy. Going to make it tonight with ground beef and a side of ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Johns"
},
"reviewBody": "I love to make these. I learned from my own Grandma Johns in fact. My grandma's recipe always had rutabaga and carrots as well. I have tried a variation. I like to add thinly sliced sweet potatoes to this, either in place of the white potatoes (because they are more healthy for you) or in addition to the other ingredients. So I gave it try once and they add a really nice flavor to the pasty. Also if you have some Montreal Steak Seasoning, use it in place of plain black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UpNorthCheri"
},
"reviewBody": "Easy to make and very yummy comfort food! I followed other suggestions and added beef broth at the end - a definite plus"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "IM JUST RATING THE DOUGH. I FILLED THESE WITH LEFT OVER POT ROAST. AND HEATED THE VEGGIES AND GRAVY ON THE SIDE. IT WAS VERY GOOD, KINDA LIKE A 'POT PIE' IN POCKET FORM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Looks like a great recipe! I use my great-grandma's recipe who used to make pasties for the miner's in upper Michigan (da U.P., eh!) I am just writing to give a couple of suggestions. To keep the insides moist use lard or butter. Lard is what was traditionally used. You could also try using a 1/2 &amp; 1/2 combination of pork and beef, that is what my recipe calls for. A modern twist to add some great flavor to the pasties (also a secret ingredient of a pasty shop in the U.P.) is onion soup mix. A whole package is a little bit too much unless you are making a huge batch, so go light until you have a feel for how much you like. Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kelsey"
},
"reviewBody": "They were a little dry. Next time I'll make them, I'll tweak the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHELS"
},
"reviewBody": "The true Cornish pastie recipe! However, we do add rutabaga to this, and cut back the amount of shortening. This recipe reminds me of the Cornish pasties we had in Cornwall, wrapped in wax paper and required to be eaten with both hands. A little time consuming, otherwise good for people on a budget and who have the time on their hands to make something like this. Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel C"
},
"reviewBody": "I made this for my father (he's British) for his birthday-- he loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FLYBABYSUE"
},
"reviewBody": "Great!! I hadn't made pasties in over thirty years, and this recipe tastes just as I remember! I used one more potato than the two the recipe calls for, and I dotted the filling with margarine before placing the pie crust over the top. I also cooked them for 10 more minutes than the 1 hour in the recipe, and I laid a piece of foil loosely over the top once the crusts were brown. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGGIE MCGUIRE"
},
"reviewBody": "This recipe reminded me of my grandma's recipe. For extra enhancement, I seared the sirloin pieces, added minced garlic, sliced carrots and frozen peas. Beef bouillon granules mixed in with the water at the last step adds more flavor. Thanks for bringing back some wonderful memories on a North Dakota farm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "They came out wonderful. Great Recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMURTHA"
},
"reviewBody": "This is very good, and similar to my husband's grandmother's recipie. As my family got larger, i had to find shortcuts because time would not allow. If i am short on time, i use the refrigerator pie crusts and frozen hash browns and i always add a little chopped up carrots. My kids devour them w/ground beef so if using that, brown and drain first. Thanks for the tip w/the water at the end, i never used that and it certainly makes them moist and w/gravy inside! Serve w/gravy or (for the younger ones) catsup on the side! Yum! If you make them smaller, bite or two size, they make a great appetizer too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wilemon"
},
"reviewBody": "I thought this was good and different. I added chicken bouillon to the water along with a little garlic powder."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/66326/great-grandma-johns-pasties/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
"name": "Savory Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15328/main-dish/savory-pies/pasties/",
"name": "Pasty Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/66326/great-grandma-johns-pasties/",
"name": "Great Grandma Johns&#39; Pasties"
}
}
]
}
}
, "about": [
]
}
]