				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grilled Buffalo Wings"
,"datePublished": "2019-04-02T02:45:59.000-04:00"
,"dateModified": "2022-07-14T17:23:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MATTD73"
}
]
,"description": "This is a great recipe for grilled chicken wings. They are much better than fried!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zuNFXhgmZkmR_PeMth68O_dBWmA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8485791-a668c77f982d42ef8ca750ae59eb3e6f.jpg",
"height": 1365,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grilled Buffalo Wings"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "285"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "129 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "30 mg"
,"fiberContent": "0 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "882 mg"
,"sugarContent": "5 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 pounds chicken wings, separated at joints, tips discarded",
"1 cup Louisiana-style hot sauce",
"1 (12 fluid ounce) can or bottle cola-flavored carbonated beverage",
"0.25 teaspoon cayenne pepper, or to taste",
"0.25 teaspoon ground black pepper, or to taste",
"1 tablespoon soy sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat a grill to medium heat."
} ,{
"@type": "HowToStep"
,"text": "In a large pot, mix together the hot sauce, cola, cayenne pepper, black pepper and soy sauce. Add the wings to the sauce - frozen is okay. Place the pot to one side of the grill, so the sauce comes to a simmer."
} ,{
"@type": "HowToStep"
,"text": "Use tongs to fish wings out of the sauce, and place them on the grill for 8 to 10 minutes. Then return to the sauce to simmer. Repeat this process for about 50 minutes. The sauce will thicken. When the chicken is tender and pulls easily off of the bone, you have two options. You can dip one last time and serve for sloppy style wings, or serve right off the grill for dryer wings."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason"
},
"reviewBody": "Beautiful recipe. I also add new mexican red Chile. I think the soy sauce is supposed to be teaspoon, not tablespoon, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like the method that is used to cook but the recipe has too much soy sauce and needs butter added to it along with more hot sauce. The wing flavor reminded me more of meatloaf than buffalo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve G"
},
"reviewBody": "A different take on grilling wings. They definitely were spicy. After grilling for 45 minutes I thought they'd lose their kick but no way. I would try this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Peck"
},
"reviewBody": "I have been using this recipe since around 2012. Friends, family, and neighbors all ask for more. I like a little extra spice so I usually add an extra dash (1/2tsp total) of cayenne, some extra hot sauce and a little ACV. The flavor cooks right into the bone. I have even used this method in an air fryer instead of the grill with great success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nate Martin"
},
"reviewBody": "I really just took the method from this recipe. it is awesome. try any sauce you like, any marinade, and you get perfect texture wings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "Wow these packed some spice! My sauce never did thicken, but I still continued dipping while cooking. I did serve the wings covered in the sauce. Followed as written. You'll need some sauce to cool down your tongue!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bobby Bats"
},
"reviewBody": "This recipe requires too much attention. I must have touched each wing 6-7 times moving them from the simmering sauce to the grill. Also, with three pounds of wings, there is not enough sauce to cover the 3lbs worth of wings. I found myself having to create a system to make sure each wing made it into the sauce. The end product was not impressive. Edible, but if you make this... keep your Buffalo Sauce bottle ready to add some salt back into the palette."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geo"
},
"reviewBody": "Came out pretty good. Used a combo of beasts, wings and legs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "Super good. Definitely add some butter to the mix. Nice alternative to fried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dick Strojinc"
},
"reviewBody": "Turned out great. All dinner guests loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmd393"
},
"reviewBody": "Easy recipe that never fails. My boys always eat well when I make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan De Sesso"
},
"reviewBody": "I've been making this recipe all summer since ive found it\nbest wings ive ever had, i will never bbq wings any other way.\nMAKE SURE TO COOK CHICKEN IN THE SAUCE UNTIL IT BECOMES THICK.\nBy the time this is finished. The chicken is falling off the bone. \nEntire family and friends love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveToEat"
},
"reviewBody": "Wow, this came out awesome! What a great way to cook the wings (used drumettes) and keep them moist and flavorful. Very spicy. We loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darryl"
},
"reviewBody": "This has been my go to recipe for years. Each year camping, Super Bowl, and on weekends all year long. I like a final dip in the sauce to make them a little hotter. The key is to not rush the grilling process I like my wings crisp and not chewy. This takes time. Low heat. Longer grilling time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norton"
},
"reviewBody": "Turned out great! My Wife likes when I use Big Red, but I like using Dr. Pepper in the recipe.\nBecause the sauce is constantly simmering, I think the bacteria from the chicken does not survive, therefore removing the risk of getting sick.\nI have made this recipe over 10 times, and it is a huge hit. I usually double the recipe and add extra hot sauce in the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rusty Sykes"
},
"reviewBody": "These are the BEST! I have tried a lot of wings, but this is the best recipe. I also added about a table spoon of honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent Berkeypile"
},
"reviewBody": "Loved it! I used large drumsticks and family devoured them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "Great flavor and they cook easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TylerDerden"
},
"reviewBody": "Everyone loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christie Leonard-Garcia"
},
"reviewBody": "Great spicy wings. My kids love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "waltwins"
},
"reviewBody": "Very good, just be careful at the end not to let the sugar from the soda caramelize/blacken too much. Great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wrenchmonkey"
},
"reviewBody": "I just baste mine as they're grilling and then toss them in the remaining sauce at the end"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Polly Ash"
},
"reviewBody": "I made these this weekend and everyone loved them. I doubled the recipe, used lime d. coke and d. coke. Rubbed the chicken with garlic and will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "Very good, not too spicy just medium hot. Made the recipe just as it is and seemed just right. I used regular soda not diet. I think this is important. I don't think that diet soda would give the sauce the stickiness that makes this recipe so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl W."
},
"reviewBody": "Delicious! I used chicken legs, like in the photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Schumacher"
},
"reviewBody": "Hubby made these last night and they are awesome. Did not have Louisiana hot sauce used red hot and they just fell of the bone and melted in your mouth. This will be how we make our wings from now on, no more deep fried greasy wings. LOVE LOVE LOVE IT!!! Just need to get the hubby to not get sidetracked, ended up burning one side!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Robinson"
},
"reviewBody": "I made these for dinner tonight. I followed this recipe as written except for using more of both peppers. I also used a 4 pound bag of wings that I had extra from an experiment that didn't turn out a couple of months ago where we tried different ways of baking them. I love wings but not all the fat that comes with frying them so baking was tried and not successful at all. I was very excited to find this recipe in my inbox the other day and knew I had to try them with the ones I had since I knew I had all the ingredients except to pick up a can of pop. \n\nI started them with the wings frozen and let them soak while the grill was heating up. My grill isn't big enough for all of the wings and the bowl, so I rotated half the wings at a time on the grill with the other half simmering. The sauce thickened up and reduced down nicely and the wings browned up very nicely (actually some looked like they were burnt but they weren't). \n\nI was a bit skeptical because of the failed baking experience, but I really enjoyed these and will DEFINITELY make them again. I actually enjoyed these more than I should have since I ate a bit too many and am now stuffed!! :) I have some really spicy sauce from the local wing place, and I think this is a good recipe to use it up in since just a little bit will add enough spice without it being too much since I thought the original recipe could use a bit more spice. \n\nAll in all a DEFINITE keeper!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Page"
},
"reviewBody": "I added to this recipe for more kick, and couldn't ruin it. Its really a nice starting point that i wouldn't have thought of. Makes some delicious wings! We both enjoyed them...ALL :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "purplestardust101"
},
"reviewBody": "Just make sure the sauce is thoroughly cooked when you reuse it on ANYTHING!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pharmgirl45"
},
"reviewBody": "I really, really, really, REALLY wish that well meaning cooks would not rate a recipe they have not tried, especially just for the sake of blasting the recipe/ingredients/method because it does not fit their life style. Very irritating. Please get over the need to preach and just move on to a recipe more to your liking.\n\nGREAT wings, by the way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Dyson-Demers"
},
"reviewBody": "This Grilled Buffalo Wings recipe has been a huge hit every time I've made them. The last time I made them I had bought a 12 oz bottle of Frank's Red Hot, so instead of using the cayenne pepper, I used the entire bottle of Red Hot. I also did more than 3 pounds of chicken wings... closer to 5 pounds with this sauce recipe. I served them with homemade Bleu Cheese dressing. My dad said they were better than any restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guitar"
},
"reviewBody": "This recipe is fantastic. Added Dr. Pepper instead of cola and threw in a couple of cloves of garlic for good luck (love garlic) and my daughter (who usually eats nothing) and I finished over 5 lbs of wings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Jones"
},
"reviewBody": "Absolutely the best! Made these for a football party a year ago and they're still talking about it. First time I tried it at home and it was very salty....I deleted soy sauce and I use the Mexican Coke (real sugar) and Frank's Red Hot, and it was a hit! Love 'em!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam Andrew"
},
"reviewBody": "I have made these wings several times. I will make them the day before and put them in the crockpot. Reheating the next day. They tend to be a bit more spicy from sitting overnight but they are so good. I found using the crockpot a great time saver on the day of the party. Wings are already cooked and ready to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcy"
},
"reviewBody": "We love making these wings! They are delicious and you can raise or lower the heat easily with the hot sauce and cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BlondeJJ"
},
"reviewBody": "I loved this. I love that I get the same satisfaction of eating a greasy fried chicken wing but for so much less fat! These were awesome. They were simple to prepare. I used 1/2 buffalo flavored sauce and 1/2 pepper sauce. I also used Dr.Pepper. I could just taste a hint of the soy sauce and I am glad I added it because I think thats what takes it beyond just hot sauce on some chicken. I used 7 chicken thighs and all of the sauce. This was great thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glori Lynn"
},
"reviewBody": "This is the recipe I'm using from now on! We always grill. That's a given. The fact that I didn't have to marinate or rub the wings ahead of time is what made this recipe appealing. That I can do this with STILL FROZEN wings is even better. It's much less of a production when I get a hankering for hot wings. I had two concerns when I read the recipe. My first concern was that I was afraid the cola would take the \"heat\" out of the hot sauce. This was not the case at all. These were plenty hot! Second, I didn't know if I would feel good about using the simmering sauce as a final coat of sauce. But by the time my chicken was crisp and ready, the sauce had boiled for over an hour. There is no chance that any salmonella could survive that amount of heat for that long. Simmering the wings in the sauce adds a ton of depth to the flavor, and color as well. Recipes like this really take the fun out of going out eat for wings, because these are WAY better and less expensive than any restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucky Noodles"
},
"reviewBody": "So good we couldn't stop eating them! Thanks for a keeper wing recipe that will be made many times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sledhead550xp"
},
"reviewBody": "Awesome recipe! You can mix up the ingredients to your own tastes, but this method of cooking the wings is the best by far. Take a little time and enjoy your grill, these wings will blow your mind. Have turned these on to many friends and family members!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoodGrilling"
},
"reviewBody": "Fabulous and fun. I like my wings to have some heat so I added a good helping of Sriracha to the mix. These cook up nice and sticky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bossonbabe"
},
"reviewBody": "5 stars for the method, can't rate the sauce because I used my standard hot sauce recipe: 12 oz Frank's hot sauce, 1/4 lb butter, squirt lemon juice and because I needed more volume, about 4 oz of spicy barbeque sauce. I use 10 full size fresh wings and don't separate the pieces. These wings are like crack! They come out absolutely spectacular using the 10 minutes in the pot - 10 minutes on the grill for an hour method. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jldeee"
},
"reviewBody": "Awesome! I used Franks Red Hot Wing Sauce (because I already had it in the fridge). I also read one review where they said they wished it was thicker so I thickened the sauce using a heaping tablespoon of cornstarch with two tablespoons of water and added that to the bubble sauce and that did the trick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nastrology"
},
"reviewBody": "I modified this with Ginger beer, and tandoori seasoning all i know is that my family went wild for this. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "These wings are great. We always go out for hot wings and have never found a recipe at home that tastes as good. This one is wonderful. The whole family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "5upnorth"
},
"reviewBody": "Little time consuming, but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clellis16"
},
"reviewBody": "I don't keep soda at home, so improvised and used a sweet molasses type BBQ sauce. Just used a little and it gave a nice slight sweetness for us, we're not huge fans of too much sweet. I will try it with cola sometime. Because I changed the ingredients, my rating is based mostly on the cooking technique, which I think kept the wings flavorful and moist! You do have to tend to the chicken so might not be great for a quick weeknight meal. Great for the weekends though, just grab a beer and turn on some good music and they are done before you know it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Getty"
},
"reviewBody": "Awesome Wings. I was skeptical, in that I love them fried. I'd rate these as good or better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim T LeBlanc"
},
"reviewBody": "It is January 8th here in Louisiana and yes I'm using the grill outside because it's nearly 80 degrees! This was my first attempt at ever cooking hot wings and I definitely wanted to do something besides fry. I found this recipe and it is awesome!! I only had Frank's wing sauce on hand since I bought it when I was shopping sometime back. Will definitely use again and thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hoks19"
},
"reviewBody": "Good recipe spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISNSTT"
},
"reviewBody": "Very good wings. Next time I will add more cayenne but thats a personal choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JESSE"
},
"reviewBody": "Very very good. I might add a little bit of honey to the mix next time. The recipe will make mild wings, if you like it hot, add more wing sauce. All in all, the best wings I have ever made on a bbq!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kacy Ross"
},
"reviewBody": "This was awesome! I was a little apprehensive at first, the sauce was really thin, but after simmering for a while it was thick enough to make the wings perfectly saucy when I served them. I also baked mine in the oven rather than on the grill. Defiantly a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghann"
},
"reviewBody": "BEST WINGS EVER!!! I was looking for an easy recipe for wings and came across this...I used Frank's Red Hot Wings Sauce - Buffalo Style and a can of Pepsi and left out everything else. I also used the bagged wings. We coated aluminum foil with olive oil for the grill and used one of those throw-away aluminum pans for the sauce for easy clean-up. The Pepsi made the wings kinda sweet, and I thought they weren't going to be hot enough, but then the hot sauce kicked in perfectly! These WILL be made again...SOON!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "captfatboy"
},
"reviewBody": "they were excellent...yes for you less then proficient grill masters this can be a little challenging because you aren't making soup/ its sauce, a rue if you will..\r\nI used half my grill with the gas on one side when grilling the wings, and the other just put the sauce and wings all in a cast iron skillet with some oak smoldering under it ...and did as the recipe says ...the secret is to keep the sauce bubbling and stirred while the wings are on the grill roasting. dip/ roast, dip/roast,.. and there ya go 2 thumps up form the Captain and yes Ive ate and made alot of wings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran Bozic Bobrovsky"
},
"reviewBody": "Soooo good! They were gone before I knew it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "Made these today, following the recipe to the letter and they came out fantastic! Hubby really liked them so will be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Luke"
},
"reviewBody": "I substituted a stout beer for the cola and it was superb! One of the best wing recipes I've used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandy_taylor"
},
"reviewBody": "My husband and I loved this recipe! We used chicken legs as they are cheaper and you get more- everything was done exactly the same on the recipe except that we used Franks red hot sauce since that is what we had on hand :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen_Atl"
},
"reviewBody": "The first time we made these they didn't even make it in the house! I was inside preparing other dishes and luckily someone brought me one to try! They are great and we have made them a few times and everyone thinks they are the best!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nona"
},
"reviewBody": "Made sauce just as the recipe said except that I used a diet cola. Our grill wouldn't work so I baked the wings in the oven instead - 10 minutes in the oven at 350, 5 minutes in the sauce. Enjoyed immensely. Really cut downon Points Plus value for Weight Watchers, Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Swords Betts"
},
"reviewBody": "I'd give this 4.5 stars if I could. This turned out great. After 2 pieces of chicken, it got a little too sweet for me, but it worked out good, because my husband likes a sweeter sauce. I was impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pwappers"
},
"reviewBody": "Pretty good, although with all the simmering the texture became a little too fall off the bone. The flavor was really good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Lile"
},
"reviewBody": "i loved this! I added Dr. pepper with it. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "I just wasn't terribly impressed with the flavor of the sauce. It has good heat, but that's about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "docjms"
},
"reviewBody": "I followed the recipe exactly and people couldn't get enough of them. In the week following the initial use of the recipe I had to make the wings about 8 different times because of the demand. The flavor of the sauce is great, and is in my opinion, one of the tastiest wing sauces I have ever had. Everyone that ate the wings said they liked the wings more sloppy then they did dry, so that was the popular way to serve them. Will continue to make these wings as long as there is chicken to make it with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shawnamcc"
},
"reviewBody": "Loved it! \nMade it for a midnight snack... the neighbors probably thought I was nuts firing up the grill that late, lol..\n\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susieq68"
},
"reviewBody": "Great recipe and fun to make, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Bonney"
},
"reviewBody": "Rocked!!! Awesome and a big party hit. Thanks. I used weber charcoal grill and had super flava."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Marie McCarthy"
},
"reviewBody": "Very Fun and Easy. Added more of the hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "metalaica"
},
"reviewBody": "Made to recipe and it was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "My daughters wanted to fix something different on the grill and these were pretty good. They didn't have any Coke soda, so they used Pesi. LOL!! We enjoyed these anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ytn"
},
"reviewBody": "good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mark31"
},
"reviewBody": "I used chicken breast rather than wings. Still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "Great recipe! We plan to do a double batch next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "tried it wit Fanks Red Hot, and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greensmark"
},
"reviewBody": "Great recipe in that I could put the wings in the sauce frozen; which I did! Simmered on the stove until the grill was ready! Oh, substituted Dr.Pepper for Cola....I know, it sounds too sweet, but I used the bottled sauce that came in a thick variation. Soy was no issue as it, too cut the sweetness.\nGrilled for 5-7 minutes, then back in the sauce.\n, these were good!,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tcreagh444"
},
"reviewBody": "Very good recipe. I used Dr. Pepper because I like the fruity taste. Also added one diced Chipotle pepper (in Adobo) to ratchet up the heat and a tsp. of garlic powder. Everyone loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "These wings were fabulous...a little time consuming but well worth it!! I only had a diet coke so I used that and they had a salty taste to them, it was not the soy because I forgot that. Will definately be making again and sharing this one. Thanks!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcrisafulli"
},
"reviewBody": "great recipe. i doubled the servings and they came out perfect. i used Franks Red Hot and the heat intensified. will use a little butter to cut the heat. these are a lot of work, but waaaayyy better than deep fried and dipped in sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rdw"
},
"reviewBody": "This is an A+ recipe! I used diet coke and cooked the sauce on medium low on the stove to transfer the wings back and forth from the grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueandBob Butler"
},
"reviewBody": "very very good, i would recommend doubling the sauce, so you have room for error. it is a little time consuming and requires a lot of attention on the grill. the tast was amazing i used franks hot sauce. will make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "John Duquette"
},
"reviewBody": "I used Frank's Red Hot as that is the only hot sauce I will use. I did not marinate then return to sauce as I was worried about contamination. I made two pots, one to cook in then after grilling put in the fresh stuff. Awesome task although a bit hot for me, I would leave out the cayenne pepper. After eating three of us got sick, not sure what that means but I am not trying it again. I am going back to baking, grilling, then smothering in Franks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Outstanding....simply outstanding. What is interesting is the Chicken is excellent without putting the hot sauce on and magnificent after adding the hot sause.+"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MICHELLEK0806"
},
"reviewBody": "This was a very good starter of a recipe to be used on any kind of chicken.. I marinated some split breasts and legs for about an hour in the sauce(minus the soy..)I added Weber cajun seasoning and a couple pats of butter to it. I then baked in the oven till about 3/4 of the way done..foiled lined pan sprayed with cooking spray.. handed over to hubby to put on the grill and while he was doing that I made an additional batch of sauce for him to baste while cooking..this was one of the BEST version of chicken we have had in a while.. all my guests loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Jeff"
},
"reviewBody": "This is an excellent Buffalo wing recipe for the grill. Since I live in Buffalo I know the flavor and consistency of a good wing ;) I used my backyard fire pit, all wood, no charcoal. Couple modifications: instead of Coke, use 1 1/2 tablespoons of molasses. Add 2 tablespoons of lime juice and 1/2 cup more of Louisiana hot sauce. (Never EVER use Tobasco for Buffalo wings.. for shame!!) Texas style hot sauce is good too. No need tpo cook the sauce.. just mix it up and go. Slow cooked them for an hour and a half turning and brushing sauce on them.. enjoy.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mamma mary"
},
"reviewBody": "I love your recipe but I think for safety reasons ,you should put aside the sauce for dipping and eating , You should use sauce that you have set aside to dip the raw chicken and then put on the grill. then the sauce that you have put aside for eating you can use for after the chicken is done for dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zappash"
},
"reviewBody": "This recipe is absolutely amazing! The wings never made it to the table from the grill, people snatched them up so fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Johnson"
},
"reviewBody": "Never had this recipe with cola but willing to try. I usually pre cook the wings for 15 min in my oven then pour some of my hot sauce over them in a bowl, cook them on the grill, then return to the remaining sauce and toss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jason Carter"
},
"reviewBody": "I have been making a similar recipe for years but I use Franks Red Hot sauce. Chicken comes out soo much better. Put the finished wings on a platter to serve family style and garnish with celery and carrot sticks around the edge. Toss some crumbled bleu cheese over the chicken too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hi-desert Kath"
},
"reviewBody": "Good wings! For those who are worried about putting cooked chicken back in the sauce that raw chicken was in, as long as the sauce is kept simmering, it is no different from cooking raw chicken in a sauce for 1 hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "These are excellent wings. We soaked the wings in the mixture for about 30 minutes and then grilled the wings on our Big Green Egg to brown them. The sauce is thin so while wings were cooking I thickened the sauce with corn starch. I cooked the sauce and wings for 20 more minutes in a cast iron bean pot on the Egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheftell"
},
"reviewBody": "OUTSTANDING! these wings were everything we expected. sided with some warm garlic bread, fresh garden tomatoes with basalmic vinegar and garden basil, made an easy Friday night movie experience. YUM,YUM..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Leigh Sheppard"
},
"reviewBody": "A Word of WARNING: Be sure to bring the sauce to a simmer, otherwise it breaks a paramount food-safe rule when working with raw chicken. NEVER return your cooked chicken to the same sauce that has or has had raw chicken in it!\r\n\r\nHaving it simmering on the side of the grill will reduce the risk, but I still prefer to cook the wings until they are crispy and then coat in sauce for the last few minutes.\r\n\r\nI've only given it two stars, because it is some of the variations that others have suggested that make this recipe work. The recipe on its own is not that great.\r\n\r\nI much prefer Franks Red Hot/butter/vinegar/ and a little sugar to taste (coke might work! - I'll have to try that!) Two stars for the suggestion of using coke in the sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BILLADAM"
},
"reviewBody": "Have been using a version of this recipe for 20 plus years. My parents brought it back from a remote village in Alaska. No BBQ Sauce so they used Ketchup, Coke and onion. In addition to BBQ also put sauce and wings or drum sticks into baking dish and bake in oven. Best thing about this recipe is you can add whatever spices you want to the recipe and make it as mild to hot as you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "allenc85"
},
"reviewBody": "Really liked the idea of using coke in wings, but I tweaked the original recipe and love the way I do them now. People are always asking for the sauce, and we've found it goes well on burgers and hotdogs... here's how i changed it:\n\n3 lbs chicken wings\n3 parts Kosher salt, 1 part cracked pepper, 1 part garlic powder (or just Garlic Southern Flavor if you have it) - just enough to sprinkle evenly over the cut wings\n\nSauce:\n12 oz Coke - go ahead and open it, so it'll flatten out a little. you just want the sugar/flavor not the fizz\n1 bottle Trappy's Louisiana hot sauce\n1 cup Frank's Original hot sauce\n0.5 teaspoon Cayenne pepper\n1.5 tsp Cajun Seasoning (like Emerald's or Tony Chachere's)\n.5 tsp black pepper\n1.5 tsp garlic powder\n1 stick of butter \n1 tablespoon Worcestershire\n3 tbs white vinegar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lulu4014"
},
"reviewBody": "i thought these were pretty good! i would like to figure out how to alter the sauce a bit to make it a bit more tangy/sweet and thicker...other than that, great recipe, thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LESLEYCAN"
},
"reviewBody": "These are awesome. Work, yes, but isn't most good food? People are so used to whacking open a cardboard box and throwing frozen processed 'food' into the oven that they forget how to make a real (tasty and healthy) meal. The wings weren't greasy and not too spicy. I liked that I could easily pull off excess chicken skin that I didn't want to eat. I will make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Stotzer"
},
"reviewBody": "Fantastic!!!! I loved this recipe. I'm on the South Beach Diet, so I used a Diet Coke and added about 1/4c Sugar-Free Maple Syrup. It was great!! Next time I'm making it a little bit spicier, and that will probably be sometime this week because I can't wait..\n\n@Jim\nThe recipe doesn't say how long to put the wings in the sauce between grillings, so that may be confusing.. So, I just dipped them and put them back on the grill on about a medium temp. Don't boil the wings. The sauce dries and the chicken cooks, and you get multiple layers of dried sauce. I actually boiled the sauce to thicken it before I even started grilling, which helped as well I think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "I followed the recipe precisly. A huge disappointment! With the ratings, this is obviously a desired receipe for many. However, to me, they tasted boiled and inadequately flavored and spiced. So, I'll stick with the oven or grill."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/68028/grilled-buffalo-wings/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/116/appetizers-and-snacks/spicy/",
"name": "Spicy"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/68028/grilled-buffalo-wings/",
"name": "Grilled Buffalo Wings"
}
}
]
}
}
, "about": [
]
}
]