				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Grits a Ya Ya"
,"datePublished": "2020-05-20T19:04:41.000-04:00"
,"dateModified": "2022-10-21T13:19:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Irene"
,"url": "https://www.allrecipes.com/cook/irene1"
}
]
,"description": "Grits a ya ya brings bacon, spinach, and mushrooms together with jumbo shrimp in a creamy sauce — served over a platter of smoked Gouda cheese grits."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/QPaeGXmAXJeigIFkA3wMDIjUqn4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8139064-7dc876a5820d4928890f58d7fcd9ace0.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Grits a Ya Ya"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "56"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "839 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "322 mg"
,"fiberContent": "1 g"
,"proteinContent": "30 g"
,"saturatedFatContent": "39 g"
,"sodiumContent": "1109 mg"
,"sugarContent": "2 g"
,"fatContent": "71 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3.5 cups chicken stock",
"0.75 cup old fashioned grits",
"0.25 cup heavy cream, plus more as needed",
"1 cup shredded smoked Gouda cheese, or more to taste",
"0.25 cup butter",
"8 slices bacon, chopped",
"1 tablespoon minced shallot",
"1 tablespoon minced garlic",
"1 splash white wine",
"3 tablespoons butter",
"1 pound jumbo shrimp, peeled and deveined",
"2 cups chopped spinach",
"1 cup chopped portobello mushrooms",
"0.25 cup sliced green onions",
"2 cups heavy cream",
"1 dash hot pepper sauce, or to taste",
"salt and ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare the grits: Bring chicken stock to a boil in a saucepan over high heat."
} ,{
"@type": "HowToStep"
,"text": "Slowly pour grits into stock while stirring constantly. Reduce heat to low; simmer until grits are tender and thick, 15 to 20 minutes, stirring occasionally."
} ,{
"@type": "HowToStep"
,"text": "Stir in heavy cream to thin out the grits. Stir in Gouda cheese and butter until melted and smooth."
} ,{
"@type": "HowToStep"
,"text": "While grits are cooking, make the shrimp sauce: Place bacon in a large, deep skillet over medium heat; cook until bacon fat is rendered, about 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in shallot and garlic; cooking and stirring until shallots are tender, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour in white wine and stir in butter, cooking and stirring until butter has melted."
} ,{
"@type": "HowToStep"
,"text": "Drop shrimp in the skillet; cook and stir until they are bright pink on the outside and the meat is no longer transparent in the center, about 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in spinach, mushrooms, and green onions; cook and stir until the spinach wilts, about 2 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Remove shrimp with a slotted spoon."
} ,{
"@type": "HowToStep"
,"text": "Stir in heavy cream to the sauce. Simmer until the cream is reduced by about a third, about 10 minutes. Season with hot sauce, salt, and pepper. Return shrimp to the skillet to heat through."
} ,{
"@type": "HowToStep"
,"text": "Serve shrimp with sauce over the prepared grits."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is so good!!! I have never had gits and cheese and decided to make it for a Mardi Gras party I was going to. There's a lot going on here and I'll know to have everything ready before hand the next time I make it. The only thing different I did was remove the shrimp before I added the spinach, mushrooms and green onion because I didn't want to overcook the shrimp. I added it back in after the cream sauce was reduced and it was perfect. I couldn't find original grits so just cooked the quick variety a very long until it was smooth and creamy. I did add more spinach and mushrooms as suggested by another reviewer and didn't use the entire 2 cups of cream, but almost. Thank you for this..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slfortson"
},
"reviewBody": "Absolutely delicious!! I will definitely be making this again. I followed the recipe with recommendations from the reviewers to only use 1 cup of heavy cream in the sauce instead of 2. I went one step extra and put a crab cake on top of the main dish when I was done. It was a huge hit with my husband. He talked about how delicious it was the rest of the evening. Update: I made it again and it was once again a hit with my husband. The gouda cheese that I chose was extra potent so I don't think my kids liked that flavor as much. I am interested to try it next time with a smoky cheddar to see if they prefer that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Morris"
},
"reviewBody": "This recipe is everything! We just had a huge birthday bash, Mardi Gras themed and I made this along with gumbo and fried okra. I didn’t hear one thing about any of the other foods because this was so amazing! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Jt Taylor"
},
"reviewBody": "Very good! Made it by the directions except I made it for 4 people vs. 6. Like others before, I would cut the heavy cream in half and use water to make the grits. Other than that, this is an outstanding recipe and tastes wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redeyeskilletslayer"
},
"reviewBody": "Fantastic. Made as written. Kids loved it. Keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Back Martin"
},
"reviewBody": "Completely awesome. It is identical to the delicious grits they serve at The Fish House in Pensacola. The chicken stock I used made it a little too salty so I made round 2 without the stock and it is perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Egg Head"
},
"reviewBody": "Great dish. I'll add more salt next time though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farmhouse Food"
},
"reviewBody": "Really wonderful recipe, easy to tweak and substitute. Family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ConkyJoe"
},
"reviewBody": "Excellent shrimp and grits dish. Based on reviews, I used 2 lbs. of wild shrimp rather than 1 lb., cut back the heavy cream to 1-1/4 cups rather than 2 cups, and used about 2X the mushrooms and green onions only because I wanted to use up what I had. Next time, I'll go with another modification suggested by a reviewer to 2X the baby spinach. There was ample cream sauce even after cutting back the heavy cream. Served with \"Perfect Fried Green Tomatoes\" and \"Sour Cream Cornbread\". Great recipe Irene and thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Old Crone"
},
"reviewBody": "I doubled the smoked gouda in the grits. I like to have the gouda be almost bold. I plan to increase the time I reduce the shrimp sauce to 12-15 minutes. The flavor was great but the sauce was runny at 10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This is a great recipe. The only thing I would recommend is to double the sauce which I did. Each person gets more shrimp, about 5 pieces. I served 6 people and had about 2 servings of the sauce left over. Everyone raved about the dinner. Absolutely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maraia Hoffman"
},
"reviewBody": "SUPER rich but very, very good. Would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This is a 10 or 15 star meal. One of the best things I've ever made. I used the 5 minute grits and it came out just fine. I can't say enough good things about this delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TruckTruckGoose"
},
"reviewBody": "Ridiculously good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "herzeleid"
},
"reviewBody": "Grits with cheese has always been one of my favorite meals. This is a new twist. I like the grits cooked with cheese, butter, cream and stock so much that sometimes I simply make my grits that way.\n\nWe've made this complete dish as written a few times now and love it each and every time. I have found that there is always extra sauce so we do one of two things: double the grits or put the leftover sauce on pasta. I prefer this dish with gouda rather than smoked gouda, but that is truly just a personal preference.\n\nOne time I didn't have enough grits and I used some grits and some Cream of Wheat. While I prefer it with grits, it worked surprisingly well with Cream of Wheat.\n\nThis is a very rich dish. It is easy to overeat because it tastes to delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Williams"
},
"reviewBody": "I could not find regular grits anywhere and was forced to use the packets of Instant. Use 6 packets and add a little extra cream if needed. Recipe still comes out GREAT. I also prefer the shrimp chopped instead of whole. Doesn't look as pretty but tastes better because you get some shrimp in every bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda T."
},
"reviewBody": "Amazing! The ONLY thing I changed was adding crushed red pepper flakes instead of hot sauce. Everyone thoroughly enjoyed this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tahoefans"
},
"reviewBody": "Awesome! Will make over and over minus one cup of cream. Family went back for thirds but, many noted you couldn't really find the grits, so to speak, because it was so soupy with cream. I recommend just one cup at the end. You can always add more, if needed. I despised grits until this recipe. Thank you SO much for sharing!!! I can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Grandberry-Segura"
},
"reviewBody": "Love, love, love this recipe. I had never had shrimp and grits before trying this recipe but, now after trying this recipe I'm hooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mixie"
},
"reviewBody": "Oh My Stars this was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharra Way-Bingham"
},
"reviewBody": "Over the top decadent and delicious! Food for the Gods! I didn't change anything but next time I'm adding oysters also :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SheilaM"
},
"reviewBody": "I'm from Pensacola, FL and Chef Jim Shirley did, indeed, come up with this recipe at The Fish House. It's a favorite on their menu and a favorite on our table. If you want the grits a little thicker just cook them a bit longer, and if you want the sauce a little thicker just don't add quite as much heavy cream. WONDERFUL!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1KnightFamily"
},
"reviewBody": "YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Alt"
},
"reviewBody": "It's so amazing. It's comfort food at its best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keri"
},
"reviewBody": "This was yummy! Fairly easy... I didn't have the shallot or the spinach. I also got mixed up halfway thru cooking and I accidently got 5 min grits.. So I put my cheese and 1/4 c cream in the grits... then added my chopped bacon. I then sauted my mushrooms and onions in the skillet. Added them to the grits. I had extra cheese so I added that along with the rest of the cream. I then cooked the shrimp and just added it to the individual bowls. I had a lot of grits left and no shrimp so I plan on freezing the grit mixture into individual grit cakes. I will bread and deep fry them. Then will make this sauce the correct way and serve with my grit cakes......Cant wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Amazing! My husband's favorite meal is Shrimp and Grits, so I made this for his birthday. He said it was the best he's ever had, which means a lot because he always gets it when we're out at various restaurants. It does make a lot of sauce, which was great for an easy dinner tonight. I did thicken the sauce with some corn starch. Next time I will use more spinach and mushrooms because I like veggies and their nutrients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Smith-Glenn"
},
"reviewBody": "I tried it for my husband for Father's day, and we all loved it! I left out the shallot and garlic and accidentally left out the bacon, which I will continue to leave out. We are making it again tonight, and we only need to buy a few ingredients, since we have most already. Can't wait to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "matricia"
},
"reviewBody": "Super delicious meal. Well deserving of ??????????'s"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Carter"
},
"reviewBody": "Really good flavor. Husband enjoyed it and its easy to make. I'll keep it on the books"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tnthodges"
},
"reviewBody": "This was so good! I love shrimp and grits but this was a little different. I do agree with another reviewer that this is very rich. I think the next time I make it I will cut back on the chicken stock for the grits a little. My grits seemed a little too runny for my taste. I had to let them cook longer to thicken them up. And it needs to be noted to use REAL grits, not the quick-cook kind. If you can get some from a mill, even better! I used stone ground yellow grits and, other than being a little thin, they were great with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "expertD"
},
"reviewBody": "This was sooooo good... I followed the recipe exactly and let me tell you this was GREAT..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Staci"
},
"reviewBody": "Best Shrimps and Grits EVER. Made this for our Christmas brunch. It screams \"special\" and that it is! Served 4 adults and 3 children, so we doubled the grits and used chicken stock an milk to cook them. If you aren't from the south and aren't familiar with grits, you need to cook them much, much longer than any directions call for (my directions say 20 minutes, but I cook them for at least an hour and 45 minutes - just add more milk, cream, or chicken stock as needed to keep them going). We aren't big on onions, or shallots, so I only used half of a shallot - could have used the entire thing - it wasn't noiceable. Next time, I'll use more spinach, maybe double. All in all - this dish is amazing. So rich and so tasty. Saved the left over sauce and had the next night over pasta - fantastic again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo22Babes"
},
"reviewBody": "we ate at the Florida Fish House this past summer. this is the recipe almost exactly. a little less cream ; a little less spinach.\nhad some left over shrimp after Christmas. no left overs now\nso good my neighbor who shared this meal was begging for the recipe.\nso good so easy reaLLY REALLY GOOD THANK YOU"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iluv2cook"
},
"reviewBody": "This is an awesome recipe. The original chef of this recipe is Chef Jim Shirley from the Florida Fish House in Pensacola. I've made it many times and it's always the party favorite. Just wanted to give credit to the originator."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MyDogBites"
},
"reviewBody": "Must try! If you have never had gouda grits you are missing out! I tried this recipe Friday night for the first time and it was a huge success. I was only serving three people, but made enough for six so there would be leftovers. Little did I know that it would be such a hit and would all be gone in one sitting.Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hps333"
},
"reviewBody": "This was truly wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yeah! I finally found a recipe that my entire family raved about. I made this as written for the most part, but used Velveeta shredded cheese in the grits. I thought this made the recipe even richer, so next time I will use cheddar or Gouda cheese. This is a very rich dish. This makes alot of sauce, so next time I will use 2lbs of shrimp and more spinach and mushrooms and get 2 meals out of one recipe. I don't think my family would frown over leftovers of this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jr"
},
"reviewBody": "I tried this grits recipe after having a similar dish on vacation in Florida a few weeks ago &amp; it turned out just as good as the one we had then! I only fixed the grits but it was delicious &amp; easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina McQuay"
},
"reviewBody": "WONDERFUL! I made this over the weekend and it was devine. Next time I will make a few changes. I will cook the grits in water instead of the chic stock. Also at the end I will add only 1 cup heavy cream instead of 2. I found that two cups left too much sauce behind. 1 cup will leave you with a thicker gravy. I will definately be making this dish alot. Thanks Irene."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "I would not change a thing on this recipe. It was the best ever. Thank-you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itzme"
},
"reviewBody": "This is amazing! absolutely delicious!- my husband went back for thirds. I will definitley make this again"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220018/grits-a-ya-ya/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/223/side-dish/grains/",
"name": "Grain Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15899/side-dish/grains/grits/",
"name": "Grits"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220018/grits-a-ya-ya/",
"name": "Grits a Ya Ya"
}
}
]
}
}
, "about": [
]
}
]