				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Guinness Corned Beef"
,"datePublished": "2020-03-04T23:57:47.000-05:00"
,"dateModified": "2023-01-24T10:00:18.000-05:00"
,"author": [
{"@type": "Person"
,"name": "SHAMELESS Morrow"
,"url": "https://www.allrecipes.com/cook/252401"
}
]
,"description": "This Guinness corned beef is sweetened with brown sugar and braised in the oven until tender for a melt-in-your-mouth St. Patrick&#39;s Day favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NP2fcut5ZxP6YCbtCHwCRWTC5LM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3428896-d942dcc98b2a43f6bd1bdf5f20df9bdc.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6007448061001",
"description": "Quintessential recipe to know if you love corned beef! \n",
"duration": "PT28S",
"name": "Guinness® Corned Beef",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/75f91f0c-dc00-4b62-9f5f-d7e699fcb441/2e85778d-0f81-4d0c-9d83-2cff7c0dba7f/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:07:03.234-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Guinness Corned Beef"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "1183"
}
,"cookTime": "PT150M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "286 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "61 mg"
,"proteinContent": "17 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1384 mg"
,"sugarContent": "13 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"4 pounds corned beef brisket",
"1 cup brown sugar",
"1 (12 fluid ounce) can or bottle Irish stout beer (e.g. Guinness(r))" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Rinse brisket thoroughly, then pat dry with paper towels and place on a rack in a roasting pan or Dutch oven. Rub brown sugar all over brisket. Pour beer around and gently over brisket to wet sugar."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NP2fcut5ZxP6YCbtCHwCRWTC5LM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3428896-d942dcc98b2a43f6bd1bdf5f20df9bdc.jpg"
}
]
,"text": "Bake, covered, in the preheated oven until tender, about 2 1/2 hours. An instant-read thermometer inserted into the center of brisket should read at least 190 degrees F (88 degrees C). Allow to rest for 5 minutes before slicing."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT175M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Temperature and time are completely irrelevant. Corned beef needs higher temperature and longer slow cooking. Near came out tough and inedible. Had to fix by cooking an extra 2 hours at 350. Not 300. Flavor was not salty enough and too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jane Anderson"
},
"reviewBody": "$20 brisket + $12 4 cans Guiness Stout(cuz I can't buy a single can) = the worst and toughest failure of a recipe. No flavor either! It was like I was chewing a rubber band! $32 in the garbage, there's no salvaging it in hash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwynethcook56"
},
"reviewBody": "Been doing this for 15 years approx. Never fails me. Perfect for my family . Hubby's family is Irish. Hubby gets a great dinner and the rest of a six pack. Win Win"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My favorite way to prepare corned beef on St. Patrick’s Day. I make a delicious Ruben every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MakeItWork"
},
"reviewBody": "I prefer my corned beef tender, not falling apart as it's easier to slice thinly for Ruebens.. This recipe is perfect even though I changed cook time somewhat - ummmm, 2.5 hrs won't really work at a low temp for corned beef. I had exactly a 4 lb brisket (flat cut). I didn't have Guinness so used Sam Adams Boston Lager I had (but will use a stout beer next time.) I mixed the spice packet (yes I like it) with 1/4 C brn sugar and it melted into the meat while rubbing on even though my CB was rinsed and patted dry. I poured the beer around it. I started this at Noon and turned brisket over every hour for 4 hours. At 4 pm I turned oven up to 325 as it didn't appear quite tender enough. Well, 1 hour later (I let meat rest for 20 min.) I had a moist/tender corned beef that sliced easily w/out shredding and the BOMB! I did throw a couple bay leaves and cloves of smashed garlic in at beginning but nothing else. Not sure that changed much. Only recipe I use now for Reuben sandwiches as this is what I cook corned beef for. Best sandwich EVER using this recipe. Thanks! Side note: This is for a baked (or braised) corned beef - not crock pot method. There are plenty of crock pot recipes for corned beef on here so go there. I use this recipe/method as I do NOT want my corned beef submerged in liquid which is also the basis of this. Try the actual method of baking/braising and stop drowning the CB or shoving it in a crock pot. Sorry recipe submitter for those who can't or won't follow your cook method. I get ya and for myself, this really is the best application although a bit much with the brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laveda Morganhorse"
},
"reviewBody": "Not familiar with corned beef so did not know what to expect nor have a basis of comparison. Spouse liked the way the marinade (e.g. beer + brown sugar) made the roast potatoes and carrots taste. I felt the meat tasted a tad dry, but maybe this is the way corned beef texture naturally is?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Rickert Huber"
},
"reviewBody": "My go to recipe for St. Patty's Day only my brisket is 20 lbs. I always wonder how to adjust cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Mangold Longo"
},
"reviewBody": "I have made this every St. Patrick's Day for the past 13 years. I make it in the oven exactly like they say and it's always the best! The last 60-90 minutes I add the cabbage, potatoes and carrots. It's a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KarenAugie"
},
"reviewBody": "I had very high hopes for this recipe but the meat came out very tough. I followed the directions completely, and even cooked it for an hour longer than advised. I used two flat briskets in a roasting pan covered with heavy duty aluminum foil. After 2 1/2 hours I added potatoes, carrots and wedges of cabbage, and onion wedges. Neither of the briskets were even 4lbs. I put the second one back in the covered pan for 1 1/2 hrs but it was still tough when I took it out. I don't understand what happened. There was plenty of liquid as I used 1 1/2 large cans of Guinness. So disappointed. I will either do what others have done, in a crock pot or go back to my old method of boiling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Luchia"
},
"reviewBody": "I've been making corned beef brisket for St. Patrick's Day every year for the last 2 decades and I must say that it just isn't right to me with none of those wonderful spices that makes it unique. I got out the mortar and pestle and made a blend of spices (coriander, clove, peppercorn, allspice, &amp; mustard seed) and mixed it in with the (I used light) brown sugar. At the end of baking time; I reduced my oven to 275 and added 45 minutes. Strained some broth and very slightly thickened it to spoon over the dish. It turned out very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "After reading so many positive reviews, I really wanted to love this...but I didn't. My hubs enjoyed it and said it was good, but he says that about everything I make. I did follow the recipe exactly but when I got to the 2 1/2 hour baking time, the meat was tough. So, I took the veggies out, and put the covered roaster back in the oven, bumped up the temp to 325 and baked it for nearly an hour longer and the meat was still tough. If I use this recipe again, will definitely cut waaaay back on the sugar (this is supposed to be a meat dish, not a dessert) and I will either use a crock pot or just boil it. I like my corned beef to be tender, not chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LightningLH"
},
"reviewBody": "This recipe is SO simple and tastes SO good! Follow the directions stated. No need to change anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sallyc"
},
"reviewBody": "Too sweet and took longer to cook. I would recommend 1/2 the brown sugar and simmer the meat before popping into the oven. Ate for dinner after 3.5 hours but cooking the leftovers longer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NONIEGOULD"
},
"reviewBody": "I made it, Diane’s Colcannon, and Brennan’s Irish Soda Bread last year for Bunco dinner. Now my bunco friends are asking for the recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanette"
},
"reviewBody": "I make this every year. It’s so easy and delicious!! I use an electric roaster though. Perfect every single time. Be prepared for the compliments!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BrewCrew"
},
"reviewBody": "I did not add quite all of the sugar, which I am glad, it may be too much. Also, I put in the seasoning packet that came with the brisket. The last hour I added celery, carrot and cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Palka"
},
"reviewBody": "Incredibly easy and beef tender. I have made several times with different beers and each was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tia"
},
"reviewBody": "Very bitter. Potatoes &amp; cauliflower inedible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Kinney Bower"
},
"reviewBody": "I have made a lot of brisket this recipe is the best I have ever made loved by the whole family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sandee"
},
"reviewBody": "My bf claimed he could really taste the brown sugar and wasn’t a fan because it made the beef really sweet. I didn’t think it was that noticeable. That part aside, I wasn’t amazed with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FVA5150"
},
"reviewBody": "It turned out fine and my wife enjoyed it. I made it in an instant put pressure cooker so it only took about 55 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nif"
},
"reviewBody": "Best corned beef I ever made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dubigail"
},
"reviewBody": "Made it with 2 cans of Guinness and 2 cans water to cover. Turned out great. Will be making it this way from now on. Normally we would just boil it but this had a much better flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy d"
},
"reviewBody": "Absolutely the best corned beef ever!! Full of flavor delicious!!!a real keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "masteele"
},
"reviewBody": "Waaaayyyyyy too sweet! I'm so disappointed. I should have known that when a recipe calls for 1 cup of sugar to 12 oz of liquid it's going to be syrupy sweet. I read the reviews so actually added additional water and stock and it was still over the top sweet. I might be tempted to try this with 1/4c sugar in the future, but honestly why?? Corned beef is amazingly simple to make with the seasoning packet, a can/bottle of Guinness and some water or broth. No sugar necessary!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann 'Jorgenson' Heinzel"
},
"reviewBody": "We make this recipe every year for St. Patrick's Day. PERFECT! My husband raves about it and asks me to give the recipe out every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "john"
},
"reviewBody": "As a retired Navy man and had corn beef for dinner and breakfast once a week for years and many years ago I only knew one way and how grandma made it , so being once a avid beer drinker had to try it, As well as having a large Irish Family and who drink Guinness, I don't as I never liked it, But I digress, I tried this and I didn't find the beer adding anything other than the fact alcohol breaks down the meat , I made plenty of beer batter fish and also never noticed any difference, Rather just drink it with the food ,,In case you didn't know Corn Beef was never Irish, and if you go to Ireland you wont find it any where out side a tourist trap, They made Cabbage with Irish Back Bacon but when they came to NYC in the days of the migration they couldn't find it so joined the Jews in the deli and made it with corn Beef, Oh and having a large Catholic Irish Family and have been to Ireland many times I don't see any self respecting Irishmen wasting good beer on cooking with it,, maybe a dash of Whiskey as My Grandma did ,lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momsita18"
},
"reviewBody": "I’ve made corned beef recipes similar to this in the past with good results and admit I was skeptical about using so few ingredients but my curiosity won me over. I did cut back on the sugar by at least by half. Since I was doing 2 roasts for my crew, I used 2 bottles of Guinness and 2 cups of chicken broth. I planked the pan beneath the roasts with celery ribs, onion quarters, and garlic. I did use the spice pkt that came with the roast. Then I let my oven do it’s magic and... perfection. I like to prepare my roast the day before to chill it overnight which makes slicing so much easier, perfect and uniform! This year I oven roasted my cabbage and added it back into my electric toaster when I heated the roast and carrots. Would definitely do it this way again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Jane Nurmi"
},
"reviewBody": "Made this last year, and this was the best EVER! Fortunately, my local grocery store in Ketchikan AK makes their own. The recipe sounds too simple,it is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "njj"
},
"reviewBody": "Easy, tasty and tender. Included spice packet, and cooked on Low for 3.5 hrs, then High for 2.5 hrs. Will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Debra TTT"
},
"reviewBody": "I only put 1 star because site wouldn’t accept my review without it??\nHubby prefers Guinness to any other beer, &amp; requested I make this. A big overall disappointment. No matter how carefully I pour beer the brown sugar ran off so I put on more brown sugar. Meat didn’t seemed to be getting done at 4 hrs, At 5&amp;1/2 hours added small chopped veggies, 90 mins later veggies barely cooked \nAnother hour later took slightly cooked veggies out and cooked on stove top. So 8 plus hours cooking left Guinness taste mostly in cabbage. Meat never got tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maddie Franklin"
},
"reviewBody": "Loved it! So tender and tasty. My new way to cook Corned \nBeef. Will make again, really soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Stark-Shannon"
},
"reviewBody": "I made this again this St. Patrick’s Day it was fabulous my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia King"
},
"reviewBody": "Will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aw2day"
},
"reviewBody": "I made this recipe exactly as written, except that I used the seasoning packet that came with the corned beef, and roasted it about 4 hours. The pan I used exactly fit the corned beef, so the bottle of Guinness almost completely covered the corned beef. I flipped the meat a few times during baking. We really enjoyed this recipe, but next time I make it, I will use half the amount of brown sugar, or less. It was too sweet for both of us. About 45 minutes before serving, I added chunks of potato, carrots, onion &amp; celery to the pan. Cabbage had to be steamed separately, as there was no room in the pan. Also, I followed another reviewer's advice, and made gravy from the juices/beer in the pan. That was a big hit, too! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lors"
},
"reviewBody": "They were looking for more Excelent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "My husband loved it. Very moist and very easy to make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Williams"
},
"reviewBody": "Delicious! We added keilbasa, cabbage, carrots, and cabbage. It was a huge hit! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenneth Schwartz"
},
"reviewBody": "Very tasty and tender, the meat fell apart and had a wonderful sweet, stout flavor from the brown sugar and Guinness beer. I added about 1 cup of water at the 6 hour mark and another at about 7 hours along with the cabbage, potatoes, carrots, onion, and garlic to keep the meat stewing while it cooked. At 8 hours in a crockpot on Hi it was wonderful. Will be making this dish more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jinkiesgirl"
},
"reviewBody": "I don't care for corned beef, but this recipe changed that for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "I was very worried after reading reviews that the meat wouldn’t be tender. I made it in oven according to recipe. It was delicious. Added carrots at the beginning but didn’t like the tastel. Used 2 cans of draught Guinness. Cooked potatoes separately and added cabbage after I removed the meat. Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sinfyl"
},
"reviewBody": "My family loves it cooked this way. it always comes out great. Melts in your mouth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Amazing, I will make this again, I put it in my roaster with a lid, came out perfect. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Fitzwater"
},
"reviewBody": "I ADORE this recipe and will never make corned beef any other way again. The flavor is supreme and the slow cooking in the beer made the meat incredibly tender. The only slight change I made was that I used about half the brown sugar called for and rubbed it right in to the meat. It is so amazingly delicious I have to say my family is PLEASED."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Hahn-Rhodes"
},
"reviewBody": "Family favorite!! The combo of the Guinness &amp; the brown sugar sets this dish well above the traditional boring recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbrower"
},
"reviewBody": "Amazing !!! I will NEVER EVER boil brisket again. I used my cast iron dutch oven , i rinsed and dryed and trimed the fat, then the only addition was i added quite a bit of fine ground black pepper to the brown sugar, that is the only change, put it in the dutch over poured the bottle of guiness over and around it and put it in the oven at 275 so i could get other things done and let it cook longer , four hours to be exact, it was beyond tender and amazing in flavor this is definitely the way to go with this meat. I think the oven is the way to cook this as a slow cooker tends to change the texture of the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malaya6969"
},
"reviewBody": "Made it as is. Added about I can of guinness + 1/2 can of water with the pickling spices. Made it in Crock pot for 8 hrs, added purple cabbage last two hours. It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Berwick Mason"
},
"reviewBody": "I put mine in the crock pot low and slow all day and added the veggies at the end. I cut back on the brim sugar. I made it once with less than recommended and it still was noticeably sweet so I only used a couple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajmosier"
},
"reviewBody": "This was great! Very flavorful and simple to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Gilbert"
},
"reviewBody": "Delicious and very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big \"M\""
},
"reviewBody": "Really Liked This - just don't squeeze too much juice out of the Sauerkraut....like I did :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gingerspice"
},
"reviewBody": "I agree, this recipe was excellent. I did follow the suggestion to rinse the roast (mine already had the packet of spices blended in) and rub stone ground mustard on before coating the corned beef with brown sugar. I baked a 4 1/2 pound roast in a 13 X 9 pan with one can of beer and it was tender and delicious! I baked it for 4 1/2 hours on 300 degrees. I did cook the vegetables separate because there was not room in the pan for them but next time I am putting the vegetables in with the broth, increase the pan size and add more beer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dsmithad"
},
"reviewBody": "This is the way to do Corned Beef, really easy, and very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Made it just like the recipe said, sadly it came out very tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMD"
},
"reviewBody": "Made it in the crockpot. It was perfect. My family loved this version of corned beef. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Larnaitis Spofford"
},
"reviewBody": "Best I've tasted and ever made!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rondah"
},
"reviewBody": "Roasting pan: Easy and fantastic.\nDutch oven: 3 stars. Didn't like it sitting in the beer as much as steaming in the juices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kris Kesel"
},
"reviewBody": "As written we feel it is about 3 stars. With changes, we fell in love with it. Make sure to use draught NOT stout as stout is bitter. We also only use 1/4 cup brown sugar. Dash of allspice and then we let it simmer. The liquid I pour from the crock after and thicken for a gravy that is simply amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alenal"
},
"reviewBody": "I’ve made this before! It’s so good family loves it but I do it on stovetop"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shatteringhotdog"
},
"reviewBody": "This recipe is amazing. I agree with other reviewers that you absolutely have to cover the beef with the beer. I’ve made this recipe three times now. Two times I did not add the pack of pickling spices and once I did. I honestly preferred it without the pickling spice pack...I felt it made it too salty even after rinsing the corned beef. To each their own though! If you want to add it, go for it! The best thing about this recipe is that it is super easy. Takes but 5 minutes to put together. Then just sit back and relax and drink some of the other Guinness while you wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darby"
},
"reviewBody": "I used a Sam smith oatmeal stout and slowcooked it for about 9 hours in the crock pot. Added a head of red cabbage and carrots and onions a couple hours before it was done. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marvels51"
},
"reviewBody": "Fabulous! I cooked it in my Instant Pot on slow cook. It was so tender and so very flavorful. I froze half of the brisket in the juice and defrosted it just last night. Again, so good! I'll cut back on the brown sugar next time, just to be a good girl. No more boring corned beef and cabbage for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Bodway"
},
"reviewBody": "Outstanding! Doubled the Guinness and it was tender and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Amato"
},
"reviewBody": "Best corned beef ever! I have used this recipe multiple times with minor modifications. I use the slow cooker and more meat with the seasoning packets. The meat is soooo tender and the entire family loves it. Still only use one bottle of beer - it covers all the meat. Added bonus is that the house smells wonderful while the meat cooks!! Thanks for such a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin MK"
},
"reviewBody": "My husband doesn't eat corned beef but tried this and loved it. It took longer than recipe says but worth the wait!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Wilhoite-Norman"
},
"reviewBody": "Way to easy not to love. I made 2 different recipes. Liked this one so much more. Just tastier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Murff"
},
"reviewBody": "Used a local craft beer similar to Guinness (at 16% alch.) Made no difference the alcoholburns off and the sweet grains left added to the flavor. I trimmed the flat of all fat I could get to and it still just melted in the mouth. One hour in the pressure cooker was all it took."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Cortez"
},
"reviewBody": "Yes I did but didn't use. Guinness use. Rouge. Chocolate stout came out great. And will do it again . will try another dark beer like black butte porter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "zenharp"
},
"reviewBody": "I thought it was too sweet.....also, I baked in oven for much longer than suggested, and the meat was tender that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Fond"
},
"reviewBody": "My son absolutely loved this recipe -- and SO easy! I did overcook it a little, but it's a hard recipe to kill. It has a lot of yummy liquid (who would not love beer-soaked brisket?), so it reheats very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Watson"
},
"reviewBody": "No changes and it was PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "J Anna"
},
"reviewBody": "We made two corn beef &amp; cabbage dinners for St. Patrick's Day, the crock pot version was voted the best by 6 out of 6 guests. This one, although they liked the flavor, said the meat was just too tough. My husband is making tuna fish rather than take a corn beef sandwich, because of the toughness. I will try this recipe again, but in crock pot. I did not change recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie"
},
"reviewBody": "Made for get together with friends, some said it was the best corned beef they ever had. I did use the packet of seasoning with the brown sugar, and cooked in crockpot. To cover meat had to use 2 bottles of Guinness and added bit of water. Only bad thing is that it was so good there were no leftovers..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntrah"
},
"reviewBody": "I make my own corned venison and used this recipe for St. Patrick's day and it got rave reviews. I had done 2 roasts and needed more. I used the brown sugar as indicated, but had to use 2 bottles of Guinness to be sure to cover the roasts. But the ratio was still good. Gave the corned venison a nice rich flavor. Would do this again in a heartbeat. May do this more often than just water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRUPSCAFE"
},
"reviewBody": "I did the 9-hour slow cooker method. Half way through I dipped out a lot of the juice, boiled it down some, froze it to separate and remove the grease, then simmered it until thick. \nIt made an amazing glaze over the meat and added so much more flavor than the meat had on its own!!\nThis will probably always be my base recipe for Corned Beef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camille"
},
"reviewBody": "AWESOME!!! This will be my forever go to recipe for corned beef. I made just as the recipe said, except to bring the liquid level up to meet the top of the meat and fat layer, I added a little water, a carrot and a piece of onion. Just perfect flavor of sweet and stout and corned. Served the cooking liquid with the meal. What a hit. Had to make another brisket the next day for sandwiches!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristopher Baignosche"
},
"reviewBody": "Amazing! \nA few differences, I had 20lbs to cook, kept it in the oven over night (9 hours). The brown sugar was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Great flavor and very simple to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marti Dahlin"
},
"reviewBody": "So crock-pot easy and delicious. Meat was fork tender, which I removed and added the cabbage. Supper was wonderful and guests raved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "diane lopez"
},
"reviewBody": "Nobody liked it was too strong and very very tough just wasn't for us I prefer my corned beef tender and juicy which made the original a while"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BGrant"
},
"reviewBody": "Slow roasting was a great alternative to all-day crock-pot. I had a larger roast and used 2 bottles of Stout beer. The meat had a nice \"crust\" - not dry but gave it a much more appealing look and firmness that essentially \"boiling it all day\" did not provide. I cooked the cabbage and other veggies, with spice mix and other spices per the All-Recipies \"Easy Corned Beef\" recipe. I used beer and would try it next time with water as the look of stout-brown cabbage wasn't so great. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "HORRIBLE!! I had another couple for for St. Patrick's Day and I had to call them this morning to apologize for such a horrible meal. I think the main issue is the timing is way off. The meat was under cooked &amp; tough and the vegetables were not even the consistency of par-boiled. This should cook in the oven way more than 2 1/2 hours and vegetables need more than an hour to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia Clagett"
},
"reviewBody": "I put the carrots on the bottom of the cutch oven, cabbage the last hr tasted really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Caron"
},
"reviewBody": "AWESOME!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KerriO"
},
"reviewBody": "I had never made corned beef before, I found this recipe and followed it to the letter. The corned beef turned out wonderful. The whole family loved it, even my picky eater. I don't use any other recipe now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soshana"
},
"reviewBody": "This is our favorite corned beef recipe. I've made this for years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RUGRAT"
},
"reviewBody": "Can't even express how amazing this was. The flavor was off the hook and the tenderness was unbelievable. Thank you so much for this recipe I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Cogswell"
},
"reviewBody": "I used 4 lb flat cut, and at my butcher, the corn beef was pre-seasoned. I put it in a crock pot, and poured two bottles of Guiness Stout over the top, after rubbing the brown sugar all over. I made sure all the meat was submerged. I set a timer for every hour and then would flip the slab. After 6 hours of this, I added an onion (cut in quarters), 6 new potatoes (halved) and 6 sliced carrots. After 3 more hours, I turned off the crock pot and went to bed. I turned it on for 3 more hours in the morning, and when the meat slid off the fork when I tried to flip it, I called it done. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "The WHOLE house loves this recipe. It may be 3 adults but all of us agreeing on a recipe is rare. It's easy as well. I'm possibly making it for Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Hutson"
},
"reviewBody": "I've made this recipe for years!! I've used different beers as well, but Guinness is always the best. Made sure to use the packet and cut off the fat...it really does make it wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caronk"
},
"reviewBody": "A family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Sullivan"
},
"reviewBody": "best corned beef ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kwarreng"
},
"reviewBody": "My favorite way to cook corned beef now! So much nicer than the crock pot!!! What's best about this method is you get slices, as opposed to shredded..... I have made this several times and forgot the sugar once, no biggy... Have also cooked longer than the called for timing to get the tenderness I was looking for. This one is easy peasy outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "03-17-16 ~ My favorite meal of the year is St. Patrick's Day meal. This recipe didn't disappoint! I was afraid the brown sugar/beer mixture would make the meat to sweet - it didn't. It was delicious. Served this with 'Easy Irish Colcannon' and 'Basic Irish Soda Bread' both from AR."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne DeSando"
},
"reviewBody": "Turned out perfect! I tenderized the brisket by piercing it several times on both side with a fork, placed it fat side up in the roasting pan. rubbed the season packet on top, and let it marinade in the beer overnight. Followed the cooking instructions and after 4 hours I removed the fat and drained and reserved the drippings to use in boiling the potatoes and carrots. I then placed the brisket under the broiler, center rack, for 5-10 minutes per side to caramelize. It was tender and juicy! Everyone had seconds and wanted more and it was gone so fast I didn't even have time to take a picture! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucia D"
},
"reviewBody": "Simple and the BEST!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron the Cook"
},
"reviewBody": "I used 2 bottles of Miller Lite, &amp; no water. Guiness is to strong of a taste for my family. I cooked this exactly as the recipe says for 2 hours. Then I removed the rack,&amp; turned the Beef over. Cooked for 1 more hour at 300 degrees. Added Carrots,&amp; Potatoes,&amp; cooked for 1 Hour at 350 degrees.Removed Beef &amp; kept in 13- by- 9 pan covered in foil on bottom of oven to keep hot.Added Cabbage to pot,&amp; cooked for 45 minutes. I never got such rave reviews from my family. The best Corned Beef they ever had. I am not a big fan of Corned Beef , but I made a sandwich of some of the leftovers an hour later. It is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mhayley1"
},
"reviewBody": "Followed this recipe exactly. My meat was as tough as leather. Cooked it an additional hour and still tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "I made this in the crock pot totally covered with Guinness. Cooked it 7 hours on low. I cooked 2 roasts together at a total of 5.5 lbs. One piece was great but the other was tough. 't know what happened. I rotated the pieces for even cooking. Disappointing"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46530/guinness-corned-beef/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
"name": "UK and Ireland"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
"name": "Irish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46530/guinness-corned-beef/",
"name": "Guinness Corned Beef"
}
}
]
}
}
, "about": [
]
}
]