				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Hamburger Steaks with Creamy Mushroom Gravy"
,"datePublished": "2019-04-02T02:46:54.000-04:00"
,"dateModified": "2023-02-20T11:31:17.000-05:00"
,"author": [
{"@type": "Person"
,"name": "RHONDA35"
,"url": "https://www.allrecipes.com/cook/1039655"
}
]
,"description": "This recipe for hamburger steaks in the oven is a comforting, inexpensive meal that bakes ground beef patties with a rich and creamy mushroom sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cSb1GcUFqqu_5Rlbqz7gtCp9WZw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/232653-47087d20661a4188b6cb5968dfd41ede.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Hamburger Steaks with Creamy Mushroom Gravy"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "181"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "639 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "147 mg"
,"fiberContent": "0 g"
,"proteinContent": "31 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "971 mg"
,"fatContent": "52 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 pounds ground beef",
"25 saltine crackers, crushed",
"1 cup milk",
"0.5 teaspoon black pepper",
"0.5 teaspoon salt",
"0.5 teaspoon garlic powder",
"0.5 teaspoon Italian seasoning",
"3 (10.5 ounce) cans condensed cream of mushroom soup",
"1 (8 ounce) can mushrooms, drained" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix ground beef, crackers, milk, pepper, salt, garlic powder, and Italian seasoning together in a large bowl until well combined. Form into eight large patties and place into a 9x13 inch baking dish. Pour condensed soup evenly over patties, then sprinkle canned mushrooms over top. Cover the pan with a lid or aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until patties are no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a huge hit at my house! I had to make a couple of adjustments to fit the needs of the family but it was amazing! Even my son, who doesn't generally eat dinner, loved it. Thanks for the awesome recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "I make this all the time. Just as the recipe says. I do only use 1pd of hamburger so I cut the milk in 1/2. But it is the best tasting meal ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trey Corley"
},
"reviewBody": "Simple &amp; easy recipe. Quick to throw together, but still brings makes a great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keriana Correll"
},
"reviewBody": "I added egg to the mix to keep the meat together better but I've also made it without. It was delicious either way and pairs deliciously with a leafy salad and sweet corn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Weishuhn"
},
"reviewBody": "The recipe was good, I just scaled down the recipe to use 1 pound of hamburger. No complaints from the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BigA"
},
"reviewBody": "I made it per the recipe except I used 2 1/4 pounds of hamburger and 2 cans of soup. The recipe is good and easy. I do feel I held to the recipe. Therefore, I can say it drives me crazy when people completely change a recipe and then give the basic recipe five stars. They should write another recipe and post it. I do like the comments as they create ideas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Ann Gulley"
},
"reviewBody": "I loved it. We had locally raised beef. OH YES!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALEXSMOM2"
},
"reviewBody": "Thank you for sharing this recipe! My husband loves it and has requested I keep the recipe! I made as directed except for the milk; with just two of us in the house I don’t check the date as often as I should. In place of the milk, I used one egg. I added French’s Fried Onions to the top while baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Marie"
},
"reviewBody": "very good and easy to make. the meat is super tender, might tweak it next time so the mushroom flavor isn't so strong and the gravy isn't as thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann 'Jorgenson' Heinzel"
},
"reviewBody": "I did saute some onions and garlic and then added Cream of Mushroom soup to that. Without that addition, I feel it owuld have been a bit bland. Everything else in the recipe was PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannon smith"
},
"reviewBody": "soooo yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer McDonald"
},
"reviewBody": "Cheap, Very Good and Very Easy !! \nI cut the recipe in half ..as per other comments Baked at 400* 10 minutes each side of patties then drain off grease..\nand to the 1 can of mushroom soup I added ..2 beef bullion cubes and 1 TB Worcestershire Sauce ..Poured gravy over meat and lowered temp to 350* and baked 30 minutes .. \nYUMMY !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krystal"
},
"reviewBody": "Very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whit"
},
"reviewBody": "I followed the recipe but instead of using milk I used 2 eggs and I also added onion powder. I cooked it in the oven for 20 mins then I added cream of mushroom soup on top. We are not mushroom eaters so I didn't add mushrooms but all in all.....it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Flynn"
},
"reviewBody": "Made these a couple of nights ago. It's comfort food straight out of the Midwest. Rather than using mushroom soup, I used the meat drippings to make gravy. There really wasn't much fat left from the lean meat, and people liked it. The recipe is reminiscent of something my German mother used to make, although, it seems to me she incorporated mustard into the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodgirl89"
},
"reviewBody": "This is a go to dinner in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "torybeth"
},
"reviewBody": "This is a good recipe! Like others said, I put the patties in the oven at 450 for 10 mins a side and drained the fat. Meanwhile I sautéed onions and garlic, the put the soup in and added a little gravy I made. Put it over the top of the patties and cooked for an additional 25 mins. So good. I did forget to cover but they still came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Did not care for this recipe. Browned hamburgers in pan as others recommended to drain off excess grease. However, dish still remained greasy and mushroom soup did not mix well with the grease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motomoto"
},
"reviewBody": "didnt have the ranch seasoning so i used onion dip mix i had on hand. tasted great. i did take some of the advice of other reviewers and browned the patties first and drained of grease first. very delish, we ate with rice yum. you have to kind of stir the soup and patties at the end to make the gravy. very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Musick (Granny)"
},
"reviewBody": "I will definitely make this again! Delicious! I made a few changes: First of all, I adjusted and cut the recipe down to 2# of beef and it made six nice sized patties. I added one egg to the beef mixture (it happened to be a huge double yoke). After I formed my patties, I dredged them in flour and browned them in my sacred iron skillet. Instead of mushrooms, I covered with grilled onions before adding the gravy. \nFor my gravy I mixed 1 (18 oz) jar of Heinz homestyle savory beef gravy with 1.5 cans of cream of mushroom soup. (It made a nice batch -- enough for mashed potatoes).\n\nServed with mashed potatoes, english peas, corn and Texas toast. (I added a photo). Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Talle"
},
"reviewBody": "I thought this was very good but next time ill make sure to use lean burger 93/7 was a little greasy with 85/15"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vsmiles"
},
"reviewBody": "Not bad at all. We used ground turkey instead (cheaper), reduced fat ritz crackers (what we had in cupboard) and followed rest of recipe as it states. To speed up the cooking I put the oven at 400 for 20 minutes. Yes, the gravy mixture seemed to come out greasy, but, it's called the \"Poor Man's Hamburger steak\" and not the \"healthy man's steak\" (would be costly and more work involved). Anyways, my husband and children loved it. Super quick and easy, no mess in kitchen, and you can portion the hamburgers for a \"healthier\" portion size. I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessconway"
},
"reviewBody": "Easy to make and delicious. I added onions to the top of mine before cooking. Served with smashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marquel Bowler"
},
"reviewBody": "This recipe was good, not great. The meat needed something more. I'm not quite sure what, but needed a little more taste. That being said this recipe is extremely easy and perfect for large dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monatankgirl"
},
"reviewBody": "I wish I had read the reviews first because mine was swimming in grease (although unhealthy, mighty tasty). I think in the future I will cook the patties for a bit and then pour off the grease then put cream of mushroom and mushrooms on and cook it the rest of the way. However, I gave it five stars because myself and my kids gobbled every bite on our plates until we were full as ticks. My two year old kept asking for more and you know how picky a two year old can be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alisha Bennett"
},
"reviewBody": "These were delicious! I used a combo of ground beef and turkey and seasoned with Nature's Season Salt. I added a few extra crackers and baked the patties without the soup topping for 10-15 mins which helped get out some of the grease. Drained and then topped with sauteed onions and garlic and soup. Baked 45 mins, flipped and then baked 15 mins more. YUM YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Miller Ellwood"
},
"reviewBody": "Looking for something different and easy? This is it. Some people said it was a bit greasy, maybe you should try a leaner meat. My beef is home grown and lean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wenjem"
},
"reviewBody": "We love these! An easy and inexpensive meal that is good with mashed potatoes or egg noodles. I did add some garlic, and Worcestershire sauce and used fresh mushrooms. I also used panco because I did not have an crackers. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Jones"
},
"reviewBody": "It turned out GREAT!! I will definitely do this again. I didn't use the cherry but added red onion. Way to go chef, we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaidyn"
},
"reviewBody": "This is very good I also kind of do this with pork chops and it's a hit with my family have it quite often...but what I do is brown the meat In a large skillet with the seasonings and then make a homemade gravy in the skillet by using flour with the drippings to brown then add in soup n also a brown or mushroom gravy packet then put it all in a dish and let it bake in the oven till super tender and the gravy browns more and it's delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niki D."
},
"reviewBody": "Husband, tween, toddler and mom approved! I don't usually rate recipes that I didn't make exactly according to the recipe, but I think this recipe would be excellent no matter how you make the patties! I just used some Lipton Onion soup mix I had on hand (I've made a jar of it homemade) instead of the written ingredients because I didn't have them. I did bake the patties before adding the soup to remove some grease, though I used ground round and there wasn't much. It could have been mixed in with the soup. Since I only was cooking for 2 adults and 2 kids I cut the recipe way back and only used one can of soup. Two would have been better. To compensate for less gravy, I took the patties out and added a little milk to the remaining soup to thin it out and extend the gravy. Not that often that my entire family ohhhh's and ahhhhh's over dinner. This simple recipe was a hit and will be in our regular rotation now! Thanks RHONDA35!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allyson "
},
"reviewBody": "My family of meat eaters did not enjoy. They stated it was very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy from WA"
},
"reviewBody": "I scaled it down a bit. I used 2 lbs. of 90/10 ground beef, 17 saltines, 1/3 cup of milk, 1 XL egg, 2 cans of soup, 1 teaspoon of Montreal seasoning in the meat and another in the soup. I omitted the salt and pepper due to the saltines, soup, and Montreal seasoning containing large amount of salt. The garlic powder &amp; Italian seasoning stayed the same amount. I left out the mushrooms. I seared the patties both sides first and put them side. I didn't have any fat in the pan so I took the soup and seasoning and heated to a boil, scraping up the hamburger bits. Poured the soup on the patties then covered dish with foil and baked in a preheated oven at 425 for about 20-25 minutes. This was really delicious. My family raved about it. Next time, I'm going to use low sodium soup and crackers since it was still a bit salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "awesomesauce"
},
"reviewBody": "Super easy and you can make substitutions. We have a large family with kids of all ages and they were ALL wanting more (age 3 to 15). Weird how such an inexpensive dish can pack so much flavor. Def a do-again dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pumpkinholly"
},
"reviewBody": "I made this with fresh mushrooms rather than canned and added onions. I used the golden mushroom soup instead of the cream of mushroom.This was a good dish. I served it with baked\n potatoes and steamed veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy M."
},
"reviewBody": "I grew up with a recipe similar to this. My Mom just crumbled and cooked the hamberger, then mixed it into the soup mixture. We called it Hamburger Gravy over Mashed Potatoes. You can use as little or as much hamburger as you want. Simple, cheap and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Edwards"
},
"reviewBody": "Simple and good. Good low-carb if you use one egg in place of milk. ( also did not serve with noodles or rice.) Used French onion soup mix for burger seasoning. Followed advice from others and browned burger in 425 degree oven for 10 minuted per side to start. Sautéed onion and garlic in butter to start,, then added gravy sauce ingredients. Need to cook dish at 350 for only 30 minutes. Author prefers burger to be well done. Not necessary. Will make again as a easy comfort food dinner. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Travis-Weden"
},
"reviewBody": "This is a 5-star recipe AS LONG AS YOU PRE-COOK the hamburgers, then DRAIN AND WIPE the pan clean of grease .... THEN oven bake them. The taste &amp; flavor of these ingredients is awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hollinhead77"
},
"reviewBody": "After reading many many helpful feedback entries I too cooked the patties for 10mins each side in a 425 oven, drained off the grease and then returned to dish. I sautéed onion, garlic and added a knorr beef stock cup to pan. After the stock melted I added the cans of cream of mushroom and allowed to simmer until the meat was done on the 20 mins of first step. After draining and wiping out dish I spooned gravy mixture on bottom replaced patties and covered with rest of gravy. Covered with foil and cooked for an hour more at 350. I also was heavy handed with the garlic powder and added onion powder. Simple and scrumptious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinalanderson"
},
"reviewBody": "These were amazing! Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo22Babes"
},
"reviewBody": "Great start for a meal to suit us all. Took lots of ideas from comments from others. Scaled the recipe for 4 - I had only 1-1/2 pounds of HB. Added a packed of AuJus gravy mix, subbed 3 cloves minced garlic for garlic powder. Sweated one yellow, sweet onion with minced garlic. Then added 1 can cream of mushroom soup, 1 soup can water, l soup can water, 1 t Worchester Sauce. Lots of black pepper as we like that. Served with elbow mac and steamed green beans. \nTHE ENTIRE family loved every bite and wanted more!!! SO Easy, SO quick, and so satisfying. Thanks, Rhonda35 for a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alecia2833"
},
"reviewBody": "Very very good! Made this tonight and my husband loved it!! Browned the meat in a pan first and then the oven. \nSeved over white rice. Yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaneen Arias"
},
"reviewBody": "Pretty good, although I don't like mushrooms so I used a can of cream of onion soup instead. I scaled down the recipe to 2 servings which made 4 patties. I cooked on the stove top browning the patties with sliced onion and minced garlic for added flavor. Once patties were browned on both sides I drained fat, added soup, a bit of beef broth, and beef bouillon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Cantrell"
},
"reviewBody": "This was so yummy! I have never had hamburger steak's before. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIANAMAY613"
},
"reviewBody": "Delicious and easy. Altered ingredients for 1 lb ground beef to make 4 patties, and 1 can Cream of Mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "Great recipe! I didn't add the mushrooms, but it tastes good anyways.. Crackers surprisingly worked very well, I'm used to using bread crumbs, and was afraid that it wouldn't work very well but it worked perfectly. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shenan H"
},
"reviewBody": "My Family loved these!! Will be making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MakeItWork"
},
"reviewBody": "I did not care for this recipe. Seeing how A/R came and edited my review, I guess you can't be specific as to WHY you did not care for a recipe. I'll say it again. Recipe as written, turned out greasy and unappealing. Better read the reviews that changed this one around before trying, that's all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessb"
},
"reviewBody": "It really was good! My kids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bawana211"
},
"reviewBody": "this is very good but i suggest you use a high grade of meat so there isn't a lot of grease in the soup. And you don't cook the meat first you follow directions exactly as they are written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna W."
},
"reviewBody": "I used what I had on hand, 1 can cream of mushroom and 2 cans beefy mushroom soup, 24 wheat crackers and left over fresh mushrooms and onions from steaks we grilled yesterday. I browned the patties first, but I do not feel it was necessary to add to the flavor, but it did get rid of some of the grease and there was still a great deal of grease after baking for 50 min....I used 80/20 beef and an oil separator along with white paper towels to remove the excess grease. The flavor was awesome and I will make it again. It is in the \"Clean Plate Club\" per hubby's empty dish...I think if I put the patties in the baking dish and cook for about 30 min..without the soups and then drain and add the other ingredients that may help with the grease problem..Also may use a can of tomatoes drained or stewed and see how that is...I will cut the milk to a half cup to firm the patties up some..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bexx"
},
"reviewBody": "I loved this dish! For the most part I followed the recipe, but like some other users I dredged the patties in a flour/saltine mix and then browned in a skillet before baking. Served the mushroom gravy on the side rather than baked with the patties, and garnished with fresh chives from the garden. I'll definitely be making this again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I used crushed Ritz crackers in place of the saltines because that was what I had on hand, used fat free evaporated milk instead of regular milk, used two cans of cream of mushroom soup (I wanted a thicker gravy) and I used fresh baby bella mushrooms. I cooked the mushroom \"steaks\" in the skillet, moved the steaks to a baking pan, then left the drippings in the skillet and sauteed the mushrooms with chopped onions with a little butter before adding the soup and milk. I just made sure to scrape the meat drippings off the bottom of the pan to capture all that good flavor. I did add a little worchestershire sauce to the \"gravy\". This was a quick and comforting dinner that was quite budget friendly (nevermind it used up a little of this and a little of that from my pantry before our big move) and fed all four of us very well, with a side of mashed potatoes and roasted broccoli. NO leftovers. My littlest especially loved this which was especially nice because.....that kid dosen't seem to eat much lately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Sasnett Holleman"
},
"reviewBody": "I followed the recipe \"almost\" to the letter. I did add a bit of steak sauce and worstershire. It came out great! My husband LOVED it and said it was the best he had ever eaten. Needless to say he took a plate to work the next day and he normally doesn't do leftovers! I served it with creamed potatoes, cabbage, brocolli casserole and rolls. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soupisgoodfood33"
},
"reviewBody": "i scaled this back some and only added a splash of milk and added an egg. i browned on the stove and then baked it. this is solid when you dont know what to make meal. i served this over egg noodles and it was a hit. my 19 year old who hates everything ate this. : O"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "2good2leaveit"
},
"reviewBody": "I followed the recipe and would have to agree with the other advice given, drain off the fat. Cook the meat first at 425 for 10 minutes, then drain fat and add sauce. Cook at 350 for 30 minutes. There wasn't enough sauce for the mash potatoes I served with it, so next time I will add a can of evaporated milk. I also didn't have any saltine crackers so I used a garlic &amp; herb crackers I had. Turned out good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "This was allright. Nothing special, but decent nonetheless. Both my hubs &amp; I agree that Anne Marie Sweden's hamburger steaks w/ onions &amp; gravy is FAR superior to this recipe (these \"steaks\" were too bland for our liking). Yes, the two are different, but only slightly so - the gravy here is mushroom based &amp; Anne Marie's gravy is just a basic (but SUPER flavorful) brown gravy. As many others have done, I too made several changes. W/o them, I'm afraid I would have liked this even less. Keep in mind that I only made 1/3 of this recipe (4 steaks) since I was feeding 2 people. I set my oven to 425 degrees, baked my steaks for 10 min. per side, reduced the oven temp. to 350, drained all grease &amp; then proceeded as directed. My other changes were to saute a sm. (sliced) yellow onion &amp; a t of minced garlic in 1 T butter until softened / fragrant, top my steaks w/ the mixture, add a .75 oz. packet of McCormick brand brown gravy mix &amp; 1.5 c. H2O to my can of condensed cream of mushroom soup &amp; pour over all. After I took everything out of the oven, I noticed my gravy hadn't thickened (I worried about adding so much H2O, but it was too late to do anything about it). To fix the issue, I mixed 1 T cornstarch w/ 1 T cold H2O, poured my gravy into a sm. saucepan, added the cornstarch slurry &amp; brought to a slight boil to thicken. Perfect! Served w/ garlic mashed potatoes &amp; corn, this was an \"OK\" meal, but not one I'd repeat again. Thanks anyways, RHONDA! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RomeLover85"
},
"reviewBody": "Very yummy-- I scaled this down to 1 lb of beef and 1 can of cream of mushroom. I left out the milk and used an egg instead to help hold the patties together. I also seasoned the patties with onion powder and seasoned salt instead of garlic powder and italian seasoning. Following the advice of another reviewer, I first browned the patties at 425 for 10 minutes a side and then poured off the grease (glad I did- it was the cheap stuff, so there was plenty to pour off). While doing that, I sauted half an onion and a clove of garlic, then added the cream of mushroom and about 2/3 can of water and let that simmer until the patties were done browning. After pouring off the grease, I added the gravy mixture to the patties, covered with foil, and baked at 350 for another 25 minutes. It was GREAT. Served with mashed potatoes and black eyed peas-- a good cheap meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrownEyedGirl"
},
"reviewBody": "I liked this recipe. I didn't measure the ingredients but it came out great. Also, I didn't have time to bake it so I fried the patties on the stove to speed up cooking time. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "This was yummy! I added an egg to the ground beef mixture to help hold it together, and browned both sides a little bit in the frying pan to get rid of some of the grease...cut up an onion and added it to the mixture before putting it in the oven...it ended up having to cook for about an hour and a half before the onion cooked all the way. Turned out great, the \"gravy\" was delicious when served over rice, served corn and green beans on the side. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stacey_cw"
},
"reviewBody": "I made this with ground sirloin and left out the mushrooms since my husband and I aren't huge mushroom fans and it tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLIE101"
},
"reviewBody": "Delicious comfort food! I seared my burgers on the stovetop just for color and to get rid of a litttle of the grease. Then I finished in the oven. Added a little minced onion to the burger mixture as well. Also mixed gravy mix and a little milk in with the cream of mushroom. It was outstanding and very easy! Will be making this one again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jaime"
},
"reviewBody": "Easy and delicious. I used hamb. patties and covered with soup mixture. This was even a hit with the kids, who can be picky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alex"
},
"reviewBody": "THis is a great recipe.. Here is how I do mine (more like the Amish here in Pa.).. after mixing the ingredients I then press into a cookie sheet to about 3/4\" .( I omit the Itialian seasoning) Chill in refridgerator for about 4 hours Then cut into squares, dredge in flour then \"brown\" (not cook through) both sides in a small amount of oil. Remove, Then put into your baking dish,Top w/ mushroom soup Diluted w/1/4 Can of milk or water. Bake 1 hour 325 Degrees"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't bake this, I made it in my electric skillet. Used Ritz Crackers because that's what I had on hand. No canned soup aloud in my house so I used an AR recipe for Home made Cream style Soup Mix. You should check it out!! My husband said tonight's dinner was restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1gdcowgrl gone"
},
"reviewBody": "I didn't bake this, I made it in my electric skillet. Used Ritz Crackers because that's what I had on hand. No canned soup aloud in my house so I used an AR recipe for Home made Cream style Soup Mix. You should check it out!! My husband said tonight's dinner was restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissa.507"
},
"reviewBody": "They call this poor man's for a reason. I rated this 5 stars because I had to substitute the crackers for italian bread crumbs and only had 1 can of cream of mushroom soup in my pantry...I had not been MAJOR grocery shopping since before Christmas and this came out delis with what if anything I had. I followed the recipe to a \"T\",besides the bread crumbs and soup mix mix-up..lol,I also added a little onion powder to the mix. From one down home working woman to ... anybody, this is an easy great comfort food for everybody, especially this Southern Minnesota Family!8)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J'Anna Williams Jacobsen"
},
"reviewBody": "Great patties! I fried them in a pan on the stove and then removed them. I sauteed onions and fresh mushrooms, added 1 can of cream of mushroom soup, 1/2 cup water, 1/2 cup milk, dash of worcestershire. Whisked until blended. Added the patties to the mixture and simmered for about 20 minutes! They were great!! Tasted like a \"grandma\" meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "Very good. Nice simple dinner. I used low sodium cream of mushroom soup and topped them with cracked black pepper and sautees onions instead of mushrooms. Served it with mashed potatoes and corn on the cob. I will certainly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "This was SUPER good! I wasn't planning on changing the recipe, but when I went to my pantry to get my cream of mushroom, I noticed that I only had 2 cans of that and 1 can of golden mushroom, so I just mixed them all together. I did brown the hamburgers first as suggested by some other reviews. I then chopped some onion and sauteed that in some olive oil until tender and then mixed in the 3 cans of soup to combine. I then poured this mixture evenly over the top and covered and baked (they came out very moist). This is definately comfort food, and I will be making it again! Thanks for posting. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Great recipe!!! My husband and I loved it! I added a 1/2 pack of onion soup mix and also cut the recipe in half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JH"
},
"reviewBody": "I love these. Only one thing I did differently was to brown these in a pan beforehand...cuts out a lot of grease from the gravy and makes them even more tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dj"
},
"reviewBody": "this was good, but it took longer for mine to cook. probably because i made very large patties. i followed the recipe to a \"T\" except i used fresh mushrooms on topinstead of canned. mostly because that is all i had but also thought fresh mushrooms are best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gbradley626"
},
"reviewBody": "My family really enjoyed these patties. Followed the exact recipe, and was very pleased. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J"
},
"reviewBody": "Good flavor and easy. I preferred warming the cream of mushroom on the stove top and adding it on top after cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EzE"
},
"reviewBody": "My family really likes this recipe. I tweeked it a little bit. I substitute 1 egg for the milk. I only used 2/3 the crackers and add some Mrs Dash original seasoning. Most of my family do not like mushrooms so I used just basic jar brown gravy and topped it with yellow onions. I cooked it covered at 350 and then uncovered it for the last 10 minutes and turned up the heat to 425. It really browns the top good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "So simple and my family loved this comfort food. The soup made it's own gravy and there was plenty of it. I served this with mashed potatoes and gravy on the side. As my husband said you just can't go wrong with meat and potatoes. I like a lot more spicy savory food, and am not a fan of mushroom anything so I personally thought they were rather bland. Thanks Rhonda this was great for such an easy dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANDREASKYE"
},
"reviewBody": "Good easy dinner for a bunch without a lot of trouble. Made as directed. A \"teenager's at home with friends\" dinner here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Care"
},
"reviewBody": "My mom used to make this dish many years ago when we were little :) This is a good recipe. I used bread crumbs instead of saltines ( didn't have any ) and it came out just fine. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "these were reall good, I didn't use the cream of mushroom or the mushrooms since my husband doesn't like mushrooms - I substituded brown gravy for it and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andi Susann"
},
"reviewBody": "just ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmberPoe"
},
"reviewBody": "its really good but i used a pack of 35 cent brown gravy cause my husband dont like mushroom soup/ mushrooms at all.\ni also mixed some A1 sause into the meat with the seasoning before i cooked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheflady74"
},
"reviewBody": "Yummy! I prepared this recipe after having had loads of company the day before and needing something 'comforting'. Ahhh...it was marvelous. I made it exactly as written except only used 1 lb extra lean ground beef and 1 can mushroom soup. Oh, and added half a finely chopped onion. My 3 boys and husband gobbled the entire pan up in minutes and hubby commented that it reminded him of his mother's good meals. I'll make this again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reedspaige"
},
"reviewBody": "Such a quick and easy meal. My family just loved it. Very flavorful, definately a repeat dish!!! A+++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This recipe was a hit in my kitchen last night. I served it over toast and my husband had seconds and eagerly took leftovers to work for lunch the next day. Warm delicious comfort food. Like many others have suggested, I would cook off some of the grease before adding the mushroom soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Cask Norris"
},
"reviewBody": "This was great just the way it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Colin"
},
"reviewBody": "Tried this recipe tonight, was expecting something different. Was a little bland, will add something next time. Overall was a \ngood meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary D"
},
"reviewBody": "My whole family loves this First time I made this had no crackers Used Italian style bread crumbs instead Have never used crackers Otherwise prepared as per recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "I cut the recipe in 1/3 and made five hamburger steaks. I didn't like just the cream of mushroom soup on top. Next time, I may just use regular mushroom gravy and cook the hamburger steaks on the stove top. My husband would give it four stars. It's a very easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Lynn Powers Swindells"
},
"reviewBody": "I found that the meat was a bit mushy the first time I did it ( following the recipe) \nso the next time I only added half the milk and and only half the crackers, I also added some misses dask garlic and herb seasoning. And to the soup I mixed it with a pack of brown mushroom gravy mix and 1 1/2 cups of water then I pored the gravy mixture over the patties. It came out great and my family ate right up!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "vintra39"
},
"reviewBody": "I was not impressed with this recipe at all. There was no flavor to this. I will keep searching for a better one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Graden"
},
"reviewBody": "I thought this was really good! My changes were, omitting the milk (I forgot it, and I'm not sure how it helps the dish anyway) and to the mushroom soup I added worchestershire, a teaspoon of onion powder, beef bouillion and a few pepper flakes. It was very flavorful and I think I liked it better than some of the salisbury steak recipes from this site. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHAJEK"
},
"reviewBody": "This is very tasty. I took the suggestion of lexiandjack and made a gravy. I added beefer upper instead of kitchen bouquet. I find beefer upper has a nice beefy taste. I added a little worcesterer sauce and my husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriJeannine"
},
"reviewBody": "Crackers instead of bread crumbs? That is genius!! I don't know why I didn't think of it before. My family really enjoyed this and my picky 11 yr old son even asked for more! I added one egg to the meat mixture and after I formed the patties, I dusted each with flour. I used 2 cans of cream of mushroom soup, mixed it with evaporated milk and poured over each patty.\nThey were delicious! Served it with a salad, mashed potatoes and ranch style beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PUNKERS7881"
},
"reviewBody": "This poor man's hamburger steak is wonderful!! great flavor all the way. I did listen to other reviews and follow what they said, i also changed it up a bit to suite our taste. I followed it completely except, i only made a third of the recipe. I cooked it on 425 for 10 minutes on each side before reducing heat to take off grease. I also mixed in half a can of soup instead of using it as a gravy on top. This made it so delicous. Instead of the mushroom gravy on top, i used a pack of brown gravy mix but added some of the cream of mushroom soup and added a can of fresh mushrooms to it as well. yum.. thanks for the dish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "POCOHONTAS"
},
"reviewBody": "should have took the reviews advice make sure to cook grease off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "These were good. I did add more seasonings as others suggested. Also, I put some french onions on the top after backing. I ended up with quite a bit of sauce. I cut the recipe in half and still ended up with six large hamburgers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JDVMD"
},
"reviewBody": "I will never forget when one of my high school friend's mother made this when I spent the night. Loved it, came home raving about it, and finally got my mother to make it. Still make it to this day. Great comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myles Cloutier"
},
"reviewBody": "Excellent! Easy to prepare, super tasty and of course cheap!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77927/poor-mans-hamburger-steaks/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17656/main-dish/beef/salisbury-steak/",
"name": "Salisbury Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77927/poor-mans-hamburger-steaks/",
"name": "Hamburger Steaks with Creamy Mushroom Gravy"
}
}
]
}
}
, "about": [
]
}
]