				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Heather&#39;s Gingerbread Cookies"
,"datePublished": "1998-12-06T14:57:58.000-05:00"
,"dateModified": "2022-11-17T00:48:09.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Heather"
,"url": "https://www.allrecipes.com/cook/Heather"
}
]
,"description": "This is a very tasty Christmas dessert. This recipe is very nice for Christmas parties as it makes 2 1/2 dozen 2 1/2 inch cookies."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CEcoQDijRF_ovrmcYSrMaYuBBbc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6035253-gingerbread-cookies-Katey-4x3-1-084b14a08df24fcd950f4685d8a0585d.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Heather&#39;s Gingerbread Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "142"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "264 kcal"
,"carbohydrateContent": "52 g"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "199 mg"
,"sugarContent": "25 g"
,"fatContent": "5 g"
,"servingSize": "2 1/2 dozen"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1.5 cups dark molasses",
"1 cup packed brown sugar",
"0.66666668653488 cup cold water",
"0.33333334326744 cup shortening",
"7 cups all-purpose flour",
"2 teaspoons baking soda",
"1 teaspoon salt",
"1 teaspoon ground allspice",
"2 teaspoons ground ginger",
"1 teaspoon ground cloves",
"1 teaspoon ground cinnamon",
"1 (16 ounce) package chocolate frosting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease one cookie sheet."
} ,{
"@type": "HowToStep"
,"text": "Mix together the molasses, brown sugar, water and shortening."
} ,{
"@type": "HowToStep"
,"text": "Sift together the flour, baking soda, salt, allspice, ginger, cloves and cinnamon. Add to sugar mixture and mix well. Cover and refrigerate for 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Roll dough 1/4 inch thick on floured board. Cut with floured gingerbread cutter. Place about 2 inches apart on cookie sheet. Bake for 10-12 minutes. Cool and decorate with frosting."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great! A friend made it and I asked for the recipe - not overly sweet - I’d call it a grown-up cookie - if you want something ‘decadent’ or whatever then definitely look elsewhere but I love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tammara"
},
"reviewBody": "very nice cookie but definitely needs some more sugar.....or sweetener of some sort"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "The recipe turned out great! I only took a small amount out of the chilled bowl at a time to roll out and cut. The rest stayed in the fridge. That helped a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Strongbygod"
},
"reviewBody": "Needed more ginger and spices. I wet the dough by wetting my hands like others said. Made it worse. Definitely had to use frosting for taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookingewithkindess1"
},
"reviewBody": "I think i added too much molasses, but it was still good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Parks"
},
"reviewBody": "delicious cookie and easy to decorate as well!!! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rockinrobin62"
},
"reviewBody": "I didn't change anything in the recipe and they turned out delicious. The dough was perfect for cutting out the shapes and the cookies came out of the oven chewy. My 6 year old granddaughter liked them so much, she copied down the recipe to take home for later!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SimplySharziSweets"
},
"reviewBody": "I love gingerbread and because I'm a cookie artist, the recipe has to hold its shape while baking. This recipe does!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jogr"
},
"reviewBody": "This was my firt time making gingerbread cookies and I followed the recipe, the only change being I used butter instead of shortening. Everyone loved these, even before frosting. The recipe makes a huge batch. I baked half of them today, saving the rest of the dough for later. I will increase the spices next time, as I like more flavour/ spice in my cookies. I also followed another reviewers recommendation to measure the flour and water precisely, and found that the dough was easy to work with. Overall a keeper for my holiday baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Evans"
},
"reviewBody": "Excellent taste!!! Easy to follow instructions!!! I have never made gingerbread before - I will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mstipp"
},
"reviewBody": "I love this recipe! I have made it every year since I found it on this site. No eggs - no problem! These cookies stay soft and keep forever. They taste sooo good! The batter if very thick. I use my Kitchenaid Mixer then put the dough into a sealed container and refrigerate at least 2 hours - sometimes 2 days - until I can get back to it. I then only work with a quarter of the dough at a time and keep the rest in the fridge until I'm ready for it. Roll it out with flour and bake. The thinner the cookie, the crunchier it will be. The thicker - the softer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlin02"
},
"reviewBody": "The cookie had a very strong molasses taste. Will take suggestions to tone it down next time. Was a great texture for using cookie cutters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chester"
},
"reviewBody": "I took a batch to work the vegans and meat eaters loved them. great recipe , good yield as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "batmans_chick"
},
"reviewBody": "Honestly this was my first time making gingerbread cookies. I was expecting more of a bang of cinnamon. But honestly they tasted pretty bad. They were plain and whitish. I replaced the molasses with a substitute which might explain the light color, but other than that the flavors just weren’t there for me or my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brendan S."
},
"reviewBody": "Wonderful recipe! I love the great flavor these cookies have. They are deliciously crips on the outside while still being just a tad chewy on the inside, just the way I like. My only issue with it was the slight struggle I had rolling the dough. Just make sure to use plenty of flour, and re-flour your board between every batch. I finished mine with a simple frosting; gave it the perfect finish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Chicken"
},
"reviewBody": "This recipe was perfect! The thinner you roll the dough, the harder the cookies seem to get. So if you don’t like them too hard then don’t roll them too thin. Also, who ever mentioned rolling the dough on a sheet of floured wax paper with another one on top, You are a genius! Thank you! Some people also said that these cookies were not sweet enough but if you use frosting then they are sweet enough. All in all, great recipe! Will definitely use for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "forevernine"
},
"reviewBody": "This recipe was very good but if you make it you have to make sure not to roll out the dough to thin or else the cookies will cook for a different amount of time than the recipe says and even if the dough is thick you would probably need to cook it 5 min on top and 5on bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "denzel"
},
"reviewBody": "In 2016, its surprising that someone is still using shortening... There are way better ingredients available that make better cookies with more natural ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjpier03"
},
"reviewBody": "Super easy kid tested and approved ????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melindab"
},
"reviewBody": "Outstanding!!! This is a good sturdy dough, makes nice thick cookies with excellent flavor. My whole family loved these cookies! I admit to having cut the cloves and allspice in half due to personal preference, but I think if I made it again I'd follow the recipe exactly. Cookies taste fabulous with just a bit of icing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swier1"
},
"reviewBody": "I followed the recipe exactly as written and the cookies turned out great. I rolled mine out to about 1/4 inch thickness and they made nice, soft cookies that we can't stop eating. I decorated with the icing from the \"Royal Icing I\" recipe (I left out the lemon extract) and it was perfect. We also made gingerbread houses with the two recipes and they were super strong and easy to decorate. Great recipe! If I change anything at all next time, it might be to cut back a bit on the cloves, but that's just personal preference. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "outrunner1"
},
"reviewBody": "I have made this recipe stock standard for years. Roll the dough no less than a quarter of an inch and put them in an airtight container; they will stay moist for weeks. If you want them sweeter, frost them with royal icing. 'Nuff said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ctmomofsix"
},
"reviewBody": "I have made this recipe several times now, over several years. I have used it for gingerbread houses, and gingerbread men cookies. I like the fact that it has no eggs, and is pretty simple to make. I use butter instead of shortening, out of preference, so I then cut back just a little on the water. I find that the dough is easy to work with after coming out of the fridge. I usually portion it into quarters to roll it out to make it easier. This year, for some reason, it worked exceptionally well! I baked the cookies for 10 minutes in my convection oven, and they came out perfect. Just a little crunch, but not overdone. Definitely a recipe I'll come back to again and again! Somewhere it says it makes 2 1/2 dozen cookies; I ended up with over 5 dozen! May halve the recipe next time, unless I'm giving some away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nati Flores"
},
"reviewBody": "They came out great! The dough came out in crumbs after I took it out of the fridge, I followed someone's tip of adding more cold water and it was almost perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kody Brown"
},
"reviewBody": "Tastes good! It's hard finding a good gingerbread cookie recipe. I really like these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joeyy P."
},
"reviewBody": "The cookies were really good, but they didn't taste like gingerbread cookies. The only thing I didn't do was decorate with chocolate frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bridget Knox"
},
"reviewBody": "I was unable to even roll it out so I ended up making a few dozen ginger snaps &amp; some gingerbread \"biscotti\". I would recommend adding a few eggs to this recipe or else it crumbles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Definitely would not make this again. Cookies really don't taste like anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "Excellent!. Followed the directions exactly and had no problems! The taste was just right, not overpowering as reported in some other reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Shoup"
},
"reviewBody": "Good basic recipe, however, I substituted margarine for the shortening (to add a buttery flavor) and I used 14-16 ounces of molasses to add to the plasticity of the dough in the subsequent rolling out of the dough. With only 12 ounces, the dough becomes very dry in the additional rollings and difficult to get good quality cookies. I will also vary the recipe by using cane syrup instead of molasses for a milder flavor. With a frosting of confectioner's sugar, butter, milk, and vanilla, either colored or with colored sprinkles, I have multiple requests from friends and family for these hallmark cookies!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Yetman"
},
"reviewBody": "These were delicious, probably the best gingerbread cookies I have ever tasted. I substituted Earth Balance Buttery Sticks for the shortening and they turned out great. I used a little flour while rolling out to 1/4 inch, baked for 10 min... perfection! My daughter has dairy and egg allergy and this recipe is by far the best gingerbread recipe we have every tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Donna957"
},
"reviewBody": "mine came out a little hard - maybe I cooked to long? I did not care for them sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JustCallMeFred"
},
"reviewBody": "Followed recipe spot on. No substitutions. Cookies came out like hockey pucks. Even dropped one on the floor and it didn't break. Dissapointed in spending so much time making and baking only to have inedible cookies. Not very flavorful either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dianne Shackelford"
},
"reviewBody": "My grand-daughter and I tried this recipe today. we made the dough yesterday, following the recipe with no changes and then refrigerated overnight. The dough stuck to the work surface and the cookies sheets. The cookies wound up being very tough and essentially tasteless. We made half the dough. I have been a home baker for years (very successfully according to family and friends) and we were so disappointed as these were supposed to be in gift baskets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karkar"
},
"reviewBody": "Lol sounds like a delicious recipe, I just hopw everyone reads the entire recipe before beginning, because you really don't have to preheat the oven two hours early."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Buckler"
},
"reviewBody": "Very good cookie! I subbed the molasses for maple syrup because I didn't have any molasses and I subbed the shortening for coconut oil because it's healthier and I saw another reviewer did it as well. ;) The kids loved them! And as long as I used flour to help roll it all out it didn't stick. The trick is to always use flour when rolling out the dough! My inlays came over last night and even they liked them. They must have because they kept stealing them from the kids. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DragonWarrior"
},
"reviewBody": "OH MY GOSH!!! THE COOKIES TURNED OUT WONDERFUL!!! The dough was moldable even after 1 hour, so I don't think that you need to refrigerate the dough for 2 hours...... also the gingerbread guys got fatter in the oven (sorry.....) but thats probably my mistake of cutting them too thick. But never the less.... GREAT RECIPE!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kestrachern6"
},
"reviewBody": "This recipe is nearly identical to the one that my family has been making for the last 3 generations. A few helpful tips that we've incorporated into our routine: \n1) DO NOT OVERMIX. The more you mix, the stickier it gets. \n2) Combine the flour+spices first and set aside so that it can be added quickly to the mix. \n3) Don't add the cold water until right before you're ready to add the flour+spices. If it sits around and starts warming up, the dough will be stickier.\n4) Use only 6.5 cups of flour in the dough and then cover your work surface with flour when you go to roll/cut. It helps keep the dough from sticking to you and your rolling pin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tzivia"
},
"reviewBody": "Way too hard and dry. I think you need to cut back on the flour. I ended up making drop cookies out of them, because the dough was too crumbly to roll. I made 2 trays and threw the rest out, they taste like flour, way too heavy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cwmom827"
},
"reviewBody": "This was the best! I just made them and I also made a few changes: Instead of shortening I used Coconut Oil and in place of the dark molasses I used Maple Syrup and I doubled up on the cinnamon, because I couldn't resist adding more! These came out awesome. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAH"
},
"reviewBody": "Mmh! The more I ate them the better they tasted. I do better next year on decorations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "callie"
},
"reviewBody": "I followed this exactly with the help of my son and these cookies are a hit! I used homemade vanilla frosting instead. But these cookies are great! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ToriL90"
},
"reviewBody": "I feel like the molasses overpowers the rest of the flavors. I cut the servings down to 12 (which would probably make more like 2 dozen if I had used it all for cookies), which calls for about 1/2 cup molasses and 1/3 cup brown sugar, and I added an additional 1/3 cup stevia and doubled the ginger and it still came out merely okay. I made about a half-dozen cookies out of it, then I used the rest of the dough for cinnamon rolls and actually, THAT came out really good. It's a good recipe for a really different-tasting cinnamon roll, but not a great recipe for gingerbread cookies. Next time, I'll try it with more brown sugar instead of molasses, then maybe triple the ginger and double the cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baking Mad"
},
"reviewBody": "This recipe is heavenly! They last a very long time and the aroma stays with them :) I would reccommed these to anyone who dose not have time to spend more than 3 hours in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacieharris"
},
"reviewBody": "This is my first time ever to make gingerbread cookies. Thank you so much for this recipe. It was very easy and simple. Me and my kids had a blast. I had no problems with the dough. I only had 1 cup of molasses so I just added 1/3 cup extra water and the cookies still turn out to be sweet and full of flavor. I baked them for 10 minutes and they turned out soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AdMeliora1"
},
"reviewBody": "I'm happy to have found this recipe - my son is allergic to eggs and dairy, so finding one without is great! It turned out well, except that I prefer my gingerbread with a bit more spice. I'll definitely use the recipe again, though next time I'll try adding a tsp of nutmeg and maybe 3 tsp of ginger and see if that suites my tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYBIRD1995"
},
"reviewBody": "I really liked this recipe. I followed directions exactly as written. I had some on a cooling rach and my baby climbed up and took a bite of each one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "iloveallfood"
},
"reviewBody": "i have tried this recipe with the all natural sweetener Natvia to make a 100% guilt free delicacy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Regan Stavos"
},
"reviewBody": "I was searching for a recipe I used last year for gingerbread cookies and thought this one was it. As I started going along, I realized it wasn't but I am still very glad I tried it! Even though I honestly feel like the recipe I used last year was better, this was still a fun recipe to try. It makes a very traditional gingerbread cookie, both in flavor and texture. I followed the recipe exactly (other than I only chilled the dough for 1 hour, not 2) and baked the cookies for 10 minutes. They were not melt-in-your-mouth soft and chewy, but not crispy either. A little dense, but not heavy. Flavor and spice tasted great to me and it sure made the kitchen smell like Christmas! In addition to making good cookies, I think this recipe will be even better for making a gingerbread house, and plan to try that in a few months!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DianaB"
},
"reviewBody": "Tasty cookies. Made great Christmas tree ornaments as well. They stay pretty true to size after baking so less than 2\" space between is okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "musik16"
},
"reviewBody": "I think these taste pretty good, been awhile since I have had gingerbread. Love them a little thicker so that they are nice and moist at a later date. Yum Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "RDivine"
},
"reviewBody": "I tried this cookie recipe 2 days ago and was rather dissappointed. The cookies were dry and I had trouble working with the dough. I made the recipe exact according to directions. I have had better flavor in other recipes but could not put my finger on the recipe I used so tried this new one but won't use it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Li"
},
"reviewBody": "I made this recipe specifically b/c it didn't have eggs (my daughter is allergic to eggs). I have made many Gingerbread cookies and houses in my lifetime that tasted wonderful. I wish I had written one of those recipes down. This recipe is NOT one of the good ones! Dough was very dry and crumbly. The first batch, which was fresh out of the oven, tasted stale. So bad, dry, and tasteless. \r\nI urge you to try another recipe and skip this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grete Bluhm"
},
"reviewBody": "Best recipe ever!!! I used a stone, baked them for 10 min and then let the cookies sit for 2 min before moving them to a cooling rack. It's my first time making gingerbread cookies and they have a perfect mix of crunchy and soft. I will absolutely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Paige Kufro"
},
"reviewBody": "We made this last night and you can barely taste the spices. I would double or tripple. the spices in this recipe. It tasted like molasses/flour cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiffanythecook"
},
"reviewBody": "Cute and good! I was happy to share them with family last year during the holiday season. They are just so fun to bake and decorate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Biscuit"
},
"reviewBody": "I've never liked gingerbread before, but this recipe has made me love them! My family and friends can't get enough of these delicious cookies. :) It's become a tradition to bake them for my friends abroad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy053"
},
"reviewBody": "This is the best gingerbread recipe I've used. The dough held up, the cookies turned out firm but soft, and tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmjm0315"
},
"reviewBody": "These turned out great! Tasted wonderful warmed in the micro with a glass of milk. I hid them in the oven, and the next day I was preheating the oven, and could smell something burning. Yep, it was my cookies! I will make them again this christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Bradford"
},
"reviewBody": "The taste was wonderful! But what an awful time rolling the dough out... I added a considerable amount of flour and that mostly did the trick. I also should have kept the dough in the fridge longer I think. However it made for great laughs with my mom whom I was baking with that day! Dough everywhere!! Hehe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I followed recipe &amp; they were perfect. I made mini gingerbread people, as some suggested I left them a little thick &amp; coated with a glaze &amp; cut up marshmallows. Did not last long on Christmas Eve!!! But I will say this; gingerbread dough is a pain in the *** to work with. Cut the recipe in half! T'was a difficult task with ALL THAT DOUGH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Stephanie Reinhardt"
},
"reviewBody": "Bland. Dough hard to work with. Not the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Poteet"
},
"reviewBody": "This recipe was delicious and easy. The dough was very easy to work with and you don't have to double it to make a large batch of cookies. I rolled them thicker and baked them for 11 minutes and they had that initial crunch when you bit into them then were nice and chewy. I will make these again for sure. I made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gingergonzalez"
},
"reviewBody": "The cookies have a great flavor to them. Easy to make. If you don't want them to be quite so hard, though, I would take a little bit of time off the baking time. I only baked mine 8 minutes. I know Gingerbread is supposed to be crispy but I don't want it to break my teeth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The cookies have a great flavor to them. Easy to make. If you don't want them to be quite so hard, though, I would take a little bit of time off the baking time. I only baked mine 8 minutes. I know Gingerbread is supposed to be crispy but I don't want it to break my teeth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michelle Lee Hill"
},
"reviewBody": "I was able to roll these out and make some great shapes,,, i even frosted some. They had no distinct flavor. =( disappointing. The ones i put frosting on.. just tasted like frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sunnydays"
},
"reviewBody": "An ok recipe. I more than doubled the spice amount and still found it a bit bland - I'll likely quadruple next time. It's not overly sweet which I like. I found that I had to add a little extra water to get the right consistency (next time I'll try a bit more shortening). For those that complained of stickiness, I had to flour my rolling pin and table well to prevent sticking, but then didn't find it too problematic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LisaMaree"
},
"reviewBody": "I realized I used a self rising flour with baking soda and salt and I didn't add any baking soda as I figured that would do it. I should have read the other recipes first.Yes something wrong with the recipe, never have I had a bad recipe from all recipes...maybe less molasses?? Something isn't right. Really bad :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila M. Johnson-Schiwal"
},
"reviewBody": "Great recipe, and simple. I doubled this and rolled 1/2 inch thick for a softer cookie. I will never use another. This one rocks! Thanks much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ILURVDESSERT!"
},
"reviewBody": "This is soooo good! I just love all the spices and how they blend together so perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PLewis"
},
"reviewBody": "This is an awesome recipe. I brought them in to work and everyone raved that they were the best gingerbread cookie they have ever had. I used butter instead of shortening. Thank you, I have found a new holiday tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lummiepie"
},
"reviewBody": "These were great at a recent holiday party. I cut them with star cutters and frosted them with a thin coat of frosting, just enough to hold gold sugar sprinkles on the tops. They were stunningly beautiful and got raves from our guests for their flavor and texture. Also kept well in a tight tin. Definitely a holiday standard now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Wells"
},
"reviewBody": "These are excellent! This was my first attempt at gingerbread cookies, and I love how soft and tasty these turned out. Word to the wise: doubling the recipe resulted in something like 8 or 9 dozen cutouts - way more than I had expected. But, more to distribute to neighbors and friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "steph8608"
},
"reviewBody": "Maybe I did something wrong, but these cookies were dry and tasteless. I felt like I was eating flour. Looks like I'll be buying my gingerbread men at the grocery store this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohwhatamess"
},
"reviewBody": "I thought these were really great cookies! They tasted great, baked well, and it was fun decorating them. Thanks for sharing. =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TazCRNA"
},
"reviewBody": "I made this recipe as written. I bumped up the spices because I like spicy gingerbread cookies. The dough was super sticky, very difficult to roll and cut out. I ended up making drop cookies instead. They turned out great. I liked the flavor and soft, chewy texture. Next time I have to remember to cream the shortening and sugar before adding the other wet ingredients. I think that'll help with the stickiness and difficulty working with the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocolategirl1998"
},
"reviewBody": "i made these cookies and they were the BEST!!!!! i decorated them with cream cheese icing and everyone loved them!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mixingmedias"
},
"reviewBody": "A little strong on the ginger, I should have taken previous reviewers advice and used just half. On the plus side they hold their shape very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingFairy8"
},
"reviewBody": "Delicious! And it's great that it's already vegan without having to make substitutions =) One note though: I think the preparation of the dough should be moved to the beginning since it has to be refrigerated for 2 hours prior to baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Andibear"
},
"reviewBody": "I followed the recipe and suggestions but it ended up far too thick and virtually tasteless...won't be using this recipe again - sorry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "seattlejen"
},
"reviewBody": "It was a great hit at the Christmas decorating party. Based on the other reviews I tweaked the recipe a bit. Instead of all the shortening I mixed it with half unsalted butter and shortening. Used 1 1/4 cup of molasses. And added a little over a teaspoon of ground cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SouthernBelle"
},
"reviewBody": "These are awesome cookies! They're the typical gingerbread cookies with a very festive, holiday flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GingerbreadHater"
},
"reviewBody": "The worst gingerbread I've ever made in my entire life! Molasses was way too much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystal"
},
"reviewBody": "Followed recipe exactly. Molasses stinks and I have never used before so I thought the cookies would be nasty I was soo wrong! I didn't experiance any of the problems other people did. I used grandmothers molasses don't know if that matters though and butter flavored crisco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GAYLA73"
},
"reviewBody": "Made this with my 8 year old son, and while it was a great activity, most of the Gingerbread people looked handicapped because the dough was so sticky arms, legs, and heads were coming off left and right. Maybe it was because of the humidity, not sure. The cookie it's self had a good flavor, though I was not a fan of the texture. It was just... odd. Can't see myself making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Ok, to be fair? I have never made gingerbread cookies before. So maybe they are supposed to be impossible? I successfully made batch after batch of cookies and then attempted these. Dough was so very very dry. It was all crumbly. Even wetting hands you could only work with a tiny bit of dough at a time and it would break, etc. I managed to make one pan of little men. I made sure to take them out early. Really dry and floury. Which sticks because I had to buy the molasses, ginger, cloves and allspice... over $20 for those alone..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "This is a great recipe. It's from the 1963 Betty Crocker's Cooky Book and I've been using it for years. It makes lots of cookies and everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shine"
},
"reviewBody": "I thought this recipe was amazingly good. It reminded me of the ones I ate as a kid at sanas village in jefferson newhampshire. A few additions made it perfect for me. I didn't use allspice but beefed up on the ginger, cloves and cinnamon. I doubled the asked for amount. And instead of shortening, I used real butter. Also, I rolled the dough out a little thicker. They puffed up great and are still soft and chewy days later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "My son is in Kindergarten and they have been making and learning about gingerbread cookies. He was so excited when I made these and unfortunatly, he has not learned to say mine are better than the ones at school! It's all good though. I found the cookies very good and the dough was very easy to work with. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IthilienDude"
},
"reviewBody": "This is now officially my favourite gingerbread recipe ever! To all my fellow bakers in Ireland (and the UK), do not fret if you can't find molasses: I use golden syrup and it tastes lovely - quite a sweet, almost toffeeish taste, but lovely all the same. Also, don't overcook. I'm a terrible for looking at them after the prescribed time and thinking 'Jayze they're a bit pale!' and whacking them back in for an extra five minutes but AVOID THAT TEMPTATION! It makes them tooth-shatteringly crunchy. Even if they look underdone, take them out of the oven after the given time. Other than that, they're perfect =D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "Why would I pre heat the oven for 2 hours before I bake these cookies? You should change the number of the steps around. #4 should say Pre heat oven to 350. Then #5 roll out cookie dough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy D"
},
"reviewBody": "This recipe is great! It has the perfect flavor and an amazing scent fills up the kitchen! My mother, who normally isn't a big fan of gingerbread cookies, loved them as well. Make sure to flour your surface well each time you roll out the dough, as it can be VERY sticky. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rita Bieri"
},
"reviewBody": "I did not like this at all. I do not blame the recipe. I just did not realize how bad molassus smells and therefore taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DARLAJENKINS"
},
"reviewBody": "These were pretty good cookies. I didn't have any trouble rolling them out and they had a nice, but strong taste. The one problem I had was that I had turned my brain off and added the cold water to the shortening, molasses and sugar without creaming it. I was able to save the mixture but remember to cream the shortening before adding the water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aobrienid"
},
"reviewBody": "This was okay - I wish they would've been more sweet. Other than that they were great. Dough was very workable and made soft but stable cookies. They were easy to decorate - check out the recipe called Decorator's Frosting by P. Oakes - yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "busymommy"
},
"reviewBody": "I used this recipe BUT I mixed in two large eggs to bind it all. Even then I had to really knead the dough. Rolling it out was much tougher than sugar cookie dough because it is so much more dense. (but the good news is it doesn't stick like sugar cookie dough!!) Decent enough but the eggs are a MUST!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "iroK"
},
"reviewBody": "How long does your oven take to reach 350? You might want to preheat the oven when you take the dough out of the fridge after 2 hours and not 2&amp;1/2 hours before that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "I made a gingerbread house out of this. It made nice thick, soft walls and tasted great. I love that it has no dairy, so the kids can eat the house 2 weeks later. Instead of the frosting, I used 2 egg whites and 5 cups powdered sugar for the 'mortar' of the house. It made clay-like icing that I rolled into ropes to hold the sides together. I wouldn't decorate with it, since it is too thick to pipe, but it is great for holding the house together, and especially good for kids because it isn't sticky at all, but more like clay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosburn"
},
"reviewBody": "I wanted to add something on to my previous review. Let these cookies sit overnight in an air tight container with a slice of bread to help keep moist. Their taste improves overnight and I find they are even tastier after a few days. I just change out the slice of bread every two days to help keep them moist. They are not supposed to be a sweet cookie... that is why the glaze/frosting is used... oops my previous review didn't post... I used 1 1/2 cups robust mollasses. I also doubled all spices. I rolled them a wee bit thick and they were perfect. watch the oven times as they go from done to burned in about 30 seconds."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9481/gingerbread-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9481/gingerbread-cookies/",
"name": "Heather&#39;s Gingerbread Cookies"
}
}
]
}
}
, "about": [
]
}
]