				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "High Temperature Eye-of-Round Roast"
,"datePublished": "2019-04-02T02:48:04.000-04:00"
,"dateModified": "2022-06-06T14:45:57.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lyn N Barbour"
,"url": "https://www.allrecipes.com/cook/1595006"
}
]
,"description": "Eye of round roast is simply seasoned, then roasted at 500 degrees until tender. Learn how to cook a tough piece of meat with this simple recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3zIqufOUHcGeXqVlxwxZc5eoO68=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1497037-949eda51087f4b7ebb52f67c7394da5b.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688035025001",
"description": "Roasting in a hot oven makes this roast very tender.",
"duration": "PT2M7S",
"name": "High Temperature Eye of Round Roast",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/f24c35cc-e0ec-46e2-bf19-85dd61ca4a42/77313496-bb3a-432b-bf59-214120334c27/1280x720/match/image.jpg",
"uploadDate": "2021-03-02T08:45:47.702-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "High Temperature Eye-of-Round Roast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "2387"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "227 kcal"
,"cholesterolContent": "71 mg"
,"proteinContent": "27 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "59 mg"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (3 pound) beef eye of round roast",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 500 degrees F (260 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Season roast with salt and pepper; place in a roasting pan or baking dish. Do not cover or add water."
} ,{
"@type": "HowToStep"
,"text": "Place roast in the preheated oven and reduce temperature to 475 degrees F (245 degrees C). Roast for 21 minutes (7 minutes per pound), then turn off the oven and let roast sit in the hot oven for 2 1/2 hours. Do not open the door at all during this time."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3zIqufOUHcGeXqVlxwxZc5eoO68=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1497037-949eda51087f4b7ebb52f67c7394da5b.jpg"
}
]
,"text": "Remove roast from the oven and check that the internal temperature is at least 145 degrees F (65 degrees C). Carve into thin slices to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT185M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Weiss"
},
"reviewBody": "This is the only way to make a roast! So rare! I use my slicer for very thin slices for roast beef sandwiches. So good! Thicker slices for the dinner plate. So easy! Try it this way and you'll never go back to your old way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really really good. Fast way to cook a sirlion roast also, came out super tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rich"
},
"reviewBody": "A lot has been said about this recipe. I have used it for years and yes it requires some common sense. If you just use a modern meat thermometer with a blue tooth or wifi read out there is no reason to worry about the weight or thickness of the roast. When it's done it's done. Season it how you want prior to cooking and follow the instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyrone Biggums"
},
"reviewBody": "This recipe is nearly perfect—for anyone reading, you always have to adjust to your particular conditions. I had 1.75 pound attractive cut of bottom round, which I liberally seasoned with salt and let hang out in the fridge for an hour. Be sure to season on all surfaces including sides. I also seasoned with pepper, onion and garlic powder, and packed some fresh rosemary into the top. I cooked at 500 F for one minute, then 10 minutes per pound at 475 F (just about 20 minutes), then at 170 F for, in my case, 1 hour and 30 minutes. So you can modulate the cooking temperature. Definitely try to resist checking it and cracking the oven until the very end. This roast came out at 150 F at the thickest portion, and was delicious by everyone’s standards, especially for 4 bucks a pound."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wyatt"
},
"reviewBody": "A great method with a few caveats: You have to know your oven! If you do not have a well-insulated oven, you may need to turn it back on at a very low temperature about halfway through. Granted, this will involve some trial and error. Halfway through, I turn my oven on at the lowest setting for about 45 min to an hour and then turn it off and I get a nice pink middle. Also, yes, this is a tough cut of meat no matter how you cook it so you have to slice it THIN! And don't be afraid to season it. I coat it liberally with Mrs. Dash's garlic seasoning or Penzey's English prime rib seasoning. It's a family favorite for a reasonably priced cut of beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Magic! I don’t know how many times I’ve tried to get a beef or pork roast correct and had it come out too done. This method sounded squirrely to me - turn the oven off??! - but you can’t argue against perfect results. 72 years old and only now being confident I can nail a roast! Note: this method assumes the oven is not an old, or an apartment-size oven. It must be able to hold its heat. Our oven is 10 years old and the recipe worked perfectly. Our daughter tried it in her apartment-size stove and it didn’t work well. Also pay attention: if you’re using eye round roast slice it thinly and of course across the grain. If you’ve ever gotten sliced roast beef from the deli, it’s very likely it came from an eye round!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Itsjustlyn"
},
"reviewBody": "I love this recipe. It works every single time. The key is to cut the meat thinly, across the grain. There is a small piece at the end(the tapered end) was a little more cooked than med rare but just a tiny bit. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been using this recipe for years now, I refer to it as mock prime rib! I season a little differently to our tastes and it comes out perfect everytime! Thin slice, with horseradish on O'charley's rolls and it's a great party or dinner sandwich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Biggest problem with this recipe, it does not mention the thickness of the roast. It just goes by the weight. I admit the pictures display a rather longer, thinner piece, like maybe 2 inches and then long. But if you use a rather thick piece, like say 4 inches or bigger, the meat has to cook longer than 7 minutes per pound. Most eye rounds are cut on a thick scale. Our roast (after wasting over 3 hours time) was only about 3/4 of an inch baked or done. I had to cut the roast down and use a toaster over to finish it off. Very, Very disappointed by the \"author \" of this recipe. Probably will not use this site again for other recipes. Hope this post helps other from making this mistake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Did not know this was a tough cut, so glad I looked up your recipe! This couldn't be easier, pretty much a set it for 21 min turn it off and forget it if you have a regular oven. For me I kept in mind I was using an old convection oven in the bake mode , it has a tea cup plate sized fan cutout that could let out the hot air when not in use. Used a 3 lb roast ,at 1.5 hours I turned on the oven to 150 for the remainder of time. Roast came out PERFECT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John-N-Jenifer"
},
"reviewBody": "This works perfect. Great for anyone just starting out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Sassack"
},
"reviewBody": "Hands down. This is the ONLY way to make this roast. This is the best recipe. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I cook it this way every time and it comes out perfect. Not only that but makes the place smell awesome! It disappears quick when served."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buffy"
},
"reviewBody": "I am having company and I am going to make this roast. I have made a beef tenderloin with these instructions and it is perfect. Just want to know if I need to remove the fat or that clear elastic skin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the only way to roast an Eye of The Round. Ive been doing it this way for years and years. 500 degrees then turn down to 475 when you open the door and roast for 6\" per pound. Turn off the oven and let it be for a couple of hours. It is a NEVER fail way. The internal temperature of the meat before you put it in the oven has a lot to do with how rare you like it I alway put it on a little rack when roasting but maybe that's not necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I cooked a full 9 lb eye of round. 45 minutes exactly at 500 degrees and then 1.5 hour at zero degrees without opening the oven door once through the whole process, and it came out PERFECT PERFECT PERFECT ! Thank You so much ♥️ This piece of meat had rare, medium, and well on the very ends. Something for everyone ! 😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The roast came out perfect. When I purchased the eye round, I made sure there was a \"fat cap\" on it. The fat cap does make a difference. Also made sure to slice it into thin slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a foolproof method that I've been using for years. This is a lean and tough cut of meat. For best results, the roast should be sliced very thin using an electric slicer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel"
},
"reviewBody": "Oh my gosh! This was so easy and so delicious. I actually left it in the hot oven for almost 3 1/2 hours before checking and it was good! Low and slow my friends! Best way to tenderize!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Wasson"
},
"reviewBody": "I'll be danged! It worked! In 1983 when I was 28 years old, I inherited an old house across the street built in 1910. I knew the 91-year-old lady who had lived there since the 20s. In the kitchen was a large 1937 Model B Chambers cook stove she had bought new. She told me that only doctor's wives usually could afford a Chambers cook stove. Other older people backed up her claim. When we moved into the house in 1985, I started cooking with the Chambers &amp; still use it today. It's the only stove I've ever touched or will touch. I bring this up because, back in the day, Chambers advertized flameless cooking. Heat up the stove, put your pots or pans of raw food inside and turn off the oven. The stove will do the rest. Today may have been the first time I've ever tried flameless cooking &amp; by golly, it worked like a charm. My 3.10 lb eye of round roast came out perfect! I bought a bottle of Gravy Master after reading about it in the comments. I believe I'll be buying more in the future. Thanks for the recipe! My wife kissed the cook!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I prefer the Americas Test Kitchen recipe for eye of round. It calls for salting well in advance (they say 18-24 hours, I say at least 24), searing, and then cooking at low temp (225*F). I skip the searing and cook at 225 until the meat reaches 115*, then turn off the oven for an hour and eventually continue cooking, if necessary, to 120*. The salt and time below 122*F internal temp cause some chemical/enzymatic action that tenderizes the meat. https://www.food.com/recipe/tender-eye-of-round-beef-roast-atk-465509"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This cooking method is the best way to make eye of round roasts. They are tender and perfectly med-rare. My families favorite way to have it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been cooking for 45 years. I thought I'd try something different. Maybe my tender roast would be even more tender? I do not understand the people rating this recipe. I followed this recipe to a T. My oven is a very good oven. My result was a tough piece of meat. The toughest I have ever made. Even though I paid $8.95 per lb. This was supposed to be the quality eye of round. This was awful. I am so mad. People must have teeth as sharp as a saw. I think this is a bunch of baloney. Another few people also had the same experience. I'm listening to them. No joke on me here. Terrible, terrible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Unfortunately, I did not have the same results as others who made this recipe and gave it 5 Stars. I followed the recipe to the T and, although at 145 degrees, it was just like my fiance would have loved it with the slight pinkish color, the meat was almost as tough as leather. I am just happy I did not try it when I had guests over for dinner. I will continue with my old recipes from now on. I thought I would try something different; however, it did not work well for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Robbins"
},
"reviewBody": "It’s an extremely easy recipe. The biggest thing is that you can’t open the oven. People who screw this up are doing just that or bought a Chuck roast which needs liquid. This recipe works best with the right cut: a lightly marbled or lean piece of meat. Follow the directions, use a meat thermometer and go read a book after you set a timer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Only recipe I use for beef roast. It is perfect everytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely the best way to cook an eye of round roast, hands down. Always a hit when I make it. Just season the way you like and give it a whirl. I use an electric oven and have always had a consistent end product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made many roasts. This is my favorite method. It didn't dry out at all. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jean"
},
"reviewBody": "Electric vs gas ovens - makes a HUGE difference. With Gas oven, I baked by 1.2 lb roast at 500deg for 10min, then at 195 deg for 50 min and let it rest -without opening oven door for 20min. Turned out great. I did add more spices, Minced garlic and minced onion, salt, Liq smoke, pepper - mixed in olive oil and rubbed this on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best way to cook an eye round. Turns out perfectly every single time. Pink in the middle. Sliced thin with mashed potatoes it's my families favorite meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Been making this for many years - found on this site way back llooking for something different for an eye roast. Simple and delicious. I rinse and pat dry the roast forist &amp; then roll around in a packet of french onion soup mix instead of salt &amp; pepper. Turns out perfect every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Internal temp was only 110 after following the directions. Maybe an improvement could be to leave oven on at 200 instead of turning it off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was juicy and Delicious!!!!! Such good flavor. And totally simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Rielley"
},
"reviewBody": "Fixed this for the family and it came out wonderful. It had a nice crust, tender and juicy in the middle, and seasoned perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best roast I have ever made! Entire family loved it and said I need to try others this way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Walter Mills"
},
"reviewBody": "Followed the recipe but after the amount of time the meat was not done. turned the oven back on for a half hour at 350 degrees and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Dacierno"
},
"reviewBody": "Still a little tough but very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gnx7wjcnj2"
},
"reviewBody": "So easy and perfectly cooked! I used salt, pepper and some steakhouse seasoning rubbed onto the outside. Our roast was about 1.5 pounds, so I cooked it for about 9 minutes before shutting it off and letting it stay in the hot oven for 2-2 ¼ hours while I made the mashed potatoes and asparagus to go with it. I will gladly use this method again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Donahue"
},
"reviewBody": "This absolutely is the best eye of round roast I have ever made! Roasting the roast in a high heat oven and then turning it down to 120 (the warm setting on my oven) worked ingeniously. Being able to let it sit down and grade papers while dinner was cooking with no further preparation was amazing! Thank you so much. Changes: I am in love with garlic so instead of salt, I used garlic salt, minced onion, and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Soltis"
},
"reviewBody": "Love this recipe and always cook prime rib roast and eye of the round!! Turns out phenomenal every time. Today I added additional seasoning, put olive oil in pan and on roast prior to seasoning. Added mushrooms and some red wine. Looking forward to the outcome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NY2OH98"
},
"reviewBody": "Had a 1.67 lb roast 10 mins at 500 degrees. One hour at 200. Next time take out at 45 mins. Cooked more towards medium. Had seasoned with garlic slivers, EVOO, garlic powder, coarse pepper. Made roast once before at 500, reduce to 450, cooked same approx roast for 10-12 mins. An hour and a half at shut 9ff oven, didn't open. Cooked perfect for medium rare, but cooler. Tonight's roast was excellent. Two of us are the whole dang thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Danko"
},
"reviewBody": "I really like this recipe. The only negative is that the roast was cold by the time the oven door opened. I worried that it wasn't cooked, but it was. It was just cold. I left it in the oven 2.5 hours as instructed. It was delicious, just cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eileen4jesus"
},
"reviewBody": "I made the roast and loved it. My question is why does it sit in the oven 2.5 hours? It was too cold for my liking so I reheated it which it still turned out very good though. Nice and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bird8rs"
},
"reviewBody": "I have used this recipe many times. It does work very well but giving it four stars because I do find sometimes it does come out tough. Depends on the roast. I did find a hack that made the best roast ever. I pound the roast a lot, all over. I then add some kosher salt to the outside of the roast and then I believe this is the key ingredient to a tender roast…. I set the roast on Saran Wrap rub it with a couple tablespoons of rice vinegar. I wrap it in the Saran Wrap over night. I also let it sit out to room temp before putting in the oven. It made the most tender eye of round I’ve ever had. So tender that the roast is hard when bought. It is actually squishy when you put it in the oven. The attached Picture showing the tenderness by squeezing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jim Maggio"
},
"reviewBody": "It didn’t quite work out. I followed the instructions as closely as possible but had to adjust for the weight of the roast at 2.1 pounds. Maybe it’s my cheap department store range because it came out at about 98°. The ends looked medium rare at the center was just too bloody. The texture was somewhere between not quite tender but not terribly tough either. I started the process over again with the 500° oven, So on and so forth for an additional 30 minutes and got it to a usable state. Maybe it’s the same as the old silk purse adage and I just have to pop for a better cut of beef next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Randolph"
},
"reviewBody": "This is the best bottom roast recipe ever! The only think I changed was what one of the comments said. Make it 5 minutes per pound instead of 7 if it's a bigger roast, and I turned the stove down as low as possible but not off. I wasn't sure about its heat retention capabilities. Came out perfectly medium and SO much better than ever before! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J. Dick"
},
"reviewBody": "I used garlic pepper, garlic salt, Italian seasoning and kosher salt and created a rub. Before applying rub I used garlic vinegar rubbed on meat then added seasoning. Followed the same temperature and times and it came out fantastic! Really surprised on the tenderness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Packers Fan"
},
"reviewBody": "Excellent, fool-proof recipe! I took the advice of another reviewer and made an au jus to use with sandwiches. I sliced the roast as thin as possible and served it with good hard rolls and a yummy horse radish aioli. It was a huge hit - THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Leipsic"
},
"reviewBody": "Easiest go to, never fail roast recipe that everyone loves. I make 1 every 2 weeks as my son loves it cold, sliced thin for sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taija Waters"
},
"reviewBody": "This is my go-to for eye of round. It's perfect every time. I love this cut of meat. I make it quite often. The family loves it too. Done enough for the kids, rare enough for me. I do only do 5 mins per pound instead of 7!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lrs610"
},
"reviewBody": "I used my own ingredients including Liptons onion soup mix , followed your directions for a 3 lb roast and couldn’t believe how tender and delicious it came out. Every time prior to this, my roast was tough and chewy and I would end up throwing it out. I highly recommend this recipe. You will be pleasantly surprised!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "palmev02"
},
"reviewBody": "I will absolutely be using this recipe for all of my roasts! I followed the recipe to a T, although skeptical about turning the oven totally off, and it came out perfectly! I’ve already shared this recipe to friends (my family is vegetarian, otherwise I’d share it to them too)! Every meat eater should have this recipe on hand. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "notgonnab"
},
"reviewBody": "Great recipe. Toss a 2.15 round roast into my cast iron skillet. Salted, peppered and Herbs de Provenced both sides and followed the rest of the recipe roasting the meat for 16 minutes. In 90 minutes, it was a perfect medium to medium-rare in the center and very tender. So much better than cooking the roast for hours and still having to chew through the grain on this kind of cut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jozifpromo"
},
"reviewBody": "Worked a treat! Used out GE electric oven with a small 1.94LB cut.\n7mins per LB @ 475 and then 15mins per LB @ 200. Turned the oven off and then let it sir for 1hr. Medium rare and tender! So happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "shortyswife"
},
"reviewBody": "By the end of the cooking period the roast was not up to the required temperature and the oven was cold when we opened the door. The roast shrank a lot and had a hard exterior. We put it back in the oven with the oven on 300 for ten minutes. It finally came up to the required temperature. When we carved it it was over cooked, by color. We should have gone ahead and eaten it when we first checked it. It had probably come up to temperature and was cooling off. Even though sliced thin, parts were tough. The center was the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "holly stoepker"
},
"reviewBody": "I have always used my mom‘s recipe, oregano, paprika, salt and pepper, and garlic powder, when making an eye of round roast. I was honestly skeptical of this recipe since it requires turning the oven off. ?? I decided to try it tonight, and oh my goodness! This is hands-down, in all of the years, (35+), of fixing this roast, with my mom‘s recipe, that it has ever come out this tender, easy to slice, and absolutely phenomenally delicious! I even picked in the oven with 40 minutes left, and thought I don’t see anything sizzling in there how can this be working, but I absolutely, five star, recommend this way of roasting, using whatever herbs and spices you prefer, it will come out amazing! Thank you so much for this, one of my now favorite recipes ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clamarca"
},
"reviewBody": "Just tried this recipe and it is AMAZING! Thank you so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenrn6073"
},
"reviewBody": "I seasoned the eye round with garlic, salt and oregano and wrapped it tightly in plastic. I put it in the fridge for 2 days and then cooked it using this tecnhnique. It came out perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbabin04"
},
"reviewBody": "I love this recipe I have made it at 5 times now and it hasn’t let me down yet! Anyone can walk into the kitchen and make this and have it turn out perfect. I do add more seasonings than just salt and pepper. I rub with olive oil and browning sauce and use thyme, garlic, onion powder, white pepper, fresh cracked pepper and a generous amount of kosher salt. It is so darn simple, I throw it in the oven at 2:30 in the afternoon and have an amazing dinner by 6! It really gives off the impression that you worked harder at this than you did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "We like our beef Medium Rare. I’ve made this recipe a dozen times. It took 5 times to get the cook times perfected. The original recipe calling for letting the beef sit in the hot oven for 2.5 hours will over cook it. My formula is 20 min warm up at 500, 7 min per pound at 475, 7 min per pound with the oven off and closed, rest out of the oven for 20 min. Medium rare every time on roasts in the 3-5 pound range."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "This is the easiest and most reliable recipe I have ever made. It takes a little time but there is literally no prep other than salt and pepper. This works every time.\nNo peeking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diane McMillan Frasier"
},
"reviewBody": "Did not cook"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Shideler"
},
"reviewBody": "I am the kind of guy that takes a recipe and just wings it with spices and amounts, which is exactly what I have done with this!\n\nIt is in the oven right now with about 2 hours to go before it comes out. I am posting two photos that show the seasoning I used (except for a rub of the meat with Beyond Bullion Beef).\nAnd on photo of the Eye Of Round (6.9 lbs) just before going in the oven!\nI will try to add the one going in the oven, since I can only post one pic here"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Onionista"
},
"reviewBody": "I liberally coated a 2.85 lb eye round roast with prefab prime rib seasoning, cooked it for 17 minutes at 500°, then turned the oven off and left it for 90 minutes. I took it out, and rested it for 20 minutes before slicing. It. Was. Perfect. Any longer in the oven, and it would have been overdone. I sliced it as thinly as I could by hand, and even though it had no fat cap, it was tender and juicy, and the flavor was amazing. Folks who go into this expecting an eye roast to have the tenderness of processed deli roast beef need to reset their expectations. This is real roast beef. It’s okay to have to chew your meat a little, people. The leftovers will make perfect French dip sandwiches. I can’t wait to do a larger roast for the whole fam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ejm6723"
},
"reviewBody": "So, after reading many of the reviews, I felt like the recipe creator got a lot of flack from gas oven users. I have a gas oven and I had no difficulty achieving the results I wanted which was medium rare to rare meat. I had a leftover piece from cooking a much bigger eye round with a recipe that was terrible, so I was working with only a pound. I sprayed on olive oil, and patted on salt and Montreal Steak Seasoning. I pre heated oven to 500, then cooked it at 475 for 7 minutes, then lowered oven to 175 (as other reviewers did) and started checking the temperature of the round after an hour, resulting in removing it from the oven at around 1:15, 1:30. Then I let it rest. Came out very red and juicy, albeit some pieces were a little chewy, but I find that most cuts are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda J Lehman"
},
"reviewBody": "Easy and works perfectly. 3 things will make it perfect as written.\n 1. Don't rush the 1 hour warm up on the counter. If you put it in the oven to early, it will not cook through and will be to raw. \n2. Season more than you think. More salt and pepper as it has to season the entire roast. \n3. Don't rush your 7 minutes per pound. If you have less that 3 pounds, say 2.8 pounds, use the full 7 minutes anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul J. Marasa"
},
"reviewBody": "I stick to the temp and time. I just recommend a seasoned salt—Whatever you prefer. I also have an electric meat slicer, so we get better-than-deli sandwich meat. A little good mustard or Mayo with horseradish on hearty bread—and maybe a slice of cheese—and it’s old-school goodness! Thanks for a never-fail recipe. (I’m doing yet another roast while typing this!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princess73099"
},
"reviewBody": "Easy &amp; delicious! Will definitely make this again. It will go into my \"favorites\" file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lndsblck"
},
"reviewBody": "This was really good. Mine turned out really well despite my inexperience. The other confounding factor was I had two small roasts that came together in a package and equaled 3.5 pounds. I didn’t have a roadmap for that in the recipe or the comments since each roast was 1.75 pounds and were in the same roast pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lynn Rosenberg"
},
"reviewBody": "I found the meat was still very tough and chewy. I sliced it very thin but it didn't help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "This is my go to roast beef! Melts in your mouth. I have made them larger than 3 lbs. And for just 2 of us I often do a 2lb roast...just do the math.\nThe best no fuss no fail roast!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "holly"
},
"reviewBody": "The perfect method for all cuts of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Caryann Wasylkiw"
},
"reviewBody": "I followed this recipe exactly and when I took the roast out it was practically raw. Never again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Barker"
},
"reviewBody": "Still pretty tough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank Monahan"
},
"reviewBody": "This works perfectly EVERY time! I have modified it a bit by browning the roast before putting it in oven, then sprinkling with a little baking soda just to give a little more char/crust on the outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Renz"
},
"reviewBody": "Only way to roast eye of the round. This is a favorite we use over and over"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Larson"
},
"reviewBody": "Easy to make and the roast turned out as described. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I was extremely skeptical of this method but gave it a try anyway...I've gotta say it came out perfect...my eye of round was 2.35 pounds so I did the math at 7 minutes a pound and rounded up to 17 minutes then kept the oven door closed for the required amount of time...pure delishness!!! Even Had enough drippings to make a little gravy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KitchenBoop"
},
"reviewBody": "This is the first review I have ever submitted after years on this site; but had to comment. SO impressed, this was absolutely delicious. For my 3.25 lb. roast, I did coat with salt, pepper, fresh thyme,mustard, olive oil and chopped garlic. Put in plastic bag in the fridge for 24 hours. Took out 30 minutes ahead. Fat side up, baked at 500 degrees for 22 minutes. (Smoke alarm went off at the end of the 500 degree portion; so next time I will open a window)! Anyway, followed advice I had seen online and left my gas oven on 200 degrees for the last 2.5 hours. Was concerned meat would be cold, but it wasn't. Meat came out perfect; plenty of au jus for gravy too. You made a believer out of me! Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "itkutch"
},
"reviewBody": "I've made this three times. The first time, it was a beautiful texture and color. The second two times, the meat was either overdone and tough or underdone and tough. The two fails were also tasteless and made for a mouthful of meat you wanted to spit out. I've got a pretty decent oven and a high end thermometer. I'm confident in my temps, times and All-Clad hardware. I think I'll retire this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Upsydaizie"
},
"reviewBody": "I was skeptical, but followed directions to a T. The only thing different is that my roast was only 2.34 lbs. I treated as is it were 2.25 for easier math, plus I was hoping for it to be much pinker inside. This only had a hint of pink. I’d say it turned out medium-well. But it was still so good! I sliced it super thin, like an 1/8th of an inch. I don’t think it was tender enough to slice it any thicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy123"
},
"reviewBody": "Made this just as the recipe said, and OMG so tender and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greta"
},
"reviewBody": "I was skeptical of this receipt but it was amazing. My son loved it. I used one reviewer’s suggestion of brushing gravy browning sauce on the outside of the roast and served with an au jus. We thinly sliced the leftovers and used them for lunch sandwiches and philly steak subs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JannG"
},
"reviewBody": "The roast was still very uncooked in the middle at the end of 2-1/2 hours. I turned the over to 350 and cooked for an additional 15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Nguyen"
},
"reviewBody": "First time making eye of round roast, came out delicious! Was moist and still pink inside throughout. Preheated the oven to 500° for 20 minutes, then I adjusted the temperature to 475° and baked the 3.8lb roast for 28mins (7minutes per lb), turned the oven off and I left the roast inside for 3.5hrs. Came out pink and moist! Superb! Used 1tsp salt, half teaspoon onion power, garlic powder, black pepper and cayenne pepper for the rub mixture and rubbed the roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "usmm01"
},
"reviewBody": "Did exactly what instructions said. Oven cooled completely in 1 hr. I had to turn the oven back on when I realized it was sitting in the oven cool. Leave in oven for 40mins, pull it out. Add broth and cover with foil. Place back in oven for 2.5hrs. Bullet proof."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Spztic01"
},
"reviewBody": "I followed the directions and the meat was not cooked really at all. New oven, so I know that's not the problem. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa miller"
},
"reviewBody": "Made this tonight 12/05/20 &amp; we are all raving about it! It came out so good! Heated our gas oven to 500°, added the 3 lbr rubbed with olive oil &amp; Montreal steak seasoning to a cast iron skillet. cooked for 21 min at 475° &amp; then lowered temp to 175° and cooked for 2 more hours. Came out amazing between R and MR &amp; used gravy with it .... so delicious!! Can't wait for game tomorrow to have it on rolls with the gravy, either as a sandwich or open face, can't decide because it will be great either way. absolutely amazing, thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitch"
},
"reviewBody": "Dinner tonight: Beef eye of round high heat roast. Seeds of change rice and mixed vegetables. \n\nIt really was delicious. Just added a little salt, pepper, water and flour to drippings for the gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Cash"
},
"reviewBody": "I have not made this BUT had it at a friends house for dinner last"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Laing Drader"
},
"reviewBody": "this was wonderful! I wrote it out for my husband to do, including the suggestion that we turn the temperature on again for the final 15 to 20 minutes. He surprised me with Yorkshire pudding, and he even made his own rub for the meat! The roast itself was beautifully pink inside, but still only luke warm. We had some of it that night and later had the family over and we sliced it thinly and heated it in the oven with gravy! DELICIOUS! Who says that you have to eat it the same night you cook it?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat Clarke Logan"
},
"reviewBody": "I always refer back to these roasting instructions. It comes out perfectly every single time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Morrison"
},
"reviewBody": "Oh my goodness! Fabulous. Beef turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenny"
},
"reviewBody": "Very good, both when served warm, and thinly sliced after wrapping and refrigerating for a day.\nI inserted some coarsely- sliced garlic cloves to the top of the roast, which adds to that deli-roast beef taste when served cold. Serve with horseradish sauce and a hearty bread or bun.\nI've also made it without the garlic and was pleased."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Howard"
},
"reviewBody": "The recipe by itself is very good, I really enjoyed it. Two things..1st I fully intended to to brush the roast with Browning sauce as the number one review suggests. I think that is a necessary step to make the roast look presentable, otherwise I would pan sear it after coming out of the oven. #2 I would have liked to have a target temperature to remove the roast. Something like remove the roast after 2 1/2 hours or when the internal temperature hits 140 degrees and let rest 10 min. Instructions like that would help. All in all the recipe was great and we will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "Easy recipe but it certainly did not come out as tender as I had hoped. It was done just right but was almost cold when I took it out of the oven. I followed the recipe as written. Not sure I will try it this way again. \nAny suggestions about how to tenderize the roast?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TGM"
},
"reviewBody": "Excellent! I have used this recipe twice and my roast turned out perfectly. No fuss start to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sid"
},
"reviewBody": "Wow. I never buy prime cuts because im a cheapskate. This thing turned out boss. 3 bucks a pound. I had to buy a 6 lb one although I didnt want that much. What a deal. Anywho i cut er into 3 pieces cuz it was so much beef. I tried to use the bathroom scale to weigh the cut pieces but it didnt go that low so I assumed 1/3 was roughly 2 lbs. I followed the recipe to a tee and made sandwiches. It was really tender. Not chewy at all. So happy. Anyways those people that wrote bad reviews probably screwed it up somehow. Idiots. Anyways im gonna reheat leftovers and have a roast beef dinner tomorrow with potatoes. Beauty."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/94113/high-temperature-eye-of-round-roast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
"name": "Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/94113/high-temperature-eye-of-round-roast/",
"name": "High Temperature Eye-of-Round Roast"
}
}
]
}
}
, "about": [
]
}
]