				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "High-Fiber, High-Protein Breakfast Bars"
,"datePublished": "2019-04-02T03:00:38.000-04:00"
,"dateModified": "2019-04-02T03:00:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SavedByGrace"
,"url": "https://www.allrecipes.com/cook/3816685"
}
]
,"description": "Ingredients such as wheat germ, flaxseed, protein powder, peanut butter and oats make these breakfast bars a healthy and tasty way to start the day."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DA0KSHlgIDlRQw3MQ-N7T_gPXh4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1003518-568b3157195e4e81bdbcd4be794cc833.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "High-Fiber, High-Protein Breakfast Bars"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "86"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "169 kcal"
,"carbohydrateContent": "21 g"
,"fiberContent": "4 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "148 mg"
,"sugarContent": "8 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"cooking spray",
"1.5 cups quick-cooking oats",
"0.25 cup wheat germ",
"0.25 cup ground flax seed",
"2 tablespoons vanilla-flavored hemp protein powder",
"1 teaspoon ground cinnamon",
"0.5 teaspoon salt",
"3 bananas",
"0.25 cup peanut butter (such as Jif®)",
"2 tablespoons honey",
"1 teaspoon vanilla extract",
"0.25 cup natural peanut butter, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C). Line an 8x8-inch baking dish with aluminum foil, letting foil hang down over the sides of the pan; spray pan with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Stir oats, wheat germ, flax seed, protein powder, cinnamon, and salt together in a bowl. Mash bananas in a separate large bowl and stir 1/4 cup Jif® peanut butter, honey, and vanilla extract into bananas, mixing well. Stir dry ingredients into banana mixture and spread into the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 20 minutes. Spread 1/4 cup natural peanut butter over top."
} ,{
"@type": "HowToStep"
,"text": "Continue baking until lightly browned on the edges and set, 10 more minutes. Let cool in the pan and lift bars onto a work surface using aluminum foil as handles. Cut into bars, wrap in plastic wrap, and store in refrigerator."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "This is a great grab and go breakfast or health afternoon snack. I made as directed, except doubled the flax because I did not have any wheat germ. I think this recipe lends itself to a multitude of varieties. I could see replacing the bananas with pureed pumpkin or applesauce, and swapping out any number of nut butters (almond, cashew, sunflower). Adding some dried fruit or nuts would be a nice textural addition as well. I think next time I will experiment with pureed pumpkin, almond butter, dried cranberries and some pumpkin pie spice to capture those warm fall flavors I am craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Schipperke Trainer"
},
"reviewBody": "I made this as written the first time and felt it could have used something like coconut oil to moisten them up a bit. Second time, I added more protein powder, more ripe bananas, chopped dark chocolate and chia seeds. I eliminated the natural peanut butter topping as I didn't feel like it added to the finished product. I'll keep tweaking to see if I can find something I really like. Hubby loved both batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane E"
},
"reviewBody": "I make this every week now. My Husband loves them. They are a great healthy snack to keep you going when you don’t have time to eat or don’t want to eat junk. The only change I made is I bake it on 180 Not 190 and I added some pitted dates sliced up just to sweeten it a bit. I also couldnt find Whey powder but used Oat Bran instead. Scrumptious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Cahoon"
},
"reviewBody": "I will make this again, for sure. I used almond butter and peanut butter and skipped the step of spreading the peanut butter on top - I just added it to the mixture instead and it turned out great. I could not find wheat germ so I doubled the flax instead. Also, I added some unsweetened coconut. I don't think it's necessary to add the honey because the bananas add so much sweetness - that's a personal preference though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Pax"
},
"reviewBody": "Thank you so much! These are delicious treats! Baked them in a muffin tin because its all I had for 11 minutes. Made my own topping out of peanut butter, Greek yogurt, and a touch of maple syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susana Bustillo Rizkalla"
},
"reviewBody": "Excellent recipe! My family and I love the bars and I make them regularly. Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenB98"
},
"reviewBody": "I have made this 5 times now! My husband and I love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaydee"
},
"reviewBody": "kid aproved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ThatOneLegendaryGeek :3 (Isaia"
},
"reviewBody": "The recipe is good ,except the hemp protien powder and the peanut butter ,since I'm allergic to hemp and Peanut butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoraK"
},
"reviewBody": "I make these and store individually wrapped in the freezer. On mornings when I work out and am short on time I get one out and take it to work and eat with my morning coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "Easy and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "barbd"
},
"reviewBody": "Made exactly as recipe stated even using the 375 degree oven. They turned out great. I could use a little less sweetness (which is why only 4 stars( so will try to reduce honey next time. Would also like to reduce banana flavor so will try combination of banana and applesauce (unsweetened of course)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vickypantherbaker"
},
"reviewBody": "I used steel cut oats but soaked them in equal amount of almond milk. I also substituted the wheat germ and flax seeds for chia seeds and coconut flour. I also used half a cup of apple sauce instead of bananas. In essence, I used ingredients that I had at home instead of buying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber York"
},
"reviewBody": "I make these bars for a quick breakfast or pick me up to eat during the day. They're easy to make and perfect for my busy family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ginjuh"
},
"reviewBody": "These are so tasty, and they keep you full for hours. I’m grateful this recipe was shared."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Mitchell"
},
"reviewBody": "I put mini chocolate chips on top and melted them instead of peanut butter. I am so excited to have this on the go for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madison Sams"
},
"reviewBody": "As far as my mods, I used JIF Natural both in and on top of the bars. Also, I thought I didn't have flaxseed so I used chia seeds, which added a fun complimentary flavor to the banana. The bars cooked just like the recipe said and if anything, the longer they were in the fridge the better they tasted! Great for the work week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Johnson"
},
"reviewBody": "these energy bars are delicious, healthy and so economical. I prefer my energy bars moist and a little sweet so I used 3 bananas, 1/4 cup of applesauce and extra honey to my taste. My family doesn't realize how healthy they are. I will definitely make them again. Thank you for the recipe Savedbygrace."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hikerperson"
},
"reviewBody": "These are delicious and just what I was looking for. I have been getting sooooo tired of eating protein bars in my car or at my desk for breakfast. Anyway, these are delicious, low fat and nutritious. I added about 1/4 cup of raw sugar to the dry mix and added an extra scoop of protein powder to beef up the protein content. They came out perfect and delicious. Let them cool fully before packaging them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delish"
},
"reviewBody": "The bars were delicious and very moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Kinda bland but I think if you add some coconut and dried fruit, it would be delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "muelmen"
},
"reviewBody": "My husband really liked these, I though they were okay. I will make these again but maybe add some raisins or a few chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nicole Bodea"
},
"reviewBody": "I followed the recipe exactly. I couldn't really eat more than 2 as the taste seemed sour to me. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorann Terry"
},
"reviewBody": "I've made these 3 times. First exactly as written, twice modified. I prefer it modified. I have a friend with a peanut allergy so I replaced the peanut butter with an egg. I also did as the creator suggested &amp; went with two bananas &amp; applesauce. Once I added dried cranberries &amp; the next time I added a cup of frozen blueberries. The dried cranberries were good, but the frozen blueberries were YUM. Since blueberries are a superfood this will be the way I prepare them from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Oldani"
},
"reviewBody": "I've been making a double batch of these bars weekly, which makes for a great grab-and-go breakfast as well as an easy afternoon snack. This recipe is great as is, but is also flexible if you like to experiment. I like to swap out the bananas with unsweetened applesauce (1/4 cup per banana) and add some dried cranberries to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KellyC"
},
"reviewBody": "These are good and pretty easy. I used almond butter instead of peanut butter and added an egg for extra protein. I didn't add the additional peanut butter on top after baking. I was looking for a healthy morning meal substitute because I don't eat breakfast. This is good with morning coffee. My husband didn't care for them -- too healthy. Haha. I'll make them again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "My hubby liked these! I used chia seeds instead of flax seeds, and I used my vanilla protien + daily veggie powerd ~ which turned them a little green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrish"
},
"reviewBody": "This is a super filling, dense lo carb bar with a lightly sweet banana taste. Super healthy and versatile! A success the first time around. I added walnuts which made it even better. So easy to make.... I am hoping to use this recipe to keep me from munching on other less healthy fare since it is so filling.\nThank you grace!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Griffin"
},
"reviewBody": "These are really good! I baked at 350 as suggested and baked an extra couple of minutes at the end. I didn't have quick oats so I used traditional rolled oats and processed them for a few pulses in the food processor which worked out great. I happened to have peanut butter flavored protein powder so I used that - very peanut buttery yummy! I used parchment paper so I didn't have to grease the pan or foil at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "A bit of a different flavor than many bar recipes (I'd never used hemp protein before), and I love it. These bars are moist, and have a perfectly subtle sweetness. My hemp protein was unflavored, so I just doubled the cinnamon and tripled the vanilla as another reviewer had done. I also subbed one banana with 1/4 cup unsweetened applesauce, as mentioned by the recipe creator. I'll definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brachelsuzanne"
},
"reviewBody": "Great recipe. I added chia, raisins, mini chocolate chips and slivered almonds. I made a bigger batch, baked at 350 and they are perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Heather MacLean"
},
"reviewBody": "Didn't like them at all. Weird taste, I think it is the wheat germ. Won't make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Zeller-Smith"
},
"reviewBody": "This bar was fabulous! I always like to do the recipe as is the first time then decide if I would change anything. I did add craisens. ( I hope that doesn't count ) I think it is definitely a step recipe that you can make your own. Add nuts, any kind of dry fruit or chocolate chips. I was thinking next time I'd use dry apricots. I didn't have a problem with the 375 degree cooking though as some did. That is what cooking is, taking a recipe and making it your own. Don't expect a crisp bar, this is more like a dence cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Myers"
},
"reviewBody": "I make a double batch because of the pan I use but add 4 cups of oat meal, a full cup of wheat germ and flaxseed and extra protein powder. I do not add the peanut butter on top. Tonight I used chocolate flavored protein powder and Nutella instead of peanut butter and they turned out delicious. I also bake at 350 degrees but absolutely love making these for a healthy snack. It is very filling. I also use 2 cups of unsweetened applesauce with 4 bananas instead of 6 since I double the recipe. I tip for smashing the bananas, I put them in a zip lock bag and smash them. Much easier and cleaner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ehowden"
},
"reviewBody": "We found these very bland. I think they would be fantastic with Nutella on top instead of peanut butter, so I am going to try this recipe again. Maybe I'll experiment with putting nuts or seeds in them as well, since the interior of the bar didn't have anything interesting texturally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goodmaker"
},
"reviewBody": "This reminds me of a baked oatmeal. I subbed the extra flax for the wheat bc that's what I had on hand and love experimenting with baked gluten free fare (that tastes good...) I served it with a dollop of vanilla yogurt and some chopped strawberries and bananas as a breakfast pudding. As a bar, it would be good but I would up the sweetness factor. This is easily and inexpensively made organic/non-gmo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Kruze"
},
"reviewBody": "These are so good and filling. Not too sweet and have a good balance of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Omnomnom"
},
"reviewBody": "Love these, new staple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elizabeth Moser"
},
"reviewBody": "Not sweet enough, didn't like the consistency, and too banana tasting for me. Wouldn't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARENHOWE"
},
"reviewBody": "Tasty and very filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathleen Ann"
},
"reviewBody": "Love! I think this recipe can be versatile because of all the bananas! I plan on substituting apple sauce, egg whites, pumpkin; other nut butters for the peanut butter and molasses instead of honey. \n\nI already played with it:\nwheat bran instead of the wheat germ\nsplit the 1 tsp cinnamon into:\n1/4 tsp cinnamon, nutmeg, crushed clove, ginger\nreplaced 1 banana with pumpkin. \nadded 1/2 cup Splenda\n\nSo good!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maria r s"
},
"reviewBody": "amazing recipe!!!! I've been looking for something healthy for my kids lunch box, and snacks. I stumbled soon this recipe, and made a double batch to use up the old bananas I had on my counter. I also used flax, hemp seeds, and chia.....what I had on hand, and I added a single serving bag of trailmix(fruit /nuts) chopped up. I let them cool, and cut into bars. I wrapped individual in little baggies, and put in the fridge. when my boys cane home from school, they each ate one, and begged for more. they said it tasted like really good banana bread!! :)) now my 2nd double batch is baking as I type. this time I subbed some granola for fun, and I was able to clear out all the frozen bananas from the freezer:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrsricher"
},
"reviewBody": "Made it exactly as described just added some chia seeds. Great mid afternoon aback before the gym!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnaMM"
},
"reviewBody": "Have made these 3 or 4 times now and love them. An easy, versatile, and healthy recipe. I do brewers yeast in place of the protein powder (b/c at the moment I'm a breastfeeding mom and trying to find more ways to sneak the stuff into my diet for my milk supply) and have added dried coconut and chocolate chips too. They're tasty, not too sweet, and very satisfying. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jj"
},
"reviewBody": "Made this twice, once with 1/2 almond butter and 1/2 peanut butter. Both were very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Diane Walker"
},
"reviewBody": "We are eating them but we won't make again. Not very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msteetee"
},
"reviewBody": "Just made these and the bars were really good! I used a 9x9 pan and cut into 8 bars. I didn't have any wheat germ, so I just used flax seed and chia seeds. This is a really flexible recipe and I can experiment with lots of flavors. I can't wait to try more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BrewCrew"
},
"reviewBody": "My husband really likes these. Good way to get more fiber. I did use mocha cappuccino flavored hazelnut spread on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "angie-b"
},
"reviewBody": "just ok. a little bland and dense for me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AudreyP"
},
"reviewBody": "YUMMY dense and very filling. I loved these bars and felt full from 8:00 - 1:00 in the afternoon. I added more flaxseeds and I use whole flax instead of the ground because I like the nutty flavor it adds. I am making this for the 2nd time and LOVE it for weekday breakfast on the go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ms match"
},
"reviewBody": "not very flavorful but at least the ingredients are better than a south beach meal bar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolynsd"
},
"reviewBody": "Thanks so much for this recipe--we love it! From the ingredients I was pretty confident it would be a hit, so I doubled it the first time out and baked in a 13x9 glass dish lined with foil as recipe recommends. I baked at 350 for 30 min, then another 10 for the peanut butter topping. Perfect! The changes I made were to use multi grain oatmeal type cereal, not the quick oats; natural peanut butter, no salt, agave nectar instead of sugar, and I used a blend of hemp hearts, milled flax seeds, and chia seeds instead of flax and wheat germ. I just cut them up and put in plastic bags in the fridge so they're easy to grab and go. One Note: don't be afraid of the peanut butter topping--it just cooks into the bars and isn't messy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sands129"
},
"reviewBody": "Great recipe! A hit with my daughter....perfect mid-morning snack between classes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kadobson"
},
"reviewBody": "I just made this last night. I took advice from some other reviews and set the temperature at 350, used more flaxseed, and used chocolate peanut butter in the mixture. I had one this morning and loved it! I can't wait to make the next batch. Oh and I used raw honey to add a bit more nutritional value."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sydney6681"
},
"reviewBody": "These are just great. I didn't have protein powder so I used some dry milk and added a bit more vanilla, also used natural peanut butter throughout. They have just the right sweetness, hold together well and are very satisfying! I'm going to try adding some chopped nuts or dry fruit next time. I also want to try Nutella. Mmmmmm, Nutella..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "photorn"
},
"reviewBody": "I made these today and my 18 year old son and picky husband really liked these. I followed the suggestions of using 2 bananas and 1/2 cup applesauce. I also used 1/2 cup flax seeds and no wheat germ. I doubled the cinnamon and added a couple table spoons of chia seeds. I also did not add the peanut butter on top because I was afraid they would be messy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scully"
},
"reviewBody": "I'd been looking for a recipe that included most/all of the healthy ingredients listed in this recipe. I couldn't find anything other than granola which usually has oil, syrup, and brown sugar in them. These bars are perfect for me. Really good taste, filling and healthy and just enough natural sweetness from the bananas and honey. I'm sure I'll be making these frequently. Thanks for submitting, SavedByGrace."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xfiles1992"
},
"reviewBody": "Nice, healthy protein bars. These really only make 9 in an 8x8pan. Love my bars moist, so I use extra huge banana's.\nI use a 50/50 combo of Regular oats and Steel cut. \nI have used a pre-done Flaxseed mix with dried fruit in it, which I got at Whole Foods. \nI only use local honey, so that it helps with my allergies. \nI've doubled the ground cinnamon and tripled the Vanilla extract as I could not find Hemp with Vanilla in it. \nI'm not a Peanut Butter fan at all, but have found that these protein bars are okay with it. \nThe next time I do a batch I am going to substitute the PB with Apple Butter instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott M."
},
"reviewBody": "I make these regularly now and take them for a mid-morning snack at work. One batch I substituted applesauce for banana, and another batch I added a tsp. of cocoa powder. I think the original recipe is the best. Each batch I've used standard rolled oats instead of the quick-cooking oats, and I think the bars have been fine. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D McD"
},
"reviewBody": "Yum! Just made these and the family is sampling. They really are tastey and so easy and I always have these ingredients on hand! One exception.....didn't have quick cook oats so used extra thick whole grain rolled oats and the recipe turned out great! I also sprinkled about 1/4 cup of mini chocolate chips on when I spread the peanut butter on top. This will be a repeater!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Vallejos"
},
"reviewBody": "I love that this recipe is pure protein, fiber, and energy, with no added sugar. The banana &amp; honey give it a slight sweetness, and my only cheat was to use Skippy dark chocolate peanut butter. As suggested, I used a combination of bananas and applesauce, more flax seeds, and even used freshly ground peanut butter from Sprouts for the top layer. Compared to a store-bought protein bar, I admit that I like that the store bought is covered in a layer of chocolate (which I should be avoiding anyway). Besides from that, this is SO MUCH cheaper and it feels good to be eating a home-made bar without the commercial additives. I needed something to help me achieve a healthy, active lifestyle without costing a lot of money. Now these have replaced store-bought protein bars as my pre or post-workout snack! It is powerful fuel, satisfying, and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "deendog"
},
"reviewBody": "Good recipe. I double the recipe and make it in a 13 x 8 pan. I also add melted chocolate chips to the peanut butter you put on top and its delicious. Great, filling snack to go"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "None of my kids cared for them. Will keep looking for a healthy and delicious bar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoBadgers"
},
"reviewBody": "My son wanted a healthier granola bar to take back with him to college for a quick breakfast or snack. Most recipes have a lot of sugar so this was perfect! Plus we both liked that this was made with flax. Very easy to make. I now send these back to school with him instead of chocolate chip cookies. Thank you SavedByGrace for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Erhardt"
},
"reviewBody": "I made this recipe and both my kids and I loved them! I made it with a chocolate flavoured protein powder, but it wasn't very chocolaty. We take these with us to swimming lessons and have them in the car for a boost just before swimming. They are very very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SavedByGrace"
},
"reviewBody": "A few notes from the creator of this recipe: \n\n1) Bake temp should be 350 degrees F.\n2) I now use 1/2 cup flaxseed for gluten free. \n3) Sometimes I use 2 bananas and 1/4 cup applesauce for a little lighter texture. \n4) This recipe makes 6-9 bars, but definitely not 12 if you like to feel full when you eat breakfast! :)\n\nThese are also really yummy if you use almond butter in the batter instead of peanut butter!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/231925/high-fiber-high-protein-breakfast-bars/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/231925/high-fiber-high-protein-breakfast-bars/",
"name": "High-Fiber, High-Protein Breakfast Bars"
}
}
]
}
}
, "about": [
]
}
]