				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Four Cheese Ravioli"
,"datePublished": "2019-04-03T23:48:32.000-04:00"
,"dateModified": "2023-03-08T12:00:00.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Callie1025"
,"url": "https://www.allrecipes.com/cook/2390465"
}
]
,"description": "This ravioli recipe features a deliciously cheesy filling made with ricotta, mozzarella, and provolone, plus a homemade pesto cream sauce for serving."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/--_ovGNIx_wMBazgLnSeSnhhdXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8896331-homemade-four-cheese-ravioli-Carsons-Mommy-1x1-1-fff83fd883c343cc8f5f962b7af37728.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6237509091001",
"description": "Great homemade Italian ravioli recipe that I have recreated to taste like the ravioli at Maggiano's restaurant. Don't be intimidated by the large list of ingredients, it is well worth it!",
"duration": "PT1M54S",
"name": "How to Make Homemade Four Cheese Ravioli",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/04/21/8896331_original-2000.jpg",
"uploadDate": "2022-05-17T15:43:11.688-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Four Cheese Ravioli"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "213"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "1270 kcal"
,"carbohydrateContent": "80 g"
,"cholesterolContent": "407 mg"
,"fiberContent": "7 g"
,"proteinContent": "38 g"
,"saturatedFatContent": "47 g"
,"sodiumContent": "1359 mg"
,"sugarContent": "16 g"
,"fatContent": "89 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
, "recipeCategory": ["Pasta"]
,"recipeCuisine": ["Italian"]
,"recipeIngredient": [
"2 cups all-purpose flour",
"1 pinch salt",
"2 eggs",
"1.5 tablespoons water",
"1 teaspoon olive oil",
"1 (8 ounce) container ricotta cheese",
"1 (4 ounce) package cream cheese, softened",
"0.5 cup shredded mozzarella cheese",
"0.5 cup shredded provolone cheese",
"1 egg",
"1.5 teaspoons dried parsley",
"2 tablespoons olive oil",
"2 cloves garlic, crushed",
"3 tablespoons prepared basil pesto sauce",
"2 cups heavy cream",
"0.25 cup grated Parmesan cheese",
"1 (24 ounce) jar marinara sauce",
"1 egg",
"1 tablespoon water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mound flour and salt together on a work surface and form a well. Beat eggs, water, and olive oil in a bowl. Pour 1/2 of the egg mixture into the well. Begin mixing egg and flour with one hand; use your other hand to keep the flour mound steady. Add remaining egg mixture and knead to form a dough."
} ,{
"@type": "HowToStep"
,"text": "Knead dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "While the dough is resting, prepare the ravioli filling: Mix ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley until well combined. Set the filling aside."
} ,{
"@type": "HowToStep"
,"text": "Heat 2 tablespoons of olive oil in a skillet over medium heat. Stir in crushed garlic and pesto sauce and cook for one minute. Stir in heavy cream; increase the heat to high and bring to a boil. Reduce the heat and simmer for 5 minutes. Whisk in Parmesan cheese until melted. Remove the pan from the heat and keep warm."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, warm marinara sauce over medium-low heat in a separate saucepan."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Beat egg and 1 tablespoon of water together in a small bowl to make the egg wash."
} ,{
"@type": "HowToStep"
,"text": "Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop cheese filling in 1-teaspoon portions onto the dough, 1-inch apart."
} ,{
"@type": "HowToStep"
,"text": "Cover the filling with the top sheet of pasta; use your fingers to press around each portion of filling, making the seal as airtight as possible. Cut out individual ravioli with a knife or pizza cutter. Use your fingers to seal the edges."
} ,{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well."
} ,{
"@type": "HowToStep"
,"text": "Grease a baking sheet. Place the cooked ravioli on the baking sheet and bake in the preheated oven until brown, about 4 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/--_ovGNIx_wMBazgLnSeSnhhdXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8896331-homemade-four-cheese-ravioli-Carsons-Mommy-1x1-1-fff83fd883c343cc8f5f962b7af37728.jpg"
}
]
,"text": "To serve, divide ravioli between four warmed serving bowls. Drizzle marinara sauce on top, followed by cream sauce."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I'm sorry, but this entirely too much work , but also just not a good product. The dough needed more water, The cream sauce is bland, the use of two sauces is excessive, and everything here requires a bit too much mess. I also doubt this recipe can make 20 raviolis, I used every piece of dough and got maybe 16, but even there it's not a pleasant process or end result. I know a lot of people seem to think it's a skill issue, and it kind of is, but the recipe is written in a complicated way that creates skill issues, where I question if anyone who hasn't created ravioli before can execute this recipe. Honestly this recipe makes it unlikely for me to try more from allrecipes, it was that bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have never made homade pasta or ravioli before and I was very tastiest! Just make sure you roll out the dough thin enough my ravioli was really thick, so even if you think it's thin enough roll it out a bit more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angiehorning88"
},
"reviewBody": "Dough- Turned out perfect, easy to work with. Filling- Very good. Next time I might add some ground nutmeg. Cream sauce- Very good also. My execution was a bit different. When I googled pics of Maggiano's, it looked like the dish was placed in a salamander to brown up a bit. So I did not put the bare ravioli in the oven. Instead a spread a small amount of the cream sauce of the bottom of an oven proof dish. Then added the raviolli, poured cream sauce over the top, added a ribbon of red sauce, sprinkled some parm on top. Placed on top rack in a 450 degree oven until it was bubbling and just starting to brown. Yum! The proportions were also very good. Everything came together nicely. Thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Newman"
},
"reviewBody": "For my first time making homemade ravioli it took very long to make everything. I added cooked shrimp to the filling and it was delicious. It will be along time before I make this again. I say leave it to the professionals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nina Greipel"
},
"reviewBody": "basic recipe of the cheese filling was fine, though I added some more dried herbs, julienned green onions and a pinch of cayenne to give it some heat. The dough itself was a bit dry as well, I added another egg yolk (gave the egg whites to my cat) and another drizzle of olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne Beilfuss"
},
"reviewBody": "The basic recipe was good but I added a bit of lemon zest and some lemon juice to the cheese filling. I make my dough gluten-free so I have to add xanthum gum for the elasticity. I also use the egg white wash to help seal my dough together. This is the same recipe for the dough that I use when I make crab Rangoon, fettuccine noodles and oriental dumplings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeNorissa"
},
"reviewBody": "Loved this recipe! Very tasty and all of my guests enjoyed it! I paired it with homemade garlic butter toast, salad, and Pinot Grigio. Finished off with guest choice of Black Out chocolate cake and/or Strawberry Cheese cake ?? Will definitely cook this again. \n\n (SN: I switch some of the cheeses in the ravioli to Bourison and Asiago and cut the ricotta in half. With the marinara sauce I added shredded Habanero Cheddar cheese.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "C. Hinkson"
},
"reviewBody": "Made dough recipe as described and weighed ingredients. As others have pointed out, this dough is dry. I assume that's why this recipe uses the addition of water, but in my case, it wasn't enough. I did get a serving of about 7 ravioli out of this dough after resting and splitting but decided to toss most of it and start the next day with a more familiar recipe (1 egg per hundred grams flour. No water).\n\nThe actual pasta did have a decent texture and flavor but was not a pleasure to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Philip"
},
"reviewBody": "I really enjoyed this recipe and it turned out perfectly with a slight tweak to the dough recipe. Typically when I make pasta it's a 1 egg to 2 cup flower ratio. This was surprisingly a 2:2 ratio which was a crumbly mess I had to add 1 more egg to make it work. I also had a LOT of filling left over as well. I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "I gave it a 3 because the ingredients for the dough was just not right. There was not enough moisture, between the eggs and teaspoon of water, to form dough. I ended up using another dough recipe. The 3 is because the dough is a large part of this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sabrina Johnson"
},
"reviewBody": "Do NOT make this recipe...the dough was still too dry even after doubling the wet ingredients...and even after tripling and getting it usable it was ungodly tough and nearly impossible to work with. And after all that, I had way too much filling. I ended up mixing the extra into some mariana sauce and it saved the meal. I couldn't be bothered to make the pesto stuff, I was so exhausted from working the dough and it's unnecessary anyways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonic Hedgehog"
},
"reviewBody": "Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Izumi Ninensei"
},
"reviewBody": "My husband said he liked it. I wasn’t happy with the thickness of the raviolis, but this was also my first time making raviolis. They were a bit chewy. I followed recipe exactly and we liked the sauces and filling. The filling was WAY too much. You can make like 1/2 of it and probably still have too much. I think next time, if there is a next time, I’ll look for a different from-scratch ravioli recipe, and buy the proper cooking equipment to thin it out more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kosar Savoji"
},
"reviewBody": "It tastes amazing expect it took 4-5 hours instead of the 2 to make 6 servings. Spreading the dough was the hardest and longest part. And the ingredients don’t add up and the steps are impossible to follow directly. But overall it tastes amazing. So I think it was worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson's Mommy"
},
"reviewBody": "Another family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Coscarella"
},
"reviewBody": "This is a delicious recipe even for a beginner to try. I had to use a couple additional teaspoons of water in the dough. It made sixteen large raviolis."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Matt Haan"
},
"reviewBody": "So I also messed up the making of the ravioli and almost threw it out until my wife calmed me down and I read the review about not needing to seal dough. Cooked it looked like tasted amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina Sharer"
},
"reviewBody": "I love this Recipe! I made the meat spinach ones as well and with the lefts overs I made lasagna with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Pamela Washburn"
},
"reviewBody": "As written, this dough recipe does not work. You need 3 eggs for 2 cups of flour. That amount of dough will not make enough ravioli for the cheese filling in this recipe. \nThe alfredo sauce was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Shumaker"
},
"reviewBody": "Great recipe.\nI made my own filling of ground beef and cheese. I also made my own cream sauce instead of using the recipe. Basically the only thing I used the recipe for was the pasta itself. I rolled the pasta too thick so it was a little tough, but I will definitely make it again!!!\nLoved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ariel"
},
"reviewBody": "I could NOT get the dough to form I tried it twice and it kept ripping and would not form into a dough ball no matter how hard I tried. I followed instructions to a tee so I’m not sure what went wrong. It was probably my fault but I’m just disappointed I wasted so much stuff trying to make this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gingerly Quiet"
},
"reviewBody": "It was great; I actually added shredded chicken with the cheese mixture and added a teaspoon of fresh rosemary. It is absolutely delicious. Definitely a hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Aml Hareb"
},
"reviewBody": "I made it, it came out a bit tough, I don’t know what I did wrong but Will definitely do it again until I make it perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Lee"
},
"reviewBody": "Wow, this is delicious! I replaced the provolone with extra cream cheese and added a quarter cup of parmesan. Pasta was a gorgeous color and perfect texture. Filling was excellent, but too much for the quantity of pasta. Double the pasta recipe. First time making ravioli, but won't be the last!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Xavier Galvan"
},
"reviewBody": "Okay I have made pasta before and this recipe tells me to boil, bake, then serve!? I don’t fully agree with this. If you are wanting to get a brown color I would bake my ravioli first to acquire the color you are looking for then boil and serve ( obviously drain)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "chelseagrace77"
},
"reviewBody": "This recipe for dough is absolutely terrible, we made it two times exactly according to instructions and it was unusable. Couldn’t even proceed. Do not use this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe for dough is absolutely terrible, we made it two times exactly according to instructions and it was unusable. Couldn’t even proceed. Do not use this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evander"
},
"reviewBody": "I had to add a little more water and olive oil to the dough and it took me a while to roll it thin enough. I didn't bake them and we just ate them with the pesto sauce- so good!!! I will make this again! It's the first time I attempted to make my own pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Leblanc"
},
"reviewBody": "This recipe is a household favorite. It came out perfectly. The sauce is one of my favorite recipes ever. On a lazy day I use store bought ravioli with the delicious pesto sauce and marinara and grilled chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Denise Biundo"
},
"reviewBody": "The pasta recipe is not good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ben Stanton"
},
"reviewBody": "I used a different pasta recipe (2 cups of flour, 3 eggs, one yolk), same as I use for any other pasta dish, and this turned out great. I also used regular red sauce from a jar. The only places I went wrong were a) not filling the ravioli anywhere remotely close to enough (user error), and b) not rolling out the pasta dough thin enough. I went to six on my pasta machine, about the same as I would go to for fettuccine, I go to five for lasagna and seven for spaghetti. What I didn't take into account was that the dough is double thickness in many places. I would definitely roll out the pasta much thinner next time. Also, I cooked mine for five minutes and even with the tick pasta they were nicely al dente, so only cook for ~3-4 mins regularly. Overall, really nice recipe that is a great baseline to modify and make your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tamye Jean Moisan"
},
"reviewBody": "Wonderful recipe and super tasty! Only problem is I can't seem to get the dough thin enough for the ravioli to not be 99% dough without a pasta roller. \nI will be getting one eventually but I really thought this would be useable without one. Otherwise a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "It was ok. The dough was hard to knead and didnt turn out well, taste was bland. Sauces and filling were great. The cheeses had lots of flavor and the 2 sauces complemented it very well. This also took 3 hrs to make not 2 because of the dough. I'd use a different dough recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyson Hull"
},
"reviewBody": "This is my me and my wife's favorite pasta dish! Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Pinkham"
},
"reviewBody": "My first time making home made pasta and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "Dough was very dry making it difficult to roll thin. The finished dough was tough. The taste was okay but needed more seasoning (basil, oregano, etc)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Wood"
},
"reviewBody": "ok so i never review but this one i had to!!! you definitely need a machine for this one... but altogether? it was amazing!! i did have to add more water but that was because my eggs were rather small... this is where measurements would be nice. thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "First time making pasta from scratch. Did everything by hand and this turned out really well. Anyone double this? Don’t want to mess it up but we need more for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelissaGG"
},
"reviewBody": "Excellent recipe! I have a mini-ravioli tray and roller to make them for my grandson and a pierogi cutter I used for my husband and myself. This was the best I’ve made so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kiara Neely"
},
"reviewBody": "I made a different kind of filling and only used tomato sauce but it was delicious. I definitely should’ve let it boil longer because 8 minutes wasn’t enough. I also added italian seasoning to the flour and salt so it had some flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette Rodriguez"
},
"reviewBody": "Added an extra egg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeremiah Hinton"
},
"reviewBody": "Ravioli dough needs to be a little thicker than paper , the cream sauce delightful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hansonjmh"
},
"reviewBody": "Fabulous!!! Absolutely fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tpatzalek"
},
"reviewBody": "The family raved over these. I added cooked spinach to the cheese mixture for add variety. This was well received as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent! I made it with homemade Gluten Free flour (IiF recipe). Added a few more drops of water and used my pasta maker to roll out to setting #4. I probably should have taken one extra setting but I was afraid the GF flour would collapse. Left in boiling water for about 11 minutes. My raviolis came out large but that is how they were served in Rome, when I was there. They turned out so so good. I doubled the pesto amount and it was perfect. The dough was not enough for the amount of filling though. It takes a long time, but so worth it. Recruit helpers...hubby, or kids...everyone gets engaged and they love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LtnLadyinBoca"
},
"reviewBody": "Excellent! I made it with homemade Gluten Free flour (IiF recipe). Added a few more drops of water and used my pasta maker to roll out to setting #4. I probably should have taken one extra setting but I was afraid the GF flour would collapse. Left in boiling water for about 11 minutes. My raviolis came out large but that is how they were served in Rome, when I was there. They turned out so so good. I doubled the pesto amount and it was perfect. The dough was not enough for the amount of filling though. It takes a long time, but so worth it. Recruit helpers...hubby, or kids...everyone gets engaged and they love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sosjan"
},
"reviewBody": "Can use wonton wrappers for the pasta but making your own is so much fun! Taste is fantastic. Cheese ravioli is delicate and yummy. Fantastic recipe but takes time. Shortcut can be the wonton wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dlTPoductions"
},
"reviewBody": "Very good dough recipe. Next time I will roll the dough thinner and also leave the ravioli in the water a bit longer than they suggest. I changed the filling and used cotija (a dry strong Mexican cheese that I like) instead of ricotta. I liked the flavor I ended up with very much. Will continue experimenting with this recipe for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alex"
},
"reviewBody": "I only used the sauce and filling — pasta recipe from somewhere else. Both turned out great! The sauce was delicious with some marinara, and the filling was definitely super cheesy and held together well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie Mae"
},
"reviewBody": "First time ever making Ravioli and this pasta recipe was PERFECT! I used white spelt flour as I am gluten intolerant and did not change the amounts, just the kneed time. Spelt flour does not hold up to too much kneeding. I used my Pasta attachment from the Kitchenaid, a small cookie scoop for the filling and these were great. I had left over ricotta, dry curd cottege, parm and mozerella cheeses sprinkled some Italiam seasoning to the cheese mixture! Awesome recipe a keeper... thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emilym9"
},
"reviewBody": "Just the filling. Added some pressed garlic and used fresh instead of dry parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "melissa gates"
},
"reviewBody": "I had a hard time with the dough... the flour is too much for the wet ingredients so I had to keep adding water to it so it was more moist, or else I would've been left with a \"dough\"falling apart due to its dryness. also I was having trouble sticking the bottom sheet to the top sheet, and the dough was not enough for all. the filling, so I would recommend either adding 1 cup of flour extra to your dough recipe(and obviously more liquids ) or making less filling, with this recipe I made exactly 20 small raviolis, im currently waiting for them to come out the oven, have not taste it yet, will update on the flavor when I get them out. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carlena K"
},
"reviewBody": "The filling was absolutely delicious! I ended up using smoked mozzarella instead of regular and you could really taste it after it cooked. Unfortunately I had to find another dough recipe it was just too though to handle and it only made a handful on ravioli, mind you I did make large pieces. But after I was done rolling and cutting it was difficult to put it back together and roll to make more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonja O'Connell"
},
"reviewBody": "My review is of only the filling since I have a pasta maker. Filling was easy to make but I found the cream cheese seemed to dominate the flavor of the filling. I think next time I’ll cut down the amount or omit it all together. Otherwise it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pq260sx"
},
"reviewBody": "Yes! Yes! Yes!! Best experiment I have tried in years!!! This will be a go to for my house. The left overs were even fought over. Don't settle for a store bought marinara, make your own!!! I also recommend buying a ravioli mold. They are inexpensive and really make the presentation nice. I made the recipe exactly as written (aside from the store bought marinara) and will continue to do so! Thanks!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol B"
},
"reviewBody": "Surprisingly good! Only thing I changed was to use won ton wrappers. So yummy even my 15 y/o daughter went back for thirds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "judyvernon"
},
"reviewBody": "I can’t rate the entire recipe. I only used the cheese filling. I did add a 3 cheese parmesean mix to it and it turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurmoore"
},
"reviewBody": "Used the filling for stuffed shells, following the recipe exactly. Creamy, gooey perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Genesis Blue Davies"
},
"reviewBody": "Horrible dough recipe. I had my own filling, used the recipe to make the dough and ended up having to throw it out. It was way too dry and after adding another egg and some water, it ended up being too tough to use. Literally too tough to roll out. What a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindi Jones Garrison Andrews"
},
"reviewBody": "Very good, although sauce was a bit too sweet. I will cut down on the sugar next time. Pasta dough handled beautifully, and the filling was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I use the cheese filling from this recipe to layer in my lasagna. Same flavor but less labor intensive than making ravioli if you don’t have the time (or patience)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tsmoody"
},
"reviewBody": "Loved this recipe and will be making it again. I have an automatic pasta machine so that cut down a ton of time in making the actual pasta. We made the raviolis a bit on the larger side, about 2\"x2\", and came out with 30 raviolis using this recipe, definitely enough for 4 people. Since there were only two of us eating we went ahead and froze half of the uncooked raviolis and saved for another time. The white sauce in this recipe was the best! My husband who prefers alfredo over marinara couldn't get enough and it was easy to make! The filling recipe was on point as well. 5 all day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy the Home Cook"
},
"reviewBody": "Delicious! This is certainly time consuming (a double batch took me about 2 hours to make) but worth every minute. I made the pasta dough as suggested but did need more water than the recipe indicated. Having a hand cranky pasta machine made it easy to get paper thin pasta and I doubt you could really achieve that by hand rolling. I also made the cheese filling exactly as indicated and loved it. But then I got creative and made some varieties using the basic cheese filling. In one batch I added cooled ground chicken and chopped spinach. In another batch I added cooked lobster. Both were amazing! The lobster with the white pesto cream sauce was restaurant quality for sure! I completely missed the egg wash step and the raviolis still held together well and tasted great so not really sure how vital that step is. Highly recommend if you have the time to spare. My double batch gave me about 40 extra ravioli to freeze for later use so it was well worth my time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Snow"
},
"reviewBody": "Rating for the filling...it was delicious. The mozzarella made it nice and stringy and the other flavors melded nicely together. I did not make the pasta or the sauce from the recipe...maybe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "helena"
},
"reviewBody": "It works! Easy, really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Kavanagh"
},
"reviewBody": "The key to any recipe is to always taste before using as far as filling is concerned. Recipes are guidelines especially for the filling. Everyones tastebuds are different so season to your taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Fantastic recipe! I had to double the water and olive oil for the pasta dough as things were just way too dry. The filling was perfect! I must have under-stuffed my pasta as I ended up with lots of extra stuffing (which I used for cannelloni another day).\nI've never tried making ravioli before (fettuccine, yes) and it was a slow process. My dough was drying out before I could seal them shut, so this definitely takes practice - don't be discouraged."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JimB"
},
"reviewBody": "I used my own pasta dough recipe and made my own marinara. The cheese filling was good, the next time I make it I will tweak it a bit to suit my personal tastes. I forgot to bake the raviolis, not sure if needed but I will give it a try next time. The pesto cream sauce was really good, I am thinking of other ways it can be used. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Joy Joy"
},
"reviewBody": "This was delicious and I'm making it again!!! Thank you :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Bartschat"
},
"reviewBody": "Used this filler in both homemade ravioli and manicotti it was awesome. My wife made her homemade marina sauce to go with it. I used fresh mozzarella. My daughter asked if I would make it everyday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Clairmont"
},
"reviewBody": "The cream sauce was excellent! Had trouble with the dough recipe, but this was my first time making ravioli so to be fair it may be my technique needs experience. I did use a slightly different recipe for the dough and my small stand mixer and that turned out better. I highly recommend using a ravioli press or mold, I didn't and mine turned out fairly large with little filling. But again, practice makes perfect so try, try again. All in all I can't say enough about the cream sauce, and melding with a good marinara was just the right touch! Thanks for the recipe, I will definitely use it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gustav"
},
"reviewBody": "I really liked the sauces but the filling needs more flavor. I added dried basil, oregano, italian herbs, and some more cheese which really helped. I used my own pasta dough recipe and that really made the difference.\nP.S. If you seal the ravioli well, I would boil it if I was you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmgarb"
},
"reviewBody": "I only made the Pesto Alfredo Cream sauce from this recipe. I made as written with the exception of using 1/2 and 1/2, as the grocery store was out of heavy cream. I may have added more parm too. It was spectacular and so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gi68801"
},
"reviewBody": "This was my first time making pasta. I did not make the sauce because I do my own marinara. The flavor in the filling was amazing. I made extra and glad I did l. I'm going to use it in a lasagna roll up tomorrow. For the pasta, I did have to tweak the flour/egg ratio because it was super wet. Other than this I loved it. Next time I am definitely making the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1horseshay"
},
"reviewBody": "Made it today for my family. Used mozzarella and ricotta that I made earlier in week with fresh cows milk. Didn't have provalone, but the meal was delish. Served with rustic bread and fresh summer squash. Didn't really need it, but topped off with shaved parmesan. Was eaten too quickly to get a photo.Highly recommend. A bit time consuming but worth it!!!!!! Thank you for the great recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Roberts"
},
"reviewBody": "I liked the filling, good dough. Very straight forward. If you want to make some great relatively basic Cheese Ravioli this a good recipe. I am sure the sauce is solid but I use some different ones I am very fond of making, so four stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mahreen"
},
"reviewBody": "Turned out amazing! I made it with readymade ravioli but the sauce was amazing! Very restaurant style!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candace"
},
"reviewBody": "Ok so I only made the sauce and served it with trader joes ravioli. Very tasty though the cream sauce sorta separated and looked weird."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jellyman93"
},
"reviewBody": "I used this as a base recipe for my ravioli. I added sausage to the cheese and it was very good. Compliments from the family on the taste. The recipe did make more than I needed so it is going on the menu again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chrissy Vincent"
},
"reviewBody": "The dough was so dry we had to add additional water. It was a labor of strength to roll. Boiled for 8 minutes, baked for 4 and the ravioli were tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Arenson"
},
"reviewBody": "Did not make the sauce - only made the dough and filling.\n\nWe doubled the oil and water, and the dough rolls out easily! No need for a pasta press! After kneading for 5-10 minutes, leaving it on the counter for about 15 was enough. Boiled for 7 minutes (I like my pasta pretty well-done), and skipped the baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michiganmom"
},
"reviewBody": "I made the entire recipe and we loved it! However, the pasta dough was difficult to work with; I added more water and oil to make it come together. Ended up with a great dough but for those new to pasta making, this recipe wouldn't be the one I'd choose.\nThe ravioli filling is delicious. I used dried oregano (was out of parsley) and a packaged 4-cheese Italian mix (total of 1 cup shredded cheese). I added a pinch of salt and white pepper.\nFor me the star of this recipe is the Pesto-Alfredo Cream Sauce. I made it as directed, but found I needed another 1/2 cup or so Parmesan to make the sauce as thick as I wanted. I've never had a sauce quite like it; we all loved it and I will be making again. I served it as described, along with homemade Italian meatballs in the red sauce.\nI bit labor-intensive, but well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna Baur McCabe"
},
"reviewBody": "Tastes almost exactly like the Ravioli and Pesto sauce that Maggianos makes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Loved the recipe - great detail and easy to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Daniel Matthews"
},
"reviewBody": "This was my first attempt making homemade ravioli and it turned out great. I was a little worried about how the two sauces would taste together but I have to say, they were delicious together. I wouldn't use the entire 24 ounce jar of marinara next time though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vocabqueen"
},
"reviewBody": "Made it exactly as recommended and it was so DELICIOUS! My Husband isn't a real pasta fan -- so imagine my surprise when liked it too!! I must add this, it's even better the next day, after the Marinara and Cheese Sauce sort of soak in to the Ravioli :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Jensen"
},
"reviewBody": "This was so elegant and yummy! It took me a long time to make because I was trying out a new pasta maker, but en the end I just hand cut them. This was better because I could make the ravioli's bigger! I used my own homemade sauce, which was spicer than store bought - and I liked the kick - so I would recommend a sauce that has a LOT of flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Alisauskas"
},
"reviewBody": "One of the best ravioli recipes around! Can't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schell75"
},
"reviewBody": "The ravioli are great, easy to make and the filling is really good also. The white sauce is the best!! It has become my go to sauce for every pasta dish I make. I do make a homemade red sauce also. The combo of the two is really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "Great recipe, easy and no fuss...I would add a stronger shredded cheese because the cheesy flavor don't really cut trough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Hodge"
},
"reviewBody": "This was a great recipe! The dough was amazing and I followed the recipe exactly as written but added spinach to the cheese filling! I sautéed up some mushrooms, onions, peppers and Italian chicken sausage to serve with it and my whole family raved over it! Definitely a new favorite in my house, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sudemers"
},
"reviewBody": "I use the pesto alfredo sauce alone to make chicken pesto alfredo...Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlyn Wise"
},
"reviewBody": "I was very happy with the way this turned out. It was my first time making ravioli, and it's not as easy as I thought. I learned that you cant pile them up after making them and air is bad. Can't wait to become a pro. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yelsi"
},
"reviewBody": "Great recipe. Fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily's Keeper"
},
"reviewBody": "To save time, I purchased a quality brand five cheese ravioli. I followed all other directions, including baking the ravioli after boiling it. This step really makes a difference. After preparing the sauces, I topped off the dish with sprinkles of an Italian blend cheese and baked it. It was fabulous, and so easy to prepare. Will make this dish again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kwolslager"
},
"reviewBody": "Very upsetting. This recipe called for twice as much mixture as dough. I followed the instructions and measurements exactly and there was more than half a bowl of filling mixture left over that went to waste. It was really disappointing that there was not enough dough. It did NOT yield enough raviolis to feed even two people. Had to make extra side dishes to compensate. \nDon't waste your time with this, unless you use a different dough recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMJJ"
},
"reviewBody": "For my first time making pasta, this went remarkably well! I didn't have cream cheese or provolone, so used more ricotta and mozzarella, plus a little swiss. I also added about 1/3 cup chopped, sautéed baby bella mushrooms to the filling. I was worried about being able to roll out the dough, based on other reviews, but had no problems with that (make sure to lightly flour the counter, though). Because I used fairly large cookie cutters to shape them, I only got 18 ravioli, but still had dough (and about half the filling) left over. I might try to re-roll the dough and cook it as regular noodles. Also, after I shaped the ravioli, I placed them on a plate until they were all finished, but when I went to move them to the pot, several of them stuck and had to be re-sealed. So, either spray your plate first or use waxed paper. I skipped the baking and just served them after boiling. No longer afraid of making pasta!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JuiceMom"
},
"reviewBody": "I used my own recipe for pasta dough, but the filling was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JJ"
},
"reviewBody": "The pasta turned out great but I was not a fan of the filling at all. I followed the recipe for the filling exactly but next time I will completely cut out the cream cheese in this recipe. My taste buds do not believe that cream cheese belongs in a ravioli filling. I thought it was pretty nasty honestly. I think next time i'll just add more ricotta. I didn't try the pesto alfredo cream sauce so I can't rate that. The pasta part of this recipe is very good though."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
"name": "Pasta by Shape Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16855/pasta-and-noodles/pasta-by-shape/ravioli/",
"name": "Ravioli Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/",
"name": "Homemade Four Cheese Ravioli"
}
}
]
}
}
, "about": [
]
}
]