				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Angel Food Cake"
,"datePublished": "1999-10-19T07:51:54.000-04:00"
,"dateModified": "2022-07-14T15:55:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Darlene Williams"
,"url": "https://www.allrecipes.com/cook/24322551"
}
]
,"description": "This angel food cake is just like grandma use to make."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/pSNFBUjHok9jJ44FkkJwnW9-qHo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/602869-6e32f048aef24a8782a322f2898f3b18.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Angel Food Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "66"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "34 g"
,"fiberContent": "0 g"
,"proteinContent": "6 g"
,"sodiumContent": "72 mg"
,"sugarContent": "26 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"18 egg whites",
"2 teaspoons cream of tartar",
"1 pinch salt",
"1.5 cups white sugar",
"1 cup cake flour",
"0.5 cup confectioners' sugar",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Sift cake flour and confectioners sugar together 5 times and set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large clean bowl, whip egg whites with a pinch of salt until foamy. Add cream of tartar and continue beating until soft peaks form. Gradually add sugar while beating, and continue to beat until very stiff. Add vanilla."
} ,{
"@type": "HowToStep"
,"text": "Quickly fold in flour mixture. Pour into a 10 inch tube pan."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 45 minutes."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "loved is so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirk Kingston"
},
"reviewBody": "First time to try this without a box mix. I put the cake in the pan and it filled it to the top. In oven now so I’ll see how it does....what I didn’t do was make sure no air pockets by cutting through it. Kinda nervous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Furan"
},
"reviewBody": "This is superb! I confess I cooked in a tube pan &amp; it stuck, but we were able to cut slices from the pan. The taste is excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ester Kim"
},
"reviewBody": "so good! i did the recipe to yield 10 and only change was doubled the vanilla extract. make sure you cool upside down. it came out super airy and fluffy...put some strawberries on it and serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason Mallory"
},
"reviewBody": "This was my first ever attempt at making angel food cake. Absolute success. I read some reviews before making this cake and I'm glad I did. I made sure to invert the cake for cooling. This recipe was very easy to follow. I emphatically enjoy baking pies, breads, and cookies. I have just started dabbling in baking cakes. I will use this as my \"go to\" recipe for angel food cakes as I explore other angel food cakes and the cake baking world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe B."
},
"reviewBody": "My wife has always been a fan of Angel food cake however due to the amount of eggs it takes I've only made it from scratch twice using different recipes. My wife said that \"hands down this is the best she's ever had\". Now I plan ahead and make this for her more often. It's great with mashed, fresh strawberries and whipped cream however eating it plain is my favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aswedeone"
},
"reviewBody": "I made this cake for my grandson's first birthday since he is dairy-free. It was way too moist, to the point of almost wet. It was baked longer that the prescribed time, was golden on top when it was taken out of the oven and the wood skewer came out clean. Not sure what happened. I have been baking for almost 60 years?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lyle"
},
"reviewBody": "I followed the recipe with no changes made. This makes a wonderful angel food cake. It had a good flavor, texture, and it rose well. This will now be my go to angel food cake recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doxielvr"
},
"reviewBody": "Loved this cake! I followed the directions and made it the way it was posted. It turned out perfect! I've made it several times. Great recipe!\nIts a lot of egg whites so I'd suggest maybe buying them unless your like one of the other reviewers and you make custard with them. I cooked them and gave them to my dogs :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Stolberg"
},
"reviewBody": "It seemed to take forever to beat the eggs to stiff peaks (30 minutes maybe) but it was worth it. I halved the recipe and baked it in a bread loaf pan for only 30 minutes and it turned out great. I made it for a friend's birthday and normally angel food cake is about my least favorite kind of cake but this one came out so delicious I had to have seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariah Frank"
},
"reviewBody": "This cake turned out delicious! I am very impressed by the recipe because I did everything wrong. I greased the pan, the batter sat out for over an hour and I didn't let it cool before removing the cake from the pan. By some magic it still turned out great. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R. M. Hutchinson, Jr."
},
"reviewBody": "I added extra vanilla. I did not grease the pan, but will next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamela Lashley"
},
"reviewBody": "Love it! Just make sure to use medium sized eggs instead of the large or jumbo. Your mixing bowl will overflow with the larger eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tucker's Mom"
},
"reviewBody": "I have made this recipe twice, great results both times. I added a 1/4 tsp of Almond Extract. I also gently fold the sifted cake flour\\confectioners sugar mixture in a little at a time with my mixer on the lowest setting at the end. Perfect Angel Food both attempts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Terrific. i was busy baking for our dinner club and found I was left with 18 egg whites. Couldn't waste them so kept on going and made this great angle food cake. A favorite of my husband. Added 2 tsp. almond extract instead of vanilla. Yummy! Serve with your favorite custard, fruit, ice cream, what ever. Winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "Great angel food cake. I didn't have cake flour so I just used 1 cup of all purpose minus 2 T. I used this for a trifle I was making."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darryqueen"
},
"reviewBody": "This was amazing! My daughter requested angel food cake for her birthday. The cake turned out beautiful, even using \"homemade\" cake flour instead of purchasing a box. Soft, flavorful, just perfect. I've learned overtime if you don't beat the whites enough, then beat instead of fold the flour into the whites, you will have a failure on your hands. Have to be patient with this angel! Keeping this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tavisha"
},
"reviewBody": "I made this cake last night for a dinner party. One of our guests is lactose intolerant and soy intolerant, so coming up with a dessert was a challenge. I followed the recipe as written except I did add a tablespoon of almond extract and, as others suggested, I did add the flour mixture slowly, folding it in each time to make sure it was smooth. I made a chocolate sauce to go on top consisting of 8 oz of melted dark chocolate from Trader Joe's (that didn't have any dairy or soy products) to which I stirred in 1 cup of hot (but not boiling) canned coconut milk. I topped the cake with fresh strawberries, blackberries and blueberries, drizzled it with the chocolate sauce, then finished with some toasted slivered almonds. It got rave reviews from all of our guests. I'd make this cake again in a heartbeat. It's so versatile, you can do so many things with it. Thank you to the reviewer who suggested finding the proper sized bottle to invert the pan onto BEFORE you put the batter in the tube pan. I had a tough time finding a bottle that worked - but ended up with a small bottle of Tabasco sauce that fit. This was my first attempt at angel food cake and it turned out just perfect. However, the recipe should include the \"invert the pan during cooling\" instructions. Otherwise, it's a lot of work to end up with a flat and dense cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jen83"
},
"reviewBody": "All we could taste were eggs and flour. Most recipes call for much fewer eggs and usually say about 1.5 cups of whites. This made well over 2 cups of egg whites and I think it was just entirely too much. Additionally, it fell, and I have never had an angel food cake fall before, homemade or otherwise. I was really disappointed after reading all of the rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Morrow"
},
"reviewBody": "Love this recipe! I raise my own chickens and have now found a delicious way to use up alllll those extra eggs that I don't sell. I added extra vanilla, too. next time will add some almost too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Marjorie, you can freeze egg yolks for up to 9 months. Just gently stir and add a little salt for savory dishes and sugar for desserts. This is to inhibit yolks from getting lumpy. Freeze in ice cube trays and thaw in the refrigerator preferably the day before intended use. Creme brulee uses yolks only and so do some custards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ccatts"
},
"reviewBody": "With the price of eggs and sugar it is better to just buy a boxed cake and with betty crocker you cant tell the differance in taste and it bakes up perfect everytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This cake is as close as I've come to duplicating my late Grandmothers'recipe. Only problem....the second time I made it, it stuck to the UNGREASED pan and did not rise as much as first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "This cake is huge!!\nI usually use the recipe in the BHG cookbook, but I didn't have enough confectioners sugar...so I found this one. It is very similar, maybe a little more moist and fluffy. And it is significantly bigger (uses 18 eggs instead of the 12-13 I am used to). I will be using it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darlenejoy"
},
"reviewBody": "Rose so high! Really came out well and was so delicious. Made custard and pumpkin spice bran muffins with the yolks, so was a fun day of baking :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeVidrine"
},
"reviewBody": "So light and delicious! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "Very easy recipe. Looks and tastes great! I added 1/2 teaspoon almond flavoring along with the vanilla. Turned out scrumptious! I highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mfrye"
},
"reviewBody": "Made it with carton egg whites and it was delicious, and sooooo easy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WaistedRaven"
},
"reviewBody": "This recipe is fantastic! First time I ever made angel food cake and it turned out great! I did add an extra 1/2 teaspoon of vanilla and a dash of almond extract as I saw in other suggestions and it really did turn out awesome. I made this for my father-in-law's 80th birthday today and he loved it! It was a hit all around! Even my 3 year old loved it! I served it with cream cheese icing and I made a cooked some strawberries to make a nice sauce to drizzle over it! Really best I've angel food cake I've ever had...and not just because I made it, LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SooperLowa"
},
"reviewBody": "My daughter made this for my birthday, and it was wonderful. She thought it was easy to make and the end result was just perfect, especially with strawberries and whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathie Howard Holmes"
},
"reviewBody": "Far and away the best angel food that I have ever tasted. It had a very moist, fine texture. Angel food cake is my favorite dessert and this one is the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohbean620"
},
"reviewBody": "This was really good and I did recipe with combination of some of the recommendations of other people who reviewed. Folded in flour mixture in parts and it made a tube pan along with a small loaf. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jparker11"
},
"reviewBody": "We found this easy to make, and the BEST ever. No more store bought Angel food cake. My wife just made it again and it's gone. Outa this world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kari Kimmel Guffey"
},
"reviewBody": "My family really enjoyed this cake. However, I found it to taste like eggs. I wondered if any one had any suggestions to make it taste less \"eggy\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Becci Blanchard"
},
"reviewBody": "This recipe was simple enough to follow, and the finished product had a nice taste. But the finished product, for me, turned out very dense and a little sticky. Not the light Angel Food Cake that I was expecting. Might try again, but use less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Great recipe. My first time making a angel food cake from scratch, baking is my specialty and this recipe was awesome. I switched it up a bit to suit my family, using 1 cup slenda and 1/2 cup sugar instead of using all sugar. It turned out wonderful,and is so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama of Two"
},
"reviewBody": "Fabulous! The first time I made it, it seemed a bit labor intensive. But I whittled down the time by a couple easy steps. I'm a magpie, so I get distracted and forget how much sugar I've put in when I have to \"gradually add\" something. So with this, I measured out the granulated sugar in a bowl. I didn't have cake flour, so I measured two tablespoons of corn starch in the bottom of a 1 cup measuring cup. I filled the rest with all purpose flour. When sifting the flour and powdered sugar together, I put down two pieces of wax paper. I sifted the flour/sugar on the top sheet and then used it as a funnel for the 2nd sifting. Before the second sifting, I lifted up the sifter, flour and waxed paper all together and put the top sheet on the bottom. It's like leap frog. I had the eggs, salt and cream of tartar in my Kitchen Aid and the eggs were at stiff peak stage. After I sifted once, I'd put in some sugar. After I sifted the second time, more sugar, etc. I put the final sifting in the bowl that held the sugar, and no extra dirty dishes!!! I now have this down to a science, and it's nearly as easy as a box mix, but infinitely better tasting. Oh, one more tip, measure the bottle you will invert the cake on BEFORE you put the batter in the bowl. :-) I use Lea &amp; Perrin's Worcestershire sauce bottle, because it's the perfect size and already lives above my stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniel"
},
"reviewBody": "This recipe worked better for me than the Kitchenaid recipe... very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shorthoneys"
},
"reviewBody": "My first attempt at angelfood and it turned out great. It was very moist, yet light and fluffy. It was a huge hit. I will make again when I need to use up egg whites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "The texture was very good but it was lacking a little in flavor. I will try adding more vanilla next time i think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette Robinson"
},
"reviewBody": "This recipe is great! It also makes 2 cakes for me, I dont know why. I have very old fashioned bunt pans so maybe they arent as deep as the more modern ones. The cake freezes well and thaws in a snap for quick hosting. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "unicornsarereal"
},
"reviewBody": "This was awful. It didn`t rise at all. By the time we went to eat it, it was squishy and spongy. Yuck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allheart"
},
"reviewBody": "This was awesome! I used a 500g carton of egg whites, was just 4 Tbsp shy of 18 eggs, I didn't add the extra eggs and it was just fine. I would suggest getting it into the oven asap, mine was left out for about 35 minutes before going in the oven so it fell a little. All in all it was the whitest, softest, not spongy best angel food cake I have ever tasted! A big hit with the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran Hatch"
},
"reviewBody": "Absolutely the best ever. People always ask for piece to take home, if there is any left over! Use the egg yolks to make creme brulee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PS"
},
"reviewBody": "Amazing! Made it for a party last night and everyone loved it. Very moist and light. I added a teaspoon of almond extract and another 2 of amaretto. Served it with low fat ice cream and berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurenM1"
},
"reviewBody": "I've made angel food cakes before and this one turned out great.I used almond flavoring instead of vanilla but otherwise I followed the recipe. For those of you who've never made angel food, take the previous advice about not greasing the pan. Also I did not add the flour all at once. I added it in fourths and folded it in by doing 2 deep folds with a spatula then turning the bowl a quarter turn. When you take it out of the oven you should invert it until it's totally cool. This is a keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lulabelle"
},
"reviewBody": "This is an excellent, basic Angel Food cake recipe. I doubled the vanilla, as I tend to not like \"floury\" tasting dishes. I made two for company after church, and served them with strawberries and vanilla ice cream. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KasiB."
},
"reviewBody": "Wonderful! Turned out perfectly! I have never made an angel food cake before and had no idea what to expect. The 18 egg whites surprised me a little, but it was well worth it! For all those others out there who are new at angel food cakes, do NOT grease the pan. I greased the bottom of mine and that was the only problem I had. Where I greased the pan the cake stuck and where I didn't it did not stick, but that was my fault. Follow the recipe exactly and don't grease the pan, and you will have a perfectly fluffy and moist angel food cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kittykat"
},
"reviewBody": "Absolutely perfect! I followed this recipe exactly and it turned out wonderful. I am so excited as this was my first attempt. The only thing that differed was the time....only thirty five minutes in my oven at 350 degrees. Glad I was watching it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaManda"
},
"reviewBody": "I made this cake for my daughter's 1st birthday today. It raised alot more than I expected it to, but was delicious, moist, and very fluffy. I forgot to put the vanilla in...oops...and put a little less confectioners sugar in, but the sugared strawberry topping I made to go along with it made up for it. This is the first angel food cake I have made that turned out this good and didn't fall! Very easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This is a great recipe, just be sure to take your time and make sure you beat the egg whites to the proper consistency for the best results, light and fluffy cake! I made a slight modification in mine: in addition to the 1 tsp vanilla, I added an extra 1/2 tsp vanilla (used part artificial vanilla/part natural vanilla extract) and I added about 1/2 tsp almond extract as well. The results are great, I shared it with my coworkers recently, and now am making it for the 2nd time just this week, per request! Our oldest employee, at age 79, says it's the best she has ever had :) I serve this with sliced strawberries and homemade whipped cream but it is so good that it's just as delicious by itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole Sexton"
},
"reviewBody": "I have also made this recipe twice and took the advice from a previous reviewer and added a little extra vanilla. The first time I made this I forgot that you must turn an Angel food cake upside down to cool, otherwise the bottom of your cake will become very dense. I turn it upside down into a colander and it worked pretty well to keep the shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This cake was soooo good! This was my first attempt at making a homemade Angel Food Cake. You don't realize how much you can taste the preservatives in a boxed mix until you make one from scratch! One word of advice though..make sure you have a HUGE bowl available for the folding step of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this cake twice. You must make sure to add the flour mixture slowly while stirring to avoid lumps. I added more vanilla and a few drops of almond flavoring."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8428/homemade-angel-food-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/385/desserts/cakes/angel-food-cake/",
"name": "Angel Food Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8428/homemade-angel-food-cake/",
"name": "Homemade Angel Food Cake"
}
}
]
}
}
, "about": [
]
}
]