				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Chocolate Sandwich Cookies"
,"datePublished": "1997-08-18T17:15:08.000-04:00"
,"dateModified": "2023-01-11T13:52:07.000-05:00"
,"author": [
{"@type": "Person"
,"name": "John Crandall"
,"url": "https://www.allrecipes.com/cook/24324507"
}
]
,"description": "This is a deliciously soft and chewy version of everyone&#39;s favorite chocolate sandwich cookie. Get out the cold milk!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3lvZWa2TdCkufeRFpCYoQcRAvDA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6170831-05be4cfbd3574c38b0dab954791bdcfe.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Chocolate Sandwich Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "211"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "550 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "79 mg"
,"fiberContent": "1 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "657 mg"
,"sugarContent": "38 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 (18.25 ounce) packages devil's food cake mix",
"4 eggs",
"1 cup shortening" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (180 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Blend the above ingredients together with a pastry blender until mixed."
} ,{
"@type": "HowToStep"
,"text": "Roll in balls about the size of a quarter and place on ungreased baking sheets. Make an even number of balls."
} ,{
"@type": "HowToStep"
,"text": "Bake for 10 minutes. Let cookies stand on cookie sheet for 5-6 minutes before removing them to cooling rack. After cookies have cooled, put Cream Cheese Frosting (see recipe or use one can of pre-made frosting) between two cookies, putting bottom sides together."
} ,{
"@type": "HowToStep"
,"text": "NOTE: Adding chopped pecans to the cookies without making them into sandwiches is also very good. Spice cake mix can be used in place of Devil&#39;s food."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "super fun cooking and my result was as shown in the photo. I visit this site almost thrice a week to look for awesome baking recipes. Baking was so fun i used a lot of milk and sugar. so good!!! it was worth it and even tastier with milk! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kitkat47"
},
"reviewBody": "The cookie came out ok but the center was way too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherie Parry"
},
"reviewBody": "We traditionally make these to put on our goodie plates at Christmas time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheFleetwoods1212"
},
"reviewBody": "I made this according to the directions but after reading all the comments, this could easily be adjusted to use different cake mixes and frosting combos. I am excited to have these cookies in my arsenal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Butterfly1416"
},
"reviewBody": "These were a HIT at my office! I put my in the fridge and then left them out for the remainder of the day. Sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Bateman"
},
"reviewBody": "These are so good and easy to make. I forgot to buy shortening so we just used butter. It may had changed the texture a bit but the taste was still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Rakusin"
},
"reviewBody": "I used 1 box of vanilla cake mix, 1 stick of butter, and two eggs (per other reviewer), and I used Nutella for the filling and they turned out great! Super soft and not too sweet. Easy recipe and would be awesome to make in a time crunch. Definitely will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "murrietamama"
},
"reviewBody": "Super easy, had leftover cream cheese frosting to use so I made these. They do make for very large desserts though, since each one is two cookies with a frosting middle. But delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda Banks"
},
"reviewBody": "The cookies are very easy. The batter is a little tough to get mixed at first, but just keep working it until it's incorporated and smooth. Listen to what others have said and make small balls because they do spread a good bit (I only put 11 per cookie sheet, would make them smaller than a quarter next time). I made homemade cream cheese frosting to go with them. Other people seemed to really like them, I thought the frosting was the best part and couldn't fully get over the \"store-bought taste\" of the cookies. Easy, not bad, probably won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Wilson"
},
"reviewBody": "I didn't have a devils food cake mix so I used a chocolate cake mix , 2 eggs and 1 stick of butter. Canned Forsting. It made 12 sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pierce girls"
},
"reviewBody": "These cookies were amazing instead of icing in the middle I made icecream sandwiches they were amazing. I used 1 box of cake mix, two eggs and a little less than a stick of butter. They weren't sticky and they held together very well. Will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanee Van Ee-Mortensen"
},
"reviewBody": "Cream cheese icing is better. When craving dark chocolate, I add in a full 1 tbsp black cocoa. I've used cookie dough filling (Sally's baking addiction)and that works awesome for variety. Remember that this is set for the 18 oz box cake mixes, so you might have to add several tbsps of flour. Cook up a couple and see if they don't totally flatten/so you can adjust flour. I use butter (never shortening) and butter, soft, works very well. I use a small cookie dough scoop so all are the same size. I add 1 tsp vanilla to cookies as well. Parchment paper is great as well for cooking these. Re-use the paper several times. Excellent to make this full recipe and then freeze if you think too much (several months just fine if in a freezer bag with wrap dividing the layers unless you freeze on cookie sheet -- then can go in straight up.Freeze absolutely wonderfully and thaw perfect). We love to eat them frozen in the summer!! Have fun and try different cake mixes as well. Pink velvet was on sale and I did the cookie dough icing with it -- fun variety! I've been making these cookies for over 30 years!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amushrush"
},
"reviewBody": "YUM.I really don't understand anything less than 5 star. Though they may not be gourmet, they're SO easy and SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evansmom1997"
},
"reviewBody": "Awesome! I do not own a food processor so tried using my stand mixer instead. Bad idea. Nearly burned it up because the dough was very stiff. I used my small cookie dough scoop and made 6 dozen identical size cookies. My first batch did not spread out like I expected, so I flattened the dough balls in the remainder of the batches to about 1/4 inch and they turned out perfectly. I used buttercream frosting for the filling. Husband and son loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnne Lowe Bowers"
},
"reviewBody": "I made this exactly as written but used a spice cake and a carrot cake that is all I had also added raisins. I got 26 filled cookies(which would have been 52 cookies)I made them for church and they were a big hit. Do not taste like cake mix cookies :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenBee"
},
"reviewBody": "Love these cookies. My son is always asked to bring them to parties. I have also made them with red velvet cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Rone"
},
"reviewBody": "I cut the recipe in half and boy was I sorry I did! Me and the kids are them up! I filled mine with Nutella and some with white frosting. I refrigerated them and they were even better the next day. One of the best things I have ever eaten! I did use butter instead of shortening and the cookies still got great. I rolled my cookie balls bigger so that my cookie sandwiches would be larger. Just a personal preference. I am going to try spice cake next with cream cheese frosting. One of the best recipes yet!! Try them you will not be disappointed!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "These are delicious and super easy!!! Love these. Great for kids to just grab and go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bree Elizabeth"
},
"reviewBody": "A household fave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fancie"
},
"reviewBody": "Taste ok. Nothing to write home about. Suggest you use a glass and slightly flatten the cookies before baking because they come out pretty thick. Easier to make sandwich cookies out of them when they are flatter. Haven't decided if I'll make them again. But all in all it's an interesting twist on a cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan Swenson"
},
"reviewBody": "So easy to make and always a hit at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drbiffswife"
},
"reviewBody": "Easy recipe. I put ice cream in the center instead of the recommended filling. I know my family will love these ice cream sandwiches after they are frozen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valerie"
},
"reviewBody": "I usually halve the recipe and end up with enough cookies to make 12-15 sandwiches. I fill with ice cream and store them in the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessiclm"
},
"reviewBody": "Very easy, chewy, and tasty cookie recipe. I halved the recipe and it made 21 sandwiches (42 cookies). I used the Cream Cheese Frosting II recipe from this site, but added more powdered sugar to the recipe and halved it as well. I also added mini chocolate chips to the frosting to give it a bit of a crunch and they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Subvet"
},
"reviewBody": "Terrific! My kids love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Good. A little crumbly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ddcmommy"
},
"reviewBody": "These weren't very chocolate-y... Just so so"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lollymomma "
},
"reviewBody": "Yummy! Yummy! I used buttercream for the middles and they were perfect! Make sure you follow the directions on the bake time. The cookies will not be done when you take them out of the oven but will continue baking while on the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goyebr"
},
"reviewBody": "Wow...they were a great hit! Had several friends ask for the recipe.\nI did make add chocolate cocoa to the cream cheese frosting...which make them that much more yummy! Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cottagelady"
},
"reviewBody": "These are super easy cookies! I didn't like them made with devil's food cake mix, but they were really good using spice cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Sandberg"
},
"reviewBody": "This recipe is so good. I used a yellow butter cake mix (cause I didn't have chocolate) and Chocolate Butter Cream II. They tasted just like Lofthouse cookies. I would sincerely suggest making the cookies small because they are VERY sweet this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Montana Tess"
},
"reviewBody": "This recipe deserves 5 stars because it is so easy and worked just as it was written. I live in Guatemala and haven't seen shortening at any store yet, so I substituted vegetable oil (it is much easier to measure) and added 1/2 cup flour to get the dough to the right consistency. I also flavored my can of frosting with about 2 tbsp. of Kahlua. Now that's a cookie to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandoerin"
},
"reviewBody": "So tasty! I've found that the best frosting for these is just fluffy vanilla store-bought frosting! I made frosting from scratch for these today (didn't have store-bought on hand), and I prefer the store-bought frosting for them. It tastes more like oreo filling than buttercream frosting does."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah"
},
"reviewBody": "I just finished making these cookies: YUM! I mixed the cookies using my food processor-- it took no time at all &amp; no mess! I used 1 pkg of devils food cake &amp; 1 pkg of chocolate fudge cake mix. I cooked the first batch at 350 for 10 minutes &amp; they actually BURNED while sitting on the cookie sheet. So the next round: I turn the oven down to 325 &amp; cooked for 8 minutes &amp; let them sit for 2 minutes on the cookie sheet. This produced PERFECT, moist cookies! I used the whipped DH packaged vanilla frosting. YUM YUM YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jayne"
},
"reviewBody": "Soooo Good! I only made a half batch (only had 1 box), and canned frosting. I made small cookies and put the frosting in a ziploc bag, cut the corner off and put a dab on top of each cookie instead of sandwiches, YUM and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna"
},
"reviewBody": "Best cookies ever!!! I make them and in minutes they are gone. Family and friends request them all the time. I also tried butter pecan mix with cream cheese icing....delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSKDICE"
},
"reviewBody": "Excellent! I made these for a potluck dinner and they disappeared quickly. There were none left to take home. Mine were kind of puffy so as they were cooling I flattened them with a spatula. I used a peanut butter frosting recipe I found on this site for the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmartin88"
},
"reviewBody": "Five stars for ease &amp; taste! So good! I had cake mix and frosting, but cake just wasn't going to cut it. These were SO easy! I halved the recipe, and used a stick of margerine (no butter.. :( )instead of shortening. My cookies baked perfect at 9 minutes - came out so nice and chewy (I was worried they'd be cake-y, but they were perfect). All I had was whipped chocolate frosting, ended up tasting like Little Debbie's Fudge Rounds, but even better! Thanks for this easy recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vickyvicky"
},
"reviewBody": "awesome, i made them last night, my dad loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ummimusa"
},
"reviewBody": "definitely soft, just the way I like it. followed the recipe to a T, without making them sandwiches but added the pecans. Because we love nuts, and the cookies are really soft (almost fluffy because of the cake mix), so I might've added more pecans. Love them! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Soli Beran"
},
"reviewBody": "My 2 year old and I went into a sandwich cookie frenzy and tried devil's food, red velvet, and lemon cake mixes. All turned out delicious however, VERY sweet when you add the cream cheese frosting. They were simple enough to make so that I could get my daughter in on the fun but way too sweet for my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bjaramillo"
},
"reviewBody": "Good recipe, my cookies baked too long and I have to redo them. Bake until they look like they need a few more minutes (underdone). Otherwise once they cool they will be hard and crunchy, I think they are much better soft. Frosting however I am rating seperatly, WAY too gooey for the cookie!!!!!!!!! 1 star"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "armywife9106"
},
"reviewBody": "I also used one stick of butter, two eggs, and one box of cake mix. Super moist and tasted awesome! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erz2002"
},
"reviewBody": "I made this with a carrot cake mix that needed to be used. I used a tablespoon measure and baked for 10 minutes, which was perfect. The only issue I had was that my cookies stayed kind of puffy, so perhaps I needed to flatten them slightly? I can't wait to try this with chocolate cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Kelly"
},
"reviewBody": "creative way to use boxed cake mix! will try it out with different combination of cake mixes and icing flavours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sorrbet"
},
"reviewBody": "My kids and I really love making these chocolate cookies. We've tried it with butter instead of shortening, and it gives it a rich taste. Be aware, though they were still soft, they were a tad crispier. I like them like that, though. On a whim, we tried a batch using cherry chip cake mix. My kids wouldn't touch them. They really weren't pleasant, and they kept gumming up and falling apart. The frosting couldn't even save them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leelo"
},
"reviewBody": "The Devil's food cake was too rich for us. We used butter instead of shortening. We love the softness of the cookie with the icing and will definitely try other flavors of cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Beth Aldridge Chinni"
},
"reviewBody": "I made the whole batch, thinking the extra would last...they did not! So good!!! I did not have shortening, so I used a stick of butter and 2 eggs. I used the Cream Cheese Frosting II by Janni on this site, which is nice and creamy and not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brown Eyes"
},
"reviewBody": "Loved these cookies! Very tasty paired with a peanut butter frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Civil Twilight"
},
"reviewBody": "OSM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Carey"
},
"reviewBody": "My family love these cookies! They call them homemade Oreos! They are just fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRIANNEK1"
},
"reviewBody": "These were great. I made them last week for a quick snack and boy were they quick. My boys loved them even without the frosting. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reenie"
},
"reviewBody": "I make these frequently (with my own cream cheese frosting) and they are always delicious. I've also used red velvet cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kita"
},
"reviewBody": "I love this recipe! Anytime I have to bring a desert this is my go to recipe. I even tried the \"name brand\" soft cookie only to feel like I wasted my money because these are way better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pml"
},
"reviewBody": "Mmmm, so yummy and so bad for you!! I made just as instructed EXCEPT cooked for 9 minutes and then cooled for 20 before frosting. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Roger Bender"
},
"reviewBody": "I wasn't crazy about these when we made them, but the next day they were much better. They were a little too cake like at first, but they firmed up by the next day and reminded me of the little debbie chocolate sandwiches you can buy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcey"
},
"reviewBody": "I made these with strawberry cake mix and made the cream cheese frosting II recipe from this site. I used butter instead of shortening since I don't care for using shortening. I only baked them 8 minutes and they stayed extremely soft. I left them on the pan for about five minutes and then transferred to a wire rack. The flavor is pretty good, but they got mixed reviews at work. One person said they were too moist and fell apart and got all over them! I might try them again with dark chocolate cake mix or spice cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pnuttyiest"
},
"reviewBody": "these are so easy and so yummy. I use dark chocolate cake mix instead of devils food.i use real butter in stead of the shortening.i only use pastry blender for part of it then dig in with my hands. i still use the cream cheese frosting (canned or homemade)but add flavoring to it. we have done mint, peanut butter, carmel, raspberry and banana. these are a favorite of our school's marching band during there 3rd quarter break at football games."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rcbyers"
},
"reviewBody": "Yum! Made as stated with cream cheese frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephsteph"
},
"reviewBody": "These are such a great twist on a regular cookie! The family loved them. I used spice cake instead if devil's food cake and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I made this for a cookie exchange with spice cake mix, cream cheese frosting and pecans, and everyone wanted the recipe. The dough is very thick and a bit greasy but the cookies came out amazing. I can't wait to try it with devils food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "I made these yesterday for a New Years Eve party and everybody really liked them,i rolled them into smaller balls and got many more than 12!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelligirl"
},
"reviewBody": "These came out really well for me, and tasted even better ! I used *very* soft unsalted butter instead of shortening, and after having a difficult time with the hand mixer (I don't have a pastry paddle) ended up using my hands to mix the dough. I used a level tablespoon for each cookie and they spread beautifully, just about the size of a \"Little Debbie\" Fudge Round or Creme Pie. I also used store bought frosting, all the \"whipped\" variety, in strawberry, chocolate, and whip cream flavors. The whip cream flavor was the best, but the chocolate (I'm a chocolate lover) was a very close second. I stored mine in tupperware and ziploc bags in the fridge and they kept well for more than 10 days. It's best to remove from the fridge and let come to room temperature for maximum softness. This is a VERY sweet cookie, especially with my filling choices, but I thought they tasted great and so did everyone I gave them to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Yost"
},
"reviewBody": "I made these cookies only with yellow cake and peanutbutter instead of the shortining. I also made homemade peanutbutter frosting and put that in the middle. My peanut butter lovers in my family really enjoyed them. They were bit HUGE and too much for the little ones though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "echocara"
},
"reviewBody": "everyone at work wanted the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovin'Louie"
},
"reviewBody": "Delightful! I used a cookie scoop to get consistency in the size. They turn out to be about 2 1/2in. cooked. I put the frosting in a ziplock and piped it on for easy. Tastes like the Oreo cakesters. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anna Vargo"
},
"reviewBody": "I always make several different cookies at Christmas and am always looking for something new. I make my cookies from scratch usually and i think that is why I did not care for the taste of this cookie. I was not impressed with the flavor at all. I used a good devils food cake mix and followed directions. The cookie by itself I felt was horrible. I used cream cheese store bought frosting that I had for the filling and that made the cookies at least edible. I did have a few people tell me they liked them. I have been making and giving cookies away during the holiday for years. ...I was not impressed with the taste of this recipe and will not be making again. I gave two stars because the flavor slightly improved when made into a sandwich cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V"
},
"reviewBody": "I made these cookies for friends and family along with a lot of other cookies. And everyone raved about them. My little brother who is 5 ate all of them and thats telling you something, because he is the pickiest eater I have ever known in my life. I used butter instead of shortening and they turned out amazing. I made my own frosting (2 8 oz packages of cream cheese, 1/2 cup of butter, 3 cups powdered sugar, and a tsp of vanilla extract) lets just say amazing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "I made these for Christmas. I used devils food cake and spice cake. Didn't change the ingredients (not much to change!) I rolled them in 3/4\" balls and flattened just a little with a glass. I used whipped cream cheese frosting for the filling. Out of all the different cookies I made, these had the most rave reviews. The spice cake was a bigger hit than the devil foods. But the devils food was also a hit. Soooo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanierowells"
},
"reviewBody": "very good cookie. They taste like whoopie pies. They are very sweet. I used a can of store bought frosting instead of the cream cheese frosting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "treyes"
},
"reviewBody": "Delicious and easy! I did not have devil's food cake mix so I used triple chocolate fudge cake mix instead and it was very tasty. The cookies seem tough almost hard but they might be my own flawed baking method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jaques"
},
"reviewBody": "4.5 stars! What a great way to use cake mix to make a quick chocolate cookie! They were soft and had good consistancy. They are good that day, but I must say that it decreased in taste in the following days. I just used store frosting and it was an easy way to make the sandwiches"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSCFOSK"
},
"reviewBody": "UNBELIEVABLE!!! In my husband's words \"this is a joke how good these are\"!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edie"
},
"reviewBody": "I used a banana cake mix, added flaked coconut and filled with dark chocolate frosting. Very sweet. Husband loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzy636"
},
"reviewBody": "Very yummy. However, if you don't have a pastry blender, I suggest using butter and eggs instead of shortening. It will mix much nicer this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tb_carlile"
},
"reviewBody": "Recipe was easy and made a ton of cookies. They were really sweet. I made the cream cheese frosting attached but used peppermint extract instead. Everyone really liked them. I thought they were just too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valscookin2"
},
"reviewBody": "Loved 'em! I used cream cheese frosting, very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sue"
},
"reviewBody": "Tasty and kind of fun to make but you don't get a lot of cookies out of the cake mix package. Recommend you put some oil on your hands before you roll the chocolate glop into balls. Makes it easier to handle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSSTEFANSKI"
},
"reviewBody": "These are really good, I used a Vanilla cake mix and added pecans and vanilla extract to make a butter pecan cookie, and also as others did I used the butter and 2 eggs instead of shortenting, not a fan of it. Will make again with different cake mixes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gailb"
},
"reviewBody": "These were quite good. Made the fluffy peanut butter frosting from this site for the filling. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mom of Two"
},
"reviewBody": "Super easy and very tasty! I put vanilla icing in middle and everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ednichol"
},
"reviewBody": "I loved these cookies! I happen to adore Oreo Cakesters and these hit the spot! They are very rich, however. I could only eat one, but that's perfectly fine because I made the sandwiches, wrapped them individually in plastic wrap, put them in a freezer bag, and popped them in the freezer. Whenever I get a craving, they're right there. They even taste better to me a little cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "homeschoolmom"
},
"reviewBody": "Tasted delicious but I think rounding to the size of quarters was too small. They turned out small and didn't flatten real well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "craftyginny"
},
"reviewBody": "Followed recipe exactly. WEre so easy and tasts great. Next time i am going to fill with a peanut butter frosting. This was very quick and easy. I need to freeze them for the holidays because my hubby is devouring them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "Fantastic! So easy and they taste fabulous! Kind of like \"Oreo Cakesters\" but better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ZOPOOH"
},
"reviewBody": "I just made these and I have to say I'm pretty disappointed there is hardly any chocolate flavor ( and I don't even really care for chocolate). And despite others complaining of the cookies spreading alot mine barely spread at all the were very thick because of it. I'm not sure whether this was a result of using the shortening or not. I will try again using butter and report how it turns out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SarahD"
},
"reviewBody": "TOO SWEET!!!!!!!!!!!!! I would recommend using a filling that is not too sweet. Also, probably better to make them much smaller since they are so sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Schwartz Frisbie"
},
"reviewBody": "Very good and super easy! I think these would make excellent ice cream sandwiches, too. After having success with Devil's Food, I tried to use Red Velvet to make a more fastive looking cookie. But the dough turned out way too sticky and I had to add lots of flour to form them into their cookie shape. That resulted in the cookies not flattening out at all which made them too bulky for a sandwich. I just put the icing on top and they are \"ok\" but not nearly as delicious (or as easy) as the chocolate variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bebe"
},
"reviewBody": "Wow these are easy and really good I made them with Choc and (Lemon the best) and Spice I used crisco butter instead of shortning made them really soft and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisarcg"
},
"reviewBody": "These cookies were awesome. They remind me of the Cakester Cookies that you buy. Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rw"
},
"reviewBody": "I use 1 box devils food cake mix, 1 egg, 1/2 cup peanut butter, &amp; 4 oz cream cheese. Roll into balls and press down like peanut butter cookies. Cook at 350 for 8 minutes. After cool frost w/ cream cheese icing!! Amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "belindabg"
},
"reviewBody": "I give these 5 stars for taste and appeal. Easy to make, just don't frost them til they are all the way cooled or they will slide around. These are tasty, chewy, and an easy 'fancy' cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monique_anne"
},
"reviewBody": "Love it, love it, love it!! How easy are these cookies?! I put one box spice cake mix, two eggs and 1/2 cup of shortening all in the food processor with the dough mixer. Press the button and the dough is mixed without any effort. Easiest cookies I have ever made and taste great. Thanks so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamaby"
},
"reviewBody": "These were wonderful. I used cream cheese frosting for half of them and marshmallow fluff for the other half and both were fabulous! The cookies were easy to make and very tender, with a very chocolately taste. I'll be making them a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "seschafer"
},
"reviewBody": "I did not have a pastry blender so I used just a regular mixer which was a little messy. The cookies cooked about 16 minutes instead of 10. They turned out very soft. I used store bought cream cheese icing and the sandwiches were very yummy. Got to love sweets to really enjoy these cookies. They are great with a glass of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weedybomber"
},
"reviewBody": "They are delicious but it would be nice to make them before hand and have them ready to go in the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "They are delicious but it would be nice to make them before hand and have them ready to go in the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Swisher Singhass"
},
"reviewBody": "Just made these for my company Christmas \"goody\" day... and they're delicious! So soft and rich! I followed the recipe exactly, but used a can of store-bought icing rather than making my own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elizabeth"
},
"reviewBody": "i used strawberry cake mix and the cookies turned out wonderfully. 12 minutes at 350 degrees F. i took another reviewers advice and made the Cream Cheese Frosting II recipe. these cookie sandwiches were pretty and pink and DELICIOUS!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9990/homemade-chocolate-sandwich-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
"name": "Sandwich Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9990/homemade-chocolate-sandwich-cookies/",
"name": "Homemade Chocolate Sandwich Cookies"
}
}
]
}
}
, "about": [
]
}
]