				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Manti (Traditional Turkish Dumplings)"
,"datePublished": "2020-06-18T23:33:20.000-04:00"
,"dateModified": "2022-10-24T14:46:36.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Asli Ocak"
,"url": "https://www.allrecipes.com/cook/2023277"
}
]
,"description": "This manti recipe for boiled dumplings with seasoned ground meat wrapped in homemade egg pasta is served with garlicky yogurt sauce and pepper oil."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Y9SOFKQaueOf5LORxX3VK1h6iBM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5119117-homemade-manti-traditional-turkish-dumplings-Will-Finley-4x3-1-467109515d8143e9a1b679ba9e363744.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Manti (Traditional Turkish Dumplings)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "38"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "560 kcal"
,"carbohydrateContent": "64 g"
,"cholesterolContent": "120 mg"
,"fiberContent": "4 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "440 mg"
,"sugarContent": "9 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"2 cups all-purpose flour, plus more for dusting",
"0.5 teaspoon salt",
"2 large eggs",
"0.5 teaspoon water, or as needed",
"2 onions, peeled",
"0.5 pound ground beef",
"salt and pepper to taste",
"3 tablespoons vegetable oil",
"1 tablespoon red pepper flakes",
"1 (8 ounce) container plain yogurt",
"1 tablespoon minced garlic" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make dough: Combine flour and salt in a large bowl. Add eggs and water, mixing well with your hands. Add more water, if needed, to form a soft dough. Cover and set aside for at least 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Make filling: Shred onions and place them in a colander or sieve set over a bowl; drain and discard juice. Combine drained onion, ground beef, salt, and pepper in a medium bowl; mix well with a spoon until mashed. Set filling aside."
} ,{
"@type": "HowToStep"
,"text": "Lightly flour a work surface and a large plate."
} ,{
"@type": "HowToStep"
,"text": "Divide dough in half. Working with one piece at a time, roll dough on the floured surface into a rectangle as thin as possible. Cut into 2-inch squares using a knife or pastry wheel."
} ,{
"@type": "HowToStep"
,"text": "Place about 2 teaspoons filling in the center of each square. Gather the edges of dough and pinch them together at the top to form a bundle. Transfer manti to the prepared plate; sprinkle more flour on top to prevent sticking."
} ,{
"@type": "HowToStep"
,"text": "Make oil: Heat oil and red pepper flakes in a small skillet over low heat just until pepper flakes begin to color oil. Remove from heat and keep warm."
} ,{
"@type": "HowToStep"
,"text": "Make sauce: Stir together yogurt and garlic in a small bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of salted water to a boil over medium-high heat. Cook manti in boiling water until filling is no longer pink and dough is tender, 20 to 25 minutes. Drain well."
} ,{
"@type": "HowToStep"
,"text": "Divide manti onto 4 plates. Spoon yogurt sauce over manti and drizzle with pepper oil."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very delicious try and see"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Montoya"
},
"reviewBody": "I have made these dumplings for years\n\nmy family makes a mashed potatoe cheese mixture don't use milk with potatoes or butter also make a cabbage filling these are great once boiled with butter and onions I wasn't crazy about the sauce it was ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Sutton"
},
"reviewBody": "Very delicious! A bit time consuming if making this yourself, but the flavor and quality was well worth the labor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne Reed"
},
"reviewBody": "I made this for a group consisting of Armenians, Russians, and Ukrainians (I'm none of the above!) They all loved it and said it reminded them of home.\nWhen I make it for myself, I add an egg and some corn flour (not cornstarch) to the filling mixture, as for meatballs. Makes it a little juicier.\nI eat them floating in chicken broth, with a dollop of yogurt sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lea011"
},
"reviewBody": "Partner is Turkish so he was thrilled I tried to make this.... turned out well tasted lovely. Only part I had a little fail with was I made them slightly too big hahaha."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jocelyn Wang"
},
"reviewBody": "This turned out so wonderful for me, although I did have to make some slight modifications. \n\nI followed this woman's instructions verbatim for the dough and was very confused because 1/2 teaspoon of water did not seem enough for 2 cups of flour. I added a little bit of water here and there as I went along to get it to the consistency I was looking for. I don't have much experience with dough so this was definitely a learning experience for me. It was a little hard to roll out, but ultimately I was able to work with it and the dough tasted good!\n \nAs for the filling, I just used 1 lb of beef and froze whatever was left over, and for that 1lb of beef I only needed 1 large onion (which still may have been too much). Not sure how small this woman's onions are but 2 onions for 1/2 lb beef seems like too much!\n\nAlso, shredded onions struck me as very strange (aka I had no idea what that even meant) so I just very finely minced it. \n\nI made my manti very bite-sized and tiny, and ended up probably throwing about 15 in to boil at once. 20-25 minutes seems like an outrageous amount of time to cook it for. I cut into two dumplings about 5 minutes in (boiled on high) and the beef was fully cooked. However, depending on the size of your manti this may differ.\n\nThe yogurt sauce I kept as is, and I was more generous with the crushed red pepper and oil mix- I love sauces so I doused my dumplings. I ended up garnishing with some parsley and it was super tasty. I'll definitely be coming back"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorudgar"
},
"reviewBody": "Definitely will cook it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saabirah J. Dennard"
},
"reviewBody": "I made it with beef, tasted great I added sumac to the red sauce gave it better flavor.took a long time but I'm horrible with dough so def. My problem, i made it twice and trying again want to be able to make them small. Thanks love Turkish food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Delicious and different. Very enjoyable. We've made it several times and it was delicious every time. We usually mix in some veggies with the meat for the dumplings and season them with varying spices depending on our mood. But it's always delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pange-pie"
},
"reviewBody": "Delicious my fiancé is turkish Cypriot and we have this meal when we eat out sometimes so I thought I would surprise him with this recipe and it was so good in fact better than some restaurants will definitely be using this recipe a lot :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PixieMama"
},
"reviewBody": "Thank you so much for sharing this recipe and for the comments from the other members. I tried this last night and it turned out great. I had to rush to get ready for work in between making dinner and helping with homework, and I did not have a lot of time, so I did make a few revisions, some based on comments(I'm sorry if the revisions offend anyone). I browned the hamburger with chopped onion, garlic powder, salt and pepper, then added some finely chopped zucchini that I had in the freezer to the sauteed mixture, and drained it. I doubled the dough recipe, and used suggestions from another commentor: 4 tbsp water, 1 tbsp olive oil, 1 tbsp milk (double from from there). I still had to add a lot more water to form it into a ball. I did not have time to let it rest for more than a few minutes, so I halved it, rolled out one at a time, (not easy without a rolling pin- glass cups are NOT a very good substitute!) and cut it into about 2x2 inch squarish shapes. I was in a hurry, so many of them were larger. It was also thicker than recommended, but it still tasted good. Added the beef mixture and sealed, placed on a cookie sheet for 10 minutes in 325 degree F oven. Then boiled for about 10 minutes in the salted water. Served with ranch dressing. Even my picky six year old thought they were great. Not as authentic my way, but very cheap to make and tastes great. Thank you so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JohnH"
},
"reviewBody": "Made this for my Turkish wife before we were married &amp; before I'd had much exposure to Turkish cuisine (can't get enough now!), and she loved it ... The only problem was that the recipe as printed doesn't give a great idea as to the scale of the dumplings, and I made them about 12x larger than I should have. Giant manti I made. But my wife said the taste was spot-on, and she loved them. My giant manti are now a running joke between us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Mayer Kaelblein"
},
"reviewBody": "I just prepped the manti and it went smoothly. One HINT that i will suggest that worked quite well is that I used my pasta machine to roll out the dough. It was the easiest way to get the dough quite thin. The flavors are so great. I did happen to have some sumac so I topped it off with that as seen in one of the reviews. will make again and even for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "This recipe is very close to the recipe that my family makes for years just without these sauces. I think 2 eggs is too much, so I use 1 egg and more water instead. The dough comes out great. I used beef and added a little cream to the filling. Then I froze the dumplings for at least an hour. We always do it, I don`t know does it make the difference, but I think it prevents from tearing when you boil the dumplings. The yogurt sauce is great for the dumplings, although we didn`t like the pepper oil (not hot and a little oily). Overall this is a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Yoder Mama"
},
"reviewBody": "Neat idea but the meat had no flavor and the dumplings were a pain to make. The sauce needed improvements as well. Celery salt seemed to help the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "witchywoman"
},
"reviewBody": "These are a lot of work, but worth it in the end. Great recipe, thanks for submitting it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dbeshir"
},
"reviewBody": "when i made them, they werent good at all. its very dry, and my family and i didnt enjoy it. i tried to so many ways to enhance the flavor, but no luck. you should try changing some ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yummy"
},
"reviewBody": "Excellent! I ended up putting 4tbsp of H20 and 1 tbsp of milk, and 1 tbsp of olive oil in to the dough. Otherwise it would have crumbled. Delicious, I cooked 20 min and they were really al dente. Next time I will boil (on low) for 25 min. Also, very helpful to look at Asli's 4 pictures. I did not realize until later that she does not use 2 squares to make a dumpling--but one (simply pinching the edges up). Definitely a keeper, the whole family enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elisabeth Thomas"
},
"reviewBody": "The yogurt and oil sauces really make this dish. They are wonderful, and I suspect that I will use them on other meat dishes (meatballs, kebabs, etc.) in the future. The dumplings are also quite good. The first time I made this, I cheated and used pre-made wanton wrappers because I was short on time. They were a bit slimy for my taste, and most of the dumplings fell apart while cooking. It wasn't a total flop, but I won't make them like that again. Second go around, I followed the recipe as written. I had to use quite a bit more water for the dough than stated, but the dumplings were fabulous and I had no problems with them falling apart. This recipe is definitely a lot of work, but it is worth a try if you have a free evening . . . or, better yet, a free evening and afternoon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emerald2212"
},
"reviewBody": "Perfect dish! I think I made mine a little too big, but everything still tasted wonderful. I will definitely be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'mama08"
},
"reviewBody": "I really loved the dumplings. Since I live in quite possibly the most meat and potatoes house in the world, I knew there was no way I could get away with the yogurt/hot pepper sauce. SO I improvised with cream of chicken soup, broccoli, milk, pepper and parsley. (It made a sort of sauce)It was delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "five1313"
},
"reviewBody": "I made these for some Turkish people whom came to work at my job for the summer. They loved it. Turns out after you make manti, you bake it on 325 for 15 mins then boil for 10 mins. The dough should be close to paper thin, like phyllo dough, and they said they should be able to fit close to 40 pieces of manti into one spoon full..... That part kinda blew my mind. Had to 86 plain yogurt and sub it with ranch. 2 cups Tomato sauce with 1/5 cup butter and 3 Tbsp pepper flakes instead of oil. It came out pretty amazing, S&amp;P to taste. Going to try this one again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Franny Le Grand"
},
"reviewBody": "Yum! This was delicious! I added a little salt to the yogurt, but the spice from the red pepper flakes was a nice touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tallya"
},
"reviewBody": "This was perfect! I thought it might not be salty enough and added salt on top of the yogurt but turned out it was too much. Next time I'll follow the recipe exactly. I froze half the manti, will use real soon. My husband is from Kazakhstan and they make manti alot bigger and with minced pumpkin along with the meat in the filling, and they are steamed not boiled. In my opinion these were a lot better! Loved yogurt and oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fakeymcfake"
},
"reviewBody": "Great instructions, my family (and some others) enjoy the butter sauce with some tomato paste stirred in, makes it richer imo. Also, if you can get a hold of dry sumac, a pinch of it is the perfect topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asli Ocak"
},
"reviewBody": "thx for everyone for trying this recipe hope u enjoy with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tonton"
},
"reviewBody": "Asli this was so easy to make!!! My husband's side of the family is Crimean(Kirim) and they make manti so good! So I took at this with my non-Crimean self and I must admit it came out FABULOUS!!! I made a yogurt sauce with mint, a little oil, red pepper flakes, black pepper, garlic and a touch of salt. YUM!! Thanks again Aslicigim!!!! :)) Tebrik ederim! Cok guzel olmussunuz!!! Allah tamamini erdirsin!!!! Aslicigim emailim yazdim bu reviewa ama nedense kabul etmiyor...ve soyle yazayim umarim anlasilir..tkr ederim...sende cok talisin!!! resimlerine bayiliyorum...ne guzel ailelenle bu kadar yakin olman!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa"
},
"reviewBody": "I dont like anything too spicy so I substitute the red pepper flakes for tomato paste (or salca here in Turkey). It is cooked and used the same way as the red pepper sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama & her Girls"
},
"reviewBody": "Great and easy to follow recipe. I found that 2 eggs made it eggy and I used 1 instead. I had to increase the amount of water but it turned out great.\n\nThanks for a great recipe that my whole family enjoyed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gonzo"
},
"reviewBody": "Whew!\n\nThis is not a recipe for beginners!\n\nIt took me about 2 hours of straight work to get this recipe finished. It was really awesome when we actually got to eat. I was proud, but exhausted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J"
},
"reviewBody": "I loved this recipe and so did my family. If you were in a hurry you could use pre-made wonton wrappers instead of making the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "capedread"
},
"reviewBody": "I visit Turkey a lot and had to try this recipe for myself. well set out and easy to follow helped a lot as for the meal itself got raves from the family.\nwill make this again\ndefinitely a keeper thanks for the post"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/154920/homemade-manti-traditional-turkish-dumplings/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/154920/homemade-manti-traditional-turkish-dumplings/",
"name": "Homemade Manti (Traditional Turkish Dumplings)"
}
}
]
}
}
, "about": [
]
}
]