				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Fresh Pumpkin Pie"
,"datePublished": "1998-10-27T13:45:00.000-05:00"
,"dateModified": "2023-01-25T15:47:31.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Randy Scott"
,"url": "https://www.allrecipes.com/cook/24326974"
}
]
,"description": "Delicious homemade pumpkin pie made with mashed, cooked pumpkin. Skip the canned stuff and make this classic rustic Thanksgiving pumpkin pie from scratch."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/oRURpOkbOgy8qkhZBeQVmAWio9M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/13711-homemade-fresh-pumpkin-pie-mfs254-927f6526424746a1bc204f544f064231.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955994180001",
"description": "See how to make homemade pumpkin pie using fresh pumpkins.",
"duration": "PT3M33S",
"name": "Homemade Fresh Pumpkin Pie",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/11/16/13711-homemade-fresh-pumpkin-pie-mfs253.jpg",
"uploadDate": "2021-06-28T19:52:14.336-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Fresh Pumpkin Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "838"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "363 kcal"
,"carbohydrateContent": "44 g"
,"cholesterolContent": "60 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "365 mg"
,"sugarContent": "26 g"
,"fatContent": "18 g"
,"servingSize": "1 8- or 9-inch pie"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.3333333730698 cups all-purpose flour",
"0.5 teaspoon salt",
"0.5 cup shortening",
"3 tablespoons cold water, or more as needed",
"2 cups mashed, cooked pie pumpkin",
"1 (12 fluid ounce) can evaporated milk",
"2 large eggs, beaten",
"0.75 cup packed brown sugar",
"0.5 teaspoon ground cinnamon, or more to taste",
"0.5 teaspoon ground ginger, or more to taste",
"0.5 teaspoon ground nutmeg, or more to taste",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make the pastry crust: Mix flour and salt together in a bowl. Cut in shortening with a pastry blender until mixture resembles coarse crumbs. Mix in 3 tablespoons water, one at a time, until dough is moist enough to hold together. Add up to 1 more tablespoon water if needed."
} ,{
"@type": "HowToStep"
,"text": "Shape dough into a ball with lightly floured hands. Roll dough on a lightly floured surface to a thickness of 1/8 inch. Place an 8- or 9-inch pie pan upside-down on the dough; use a sharp knife to cut a circle of dough 1 1/2 inches larger than the pie pan. Remove and discard dough scraps and set pie pan aside."
} ,{
"@type": "HowToStep"
,"text": "Gently roll circular piece of dough around the rolling pin; transfer it right-side up over the pie pan. Unroll, easing dough into the bottom of the pan. Use two hands to flute the dough around the top edges."
} ,{
"@type": "HowToStep"
,"text": "Make the filling: Beat pumpkin, evaporated milk, brown sugar, eggs, cinnamon, ginger, nutmeg, and salt in a large bowl with an electric mixer until well combined. Pour into the prepared crust."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a knife inserted into the filling 1 inch from the edge comes out clean, 40 to 60 minutes. Cover the edges with foil if needed to prevent from burning as the filling cooks."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/oRURpOkbOgy8qkhZBeQVmAWio9M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/13711-homemade-fresh-pumpkin-pie-mfs254-927f6526424746a1bc204f544f064231.jpg"
}
]
,"text": "Remove from the oven and cool to room temperature before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I found the most beautiful white pumpkin on the street. I washed the skin and cut the skin off and cleaned out all the strings. Since I am on a cardiac diet, and because I didn't have all the ingredients, I made adjustments to the recipe. I baked the seeds with onion flakes and garlic powder in olive oil at 375 for 15 minutes for a snack while I worked on the crust free pie. I then pressure cooked the pumpkin meat with a little water for 15 minutes. I drained the water off. I then put it in the food processor. I am on a diet so I left out the crust. I greased a square 9 inch pan. I put all the ingredients together with a bit of gluten free baking mix because I am in high altitude. I substituted eggs with egg whites only, and left out the salt. I didn't have all the spices handy so I used two heaping teaspoons of apple pie spice. I also can't use regular milk so I substituted vanilla almond milk. Thank the Lord, it was just so delicious I can hardly speak. I baked it for more like seventy minutes because of high altitude. It taste a bit like apple pie. It was creamy with a little crust of its own. THANK YOU! I was just so blessed to find the pumpkin. The recipe was helpful to put it all together, thank you very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Fulbright"
},
"reviewBody": "The crust was pretty small to roll out and the filling was incredibly bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgood8175"
},
"reviewBody": "Love this pumpkin pie, I added 1/2tsp of clove, 1 tsp vanilla and 1 TBSP of Baking Soda, takes 60mins on convection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Ok, so when I baked the pumpkin I added a sprinkle of cinnamon and butter along with a few slices of fresh ginger. Added vanilla to the mixture and this was the best pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bird"
},
"reviewBody": "Made this recipe just as described. Not too sweet like some other recipes can be. Tastes even better the econd day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bu99ies"
},
"reviewBody": "I read some comments saying it was bland, so I added allspice and vanilla, did not use ginger. the pumpkin I used for the filling had been baked, and I used 1 cup white sugar rather than 3/4 of brown sugar, and added a little butter. The crust came out amazing, I subbed butter instead of shortening, and Everclear instead of water. And my fiancé made some delicious maple whipped cream to go on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "Just perfect. Easy to make and needed no adjustments. Was a hit with the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Was beautiful and delicious pie I will use all the time now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I too baked my pumpkin instead of stove top method. I doubled the recipe and it turned out Beautifully and was so Delicious. I highly recommend this recipe. I was a little redundant with my spices because I used allspice, cinnamon, pumpkin pie spice, and cloves. I know the pumpkin pie spice or the all spice was enough but I like it spicier it taste better to me. I did not use extra nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EJK"
},
"reviewBody": "Followed it to the letter. Terrible pie. Not sweet enough or enough flavor. I realize pumpkin is in the squash family, but squash tasting pie was not what I was hoping for. I made one for me and one for my son. It’s so awful that I won’t give the pie to my son. I made him one from canned pumpkin. I know the pumpkin I bought was a pie pumpkin. I’ll stick with canned from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn’t follow the recipe exactly. I doubled it, baked the pumpkin for 1 hr at 400 instead of boiling and used one heeping tablespoon of pumpkin pie spice instead of following the spices in the recipe. I also bought premade pie crusts. I got two very full pies and a median ramican worth from doubling it. Thoughts: -this is the best tasting pumpkin pie I have ever had! -the texture is not as silky as when I use canned pumpkin. Next time I will put it in the blender before baking to get a smoother texture. I would 100% recommend this recipe and make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This came out AMAZINGLY good and i will always use this recipe for my pumpkin pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I trusted this recipe without much thought and threw 3 pies away. Pies were litterally inedible because of the flavor. Equal parts ginger cinnamon and nutmeg? Like seriously thats your final answer? You tried others and THIS was the best? Litterally no way. Yes I added the sugar, yes it was good pumpkin but this was a recipe from another planet. Should've called it ginger pumpkin pie. If you're reading this, please be advised and compare this recipes flavor profile with others. It's wrong. It doesn't have pumpkin pie spice. It doesn't taste like pumpkin pie spice. GUH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jesse Cornwell"
},
"reviewBody": "Add some pumpkin pie spice and clove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it is simple and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time making fresh pumpkin pie family was excited for fresh no more canned pumpkin for this family,and the recipe was not intimidating this is going to be put in my favorite recipe binder,Happy Thanks giving"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Brothers"
},
"reviewBody": "This is a great recipe. The pies (2) were delicious and well received by my family. One question: At what temperature do you bake the whole pie? I did not see where the temperature was lower than the 375 degrees that you are- bake the crust, so I kept it there for the final pie baking- but took it ou at around 50 minutes instead of 60 minutes. The center was not jiggly as you described in your recipe. Please advise if this temperature was too high- or okay Thanks for posting this rich and delicious recipe! P.S. I did not garnish with the leaves or cranberries, but was eaten with homemade whipped cream as is my pie tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie C"
},
"reviewBody": "This was a delicious pie although I have to admit that I made a couple of changes as I discovered I only had a 5 oz can of evaporated milk. I used the 5 oz and substituted 7 oz of half and half for the rest. I added an extra egg to insure that the pie would set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bevm"
},
"reviewBody": "Great as is and sugar is listed as some didn’t read the recipe correctly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent. Basically followed ingredients as directed, but baked/roasted pumpkin instead of boiling (as per some comments about it being 'watery') and used store bought pastry crust. Not confident I could pull that off - didn't want to jeopardize the dish with a poorly made crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "montwayne"
},
"reviewBody": "Love it. This pie is the lightest pumpkin pie I've had. I cut back on the sugar. I bake, rather than boil the pumpkin. I've stored baked, pureed pumpkin in the freezer for as long as 8 months. Still made great pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The filling was great but the crust was super bland, could definitely benefit from a graham cracker crust instead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This pie is so yummy I've been making this pie recipe for about 5 years . My Family Enjoys this pie its very easy to make. The spices are well balanced Thank You."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The last couple of years for thanksgiving I have made this filling with gram cracker crust my friends are family love it!🥰"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Robert Bunner"
},
"reviewBody": "Trusted the recipe, end up losing money on 4 pies. No sugar, no flavor, worst reciepe I ever followed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "An amazing recipe - not too sweet, not too spicy! Doesn't come out as orange as the photos but delicious nonetheless. Mine was a little runny as well, so I took the advice from another review and added some cornstarch. Mine also didn't make two full pies so I ended up making mini pies in a muffin tin with the leftover filling. Cooked my pie pumpkin in the oven by splitting it in half, cooking at 375 for 45-55 mins, and then pureeing and letting it drain in a cheesecloth + fine mesh strainer. Absolutely give this recipe a shot!! Super simple and perfect for fall 🥰"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherin Mann"
},
"reviewBody": "Easy to prep and make. I used two little sugar pumpkins from the garden and subbed in a little butternut squash to get my last cup for a double batch. I also used pumpkin pie spice for extra zip and store bought crusts. In the oven baking. House smells great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This Pumpkin Pie is a simple recipe hat I thoroughly enjoyed making. I did however change the recipe slightly to cater for 12 servings and along with that I changed from carnation milk to a table spoon of condensed milk and a cup of whipped whole cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "Great recipe, everyone loved it and I will be using this recipe from now on! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheska189"
},
"reviewBody": "My go to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twallace"
},
"reviewBody": "It was a hit! Made this for Christmas, and used a 10” glass pie plate, so doubled the recipe. The filling went right to the top and edges of the crust! and therefore took a LOT LONGER to bake! At least doubled the baking time. But it was sooo good and thick!! Would suggest adding a wee bit of sugar to the whipping cream as you are whipping it, if you want a bit sweeter and decadent topping (not needed though)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Novice Tim"
},
"reviewBody": "Accidentally doubled the pumpkin but not everything else. Still good but I am sure it is excellent if I did the proportions correctly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chyme_blimp0k"
},
"reviewBody": "My husband loved it, but I did add 1/2 tsp of ground clove as well. It was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob P"
},
"reviewBody": "I added 1/4 teaspoon of cinnamon. Everyone raved about how good it tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Redshaw"
},
"reviewBody": "I will definitely make it again my family really like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edward Delfino"
},
"reviewBody": "Very easy and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindybunce79"
},
"reviewBody": "It was perfect the way it is. Just need to make homemade whip cream and enjoy it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kiboppinlula"
},
"reviewBody": "SO crazy delicious!! I cooked three pies, 'cause I had two little pumpkins to start with, along with enough of everything else to expand the recipe ~ and also cooked this recipe with Truvia instead of sugar. I stopped eating sugar for health reasons in June of this year (have lost 36 lbs. and feel SO MUCH BETTER!), and have found this product to be BY FAR the best for baking. It is sweet with no aftertaste, and also does nothing odd with one's digestion. \nThese pies are DELICIOUS!! Thanks, allrecipes. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwsuba"
},
"reviewBody": "It was absolutely perfect....but I added a cup of white sugar and a teaspoon of Cinnamon in addition to the recipe because I like the sweetness and the kick of the spice...and the smell, wow. I also added candied walnuts to the top right after it pulled it from the over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kpfrenz"
},
"reviewBody": "The crust was fine. Pretty standard. The filling, however, was liquid. I followed measurements and instructions to a T, drained the pumpkin thoroughly, and beat the eggs beforehand. It was still soup. I had to deep clean my kitchen afterwards because it splashed everywhere. Turned out soggy. You'll definitely want to blind bake, and less evaporated milk maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My first time making pumpkin pie. It was missing a spice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Edwards"
},
"reviewBody": "Super easy and delicious! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "qwmghrt77g"
},
"reviewBody": "very easy!! tastes great! I used pumpkin I canned 2 years ago!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "I have made this recipe before but I used store bought pie crust. And with the pumpkin I cut it in half length wise scooped out the guts put them on a cookie sheet rubbed some olive oil on the skins and baked in a 400* oven for 1 hour then let it cool a little and peel off the skins and put it meat of the pumpkin inn a food processer and process till it's smooth and there are no chunks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "adrienne_twin"
},
"reviewBody": "I think the recipe is great, although I add a bit more cinnamon and use fresh nutmeg. My issue is with the pumpkin preparation notes: The key to pumpkin pie is the properties of the pumpkin. The best to use has firm, dense flesh, and low water content. You should never boil pumpkin as it adds water. Instead bake until fork tender. Pumpkin varietal matters, the best are Fairytale, Jarrahdale, and Dickinson- that do not require straining. If you cannot acquire one of these: bake your pumpkin, scoop out the flesh from the rind, and set it in a strainer pushing the excess water out before pureeing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chinagirlcooks"
},
"reviewBody": "I made this tonight but added 1.5 tsp of honey and I think it turned out fine. I used two sugar pumpkins and I have enough for about ten pies (I boiled the pumpkins and mashed them with my food mill.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "j_niner"
},
"reviewBody": "I used my own crust, but the pie was good! I added an extra cup of (fresh) pumpkin too. Next time I would double the spices and add a little extra brown sugar for added flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dmarie"
},
"reviewBody": "This recipe is truly the best pumpkin pie I have ever made. I never liked fresh pumpkin pie. But finally I have found the best. Its a big hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "summeragonzales"
},
"reviewBody": "Loved the filling!\nI would double the crust recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Peters"
},
"reviewBody": "I used a store bought crust but I used this recipe for the filling. First time I ever made my own pumpkin puree and pumpkin pie but I think it turned out awesome! The taste is very good. Things I noticed is mine was watery when I poured it into the crust. After the 40min at 400 it was very jiggly so I lowered it to 350 and baked it another 20min. I think it got brown in the middle/top because there was some foam on there after I poured it in. I loved the recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Peggy Trujillo-Lawrence"
},
"reviewBody": "The spices need to be doubled at least and the sugar needs to be decreased. The pie had a beautiful consistency but was so bland I won’t eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "frontieroilgas"
},
"reviewBody": "And Preheat for 400, but reduce temp after 15 minutes to 350."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephany Barnes"
},
"reviewBody": "Ive done this recipe quite a few times. Ive used ready made crust, homemade crust, and the crust in the recipe. Ive added different things to experiment and have good and bad results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "Perfect spice ratio and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mezan Ayoka"
},
"reviewBody": "Needed more spices. Will try adding vanilla, cloves and allspice as suggested. Otherwise was really easy to make. The crust is delicious and had a crispy texture (which I like). I melted the shortening. I doubled the recipe (except for the milk) and made two pies, one with store bought crust and one with the homemade crust. Much prefer the homemade crust. Made with a pumpkin from my garden, so really fresh. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "moby2712"
},
"reviewBody": "Have used this recipe to make pumpkin pie many times and the pie filling recipe is exceptional. \nHowever the proportion of flour to shortening and water in the pie pie crust recipe is incorrect and it does not produce good pastry that can be easily rolled. I use a different pie crust recipe that produces much better results (Best Ever Pie Crust on this site.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matilda Larson"
},
"reviewBody": "I adjusted the ingredients to 1.5 times to fill 2 pie pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Robinson"
},
"reviewBody": "This recipe is really good! I made it for Thanksgiving with fresh pumpkin that I had baked previously. Using fresh pumpkin makes this pie extra delicious and it is so easy to bake a pumpkin! I made this recipe again today for Christmas dinner. I am sure it will be a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DavidR"
},
"reviewBody": "I followed through the whole recipe except for changing one ingredient. It did not come out the way that I expected. My advice is don't change any of the ingredients and see how it comes out before you change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derek Nietz"
},
"reviewBody": "Delicious, not too sweet let's the spices shine. Had an extra pumpkin from Halloween so we used it. Had to cook the pie a little longer than suggested. Came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Kassahn"
},
"reviewBody": "Made this gluten free and cooked in a convection microwave 25 minutes instead of 40. Added swerve instead of brown sugar, so upped that to 1 cup. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fredrick Seiler"
},
"reviewBody": "Not being too experienced at baking, I found this surprisingly easy to make. Can't imagine why anyone would settle on canned pumpkin when using fresh is so easy. I probably should have used a different variety of pumpkin though, as the pumpkin I used was a Jack O' Lantern variety. And the crust was also easy to make. There's definitely a world of difference between this and using canned pumpkin and premade crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SaraC"
},
"reviewBody": "The only change I would make is to bake it about ten minutes longer, until a knife inserted about two inches from the crust comes out clean. Then the pie will be firmer after cooling. I've made it twice and it is really delicious. And got rave reviews from my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christina"
},
"reviewBody": "My family and I LOVE this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzieb8888"
},
"reviewBody": "I love this recipe. I made it twice and it came out great both times. I substituted cloves for the ginger and I blended the mixture in my Ninja blender. I think the amount of sugar is perfect and it is not super sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lela Gibson Ford"
},
"reviewBody": "Great recipe! I used canned pumpkin (15 oz.),\n1 &amp; 1/2 tsp. Pumpkin pie spice instead of other spices and about 1/16 tsp. cardamom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KitKat"
},
"reviewBody": "This pie is so good. It’s great with vanilla ice cream or whipped cream on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brendav"
},
"reviewBody": "This pie is so easy and it turns out fabulous. I like using fresh pumpkin because there is just nothing like fresh and you can control what goes into your pie. Being diabetic, I can make a pie that I can eat and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Robertson-Waite"
},
"reviewBody": "The story of a pumpkin \n\nI added a dash of cloves but otherwise left it as is! Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Shepard"
},
"reviewBody": "I had used a graham cracker crust and it turned out better than expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billie Bess"
},
"reviewBody": "Its delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buttery pretzels"
},
"reviewBody": "I baked it perfect and it is yummy. Best homemade pumpkin pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joani Wazny"
},
"reviewBody": "This recipe is as close to Moms as I could find.... They turned out BEAUTIFULLY.... can’t wait to eat them on Thanksgiving Day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne Collins Reinhart"
},
"reviewBody": "yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Hutto Haney"
},
"reviewBody": "Easy, looks good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Rabideau"
},
"reviewBody": "I added 1 teaspoon cornstarch and a pinch of cloves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had never made a pumpkin pie from scratch before and not only was this recipe easy to make but it was delicious! I received so compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kari Powell"
},
"reviewBody": "I didn't think it was sweet enough. Next time I will add a whole cup of brown sugar. Other than that, I liked it very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phil Zolla"
},
"reviewBody": "I made 4 pies! Crust was awesome! I added a little vanilla extract to the crust to make it a little flavorful. My family loves pumpkin pie so they were gone within a couple days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weaselbob74"
},
"reviewBody": "The best pumpkin pie I’ve had, better thank store bought but not too overly pumpkin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Juarez"
},
"reviewBody": "Very easy to follow recipe with delicious results. Received a lot of praise for it, so thank you. Mine didn't have such a red orange color but regardless it was very delicious. This will be my go to recipe from now on. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joel Sturm"
},
"reviewBody": "I substituted coconut milk for evaporated milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emm"
},
"reviewBody": "it was great, my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "Given temperature and or time is way off. \nAfter 40 min not even close to being done, so covered overcooked crust and dropped temp to 350 for additional 15 min. \nNext time I'll try 425 for 15 min and then 350 45 min.\nDisappointed at incorrect instructions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cassidy White"
},
"reviewBody": "I don’t know where I went wrong with this recipe - it has such great reviews so I’m sure I must be doing something wrong, but after making two bleh pumpkin pies in a row I have no idea what! This was my first time using fresh pumpkin, for the first pie I didn’t blend the pumpkin and ended up with stringy pumpkin bits in a spiced custard pie. Second time I thoroughly blended the pumpkin and ended up with a more even textured result, but absolutely no pumpkin flavor! Still tastes only of spices and cream. No idea what I could be doing wrong but I’m afraid I’ll be sticking to canned pumpkin from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erik Memmott"
},
"reviewBody": "This is by far the best pumpkin pie I have ever eaten! I strongly recommend using the cooked and smashed pumpkin. I used canned pumpkin for this recipe once, and the difference was stark. Even the color of the canned pumpkin pie couldn't stand up to the fresh stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "minzan"
},
"reviewBody": "I double the spices, it made 2 pies very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PrincessPearl"
},
"reviewBody": "I have never made pumpkin pie with fresh pumpkin before, so was looking for a good recipe. I tried this one and loved it! I added 1/2 tsp of pumpkin spice and the edges of my crust came out slightly burnt. Other than that, a really good recipe! So flavourful and made my house smell delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Falk"
},
"reviewBody": "SO GOOD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "noiwillnoteatthatpie"
},
"reviewBody": "Not great, I did everything according to the instructions and it tasted terrible, and took an extra 45 minutes to cook! I would not recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PiePerfection"
},
"reviewBody": "So tasty!! I substituted the fresh pumpkin for the pumpkin purée since I didn’t have a lot of time the other day when I made it! ?? Next time I’ll make it with the fresh pumpkin though! It turned out lovely!! I’ve tried so many pumpkin pie recipes, but this one is for sure going in the book!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURIE"
},
"reviewBody": "I love this recipe. The directions for the prep of the pumpkin was easily explained. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haley Warner"
},
"reviewBody": "Absolutely delicious! My first time making pumpkin puree and pie crust from scratch. I don't think I'll be going back!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly Booth"
},
"reviewBody": "I thought it was AMAZING!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathan Unruh"
},
"reviewBody": "Very good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FunnyAmI"
},
"reviewBody": "This was a great recipe for pumpkin pie! I've made it a bunch of times, and it always turns out great. We tried a variety of different pumpkins that we grew in our own garden. The pumpkin you use definitely influences the flavor of the pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Kostedt"
},
"reviewBody": "I probably made this pie about ten times with fresh pumpkin. I found it easier to put the gutted cut chunks of pumpkin in a cake pan and put about an inch of water in and put it in the oven at 400 degrees for 30 minutes. I then checked it and moved them around if they weren't all soft and left them for about 15 more minutes. \nThe first time I made the pie it turned out a little chunky so I actually blended the pumpkin with some evaporated milk. Then I put it in the fridge for about 30 minutes, then I baked it as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy S Tanner"
},
"reviewBody": "First time making pumpkin pie. Used pumpkin I had frozen from the garden. Put pumpkin into a strainer to remove excess water as it thawed. Doubled spices. Pie came out PERFECTLY after 1 hour. Pre-baked crust for 15 minutes prior to filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beng B"
},
"reviewBody": "I made it but haven't tasted it yet. I will update the rating after dinner ;D"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/819/desserts/pies/pumpkin-pie/",
"name": "Pumpkin Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13711/homemade-fresh-pumpkin-pie/",
"name": "Homemade Fresh Pumpkin Pie"
}
}
]
}
}
, "about": [
]
}
]