				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Ketchup"
,"datePublished": "2013-04-18T19:33:26.000-04:00"
,"dateModified": "2022-09-30T16:27:32.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Chef John&#39;s homemade ketchup is easy to make in a slow cooker with crushed tomatoes and spices. It&#39;s tasty and thick and practically cooks itself."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Bfra16DRB_A-DrMWBMmxxOoyntY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1060187-homemade-ketchup-Chef-John-1x1-1-d691bb56e4d84aa298f6ac8001d5400c.jpg",
"height": 1000,
"width": 1000
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2279972201001",
"description": "Homemade_Ketchup",
"duration": "PT5M3S",
"name": "How to Make Homemade Ketchup",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/702d34b6-bdb7-4996-8895-33e6a8965eb0/26559ef7-8664-4b81-9255-510f0fe2756a/1280x720/match/image.jpg",
"uploadDate": "2021-07-03T21:25:26.856-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Ketchup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "161"
}
,"cookTime": "PT720M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "16 kcal"
,"carbohydrateContent": "4 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"sodiumContent": "139 mg"
,"sugarContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 (28 ounce) cans crushed tomatoes",
"0.5 cup water, divided",
"0.66666668653488 cup white sugar",
"0.75 cup distilled white vinegar",
"1 teaspoon onion powder",
"0.5 teaspoon garlic powder",
"1.75 teaspoons salt",
"0.125 teaspoon celery salt",
"0.125 teaspoon mustard powder",
"0.25 teaspoon finely ground black pepper",
"1 whole clove" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pour tomatoes into slow cooker. Swirl 1/4 cup water in each emptied can and pour into the slow cooker. Add sugar, vinegar, onion powder, garlic powder, salt, celery salt, mustard powder, black pepper, cayenne pepper, and whole clove; whisk to combine."
} ,{
"@type": "HowToStep"
,"text": "Cook on High, uncovered, until mixture is reduced by half and very thick, 10 to 12 hours. Stir every hour or so."
} ,{
"@type": "HowToStep"
,"text": "Use an immersion blender for about 20 seconds to smooth the texture of the ketchup."
} ,{
"@type": "HowToStep"
,"text": "Ladle ketchup into a fine strainer and press mixture with the back of a ladle to strain out any skins and seeds."
} ,{
"@type": "HowToStep"
,"text": "Transfer strained ketchup to a bowl. Cool completely."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Bfra16DRB_A-DrMWBMmxxOoyntY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1060187-homemade-ketchup-Chef-John-1x1-1-d691bb56e4d84aa298f6ac8001d5400c.jpg"
}
]
,"text": "Taste and adjust salt, black pepper, and cayenne pepper as desired."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT730M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lulamarie"
},
"reviewBody": "I added Tumeric and granulated garlic in place of garlic powder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Highly unrealistic to stir every hour, especially when ideally is should be made overnight. However, quite tasty but brats little resemblance to REAL tomato ketchup we know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "Good recipe but a lot of work to avoid high fructose corn syrup which SCIENTIFICALLY has the same effect on the body as white sugar which is used in this recipe. When comparing equal doses of high-fructose corn syrup and regular sugar, research shows that there’s no difference in feelings of fullness, insulin response, leptin levels, or effects on body weight. Both are bad in excess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Faye Walker"
},
"reviewBody": "No changes on my first time. I'll try with Monk fruit next time!🤞🏽"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It’s very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie "
},
"reviewBody": "turned out really great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "André Varner"
},
"reviewBody": "I made it as is and thought it was a little on the vinegary side. I will cut down on it the next tine I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Jacob"
},
"reviewBody": "Very good… the every hour stirring was a little inconvenient… but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this and basically created tomato juice. I even reduced it down to less than a quarter the starting volume(double the time recommended) and it still wasn't thick at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois Campbell"
},
"reviewBody": "I used fresh tomatoes from my garden, put through my squeezo, fresh onion and garlic which I pureed in my bullet, ground cloves. I cut down on the salt because of diet restrictions in the family. After almost 24 hours in the crockpot I used a table spoon of cornstarch in some cold water to thicken it and pronounced it ketchup. Very good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just wanted to note, if you are using tomatoes from the garden, water need not be added - it just takes longer to evaporate. Also, depending on the tomatoes, you do not need much sugar, if any at all. Good recipe, I used it as a guideline substituting garlic and onion powders for real veggies. Being very conservative on the ingredients (1/4 cup of sugar) while making 5x the amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this recipe! I cooked on the stove top with an automatic stirrer for 3.5 hours. Produced five half pint jars. Water bathed for twenty minutes and stored away.❤️❤️ I will reduce the amount of sugar next time because I found that as the ketchup cooks down and condensed it became much sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "suehunleygmailcom"
},
"reviewBody": "Way to much sugar....cut in half... Or less then add as to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I make this recipe often and use swerve brown sugar substitute to make it sugar free. I do not add the water and add a couple of tbsps of tomato paste. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Sipsey"
},
"reviewBody": "I know it's really \"to taste,\" but the video directions, as well as the written directions, mention adding cayenne. However, it's not included in the list of ingredients. Any recommendations on how much to start with to get the flavor you were looking for?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "undiluted_one"
},
"reviewBody": "As long as you use a blender (either traditional or immersion) this recipe is golden. I follow it to use up the last of my garden’s bounty of tomatoes whenever we have a particularly good year.\n\nSince I use fresh, moist tomatoes, I generally need to let my caldron bubble overnight for the perfect consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mannie Valentino"
},
"reviewBody": "It’s amazing how annoying and whiney people are these days. How about this, shut up and make your own recipe and don’t involve someone else who is having fun sharing theirs. No wonder nobody wants to work in customer service or with other people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan J Breyan"
},
"reviewBody": "AWESOME is all I can say. I used 1 cup of vinegar instead of the 2/3 for a tangier flavor and I used a 6 qt pot instead of the pressure cooker on low heat just to where it will give a bubble or two, stirred occasionally for 10 hours, and it’s unbelievable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aleksandar Mladenovic"
},
"reviewBody": "The best recipe for homemade, ketchup ever!\nVery simple, and excelent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "Started using this recipe in 2016 and will never go back to store bought ketchup. Just put on another batch. Tweaked recipe for personal preference; less sugar and MORE cayenne pepper. Only cook 8-10 hours to get the consistency I like, but otherwise this is SOOOO much better. Freezes well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Searcy"
},
"reviewBody": "Love this ketchup! Will be making this again next year when I have another ton of tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Taylor"
},
"reviewBody": "This didn't taste exactly like store bought to my family, but was delicious none the less! It's got a more tomato and \"spice\" (not spicy) flavor than store brands, but honestly I feel like it tastes the way ketchup was supposed to taste...\n\nI used home grown tomatoes that I just weighed to equal what the recipe called for (I did double the recipe just fine). \n\nThings I changed (each of these things below I did twice as much of, but wanted to base it off the original recipe for you):\n\n1 Tbsp oyster sauce added \n1 cup honey (replaced the sugar with this)\nNo water added.\nApple Cider Vinegar (ACV) instead of white vinegar.\n1 Tsp of garlic instead of 1/2 tsp.\n\nI also did not cook this in the crock pot, but rather a stock pot. Took around 2-2.5 hours because I doubled the recipe for canning. I was disappointed to find that I only ended up getting 6.5 jelly jars of ketchup even with doubling this! That said... I'll just make more next time. I do not claim to be a canning expert, but went off the instructions in my canning book which had me can the jars in a water bath for 10 minutes. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "Beautifully savory with the sweet we come to expect out of ketchup. I used Lakanto Monkfruit Sugar in an equal amount. I also switched to cider vinegar. It gave it just the zing it needed for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moe F."
},
"reviewBody": "Fantastic\ni used 1/2 cup of honey instead of the sugar, and it turned out great\nalso used half MSG and half Salt (msg is 40% sodium)\nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valeria"
},
"reviewBody": "This is actually closer than most recipes but I guess people not old enough to know the real Heinz has 17 different spices in it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guneet Raj Singh"
},
"reviewBody": "Love it! Just like store bought... I used fresh tomatoes, puréed and seived. Added a little more sugar. Also I used a saucepan on a stove top on medium heat... doesn’t take sooooo many hours. Such a healthy option that don’t understand why in the video they keep saying that “you would be crazy to try it” ! Wonder if Iran reverse psychology.... because you must try it for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teo"
},
"reviewBody": "This is soooo sour and sweet( even though I only put half of the recommended sugar) I had to add 7 more cans of tomatoes and 2 small tomato puree to make this thing you call ketchup taste at least little close to what is supposed to. I literally have ketchup to feed the whole town. Save yourself time and skip this funny receipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CtUsaMom"
},
"reviewBody": "We loved the flavor! Would definitely make again. I didn’t bother straining it. I also cut back on the sugar because we don’t like it too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "teddykpitts"
},
"reviewBody": "decent enough but CHEF JOHN WAS RIGHT. MASSIVE time suck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MakeItWork"
},
"reviewBody": "I've been making this for about 3 yrs now. Usually with my own tomato sauce I make from what I grow every season. I've have made it with store bought but like my own tomato product better. I went with original recipe (using sugar sub) but thought it was too 'blah' for me so....of course I changed more to my taste by adding bay leaf, more clove, fresh grated garlic, about 1 tsp of Jamaican jerk seasoning, fresh ground coriander, etc., etc. I too use a combo of diff vinegar's as well as smoked paprika and a 2 inch ribbon of anchovy paste (from the tube) for more layers of flavor. I cook on stove top as and it makes reducing quicker. If your end result is a bit too acidic - add 1/2 tsp of baking soda (it will foam up initially.) As for a thickening agent; I bloom 1/2 T of beef gelatin and it actually gives this more body. I have potassium sorbate pellets (preservative) which I add 1/2 tsp along with 1/2 tsp vitamin C crystals. I've not encountered any issue on the canning front by adding those 2 ingredients and I only put the HOT ketchup in a HOT sterile canning jar and it seals itself. I do store the few pint jars in the fridge and it gets used up in 6 months or so. Other than on burgers or fries, I use for CJ's unsloppy joes and my own recipe for a Catalina style dressing or any recipe with a ketchup base. Well...call me nuts but I dig making my own condiments. Thanks for a great starting point that you can translate into your own masterpiece. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V Velthaus"
},
"reviewBody": "I made this because like some here, I ran out of ketchup and did not want to run to store with the Covid-19 going on. I had everything on hand and made it according to recipe. Question - can I can this? Because it seems like a lot to keep in the fridge. Well, I have 9 more hours to go to cook down. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OmaRicks"
},
"reviewBody": "Tastes amazingly good! I made it because I ran out of ketchup and didn't want to go to the store during our COVID-19 restrictions. I'm not sure I would make it again because it is so inexpensive to buy at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Levi Culbertson"
},
"reviewBody": "I made this and it turned out very good. Question, how long should this last in the fridge and at what point is botulism a concern?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck Guillas"
},
"reviewBody": "Substituted the sugar for 1/2 cup local honey. Tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Polly"
},
"reviewBody": "Sounds good but if you have never had Cranberry ketchup, which IMHO, is even better, then try adding cranberry jelly, not the whole cranberry sauce, or cranberries when you first begin the process and can remove them by using a sieve. How much you add is according to your own taste.\nI first had cranberry ketchup when a vendor was selling it at a county fair in southwest Montana. I cannot tell you how delicious it was because there are no words."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackie"
},
"reviewBody": "I love this! I did make some changes, since I was looking for something that brought me back to the old canning recipe I used to make with my mom. I used Chef John's method, but switched up the spices a bit. It turned out great. Took 8 hours in my crockpot for 1/2 recipe to get the thickness I wanted. I think you could use your imagination and make the ketchup YOU love, with little effort. Do wait to taste for spice adjustments, as the recipe suggests. I tasted when finished and thought I would need to add salt and maybe some pepper, but after cooling overnight it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Tastes like my favourite! I wanted sugar free, so I swapped out the 2/3 c of sugar for 2/3 c dried apricots, simmered them together and pureed them in at the end. I almost missed the cayenne (I put 1/4 tsp) because it's not listed in the ingredients. Everything else I followed exactly. Anyway, the first day, I was tasting a bitterness from the apricots, but the next day it was PERFECT! Nice and thick too! I'll be making this regularly, because sugar or artificial sweetener is in all the store brands. This amount (about 3 cups) should last me a year, so I'm freezing it in portions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck Sampson"
},
"reviewBody": "Can't say I ever wanted to make ketchup, until I was looking for added ways to cut sugar out of my diet. I swapped out the granulated sugar for equal parts of \"swerve\" sugar, and \"Monk\" sugar. Also great if you are on a low-carb or keto diet. There is no possible way, anyone would be able to tell, if I put this ketchup on your cheeseburger. The flavor is amazing! The richness and color....beautiful! My favorite brand of ketchup is \"Heinz\"...and this was every bit as delicious, if not better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joaquin Gerlero"
},
"reviewBody": "Such a pain to make - but well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nelle"
},
"reviewBody": "I made this as I was making homemade tater tots and didn’t want use a commercial ketchup. The spices were good in this, but it was way too sweet and way too vinegary for me. I used whole peeled tomatoes and put them in my food processor before putting them in a crockpot. I seldom use white vinegar as I personally believe it’s better for cleaning than cooking. I’ll swap out the white vinegar for apple cider vinegar, and lessen the amount. Also, reduce the sugar. Remember, these can be adjusted to taste after it cooks for a while. Other measurements seemed to make a nice tasting ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Prabh Ragbotra"
},
"reviewBody": "This has been cooking in my kitchen overnight now and it already tastes so good! Tastes just like the store bought stuff but even better. I followed the recipe to the T."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimmi40"
},
"reviewBody": "Used monk fruit instead of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Turner"
},
"reviewBody": "no mustard powder, I do not like mustard, I used red wine vinegar. I also chopped (very fine) and cooked my onions and garlic (onions first then garlic and red wine vinegar to both cool and stop the cooking when they were ready to add). Let that mixture cool a bit before the crushed tomatoe mix, I also added one small can of condensed tomatoes. Also lots of chili flakes because I like it hot. I did tri-colored peppercorns ground fresh as well. This recipe was a good guideline for me to make my own stuff, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Regina Michelle Oake"
},
"reviewBody": "Love the recipe I agree with others that 10-12 hours of monitored slow cooking is a bit excessive, so I made it on the stovetop with stirring every few minutes instead. Excellent result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soberlachee"
},
"reviewBody": "I have made this a number of times. Thanks Chef John. All my changes was to use fresh ingredients in place of the dry powdered. I also used Balsamic vinegar once and red wine vinegar once. Both with amazing results. I also use honey in place of the sugar.\nI made this at work yesterday and had to bake it in the oven instead of a slow cooker. It worked out great also. 6 hours @ 325 degrees checking on it every now and then.\nMy neice asks for this exclusively now. Lol. \nThanks again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julyaz333"
},
"reviewBody": "I love it and add to other sauces and gravies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJJones"
},
"reviewBody": "This is a great recipe! I doubled it. Ran it through a water bath and have ketchup to last me at least six months.\n\nChanges I made are as follows:\nI used fresh tomatoes from my garden, cooking them down, skins and all, until soft. Then ran them through a blender. Then continued with the recipe.\n\nI used organic raw sugar instead of regular white sugar.\n\nI didn't use onions because my son doesn't like them. But next time I'll chop them finely in the food processor and saute them before adding to recipe while he is not looking!\n\nI didn't have whole cloves, so I used ground cloves instead.\n\nI didn't strain anything out because after blending and cooking down everything was very smooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison L Moore"
},
"reviewBody": "I will make it again. My point was to cut down on the added sugar. Store Ketchup seems too sweet to me. In this recipe I halved the sugar . It still seems sweet but the next time I will make sure my canned tomatoes have not extra sugar before I reduce the added sugar any more. I have used this as a base for spaghetti sauce. I also have made tomato soup with this ketchup . Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deeeneecee"
},
"reviewBody": "I'm not a big ketchup user but my family is and they liked this recipe. I used honey instead of sugar and it was still a bit too sweet so I'd reduce the amount a bit (I used 1 cup). Other than that, great taste, very similar to store bought - but better of course,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jmiller62"
},
"reviewBody": "This recipe came out very well! My whole family loved the taste and texture. The only part of the recipe I deviated on was I left out the water. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Woody"
},
"reviewBody": "I used Strevia instead of sugar, otherwise followed the recipe and it came out awsome! Big thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gisellel"
},
"reviewBody": "If bk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivienne"
},
"reviewBody": "Added a little more garlic powder, onion powder, mustard powder, cayenne and salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia White"
},
"reviewBody": "I will definitely make this again. It was exactly how I remembered my mom's. Thank you for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medic1"
},
"reviewBody": "Absolutely delicious. Two things- Like some other reviewers I made it on the stovetop in the interest of time. It takes about an hour to reduce it. Second, Chef John is right. You’re crazy to make it based on work vs. yield."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rock Brown"
},
"reviewBody": "To be honest, I am allergic to fructose and my wife is trying a new diet that does not allow any white sugar. So I used \"Splenda\" instead of the white sugar. I would recommend only using 1/3 Splenda instead of 2/3 white sugar...\nHonestly I would double this.... Other than the Spenda, I followed the recipe exactly. After 1 hour of simmer, I tasted great an my wife used half of it to make Sloppy Joes - they were assume; but don't ask, I don't know what recipe she used. Even though my old crockpot has a \"High\", \"Medium\" and \"Low\", it appears that all of those are \"Burn Everything this Person Puts in Me.\" So obviously, I did not watch this every minute and my first batched burned after 3 hours on low... So to make an even longer story short, I have a new crockpot, and my wife found a great price on fresh tomatoes, I spent my day canning tomatoes. So now I'm making this again with fresh tomatoes. And after 2 hours of simmering it is unbelievable. (So, to make a long story short, make it, double it...)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calvin VanNess"
},
"reviewBody": "2nd time I've made this. I like to add cayenne pepper to make ketchup wit a little punch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Linden"
},
"reviewBody": "Really good! Like a high quality catsup. Great way to get garden tomatoes used up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caridadanne"
},
"reviewBody": "I've tried three recipes for homemade ketchup, this i s the family favorite. I use fresh \"squeezed\" tomato sauce, and omit the water. I follow the spice quantities as listed per 4C of fresh sauce, then leave overnight in the crock pot (uncovered). It's nearly ready by morning, as it takes longer to thicken with fresh sauce but we'll worth the time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2DK"
},
"reviewBody": "Fabulous flavor in this recipe. I used fresh Roma tomatoes, peeled and seeded to avoid any bitterness, about 3-3 1/2 lbs. It was alot of work to do the seeding and peeling, but well worth it for how wonderful the taste turned out. Added 3/4 cup of water (instead of the specified 1/2 c), used apple cider vinegar since I didn't have the distilled white vinegar, and added a little lemon juice. Used Xylitol in place of the sugar (adding maybe a couple of tbsp extra since the Xylitol is not quite as sweet as sugar). While cayenne was not listed as an ingredient, it was mentioned in the directions, so I added 1/4 tsp. Placed all in my new Instant Pot, on the slow cooker setting, but after 9 hrs it still hadn't thickened much, so put it in a pot on the stove on low, and cooked it for another 1-1 1/2 hrs til It was reduced and got very thick. Fantastic taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan"
},
"reviewBody": "I tried this recipe but I had difficulty straining at the end... Is there a feasible way to skip the straining part? \n\nHas anyone done it successfully?\n\n Use tomato purée instead of whole peeled? \n\nBlend the tomatoes enough to make seeds and skins unnoticeable?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "I love this !!! I did make 1 small change.... I am trying to get sugar out of my life, so instead of sugar I used some cooked date puree as a natural sweetener. This ketchup tastes just like the processed stuff, and it freezes well. Thank you Chef John! This was just exactly what I was looking for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnnie Luedke"
},
"reviewBody": "Turned out great! I used stevia instead of sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Goldberg"
},
"reviewBody": "I made it using fresh tomatoes rather than canned, and it came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hapygrl"
},
"reviewBody": "I tried this because I ran out of ketchup and was not going back to the store. I used Contadina style crushed tomatoes and followed the recipe, except, I didn't add any water, and I used 2 Tbsp more vinegar and 1/8 tsp ground cloves. I didn't have time for the crock pot version so I brought it to a slow bubble over low heat and shut it off to cool. It was really good. The consistency was a little runny, but I think it would be even better cooked long and slow in the crockpot. I am thinking of trying applesauce in place of the sugar. I can't wait to try using different spices and maybe even 1/2 wine, 1/2 vinegar too. The directions mention cayenne pepper, but the ingredients didn't list, so I added 1/4 tsp. I didn't even need to blend this. I might try making a hotter version to go on baked beans or burgers. It makes 2 quarts ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy Craig"
},
"reviewBody": "The recipe didn’t have any measurement for cayenne pepper??? So I skipped that. Otherwise I followed the recipe exact. I don’t have a strainer but I found it wasn’t needed after the immersion blender. This is delicious!!!!! First recipe I’ve ever tried that actually ended up tasting right! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlblunt"
},
"reviewBody": "Fantastic. I won't say it's close to store bought, because that would be an insult. I used garden tomatoes and some yellow salad tomatoes from the CSA. The color was a little light because of that so I put a couple drops of red gel coloring &amp; it looked as good as it tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Donahue"
},
"reviewBody": "For all the inquiries about canning this recipe, I called my local cooperative extension agency who checked with the state food specialist to see if this recipe could safely be canned. As written, this recipe is NOT acidic enough to can. BUT if you add 1 1/2 teaspoon of bottled lemon juice per 1/2 pint (8 oz) jar, it can be safely canned in a boiling water bath for 15 minutes. I opted to just freeze mine since I was concerned that the lemon juice would change the taste. \n\nI used fresh Roma tomatoes. I blanched them, peeled them, removed some seeds and diced them. This recipe takes 16 cups of fresh diced tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley"
},
"reviewBody": "Didn't have the right vinegar so substituted it for cider vinegar. I made it for a BBQ but my son doesn't want to share it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Schneider"
},
"reviewBody": "Yum! I found I like it better if cooked a little less than the recommended 10-12 hrs - has a little more \"fresh\" taste to it. I also add maybe double the onion powder and reduced the sugar. But it's all good. Fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jami"
},
"reviewBody": "Easy and tastes just like ketchup. I made it slightly easier by using my blender instead of using an immersion blender and then pushing it through a sieve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Irene Foss"
},
"reviewBody": "I haven't made it yet. But I am planning to make it. I have printed out the recipe and am ready to makeketchup. I grow my own tomatoes. To freeze my tomatoes for making sauces, I rinse the tomatoes, then cut them in chunks LEAMING the skins on and put the chunks in the blender. I pusle the blender till the tomatoes are all chopped up not quite pureed. I pour each batch of tomatoes into a large soup pan and cook till the tomatoes are done and have reduced a little. When cooled I put the tomatoes in 1 pint containers and put a lid on and write what is in the containers on the lids. Then I put the containers in the freezer in a single layer till they are frozen. When frozen I stack the containers . I think I will freeze my ketchup in 1/2 pint containers since we don't use a lot of ketchup. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Hegeman"
},
"reviewBody": "Really good! I didn't heed the instructions to adjust flavorings when cooked and cold, so I was playing with more vinegar, Worcestershire sauce, a touch of sriracha, as it was simmering, doubting just how good this was going to turn out. At the end of the cooking time, all the flavors had blended beautifully! It does taste a bit like Heinz! I did not use my crock pot, since, if I was to stir it every hour or so, it was just as easy to simmer on the stove. I showed my husband the starting level of the sauce in relation to the handle rivets &amp; told him to watch out for when it had reduced by about half. We both gave it a little stir whenever we went through the kitchen. It also did not take 12 hours on the stove - only about 6 or 7. It even thickens up a bit more after it's been refrigerated. We like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene Thomas"
},
"reviewBody": "Yes I will make it again, tastes very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane Dennis"
},
"reviewBody": "The *only* reason I rated it a 3 is because of the sugar. Rather than add sugar to cut the acidity I put a whole, huge, washed but not peeled carrot in (or a couple not so huge) and let it 'stew' with everything else. It massively reduces the acidity. I throw away the carrot before serving because the carrot has the acid in it if you will. This works with anything that has a tomato base and there's no added sugar. :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Del"
},
"reviewBody": "I suppose I shouldn't rate this because I change some of the ingredients. I use real garlic, onions and celery. I also have to replace the pepper with basil. But, it turns out great. I also use fresh tomatoes from my garden. Just take some of the tomatoes, push them thru the strainer to get the seeds and put this in a blender with the cooked garlic, onions and celery. Blend until smooth, and add to the rest of the crock pot. I've made catsup this way for years and we all love it. Like John said, it usually takes the second day in the crock pot to get it cooked down to the consistency we like, but really, it's worth the work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Redboyardee"
},
"reviewBody": "This is a perfect recipe for a ketchup connoisseur like myself. I made it with crushed canned tomatoes in a slow cooker on high for 12 hours, 10hrs probably would've been fine. As many people said you could probably get away with using less sugar-but it's ketchup, and you only live once so I rounded up. I noticed the Cayanne pepper to taste suggestion, although not in the ingredients list, so I went for it. This gives it a perfect spice! I bottled and properly labeled it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joycee"
},
"reviewBody": "This ketchup recipe so simple to make and tastes so close to regular store bought ketchup. Without the fructose that is so bad for you. The store bought ketchup, they changed the ingredient list to show liquid sugar which is actually fructose. I used crushed tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cottontail"
},
"reviewBody": "Loved the flavor &amp; soo easy. Will make again. But I will make it a little thinner as mine turned out very thick &amp; I like mine thin. I also added a bit more cloves {as I like that flavor} And added 1 or 2 T. oyster sauce. Thank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Markwotton"
},
"reviewBody": "I've made this twice now with canned tomatoes and twice with home grown garden tomatoes. We have stopped buying name brand ketchups and only use this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Little"
},
"reviewBody": "Personally, I didn't mind the time it took to make this deliciouis tasting ketchup. I will do it again. If you have a large garden and an over-supply of tomatoes, this is a great use for them. \n\nIt tastes as good or better than Heinz ketchup. My garden is fully organic. I used only organic ingredients.\n\nI reduced the crushed tomato ketchup to about half the original volume, and then strained the ketchup as directed. After straining, I found the ketchup not quite as thick as I like, so I strained the ketchup again using cheese cloth to reduce the moisture content. \n\nThe ketchup was sent out as Christmas gifts together with Bread and Butter pickles (FoodWishes.Com recipe) and sweet pickle relish (The Big Easy Chef recipe). All were delicious. I am confident the recipients will love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Simmons"
},
"reviewBody": "I'm looking for a shelf life on this?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zenovia Moroz"
},
"reviewBody": "First time making ketchup. I used this one as a base and doubled it. I did add a few seasonings and used sugar, honey and molasses along with apple cider vinegar. it took forever but turned out amazing. The only thing I would do differently next time is reduce the sugar a bit. by the time it cooked down and thickened it was a bit too sweet and we like it a little tangier"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Erdelt Lillibridge"
},
"reviewBody": "I made ketchup for the first time and Love it, so do the kids!! I used fresh tomatoes that I had roasted. Made just like the recipe. Anyone know if this can be canned? I see some have froze it though I Love to can things! Water bath or pressure? Please and Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "Great loved it .Made it to the recipe. Cant wait till summer and I will make it with fresh tomatoes. Opps nearly forgot I didnt strain it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cranberry"
},
"reviewBody": "I'm currently working on making this recipe a second time in a week. Not because I went through so much, it fills a 16oz bottle of ketchup. No, I'm remaking it because it was too soupy and by that I mean it saturated the buns of both hamburger and hotdog. Not exactly conducive to making a good ketchup. I also wanted a recipe minus tomato paste. Came to the conclusion, you need to omit the 1/2 cup of water entirely! It makes it too runny, also change the distilled vinegar from 3/4 cup to 1/2 cup. This keeps the ketchup tasting like ketchup without being too bitter and also helps keep it from being runny. I used diced tomatoes and then finished pulverizing the tomatoes using my immersion blender, a bit messy, but worked in a pinch because my blender is in need of a gasket. I'll update it once this new batch is done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Lee"
},
"reviewBody": "I had about 10-15 lbs of frozen tomatoes (unblanched just vac packed) from 2015. I cut stems off and put the whole tomatoes in my vitamix and pureed, then added sugar, garlic, pepper, salt, cloves, cider vinegar, onions and simmered for about three hours until the consistency of purchased ketchup. I got a quart and a pint of ketchup. The cloves made me hesitate but did not interfere with the wonderful taste. \nWhen my tomatoes ripen I will make more and use a water bath to can them. Also think this will make good holiday gifts. I made fried green tomatoes but they were gone before I thought to use my ketchup as a dip but next time I won't forget."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Douglas Harris"
},
"reviewBody": "I made the original recipe without any modifications. Turned out very good and much healthier than the store brands. Just a bit sweeter than the store brands, but I was looking for something different. It fit's the bill. Great on french fries, burgers and yes, even on hot dogs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackal9"
},
"reviewBody": "Great stuff! Too much sugar for my taste. In the video he say's you're crazy to make your own.. Great recipe! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Smith"
},
"reviewBody": "Delicious! I made it just as written and it is delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sylvia Kinnee"
},
"reviewBody": "I wanted to make my own ketchup after I saw on facebook the reality of what store bought ketchup really is.This recipe is excellent for me with a few changes due to personal preference and what I had on hand. First I did not add the water. After cooking for a while tasted it. . Way too sweet. Did not have celery salt used Beaumont Seasoning which has celery seed in it. Used Chipotle powder cause I like it. Also used a variety of vinegars to make up the total amount. I definitely will make this again. Also at the end it was not thick enough so I added 1 small can of tomato past last couple of hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "Read the other reviews and decided to try it with only 1/3 cup of sugar, 1/8 teaspoon cayenne and no added water. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alyssa C"
},
"reviewBody": "Tons of work and not great flavor. My kids were unimpressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith Adams Rowley"
},
"reviewBody": "This turned out great! My kids LOVED it and it tastes so much more fresh compared to store-bought!\n\nI had to tweak it based on what I had/didn't have in my cupboards, though. I didn't have 2 cans of crushed tomatoes, so I used (1) 28oz can of crushed tomatoes and then (2) 14oz cans of diced tomatoes. I was also out of onion powder, so I used about 1/4 cup diced yellow onions. I did not put a clove in it, nor did I put any cayenne pepper in it. I used celery seed instead of celery salt.\n\nAfter pressing it through a strainer, I ended up with about 4 1/2 cups of ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlliePeacock"
},
"reviewBody": "Exchange the 2/3 c sugar for 1/3 c honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonya Lawson"
},
"reviewBody": "This is very comparable to name brand ketchup, but of course it's better because it's from scratch. :) I've made this twice now, and it's WAY too sweet. Both times, I added more tomatoes because I was going to freeze it and wanted a large quantity; however, it's so sweet that I had to add a lot more tomatoes. If you're cooking this in the slow cooker, it also takes a lot longer to cook down this way.\n\nThe first time I made it, I got tired of waiting for it and put it on the stove in a soup pot instead. It ended up caramelizing the tomatoes, and it was delicious! I used it with a chicken finger recipe that called for spicy ketchup. Even my picky son loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eat or Get Beat"
},
"reviewBody": "Unbelievably good! I used about 4 pounds of garden fresh tomatoes, different varieties, blanched and peeled, instead of the canned stuff, and omitted the water. I got impatient with the slow cooker, so I finished it off on the stove. The taste develops best after it has been in the refrigerator for a couple of days. Nobody wants to eat the store-bought stuff anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "justmelaura"
},
"reviewBody": "I made it as is. I don't even like ketchup, but I've only had store bought before. This I liked. I'll have to try some other homemade ketchup. My 11 year old eats it but he likes the store bought better. Typical."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Smoove B"
},
"reviewBody": "It ended up very chunky and my kids thought it was too sweet. Next time, I'll use tomato paste, I think, and omit the sugar.?"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232397/homemade-ketchup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
"name": "Sauces and Condiments"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232397/homemade-ketchup/",
"name": "Homemade Ketchup"
}
}
]
}
}
, "about": [
]
}
]