				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Pita Bread"
,"datePublished": "2013-05-10T16:41:23.000-04:00"
,"dateModified": "2022-08-04T14:14:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This pita bread recipe is simple to make and turns out fluffy and delicious pitas every time. There&#39;s nothing more delicious than homemade pita bread!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/M4dX0OXneuFKH10INb6LAjSV-4I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1030625_chef-johns-pita-bread_linda-t-120bb90dad524f07a5dfd01668debbc5.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2327882495001",
"description": "See how to make homemade pita bread.",
"duration": "PT6M46S",
"name": "Chef John’s Pita Bread",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/041633cb-274e-4627-b955-774600e965dc/cbcb882b-7f92-4b7e-8671-5c51ba81bc15/1280x720/match/image.jpg",
"uploadDate": "2021-03-06T20:26:04.002-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Pita Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "507"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "187 kcal"
,"carbohydrateContent": "33 g"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "511 mg"
,"sugarContent": "0 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 (.25 ounce) package active dry yeast",
"1 cup warm water (90 to 100 degrees F/32 to 38 degrees C)",
"1 cup all-purpose flour",
"1.5 tablespoons olive oil",
"1.75 teaspoons salt",
"1.75 cups all-purpose flour, or more as needed",
"1 teaspoon olive oil, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place yeast in the bowl of a stand mixer and add 1 cup warm water and 1 cup flour. Whisk together, then let sit until mixture bubbles and foams, 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add 1 1/2 tablespoons olive oil and salt into the yeast mixture, followed by 1 3/4 cups flour. Mix at low speed, using a dough hook attachment, until dough is soft, supple, and slightly sticky. If dough sticks to the sides of the bowl, add up to 1/4 cup more flour, a little at a time."
} ,{
"@type": "HowToStep"
,"text": "Knead dough with machine on low speed until slightly springy and still soft, 5 to 6 minutes. Turn dough out onto a floured work surface and form into a ball."
} ,{
"@type": "HowToStep"
,"text": "Wipe inside of bowl with 1/4 teaspoon olive oil. Turn dough around in bowl to cover with a thin film of oil; cover bowl with foil and let sit until dough has doubled in size, about 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Remove dough from bowl and place onto a floured work surface. Lightly pat into a flat shape about 1-inch thick. Use a knife to cut dough into 8 equal pieces."
} ,{
"@type": "HowToStep"
,"text": "Form each piece into a small round ball with a smooth top, pulling dough from the sides and tucking the ends underneath the bottom."
} ,{
"@type": "HowToStep"
,"text": "Cover dough balls with lightly oiled plastic wrap and let rest for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Transfer the dough balls to a lightly floured work surface and sprinkle the tops with flour. One at a time, gently pat the dough with your fingers, forming a flat, round bread about 1/4-inch thick. Let the shaped dough rest for 5 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/M4dX0OXneuFKH10INb6LAjSV-4I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1030625_chef-johns-pita-bread_linda-t-120bb90dad524f07a5dfd01668debbc5.jpg"
}
]
,"text": "Brush a cast iron skillet with remaining 3/4 teaspoon olive oil and place over medium-high heat. Lay dough into the hot skillet; cook until puffy and the bottom has brown spots and blisters, about 3 minutes. Flip, cook 2 more minutes, and flip back onto original side to cook for about 30 more seconds. Pita bread will begin to puff up and fill with hot air. Stack cooked breads on a plate; when cool enough to handle, slice breads in half and open the pocket inside for stuffing."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT195M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABCTX"
},
"reviewBody": "Followed the recipe but put a pizza stone on the gas grill. At 500 degrees the pocket formed almost immediately. A little salty. Served with a lentil soup. A new family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "How much fun was this?! OK, so a few mods to the recipe. I made the dough in the food processor with rapid-rise yeast. I rolled the dough balls out by putting them through the widest setting on my pasta machine. And because I don't use cast iron (glass-top stove), I put the dough circles on cookie sheets and broiled them on High, turning as described. Wow, did they ever puff up! I will surely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gma"
},
"reviewBody": "Made this over the weekend and the best recipe ever !! Will be a regular in my kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn’t get a pocket but I don’t care. These were fantastic. I’ve only recently gotten into baking and so far, I’ve baked Cuban bread, bagels, challah, Italian bread, cinnamon rolls, dinner rolls, and some other stuff I’m forgetting. These by far had the most noticeable difference from store bought. I can’t wait to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ianab383"
},
"reviewBody": "They were soft and tasted great. It is a good base recipe as well. You can add other ingredients to flavor the dough as you desire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Streifel"
},
"reviewBody": "Delicious, and easy for a bread! I used my food processor, following the pizza dough method, for this very similar, but unique, flatbread. Very well worth it, Chef John, as usual!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe strictly. Taste, five ⭐️, but mine only created partial pockets, and didn’t open in areas. Used them to roll wraps and pita pizzas and they were delicious, but couldn’t make stuffed pockets. Suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drcole66"
},
"reviewBody": "I cooked them on the BBQ on a stone and they are absolutely delicious. Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Worked great for me, but here's some things I learned: When you put it in the pan, wait 15 seconds and flip. Wait 15 more seconds and flip again. Resulted in much better chance to fully puff. Pressing on the bubbles didn't work for me, it just popped them. Roll them small! Less than 1/4 inch. They come out more even if you flip them as you put them in. The air pockets migrate toward the surface as they rest, so you want that side down so they will move toward the center when they first cook. Recipe would be better for 6 slightly larger pitas instead of 8. If you are sensitive to salt, use less. These are pretty salty, perfect for me but I love salty food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cecibon1732"
},
"reviewBody": "My go to Pita Bread! I've made this several times and my husband loves them! Easy recipe, just fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a budare to cook the bread. It’s a thick metal plate used to cook arepas. It’s perfect for pita bread: it’s extremely hot and the dough never sticks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzin"
},
"reviewBody": "They did not puff up when cooked. Tasted good. Will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brittondairy"
},
"reviewBody": "I probably didn't let the yeast bloom enough. They tasted great, but didn't split very well...still pretty good with taziki! The burnt looking one was because I should've added more oil to the pan between frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan S."
},
"reviewBody": "This is an easy straight forward recipe. The end product had a nice pocket, was quite soft and tasty. I'm already in the process of making another batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "golivergo5"
},
"reviewBody": "Easy and clear instructions. However, like others, I had to lower the heat on my electric range considerably. You have to know your stove to do any cooking or baking anyway, so it was not surprising. I didn't get much puffing, but the pocket was there in each case."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these tonight using an ungreased ceramic skillet instead of cast iron, and they came out perfectly. \n\nMy advice to guarantee a full pocket is to make sure you seal the seams on the bottom of the dough balls before resting and rolling them. That way, the air has nowhere to escape and it inflates like a glorious little pufferfish. I had one that didn't seal properly, and that was the only one that didn't puff (but it was still delicious.)\n\nWatching the dough puff in the pan was genuinely exciting. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tsandifer"
},
"reviewBody": "Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pfaulkner874"
},
"reviewBody": "These were great! I cooked it on the stovetop on a cast iron griddle and doubled the recipe for the ravenous horde. I followed the recipe exactly and they were beautiful golden brown. some breads puffed up in the traditional manner - some didn’t but they were ALL delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TypoEmpress"
},
"reviewBody": "I made this recipe for the first time yesterday, and it was delicious! I made it exactly as stated in the recipe except I used a non-stick pan instead of a cast iron pan. It had great flavor and great texture. Definitely eat it day-of, because second day, even sealed in a plastic bag, it doesn't have quite the same freshness (though it can be mostly refreshed by microwaving for 10 seconds in a damp paper towel). I'm taking off one star because they are on the smaller side (making 8 as the recipe directs) and do not give you a very large pocket to stuff. I made the pitas to stuff with the phenomenal \"Rosemary Ranch Chicken Kabobs\" from this site and some grilled peppers and onions. The flavor was fantastic, but we really couldn't get much chicken/vegetables into the pockets, and ended up eating the pita more as a side than as a pocket to put the filling in. The next time I make this recipe, I might try making 4 pitas instead of 8 so there is a more generous pocket to fill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Ouimet"
},
"reviewBody": "Very good recipe, although after I made the first one, I thought it was a little thick, so rolled the following dough thinner and it worked beautifully! I'll use this recipe when making curry or souvlaki, super tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Cruise"
},
"reviewBody": "I have been on the quest for the perfect pita for the last several months and I literally make this every weekend now! Forget the store, forget the oven, watch the video, and knead it by hand, about 8-10 minutes. Chef John, you ROCK!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StationChef"
},
"reviewBody": "Very good recipe. I used them for gyros so I cut the dough into 4 balls instead of 8. Make sure they're very thin before going in the skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDD"
},
"reviewBody": "This recipe was wonderful! Almost all my pitas puffed. This was my first time eating/making pita bread. It was absolutely wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Maricic-Detweiler"
},
"reviewBody": "CRUCIAL tip. My pitas weren’t puffing up at first, but then I realized the dough had dried significantly before I cooked them. I then placed a wet paper towel over the dough balls and wet them slightly again before kneading and rolling out. Use as little flour as possible when rolling out. Barely a pinch. I had about 3 successful pitas after this. A high level of moisture is key to getting your breads to puff up as this allows steam to build up on the inside after the outer surfaces have hardened during cooking. They were delicious regardless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trio"
},
"reviewBody": "It was rather bland. The pita's blistered but didn't puff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAA"
},
"reviewBody": "For the second batch of flour, I left out the 3/4 cup and only used 1 cup. I kneaded until it felt elastic and a little tough to tear, but I didn’t use the windowpane technique because I felt if I keep kneading until I could make a windowpane, it would end up overkneaded. I measured one bread to be 51 grams and flattened it as thin as possible because it would shrink back. It was a bit thicker and I felt the bread more when I didn’t roll it thin like the other ones. I used an electric stove at the heat ‘8’. It’s between medium or high for fire stove. It didn’t require any fat to prevent sticking, I flipped it when it finished expanding. This recipe is nice, soft, and easy to make even though I only let the dough rise for 30 minutes ish (I had to do it quick)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana"
},
"reviewBody": "Delicious! Mine didn't puff up Ang make their own pocket but it was easy enough to slice them into pockets. Cooked them on a griddle around 375 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diane"
},
"reviewBody": "www.RedStaryeast.com helps with how to use baking yeast They offer courses. I am thankful this recipe does not use sugar. The baker can limit the salt. I use King Arthur Flour. Amazon sells red star yeast. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SpiceyPisces"
},
"reviewBody": "Absolutely delicious!! Works every time! I also love your pizza dough recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMA716"
},
"reviewBody": "Followed this recipe exactly and watched the video along the way to check my progress. I’m an awful cook, but these turned out perfectly. \n\nThe difference in quality and flavor from store bought cannot be overstated. These are delicious and elevated my souvlaki quite a bit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Yates"
},
"reviewBody": "I haven't tried a Chef John recipe yet that wasn't just the best. I made this to leave without a pocket and serve with baked goat cheese...and it was perfect. I wasn't that careful with it, either, so it also seems to be a very forgiving recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Daria K."
},
"reviewBody": "I did all as described but it did not turn well... waste of time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rivaelle"
},
"reviewBody": "Just finished making a batch. The dough is very good but came out too salty and did not puff up. I will try again with some adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Savannah Rhodes"
},
"reviewBody": "I'm usually one to over salt my food, but I must agree with many reviewers on here that this bread is too salty.\nI hesitate to feed to my hypertensive husband. \nI also got no puffed bread. This is prob due to rolling them too thin. I also subbed in some wheat flour which prob made the dough too dense.\nI plan to try again with no mods except cutting salt down to like 1.25 t. I'll also try not to roll so thin. These aren't tortillas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farzana"
},
"reviewBody": "This is by far the best and easiest pita recipe, I use it in place of Naan bread and I would know I have been making flat breads and Naans since grade school everyday. This was one chore I never looked forward to but had to. I also sprinkled sesame seed and onion seeds on some of them before cooking it turned out great. Sorry I couldn’t take a picture as they eaten right off the griddle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyp"
},
"reviewBody": "Great recipe! They turned out exactly as pictured."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mawieee"
},
"reviewBody": "We stopped buying pita bread!! This recipe is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanette1978"
},
"reviewBody": "This recipe was so easy and delicious! The directions are clear and the video was super helpful. My family absolutely loved the pita and I will definitely make this recipe often. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CK Ko"
},
"reviewBody": "Loved it! Made them to go with pork souvlaki and they were fantastic! The recipe created beautiful pita pockets! I'll never buy store ones again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tishprint"
},
"reviewBody": "Not too difficult. Like that it is grilled instead of baked. Have lots of time right now so fairly easy to let rise, knead, let rise., etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Xenia"
},
"reviewBody": "Great thanks, Chef John! I've tried many other recipes to bake on a skillet, but this would be my one and only favourite!!! My pitas puffed like balloons and they are incredibly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilbit"
},
"reviewBody": "Delicious!! When cooking next time I’d add a tiny bit of salt to the pan with the oil to give it a little bit more flavor. This is the best pita I’ve ever had and I’m so glad I found this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Crookston"
},
"reviewBody": "These turned out great! I did not get a pocket in all of them, but I think that is me not the recipe because it did work sometimes. The thinner ones had a better pocket, but even without the pocket this is a yummy flatbread! I will make this again foe sure, but think ahead this recipe has a lot of wait time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jo Nichols"
},
"reviewBody": "Only complaint I have is that my pitas were really small so I combined them. Only got 4 but they were GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gemma"
},
"reviewBody": "it was kinda good. it didn't puff up and 1/4 inch is quite thick. i would recommend not using whole wheat flour which is what i used"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnjwhitaker"
},
"reviewBody": "Great recipe, came out nice. 1 pkg of yeast is 2 1/4 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2Bake"
},
"reviewBody": "I wanted to make pita bread and I was looking at other recipes but most had to use bread machines. I don’t have one. Then I found this and made it and they tasted and looked delicious. I really recommend making these. They’re so simple to make! They also only need ingredients that you would usually have at your house. yum yum! I’ll let you go so you can go make it! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jake Fafard"
},
"reviewBody": "It turns out fantastic, will say 1.5 Tbl of Greek yogurt added to the wets takes it to a whole new level!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JayZ"
},
"reviewBody": "This recipe is perfection! I used a regular pan instead of cast iron; they came out just fine and puffed. So good. Will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sum Ting Wung Ferguson"
},
"reviewBody": "I followed the recipe and instructions for half of the dough and was not happy with the result. Mine did not fluff up like many people. I saved half of the dough by putting the balls in a plastic container in the fridge overnight to cook in the morning. Pull them out of the fridge to bring back to room tempurature while I heated the oven to 450F with a pizza stone. I then put the flattened bread on it once the oven reached tempurature. And within 2 minutes, the full puff happened. I flipped them once and did not leave them in the oven more than 2 more minutes to prevent from drying. I think I may turn the oven to 500F next time hoping for some browning. It‘s not something you can walk away from but the result is so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickey319"
},
"reviewBody": "I have made these several times and love them.\n\nJust wanted to note that yesterday, I knew I wasn't going to be home after the step where you shape into balls of dough and let rest for 30 minutes. So I refrigerated them for a couple of hours after shaping into 8 balls of dough. When I was ready to continue with the recipe, I pulled them out of the fridge for about an hour and proceeded (rolling out, cooking). Worked out perfectly and, in fact, may have been even better than usual."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Haynes"
},
"reviewBody": "Fantastic! No modifications needed! Thanks for such great instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jin Park"
},
"reviewBody": "Turned out great. I think the proper shaping into balls is important to get the bubble pocket. And turn in early bc if you wait until one side is too toasted, the bread is too firm to puff I think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeachMom"
},
"reviewBody": "Thank you for the recipe. It’s easy to follow for a bread novice like me. This is the second time I’ve made them and the whole family gobbles them up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Mateo de Acosta"
},
"reviewBody": "By far the best pita we have ever had. Soft, yet sturdy and so wonderfully flavorful. Thank you LOVE THEM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aco"
},
"reviewBody": "Very good but a lot of work. It was fun to make it but I doubt I’ll make it again vs. buying store bought again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Scott"
},
"reviewBody": "Easy and delicious! Such an upgrade from store bought. No modifications needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tajmahanida detroit"
},
"reviewBody": "thanks for this recipe, chef. this is the best pita bread I have ever had! they puffed up just like you said they would. follow the directions and you'll have no problem. you make all your recipes easy to follow and I love listening to your narratives. your site is always where I go when I am trying something new."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Fisher"
},
"reviewBody": "I added a pinch of sugar to feed the yeast. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliana Sandoval Hernández"
},
"reviewBody": "We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ACCER"
},
"reviewBody": "I'm weird, I just freaking LOVE salads in a pita. This recipe is great and the pitas are so light and fluffy. I stuff them with salad, drizzle on dressing....and devour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JanTC"
},
"reviewBody": "I used my Rock crepe pan as I do not have a cast iron pan. The resulting pitas were less than wonderful. I cooked them using olive oil and cooked them for the prescribed time on each side. They were overdone, and less than wonderful. I will not be using this recipe again. I am normally very pleased with Chef John’s recipes and directions. I ate a couple of the pitas, then decided they weren’t worth it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juli Saeger Russell"
},
"reviewBody": "As a green baker, this recipe was easy to follow and the pita bread came out so good! They didn't puff up as much as the video, but the pita was delicious with hummus and grilled chicken skewers. I'll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrisisChef"
},
"reviewBody": "Easy, tasty stove top pita recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leticia"
},
"reviewBody": "Absolutely delicious!!!! Thank you Chef John for sharing this amazing recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allegre Nee Marcheur"
},
"reviewBody": "These are definitely the best pitas I've ever made. They really puffed up and had perfect pockets. \nI subbed whole wheat flour (1/2C in the first part, 1/2C in the second part) and bread flour for the AP flour the recipe calls for. These have a wonderful flavor and texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ksilva"
},
"reviewBody": "I followed the recipe exactly. My ingredients were all fresh. I found the dough to be a little too stiff with the initial amount of flour so I definitely didn't add the additional quarter cup. Everything seemed ok until it came time to cook. I followed the directions in the recipe which said to PRESS the dough out to 1/4\". I couldn't get them very large this way, but went ahead and cooked 4 of them with great disappointment as they were dense, thick, slightly burnt pucks that definitely didn't have a pocket. I came back to the recipe for advice and saw the video in which he ROLLS the pita out. I tried this and it made some amount of difference, though they still didn't puff up very well. The flavor was ok. I'll probably look for a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Davelyn Silva"
},
"reviewBody": "Really love your video Chef John, it was so easy to follow, I?ve made this recipe twice already along with your Tzatziki and Baba Ganoush recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jude Loiselle"
},
"reviewBody": "I used half APF and half whole wheat. I found that if I just let the bubbles start to form on the first side and then turned it. The pita would puff up fully. So timing isn’t as important as how the bubbles form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "N Morski"
},
"reviewBody": "My first shot at pita bread and they were perfect. The cook time is not exact and mine took much less time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna"
},
"reviewBody": "This was my first time making pita bread and I love the way these turned out. I did use whole wheat flour instead of regular. The only thing I would change is to divide the dough into four or six balls instead of eight so the pita would be a bit larger and able to fit more stuff; I was only able to fit a very small handful of veggies inside one of these and I made them pretty thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aemurphy80"
},
"reviewBody": "Great recipe! I got a wonderful puff when cooking, but I did find that medium-high was too hot. My pitas were scorching at 2 minutes, so I turned it down to medium-low and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leannmt"
},
"reviewBody": "The bread tasted great. My kids devoured it. Unfortunately I didn't get the poof. As another reviewer mentioned, my young daughter was helping me, and I'm wondering if she over-rolled the dough. I will have to try again some time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mini Kuruvilla"
},
"reviewBody": "It came out very well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corina Walters"
},
"reviewBody": "Very easy, came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chadwick"
},
"reviewBody": "Chef John is the man! These are fantastic, but then again every recipe of his i have made has been great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helena Youssef"
},
"reviewBody": "Tasted delicious and puffed up very quickly. Much easier than I expected it to be. My family was so happy with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Basso66"
},
"reviewBody": "Came out amazing!! Highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naeela Djemil (IrisDream)"
},
"reviewBody": "So perfect. I followed the video's instructions exactly! They didn't puff up completely, but they were still soft and wayyyyy better than store-bought pita. I think if I make it thinner and let it rise for a bit longer it might puff up. But I'm not so crazy about the puffing up. I got good bread and it's good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris baker"
},
"reviewBody": "Easy and terrific. I use my electric grill and I couldn’t be happier"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rochelle Bailey"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Stoermann"
},
"reviewBody": "Best recipe ever! Hubby and I have tried a lot of pita bread recipes. And getting it right comes down to technique within the recipes. We have made this 5 times now and never had a batch fail. If you want great recipes that work hit Chef John. His are the best! You sir are a rockstart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Pagel Boysen"
},
"reviewBody": "No changes other than fresher yeast. They didn't puff up but were delicious. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. Good"
},
"reviewBody": "Great recipe for pita bread! It was easy to follow and the results are so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlos Chang"
},
"reviewBody": "In order to optimize our pita production line, I watched this video many times over and over again, hoping that one day the food produced by our machine can achieve the same taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reb"
},
"reviewBody": "very easy...and great result"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hanne"
},
"reviewBody": "Oh my is that ever good! I just had it for dinner and couldn't believe it. Like others here, I didn't get pockets, but since I usually just have it as a side it didn't matter. I just hope it will taste as good tomorrow.\nI don't have a stand mixer, and my hand-held didn't work very well even with dough hooks, so I ended up kneading by hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lingwendil"
},
"reviewBody": "Fantastic recipe. I even did a version where I replaced the water with mashed sweet potato, and that version turned out fantastic. Make a couple extra large ones and use them as pizza dough- they work perfectly for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Milligan"
},
"reviewBody": "Love the pita bread! Soft and tender. Recipe was super easy to follow and made it even easier when I watched the video. Will definitely be making them again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Craig G"
},
"reviewBody": "This was ok, needs to proof longer. They also dry out quick, so make a small batch1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizette WM"
},
"reviewBody": "I Unsed 1/3 WW flour. It turned out perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandi Lindstrom"
},
"reviewBody": "I made my dough by hand, not in a stand mixer... Definitely no dough hook..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milkyway"
},
"reviewBody": "We could stop eating them. Well worth the time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mayah"
},
"reviewBody": "My bread hardly had bubbles when cooking. No pocket as a result. 1 3/4 tsp of salt made the bread wayyy to salty, I could still salt the salt from the after taste. I would recommend putting simple 1 tsp. Wouldn't make again, such a long process. Made at 6 am finished at 10 am."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy RIos"
},
"reviewBody": "Made these tortillas last night! They were a hit! Saving recipe for future use. Thanks Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle B"
},
"reviewBody": "Perfect recipe for beginners! Never made bread before but these bad boys came out delicious. Noticed that if some didn’t bubble up when they were flipped we smacked the top once with the spatula and wa la bubble town. Give it a shot you’ll be so pleased with yourself. Good cooking vibes everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "Excellent recipe. I'm not going back to that commercial pita! \nI had to watch the video to know not to put all the flour at once, but worked well after that. For me, the trick while cooking to have a perfect inflated bread every time is is cook one side 30 seconds before flipping it. Then 1 minute per side until it inflates."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladydi"
},
"reviewBody": "So much tastier than the dried out pita from the grocery store! I did have trouble getting the air bubbles to form. I think I was afraid to use high enough heat because the olive oil would start to smoke in the pan. Next time I will use canola oil so I can use a higher heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "My son made this the first time around then showed me how to make. It takes time but the pitas are amazing! Can eat with any meal!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232719/chef-johns-pita-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
"name": "Flat Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232719/chef-johns-pita-bread/",
"name": "Homemade Pita Bread"
}
}
]
}
}
, "about": [
]
}
]