				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Chicken Cacciatore, Sicilian-Style"
,"datePublished": "2019-04-02T02:52:06.000-04:00"
,"dateModified": "2019-04-02T02:52:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kim Shepheard"
,"url": "https://www.allrecipes.com/cook/3827617"
}
]
,"description": "This recipe is made with tomatoes, onions, peppers, wine, and seasonings."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MzFwCf1R3wKXijrx6QcDAe0vjrU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8808102-90e19a3d90804d54a1baa18f461b9b3d.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Chicken Cacciatore, Sicilian-Style"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "109"
}
,"cookTime": "PT115M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "875 kcal"
,"carbohydrateContent": "68 g"
,"cholesterolContent": "175 mg"
,"fiberContent": "5 g"
,"proteinContent": "54 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "933 mg"
,"sugarContent": "8 g"
,"fatContent": "38 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon butter",
"1 large onion, chopped",
"1 large green bell pepper, sliced thin",
"1 teaspoon crushed garlic",
"2 (14.5 ounce) cans diced tomatoes, drained and juice reserved",
"1 cup Burgundy wine",
"1.5 tablespoons Italian seasoning",
"1 teaspoon salt",
"1 teaspoon ground black pepper",
"0.5 teaspoon garlic salt",
"1 whole chicken, cut into pieces",
"2 tablespoons all-purpose flour",
"1 (16 ounce) package spaghetti" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt the butter in a large stockpot over medium heat. Cook the onion, bell pepper, and garlic in the melted butter until they begin to soften, about 3 minutes. Add the tomatoes, wine, Italian seasoning, salt, pepper, and garlic salt; cook and stir until the mixture just begins to boil. Reduce the heat to medium low; add the chicken and cook until the meat is tender enough to fall off the bone, about 1 1/2 hours. Remove the bones and skin from the chicken, returning the meat to the pot."
} ,{
"@type": "HowToStep"
,"text": "Heat 3/4 cup of the reserved liquid from the tomatoes in the microwave until just warmed. Stir the flour into the tomato liquid until thick. Add to the stockpot and stir continually until the mixture begins to thicken. Remove from heat and allow to sit for about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "While the chicken mixture rests, bring a large pot of lightly-salted water to a boil. Stir the spaghetti into the water and return to a boil. Cook until the pasta is slightly tender but still firm to the bite, about 12 minutes. Drain. Ladle the chicken mixture over the drained spaghetti to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT145M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMiculan"
},
"reviewBody": "I followed the recipe exactly and ladled it over linguini. It makes a thick sauce that is not watery on the plate. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzi Conroy Brown"
},
"reviewBody": "It was delicious and very easy to make. The only changes I made were to add a package of sliced mushrooms and I used six chicken thighs instead of a whole chicken. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marge"
},
"reviewBody": "This was so delicious and my husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iria Silveira-bagley"
},
"reviewBody": "It was amazing! I did however add 2 more cloves of garlic, 1/2 teaspoon garlic salt , doubled the amount of Italian seasoning and it was great! This was the first time I’d ever made it myself and this recipe was spot on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyT66"
},
"reviewBody": "Delicious! Made a few changes, didn’t put in bell pepper as we don’t like it. Used a carrot instead. Used chicken broth instead of burgundy. Added a little more flour for additional thickening. My husband, who isn’t a fan of chicken, nor any type of stew based dish, loved it! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howard"
},
"reviewBody": "We loved the dish! While many reviewers used chicken parts for the recipe I did use a whole chicken and cut it into parts (after watching a few YouTube videos). I loved this dish. \nI used a Red and Green Pepper and did add a few mushrooms. Cook time was right on. After the allotted time I pulled all the chicken out and placed it in a bowl and then put one piece at a time on the cutting board and with a fork pulled the meat from the bone and skin and placed the meat back in the simmering pot. This step was a little time consuming but very easy when the meat is tender. Thanks for the great Recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevs Recipes"
},
"reviewBody": "Absolutely fabulous. Don’t change anything. Rich and tender with a very flavorful sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rocococo1"
},
"reviewBody": "I’ve made chicken cacciatore before (a similar recipe) but never in the oven. It came out even tastier because it intensified all the spices and veggies. I substituted white wine for the sherry and cayene spice for the pepper flakes. I also omitted mushrooms cause family member doesnt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey"
},
"reviewBody": "I cooked this recipe all the time. My wife just loves it. The only thing I changed is, instead of a whole chicken, I used chicken breasts. Other than that, I follow it just as is. Delicious! I also use nothing but angle- hair pasta. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tbiggs"
},
"reviewBody": "Super Delish. Rave reviews from my mother-in-law."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtfly1"
},
"reviewBody": "I added capers and used boneless breasts meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BoldChapeau"
},
"reviewBody": "It was good. We liked it. My only criticism is that it didn't make nearly enough sauce. When I make it again - which I probably will - I'll either use less chicken or add more liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "My hubby loved it. It turned out great. Definitely a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "paulyd"
},
"reviewBody": "It was so savory and flavorful. I’ll definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose Wallace"
},
"reviewBody": "didn't make any changes, and yes I will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jay"
},
"reviewBody": "Added some mushrooms and a few other spices but this recipe was really good and will definitely be making it again ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "This was really great! I did think it needed just a bit more flavor and I think next time it would be great to add in a couple slices of bacon or pancetta. I did sear the chicken first before sauteing the veggies. I also used san marzano tomatoes, added a lot more garlic, a couple tbs. sugar, a dash of chile flakes, and about 1/2 cup chicken broth. I didn't need to add the flour at the end, since after simmering for so long, the sauce gets a nice thickness already to it. We served each bowl with fresh parmesan cheese over top and it was a delicious meal! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Busutil"
},
"reviewBody": "I will definitely make this again, the only thing I changed was I used Cornstarch to thicken the sauce up, instead of Flour. It was delicious !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PatH"
},
"reviewBody": "Made this with boneless, skinless thighs and no other modifications. Easy recipe and absolutely delicious. A big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sniley"
},
"reviewBody": "This was delicious! I did make a few substitutions. I used diced garlic cloves instead of garlic salt. I substituted chicken broth and a tablespoon of cider vinegar for the wine. I also added two cans of V8 juice as we like this with extra liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hdtech1"
},
"reviewBody": "I have made, eaten, enjoyed many versions of this dish but this one consistently hits the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Will make again. Only change would be to blend diced tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Golder Nikkel"
},
"reviewBody": "I made this for dinner this evening. I added celery &amp; mushrooms to mine, topped it with parmesan cheese! It was wonderufl!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Piersol Fitzgerald Boswe"
},
"reviewBody": "I thought this was marvelous! I followed the recipe as written. I would make this again except my hubs was not crazy about it. He is a very picky eater even though he constantly denies it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Lyman Hancock"
},
"reviewBody": "It is cooking up real nice.. Great flavor... I'm gonna let it cook a bit longer than called for, but, I always do.. I think it will be a big hit... I even let the hubby taste... Not bad... Will make this again.... Very good. Thx.... I'm gonna put it over Rigatoni..:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Prudence"
},
"reviewBody": "Delicious! Amazing! So simple! This is going into the monthly rotation. It is very savory and will stick to your ribs. So satisfying!\n\nMy husband actually said it was the best meal I've made in a long time. (I actually almost kicked him under the table.)\n\nMy 6 and 8 year olds had heaping seconds. My 2 year old had thirds! \n\nI chopped a pound of mushrooms and cooked them with the onions and peppers and an extra Tbsp of butter. I didn't have burgundy :( so I had to sub marsala. \n \nI served it over angel hair with steamed green beans and cauliflower on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Asiantipped"
},
"reviewBody": "Mine was meh....but I'm betting it's because I cooked it in the slow cooker (after sautéing the veggies). The sauce never got thick either, but again, I contribute that to the slow cooker. I've seen that it seems the ratings that were less then stellar were prepared that way. Will definitely try again, but on the stovetop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Roberson"
},
"reviewBody": "This was excellent! I didn't have premade Italian spices so I used paprika, oregano, basil, thyme and sage. I also added a small can of tomato sauce and I browned 2 chicken breasts, then the vege's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronese"
},
"reviewBody": "Just made this for dinner...sooooo good. I like things super easy and this was. Only difference was I bought a rotisserie chicken, skinned it &amp; removed chicken off the bones. I placed meat in gallon ziplock bag in refrigerator until I was ready to use it. I did everything as recipe said but didn't put chicken in until everything in pot was heated through. I then added the cooked chicken and the reserved liquid as recipe said. It was very tasteful &amp; buying the chicken saved me a lot of cook time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KWB"
},
"reviewBody": "Followed the recipe except for leaving the skin on the chicken. I took off most of the skin (I don't like a lot of fat/grease in my food though I'm sure it adds amazing flavor) and it still tasted great. I will definitely make this again, but add/sauté some mushrooms with the other vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodyjomadd"
},
"reviewBody": "Awesome I did make changes. I used boneless skinless chk thighs and made it in the dutch oven because I didn't start it early enough for the crock pot. I used pinot noir because we had some and I added celery, some fresh oregano, because I needed to use these up, and served it with rice. Thank you for this! My family just ate it up! I will double it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LizzyGirsh"
},
"reviewBody": "I added a red pepper and a package of sliced baby portabello mushrooms, used fire-roasted tomatoes as others suggested, and only added back half the reserved juice from the tomatoes. At the end the sauce was quite watery; I removed the chicken and veggies, added about 2 tsp cornstarch, and simmered it bit before pouring the sauce back over everything. Makes a large quantity, good for freezing and bringing back out at the end of the week. The flavor is not the most complex, but it is definitely tasty and goes a long way. Has potential to become a regular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarolAnn"
},
"reviewBody": "My husband is making himself sick because he can't stop eating this wonderful dish! I used chicken broth instead of wine and added some rough cut mushrooms. Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Mahan"
},
"reviewBody": "I just finished eating....it was delicious! It was so nice out today, that instead of cooking the chicken indoors, I grilled it - good choice! I also added mushrooms :) Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "spapsdorf"
},
"reviewBody": "In my opinion it was a bit bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EDasariMoodey"
},
"reviewBody": "Added it to our monthly menu! Included red peppers and mushrooms and lots of garlic and Italian spieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "Sometimes cacciatore comes out to tomatoey tasting. Not this one. This was fantastic. I added a tsp of onion powder and a tsp of red pepper flakes to the spices. I did add more garlic- about 5 cloves. What can I say we like garlic. For the chicken I used 2 bone in, skin on half breasts. It was very very good. I also had to sub Zinfandel for the burgundy. This was a huge winner in our house. I didn't have to add the flour mixture as my sauce was super thick on its own. THANKS KIM FOR A LOVELY MEAL."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SLF1"
},
"reviewBody": "I liked it, but the family wasn't that crazy about it. However, all agreed that it tasted better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RJT"
},
"reviewBody": "Wow this was amazing! My whole family loved it. I made this in the pressure cooker which infused the flavors and also speed it up enough that I could cook it last minute after work. I tweaked the recipe just a little, like I didn't have any peppers but it was SO good without I won't put them in ever. I used 1 can of regular diced tomatoes &amp; 1 can roasted diced tomatoes because that is what I had on hand. I didn't brown the chicken, and I took the skin off all the pieces except 3 for flavor. (then removed it with the bones) I added beef broth for the extra liquid to pressure cook. I also cooked up 3 slices of bacon, crumbled and added this plus 1 tbsp of the drippings to the recipe. I used egg noodles because again that is all I had. I didn't use any flour, I just added a can of tomato paste at the end. This is an amazing recipe and my family always asks me when I am going to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Culinary mom"
},
"reviewBody": "Not so good. Bland. I tried this recipe again 1 year later in 2015; Tried to spice it up a bit and marinated the chicken for about 4 hours prior to cooking. Better flavor 2nd time around but still a little bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Dee"
},
"reviewBody": "I loved it, but i added 1 cup beef broth, 1 cup chicken broth, a red bell pepper, and a pkg of sliced mushrooms. it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jmeyer2952"
},
"reviewBody": "I thought it was really good! I was only cooking for 3 people (2 of which were children) so I only made half the recipe. My kids didn't really like it since they are big fans of dices tomatoes. I think next time I might have to compromise and used tomato sauce so they won't sit there trying to pick the tomatoes out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Die Cut"
},
"reviewBody": "I made the recipe exactly as written and it turned out fabulous! My whole family loved this Chicken Cacciatore recipe! I will be adding this into the rotation. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Trivelli Milillo"
},
"reviewBody": "Delish! Took the skin off to save some calories and omitted the flour (I added both cans f tomatoes w/o reserving the liquid) Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat I"
},
"reviewBody": "Loved the way the sauce came out. next time I will take the skin off the chicken since there was way too much fat. otherwise mmmmm. excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Arci"
},
"reviewBody": "Okay recipe, however I like using olive oil vs butter and red bell pepper and a tsp of crushed red pepper. I also prefer to crisp the chicken first by coating in flour and frying in a bit of olive oil until skin is crisp. It also seems to help thicken the sauce. This came out too runny and wasn't spicy enough. I think ill stick to my old recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickdee"
},
"reviewBody": "This was very good! I used 4 frozen skinless, boneless chicken breasts. I then followed the recipe with the exception of adding the flour at the end. Very good served over pasta. I would make this again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Mayes"
},
"reviewBody": "Delicious..Wished I made more. Definite addition to menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "figgy"
},
"reviewBody": "I made this almost exactly as written except that I used bone-in chicken thighs instead of a whole bird and I added about 1/2 pound each of sliced zuccini and button mushrooms to the saute. I also used linguine in place of spaghetti. To me it tasted bland, like something was missing. Maybe the added veggies took away from the seasoning and I should have added more. Don't know. Maybe it's just me since everyone else loved it for the most part in their reviews. My mom had no comment either way but she never does so who knows with her. I'm adding an 8 oz. can of tomato sauce to the leftovers because this really made a huge amount and there is a lot left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yayaelaine"
},
"reviewBody": "Made this dish but disagree with not at least browning chicken I browned chicken then removed and continued with recipe and then added chicken back after veggies were sauteed it was great...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m7pilot"
},
"reviewBody": "used a pressure cooker. removed bones and added flour mixture. awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I too made this in the slow cooker. It was ok, not great. I wouldn't make this again. Thanks anyways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Excellent recipe. Followed the directions almost exactly. Didn't do the flour thing and it didn't need it. Also I served it over Polenta instead of spaghetti. Thanks for a nice recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John R. Beach"
},
"reviewBody": "Wonderful, I browned the Chicken first, for some color, and used Port wine.\n\nGabby"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari"
},
"reviewBody": "Yummy....I made this in a dutch oven with a few changes 1) i used Pinot Noir instead of Burgundy for the wine 2) I used 6 cloves of crushed garlic and omitted the garlic salt 3) I added a 28 ounce can of crushed tomato and 4) i added 2 cans of mushrooms\n\nIT CAME OUT FANTASTIC....Thanks for the recipe, i will be making this again for sure but i will use all dark meat next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Stine"
},
"reviewBody": "It sure is easy, and it sure is delicious! Here are my substitutions: used sherry instead of red wine. DO NOT use the store bought kind, it's loaded with salt, use drinking sherry. Did not add garlic salt, but added about twice as much fresh garlic. Did not add flour, scooped out the chicken and cooked the sauce down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valerie160"
},
"reviewBody": "I had to make some adjustments based on ingredients I had on hand. I dredged my chicken quarters (all dark meat) in flour/salt/pepper and browned it in olive oil before proceeding with the rest of the recipe. I didn't have green peppers, so substituted mushrooms in place of it. We don't drink, use or keep wine in the house, so I substituted with apple cider. The Cacciatore came out tasty and delicious! I've never attempted Chicken Cacciatore before, and because of how easy this recipe truly was, I'm sure I'll be making it more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trish F."
},
"reviewBody": "Best recipe I've made for chicken cacciatore and I've made alot. The house smelled wonderful while it was cooking. I added the mushrooms and replaced one can with fire roasted. Next time I will use 2 cans as it added depth to the sauce. I also added six cloves of garlic instead of garlic salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "floridalinda"
},
"reviewBody": "This recipe was awesome! I threw everything in the crock pot (did not saute the onions/peppers), used boneless, skinless thighs and cooked on high for 4 hours. The only 'problem' was that the 6 thighs practically disintegrated and I could barely find enough chunks of chicken for the 3 of us. I'll definitely cook it less next time, but the flavor was fabulous! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Willard Joe Weaver"
},
"reviewBody": "Thank you Ms. Shepheard. I used this as a reference, as I used cherry tomatoes blended with the carrots and garlic) instead of diced. I have four plants, and they are coming on gangbusters. I added sauteed finely chopped carrots for extra body, and added more butter and added olive oil as well. Other than mine turned out a bit thin (i will correct that next time, it was deleicious. It reminded me of the Cacciatore I had while growing up in the Finger lakes of New York. I also used chicken legs, as I like dark meat in cacciatore. It is delicious on Pasta or rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattydc13"
},
"reviewBody": "This dish was delicioso!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Horvath-Bostrom"
},
"reviewBody": "Very good. I did change the green bell pepper to red bell pepper. Hubby and I can't handle the green bell peppers any more. This was very good and made wonderful left overs for lunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Stewart"
},
"reviewBody": "This is one of the recipes I make over and over again without a single change to the recipe. I serve it with whole grain egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "Very good! I used 3 pounds of chicken leg quarters because that was what I had on hand (we like dark meat) and I removed the skin before cooking. The recipe was very easy to follow and I will definately be adding this to my dinner rotation. Thanks Kim =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamachef"
},
"reviewBody": "This came out really good. I put everything in the crock pot which made it really easy. I just added a little bit of olive oil to the bottom of the pot and then added my veggies, then I added a pack young chickens and drumsticks and the rest of my ingredients. I replaced the red wine with white because it's all I had, also added a can of tomato sauce and used basil and oregano diced tomatoes. Cooked 4 hours on high, one hour on low, added the flour and tomato juice mix in the last hour. My family was very pleased, will be using again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MYCALA"
},
"reviewBody": "This is just excellent. The flavor is fantastic -- I used all fresh garlic rather than the garlic salt, and I didn't have the Burgundy (although I bet that makes it fantastic) but it was utterly divine nonetheless. When you get raving compliments from an 11-year-old who is not related to you, you know it's good stuff. ;-) Thanks so much for sharing this. It's excellent and even though I just had it last week I'm craving it again already!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belle"
},
"reviewBody": "I made this for a Holiday Party and it was a great success. The Burgundy gives this dish a sweet flavor. I followed the recipe exactly. But after making this a few times, I do suggest removing the skin before cooking because the meat starts to fall apart and the skin will float around and its hard to remove all the skin and trust me, it's not cute biting into a mouthful of \"boiled\" skin. The other suggestion is halfway through cooking, remove the bones. The meat will have fallen off the bones at this point anyway, and it takes time to fish them all out. Kim, amazing recipe. Thank you for sharing this gem with the world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dhay616"
},
"reviewBody": "This is excellent! I cooked it as directed, but in hindsight, I should have followed some of the suggestions in the reviews. Specifically, I will remove the skin on at least 1/2 of the chicken peices OR I will brown them first to get rid of some of the excess fat they generate. I just found that leaving the skin on, when all was said and done, there was a good 1/4 inch of fat sitting on top of the dish. But otherwise, the flavors in this are simply delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shor"
},
"reviewBody": "This dish was VERY tasty!!! I did brown my chicken before I put it in the pot and my family loved the dish with angel hair pasta"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy C."
},
"reviewBody": "Very very good! My husband loves chicken cacciatore and orders it often when we go out to eat. He said this is the best he has ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristina Sumner"
},
"reviewBody": "All and all not a bad recipe. I cooked it in the crock pot and will make it again for sure. I will add a bit more seasoning to it the next time. It was just a bit on the bland side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Indiana Cookin"
},
"reviewBody": "I absolutely loved this recipe! My family too. I used Merlot because it was all I had and increasd by 1/2 cup. Added 3 cans of stewed tomatoes, with the juice, instead of 2 because I added extra peppers and carrots. Went with the 6 cloves of garlic as someone had recommended and omitted the garlic salt. Threw in some basil, oregano and parsley. Left out flour. NEXT TIME, I will make double the broth and use only thighs or other dark meat for moisture. We served over rice. It was almost like a stew. The house smells great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marco T. Ferro"
},
"reviewBody": "Addition of parmigiano gives a finishing touch in the utmost degree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcooks"
},
"reviewBody": "wonderful!!! made with boneless chicken breasts, cut time in half!! very tasty and i added more garlic and mushrooms. was great with the burgundy wine sauce. served over egg noodles. big hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kd"
},
"reviewBody": "Very good recipe. The picture is what made me want to try it. It looked like the meat was taken off the bone after cooking - I had never taken it off the bone or used boneless. I tried it this way and will be making it this way from now on. I made some minor changes by browning my chicken first in the same pan and used colored peppers. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tee"
},
"reviewBody": "What a great dish! My husband and I both enjoyed it. Few changes/additions as per reviews and to suit our taste. Added more garlic than called for. Used two cans of diced tomatoes, one can of stewed tomatoes and one 8oz can of tomato sauce. Used Shiraz (because that's what I had opened). Left out the garlic salt but added basil, oregano, red pepper. Used all chicken thighs, and used green and Italian pepper, carrots and celery. Thickened with a little flour. Very gourmet. A keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon T"
},
"reviewBody": "This was fantastic! I added sliced baby carrots and chopped celery to the recipe and it was so good! Thank you for the super recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HLyn76"
},
"reviewBody": "If you are like me, you might sometimes take a pass on recipes with a few number of reviews, feeling that there is strength in numbers. This is the recipe that should make you change your mind! It is an easy cacciatore recipe that saves you the work and effort of browning the chicken and you don't lose an iota of flavor. I stayed closed to the recipe but added one red pepper as well as a package of sliced mushrooms. I am told that isn't traditional but something called hunter's stew should have mushrooms....very earthy ;-) I added six cloves of fresh garlic and omitted the garlic salt. I used fire roasted diced tomatoes and they really added a depth of flavor. Because I added veggies, I also added a 14.5oz can of fire roasted crushed tomatoes and the sauce simmered itself to a really thick state. I didn't have to add flour. Just threw the tomatoes in with their juices from the beginning. In fact, the leftovers will probably need another can of tomatoes to get some sauciness back. I did as the writer said and left the skin on the chicken which was a bit problematic as the chicken cooks until is falls off the bone so I had to chase out skin bits throughout the sauce. I used 2 breasts and a package of thighs. Next time, I will remove the skin. Excellent recipe... served over egg noodles. So good that I hid the leftovers in the back of the fridge where hubby might not find them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefHubby"
},
"reviewBody": "In addition to what's listed, I added a red bell pepper minced and about a 1/2cup fresh Italian Parsley and 1/4 teaspoon sugar to reduce acidity in tomatoes. I also added 1 cup of grated Parmesan cheese to the sauce and stirred it in. Served it over whole wheat angel hair pasta. This was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missdrea"
},
"reviewBody": "i have never made w/ red wine before so i wanted to try this version. very good. i browned the chix in bacon drippings ,then removed the chix, sauteed veggies in drippings, deglazed the pan w/ the wine and added toms. i didnt bother reserving any toms or adding flour and it was still very good. i served this over baked polenta w/ a green salad. (i also added some leftover beet greens cause i didnt want to toss them)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZ"
},
"reviewBody": "This was really great! I modified it to work in a crockpot - but hands down one of the best cacciatore's I've had in ages! Sauteed the veggies in butter and set aside. Added two chicken breasts, two thighs and two legs to the crock pot, added salt and pepper. Poured in the wine, added the sauteed veggies and italian spices (I had garden fresh basil oregano and rosemary) then topped with one drained can of tomatoes and one undrained can and a can of tomato sauce. I added the extra can of sauce because I needed a little more liquid for the crockpot - but I reserved (like it said i the recipe) the drained juice. And used that with flour to thicken at the very end. 4 hours at high, pulled the meat out and shredded off the bone added back in for another 1 hour on low. it was fabulous and I am thrilled I have so much leftover!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stormychick"
},
"reviewBody": "Made this tonight and it was excellent! Used frozen boneless/skinless chicken breasts and just added them to the sauted garlic &amp; onions. Added spices, then liquids. Used 1 cup of beef stock, 1 can of chicken stock and 1 cup of wine for the liquid. Also used LOTS of fresh chopped garlic, but then again there is no such thing as 'too much garlic' in our family. Cooked the chicken most of the way, then added 1 red bellpepper and 2 small zuchinis. Excellent way to sneak in extra veggies. ;-) Will definitely make again. Hubby asked me to put it on the menu to make at least monthly. :-) 5 stars from my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "junglepilotwife"
},
"reviewBody": "Great! I changed it a bit though...I made it all in the slow cooker, which made everything SO easy. I used skinless thighs. I didnt sautee anything...just put the chicken on top of sliced onion and bell peppers in the crock pot, mixed the sauce in a separate bowl and added on top of the chicken. I added a can of tomato paste and left out the flour. Next time I'll try a little red pepper to give it a kick! Served over mashed potatoes, which was a nice change :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "Delicious!! Thanks so much for sharing this recipe. I used chicken breasts because I had those on hand and it was still very flavorful. I added sliced olives too. I'll be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KungFuJimmyChoo"
},
"reviewBody": "Fanfreakintastic! I used basil, garlic, &amp; oregano diced tomatoes and added a bit of italian dressing mix and served over linguine. I'll definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamie Nunez"
},
"reviewBody": "I took a chance and made this new recipe for dinner tonight....WOW! Was I pleased! All three kids (ages 7,8&amp;9) loved it and said Mmmm! after the first few bites. Hubby liked it too...what a hit! Thank you so much!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/202881/homemade-chicken-cacciatore-sicilian-style/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17553/main-dish/chicken/chicken-cacciatore/",
"name": "Chicken Cacciatore Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/202881/homemade-chicken-cacciatore-sicilian-style/",
"name": "Homemade Chicken Cacciatore, Sicilian-Style"
}
}
]
}
}
, "about": [
]
}
]