				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homemade Sweet Italian Sausage (Mild or Hot)"
,"datePublished": "2020-03-05T00:07:45.000-05:00"
,"dateModified": "2022-05-13T14:38:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Michelle Leigh Gossman"
,"url": "https://www.allrecipes.com/cook/5649383"
}
]
,"description": "An Italian sausage recipe you can tweak to taste. Just start with ground pork (or other meats) and add your own herbs and spices. So easy, so versatile!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Qn2R5xGw2ILJ-btG1AiCMgvClDw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8243627-69f7c2e37fa54cc784d6f59d4b7506ad.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homemade Sweet Italian Sausage (Mild or Hot)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "240"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "243 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "74 mg"
,"fiberContent": "1 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "640 mg"
,"sugarContent": "1 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"3 pounds ground pork",
"3 tablespoons red wine vinegar",
"1.25 tablespoons dried parsley",
"1 tablespoon garlic powder",
"1 tablespoon onion powder",
"1 tablespoon dried basil",
"1 tablespoon salt",
"1 tablespoon freshly cracked black pepper",
"2 teaspoons paprika",
"2 teaspoons crushed red pepper flakes, or to taste",
"0.75 teaspoon ground fennel seed",
"0.25 teaspoon brown sugar",
"0.125 teaspoon dried oregano",
"0.125 teaspoon dried thyme" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place pork and red wine vinegar in a large mixing bowl. Sprinkle with parsley, garlic powder, onion powder, basil, salt, black pepper, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed throughout meat."
} ,{
"@type": "HowToStep"
,"text": "Divide sausage into thirds. Form each into a 3-inch diameter log, wrap securely in plastic wrap, and place in a zip-top bag. Refrigerate for at least 12 hours before cooking."
} ,{
"@type": "HowToStep"
,"text": "When ready to cook, remove logs from the zip-top bags and place on a cutting board. Use a finely serrated knife to cut logs right through the plastic wrapping into 1/4- to 1/2-inch-thick patties. Carefully remove and discard any plastic."
} ,{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium heat. Working in batches, cook sausage patties in the hot skillet until no longer pink in the center, 2 to 6 minutes per side, depending on thickness. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C)."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT755M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy Homemaker"
},
"reviewBody": "I use this often and double or triple as we have a seemingly endless supply of wild pork these days. I lightly toast my fennel seeds before grinding it with a mortar and pestle; I don't add the red pepper flakes because of heartburn. I let everything meld in the fridge overnight before freezing in 1 lb. pkgs. Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frugal Dad"
},
"reviewBody": "I use the ingredients I have on hand, and it is simple to make it \"hot\" or \"sweet\". I have used this recipe countless times...sometime with just pork, and many times with ground pork, turkey, chicken. I LOVE it! I rarely add the brown sugar or the red wine vinegar, and it is delicious. I use it for patties, meat sauce, pizza topping...whatever! Make it YOURS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lonestaroftejas"
},
"reviewBody": "made with ground chicken nice delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "thg0724"
},
"reviewBody": "A quarter teaspoon of brown sugar to three pounds of ground pork? Are these measurements really as intended?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TIFFANY11"
},
"reviewBody": "Very washed out flavour. Made this as a test batch and was very disappointed in the flavour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve McWilliams"
},
"reviewBody": "Cannot be beat this. So many different preferred tastes in family. This takes care of all. Plus, big money-saver if you purchase meat grinder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "The Cooking Dad"
},
"reviewBody": "not that good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Arsenault"
},
"reviewBody": "I stuffed mini peppers with the sausage in my air fryer and they were fantastic. So impressed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brassydoll"
},
"reviewBody": "Loved it! Will never buy sausage from the store again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Elizabeth"
},
"reviewBody": "I love this recipe. Have used it with pork, but equally good with ground turkey. I make meatballs, brown &amp; cook them, flash freeze them, then stick them in a bag in the freezer so I can pull them out when needed for quick meals. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doge"
},
"reviewBody": "very good Italian sausage base. if you want to make it a hot Italian sausage, add more red pepper flakes, if you want to make it sweet, add more brown sugar. but just as it is solid. also use less salt, I used chicken instead of pork for a healthier alternative and it came out fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Parker"
},
"reviewBody": "I used this exactly minus the red wine vinegar and turned out great added a few more flaked chilli peppers for a little more heat. Then stuffed the sausages and smoked them . perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol V."
},
"reviewBody": "Thanks for a great recipe! I modified the recipe allowing for my allergies, 1 pound of ground pork and our preferences. Omitted the red wine vinegar, onion powder and exchanged the black pepper for white. The brown sugar was changed to white and increased to 1/4 cup minus 1 tsp. I combined the seasonings and then sprinkled it as layers of sausage were added to the bowl. Combined and covered and let it rest in the frig for at least 30 mins. Took it out and gently stirred again. We use it on homemade pizza (guidance from Allrecipes.com) and an Italian stew from another web site. My Son was very impressed and always asks, \"what else have you seen on Allrecipes.com?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hblake1960"
},
"reviewBody": "Incredibly easy and flavorful recipe! I like making my own “prepared” foods (canning, etc.) so I know precisely what goes into my food. What I like about this recipe is the simplicity and the variety of options for the output... links, patties, meat balls, or bulk sausage. Since I like both, I made mine Hot AND Sweet. Since I avoid sugar, I used substitutes. it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Snow"
},
"reviewBody": "Without any question this is the BEST sausage I've ever eaten. Italian sausage is by far my favorite meat, I've eaten the best (highest price) store sausage, I've eating sausage at fine restaurants, my family made sausage. But this was my first attempt, my God this beats all of them by miles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Mahoney"
},
"reviewBody": "Grocery was out of turkey Italian sausage so I used this recipe to make my own at home. I would cut down on the salt but it tasted great in a lasagna. Thanks for making it so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CynStogdill"
},
"reviewBody": "Reduced red pepper flakes by half &amp; 1tsp brown sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Lengyel"
},
"reviewBody": "Perfect recipe. I used this minus the sugar with 2lbs of ground chicken. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Excellent recipe! I didn't use fennel, didn't have any, came out great! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NC Ken"
},
"reviewBody": "My first venture into sausage making. Came out great. Next time will back off on the salt, and wait till front end of first grind, when I'll make a patty to fry up, taste the seasoning, and go from there. May back off a tad on the fennel, too. Next time: Hog casings! Would welcome recommendations on natural casing brands, etc.. Glad I tried this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Femalebeeffarmer"
},
"reviewBody": "Left out Thyme, don’t like it- turned out great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelJ"
},
"reviewBody": "I thought I had Italian sausage in the fridge for a recipe I was making tonight, but didn't. I did have ground pork, and this turned out really well even using it immediately without the 12 hours to sit. I used half and put the other half in the fridge, so I look forward to tasting it after the flavors have really had time to meld.\n\nI like spicy, so I might add a bit more red pepper flakes next time, although it did have a nice mild kick as-is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "baker'sgirl"
},
"reviewBody": "Made this recipe with some ground pork we had. The recipe as listed was a bit too spicy for my taste, so I'll have to adapt it next time. Everyone enjoyed the egg &amp; sausage sandwiches I made for breakfast, though! Just a note that the patties will shrink quite a bit during cooking, so make them about 1 1/2 to 2x the size you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stuart Preston"
},
"reviewBody": "This turned out fantastic. I was initially worried that the seasoning would not be evenly mixed, but it was better than expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brason B"
},
"reviewBody": "It was really good, but it would of bin better if I had all the stuff to put in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Worley Torrance"
},
"reviewBody": "I love this spice combo. We live outside the U.S. and we can't always find Italian sausage in the stores here, so I use this recipe for soups, sauces, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A R"
},
"reviewBody": "Easy to make and freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Carroll"
},
"reviewBody": "No changes, but didn't chill the 12 hours before cooking, It was fabulous, I impressed myself, used it in a sauce for stuffed manicotti. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "michael_the_meateater"
},
"reviewBody": "I’m quite certain that there is an error in some measurements, most notably the brown sugar. I followed the recipe exactly and made 3 lbs. of this sausage, approximately 60% venison and 40% pork. The recipe called for a mere 15 grams of brown sugar for this quantity of meat. \nNot enough to even make it worth putting in but I did anyways. The final product was fine but definitely lacking the balance that some sweetness would have brought. I believe the author maybe just made an error when posting the recipe, especially considering that it’s called “sweet Italian” sausage. My guess is maybe it should say 1/4 cup instead of 1/4 tsp in the original recipe. \nI would also add more fennel seed to my personal taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foxhunterbabee"
},
"reviewBody": "i come from a family of dedicated Italian cooks. I am a second generation Italian, and after watching my mother and her siblings make sausage, my only comment on this recipe is to allow it to rest for several hours prior to cooking it as the spices need time to mature."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Wright"
},
"reviewBody": "I LOVED! this recipe. We don’t eat pork but I used ground chicken. It was amazing! Just used a little less chicken 2 1/2 lbs. the flavour was so great. Thanks so much for posting this. I have not been able to make quite a few recipes due to the fact that we do not eat pork sausage. Well , now I am trying all of them thanks to you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrndepth"
},
"reviewBody": "I love it. I only use 1 tsp of red pepper and that was more than enough. I gut told me to use 1 tbsp when I read it, however, when I opened the jar of pepper, the smell was rather strong.\n\nI used the sausage in a meatloaf recipe. It gave my meatloaf a wonderful flavor. The next day, I made some into breakfast sausage. Again, wonderful. I don't think I'll buy sausage from a store any more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malinda Martin"
},
"reviewBody": "So easy and so much cheaper than buying it as ground pork is inexpensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy McClelland"
},
"reviewBody": "I used this for a venison sausage. It was absolutely perfect. 2lbs venison to 1lb pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renelle R. P. Ramirez"
},
"reviewBody": "I made this with 3 lbs. of ground turkey, &amp; I used apple cider vinegar because I was out of red wine vinegar. It’s awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Davejayhawk"
},
"reviewBody": "This is by far the best Italian sausage I’ve ever had. A little extra brown sugar, oregano, and thyme helps a bit I think. For all the salt haters out there, if you reduce the size of the recipe you can’t reduce salt in equal proportion to the size reduction. For three pounds the tablespoon in just perfect. Do let it rest overnight in logs in the fridge before freezing. It’s great for sausage and gravy too! By the way, if you can’t find fennel (fennel doesn’t exist in Costa Rica) Anis seed reduced by half and ground in a spice grinder works fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Radiation Therapist 39"
},
"reviewBody": "This is fantastic! I am intolerant to nightshade vegetables which includes bell peppers and paprika, so good luck trying to find an Italian sausage in the store! I thought I would make this recipe to try and duplicate an already-made Italian sausage, and it worked out even better than I imagined, even with omitting the paprika and using no chili peppers . I increased the amount of spice in the recipe just to give it lots of flavor (especially fennel), though used the same amount of red wine vinegar and brown sugar. I did not roll into sausages, I just chopped it in my frying pan, then when it was done I added garlic flavored Classico Alfredo sauce, some spinach, and some broccoli and mixed that with pasta. Wow! My Italian husband couldn't stop eating it &amp; neither could I. After using this recipe, I'm not sure I will ever buy premade Italian sausages when it is so easy &amp; flavorful to make your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Marie"
},
"reviewBody": "Absolutely loved the seasoning. I have made 4 different recipes and this one was the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "Good stuff Maynard! I make it with ground beef instead of pork, as a modified Hot Italian Sausage. We like to use it in spaghetti sauce--it's great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DeniseC"
},
"reviewBody": "I think this recipe was okay. Worked for what I needed it for but I would adjust seasonings in the future. I also found it very salty (and I don't shy away from salt)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "24carrots"
},
"reviewBody": "Deleted pepper per client's wishes, still flavorful. Have successfully made according to recipe as well with turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erick Gonzalez Campos"
},
"reviewBody": "Great taste, try to make them with rich fat meat to not get it too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jimmy"
},
"reviewBody": "Definitely not \"sweet\" with the amount of red pepper flakes that the recipe calls for. I know it says to taste, but this had too much kick to it for my kids. This was mild to hot, even after using it in a spaghetti sauce recipe and simmering for hours. I'll make it again, but with MUCH less red pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Mahan"
},
"reviewBody": "Very good recipe. I made no changes to the recipe. I absolutely will make it again. Only change will be to make it salt free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thesisty"
},
"reviewBody": "Used smoked paprika"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emalee Burkhart Pope"
},
"reviewBody": "I didn't have any fennel, but the recipe turned out fantastic. I used it for zuppa toscana. It was perfect for that and great on it 's own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Jo Holm"
},
"reviewBody": "I will definitely make this again, but with a little less chili flake. Great flavor, used on pizza, and in my pasta sauce with penne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Hinton Cartner"
},
"reviewBody": "I will never buy Italian sausage again. I made this with ground chicken because it is what I had. Like one review, I put all the spices in my spice grinder. I forgot the vinegar but I didn’t miss it. I also left out the sugar because I am cutting out added sugar. I love that I can just throw it together and cook it for spaghetti or patties and it is very flavorful. This is the second time to make it and the first time I only left out the sugar and reduced the red pepper flakes as I don’t like hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Aaron"
},
"reviewBody": "I added more fennel and garlic ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquiem48"
},
"reviewBody": "Ground my pork (I used a pork butt. I trimmed it of the biggest pieces of fat but I wanted some for flavor). Then followed the recipe. We loved it and I know what’s in there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gourmette"
},
"reviewBody": "Loved it. Used ground sirloin beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CarlBakersfield"
},
"reviewBody": "Made a 1/3 batch, using lean pork loin ground in a food processor. I cook with no saturated fats, or low fat used, and it was good even with the modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Engy Mohamed"
},
"reviewBody": "I want to know, Why can't i use ground beef, please? We don't consume pork, and turkey is really expensive where i come from. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erik Wolf"
},
"reviewBody": "I substituted cummin for the fennel seeds. Excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scubydu"
},
"reviewBody": "I made this using ground boneless, skinless, chicken breast because I am on a point system lifestyle. I loved it. One pound equals one point. Very flavorful. Will be a staple for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dgen66"
},
"reviewBody": "Used Ground Turkey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark O Johnson"
},
"reviewBody": "Tasty sausage made with antelope and pork shoulder roast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Great Recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Haverhals"
},
"reviewBody": "Use 2/3 of the recipe's pepper flakes and black pepper. Double the sugar. Half the salt. I used this on 2 lbs of ground rabbit and 1 lb of ground pork. This recipe is for a spicy italian sausage. It is good, but a little too spicy for what I use it for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbayer"
},
"reviewBody": "ThIs is a very good sweet Italian recipe I put a little less black pepper and red pepper to tone it down a little. Otherwise I followed the recipe and really like the flavor I even enjoy it for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty-DC"
},
"reviewBody": "This is a great recipe! One that is easily customizable to taste preferences too! I have made this twice now and LOVE the end product. I use this sausage recipe using lean ground turkey (I make one pound batches) for the Slow Cooker Zucchini Soup on this site. I have shared this recipe with others as well. Thank you so much for this recipe - it is my go to from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made it with ground pork and ground turkey. I eliminate the wine ving and the brown sugar to keep it whole 30. marinara sauce with sweet potato noodles great top ten at my dinner table. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mot"
},
"reviewBody": "I have made it with ground pork and ground turkey. I eliminate the wine ving and the brown sugar to keep it whole 30. marinara sauce with sweet potato noodles great top ten at my dinner table. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Millar"
},
"reviewBody": "Nice balance of flavors. I used this in a lasagna and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Oliver"
},
"reviewBody": "Just perfect, made 4 Ibs. for pizza, street tacos, zoodles and shrimp! This is a very versatile recipe which pretty much can be added to a wide array of meals ........ thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan Dupuis"
},
"reviewBody": "The flavor in this simple recipe is unbelievable--for how simple it is to prepare it makes it tough to consider buying sausage store bought. Tastes exactly like you'd expect only better and it's as traditional as it comes, highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happygirl"
},
"reviewBody": "I love these flavors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shana Lee"
},
"reviewBody": "I've made this a few times to use with lean turkey. Very happy with my Turkey Italian Sausage. I tweak here and there now for stronger flavor, but there was no disappointment following the recipe amounts, as is. Have used this for Pizza, to mix with peppers and potatoes, breakfast. Nice recipe that has saved me time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G'Ma"
},
"reviewBody": "Butchered a hog a couple of weeks ago, tried this recipe and it was just perfect. The seasonings are balanced. My husband and son gave it their approval and that is a huge compliment in my household when it comes to me trying someone else's recipes. You can easily add more spices after the first original mix if you want. We liked it just the way it was. Will be making and sharing this recipe. Thank you Michelle Leigh Gossman for the share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ann McNeely Schmidt"
},
"reviewBody": "This is what you would put in spaghetti sauce not into making Italian sausage. This was not a good receipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Karr"
},
"reviewBody": "I didn't mean to change the recipe. (I really hate when people change the recipe and then rate it!) I thought I had\nfennel and was out. So I added anise seed. It was great! Will make again with fennel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula Loveday"
},
"reviewBody": "Thought it was too salty so will cut back salt to 1 tsp next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brown Jenkin "
},
"reviewBody": "Good recipe. I doubled the red pepper flake, brown sugar and fennel for personal taste. Also a little more salt and pepper. Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "Unbelievably good with venison. Little less pepper for pork, which was just to suit my taste and just as wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jez_s"
},
"reviewBody": "Wow!!! I live in Bangkok and getting great quality Sausage meat... let alone Italian sausage meat has been impossible. So I tried this recipe and it’s just so good! Can’t get fennel seeds here so left that out but followed every other part of the recipe. Just try this one. Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ERINZMOMMY"
},
"reviewBody": "I initially made this exactly as written and found it an excellent way to make sausage. Yesterday I needed chicken sausage for a recipe so I substituted 97% fat free ground chicken breast for the pork and again it was excellent. This is a great way to control the greasiness usually found in store-bought sausage and since my recipe used cooked and drained sausage the extra fat wasn't necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HomeSweetHome"
},
"reviewBody": "I made a mild version of it. Excellent recipe! Very good taste. Just make sure you don’t grind your meat too fine. Using the 10mm blade is the good enough. Next time I’ll try to use the blender to stir the ground meat for a little bit longer like 1-2 minutes to improve the texture. Our was too fine so it tastes very dry. But the flavor is very good! We’ll stick to the recipe for sure. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Dozier"
},
"reviewBody": "Love it! I use this as an alternate to breakfast sausage and Jimmy Dean sausage in many recipes. It works perfectly. I always omit the red wine vinegar because we don't have it on hand, and I usually skip the refrigeration too because I'm in a hurry, and it turns out fine anyway. Might be even better with those two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Josephson"
},
"reviewBody": "This is a great recipe; the proportion of spices are perfect for our taste buds. I have to make everything from scratch because my husband is on a low sodium diet; I made the recipe exactly as it stated except I had to use \"Nu-Salt\", and it was wonderful! We finally have Italian sausage in the house again. I have so missed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "Perfect, as written, for medium spicy Italian sausage. I ground boneless pork loin that I got a Costco’s Holiday sale for under $1 per pound. I used 4 lbs of the pork and adjusted the rest of the ingredients (using allrecipe’s calculator for 16 servings made that a snap) to make it exactly as written, except that I added 1/4 cup olive oil because pork loin is so lean that It would be too dry otherwise. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Marts"
},
"reviewBody": "I’ve made this multiple times now, and it turns out very well each time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evvie's mom"
},
"reviewBody": "We loved the flavour of this sausage. I made it to the recipe, other than adding 3 tsp of crushed chilis. My only complaint was that it was a little on the salty side for our tastes. Next time I will reduce the salt content by half or even down to 1/3."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CasualCook"
},
"reviewBody": "I made a few small changes to accommodate my personal taste, but this was a great recipe to start from. I did not use ground pork, I used a pork shoulder (it was on sale) and ground it in my food processor; it worked out better than I expected. I also doubled the fennel and added a teaspoon of cayenne pepper to make mine a bit more spicy. Looking forward to see how it freezes and thaws out later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PappaOscar"
},
"reviewBody": "Turned out as expected, delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cait"
},
"reviewBody": "Definitely flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Cramer"
},
"reviewBody": "This was so good! Incredibly easy to make. My family loved it. No need to buy subpar sausage from the grocery store. I followed list of ingredients but accidentally left out the red wine vinegar. It was still fantastic. Will make my own from now on. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tommy Hatmaker"
},
"reviewBody": "Italian sausage as good as I've eaten anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zubaida Amatullah"
},
"reviewBody": "Since I am a Muslim, Alhamdullilah, I do not eat pork. So, I modified this recipe to not only taste more flavorful, but make it more more healthy and to follow the laws of Allah (God). I doubled the spices, since spices are the medicine that Allah has made for us to heal our bodies. I also used raw sugar instead of processed white \"crack\" sugar. And I use Himalayan Salt instead of processed table salt. My husband thought the meat had wonderful flavor and was perfect for our home made pizzas. MashaAllah!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Alice Barton Boronkay"
},
"reviewBody": "This was super easy and delicious. \nThe changes I made are: organic ground beef instead of pork; half the recipe; fresh garlic, 2 cloves; garlic infused coconut vinegar; no sugar; added tarragon; anise seed plus fennel seed-neither ground, and when I was adding the anise and fennel at the very end, I forgot it was a half recipe. I don't mind that as fennel is one of my favorite things in Italian food and really good for you! \n I will definitely be returning to this recipe which is bookmarked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CollieFlowerWV"
},
"reviewBody": "This was pretty good. I raise my own pigs and have a few recopies I use. I followed this to the T. The following day I cooked some up for a test and found it just too bland so I added extra spices and fennel seed. But this was a good basic recipe. Being italian, I like some extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coravet"
},
"reviewBody": "I ground up 3 large boneless/skinless chicken breasts and 1 lb of pork terderloin. It made one of the best meat sauces I have ever had! Try it, you'll like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stache"
},
"reviewBody": "Great tasting dish put the patties on the BBQ outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Papa Bear"
},
"reviewBody": "Made this to go in sauce for World's Best Lasagna. I made an extra big pot to freeze for future lasagna or spaghetti. Tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bob Barker"
},
"reviewBody": "I followed the recipe and the result was ok, it did not taste like Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Kesel"
},
"reviewBody": "Made a small batch to try in some spaghetti. Only addition was nore garlic.. Was amazing. Will absolutely make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momadeedae"
},
"reviewBody": "Wonderful recipe, wouldn't change a thing. Used for stuffing the sausage into casings.. delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SZYQ1"
},
"reviewBody": "Very good recipe for Italian sausage! First time making sausage and recipe was a success! Easily modifiable to preferences for hot/mild Italian. Had a 8-8.5 LB boston butt/pork shoulder and ground the meat ourselves. Used dry red wine (cab) instead of red wine vinegar, but may use merlot or zin next time. Halved amount of crushed red pepper (we do not care for hot Italian). If you only have fennel seed, just crush/grind it to the amount called for in the recipe. Before you make logs/freeze it, taste test a small cooked portion the NEXT DAY (or wait at least 12 hours). Then, add additional seasonings as you see fit before freezing it. Initially, found it was too salty (and I love salt)—I used kosher salt. Left mixture in fridge overnight. Next morning cooked up another small portion—what a difference, no longer overwhelming in salt! Think it could use more oregano and thyme and maybe a tad more brown sugar, but don’t want the meat to become too sweet or herby. You can reduce the amount of salt in this recipe, but wouldn’t reduce by more than half. Researched among several different websites and found for Italian sausage 1 to 1.5 tsp salt per 1 LB ground pork is used. The amount called for in the recipe is on par with others. If still too salty for you, do not toss out the whole thing…just mix in more ground pork and other seasonings, no additional salt. If you want to cook sausage same day, do reduce the salt. Using this to make CHI Stuffed Pizza tonight (not from this site)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Lewis"
},
"reviewBody": "One of the spices is overpowering in the batch I made. I followed the recipe to a tee. I hope that flavor will mellow out with time in the freezer. It is good. But not great.\n\nEdit: After freezing this sausage is actually amazing. Give it time for the flavors to meld on this one. It is worth the wait. Some of the best sausage I have ever made actually!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lamarche68"
},
"reviewBody": "A good base"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/672/meat-and-poultry/pork/sausage/",
"name": "Sausage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/",
"name": "Homemade Sweet Italian Sausage (Mild or Hot)"
}
}
]
}
}
, "about": [
]
}
]