				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Homestyle Stuffed Peppers"
,"datePublished": "2019-06-06T19:48:02.000-04:00"
,"dateModified": "2022-12-16T13:24:32.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jillian"
,"url": "https://www.allrecipes.com/cook/jillian"
}
]
,"description": "Old-fashioned stuffed peppers just like mom used to make! Green bell peppers stuffed with beef and rice are smothered in a tangy tomato sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TGaCt0CVORBK9XLawpzGsO713KE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2530705-f4016b0692bf464494ce23705aafbbee.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Homestyle Stuffed Peppers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "135"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "557 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "165 mg"
,"fiberContent": "6 g"
,"proteinContent": "43 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1510 mg"
,"sugarContent": "12 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"4 medium green bell peppers, tops and seeds removed",
"1 (28 ounce) can tomato sauce",
"0.25 cup white vinegar",
"1.5 pounds lean ground beef",
"1 cup leftover cooked white rice",
"0.5 cup Italian-style bread crumbs",
"6 tablespoons grated Parmesan cheese",
"0.25 cup finely chopped onion",
"1 large egg, lightly beaten",
"0.5 teaspoon garlic powder",
"0.25 teaspoon salt",
"0.25 teaspoon black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of water to a boil. Add peppers and boil until softened, 4 to 5 minutes. Transfer peppers to a colander and run under cold water to cool."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Stir tomato sauce and vinegar together in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Mix ground beef, cooked rice, bread crumbs, 4 tablespoons Parmesan, onion, egg, garlic powder, salt, and pepper together in a large bowl until well combined. Spoon beef mixture into peppers. Place peppers into a 9x13-inch baking dish with the stuffing facing up. Pour tomato sauce mixture over peppers, then sprinkle remaining 2 tablespoons Parmesan over top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven, basting peppers with sauce several times, until beef filling is no longer pink in the center, about 1 hour 20 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn’t have sauce so I used vegetable juice. Recipe made 8 sm-med peppers and was quite easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mtverbruggen33"
},
"reviewBody": "It is an amazing recipe. Very close to the one I whipped up. Never thought of using the egg though. Delicious! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe. My Mother made this as well but I kick it up a notch. Ok, a couple of notches. I add carmelized garlic and onion, celery and diced green chilis and I use 1/2 Italian Sweet Sausage and 1/2 Ground Sirloin for the meat mix. Sometimes all Sausage for even more flavor. My husband would eat these every night and even the 4 picky kids loved them. Sometimes I even use Rice Pilaf mix, rather than white rice. I change it up almost every time, but what reminds me of my Mother's recipe is the Italian Bread Crumbs. Oh, and hers were so nice and neat in the pan; mine are chock-full and spilling all over the pan. The best part for me is the spilled-over insides that are slightly burned and sticking to the pan! Yummers! Super recipe and great memories of your Mom!!! (I just sent hubby to grocery store so I can make these tonight. See what you have done!!!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "Pretty bland and a lot of trouble. Need to drop old fashioned useless parboiling, up the seasonings and perk up the sauce. I added an envelope of onion soup mix to the filling and made a sweet sour sauce from a can of whole cranberry sauce and a can of tomato sauce. Much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakersdozen"
},
"reviewBody": "Super good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dddupay"
},
"reviewBody": "I used yellow peppers, a personal preference for sweeter, softer skin. Also, browned and drained the ground beef in advance. Got rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cevert"
},
"reviewBody": "I made these tonight! My husband is very hard to please, he raved about them!! The only thing I changed was I added mozzarella on top and melted in the last 15 minutes of cooking. They are delicious. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "These are a huge hit I’m with even my picky teen. The only change I made was I chopped up the pepper tops and added it to the meat mixture. Soooo good. Had a lot of meat mixture left over and made a meat loaf out of it. Double whammy ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndy"
},
"reviewBody": "This is a great recipe. For others with negative reviews, perhaps try a sauce like fire roasted tomato and garlic That’s what I used and this came out picture perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ava Harrison"
},
"reviewBody": "Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dustin Broschat"
},
"reviewBody": "i used bell and banana peppers and actually LOVED the banana peppers even more than the bell. I also added some garlic in the meat while browning, added some mozzarella in with the mixture as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "Made it! Loved it! I did make a few changes due to lack of ingredients. I used Minute Rice uncooked, Classico Tomato:Basil sauce. I did have a small can of Tomato Sauce that I poured on the bottom of the pan. The basting is key to a flavorful Stuffed Pepper. Next I will try the soup version! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Brantly"
},
"reviewBody": "I thought it was great, but used marinara sauce instead of tomato sauce, I will make it again, also used trio of red, yellow and green peppers. It will good and nice to look at."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "This was super good! I used almond flour instead of bread crumbs and herb de provence for the italian! I had some extra meat filling so I made meatballs with that...worked out perfect for the little people who are not pepper lovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lockport's Hot Dog Cart King"
},
"reviewBody": "Followed the Recipe , except for the Tomato Sauce (had none) so I used Tomato Puree instead. Really liked it. The Puree made the sauce a little thick , but it worked. Next time I would add a little sauce to the meat rice mixture. Yes I would make this again. Oh I slice a little of the bottom of the pepper off so they stand up in the pan and wont fall over. Also I put small holes in the bottom's , so the tomato juice gets sucked up inside the pepper to keep it moist while cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hildamae"
},
"reviewBody": "We love this dish. My husband questioned the baking time as being extremely long. However, I checked with the meat thermometer and the baking time was exactly correct to get the ground beef in the peppers into the 160 degree \"safe zone\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lonetta Johnson"
},
"reviewBody": "I made it. I used bacon pieces instead of ham. It was delicious. I definitely will make it again when I have brunch with my family. I gave it 4 stars because my potatoes started to get a little mushy. I know now not to over cook the potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loraine Kuschel Wilson"
},
"reviewBody": "I made a similar one--just can't find it on this site. Basic--1 # ground beef, 1/2# ground turkey, 1 cup rice, 2 c. spag. sauce, 3/4 chicken broth (can use water) s &amp; p. Parboil peppers for 2 minutes and brown meat with onion &amp; s &amp; p. Drain grease and add rice and rest of ingredients. Bake 350 for 45 min. covered and then uncover and top with sheddred cheese and bake til cheese melts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jreadman"
},
"reviewBody": "I have made these several times and my family loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Lucas Loeber"
},
"reviewBody": "I added some Worcestershire and it came out amazing. Will definitely make again ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michellehoczek"
},
"reviewBody": "These were great! I would love to try this with those small little pumpkins for a fall meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Millers Kitchen"
},
"reviewBody": "Awesome recipe ! Not diet friendly but if you’re gonna have a cheat day/cheat meal this is a great one ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Pavlich-Stutzman"
},
"reviewBody": "I made this and we loved it. I used diced tomato's mixed in with meat and other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "alice owen"
},
"reviewBody": "This needed at least 10 more minutes cook time. It was pretty bland. Maybe Italian sausage added and a little more sauce. Definitely needed some salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thom"
},
"reviewBody": "Came out great, I spiced it up a little bit(or maybe a lot) and skipped the egg, didn't really see any need for it, but no other changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "More like 4 and a half stars. My daughter likes them but I felt they were slightly bland. Maybe next time I will add a bit more of the spices and more to the sauce for just a bit more flavor. Otherwise good and easy. I was glad the beef cooks in the pepper. I don't like the idea of cooking the meat firsr."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wormdogg10"
},
"reviewBody": "I substituted the vinegar with Italian diced tomatoes and added Italian cheese blend with the shredded park."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "I do add a table spoon or more of sauce to bottom of each pepper and then half fill with stuffing and then some more sauce and then rest of stufing. Sauce on top and in pan. I LOVE sauce and this really makes the dish. Also, real minced garlic, not powder....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denyse Gagyi"
},
"reviewBody": "I will make it again. Was very good.I only add some tomato sauce more . just delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Ferrara"
},
"reviewBody": "Wow, best stuffed pepper recipe I have ever made...and so easy with basic ingredients. The vinegar really added a delicious kick to the basic tomato sauce. I used those already-cooked packs of Uncle Ben's Brown Rice, making it even easier. As far as the cheese, I used extra Romano instead of Parmesan (as I always do on my pasta). I felt it gave the stuffing an even deeper layer of flavor, and added some extra saltiness. I topped it off with the cheese as well as directed, but I'll skip this in the future. I felt it was too much grating only to give it a small rubbery topping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mic O"
},
"reviewBody": "I made this recipe exactly as stated and it was great!! my husband loved it. we will be adding this to our collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esperanza Ash"
},
"reviewBody": "I made this twice, once as written and once with some changes. The original filling was a bit lacking in flavor so I added some fresh garlic, more salt and pepper and some Italian seasoning. The sauce also needed help in my opinion so I made it with the vinegar but added about 2 tablespoons of chili garlic paste and about 2 teaspoons of salt as well. Great base recipe that's able to handle personal touches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelsea Ritter-Elertson"
},
"reviewBody": "I added 2 cans of mixed veggies to the ingredients. I would mix some tomato sauce with the meat for more flavor of the tomato Otherwise it was so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Thibeault"
},
"reviewBody": "I used cauliflower \"rice\" instead of regular rice. Sauteed it with same amount of carrot, onion and 1/2 stalk chopped celery before adding to beef mix. Served with side of mashed potatoes. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Hupp"
},
"reviewBody": "Been making this for a couple years and it is great and easy to adjust (play with). Last time added v8 and a small can of sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aunty Karen"
},
"reviewBody": "Thought the flavor was very good, really liked the vinegar in the sauce. Only thing I would change next time would be to add a bit of liquid to the meat mixture, maybe some tomato sauce as it was a bit dense. Changes I made were to chop up the bits of pepper from the pepper tops and sprinkle them in the bottom of the 13 x 9 pan. Why waste them? I also slightly cooked the onions before adding them, and added a few sprinkles of \"Onion Onion\" seasoning from Pampered Chef to the meat mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLeinen"
},
"reviewBody": "This was the first time I have made stuffed peppers. I chose this recipe after reviewing the many recipes posted on Allrecipes &amp; other recipe sites. The ONLY changes I made were: add some tomato sauce and fresh grated garlic to the hamburger mixture. The only change I will make the next time (and there will be a next time) will be to make extra sauce. The sauce was delish! It reminded me of the sauce my grandmother used to make her stuffed cabbage rolls. Thank you for sharing your family recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Bubacz"
},
"reviewBody": "I followed the instructions fully and I must say : Wow!! So easy to make if a bit messy. The family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Johnson"
},
"reviewBody": "My husband followed the exact recipe. He smoked it on our grill. We loved it! This is delicious, clean eating. Great healthy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "The meat mixture was rather bland and all I could taste was vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John M"
},
"reviewBody": "Delicious stuffed peppers! I followed the recipe to a T with one exception. For the sauce I used my own recipe that is tangy and a just a touch sweet. I used 32oz of tomato sauce, 4tbls of brown sugar, 4tbls of lemon juice, and 4tsp of worcestershire sauce. I added 3/4 cups of the sauce the meat and rice mix. I had enough for 5 peppers, of which I made 2 with orange peppers that were also delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeNJ"
},
"reviewBody": "This recipe was Very Good!! I made it with Brown Rice &amp; 6 Green Peppers + we\nadded a bit more garlic to our individual plates - as needed. My husband commented how good it was + the leftovers were even Better the next nite. Will\ndefinitely make this again - well worth the effort. Thanks Jillian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Campisi"
},
"reviewBody": "Super tasty recipe. I used what I had. One pound of ground beef 93/7, red bell peppers, 1/2 onion, 2 eggs, small can of tomato sauce 8 ozs. I was worried that the vinegar might be too much since I used a smaller can of tomato sauce so I added a little dry mustard and a pinch or more of red pepper flakes. Lots of spices, oregano, garlic, basil. tsp of each or more. I also added a can of diced tomatoes on the bottom of the casserole dish with more oregano sprinkled in--we love oregano…. And I had a 1/2 yellow tomato I dice and put on the bottom of dish you'll see in photo. I also put some of the sauce and 1/4 of the can of diced tomatoes in the meat mixture. Topped each pepper with sauce and topped a couple of the peppers with mozzarella cheese just to see if I liked it better than the parmesan. I loved both cheeses…I did not pre-cook peppers. This sound like a lot but it's not. This is a keeper! Best stuffed peppers..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "big e"
},
"reviewBody": "this is the real deal no changing people want to cook the meat before wrong perfect sweet and sour taste and texture this one will always be"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoanneP"
},
"reviewBody": "Good recipe easy to follow. Husband enjoyed them as well. Home cooking comfort food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana Lane Taylor"
},
"reviewBody": "Fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Lee"
},
"reviewBody": "Oh my gosh. My husband wanted peppers for dinner. I agreed. Found this recipe and didn't really expect to like it. Well, let me say I'm hooked on these things. They are fabulous. I'll make more, for sure next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn MacDonald"
},
"reviewBody": "Loved it! Very quick prep time, did not have any garlic powder so I used a garlic clove. I am a huge fan of onions and cheese so I added extra. Everyone loved them and I sent the recipe to my mom! I would definitely recommend if you are looking for an easy stuffed pepper recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "The only changes I made was I used ground turkey &amp; only because we have cut back on red meat...Also, I added diced carrots. It's the only way I can get my hubby to eat them! I did follow the seasonings without changing any. This was a yummy dish! Received compliments from the hubby &amp; kiddos...They asked me to make this one again...Next time I will double the tomato sauce topping...We loved it!! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela S"
},
"reviewBody": "This is delicious! The perfect way to use up those extra garden peppers, and it freezes well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia"
},
"reviewBody": "I made these exactly as written. They were delicious and are a requested meal in our house. My boyfriend takes them to work for lunch and enjoys them as leftovers!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Delicious meal the only thing I did is add some mozzarella cheese. I will be making this often. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "banshezmom"
},
"reviewBody": "Fantastic. My 10 year old dd not only requests these, but has proclaimed them to be on her top 5 faves of all time food list. I make them as directed, although sometimes I use a little less ground beef and a little more rice - depending on what I have. Thanks Jillian for a wonderful recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kmhbsn"
},
"reviewBody": "Loved the stuffing mix but found the tomato sauce and vinegar a bit too much. Will substitute a different topping. Also topped with mozzarella was better than Parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2c00k"
},
"reviewBody": "Some of these bad reviews are so rude and I honestly question your cooking abilities! I've made this numerous times and find the recipe to be easy to understand and follow. Every time they turn out wonderful. I've played around with the meats and pepper types and even the sauce sometimes I mix vinegar with spaghetti sauce. Every time they are a huge hit. One of our favs is to add 3/4 c pear cous cous in place of the rice. The recipe is more like a meatloaf consistency but still to die for I personally don't care for the ones that you cook the meat first. This will be one of the recipes I pass down to my children for sure :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Carter"
},
"reviewBody": "These were very good. I thought they were very flavorful. I followed the recipe as written, but happened to have a leftover roasted jalapeño that I diced up and added to the mix. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pdxlady"
},
"reviewBody": "Really love filling in this recipe. Just tweaked sauce a bit - used cider vinegar and added a bit of brown sugar. We love some sweet &amp; sour. Also didn't boil or blanch red bell peppers first - they came out tender without being mushy. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "googlethis"
},
"reviewBody": "I'd give it 10 stars if I could . Filling tastes like a giant meatball , tender and delicious . Sauce takes a little getting used to but it's now my favorite part ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kauffierun1"
},
"reviewBody": "We make this dish at least once a month! My fiance and I are gluten free, so just swap out the bread crumbs for corn bread crumbs, and sometimes we mix in some stewed tomato/zucchini/onion. The white vinegar really makes a wonderful difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Theresa "
},
"reviewBody": "Had no flavor. won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I expected great things with all the positive reviews. I guess I'm in the minority but nobody in my family would eat these. I followed the recipe exactly but we found them to be incredibly bland, the peppers too mushy and the tomato sauce with the vinegar tasted exactly like ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "timber1020"
},
"reviewBody": "first time making stuffed peppers, recipe was fairly easy and was very good. was a good basic recipe that you will not be disappointed, definitely worth making ! did two peppers straight up , and cut two in half and did them on their sides like other recipes , both were good !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2obies"
},
"reviewBody": "These were wonderful. A bit of prep work, but well worth it. I had 1.25 lbs of ground beef and kept the rest of the ingredients the same. It filled 4 bell peppers. The sauce was just the right amount, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DrSeussFreak"
},
"reviewBody": "Absolutely amazing recipe, thanks for posting. Simple yet delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Janine Brooks"
},
"reviewBody": "Three of us sat down for the dinner, and all found the stuffed pepper to be somewhat dry and lacking substantially in flavor. Don't know what we can do to fix it . . . perhaps slicing the peppers in half (like my nana used to do) and then stuffing the meat in each side; maybe even blending in a can of that tomato sauce directly into the meat. We will try another stuffed pepper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Lombardo"
},
"reviewBody": "Stuffed peppers have been one of my favorite dishes for years and this recipe did not disappoint. I made them for my boyfriend and I and we both enjoyed them. I did make a few changes to cater more to my tastes. I fried my chopped onion in butter and added a tsp of chopped garlic to that. I also added a dash of Emeril's essence for some flavor. I also made more sauce and added some to the meat mixture inside the pepper so there was cooked in tomato flavor throughout. I think the changes I made were pretty minor and the recipe is probably still great as is. Thanks for the wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob C."
},
"reviewBody": "tried this last night and it may seem time consuming but was basically easy and very good!as they say just like mom's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Rios"
},
"reviewBody": "I tried this recipe and it was great. My daughter and husband loved it and said they would eat it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHORECOOK"
},
"reviewBody": "YUM! So flavorful! I love having a recipe that you don't have to cook the ground beef first. Your review was so helpful, Jillian. I used frozen bell peppers from last summer's garden. As the peppers were soft when they defrosted, I skipped cooking them in boiling water. I tried not to stray from the recipe, but when I went to do the dishes, I found the egg still sitting there lightly beaten. It didn't seem to be a problem. The cooking time was right on and our dinner was FABULOUS! Thank you for sharing your family recipe, Jillian I'm sure you make your family proud!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Myers"
},
"reviewBody": "This dish reminded me of the bell peppers my mother used to make for us, only less time. For some reason my mom made this dish sound like it was so time consuming. Well, not with this recipe! My husband loved it and so did i. no changes were made to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Super great recipe! I've made these peppers a few times and we all love them. I use red and green peppers for a variety and with 1 1/2 lbs beef it easily fills 5-6 peppers. I really like the addition of the vinegar in the tomato sauce. Great with mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KFIORELLO"
},
"reviewBody": "My daughter made this recipe but used Jasmine rice...excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Norris"
},
"reviewBody": "We loved it, the only thing I did differentwas used sausage and hamburger mixed and tomato soup with equal amount of water, instead of tomato sauce and vinegar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Nappi Halliwell"
},
"reviewBody": "This recipe tasted exactly like my Mom used to make. Only thing I did different was not pre-cook the peppers only because I like them a little crunchier. I also added more cheese because I love cheese! Will definitely use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Antonette0502"
},
"reviewBody": "Pleasing an Italian when it comes to food is not always easy, but with this recipe my boyfriend raved about it saying they were some of the best stuffed peppers he ever had. Excellent! Sent the recipe to my sister and her family loved them as well! Thank you for the submission!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MamaFuturama"
},
"reviewBody": "Recipe does not indicate whether the ground beef should be browned. Assumed that since it required raw egg and breadcrumbs (like a meatloaf or meatballs) that this was reasonable.I made the meat mixture as directed. Just bit into RAW ground beef, even after an hour in the oven and letting it sit for 10 minutes out of the oven. If you ARE supposed to BROWN the beef before hand-why the bread crumbs and egg? Also, there was SO much \"stuffing\" left over! I *always* follow a recipe exactly if I am in doubt... \r\nThe sauces' pungency is also an issue.\r\nI am going to chop the peppers sans sauce up and flash fry the mixture (along with ALL the leftover stuffing). I plan to season the sauce in a large pot, adding some BROWN sugar to cut the acidity and ODD taste the bitter (bell peppers release their bitterness when cooked, especially when cooked with tomato) sauce has, heat and add the flash fried chopped up peppers/stuffing. I plan to let it simmer, then transfer to a oiled 13x9 inch pan and top with cheddar cheese and bake it into a \"stuffed pepper casserole\". I will have to eat it another day, though. \r\nI really do not like to give this sort of review, especially as this recipe has so much sentimental value to the submitter. I kept imagining someone serving raw meat to a small child or anyone with a compromised immune system, so I felt a general warning was needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy "
},
"reviewBody": "This was a very good recipe. Although, I made a few slight changes by using ground turkey and brown rice. Also, I did not precook anything. I used cooking instructions from another recipe and baked this on 350 for 2-3 hours and the peppers came out perfect! For added flavor, my mom used to cook her peppers with a couple strips of bacon on top; however, I did not have any bacon on hand for my first try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrselsey"
},
"reviewBody": "Really, really good! It didn't say to pre-cook beef, but I did. They took 20 minutes to bake and were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICHELLENMARK"
},
"reviewBody": "This was great! I made it using red peppers instead, and used brown rice instead of white. Everyone in the family ate it... Including kids! They liked to top theirs with a little shredded mozzarella after it came out of the oven, but it was fantastic just the way the recipe calls for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Leslie Pallotta"
},
"reviewBody": "Used ground turkey instead of beef, but otherwise followed the recipe exactly. Entirely too bland. Won't be making peppers this way again. Prefer my veggie version with spinach, mozzarella, and ricotta cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmfoster"
},
"reviewBody": "We had lots of peppers from the garden. I went through several recipes looking for one that I already had the ingredients for. These were the best peppers ever. The only thing I did different, I didn't have enought Parmesan cheese to put on the top, so when the buzzer went off, I topped each one with Mozzarella cheese, and closed the oven door just long enough to let the cheese melt. OMG, These are going on my monthly menu for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "megishungry"
},
"reviewBody": "Great start! I made the recipe exactly as written (vinegar included - no regrets!), but felt it needed stronger flavor. Next time I'll add more garlic, salt, and sauce, maybe even a little hot sauce to change it up. Served with a little sprinkle of garlic salt it was much improved. Will make again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "facetiousy"
},
"reviewBody": "This was eatable, but I would not make again. I thought the filling lacked a little in flavor, and the tomato sauce was too sweet and in dire need of spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "megs"
},
"reviewBody": "I just made this for my husband and I--it was delicious--I took the advice of one of the reviewers and replaced the vinegar w/ hot pepper sauce, I also added red pepper flakes for a little kick and it was great. Next time I may add a little Thai chilies to it and I think it will be perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amy Girard"
},
"reviewBody": "This was more of a meatloaf consistency. I didnt care for it at all. I prefer the hamburger cooked then placed in the peppers and baked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "I had a problem with the mixture inside not sticking together very well but I solved that by mixing in some tomato sauce and shredded cheese before I put it in the peppers. Also, I just used jarred spaghetti sauce instead of making the sauce. Overall it was very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Kunkel"
},
"reviewBody": "Excellent Recipe! Easy to make and tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sunflowergirl1"
},
"reviewBody": "Thank you for this recipe, it was really easy to make and tasted good. The only issue I had was that wasn't spicy enough for me. Next time I am going to add a little dried jalapeno to give it a little kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LALAFLUTIST"
},
"reviewBody": "These are the best I've ever made. My husband loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsMary"
},
"reviewBody": "Pretty tasty. I used brown rice instead of white and crackers instead of bread crumbs. I'll play around a little next time but it's not really necessary. Next time maybe add Worchestschire sauce and ground ginger... Hmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Syndi"
},
"reviewBody": "I made this Recipe for my parents and I and they raved about it. I did make some changes. I followed a suggestion another user said, leaving out the vinegar in the tomato sauce. I also used Red bell peppers since i like sweet peppers and I omitted the bread crumbs since i dont eat bread/flour. I used brown rice instead of white and i used ground turkey instead of beef and i sprinkled on more cheese than called for at the end. It was really good 5 Stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "periwinkle"
},
"reviewBody": "My husband and I absolutely loved this recipe! The only thing I changed was we used ground turkey since we don't care for beef. The best stuffed peppers I've eaten, hands down. Mmmmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Mclaughlin-Carello"
},
"reviewBody": "Delicious!!! I put my twist on this dish by using 2 cloves of garlic minced, palm of Italian spices a hand full of mozz cheese and a TBSP of Romano cheeses inside the peppers, also I used Red bells instead of the Green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katscooks"
},
"reviewBody": "Excellent! Followed recipe exactly and got rave reviews. I am making again this weekend. Family made me promise. They loved it a bunch!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billiejo"
},
"reviewBody": "great i use stuffing in stead of bread crumbs. no vingar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kamphoff"
},
"reviewBody": "I really enjoyed this recipe. However, I substituted cholula hot sauce for the white vinegar and it was a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ceree"
},
"reviewBody": "This is definitley one of the better stuffed pepper recipes I've used. I went by the recipe this time but next time may add some of the yummy tomato sauce blend inside my mix. I will use this recipe again for sure. BTW 1 1/2 lbs of beef stuffed 5 peppers full for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juzwiak77"
},
"reviewBody": "After a few tweak's,this was awesome!I used very lean ground turkey, and whole grain rice for a bit more of a healthier version, and added a little extra cheese, and a bit more salt, and added a pinch of salt to the sauce. I also added 2 T. minced garlic, which added soooo much more flavor! My husband and I agreed that it could even use more sauce, maybe a 7-8 oz can more."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220003/homestyle-stuffed-peppers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13289/main-dish/stuffed-main-dishes/stuffed-bell-peppers/",
"name": "Stuffed Bell Pepper Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220003/homestyle-stuffed-peppers/",
"name": "Homestyle Stuffed Peppers"
}
}
]
}
}
, "about": [
]
}
]