				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Honey Walnut Shrimp"
,"datePublished": "2020-06-18T23:13:08.000-04:00"
,"dateModified": "2022-07-14T17:27:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Celia"
,"url": "https://www.allrecipes.com/cook/1570292"
}
]
,"description": "This honey walnut shrimp is a Hong Kong-style recipe for crispy fried shrimp in a creamy honey-mayonnaise sauce, topped with homemade candied walnuts."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WwJVouTHvlnQpMVpxjadhdM61eI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/270515-42a68d5e9b1f4614a159d3dfbc7882be.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5723279376001",
"description": "A Chinese food favorite! Crispy battered shrimp with candied walnuts.",
"duration": "PT53S",
"name": "Honey Walnut Shrimp",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9d3938bb-ca99-44e2-aedb-319ea9254281/842b5d05-662e-41ff-8184-6cd8d0687fb7/1280x720/match/image.jpg",
"uploadDate": "2021-06-28T21:48:15.585-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Honey Walnut Shrimp"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "586"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "605 kcal"
,"carbohydrateContent": "68 g"
,"cholesterolContent": "179 mg"
,"fiberContent": "2 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "340 mg"
,"sugarContent": "45 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup water",
"0.66666668653488 cup white sugar",
"0.5 cup walnuts",
"4 large egg whites",
"0.66666668653488 cup mochiko (glutinous rice flour)",
"1 cup vegetable oil for frying",
"1 pound large shrimp, peeled and deveined",
"0.25 cup mayonnaise",
"2 tablespoons honey",
"1 tablespoon canned sweetened condensed milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir together water and sugar in a small saucepan over high heat. Bring to a boil and add walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry."
} ,{
"@type": "HowToStep"
,"text": "Whip egg whites in a medium bowl until foamy. Stir in mochiko until it has a pasty consistency."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a heavy deep skillet over medium-high heat."
} ,{
"@type": "HowToStep"
,"text": "Dip shrimp in mochiko batter, then fry in batches in hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WwJVouTHvlnQpMVpxjadhdM61eI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/270515-42a68d5e9b1f4614a159d3dfbc7882be.jpg"
}
]
,"text": "Stir together mayonnaise, honey, and sweetened condensed milk in a medium serving bowl. Add fried shrimp and toss to coat with sauce. Sprinkle candied walnuts on top and serve."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Borchman"
},
"reviewBody": "i have made this several times it is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was pretty good. I made the shrimp in the air fryer instead of the pan fry in oil. I did 400 degrees for 7 minutes and they had the perfect crunch and flavor! The sauce is pretty good too but I think I used too much mayonnaise cuz I could still taste it. My one complaint is when I mixed the egg whites and mochiko for the fry batter it came out as more of a dough than a paste, and I couldn't coat the shrimp well enough. Overall I liked it, and I would definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Van Dyk"
},
"reviewBody": "Hubby gave this a 12 out of 10. I ordered the flour from Amazon and followed the directions. I did add an extra tablespoon of honey to the sauce. This recipe was delicious and very simple to make. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used tempura batter. It seemed like the candied walnuts had too much water. The sauce was on point though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "I have made this several times. The rice flour adheres much better than corn starch and is worth finding. Larger shrimp work better than smaller. Overall, this is delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's very good but very sweet. I would say to go easy on the amount of \"sauce\" you toss the shrimp in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oalphacash"
},
"reviewBody": "It was absolutely amazing. It didn’t take long to make it I will be making that again.. I think I may use less manage but overall pretty good dish…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay Schumaker"
},
"reviewBody": "Thank you Celia for a very very good recipe. I learned a lot and got to eat a dish I have no way of ordering near me and had been craving. Thank you!! \n\nI liked this recipe a lot. I decided to make the recipe as is with no suggestions/changes from other reviewers. Here are my notes/lessons learned. I am an average home cook but have never fried meat before and this took about 1.5 hrs start to serving. That time included making a side of rice, chopping a couple heads of broccoli then steaming, and also deveining shrimp that were tail/shell free. \n\nStep one notes: I followed the recipe exactly and even with doing this first my nuts were wet and not very sweet by serving time. I will look at other reviews to alter the recipe (maybe less water or making a sugary paste..) Also I put them on a cookie sheet but all this did was make another big dish to clean from sugary water. 1/2 cup of walnuts is not much so I’ll put them on a dinner plate that is easier to throw in the dishwasher at the end. This meal makes a lot of clean up dishes as is. (One other thought… I now wonder if the recipe is supposed to have another Atr and the baking sheet is to put the walnuts into the over to dry out and bake?)\n\n\nStep two notes: I could not find mochiko at my small town local grocery or Walmart but I did get the mochiko flour from Amazon. I’ll use the left over flour to make this again and to attempt to make mocchi from scratch. The batter using the flour was awesome but using the full amount of"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mayrod"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeannie Jean Geron Guinhawa"
},
"reviewBody": "Super easy to make and simple ingredients, the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Vander Woude"
},
"reviewBody": "Family loved it! I would say to double the sauce and add red chili flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Katie O'Brien"
},
"reviewBody": "I followed this recipe to a T and it is disgusting. Super bland, gross consistency. I actually spit it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Ann Dziubak"
},
"reviewBody": "Loved it, I added more walnuts because I love the flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "None of the mochiko and egg whites batter stuck to the shrimp. None. basically eating shrimp with mayo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clara Joy Welcome"
},
"reviewBody": "I loved this recipe! Just for a little something special, I added a tablespoon of flaked coconut and an extra egg white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chanscar"
},
"reviewBody": "Didn't change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Delicious! Better than the restaurant version I enjoyed before COVID closed down the restaurant I went to. I did make some mild observations and had to make one substitution. \n\nObservations: \n1. When using nonstick cookware, instead of a plastic slotted spoon you may benefit from tongs or chopsticks as the spoon WILL warp. \n2. I had to add about 2 tablespoons of water to the mochiko and egg mixture in order to thin it out enough it would stick to the shrimp. I also had to toss to coat instead of being able to just dip it in. \n3. I used pre-cooked shrimp so this wasn’t an issue, but at medium high the batter became golden and in one batch a little burned in under a minute. You may need to play around with your stove to find out if it’s an over achiever like mine is!\n4. The oil wasn’t quite deep enough in the skillet I used, so I will be adding more to avoid having to turn the shrimp over half way through again. \n\nMy substitution was miracle whip instead of proper mayonnaise, both because we were out of mayo and because my mine went to kewpie mayo which is sweeter and miracle whip was as close as I could get to it on short notice. \n\nAll in all an easy, fast recipe! (Don’t be me and forget to wear long sleeves!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "b2joyable"
},
"reviewBody": "Made this for my hubby and we both loved how it tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "52GLASSACT"
},
"reviewBody": "Very easy to prepare. I cheat and purchase honey glazed walnuts. Otherwise follow recipe but, tonight adding calamari with the prawns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cocoair"
},
"reviewBody": "I made it double the recipe for this Christmas day dinner. The recipe was easy and this becomes our family?s favorite! Thank you for your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul G"
},
"reviewBody": "Recipe was on point! Fixed it exactly as written. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foley's Kitchen"
},
"reviewBody": "M husbands eyes almost popped out of his head! This is better than any I’ve had in top Chinese restaurants! It is a definite keeper and not ad!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly Elizabeth Rose"
},
"reviewBody": "It was okay. For sure you gotta just throw all the shrimp into the egg paste stuff and mix it all up. “Dipping” it did not cut it for me. Mixing it all up together ensured the shrimp were evenly and not too heavily battered. Next time I probably will make less batter even still. I should have gotten the cabbage that other people advised but I never use cabbage and didn’t want to waste most of it. Next time I think I’ll use chicken instead, too. I also fried the walnuts after letting them dry post boiling as others said. Good sauce. The moshiko was weird. Really poofy, or maybe I whipped my eggs too much. Might try corn starch and regular rice flour next time as well. It was definitely very close to what you get at a restaurant but I always feel like it could be better at the restaurants"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hapybrian"
},
"reviewBody": "Very tasty! The wife said \"this is a repeat!\", and had seconds, so that's a good sign.\n\nI didn't have any mochigome, but used katakuriko(potato starch) mixed with regular flour. Seemed to work out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alitzah"
},
"reviewBody": "I loved the recipe and I didn't have to make any changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dale Muckerman"
},
"reviewBody": "Very good. I made it exactly as recipe describes. On the downside, it is a rather wasteful recipe. You end up with most of a can of condensed milk to use elsewhere. You use a lot of sugar to make a lot of syrup which is used to sweeten the nuts and then tossed. I also question the nutritional information on this recipe. Where do you get 26 g of protein? 1/4 lb of shrimp is only 13 g of protein. I will be looking for a less wasteful recipe the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Henry"
},
"reviewBody": "I really loved this recipe. I changed the rice flour to panko bread crumbs. I was not able to find the flour. but it turned out awesome and the sauce real good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Shaw"
},
"reviewBody": "I used cornstarch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexie Mantlo"
},
"reviewBody": "Betty Crocker Gluten free flour (rice flour blend) works well as a substitute for the flour here. Kept everything else the same. I also recommend non-stick for the frying part and flipping them earlier than you would think to avoid sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawnette Hale"
},
"reviewBody": "Very tasty - yum yum. I needed to add an extra whipped egg white because I added the rice flour in two portions and the mix was too thick. I also added salt. once I tasted the dish. Might use another candied walnut recipe because I like a bit of crunch. Or maybe I will toast the walnuts and then boil. Overall - this tastes delicious, and I will make it again. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AndreaA"
},
"reviewBody": "I made this. Was really good. However, next time I will reduce the mayo and increase the honey. I felt like it had a may flavor and not a sweet enough flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrazyAsianMom"
},
"reviewBody": "This is so delicious! It tasted like Panda Express! I wish I had a big wok or deep fryer here at home so that I can fry the shrimps all in one batch. (The shrimps gets a bit soft when cooled, but I have to fry them by batches because I have a small frying pan) Otherwise this is really legit copycat of the Panda Express’ recipe. I won’t change anything to it. Thank you for sharing this delicious recipe! My family loves it and will make this regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Lambert"
},
"reviewBody": "Very involved and a lot of work I thought but the outcome was delicious. Next time I’m not going to do all it asks for the walnuts. I’m just going to put them in the sauce. Because it was a lot of work but also because the walnuts didn’t seem all that great for the effort. The shrimp and the sauce was so yummy. I used cornstarch instead of the very elusive and impossible to find glutinous rice flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "We were unfortunately very disappointed with this recipe. My husband didn't finish his, and indicated it was too sweet, and the condensed milk had too strong of a flavor in the sauce. I would not recommend this recipe and we will not be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abs"
},
"reviewBody": "My family really enjoyed this. I actually used chicken instead of shrimp. I cut the chicken into bite sized pieces and they cooked fine (( checked the internal temperature to make sure). I warmed the sauce a bit because I didn't want to cool down the food. Because of this, I had to add a bit of milk to the sauce to loosen it back up. I definitely needed a lot more oil than the recipe called for but that was okay. It sounds like I changed a lot of things but not really. This recipe is good as it is, these were just my preferences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "katgaskins"
},
"reviewBody": "The batter comes out very pasty, and it's hard to get it to stick to the shrimp. I had to add a little water to it. My family really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "Tasted just like the restaurant delicious my family keeps asking me to make it again! I did not have the type of flour listed so I used corn starch like another reviewer suggested and it turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwendolyn"
},
"reviewBody": "I agree with the positive reviews submitted by others, Excellent!!\n\nI used coconut flour instead.\n\nDue to having been legal mandatory self isolation, I did not do the walnuts However, I have since been cleared and will purchase the walnuts for next time.\nYes, I plan to make this again; especially for a family dinner event \n\nSo easy, quick and delicious!!\n\nThank You!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizomaha"
},
"reviewBody": "Very good. I did not have the special flour so I substituted corn starch. Worked just fine. The only thing I did not care for was the walnuts. They did not turn out candied, they were soggy. Next time I will try a different walnut recipe. Otherwise it was really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nussa"
},
"reviewBody": "Excellent,only change I made is I doubled the sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loriaprn"
},
"reviewBody": "My family loved this recipe! My kids don't eat shrimp, so I cut some chicken breasts in to cubes and then followed the recipe. I didn't have rice flour so I substituted with 2 tablespoons of corn starch to every cup of all purpose flour. Recipe turned out perfect! Can't wait to share this with others! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mckenna white"
},
"reviewBody": "This recipe is awesome! Just make sure that you fry it all the way through, and don't let the shrimp touch in the oil or they will stick together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "M Effin Logue"
},
"reviewBody": "This was really bad. Really bad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheEnglishDog"
},
"reviewBody": "This was different but really great! I didn't have rice flour but one reviewer mentioned switching it with cornstarch and it seemed to work just fine! I will def make this again. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn Jacoby"
},
"reviewBody": "Loved it, wouldn’t change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jun"
},
"reviewBody": "I loved this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jun"
},
"reviewBody": "I loved this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvs2cook"
},
"reviewBody": "definitely a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Bowman"
},
"reviewBody": "Followed the recipe 100%. Make sure you use fresh walnuts. I used what I had in the pantry and they may have been a little stale. Would definitely serve this meal with guests. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlotte “Char D.” Dominguez"
},
"reviewBody": "It tasted good but the cornstarch did not stick to the shrimp when I was frying it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Billiot Stage"
},
"reviewBody": "Easy to make and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Very delicious and very clean tasting! A lot less breaded than Panda Express and a lot more refreshing! At the same time, it tastes very high quality and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tlechien"
},
"reviewBody": "This is a recipe that my husband, Sister, Friends and I get every time we go to a certain mandarin restaurant. Well, this is the exact recipe! It is so delicious. I did buy the rice flour, and it’s not cheap, so one reviewer said they used cornstarch instead. I wish I would have read that and it would have saved me some $. Thank you for this great recipe. Try it, you won’t even be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillayn"
},
"reviewBody": "We really enjoyed this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joanc"
},
"reviewBody": "Came out great,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hopeful100"
},
"reviewBody": "This tastes better than some restaurants!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveMexiFood"
},
"reviewBody": "Wasn’t sure whether to use raw or cooked shrimp. Used cook it was good, but probably should of used raw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gretch"
},
"reviewBody": "Whoops! In my review a few minutes ago, I neglected to say I didn't have the canned milk, so it was left out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rmilburn"
},
"reviewBody": "Very good! We cut the sweetness a little. Liked the crunchy gluten-free covering and sweet sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Bratkowski"
},
"reviewBody": "This recipe was exactly what I was looking for. I had my doubts about the batter because it coated the shrimp very thickly, but once it fried in oil, it was actually perfect! My family really enjoyed it. Next time I will try it with actual walnut halves to make it look pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanaortiz"
},
"reviewBody": "Absolutely love it made it for my birthday dinner delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'inTX"
},
"reviewBody": "I can’t believe how easy this was to make!! And it is delicious!! I added chili powder to the sauce and I couldn’t have been happier with it. I’m getting seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Starnes"
},
"reviewBody": "My husband loves this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "staceynutz"
},
"reviewBody": "2 stars for the recipe overall, the sauce kind of was a transition from honey sweetness to extreme mayo. So I made several alterations to the sauce and it ended up being a meal everyone enjoyed! We would definitely make this again but change up the sauce (I added sugar, soy sauce, and orange sauce)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl C"
},
"reviewBody": "Made this recipe a while back for Thanksgiving and it was a hit with the family! Tastes as authentic as what’s served at the Chinese restaurants! My only gripe would be that it took me an hour and a half, but it was my first time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "De Phillips"
},
"reviewBody": "So good and so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer A Susman"
},
"reviewBody": "Very easy recipe. Followed instructions provided except I substituted chicken for the shrimp. Love the lightness of this batter, I’ll be incorporating it into other dishes as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Weber"
},
"reviewBody": "Very good recipe. Did not have rice flour so I put enough panko in my mini food processor to come up with allocated amount needed and it came out great. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie H"
},
"reviewBody": "It was phenomenal. It's easy and fast to make. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Baker"
},
"reviewBody": "I can agree it's really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Snowden"
},
"reviewBody": "My new favorite! Easy, tasty, and everyone loves it!\nNo changes needed, trust me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dsmithad"
},
"reviewBody": "This recipe was easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heatherladner"
},
"reviewBody": "i did not use cornstarch i had my husband pick up the mochiko from the asian market. this was yummy. i will make it again. it was even good the next day even though its not chrunchy anymore. the flavore was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda Terracciano"
},
"reviewBody": "I wasn't thrilled with this recipe. Had to add another egg white in order to be able to apply batter to the shrimp. Not nearly enough sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joshua Sims"
},
"reviewBody": "This recipe is FANTASTIC exactly how it is. You can use regular ground rice flour, available at most grocery stores in the department where the \"Bob's Red Mill\" flours and grits are. We always make this with steamed broccoli. Family and friends line up for this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ro"
},
"reviewBody": "I must say that I was thrilled with the results of this recipe. I have had this dish in a little restaurant near home and it has been one of my favorites for a long time. I can not have gluten and it is gluten free. My other half was thrilled also, he keeps reminding me to make it again...you can bet I will."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RitaB"
},
"reviewBody": "This was oh so yummy and oh so easy. Big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Cardines Febre"
},
"reviewBody": "I used black tiger shrimp for this recipe. It was delicious on it's own - dipped in the mochiko batter. It was a hit with the kiddos. I'm glad I stumbled upon this recipe. I no longer have to buy the high priced honey walnut shrimp at Chinese restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dan leary"
},
"reviewBody": "I love the blend of flavors. I made substitutions but will make it again with the called for ingredients. One problem I encountered was I blanched and shocked the shrimp and did not take that out of cooking time so my shrimp was a bit tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Wonderful and so easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOANL728"
},
"reviewBody": "I couldn't find the flour specified so I subbed corn starch. I also doubled the sauce. Excellent taste. The candied walnuts were easy to make. Definitely saved this recipe for future meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Elliott"
},
"reviewBody": "My husband raved about this dish...said it was the best shrimp he's ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacob Nyman"
},
"reviewBody": "Made this with lobster instead of shrimp. Simply cut up some lobster tails into bite size pieces. Also I added about a tablespoon of rice wine vinegar to the sauce. This cuts a little of the fatty texture from the mayo and addd a bit of a zip to it. All in all great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigDreamer"
},
"reviewBody": "Delicious, just like the restaurant only better! I had to add 2 extra egg whites to get the right consistency to the batter, and it was a bit messy, but MAN!!! Yum! The walnut candying seems to be unnecessary, next time I'll try it without that step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben Hanna"
},
"reviewBody": "I substituted the rice flour for cornstarch and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott D Moore"
},
"reviewBody": "Recipe was easy...I did use the glutinous rice flour which made for a nice texture. If your store doesn’t offer many varieties of flour I suggest cornstarch. I bought candied pecans instead and just toasted them in oil with shallots. I also added more mayonnaise and honey...the sweet condensed milk is really the key for this recipe. Don’t skimp on a cheap can. All in all an excellent version of this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D"
},
"reviewBody": "Easy and delicious! I used regular flour instead of machiko. This shrimp tastes as good as from my favorite restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMm"
},
"reviewBody": "Couldn't find mochiko locally and I live 90 miles away from stores that carry it. So I substituted Krusteaz Gluten Free flour in the batter. It worked well maybe not quite as sweet as the mochiko would have been. But the family loved it. So quick and easy. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christopher R. Clarke"
},
"reviewBody": "Followed the recipe and Loved the results. The only change I made was that I candied the walnuts with maple syrup instead of white sugar. Better for you and better taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laura Thomas"
},
"reviewBody": "This was like eating a bowl of gooey sugar. WAY too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "This is really good! My husband really enjoyed this and he's a very picky eater! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNN39SCAF"
},
"reviewBody": "to die for good.i used coconut milk in place of the sweetened condensed since that's what I had on hand. served over brown rice. soo good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momof3beautifulbabies89"
},
"reviewBody": "Best honey walnut shrimp I've ever had! Followed recipe exactly! Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tenshi0019"
},
"reviewBody": "Better than what I've had at most restaurants! I shared this recipe with my mom and the whole family loved it when she cooked it too! Use the ingredients it calls for...corn starch doesn't taste as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arely castanon"
},
"reviewBody": "Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "We love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Kennedy"
},
"reviewBody": "Tastes like I get in restaurants, I think it needs more batter but overall it's great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CatC"
},
"reviewBody": "My husband loved this recipe! I used half GF flour and half cornstarch for the breading and it turned out really good. So simple and easy to make. Will defiantly be making again. Thanks for sharing this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/93234/honey-walnut-shrimp/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
"name": "Seafood Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13292/main-dish/seafood/shrimp/",
"name": "Shrimp"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/93234/honey-walnut-shrimp/",
"name": "Honey Walnut Shrimp"
}
}
]
}
}
, "about": [
]
}
]