				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Hot Pepper Jelly"
,"datePublished": "1999-09-08T20:06:22.000-04:00"
,"dateModified": "2022-07-14T15:48:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Wendy"
,"url": "https://www.allrecipes.com/cook/4798"
}
]
,"description": "This hot pepper jelly recipe makes 6 jars — great for festive gift-giving! The jelly is a deliciously spicy treat on crackers with cream cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fvLxi0mGEe4Qep2YusFuQ8xrBIQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/444650-hot-pepper-jelly-cudda69-1x1-1-14c52c0a227142419508736338442397.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2421681824001",
"description": "See how to make a spicy red and green bell pepper jelly.",
"duration": "PT1M43S",
"name": "How to Make Hot Pepper Jelly",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ddced1b9-1b92-4e3d-b87b-e52af4b0a3c1/d7259a52-b4bd-4dbf-924c-afbb0b040fab/1280x720/match/image.jpg",
"uploadDate": "2021-07-07T16:02:12.091-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Hot Pepper Jelly"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "348"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "89 kcal"
,"carbohydrateContent": "23 g"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"sodiumContent": "3 mg"
,"sugarContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2.5 cups finely chopped red bell peppers",
"1.25 cups finely chopped green bell peppers",
"0.25 cup finely chopped jalapeno peppers",
"1 cup apple cider vinegar",
"1 (1.75 ounce) package powdered pectin",
"5 cups white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sterilize six 8-ounce canning jars and lids according to the manufacturer&#39;s instructions. Heat water in a hot water canner."
} ,{
"@type": "HowToStep"
,"text": "Place bell peppers and jalapeño peppers in a large saucepan over high heat; stir in vinegar and fruit pectin. Bring to a rolling boil, stirring constantly. Stir in sugar; bring back to a rolling boil, stirring constantly. Allow to boil for 1 minute, then remove from the heat and skim any foam off the top."
} ,{
"@type": "HowToStep"
,"text": "Quickly ladle jelly into sterile jars, filling to within 1/4-inch of the tops. Cover with flat lids and screw on rings tightly."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fvLxi0mGEe4Qep2YusFuQ8xrBIQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/444650-hot-pepper-jelly-cudda69-1x1-1-14c52c0a227142419508736338442397.jpg"
}
]
,"text": "Place jars in the rack and slowly lower jars into the canner. The water should cover the jars completely and should be hot but not boiling. Bring water to a boil; cover the canner and process for 5 minutes."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ray Hines"
},
"reviewBody": "If I rate this for myself it would be a 2 or 3-star, If I rate for my wife, it would be 5-star. She does not like heat and I do not like sweet. I cut back the sugar to 4-1/2 cups and the vinegar to 7/8 cup (based on comments about too much liquid and issues with not setting up). I used 2 HUGE red bells and one HUGE yellow bell. Green bells are unripe peppers and too bitter for me so I never use those. I also added 1 large jalapeno and 1 serrano pepper to hopefully elevate the heat. Seeds were removed from all peppers because with me, seeds do not belong in a jelly. Even though I cut back on the sugar this jelly is entirely too sweet for me and the heat was not there at all (zero). Meanwhile, I'm disappointed, my wife has already gone through an entire jar herself in 2 days (we got an 8 half pint jar yield, not 6). The jelly has still not set after 2 days. I will make a variation of this again, but I will double or triple the amount of jalapeno and serrano peppers. I will also cut back on the sugar at least another additional 1/2 - 3/4 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta"
},
"reviewBody": "The recipe was great, but if you like heat 1/4 cup does nothing. I put in 1/2 cup and wished I had put in 1 cup. I know the heat in the jalapenos varies but I will still use 1 cup next time. Great recipe in general."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I looked at many recipes before deciding to give this one a try and I am so glad I did. The only changes I made was 3 1/2 cups combination of red/ yellow/ orange bell peppers and 1/2 cup jalapeno peppers. We like the heat. I did use a thermometer after adding the sugar and boiled to 220- degrees. It set up beautifully and was thick enough while filling jars to have the peppers dispersed nicely. The taste is amazing! Wonderful recipe. I really think getting to a true rolling boil and using a thermometer is the key! Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been canning for 50 years and lost my recipe a couple of years ago. This one is perfect. Unlike many jellies and preserves, pepper jelly is supposed to be a soft set product. It does take a few days to set so be patient. To update this recipe to current USDA standards process the jars for 10 minutes. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "In my 2nd batch, I added drained crushed pineapple to make it quit all going to the top and stay down all the way to the bottom, and the peppers stayed with the crushed pineapple!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added 3 Tbs of fresh rosemary with the peppers and substituted the juice of 1 lime then filled the measuring cup with the apple cider vinegar. Amazing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My first batch was super runny. I finally figured out that adding 1 more tbls of powdered pectin and watching closely while it boils makes all the difference. Don’t let it get too hot for too long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Worst recipe I have tried in years. The jelly doesn't set. The flavor is pure vinegar. I had to re-open all my jars and re-cook it all. I had to add an entire second box of pectin and 3 cups of sugar just to get a jelly that tastes like hummingbird food. Run from this recipe. Fast and far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenniferclayton18gmailcom"
},
"reviewBody": "I used a food processor to coarsely chop the peppers and followed the rest of the directions for processing. Looks amazing and husband approved the taste! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Atkins"
},
"reviewBody": "I haven’t tasted it yet, so I’ll update as soon as I do. The process was super simple and the instructions were clear and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greyhoundmom4"
},
"reviewBody": "The recipe has been one that I have made several times over the years and just decided to post a picture today. I followed the directions for cooking as stated. I did have some license with the peppers. I used 1 cup green pepper, 4 large jalapeño peppers and 2 habanero peppers. Just enough of a bite and the sweet balances it perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri417"
},
"reviewBody": "I've made this several times in the last couple of weeks and it is absolutely delicious! So easy to make! I did add 1 1/2 boxes of pectin to get it to set up a little more because we wanted it a little thicker, but 1 box works just as well. I used jalapenos and habanero to give it just a little more kick. I got 7-8 8 oz. jars for each batch. This jelly is absolutely amazing!! This is now my go-to recipe for Hot Pepper Jelly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angeleyes4764"
},
"reviewBody": "How long does it take for it to set the lids are sealing I hear them popping this is my first time canning so just wondering how long before it's jelly eatin time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jmd19631112"
},
"reviewBody": "This was my first try and it came out pretty good. I added 3/4 c of the vinegar instead of a 1 c because of what the others said about it not setting right. So I suggest trying this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brmach17"
},
"reviewBody": "I've made this recipe several times. The flavor is great and I have not had any issues with runny jelly. The only time I had problems with consistency was when I doubled the pectin as others suggested. The jelly started setting up in the pot before I could even finish filling the jars. It was rubbery. I have found the recipe to be fine as it is written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "talorcher"
},
"reviewBody": "Don't forget to take the seeds out. And use gloves. Great recipe, I did add a bit of garlic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eliza7227"
},
"reviewBody": "This is a great recipe which I will definitely make again. As noted by others, it took a few days for the contents to 'settle down'. Turning the jars periodically after they cooled help distributed the solids. The taste is terrific, but if you like heat, I suggest you double the amount of jalapeno pepper. Flavor intensifies with time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hedy Williams"
},
"reviewBody": "Great recipe! I fell in love with this stuff in Albuquerque a few years ago. I used home grown jalopenos and green peppers from the store. I chopped the peppers in my mini chopper and squeezed out excess liquid with a paper towel (there was a lot!). It seems to be setting up well, although the jars are still hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BRANDY mATA"
},
"reviewBody": "I used 2 boxes of pectin to set"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momof2"
},
"reviewBody": "Yummy! I'm giving it 4 stars because I think it needs more pectin. with 1.5 packs and it's a 5 star recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judy rupert"
},
"reviewBody": "Made 7 jelly jars, used 2+ red peppers, 1 green, 1 jalapeño. Sort of completed the green pepper required with the jalapeño. Followed others direction and hard boil for 1 2/3 minute rather than the 1 as listed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karma"
},
"reviewBody": "Absolutely ADDICTIVE!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ragin Cajun"
},
"reviewBody": "Very good I added blackberries !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxane Liko"
},
"reviewBody": "I've made this several times with slightly different results each time. I believe the batch I've just completed is the best so far. I've always just used whatever peppers I have on hand totalling 4 cups which include approximately 10 to 12 jalapeno peppers. I've read several comments about adding more pectin to obtain the correct consistency as 1 minute cook time is not sufficient. I just boil it for 10 minutes instead and it's the perfect consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wood-Cox"
},
"reviewBody": "I used smoked Anaheim peppers instead of Jalapeños. Otherwise I made as written. The flavors were amazing and the consistency was spot on. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Holmes"
},
"reviewBody": "Everybody that I give this jelly loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deb R"
},
"reviewBody": "I've made this recipe twice, I'm really struggling on how to review it because if you follow the instructions exactly, you will have a very runny, runny pepper jelly. It is, however, extremely tasty. The taste is bang on!!! If you add extra pectin, it will turn out. Hopefully, this recipe gets changed to include additional pectin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha"
},
"reviewBody": "Delicious! Mine set up fine. Nice and thick, I used the inverted method, and it set fine. I made mine with a kick, delicious, but pretty hot. I used the ingredient formula as originally posted, although I changed the pepper ratio. Using the 4c pepper, 1c apple cider vinegar, 5c sugar and 1 pack of Sure Gell. However, I used 1c each bell pepper, Jalapeno and Red Cayenne; 1/2c each Hungary wax and Habanero. Hand cut or chopped. I actually cut my hot peppers two days ago, and they were resting in the refrigerator (I make hot sauce), until I could pick up some pectin. I did measure the peppers into a bowl with paper towels to absorb any excess liquid. I read page after page of reviews, forming a game plan as this was my first pepper jelly. I followed the instructions with the peppers and vinegar first, a few minutes on high then added the pectin, cooking that to a rolling boil, and boiled about 2 more minutes. It totally looks like it will never work, as someone else had mentioned. I added the sugar and brought that to a rolling boil, I then cooked that for 2-3 minutes (after reading reviews to cook it longer), I could see it getting thicker, like pudding does. It only made 5 -8oz jars, I believe cooking it longer, and hand chopping vs food processor varies the actual amount of peppers. I used the inverted method and just have to run warm water over the jars to release the jelly as it set quite hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmh"
},
"reviewBody": "Instead of read and green bell peppers I used all red peppers plus the jalapeno peppers. I was concerned, based on other reviews, that it wouldn't set so I did make sure to let it go to a full rolling boil each time and I boiled for 2 minutes after the addition of sugar. All 32 jars I made set just fine. This is a great recipe and has just enough heat. Thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ophelia Rye"
},
"reviewBody": "Recipe turned out great!! Will definitely be making again. Took other reviewers suggestions and made sure to boil peppers and pectin for two full minutes and then added the sugar and boiled for one minute. Also make sugar it is a rolling boil. Loved it but not really hot will add more jalapeños next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Smith"
},
"reviewBody": "I used red jalapeños. And substituted green bell peppers for chopped cranberries. Beautiful red jelly and tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna20"
},
"reviewBody": "Used this recipe several times in the past and always comes out perfect. In reading other reviews, people were stating that the preserves didn't set. Here is the solution to that. \nWhenever I make preserves I always prepare the fruit or in this case peppers, measure them and put them in a colander to drain for a minimum of 45 min. I make sure to catch the liquid which I then use and only add enough vinegar to make 1 cup.\nGive this a try and I'll bet you'll have better results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Proscia"
},
"reviewBody": "I used 1/2 recipe for two jars, reduced sugar to 2 cups instead of 2-1/2. Used 1/2 package of Surejell for reduced sugar and only hot peppers. No bell peppers. Growing more peppers to make it again. Perfect consistency and great taste, just not hot enough..Some cayennes, some cherry bomb peppers and mostly jalapeños. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "My husband loved this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Crisp"
},
"reviewBody": "This is the same recipe that I have known since my Grandmother made it more than a century ago. I lost my copy of this recipe more than 40 years ago but I am back in business know!! GREAT recipe. I do not know how or why those commenters had problems with the consistency, may just did not follow the direction well enough. It is perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Kiefer"
},
"reviewBody": "It's GREAT &amp; I give it 5 stars out if5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sister hedges"
},
"reviewBody": "Tastes delish and went so set, we have8 jars 8 oz each. I used 1.5 boxes of pectin......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stephanie Bernard Young"
},
"reviewBody": "It's OK and easy. I'll buy store brand next time. Way less trouble same or better taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jodi"
},
"reviewBody": "Didnt really change it much - tried adding more jalapenos to second batch to make it have more heat, flavor is wonderful, but getting heat amount right might take more practice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A word of advise. When chopping hot peppers wear plastic/rubber gloves! AND don’t touch lips, eyes or scratch your nose or any other body part. I made this mistake and paid the price. Use 2 pectins and verify “use by” date."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Robison Poucher"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan Abey"
},
"reviewBody": "Made this twice. The both times I followed the instructions as written. \n\nThe first time, I canned in 4 ounce jars and it turned out perfect. Was very happy since it was my first time making pepper jelly. \n\nThe second time, inhad a hard time with it forming up so I reheated (before processing it) and added a 2nd box of pectin and it formed right up. \n\nVery happy and can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skeetermig "
},
"reviewBody": "Very good for holidays"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathy Mamlok"
},
"reviewBody": "I agree with the first reviewer... way too loose with only 1 pectin packet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brandi Reeves Greenberg"
},
"reviewBody": "I saw all the reviews about not setting up so I used a thermometer and made sure it got to 220 degrees Fahrenheit and kept it there for a minute before pulling to fill jars. I did use Hoosier Hill Farm fruit pectin and it set perfectly. I used 2 cups red bell peppers, 2 cups jalapeno peppers, the taste was perfect for me, but my DH could have used more heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynne"
},
"reviewBody": "Made two batches of this jelly today. I had no problem with it setting properly. I diced my peppers small. And used sure jel powdered pectin. There is a little bit of a kick from the vinegar but that just adds to the flavor and gives it a bit of a bite which is delicious with the warmth of the peppers. You can use this to make an awesome cream cheese dip. Also love it as a ham glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "We loved it!! Thanks for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Phyllis Altieri"
},
"reviewBody": "So, this was my first attempt at any sort of jelly, jam, etc. I was expecting the jelly, once cooled, to be a bit firmer in the jar. For my recipe I used homegrown Poblanos, Jalapenos, Italian Hot, and Cubanelles. It was just at 5 cups largely chopped, but reduced to about 3 cups once finely chopped. That's where this recipe needs clarification."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve C"
},
"reviewBody": "I put a mix of peppers from my garden and added 3 green peppers to get to 4 cups. Seeded too many peppers so heat was not there like I would have wanted. Put them in a Ninja and pulsed until all was well ground to about 1/4 or less inch pieces. Put it in cheese cloth and squeezed out all the liquid, left in a colander overnight. Followed these directions , did the Sure-Jell, to a boil, added 4 1/2 cups of the sugar and let it boil for 2 minutes then off the heat, canned and water bath. Turned out excellent and jelled. I had added 4 cloves of garlic and a teaspoon of all spice but did not notice it. Will do this again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "Not sure if I will do this one again, flavor good but not great. Did not st up, had to re boil and add another box and a half of pecton . That did make it set. Its not hard to make but I think if I did it again I may try 1/2 vinegar and 1\\2 lemon instead of 1 cup vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Noma Baird Gardipee"
},
"reviewBody": "Looks pretty, in sealers now. Wish you had given an ammount. I got 7 1/2 pints. Had hot chilli peppers and not as hot as jalpenos,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Warner"
},
"reviewBody": "This jelly is amazing! I doubled the recipe since I was making enough to give away for gifts and here are the amounts that I used:\n-6 cups green bell pepper, chopped fine\n-2 cups jalapenos, chopped fine\n-2 cups apple cider vinegar\n-2 packages (1.75 oz) powdered pectin (I used Sure Jell)\n-10 cups white sugar\n\n1 - Mix chopped bell peppers, jalapenos, apple cider vinegar and sure jell in large pot over HIGH heat.\n2 - When it reaches a boil, BOIL for 3 minutes.\n3 - Mix in sugar and continue to stir until sugar is melted.\n4 - Bring to a rolling boil and continue stirring for 3 minutes. Remove from heat and set aside.\n5 - Ladle jelly into jars. leaving 1/4 inch head space.\n6 - Process jars for 10 minutes in hot boiling water bath.\n7 - Cool jars overnight on counter and label.\n8-Store in cool, dry place for up to 1 year.\n\nMakes approximately 12 (1/2 pint) jars.\n\nIf following this recipe. . .make sure you use Sure Jell. . .because despite what the other reviews say. . .MY jelly turned out BEAUTIFULLY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrocodileDawnD"
},
"reviewBody": "This sweet heat pepper jelly is fantastic! I followed the others' suggestions and used two boxes of pectin. I used a mandoline to slice the peppers small. After cooking for about 10 minutes in the cider vinegar, I pureed the peppers, but left some of the sliced (white) hot peppers aside and added towards the end of cooking to give the jelly a little texture. CAME OUT ABSOLUTELY FANTASTIC!!! THANKS ALLRECIPIES and REVIEWERS!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Bailey-Fletcher"
},
"reviewBody": "I also doubled the pectin. One batch jalapeño and one batch cayenne, as my cayenne plants have gone crazy this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tenn cook"
},
"reviewBody": "I made this with a variety of peppers, hot and sweet, from my garden. It tastes great, and the recipe worked just as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Hoover"
},
"reviewBody": "After reviewing some of the comments, I was worried it would not set up. As I fine-chopped the peppers by hand I put them in a colander to drain off excess juice. Once I added the sugar and brought it to a boil, I let it boil hard on high heat while stirring constantly for two minutes. Steamy! Once in the jars with lids tight, I boiled submerged for ten minutes. Let set up overnight. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "helen"
},
"reviewBody": "I read the other reviews and stuck with the recipe as called for. After chopping the peppers I did squeeze all the moisture out that I was able too. I also let it boil rapidly after adding the sugar for several minutes. I’m not a fan of spicy so I enjoyed the lack of heat but would add more heat the next time. Will try again with differing combination of peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Rease Lewis"
},
"reviewBody": "I used cranberry jello. This will do well with stuffing and a favorite meat. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David Morrison"
},
"reviewBody": "I followed this recipe to the letter and only got two 8oz jars worth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Randy Smith"
},
"reviewBody": "requested by friends and family all year. I've also changed the recipe occasionally to include whatever fruit is in season - peaches, apricots, berries, etc. DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Guzauskas Ruby"
},
"reviewBody": "I used only green bell peppers and jalapeños. Followed rest of recipe and jelly set up while still warm! The next time I food-processed 12 jalapeños (seeds and veins), one large yellow bell pepper (no seeds) in 1 1/2 cups of apple cider vinegar for 5 minutes then strained in a pot. I boiled the liquid for about 10 minutes until I got down to 2 cups of liquid. I then dissolved the pectin powder and used only 4 cups of sugar to get 7 X 4-ounce jars of jelly. Got a nice pale-green jelly that starts out tasting sweet then got a surprising after burn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gayleen"
},
"reviewBody": "Because of all the sugar I should have realized it would be mostly sweet using sweet peppers. It was very good but next time I will use all hot peppers as my family likes a kick. The review said \"spicy treat\" so I expected some spice &amp; there was none following the recipe but it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leigh Sitler"
},
"reviewBody": "I made this this afternoon - still waiting for it to set. It seemed a bit thin, but after reading other reviews, I will be patient and wait. I have a half a jar in the fridge (now) that set up on the counter just fine. Also should note, I filled 4 jars worth, then had to wait to fill 2 more. The four I filled right away have the pepper pieces floating near the top, but the two jars that sat in the pot a bit until I had room, those have the pepper pieces evenly dispersed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth White"
},
"reviewBody": "I just made this recipe today. Peper Jelly is the only thing I can every year. With that said, I used this recipe because it called for powdered pectin and I normally use liquid pectin. I have never used powdered pectin until today. \nOf course I changed a few things...First of all, I used only jalapeno pepper, 2lbs. I removed most of the seeds but left some for a little heat. Next, put all the peppers in my food processor with half the vinegar. Then I added the pepper mixture to my large stock pot with the remaining vinegar and added one box, 1.75 oz, of the powder pectin. The rest of the recipe I followed to the \"T\" with the exception of doubling the other ingredients...WITH THE EXPECTATION IF THE PECTIN...I only used the 1.75 oz box. I have read that some other users cant get their jelly to set. Mine worked perfect! I think the key that might be getting missed is that when you add the sugar, make sure it returns to a full boil. It takes a little while for the mixture to return to a boil. DO NOT add the sugar and let it sit for one minute...get it back to boiling. Considering that I doubled the recipe but used a single recipe amount of pectin and it worked...I think this recipe is great! I think I actually like the powder form better then the liquid. This jelly is delicious with some cream cheese and crackers. It's a great appetizer to have for the holidays when you have guests over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamzsrt04"
},
"reviewBody": "I added some extra jalapeño because I like a little more spice have made other versions of this very good on meat as well as cream cheese an crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ginny Staggs"
},
"reviewBody": "Why is the rating on this recipe so high? Just like most of the rest of the reviewers, there is not enough pectin and there is very little hot pepper flavor. I had to open up all of those jars and make over. That's what i get for looking at ratings and not reading the reviews. Please fix this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Miller"
},
"reviewBody": "i made this jelly use a little less peppers but added some strawberries it is wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Scriver-Kenel"
},
"reviewBody": "Delicious, but did not set up to a jelly consistency. I have been using as a sauce ...for everything! Used it over baked chicken legs and even marinated sliced strawberries in it and spooned them over slices of cheesecake. Will double up on the pectin for the rest of the batches I make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Montana mom"
},
"reviewBody": "Didn’t set properly. \n\nI make a TON of jam/jelly and never have this problem. Next time I’ll increase pectin quantity."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sooze"
},
"reviewBody": "Quick Tips/Notes:\n\n• Utilize whatever mix/match of peppers you have. \n• Cut off tops of peppers, basic deseeding and rough chop before food processor\n• Utilize food processor - measure peppers after chopping\n• Can be doubled for 12-jar batch\n\nQuite good - forgiving. Don't be afraid to use whatever garden peppers you have on hand. YO"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Bowman Hunt"
},
"reviewBody": "Perfect. I followed another reviewer's suggestion and chopped the peppers by hand instead of in a food processor and it jelled perfectly. This is a very sweet jelly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitty Katt"
},
"reviewBody": "Had to make a few tweaks with bell pepper vs jalapeño pepper ratio but all came out well. Did not put any seeds in for the faint of heart so is mild."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChristyT"
},
"reviewBody": "I probably should have seeded the jalapenos-it's a bit spicy but I can serve it w/ice cream or over brie/goat cheese/cream cheese. Recipe was very easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gema"
},
"reviewBody": "This is a terrible recipe. Way too much red and green peppers. That is all you can taste. The only change I made I increased the jalapeños from 1/4 cup to 1/2 cup. All I taste is the red &amp; green bell peppers. No heat at all. I will look for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eowyn"
},
"reviewBody": "I have made this a couple of times this winter -- my husband keeps asking for cornbread and then wiping out my stock of pepper jelly. I did have to make some changes... I increase the volume of bell peppers and cider a little , strain the solids through cheesecloth after they have simmered for about 20 minutes and use 6 oz. of liquid pectin. I also add 1/8 tsp. crushed red pepper flakes to each jar before I fill them. It sets beautifully and boy, is it good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brie"
},
"reviewBody": "I tried this recipe and it worked great for me! It’s not as spicy as I’d like it to be so I’m making another batch this weekend and adding more jalopeno. I didn’t have any issues with consistency as others have mentioned. I boiled it longer than the suggested time frame in the recipe so maybe that made the difference.\n\nDefinitely a keeper recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jankubie5"
},
"reviewBody": "I used a package of powdered pectin to a doubled recipe. Turned out great, I had help with the chopping of the vegetables, so that helped. The only thing I’d change is to cook the vegetables a bit longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzylou"
},
"reviewBody": "I used the amount of peppers called for. I doubled the pectin amount. I used Ball brand pectin on the first batch and it set well, but the peppers stayed more to the top of my jars. On the second batch, I used Sure Jell Premium pectin (yellow box) and the peppers distributed evenly in the jars. Again, I doubled the pectin amount and it set well. I am a beginner to canning and it was my first try at pepper jelly! Very pleased and got great reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teisha"
},
"reviewBody": "works perfect! the key is to know and understand that you must come to a rolling boil!! twice! rolling means when you go to stir it , it doesnt stop bubbling at all. after the sugar is added you must bring it back up to boiling. And be sure to measure well. \nthe beauty of this simply recipe is that you can go with different peppers, as i did. I can make it super hot or incredibly mild to basically no heat at all. As long as you keep the correct measurment. Happy cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Stewart"
},
"reviewBody": "I made it with a variety of peppers. Syrian black finger peppers, Trinidad scorpions, habanero, corno de Toro, and Jimmy nardelo . Very nice. It isn't as hot as the peppers you add. It captures the flavor of them yet not all of the heat . I ate a half jar of it when it was cooled. I'm making more for Xmas presents."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "penny"
},
"reviewBody": "If you have one, use a candy thermometer. If you like it firm, then boil until the temp reaches 220 degrees (jelly stage). If you like more of a sauce, then don't let the temp get that high in the final boil. I chop with a food processor and squeeze out all the excess juice first, and let the rolling boil go for at least 2 minutes in any event. I like it both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweetwater Triton"
},
"reviewBody": "I had a lot of roasted Hatch peppers that a friend gave to us. I substituted the Hatch peppers in place of the red peppers as this was the closest recipe I could find for hot pepper jelly. It's a great recipe and it worked perfectly! I am very thankful for this recipe and printed several out for future use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "So we went big the first time out with this recipe. Did 5 batches in 1 day. Next time we will be adding more jalapeño but we love spicy. Very very delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mjaz62"
},
"reviewBody": "Perfect! Set beautifully using sure-jel. I know most people eat it w/ cream cheese and crackers, but we love it on a peanut butter sandwich. If it sounds weird, think of Thai food with peanuts and hot peppers. Really yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maureen Olson"
},
"reviewBody": "I'm only giving this a three because the flavour is there. I've tried this twice now and both times the jelly did not set. Very disappointing. The first time I followed almost exactly using liquid pectin instead of dry. Today I increased the pectin to two pouches and squeezed out about half the liquid from the peppers and again it didn't set. I will try and salvage the new batch but will look for a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Conroy"
},
"reviewBody": "I love this. Just changed 1 thing. I only used 2 cups of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Cuello"
},
"reviewBody": "Followed the directions from start to finish. Gave two jars to some friends and they ate both jars in one sitting. Probably the best thing I have ever tasted"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diche"
},
"reviewBody": "The secret to this recipe is cheesecloth. You MUST drain the excess liquid from your peppers (most easily done by wrapping it in cheesecloth and squeezing the heck out of it) if you want this recipe to set up. It simply has too much water otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "I Agree with Bambi...I used 2 boxes of pectin and 4 cups sugar and it was perfect!!! I used 1/2 cup of jalapeno with mixed red and orange peppers, jelly was not overly sweet and had a nice warmth from the jalapeno...loved it......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Duval"
},
"reviewBody": "Came out perfect. Next time I will add a bit more hot pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise White Andrews"
},
"reviewBody": "This was amazing. My son-in-law said it is the best he has eaten, including at trendy restaurants! The only thing I added was about 5 small Serrano peppers (at my mother-in-law's request). I puréed the peppers and vinegar, and boiled everything except the pectin for 10 min., then added the pectin and boiled exactly 5 minutes, all suggestions from other reviewers. It set up PERFECTLY! I gave my daughter and son-in-law small jars to give away if they thought it was good. They QUICKLY passed them on to friends and asked for the recipe. Winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I think this is a great recipe! I did not drain my peppers at all. There was a little bit of juice due to dicing the peppers but it didn't seem to be a problem. I suspect that the problem people are having with it setting could be a couple of different things. One – possibly using the wrong type of pectin. There is a pectin that is intended for freezer jam and it will not work with this recipe. Two - make sure that you are bringing it to a full rolling boil that doesn't stop boiling when you stir it. Because of that you want to be sure that you are using a pot that is big enough to handle the boiling. I'll make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "preed"
},
"reviewBody": "I love the flavor of this pepper jelly! I like it hot, so I left the seeds in the jalapenos. I also prefer to use my kitchen scale to weigh the peppers before putting them in the food processor to mince, so I don't have any waste. The quantities were: \nRed bell (seeded and quartered) 500 grams; \nGreen bell (seeded and quartered) 250 grams; \nJalapeno (halved, seeds not removed) 50 grams. \nI chose to not give all five stars only because I would have liked the jelly less runny. I wonder if I had not simply allowed the mixture to come to a rolling boil for one minute and instead had let it boil until it reached 218-220 degrees F, would I have had better results. I guess I'll try that method next time. It is quite delicious and will be my go to Pepper Jelly recipe, but I will tinker with the jellying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peachy"
},
"reviewBody": "This recipe is perfect as is. Do NOT change anything unless you want more heat. Hand chopping is a huge mistake. If you watch the video you will see how finely they chop the peppers. This is how they should be chopped for a perfect texture. If you hand chop, they will be too large and float to the top of the jar. I used a food processor but didn't chop as fine because of suggestions on here. I couldn't stand the separation that happened because of not chopping them fine enough, so i did turn the jars upside down and shake after they sealed so the peppers mixed. It will appear very liquid when pouring in jars but will set up. Wait til they cool completely. Will definitely make again when this is gone and will chop FINELY."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoutherNites Doris West"
},
"reviewBody": "Yes I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "France Leclair"
},
"reviewBody": "I have made this receipe often, but with the following modifications: \n1. I add one cup of apple juice\n2. I put all the pepper, vinegar and juice in the food processor to mash it up; I prefer that sort of texture and it serves beter\n3. I use 4 cups of sugar\n4. I use 2 to 3 tbsp of pepper flakes if I cannot find hot peppers\n5. I put a whole envelop of pectin - about 2.34 oz\n6. I boil longer than one minute - more like 3 being careful it does not boil over\n7. I continue cooking at low temperature a good 5 minutes\n\nMy friends and family love it. We use it as apero on cracker and a sharp cheese like cheddar, or soft one like cream cheese. I have also served it with a brie en brioche. I have also served it with meat and fish, if the receipe allows."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "P shooter"
},
"reviewBody": "I'm not good at following directions. I used a mixture of colored peppers, more than recipe called for. 1/2 c. of jalapenos. Super easy , the only time consumer was dicing peppers. I think the problem with not setting is using regular sure jell, I used the less or no sugar version and it's perfect. The mixed colors make it so pretty. I don't know why I bothered putting it in jars because it's going to be used so quickly. My batch made 7 1/2 cups. Delicious!!! Addictive!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Jay "
},
"reviewBody": "Ok... I'm going to see if I can help some of you out that are having issues with your jelly setting up properly. (watery jelly issue)\nUsing Pectin 101... Pectin requires 3 things. Water, sugar and acid. (Many jam makers swear the order that they are combined makes a difference. (water and sugar first, then Pectin, then acid) Making JJ's (jams and jellies) requires heat to cause the pectin to create a thick consistency. IT MUST BOIL! I think the actual temp is about 215 Deg F/101 Deg C for pectin to activate properly. Like using corn starch, if you don't hit the right temp, your molecular reaction will be weak and/or fail.\nBecause JJ's are usually made with fruit that contain natural sugar, acid and pectin (yes, most fruits naturally have pectin in them) making a pepper jelly is slightly different than making a fruit concoction. It is very important you do not lower or omit sugar, acid or water. There are no substitutes (Sweet n Low, etc) \nPeppers do contain water so the type, production method and time of year they are harvested will dictate how much water is in the peppers and thus how much water will be released when they are cooked. (This affects cooking time) \nChilled spoons: Keep 1/2 a dozen tasting spoons in the freezer while you are boiling down your pepper JJ. When you think it might be ready, grab a chilled spoon, dip it in your mix and then pop it back in the freezer on a small plate for a few mins. Too watery? Keep boiling! Keep testing until the taste is balanced"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17692/hot-pepper-jelly/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
"name": "Jams and Jellies Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17692/hot-pepper-jelly/",
"name": "Hot Pepper Jelly"
}
}
]
}
}
, "about": [
]
}
]