				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Hunter Style Chicken Cacciatore"
,"datePublished": "2020-06-18T23:47:06.000-04:00"
,"dateModified": "2022-07-18T20:08:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Pam"
,"url": "https://www.allrecipes.com/cook/pam2"
}
]
,"description": "Traditional chicken alla cacciatore (&#34;hunter-style&#34; chicken) is brought to a new level with onions, peppers, mushrooms and red wine. This version gives a heartiness and warmth that will satisfy any appetite!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yYmpi-cFWBwKm7yEPlbDudAQJGo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7980013-d8e9d057439b4c259f6d471594786227.jpg",
"height": 2008,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Hunter Style Chicken Cacciatore"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "32"
}
,"cookTime": "PT95M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "655 kcal"
,"carbohydrateContent": "73 g"
,"cholesterolContent": "114 mg"
,"fiberContent": "7 g"
,"proteinContent": "40 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "598 mg"
,"sugarContent": "9 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"2 teaspoons olive oil",
"6 cloves garlic, sliced",
"2 (28 ounce) cans whole peeled plum tomatoes with juice",
"1 (6 ounce) can tomato paste",
"0.75 cup red wine",
"1 tablespoon white sugar",
"1 tablespoon dried oregano",
"1 tablespoon dried basil",
"1 teaspoon salt",
"0.5 teaspoon ground black pepper",
"2 tablespoons olive oil, divided",
"1 carrot, chopped",
"1 stalk celery, chopped",
"2 green bell peppers, cut into chunks",
"2 onions, cut into chunks",
"1 pound fresh mushrooms, sliced",
"2 eggs",
"2 cups all-purpose flour",
"0.25 cup olive oil",
"5 pounds skinless, boneless chicken pieces",
"1.5 pounds dry linguine pasta",
"0.5 cup chopped fresh parsley",
"1 tablespoon freshly shredded Parmesan cheese, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat 2 teaspoons of olive oil in a large pot over low heat, and cook and stir the garlic until tender but not browned, about 3 minutes. Pour in the tomatoes with their juice, and mash with a potato masher to leave the tomatoes in chunks. Stir in tomato paste, red wine, sugar, oregano, basil, salt, and black pepper, and mix until the tomato paste is smoothly combined into the sauce. Bring to a simmer, and cook, stirring often, while you prepare the vegetables."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 tablespoon of olive oil in a skillet over medium heat, and cook and stir the carrot and celery until tender, 5 to 8 minutes. Stir into the sauce. In the same skillet, cook and stir the green peppers and onions until the onions are translucent, 5 to 8 more minutes; mix them to the sauce. Heat 1 more tablespoon of olive oil in the skillet, and cook and stir the mushrooms until they give up their liquid, about 10 minutes; stir the mushrooms into the sauce. Allow sauce to simmer while you cook the chicken."
} ,{
"@type": "HowToStep"
,"text": "Beat the eggs in a bowl. Place the flour in a separate shallow bowl. Heat 1/4 cup of olive oil in a large skillet over medium heat. Dip chicken pieces in egg, then dredge in flour. Tap off any excess flour, and brown the chicken pieces in the hot oil until browned on both sides, about 15 minutes. Set the chicken pieces aside."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Spoon about 1 cup of the tomato sauce into the bottom of a large Dutch oven. Place the chicken pieces into the Dutch oven, and pour remaining sauce and vegetables over the chicken; cover."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the chicken is tender and no longer pink inside, about 1 hour. If sauce begins to boil harder than a simmer, reduce oven heat to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "About 15 minutes before serving time, bring a large pot of lightly salted water to a boil. Stir in the linguine pasta, bring back to a boil, and cook, stirring often, until the linguine is tender but still slightly firm, 10 to 12 minutes. Drain the pasta well."
} ,{
"@type": "HowToStep"
,"text": "Turn the linguine out onto a large platter, and top with the chicken and sauce. Sprinkle with parsley and Parmesan cheese to serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT155M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellyloiczly"
},
"reviewBody": "Very. Very good!! We’re trying to eat healthier so omitted the sugar and doubled the carrots and celery. Absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Wow does this taste amazing! It does make a lot of sauce so make for a crowd or freeze (or leftovers like us). I used the ingredient list to a T but changed the cooking instructions. I sauteed the veggies in a dutch oven. removed them, then sauteed chicken- removed it to a plate while I made the sauce. Then put everything back in the dutch oven. Saved on using extra pots/pans. This is an amazing recipe and I will make it again. I might add other veggies next time like zucchini or eggplant. I highly recommend this. My family LOVED it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ruley Moyer"
},
"reviewBody": "I’ve made this recipe several times and can’t say enough great things about it! I cook from the heart, often using additional vegetables I may have on hand, like peas or zucchini. The sauce or “gravy” is rich and hearty, the chicken moist and flavorful! We live in NJ where we have wonderful Italian bread to dip in the gravy. Bravo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat-Perry"
},
"reviewBody": "During these days of social distancing and unemployment I have been able to spend more time cooking and baking. This was a joy to make and even better consuming it! My husband said it was one of the best he has eaten! And you have no idea how fussy he is! Followed recipe exactly except for the fresh mushrooms. It was a real treat. Will email the recipe over to my neighbor who also loves to cook. Thank you and “be safe”."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "claudebo"
},
"reviewBody": "I was good, very good. Might want to cut recipe in half unless you have a family of 8"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie D"
},
"reviewBody": "I would start with the dredged chicken in the Dutch oven brown it, remove it from pan, add veggies cook till soft remove add wine scape up the bits then add tomatoes seasonings and put the chicken and veggies back in pan cook on low until chicken is done much more flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Migi"
},
"reviewBody": "I made this recipe for 40 men on retreat. Served it over linguine with a side salad. Going to make it at home for my family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this recipe for 40 men on retreat. Served it over linguine with a side salad. Going to make it at home for my family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mike bengyak"
},
"reviewBody": "it was fine eating, I always cook enough to freeze as I am old and stingy with my time. I had taken more out of the freezer to\neat tonight. so I felt a little guilty about not responding to review after you gave me such a fine meal. old man mike"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katrina"
},
"reviewBody": "This was great! I also made 1/2 but really don't like mushrooms so I omitted those and left the quantity of the other veggies the same to compensate. . Made the sauce then threw it all in a slow cooker with 6 chicken legs. Once the meat falls off the bone I deboned and cooked about 1/2 hr more. Perfect! Did not over cook and mush up the other veggies at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mimi1121"
},
"reviewBody": "This was very good. I used skinless chicken thighs and a small can of diced tomatoes and a can of puree since I did not have what was suggested. The sauce will be amazing the second time, I am sure. I served over spaghetti squash. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mpieplow"
},
"reviewBody": "I made it exactly as written and it was okay. I was looking for a heartier tasting sauce than this tirned out but it still was quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLUPICHU"
},
"reviewBody": "Great flavors! This dish has the consistency of a traditional Cacciatore, so it doesn't thicken up like a marinara (and we like that). The big change that we made was to add seasoning. First of all, the chicken must be seasoned appropriately (either the meat or the breading). Plus, the sauce needs more salt for the volume. That addition was enough to really bring out the flavors of the veggies and the meat... yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickdee"
},
"reviewBody": "Just delicious! I was hunting for an easy dinner I could prepare ahead for a relatively last minute, casual dinner for company. This was perfect! I started the sauce in the afternoon and left it covered on low, then cooked the chicken a half hour before guests arrived and popped it in the oven. All I had to do was serve a prepped salad and cook the pasta! It was well received and was asked for the recipe (well, being another AR Member, she could find it! Lol!). I Used Italian diced tomatoes, cutting back on the spices. I added more of all the veggies and used just a half a giant Vidalia. Perhaps because it simmered a while, I used a lot more red wine and added some chicken broth, as well. Easily adjusted as needed. Could have been because I used the diced instead of plum but the sauce tasted just a touch bitter to me, so I added a half teaspoon of baking soda to cut the acidity. Loved it and I look forward to making this again! Thanks, Pam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howard"
},
"reviewBody": "Fantastic! Plenty of leftovers and that is great news since it was so delicious! Next time around I will halve the recipe and use Littleforestelf's review here as a guide. I love Cacciatore and was surprised at how few recipes there were to choose from, and very surprised how few reviews this one has received. If you want a great, hearty tasting dish folks, this is the one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "Really enjoyed this dish, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Littleforestelf"
},
"reviewBody": "Family loved it! Cut the recipe in half. However, because others reviewed that the sauce cooked down, I used the regular amount of wine and tomato paste instead of halving it. Might use a bit more oregano and basil, but that's a personal seasoning preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joekat"
},
"reviewBody": "made this..excellent!! Makes ALOT.. for 2 people..used 3 ribs of celery, 2 carrots,1 onion, 1 whole chicken,cut up. In a 13 quart stock pot...(This will keep us fed for 3 to 4 days).. 1 package linguine noodles...Convection oven, 325 degrees for 1-1/2 hours... If camping,I would 1/4 the recipe to keep from going bad in the ice chest. You need a REALLY big dutch oven for the whole recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brendabeans"
},
"reviewBody": "worth the effort!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Verna Hrdlicka Hynes"
},
"reviewBody": "This was very good! My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wizardofohms"
},
"reviewBody": "Tasty and not too hard to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cass"
},
"reviewBody": "Very good. I made a half-recipe, used boneless chicken thighs and finished the cacciatore in the slow cooker (5 hours on low) instead of the oven. I thought the sauce reduced a bit too much in the simmering, so I added another splash of wine and about a half-cup of chicken broth. Always looking for recipes that I can freeze in single portions for hubby's dinner (I work nights). This fits the bill nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "In response to a review, Italian cooking is fun and wonderful because it varies from one region to another and one chef to another. There is no hard and fast rule. Most Italians cook from the heart often without a recipe! In the intro to this recipe it did state that this cacciatore was brought to a new level. In Wikipedia, it states that Cacciatore originated with rabbit. Northern Italians often use white wine, Southern Italians use red. Bell peppers according to Wikipedia can be used. To bread the chicken or not, is to the liking of the chef. This version is a delicious version. The reviewer Newton should give this a try being open mined to a new experience before limiting the rating."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/219757/hunter-style-chicken-cacciatore/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17553/main-dish/chicken/chicken-cacciatore/",
"name": "Chicken Cacciatore Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/219757/hunter-style-chicken-cacciatore/",
"name": "Hunter Style Chicken Cacciatore"
}
}
]
}
}
, "about": [
]
}
]